{
    "drublic": "`max-width` seems a good solution. `max-height` does not make sense I think because you can scroll the content-area.\nWhat do you think?\n. Closing this for now. No more support for Android 2.3.\n. Cannot reproduce this, sorry. Can you please add a video if the problem remains.\n. Merged in bb0bd269684c91d156f9fda2e3b45a77a4f5c934. Thanks!\n. This happens in all browsers, since the `has-overlay` class removes overflow-y in order to prevent the background-page from scrolling.\nWe need another solution for that where the overflow is not visible but the scrollbars are.\n\nWill look into it soon.\n. Agreed. This seems to be more of a research topic for an article.\n. Thanks @anselmh and @benschwarz!\n. This would currently need a lot of rewrite of the whole JS functionality and also add more complexity that is not needed in a lot of cases.\nIt is possible to use hashes for navigation on a page since modal.js doesn't touch the the DOM or anything if it has evaluated that the hash doesn't belong to a modal.\n\nThere might be plugins out there that have problems with interacting with hash-changes that don't belong to their \"area of acting\" but this seems to be the problem of the respective plugin rather than CSS Modal. There might also be other plugins like accordions that rely on the hash being used.\n\nOne more advantage of using hashes is that it enables deeplinking to modals which can be extremely useful.\n\nSo as a conclusion I don't bother too much at the moment to move away from using the hash where appropriate.\n\nThanks anyway for raising this issue.\n. Sounds like a good idea. I will look into the specification to find out if <dialog> is really a good decision for building modals.\n. So apparently `<dialog>` is not implemented in any browser yet. Due to @stevefaulkner's feedback on Twitter I think we will stick to `<section>` at the moment and will update as soon as there is more movement by the browsers towards `<dialog>`.\n. Good points, @Schepp. Actually I think it is worth including a short note about changing the `aria-labelledby` in the How To Markup section.\nI don't think it is necessary to include this as a JS method, users might remove the label's id anyway if they don't need them.\n. What would be the use case for multiple modals stacked over another? Currently you can switch between modals via linking to a new modal.\n. It is possible to navigate through modals with using the hash only, since at least Chrome saves this state in the history.\nThe current implementation doesn't work great with browser history. This is something we need to tackle too.\n. What would be a good way to do it? This might mean that we would have to parse the whole CSS and find the highest z-index.\nAlso if this happens automatically you cannot layer anything above the actual modal. This might be needed on smaller screens when building an app-like website.\nApart from that it is possible to set the z-index in the SCSS file as a variable.\n. Thanks man! I just published this today to get it in bower and travis. Gonna deploy the page tomorrow with the blogpost.\nThanks anyway :)\n. Here we go: http://drublic.github.io/css-modal/\nAnd a blog post: http://drublic.de/blog/introducing-css-modal/\n. The issue of jumping needs to be addressed. It's reported in #24. Thanks :)\n. Thanks, Ryan! I'll check it out.\n@benschwarz PR is always very welcome :)\n. If I invested correctly, this means we need extra markup to target each hidden div. I use this method a lot for navigations, especially on mobile where you need a toggle button for the menu to be visible or not. It is also a method that I use in a modified version for the tabbed content on the page.\nTo be honest I don't think this will work perfectly with the modals since the jumping bug originates in preventing the overflow for the content an thus prevent scrolling the content.\nI will try out some more and come up with a solution shortly.\n. And here is the solution. Pretty easy. Please let me know if you find any bugs in this fix.\nI've also added a test to prevent regression.\n. > Mainly, I have no idea why you are doing this test.\n\nGood point. I cannot remember why I included it. Basically it is not possible for a child of a modal to be targetted via hash since this would hide the modal. So it might be ok to remove the check.\n\nI will run some tests on this and check back soon!\n\nThanks for the PR.\n. @tzi, thanks for looking into this. I've now removed the check if the modal contains an ID since it is not necessary.\nThis closes the bug and we don't actually need the PR anymore :)\n. Thanks for the comment and thoughts, Patrick.\n\nThe modal is focused when opening it. Please see [this line](https://github.com/drublic/css-modal/blob/master/modal.js#L85) and the `setFocus` function in modal.js. And it works for me. Do you have problems using it?\nThis implementation doesn't include cycling through the modal though. Do you have any hint on how to enforce cycling through an element?\n\nI tried to focus back on the main page when the modal is closed [here](https://github.com/drublic/css-modal/blob/master/modal.js#L105). I might have to look into restoring the original focus state on the actual element instead of the body element which happens in Chrome.\n\nAn update for the cycling should definitely be implemented.\n. Ping @patrickhlauke. Would be awesome if you could throw some links at me :) I'd love to include it in the next version.\n. Thank you so much for this, Thomas. Great to see sees smaller issues fixed so soon.\nIt's merged in 8874a6e76945bc099d9c513d641e6ffc6c1b5e2b.\n. Mh… this looks like an issue with Firefox. Works for me at the moment, tho on my Mac. \nI just updated the gh-pages branch, which has another fix for the website. I don't really think this fixes the issue, but I will look into the Windows version of Firefox soon.\nThanks for reporting.\n. I've tested this on Firefox in Win XP and Ubuntu 12.10 now and it works perfectly for me. Which Linux distribution are you using?\nI gonna close this for now since it appears to be an edge case. Anyways it is always great to know about these.\nThank you so much for reporting the issue!\n. This might be related to #33.\n. Closed this with 928f183e18a88862f12e495926814feb60a4c323 for #33. \\o/\n. Thanks for the contribution. I've tried my best and cherry picked cross commits. It's modified in b959efc5ad62b5529aca6c8177a0ca1a0fef3d5c. Wheee!\n. It's currently hard to find a proper solution for Android and iOS that works. I will try to find a better solution for the next version.\n. Thanks for reporting. This is related to #31 and I will try to find a working solution.\n. Looks like the IE8 CSS hack influences IE9 and IE10 too.\n\n```\n// Internet Explorer 8\ndisplay: none\\9;\n\n&.is-active {\n    display: block\\9;\n}\n```\n\nI will try to work around this and find a better solution.\n. Found another solution. Please see commit message.\nThanks for the help and reporting this bug.\n. Just push the hash (ID of the modal) on load.\n\n```\nwindow.location.hash = 'the-modals-id';\n```\n\nRemember to check if another hash is already set.\n\n```\nif (!window.location.hash) {\n    window.location.hash = 'the-id';\n}\n```\n\nYou get the idea.\n. Would you guys think it makes sense to add a kind of gallery for this modal? I mean for the page only.\nShould be easy to do.\n. No worries man :) We could do this with some lines of JS but we would need all images in the proper size. I'll look into it :)\n. @matt-bailey Makes a lot of sense. Actually we had this issue before (on Twitter I think). Anyway I think gallery functionality is pretty easy doable. So I'm implementing this tonight :D\n. Nothing awesome, but it has a functionality now \\o/ Micro gallery, hehe.\nThanks again for the discussion, people.\n. Wow, thank you so much @4nduril! Great contribution.\n\nI am currently thinking of what would be the best way to include the LESS port. I am actually good with maintaining both versions. But I think it wouldn't be best to have both Sass and LESS next to each other in the main branch.\nThis is because:\n- I don't want to have both ports in the download of Bower\n- I don't want to get people confused with what to use\n\nThere are some ways to include the LESS port:\n- Use an extra branch\n- Maintain it in the main branch\n- Use an extra repository\n\nThe stuff that is currently missing to integrate the LESS port are\n- Tests\n- Grunt tasks\n\nI'd love to get some feedback to the aforementioned questions.\n\nAgain, thank you for taking the time to create this port.\n. Awesome work, @4nduril. Thanks again!\nWe now have a [`less`-branch](https://github.com/drublic/css-modal/tree/less). I will publish the less version with the 1.1.0 release I think which should be pretty soon. I will also add another Bower component `css-modal-less`.\n\nPlease let me know if you find any bugs or have more ideas on the LESS branch.\n. Yeah, sounds good to me too. Gonna test that soon and merge it.\n. Thank you so much @realmyst for checking this out. The PR is merged.\nI've had to update the addEventListener polyfill in 465daead421539fb52710d7455abbbbe6748211b in order to get the listeners working in IE 8. Hope this is everything. Guess we will get reports with the next version if otherwise. :)\n. @esanmiguelc Please see [this code](https://github.com/drublic/css-modal/blob/master/site/js/page.js#L52-L70) and check the implementation for the website. This isn't part of the modal tho.\n. Currently you can only do this by changing Sass/CSS. See [this line](https://github.com/drublic/css-modal/blob/master/modal.scss#L279).\nWe should move this text to an attribute on the close link it self I guess.\n. I'll keep this open until the data-attribute solution is in or at least researched.\n. Would suggest that too.\nYou can also use the skeleton as a JS template and replace the contents how you need them.\n. Just updated some stuff in your PR. Thanks :) It's now in!\n. Screenshot would be awesome. Sadly I don't own an iPhone 5. It works great on 4S (except the problems ok #31 and #32).\nDid you do any modifications to the modal? Code would be great too.\n. Thanks, Ben! Landed in d0648d5ac212735b8b78661b0c5038a5a2406d6f.\n. Thanks for fixing this behavior. I merged your commit in 5187b3ba514425ae01c84591f6d27505a5ace400.\n:beers: \n. Thanks! Can you please update the pull request and the SCSS file stead of the CSS file. Please also run grunt and the tests if you can. That would be great. :)\n. You can make the changes we need, then add them to the staging area with `git add *` and amend your last commit using `git commit --amend`. You can then adjust the message too (please make it more clear what you did in the message, you can even self-close this PR if you want to)… and then you need to force push to the branch you work on: `git push -f`.\n\nLet me know if you have any more questions.\n. Please see the commit in a0712dda3291255b47da9cc1cf49ec75f9fb9b77. This tackles the problem in the right area.\nIt's important to add `-webkit-overflow-scrolling` to the content area. Otherwise the modal's content isn't scrollable in some cases. I've tested this on iOS 6.\nThanks anyways for giving this a try.\n. The fix landed. Thanks :)\n. Corrected in both places. Please see 414af6f. Thanks.\n\nFor further Pull Requests: Please be aware of the project's infrastructure and read the contributing guidelines in order to get your work into the project faster. Thank you so much for considering to help this project.\n. This PR doesn't have much other thinks compared to #45 than the inclusion in SCSS.\nI'll pass on this and look to interoperate the changes in #45.\n. Thanks for the effort. Please don't send any more PR.\nI'll figure out a way to incorporate the change as already stated.\n. This isn't an update of the PR. I've outlined how it works [here](https://github.com/drublic/css-modal/pull/45#issuecomment-20196817).\n. Awesome. Thank you.\n\nPlease be aware that it gets a little bit more complicated than just copying the stuff over. Please test implementations on mobile devices aso. But you know your way around it :P\nAlso you can throw this into wip-1.1.0.\n. Wheee. Done.\n. @SantzDesign Please don't spam the issues ;) See https://github.com/drublic/css-modal/issues/79#issuecomment-29006489 for more information.\n. From #64\n\n> I've changed my mind in so for that I think the LESS port should be maintained in another repo.\n> Here are the advantages:\n> - own build status for with Travis\n> - clear separation in PRs and issues\n> - own repo registered in Bower\n> \n> Any objections?\n. @4nduril Thanks for all your work again! I've decided to not include the LESS for within this project. Please register a project yourself and try to maintain it if you need to. I'll try my best to keep up with PRs for JS changes and stuff.\nSorry about that but it's not practical to maintain two separate repositories in order to be up to date with the latest from one or the other. The technology I chose for CSS Modal is Sass and I think this is currently the best fitting tool we can get for this project.\n\nThanks again to everyone included in the discussion.\n. Finally merged this. Thanks for the work.\n. Thanks for fixing this. It's in now.\n. Awesome! Thanks so much. Wanted to do this for v1.1.0 :) Will merge this into the wip-1.1.0 branch after checking it.\nThanks again.\n. It's in now, thanks again, @fabien-d! I will try to release 1.1.0 as soon as possible.\nPlease feel free to help improve CSS Modal further :)\n. Thanks for the effort you put into this pull request. I like the idea and I think this is something we could consider for 1.1.0.\nI'll leave this unmerged for now to look into this issue myself with the current implementation and the different animation styles we'd like to include (#51).\n\nThe problem with changing the background to a filter in IE could be that there are other quirks that come with it. Also I personally don't like to rely on filters. But I will look into this again :)\n. We've applied the changes as outlined in #73 for the new structure. Thanks again for providing the idea and valuable input :)\n. You can use set a hash via JS for opening a modal. I wouldn't encourage you to do this without the user knowing about it. It might be a bit arbitrary.\n\nPlease see #34 for implementation details.\n. Yup, sounds good to me. @jhabdas Thanks, can you please use a colon and recommit this with a description what this commit does (instead of \"Update modal.scss\"). This PR will get merged into wip-1.0.0 FYI.\n. Merged this with the changes! Thank you.\n. Thanks for using CSS Modal.\nYou can use the events by subscribing to them as if they were click events or something. Here is the code:\n\n```\n$(document).on('cssmodal:show', function (event) {\n    console.log(event);\n});\n```\n\nHope that helped.\n\nOn 28.08.2013, at 01:59, Robson Junior notifications@github.com wrote:\n\n> I'm trying to call a custom function to stop my html5 video player but I don't know how to use the cssmodal:hide event.\n> \n> I'm using jQuery. Can somebody help me?\n> Thanks in advance.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Cheers! I've added an issue for that.\n. Thanks so much! I will revisit this as soon as 1.1.0 is near finalization and will update with the latest changes.\n. I've changed my mind in so for that I think the LESS port should be maintained in another repo.\nHere are the advantages:\n- own build status for with Travis\n- clear separation in PRs and issues\n- own repo registered in Bower\n\nAny objections?\n. Oh and yea… the commits are in :) Thanks!\n. Great, that you got it working now :)\n\nI will close the issue now. Please re-open it, if there is another problem with this solution.\nWe will try to document this better and add a plugin for the functionality in v1.1.0. Please also see #63.\n. Thanks so much for bringing up this issue. With #58 we will be trying to make the modal more customizable and make it easier to use it with Bower.\n\nWe could use some help with defining the customizable variables in Sass – so if you are up for it we would be very thankful.\n. Thanks for your ideas.\n\nI am not sure where we should start with this.\nMaybe a structure like this would be great:\n\n``` javascript\n|-- components\n   |-- css-modal\n      |-- _modal-config.scss\n      |-- _modal-core.scss\n      |-- _modal-theme.scss\n      |-- modal.scss\n|-- scss\n   |-- _modal-config.scss\n   |-- main.scss\n```\n\nWhile `_modal-config.scss` in `css-modal` (Bower component) holds all of the modal's default configuration, maybe with a `!default` directive (might be needed). The `_modal-config.scss` file in `scss` holds all the custom overwrites we need. We could include a template for this in the package too.\n\n`main.scss` would have the following inclusions:\n\n```\n@import 'modal-config';\n@import '../components/css-modal/modal';\n```\n\nAll configuration in the local file overwrites the global defaults.\n\nWhat do you think? Does this make sense?\n. We use \"v1.0.0\" as our \"development\" branch atm. It would be awesome if you could create a branch from there and use the existing work in #58. You can then do a PR against v1.0.0 and we will review from there. Sounds good?\n. I've added a little bit of contribution guidelines in [CONTRIBUTE.md](https://github.com/drublic/css-modal/blob/master/CONTRIBUTE.md). Which information is missing?\n. I've updated the CONTRIBUTE.md file. Thanks for the discussion and your ideas. Was applied in #73.\n. I think we should not depend on these classes atm. But we can use CSS hacks for IE8 and we can utilize these maybe.\n\nWhat's the reason to have a 16x16px background image instead of a 1x1px? Optimized it has only 2 bytes more with 90% alpha channel though. I've added this in the commit above.\n. I will close this issue for now. We don't need a perfect support for IE8 since use is more and more fading. Apart from that: We've worked on this in the commits mentioned above.\n. @anselmh Is this related to what happens in branch `plugins`?\n. @grayghostvisuals Please have a look at #133 for 2). This might also be a solution for 1).\n. A css only variant would be nice too. But you can do this by overwriting\nsome values.\n\nThis implementation is a variant for when you want to set a width which\ncomes from a CMS or another user input.\n\nOn Tue, May 27, 2014 at 7:45 PM, Dennis Gaebel notifications@github.comwrote:\n\n> if you all like it then I'm all [image: :+1:] for it.\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/drublic/css-modal/issues/68#issuecomment-44309585\n> .\n. Closing this as we've implemented one solution. Please feel free to open a new issue if you are not happy with the current result.\n. @richie-y The pages not include the modal (anymore?!).\n. Louis, you can just use the index.html file in branch wip-1.1.0. It has all modal styles we use.\n\nOn 18.09.2013, at 08:22, Louis Lazaris notifications@github.com wrote:\n\n> Sure, I'll see what I can do. If someone has a reduced test case ready, that would be nice for me to start with, but I could just strip down the JS Bin I created and go from there.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks so much for the commit! Separation LGTM at the moment but need to have a closer look.\nPlease stick to one task and one task only for each PR as Anselm said.\n\nWe haven't discussed including Grunt plugins other than we have. We don't need the tasks that you included, it's just something that is opinionated and I don't think we should add to much of this stuff in there. We could try to remove something tho…\n\n> Eventually some mixins and functions should be added to manage the complexity/prefix grossness of the transitions and animations etc. Maybe adding auto prefixer would be better suited and a more maintainable option going forward.\n\nWe don't want to add any complexity for developers. They should use it with Bower or just as a drop in, so there is no real space for prefixer or something. We had the [sass-mixins](https://github.com/drublic/Sass-Mixins) repo as dependency in the early stage of this project and this didn't proof to be a good way to integrate with existing websites.\n\nAgain, thanks for the great work. We really appreciate it :)\n. Sounds perfect :)\nIn case you didn't know: You can just update this commit via `git commit --amend` and `git push -f`.\n. Thanks for your work @grayghostvisuals. I've merged your changes into the wip-1.1.0 branch. Great stuff.\n. @anselmh I've fixed the comment.\n\n@SantzDesign Header and footer tags can be used for more than the header or footer section of the page. Please read the spec. I think we are good here.\n\nThanks for raising the issue and taking the time to look into this.\n. Legit. Thanks for the heads up.\n. It's in, but GitHub doesn't seem to recognize it. See 2ca9212c614f38e448b621c0383b20041176257e.\n. It is important this happens on mobile. At the moment I don't feel like this is a big issue but we should tackle it with 1.1.0.\n. Shipped this. Thanks, man!\n. @anselm-urban Does your bug still occur with the unstable version of CSS Modal?\n. Thanks for testing @anselmh.\n. :+1:\n. Thanks @anselmh!\n. Looks good to me :) Ship it.\n. This will be fixed with the new version. For the time being, please update the css-modal to v1.1.0-alpha.\n. Oops, sorry. The release is called `v1.1.0alpha`.\n. Closing this for now.\n. You can compile the code yourself by running `grunt sass:dist`. You can then find the file in the build directory.\nWe'll fix it.\n. Thanks for the suggestion. !default is really a cure to some evil package management brings to the front-end.\nFor 1.1.0 this is already done. Please see [_modal-config.scss](https://github.com/drublic/css-modal/blob/wip-1.1.0/_modal-config.scss).\n\nCheers, man! Keep it real.\n. Yes, please check the readme file or website.\n. @anselmh, is this already tested?\n. Thanks. Closed this now.\nPlease let us know if this does not work for you, @ultraflash.\n. Thanks. I've added the option. I like it. \nHave fun with it ;) :beer: \n. 1) Please see http://drublic.github.io/css-modal/#modal-embed. Works for me in Chrome. Firefox seems to be buggy.\n\n2) This seems to be a CSS issue with the general styling. Please try to check your CSS if this issue is still present.\n. We should utilize the custom events of CSS Modal. This is nothing that we\nshould add to the core, IMO, since not everybody uses video. There could be\na plugin snipped which adds the functionality.\n\nOn Wed, Jan 29, 2014 at 1:15 PM, Anselm Hannemann\nnotifications@github.comwrote:\n\n> I think there's a better way to do this. Will dig into when finding some\n> time, thanks for your report and quick solution.\n> \n> ## \n> \n> Reply to this email directly or view it on GitHubhttps://github.com/drublic/css-modal/issues/89#issuecomment-33579352\n> .\n. Can we create a directory `plugins` and add JS functionality for videos\naso. there? I'd like to see that.\n\nOn Thu, Jan 30, 2014 at 1:15 PM, Daniel Martínez\nnotifications@github.comwrote:\n\n> @drublic https://github.com/drublic is kind of right, it it's a _CSS_modal then it would stop being\n> _CSS_. but as you said, this JS would be for \"flavoring\" its use.\n> Allowing html5 video in modal. (and maybe a fullscreen mode?).\n> \n> But it ups to you guys!\n> \n> ## \n> \n> Reply to this email directly or view it on GitHubhttps://github.com/drublic/css-modal/issues/89#issuecomment-33682463\n> .\n. Merged in 7eb21d3d7490152ef5f327aa73cc11550765def3. Thank you!\n. Thanks for this great contribution. Merged it in.\n. You are more than welcome :)\n. Can you please provide a test case for this scenario for us to figure out the problem? Thanks!\n. It works if you call http://www.appix.co.il/GitHub/#modal-text. I don't know why there is a handler on the link that prevents pushing the hash to the history. We cannot help you with this, sorry.\nPlease make sure modal.js is available in on your page.\n. This looks fantastic. I'll test this asap. We need to squash the commits before merging them in though.\n. Thanks. I've merged this and updated the variable at the \"correct\" position.\n. Thanks for reporting. We already tackled this problem in #83. It will be available with the next release.\n. I use a Wufoo form on drublic.de and it works quite well. Can you please provide a test case?\n. @charlespeters Can you please have a look at this again? Otherwise I will now close the issue.\n. No worries. Thanks for sharing your results.\n. `jQuery.brower` is nothing we use within the modal. Actually we don't use any jQuery at all. \nI think in this case it's not the modal's code that causes the effect you describe. We enforce that you cannot scroll the page if the modal is active.\nPlease make sure there are no other influences on the page that might be problematic for the modal (maybe try to remove other plugins).\n\nI am in favor of closing this issue but please let us know if there is a problem if you remove other code.\n. Thanks for replying and closing this issue.\n. @anselmh Is this something you want to work on?\n. +1\n. Would be awesome to have something like \"Queue\".\n. Not gonna happen.. This is because of the way CSS Modal works (without JS it needs the hash bang). We could add an option for this where you could deactivate the hash bang if JS is available.\n. @cyxou Currently there is no way to do this. We will tackle this in v1.2.0 and include a JS-only based behavior.\n. Done. Will be included within the next version.\n. @richie-y Is this issue still existing?\n. Thumbs bug. Gotta go and close this for the time being. Thanks everyone.\n. I've removed the text, since it is without value for this issue. Can you please let me know which OS you're using on the iPhone.\n. Sorry for the long wait. Currently I don't see any chance we will fix this. I don't know if this is a problem on our end or on iOS' but I think it might be the latter.\nIf you still have problems with iOS 8 please let us know.\n\nThanks so much for your time to report this problem.\n. Any results @anselmh?\n. Thanks for testing.\n. Merged, thanks. :)\n. See https://github.com/drublic/css-modal/commit/594bb89b47329124408e7d261e9a8b0addfefb92?w=0 for relevant changes.\n. Thanks for reporting this problem. Can you please try to use the latest version from master? This might work better.\nPlease let us know if the problem remains.\n. Is this problem resolved with #136 (current master)?\n. Closing this now. Please reopen if problem remains\n. @digitaljhelms I think this was a bug with libsass for quite some time now. They fixed it with version 3.0 which has a (couple of) RC at the moment.\nPlease try the version and let us know if your issue isn't fixed yet. I will definitely look into this now.\n\nConcerning versioning: This was a major failure by myself. We will switch to more semantic versions from now one. You will get the latest release which is 1.1.8 from bower since a couple of weeks.\n. In your CSS you might need to change\n\n```\n.modal-inner {\n    extend %modal;\n}\n```\n\nto \n\n```\n#modal-text {\n    @extend %modal;\n}\n```\n\nIt should look OK after that.\n. Closing this now. @Ziiweb, please let us know if this isn't solved for you yet.\n. Please see the gallery plugin. This is done now and you can find all of the requested features there.\n. Currently not. What is the problem of the current implementation?\n. I think this has to stay this way. You can overwrite the values in `_modal-theme.scss` in case it's needed.\nWhat exactly do you mean by more \"standard\" close button?\n. This is now part of branch `plugin-gallery`. Thanks.\n. Looks good to me. I've tested this in Chrome. Works.\n. Thanks for reporting. can you please provide a test-case?\n. Thanks for the update. It doesn't seem to be connected to the modal.\n\nPlease see the screenshot: It looks like it is connected to some facebook integration. Can you please recheck this?\n\n![screen shot 2014-05-22 at 18 20 42](https://cloud.githubusercontent.com/assets/502487/3056676/485faaa0-e1cd-11e3-85f3-57c344ff255d.png)\n. > Ok, I disabled the social button, but the error still remained for me http://joxi.ru/47d-U_3JTJC5MOFNJVI\n\nIf you look at the stack trace you can see that the bug comes from jQuery.simpleFAQ.js. I think the usage of both collides with each other.\n. We are currently looking into better IE8 support.\n\nPing @jonathanweiss.\n. @Tuning-Soft It seems I cannot open your website without IE8 crashing, which is why I can't figure out what the problem is. Can you please try to test with the `ie8-support` branch, please. Please make sure to disable all other libraries.\n\nI cannot reproduce this behavior with my tests.\n. I am going to close this for the time being. Please come back if the bug remains.\n. There is another bug about this behavior here: #186\nPlease check again with the current master version.\n. Thanks!\n. I've updated the pull request. If someone finds time over the weekend I'd be really happy :)\n. Updated. Thank you :)\n. Looks good to me. Can be merged.\n. Thanks for reporting. Seems to be a serious problem. Can you please provide a reduced test-case?\n. That's a good idea. I'll open a new issue about this.\n. Done in 1d13ac00ff05862c9f1893b74303e76fdc38de54. Also part of v1.2.0.\n. Looks good to me.\n. :+1: \n. Thanks.\n. Thanks for the work. The style-injection now seems to work in IE8.\nOnly problem: When the modal opens, the styles are not injected. When you resize the browser they are. Any chance you can look into this?\n. Will look into it for 1.2.0. If you find the time and have the knowledge, I'd appreciate input on the implementation (data-attribute…).\n. Implementation done in #168. Please have a look.\n. Since it's done, i've closed this issue now.\n. Merged in d7f32ed. Thanks.\n. FIxed in 8068007. Thanks :)\n. Updated. Thanks for the heads up.\n. Sorry for the late response. There are stackable modals. Please see \"Demo Show\" and the link \"Stackable Modal\" inside index.html for a demo. Does this help with your issue?\n. It is also possible to use the modal directly in JS. You can find it within the custom data of the event.\n. Thanks you for reporting this. Good point and thanks for investigating. The fix made it into master in 78ef562 and will be in the next version.\n. Thanks for the report and sorry for handling this issue this late.\nThe latest master has some commits that might fix this issue. My tests with the visual test (`index.html`) indicate this although the background still scrolls if touch outside the modal.\n\nPlease let me know of your test results.\n. Please also see 3c66b9f027520e37fe78d6ae90e9eb190e18ec13. This should fix this issue mostly.\n. I could not reproduce this on Android 4.4 Chrome. To be honest, we don't support Mobile Safari on iOS 5. \nI would be really happy if you could open a Pull Request if you find a solution.\n. Done. Please see https://www.npmjs.org/package/css-modal.\n. Good point. It needs the class `modal--show`. Can you fix this with a PS please?\nUpdate: http://fiddle.jshell.net/r6weLcoj/2/\n. Merged in ce2001f78fb599761a10622982e1ef066284efb7! Thanks!\n. Thanks for reporting @stanggt3! Much appreciated. Can you please provide a reduced test case using JS Bin or something like that? Thank you.\n. I've found the problematic code and fixed it. Please let me know if this doesn't fix it for you.\n. Thank you so much for contributing back. This means a lot.\n\nIt is a very good pull request and works perfectly in Firefox and Chrome. Safari is a bit buggy, but we shouldn't care to much I think. I just had some minor syntax corrections which would be great if you could fix them :)\nAlso please add a note with the commit message to the change log please.\n\nThanks again.\n. > What is buggy in Safari ? Perhaps we could try to correct it ?\n\nIt looks like the focus isn't maintained within the modal. Maybe this is a bug on my end but might also be a problem with Safari.\n\nThe changes made it into master in 59fcdd3e0d92cc4c6a0ee05344486644074d0dab. Thanks so much again!\n. Ooops, forgot to update the issue. It's updated since a couple of weeks now.\n. Looks good to me. \n. Thanks. Merged in 122d54909d68f92d7c2b1d38958cf8bb325dbad8.\n. Thanks for reporting this.\nHave you included Bean as in [here](https://github.com/drublic/css-modal/blob/master/test/index.html)? It should be included before modal.js.\n\nI assume you did this already. So this is potentially a problem with the styling of the modal. Can you please have a look if the JavaScript works already? For example check if classes get applied to the HTML tag.\nIf this is the case can you please check if the modal in index.html is working for you? Otherwise we should check where there is a wrong behavior within the modal.\n\nThanks in advance for checking this.\n. Please see #167: We will switch to jQuery to enable people to use tools which are well known.\n. Closing this in favor of #167.\n. I am still thinking of using either Bean or jQuery in order to maintain backwards compatibility.\n. Thanks for looking into it. There are other error with IE8 which seem to be separate to this one.\nI will fix them.\n. Thanks for reporting, @Komald. We will look into this issue asap.\n. Just saw that this demo is using v1.0.1. Can you please check with 1.2.0 https://github.com/drublic/css-modal/blob/master/build/modal.css ?\n. That's just a problem with the wrong class: modals need .modal--show http://jsfiddle.net/seyfso6L/2/\n. So I've checked this again.\n\nCurrently the second modal opens \"stacked\" above the first one. This happens in IE9 and Chrome for me.\nIf you don't want this behavior, but want to open the first, then click, (close the first), open the second, close the second and be back at the page without any modal you might want to add `data-stackable=\"false\"` to the second modal's `section` element.\n\n**Edit:** Stackable modals don't seem to work according to my tests at the moment. I'll take care of this.\n. Stackable modals should be fixed now.\n. Closing this now. Please let me know if you have any problems with it.\n. Thanks for reporting. Closing in favor of #172.\n. Yes, `break-word` is not in the spec.\nFor `break-all` it says:\n\n> In addition to ‘normal’ soft wrap opportunities, lines may break between any two letters (except where forbidden by the ‘line-break’ property). Hyphenation is not applied. This option is used mostly in a context where the text is predominantly using CJK characters with few non-CJK excerpts and it is desired that the text be better distributed on each line.\n\nI don't think this is what we need here, right?\n\nPlease see the SO issue here: http://stackoverflow.com/questions/1795109/what-is-the-difference-between-word-break-break-all-versus-word-wrap-break\n\nI'd opt for leaving it as is.\n. Any more input? Otherwise I'll leave it as it is.\n. Ok, so you are right I think. We should implement both as the article suggests.\n\nCould you please update to:\n\n```\n-ms-word-break: break-all; // Needed for oldIE support, but words are broken up letter-by-letter\n     word-break: break-all;\n     word-break: break-word; // Non standard for webkit\n```\n\nand please remember to update the changelog :)\n\nThanks so much!\n. Thanks. I've changed your commits a bit and incorporated them into one.\nAgain, thanks for the update and the nice response times :)\n. Thanks for reporting this. Can you please check back with the latest commit in master? It should fix a couple of these issues. I could not reproduce this issue with the visual test in `index.html`.\n. Awesome. Thank you!\n. Please use a `z-index` lower than the modal's one (which is `999`) for the navigation. YouTube videos sometimes need an extra parameter or something like this. If you google for this problem: http://stackoverflow.com/questions/3820325/overlay-opaque-div-over-youtube-iframe\n\nPlease include the JS on your page without looking at it any further. It should just work.\n. You can use the \"no-hash\" method. Just add a `data-cssmodal-nohash` to the link as seen [here](https://github.com/drublic/css-modal/blob/master/index.html#L41)\n\nPlease see if this works for you.\n. Thanks for reporting. I can reproduce this. Will try to look into it soon.\n. This works now. Probably because of #181. Please let me know if you run into any other bug.\n. Thanks.\n. > Thank for the very nice modal. Sorry for the noob quetions. I have a form inside of the modal with a submit button. How can I close the modal when the submit button is clicked.\n\nPlease just change the hash on submission. With jQuery this looks like this:\n\n```\n$('form').on('submit', function () {\n    window.location.href = '#!';\n});\n```\n\n> Also, how can I remove the close bar and button on the small screen.\n\nYou need to dig a bit deeper into the styles might take some time to do so.\n. Thanks. Good finding. I've merged your commit and added a test in index.html. Will be part of the next version.\n. @jgadbois Thanks for reporting. I could not find any bugs with the `hashchange` event. As @chilblane points out this might be some other script blocking the `hashchange` event.\n. Thank you for the quick feedback. I will close this issue. If you run into this behavior again, please let me know :)\n. Done. Thank you for the heads up.\n. On master in `index.html` all modals are loaded via ajax and the modal closes perfectly. Can you please try with the current version?\nCan you please also provide a reduced test case for this behavior?\n. Hi, thanks for the heads up and thanks for using CSS Modal.\n\nWe've build two plugins for that. Please see the plugins folder and search\nthe issues. We've already answered this, I think. I hope it helps :)\n\nPlease let us know if you need anything else.\n\nOn Mon, Apr 20, 2015, 3:41 PM droidsignage notifications@github.com wrote:\n\n> Both HTML5 and Youtube video keep playing after the modal has been closed.\n> How would I link the close function to stopping both video types?\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/drublic/css-modal/issues/185.\n. @tmpkco Please check out master and test index.html: css-modal/#modal-html5video. Does the video stop function for you? You can always post a reduced example. That is what I'd be happy to work with :)\n. Closing this as there was no more information provided. Please let me know if the bug persists.\n. Have you checked this with the version on master? I have now pushed a fix for the index file. This fixes it for me.\nCan you please have another look at the issue?\n. Will not be handled, IE8 support will be removed.. Thanks for the report. I've now worked around this by setting a default height of `auto` when setting `.has-layout` to `html`. This should fix it. If you have any other issue with this implementation, please let me know :)\n. Thanks for reporting this problem. It's fixed and will land in the next version.\n. Just push a new hash to the location object:\n\n```\nlocation.hash = '';\n```\n\nAlso see: https://github.com/drublic/css-modal/blob/master/FAQ.md#is-it-possible-to-show-modal-on-page-load You cant to do the reverse thing.\n. Good point. Thank you. I've merged it in 6d671d7e2c77fd1136d9f6bc4cf2cd97ceab2564.\n\nCheers!\n. Thanks for reporting. Is this still a bug? I think this was something we had in earlier versions.\nI currently cannot reproduce this problem with my Chrome on Mac.\n. Work is going on.. Thank you for the heads up. Just landed.\n. Thanks. Merged in b1c94a1bc2090c64d442a247895e774e49ab4e91.\n. It's needed for modals with iframes. Please specify the reason behind your question.\nWe might namespace the data-attributes with the next version\n. Thanks for the report.\nNever experienced this before. I will investigate and test this.\nDid you use Chrome Mobile as a Browser?\n. I have tested this with the current Chrome Mobile and it works nice for me.\nIf you think there is a bug please provide a short video of the behavior you get :)\n. Thank you. This is fixed in 6e3c773647e85cd57f8343337236a20dbf93328c.\r\nWill not be present in the new version.. Very nice. Thank you!\n. Great. Thank you!\n. Done\n. Double check is better. Thanks.\n. I am sorry, people. I will change this with the new version.\r\n\r\nWhat do you need, CSS or Sass?. Next version will be better (CSS only aso).. Ok, thanks.. Thanks for the report. I am in the middle of a rewrite and will close this bug with the next version.\r\nAre you talking about HTML5 Video or a YouTube/Vimeo… iframe?. Thanks.. `max-width` seems a good solution. `max-height` does not make sense I think because you can scroll the content-area.\nWhat do you think?\n. Closing this for now. No more support for Android 2.3.\n. Cannot reproduce this, sorry. Can you please add a video if the problem remains.\n. Merged in bb0bd269684c91d156f9fda2e3b45a77a4f5c934. Thanks!\n. This happens in all browsers, since the `has-overlay` class removes overflow-y in order to prevent the background-page from scrolling.\nWe need another solution for that where the overflow is not visible but the scrollbars are.\n\nWill look into it soon.\n. Agreed. This seems to be more of a research topic for an article.\n. Thanks @anselmh and @benschwarz!\n. This would currently need a lot of rewrite of the whole JS functionality and also add more complexity that is not needed in a lot of cases.\nIt is possible to use hashes for navigation on a page since modal.js doesn't touch the the DOM or anything if it has evaluated that the hash doesn't belong to a modal.\n\nThere might be plugins out there that have problems with interacting with hash-changes that don't belong to their \"area of acting\" but this seems to be the problem of the respective plugin rather than CSS Modal. There might also be other plugins like accordions that rely on the hash being used.\n\nOne more advantage of using hashes is that it enables deeplinking to modals which can be extremely useful.\n\nSo as a conclusion I don't bother too much at the moment to move away from using the hash where appropriate.\n\nThanks anyway for raising this issue.\n. Sounds like a good idea. I will look into the specification to find out if <dialog> is really a good decision for building modals.\n. So apparently `<dialog>` is not implemented in any browser yet. Due to @stevefaulkner's feedback on Twitter I think we will stick to `<section>` at the moment and will update as soon as there is more movement by the browsers towards `<dialog>`.\n. Good points, @Schepp. Actually I think it is worth including a short note about changing the `aria-labelledby` in the How To Markup section.\nI don't think it is necessary to include this as a JS method, users might remove the label's id anyway if they don't need them.\n. What would be the use case for multiple modals stacked over another? Currently you can switch between modals via linking to a new modal.\n. It is possible to navigate through modals with using the hash only, since at least Chrome saves this state in the history.\nThe current implementation doesn't work great with browser history. This is something we need to tackle too.\n. What would be a good way to do it? This might mean that we would have to parse the whole CSS and find the highest z-index.\nAlso if this happens automatically you cannot layer anything above the actual modal. This might be needed on smaller screens when building an app-like website.\nApart from that it is possible to set the z-index in the SCSS file as a variable.\n. Thanks man! I just published this today to get it in bower and travis. Gonna deploy the page tomorrow with the blogpost.\nThanks anyway :)\n. Here we go: http://drublic.github.io/css-modal/\nAnd a blog post: http://drublic.de/blog/introducing-css-modal/\n. The issue of jumping needs to be addressed. It's reported in #24. Thanks :)\n. Thanks, Ryan! I'll check it out.\n@benschwarz PR is always very welcome :)\n. If I invested correctly, this means we need extra markup to target each hidden div. I use this method a lot for navigations, especially on mobile where you need a toggle button for the menu to be visible or not. It is also a method that I use in a modified version for the tabbed content on the page.\nTo be honest I don't think this will work perfectly with the modals since the jumping bug originates in preventing the overflow for the content an thus prevent scrolling the content.\nI will try out some more and come up with a solution shortly.\n. And here is the solution. Pretty easy. Please let me know if you find any bugs in this fix.\nI've also added a test to prevent regression.\n. > Mainly, I have no idea why you are doing this test.\n\nGood point. I cannot remember why I included it. Basically it is not possible for a child of a modal to be targetted via hash since this would hide the modal. So it might be ok to remove the check.\n\nI will run some tests on this and check back soon!\n\nThanks for the PR.\n. @tzi, thanks for looking into this. I've now removed the check if the modal contains an ID since it is not necessary.\nThis closes the bug and we don't actually need the PR anymore :)\n. Thanks for the comment and thoughts, Patrick.\n\nThe modal is focused when opening it. Please see [this line](https://github.com/drublic/css-modal/blob/master/modal.js#L85) and the `setFocus` function in modal.js. And it works for me. Do you have problems using it?\nThis implementation doesn't include cycling through the modal though. Do you have any hint on how to enforce cycling through an element?\n\nI tried to focus back on the main page when the modal is closed [here](https://github.com/drublic/css-modal/blob/master/modal.js#L105). I might have to look into restoring the original focus state on the actual element instead of the body element which happens in Chrome.\n\nAn update for the cycling should definitely be implemented.\n. Ping @patrickhlauke. Would be awesome if you could throw some links at me :) I'd love to include it in the next version.\n. Thank you so much for this, Thomas. Great to see sees smaller issues fixed so soon.\nIt's merged in 8874a6e76945bc099d9c513d641e6ffc6c1b5e2b.\n. Mh… this looks like an issue with Firefox. Works for me at the moment, tho on my Mac. \nI just updated the gh-pages branch, which has another fix for the website. I don't really think this fixes the issue, but I will look into the Windows version of Firefox soon.\nThanks for reporting.\n. I've tested this on Firefox in Win XP and Ubuntu 12.10 now and it works perfectly for me. Which Linux distribution are you using?\nI gonna close this for now since it appears to be an edge case. Anyways it is always great to know about these.\nThank you so much for reporting the issue!\n. This might be related to #33.\n. Closed this with 928f183e18a88862f12e495926814feb60a4c323 for #33. \\o/\n. Thanks for the contribution. I've tried my best and cherry picked cross commits. It's modified in b959efc5ad62b5529aca6c8177a0ca1a0fef3d5c. Wheee!\n. It's currently hard to find a proper solution for Android and iOS that works. I will try to find a better solution for the next version.\n. Thanks for reporting. This is related to #31 and I will try to find a working solution.\n. Looks like the IE8 CSS hack influences IE9 and IE10 too.\n\n```\n// Internet Explorer 8\ndisplay: none\\9;\n\n&.is-active {\n    display: block\\9;\n}\n```\n\nI will try to work around this and find a better solution.\n. Found another solution. Please see commit message.\nThanks for the help and reporting this bug.\n. Just push the hash (ID of the modal) on load.\n\n```\nwindow.location.hash = 'the-modals-id';\n```\n\nRemember to check if another hash is already set.\n\n```\nif (!window.location.hash) {\n    window.location.hash = 'the-id';\n}\n```\n\nYou get the idea.\n. Would you guys think it makes sense to add a kind of gallery for this modal? I mean for the page only.\nShould be easy to do.\n. No worries man :) We could do this with some lines of JS but we would need all images in the proper size. I'll look into it :)\n. @matt-bailey Makes a lot of sense. Actually we had this issue before (on Twitter I think). Anyway I think gallery functionality is pretty easy doable. So I'm implementing this tonight :D\n. Nothing awesome, but it has a functionality now \\o/ Micro gallery, hehe.\nThanks again for the discussion, people.\n. Wow, thank you so much @4nduril! Great contribution.\n\nI am currently thinking of what would be the best way to include the LESS port. I am actually good with maintaining both versions. But I think it wouldn't be best to have both Sass and LESS next to each other in the main branch.\nThis is because:\n- I don't want to have both ports in the download of Bower\n- I don't want to get people confused with what to use\n\nThere are some ways to include the LESS port:\n- Use an extra branch\n- Maintain it in the main branch\n- Use an extra repository\n\nThe stuff that is currently missing to integrate the LESS port are\n- Tests\n- Grunt tasks\n\nI'd love to get some feedback to the aforementioned questions.\n\nAgain, thank you for taking the time to create this port.\n. Awesome work, @4nduril. Thanks again!\nWe now have a [`less`-branch](https://github.com/drublic/css-modal/tree/less). I will publish the less version with the 1.1.0 release I think which should be pretty soon. I will also add another Bower component `css-modal-less`.\n\nPlease let me know if you find any bugs or have more ideas on the LESS branch.\n. Yeah, sounds good to me too. Gonna test that soon and merge it.\n. Thank you so much @realmyst for checking this out. The PR is merged.\nI've had to update the addEventListener polyfill in 465daead421539fb52710d7455abbbbe6748211b in order to get the listeners working in IE 8. Hope this is everything. Guess we will get reports with the next version if otherwise. :)\n. @esanmiguelc Please see [this code](https://github.com/drublic/css-modal/blob/master/site/js/page.js#L52-L70) and check the implementation for the website. This isn't part of the modal tho.\n. Currently you can only do this by changing Sass/CSS. See [this line](https://github.com/drublic/css-modal/blob/master/modal.scss#L279).\nWe should move this text to an attribute on the close link it self I guess.\n. I'll keep this open until the data-attribute solution is in or at least researched.\n. Would suggest that too.\nYou can also use the skeleton as a JS template and replace the contents how you need them.\n. Just updated some stuff in your PR. Thanks :) It's now in!\n. Screenshot would be awesome. Sadly I don't own an iPhone 5. It works great on 4S (except the problems ok #31 and #32).\nDid you do any modifications to the modal? Code would be great too.\n. Thanks, Ben! Landed in d0648d5ac212735b8b78661b0c5038a5a2406d6f.\n. Thanks for fixing this behavior. I merged your commit in 5187b3ba514425ae01c84591f6d27505a5ace400.\n:beers: \n. Thanks! Can you please update the pull request and the SCSS file stead of the CSS file. Please also run grunt and the tests if you can. That would be great. :)\n. You can make the changes we need, then add them to the staging area with `git add *` and amend your last commit using `git commit --amend`. You can then adjust the message too (please make it more clear what you did in the message, you can even self-close this PR if you want to)… and then you need to force push to the branch you work on: `git push -f`.\n\nLet me know if you have any more questions.\n. Please see the commit in a0712dda3291255b47da9cc1cf49ec75f9fb9b77. This tackles the problem in the right area.\nIt's important to add `-webkit-overflow-scrolling` to the content area. Otherwise the modal's content isn't scrollable in some cases. I've tested this on iOS 6.\nThanks anyways for giving this a try.\n. The fix landed. Thanks :)\n. Corrected in both places. Please see 414af6f. Thanks.\n\nFor further Pull Requests: Please be aware of the project's infrastructure and read the contributing guidelines in order to get your work into the project faster. Thank you so much for considering to help this project.\n. This PR doesn't have much other thinks compared to #45 than the inclusion in SCSS.\nI'll pass on this and look to interoperate the changes in #45.\n. Thanks for the effort. Please don't send any more PR.\nI'll figure out a way to incorporate the change as already stated.\n. This isn't an update of the PR. I've outlined how it works [here](https://github.com/drublic/css-modal/pull/45#issuecomment-20196817).\n. Awesome. Thank you.\n\nPlease be aware that it gets a little bit more complicated than just copying the stuff over. Please test implementations on mobile devices aso. But you know your way around it :P\nAlso you can throw this into wip-1.1.0.\n. Wheee. Done.\n. @SantzDesign Please don't spam the issues ;) See https://github.com/drublic/css-modal/issues/79#issuecomment-29006489 for more information.\n. From #64\n\n> I've changed my mind in so for that I think the LESS port should be maintained in another repo.\n> Here are the advantages:\n> - own build status for with Travis\n> - clear separation in PRs and issues\n> - own repo registered in Bower\n> \n> Any objections?\n. @4nduril Thanks for all your work again! I've decided to not include the LESS for within this project. Please register a project yourself and try to maintain it if you need to. I'll try my best to keep up with PRs for JS changes and stuff.\nSorry about that but it's not practical to maintain two separate repositories in order to be up to date with the latest from one or the other. The technology I chose for CSS Modal is Sass and I think this is currently the best fitting tool we can get for this project.\n\nThanks again to everyone included in the discussion.\n. Finally merged this. Thanks for the work.\n. Thanks for fixing this. It's in now.\n. Awesome! Thanks so much. Wanted to do this for v1.1.0 :) Will merge this into the wip-1.1.0 branch after checking it.\nThanks again.\n. It's in now, thanks again, @fabien-d! I will try to release 1.1.0 as soon as possible.\nPlease feel free to help improve CSS Modal further :)\n. Thanks for the effort you put into this pull request. I like the idea and I think this is something we could consider for 1.1.0.\nI'll leave this unmerged for now to look into this issue myself with the current implementation and the different animation styles we'd like to include (#51).\n\nThe problem with changing the background to a filter in IE could be that there are other quirks that come with it. Also I personally don't like to rely on filters. But I will look into this again :)\n. We've applied the changes as outlined in #73 for the new structure. Thanks again for providing the idea and valuable input :)\n. You can use set a hash via JS for opening a modal. I wouldn't encourage you to do this without the user knowing about it. It might be a bit arbitrary.\n\nPlease see #34 for implementation details.\n. Yup, sounds good to me. @jhabdas Thanks, can you please use a colon and recommit this with a description what this commit does (instead of \"Update modal.scss\"). This PR will get merged into wip-1.0.0 FYI.\n. Merged this with the changes! Thank you.\n. Thanks for using CSS Modal.\nYou can use the events by subscribing to them as if they were click events or something. Here is the code:\n\n```\n$(document).on('cssmodal:show', function (event) {\n    console.log(event);\n});\n```\n\nHope that helped.\n\nOn 28.08.2013, at 01:59, Robson Junior notifications@github.com wrote:\n\n> I'm trying to call a custom function to stop my html5 video player but I don't know how to use the cssmodal:hide event.\n> \n> I'm using jQuery. Can somebody help me?\n> Thanks in advance.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Cheers! I've added an issue for that.\n. Thanks so much! I will revisit this as soon as 1.1.0 is near finalization and will update with the latest changes.\n. I've changed my mind in so for that I think the LESS port should be maintained in another repo.\nHere are the advantages:\n- own build status for with Travis\n- clear separation in PRs and issues\n- own repo registered in Bower\n\nAny objections?\n. Oh and yea… the commits are in :) Thanks!\n. Great, that you got it working now :)\n\nI will close the issue now. Please re-open it, if there is another problem with this solution.\nWe will try to document this better and add a plugin for the functionality in v1.1.0. Please also see #63.\n. Thanks so much for bringing up this issue. With #58 we will be trying to make the modal more customizable and make it easier to use it with Bower.\n\nWe could use some help with defining the customizable variables in Sass – so if you are up for it we would be very thankful.\n. Thanks for your ideas.\n\nI am not sure where we should start with this.\nMaybe a structure like this would be great:\n\n``` javascript\n|-- components\n   |-- css-modal\n      |-- _modal-config.scss\n      |-- _modal-core.scss\n      |-- _modal-theme.scss\n      |-- modal.scss\n|-- scss\n   |-- _modal-config.scss\n   |-- main.scss\n```\n\nWhile `_modal-config.scss` in `css-modal` (Bower component) holds all of the modal's default configuration, maybe with a `!default` directive (might be needed). The `_modal-config.scss` file in `scss` holds all the custom overwrites we need. We could include a template for this in the package too.\n\n`main.scss` would have the following inclusions:\n\n```\n@import 'modal-config';\n@import '../components/css-modal/modal';\n```\n\nAll configuration in the local file overwrites the global defaults.\n\nWhat do you think? Does this make sense?\n. We use \"v1.0.0\" as our \"development\" branch atm. It would be awesome if you could create a branch from there and use the existing work in #58. You can then do a PR against v1.0.0 and we will review from there. Sounds good?\n. I've added a little bit of contribution guidelines in [CONTRIBUTE.md](https://github.com/drublic/css-modal/blob/master/CONTRIBUTE.md). Which information is missing?\n. I've updated the CONTRIBUTE.md file. Thanks for the discussion and your ideas. Was applied in #73.\n. I think we should not depend on these classes atm. But we can use CSS hacks for IE8 and we can utilize these maybe.\n\nWhat's the reason to have a 16x16px background image instead of a 1x1px? Optimized it has only 2 bytes more with 90% alpha channel though. I've added this in the commit above.\n. I will close this issue for now. We don't need a perfect support for IE8 since use is more and more fading. Apart from that: We've worked on this in the commits mentioned above.\n. @anselmh Is this related to what happens in branch `plugins`?\n. @grayghostvisuals Please have a look at #133 for 2). This might also be a solution for 1).\n. A css only variant would be nice too. But you can do this by overwriting\nsome values.\n\nThis implementation is a variant for when you want to set a width which\ncomes from a CMS or another user input.\n\nOn Tue, May 27, 2014 at 7:45 PM, Dennis Gaebel notifications@github.comwrote:\n\n> if you all like it then I'm all [image: :+1:] for it.\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/drublic/css-modal/issues/68#issuecomment-44309585\n> .\n. Closing this as we've implemented one solution. Please feel free to open a new issue if you are not happy with the current result.\n. @richie-y The pages not include the modal (anymore?!).\n. Louis, you can just use the index.html file in branch wip-1.1.0. It has all modal styles we use.\n\nOn 18.09.2013, at 08:22, Louis Lazaris notifications@github.com wrote:\n\n> Sure, I'll see what I can do. If someone has a reduced test case ready, that would be nice for me to start with, but I could just strip down the JS Bin I created and go from there.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks so much for the commit! Separation LGTM at the moment but need to have a closer look.\nPlease stick to one task and one task only for each PR as Anselm said.\n\nWe haven't discussed including Grunt plugins other than we have. We don't need the tasks that you included, it's just something that is opinionated and I don't think we should add to much of this stuff in there. We could try to remove something tho…\n\n> Eventually some mixins and functions should be added to manage the complexity/prefix grossness of the transitions and animations etc. Maybe adding auto prefixer would be better suited and a more maintainable option going forward.\n\nWe don't want to add any complexity for developers. They should use it with Bower or just as a drop in, so there is no real space for prefixer or something. We had the [sass-mixins](https://github.com/drublic/Sass-Mixins) repo as dependency in the early stage of this project and this didn't proof to be a good way to integrate with existing websites.\n\nAgain, thanks for the great work. We really appreciate it :)\n. Sounds perfect :)\nIn case you didn't know: You can just update this commit via `git commit --amend` and `git push -f`.\n. Thanks for your work @grayghostvisuals. I've merged your changes into the wip-1.1.0 branch. Great stuff.\n. @anselmh I've fixed the comment.\n\n@SantzDesign Header and footer tags can be used for more than the header or footer section of the page. Please read the spec. I think we are good here.\n\nThanks for raising the issue and taking the time to look into this.\n. Legit. Thanks for the heads up.\n. It's in, but GitHub doesn't seem to recognize it. See 2ca9212c614f38e448b621c0383b20041176257e.\n. It is important this happens on mobile. At the moment I don't feel like this is a big issue but we should tackle it with 1.1.0.\n. Shipped this. Thanks, man!\n. @anselm-urban Does your bug still occur with the unstable version of CSS Modal?\n. Thanks for testing @anselmh.\n. :+1:\n. Thanks @anselmh!\n. Looks good to me :) Ship it.\n. This will be fixed with the new version. For the time being, please update the css-modal to v1.1.0-alpha.\n. Oops, sorry. The release is called `v1.1.0alpha`.\n. Closing this for now.\n. You can compile the code yourself by running `grunt sass:dist`. You can then find the file in the build directory.\nWe'll fix it.\n. Thanks for the suggestion. !default is really a cure to some evil package management brings to the front-end.\nFor 1.1.0 this is already done. Please see [_modal-config.scss](https://github.com/drublic/css-modal/blob/wip-1.1.0/_modal-config.scss).\n\nCheers, man! Keep it real.\n. Yes, please check the readme file or website.\n. @anselmh, is this already tested?\n. Thanks. Closed this now.\nPlease let us know if this does not work for you, @ultraflash.\n. Thanks. I've added the option. I like it. \nHave fun with it ;) :beer: \n. 1) Please see http://drublic.github.io/css-modal/#modal-embed. Works for me in Chrome. Firefox seems to be buggy.\n\n2) This seems to be a CSS issue with the general styling. Please try to check your CSS if this issue is still present.\n. We should utilize the custom events of CSS Modal. This is nothing that we\nshould add to the core, IMO, since not everybody uses video. There could be\na plugin snipped which adds the functionality.\n\nOn Wed, Jan 29, 2014 at 1:15 PM, Anselm Hannemann\nnotifications@github.comwrote:\n\n> I think there's a better way to do this. Will dig into when finding some\n> time, thanks for your report and quick solution.\n> \n> ## \n> \n> Reply to this email directly or view it on GitHubhttps://github.com/drublic/css-modal/issues/89#issuecomment-33579352\n> .\n. Can we create a directory `plugins` and add JS functionality for videos\naso. there? I'd like to see that.\n\nOn Thu, Jan 30, 2014 at 1:15 PM, Daniel Martínez\nnotifications@github.comwrote:\n\n> @drublic https://github.com/drublic is kind of right, it it's a _CSS_modal then it would stop being\n> _CSS_. but as you said, this JS would be for \"flavoring\" its use.\n> Allowing html5 video in modal. (and maybe a fullscreen mode?).\n> \n> But it ups to you guys!\n> \n> ## \n> \n> Reply to this email directly or view it on GitHubhttps://github.com/drublic/css-modal/issues/89#issuecomment-33682463\n> .\n. Merged in 7eb21d3d7490152ef5f327aa73cc11550765def3. Thank you!\n. Thanks for this great contribution. Merged it in.\n. You are more than welcome :)\n. Can you please provide a test case for this scenario for us to figure out the problem? Thanks!\n. It works if you call http://www.appix.co.il/GitHub/#modal-text. I don't know why there is a handler on the link that prevents pushing the hash to the history. We cannot help you with this, sorry.\nPlease make sure modal.js is available in on your page.\n. This looks fantastic. I'll test this asap. We need to squash the commits before merging them in though.\n. Thanks. I've merged this and updated the variable at the \"correct\" position.\n. Thanks for reporting. We already tackled this problem in #83. It will be available with the next release.\n. I use a Wufoo form on drublic.de and it works quite well. Can you please provide a test case?\n. @charlespeters Can you please have a look at this again? Otherwise I will now close the issue.\n. No worries. Thanks for sharing your results.\n. `jQuery.brower` is nothing we use within the modal. Actually we don't use any jQuery at all. \nI think in this case it's not the modal's code that causes the effect you describe. We enforce that you cannot scroll the page if the modal is active.\nPlease make sure there are no other influences on the page that might be problematic for the modal (maybe try to remove other plugins).\n\nI am in favor of closing this issue but please let us know if there is a problem if you remove other code.\n. Thanks for replying and closing this issue.\n. @anselmh Is this something you want to work on?\n. +1\n. Would be awesome to have something like \"Queue\".\n. Not gonna happen.. This is because of the way CSS Modal works (without JS it needs the hash bang). We could add an option for this where you could deactivate the hash bang if JS is available.\n. @cyxou Currently there is no way to do this. We will tackle this in v1.2.0 and include a JS-only based behavior.\n. Done. Will be included within the next version.\n. @richie-y Is this issue still existing?\n. Thumbs bug. Gotta go and close this for the time being. Thanks everyone.\n. I've removed the text, since it is without value for this issue. Can you please let me know which OS you're using on the iPhone.\n. Sorry for the long wait. Currently I don't see any chance we will fix this. I don't know if this is a problem on our end or on iOS' but I think it might be the latter.\nIf you still have problems with iOS 8 please let us know.\n\nThanks so much for your time to report this problem.\n. Any results @anselmh?\n. Thanks for testing.\n. Merged, thanks. :)\n. See https://github.com/drublic/css-modal/commit/594bb89b47329124408e7d261e9a8b0addfefb92?w=0 for relevant changes.\n. Thanks for reporting this problem. Can you please try to use the latest version from master? This might work better.\nPlease let us know if the problem remains.\n. Is this problem resolved with #136 (current master)?\n. Closing this now. Please reopen if problem remains\n. @digitaljhelms I think this was a bug with libsass for quite some time now. They fixed it with version 3.0 which has a (couple of) RC at the moment.\nPlease try the version and let us know if your issue isn't fixed yet. I will definitely look into this now.\n\nConcerning versioning: This was a major failure by myself. We will switch to more semantic versions from now one. You will get the latest release which is 1.1.8 from bower since a couple of weeks.\n. In your CSS you might need to change\n\n```\n.modal-inner {\n    extend %modal;\n}\n```\n\nto \n\n```\n#modal-text {\n    @extend %modal;\n}\n```\n\nIt should look OK after that.\n. Closing this now. @Ziiweb, please let us know if this isn't solved for you yet.\n. Please see the gallery plugin. This is done now and you can find all of the requested features there.\n. Currently not. What is the problem of the current implementation?\n. I think this has to stay this way. You can overwrite the values in `_modal-theme.scss` in case it's needed.\nWhat exactly do you mean by more \"standard\" close button?\n. This is now part of branch `plugin-gallery`. Thanks.\n. Looks good to me. I've tested this in Chrome. Works.\n. Thanks for reporting. can you please provide a test-case?\n. Thanks for the update. It doesn't seem to be connected to the modal.\n\nPlease see the screenshot: It looks like it is connected to some facebook integration. Can you please recheck this?\n\n![screen shot 2014-05-22 at 18 20 42](https://cloud.githubusercontent.com/assets/502487/3056676/485faaa0-e1cd-11e3-85f3-57c344ff255d.png)\n. > Ok, I disabled the social button, but the error still remained for me http://joxi.ru/47d-U_3JTJC5MOFNJVI\n\nIf you look at the stack trace you can see that the bug comes from jQuery.simpleFAQ.js. I think the usage of both collides with each other.\n. We are currently looking into better IE8 support.\n\nPing @jonathanweiss.\n. @Tuning-Soft It seems I cannot open your website without IE8 crashing, which is why I can't figure out what the problem is. Can you please try to test with the `ie8-support` branch, please. Please make sure to disable all other libraries.\n\nI cannot reproduce this behavior with my tests.\n. I am going to close this for the time being. Please come back if the bug remains.\n. There is another bug about this behavior here: #186\nPlease check again with the current master version.\n. Thanks!\n. I've updated the pull request. If someone finds time over the weekend I'd be really happy :)\n. Updated. Thank you :)\n. Looks good to me. Can be merged.\n. Thanks for reporting. Seems to be a serious problem. Can you please provide a reduced test-case?\n. That's a good idea. I'll open a new issue about this.\n. Done in 1d13ac00ff05862c9f1893b74303e76fdc38de54. Also part of v1.2.0.\n. Looks good to me.\n. :+1: \n. Thanks.\n. Thanks for the work. The style-injection now seems to work in IE8.\nOnly problem: When the modal opens, the styles are not injected. When you resize the browser they are. Any chance you can look into this?\n. Will look into it for 1.2.0. If you find the time and have the knowledge, I'd appreciate input on the implementation (data-attribute…).\n. Implementation done in #168. Please have a look.\n. Since it's done, i've closed this issue now.\n. Merged in d7f32ed. Thanks.\n. FIxed in 8068007. Thanks :)\n. Updated. Thanks for the heads up.\n. Sorry for the late response. There are stackable modals. Please see \"Demo Show\" and the link \"Stackable Modal\" inside index.html for a demo. Does this help with your issue?\n. It is also possible to use the modal directly in JS. You can find it within the custom data of the event.\n. Thanks you for reporting this. Good point and thanks for investigating. The fix made it into master in 78ef562 and will be in the next version.\n. Thanks for the report and sorry for handling this issue this late.\nThe latest master has some commits that might fix this issue. My tests with the visual test (`index.html`) indicate this although the background still scrolls if touch outside the modal.\n\nPlease let me know of your test results.\n. Please also see 3c66b9f027520e37fe78d6ae90e9eb190e18ec13. This should fix this issue mostly.\n. I could not reproduce this on Android 4.4 Chrome. To be honest, we don't support Mobile Safari on iOS 5. \nI would be really happy if you could open a Pull Request if you find a solution.\n. Done. Please see https://www.npmjs.org/package/css-modal.\n. Good point. It needs the class `modal--show`. Can you fix this with a PS please?\nUpdate: http://fiddle.jshell.net/r6weLcoj/2/\n. Merged in ce2001f78fb599761a10622982e1ef066284efb7! Thanks!\n. Thanks for reporting @stanggt3! Much appreciated. Can you please provide a reduced test case using JS Bin or something like that? Thank you.\n. I've found the problematic code and fixed it. Please let me know if this doesn't fix it for you.\n. Thank you so much for contributing back. This means a lot.\n\nIt is a very good pull request and works perfectly in Firefox and Chrome. Safari is a bit buggy, but we shouldn't care to much I think. I just had some minor syntax corrections which would be great if you could fix them :)\nAlso please add a note with the commit message to the change log please.\n\nThanks again.\n. > What is buggy in Safari ? Perhaps we could try to correct it ?\n\nIt looks like the focus isn't maintained within the modal. Maybe this is a bug on my end but might also be a problem with Safari.\n\nThe changes made it into master in 59fcdd3e0d92cc4c6a0ee05344486644074d0dab. Thanks so much again!\n. Ooops, forgot to update the issue. It's updated since a couple of weeks now.\n. Looks good to me. \n. Thanks. Merged in 122d54909d68f92d7c2b1d38958cf8bb325dbad8.\n. Thanks for reporting this.\nHave you included Bean as in [here](https://github.com/drublic/css-modal/blob/master/test/index.html)? It should be included before modal.js.\n\nI assume you did this already. So this is potentially a problem with the styling of the modal. Can you please have a look if the JavaScript works already? For example check if classes get applied to the HTML tag.\nIf this is the case can you please check if the modal in index.html is working for you? Otherwise we should check where there is a wrong behavior within the modal.\n\nThanks in advance for checking this.\n. Please see #167: We will switch to jQuery to enable people to use tools which are well known.\n. Closing this in favor of #167.\n. I am still thinking of using either Bean or jQuery in order to maintain backwards compatibility.\n. Thanks for looking into it. There are other error with IE8 which seem to be separate to this one.\nI will fix them.\n. Thanks for reporting, @Komald. We will look into this issue asap.\n. Just saw that this demo is using v1.0.1. Can you please check with 1.2.0 https://github.com/drublic/css-modal/blob/master/build/modal.css ?\n. That's just a problem with the wrong class: modals need .modal--show http://jsfiddle.net/seyfso6L/2/\n. So I've checked this again.\n\nCurrently the second modal opens \"stacked\" above the first one. This happens in IE9 and Chrome for me.\nIf you don't want this behavior, but want to open the first, then click, (close the first), open the second, close the second and be back at the page without any modal you might want to add `data-stackable=\"false\"` to the second modal's `section` element.\n\n**Edit:** Stackable modals don't seem to work according to my tests at the moment. I'll take care of this.\n. Stackable modals should be fixed now.\n. Closing this now. Please let me know if you have any problems with it.\n. Thanks for reporting. Closing in favor of #172.\n. Yes, `break-word` is not in the spec.\nFor `break-all` it says:\n\n> In addition to ‘normal’ soft wrap opportunities, lines may break between any two letters (except where forbidden by the ‘line-break’ property). Hyphenation is not applied. This option is used mostly in a context where the text is predominantly using CJK characters with few non-CJK excerpts and it is desired that the text be better distributed on each line.\n\nI don't think this is what we need here, right?\n\nPlease see the SO issue here: http://stackoverflow.com/questions/1795109/what-is-the-difference-between-word-break-break-all-versus-word-wrap-break\n\nI'd opt for leaving it as is.\n. Any more input? Otherwise I'll leave it as it is.\n. Ok, so you are right I think. We should implement both as the article suggests.\n\nCould you please update to:\n\n```\n-ms-word-break: break-all; // Needed for oldIE support, but words are broken up letter-by-letter\n     word-break: break-all;\n     word-break: break-word; // Non standard for webkit\n```\n\nand please remember to update the changelog :)\n\nThanks so much!\n. Thanks. I've changed your commits a bit and incorporated them into one.\nAgain, thanks for the update and the nice response times :)\n. Thanks for reporting this. Can you please check back with the latest commit in master? It should fix a couple of these issues. I could not reproduce this issue with the visual test in `index.html`.\n. Awesome. Thank you!\n. Please use a `z-index` lower than the modal's one (which is `999`) for the navigation. YouTube videos sometimes need an extra parameter or something like this. If you google for this problem: http://stackoverflow.com/questions/3820325/overlay-opaque-div-over-youtube-iframe\n\nPlease include the JS on your page without looking at it any further. It should just work.\n. You can use the \"no-hash\" method. Just add a `data-cssmodal-nohash` to the link as seen [here](https://github.com/drublic/css-modal/blob/master/index.html#L41)\n\nPlease see if this works for you.\n. Thanks for reporting. I can reproduce this. Will try to look into it soon.\n. This works now. Probably because of #181. Please let me know if you run into any other bug.\n. Thanks.\n. > Thank for the very nice modal. Sorry for the noob quetions. I have a form inside of the modal with a submit button. How can I close the modal when the submit button is clicked.\n\nPlease just change the hash on submission. With jQuery this looks like this:\n\n```\n$('form').on('submit', function () {\n    window.location.href = '#!';\n});\n```\n\n> Also, how can I remove the close bar and button on the small screen.\n\nYou need to dig a bit deeper into the styles might take some time to do so.\n. Thanks. Good finding. I've merged your commit and added a test in index.html. Will be part of the next version.\n. @jgadbois Thanks for reporting. I could not find any bugs with the `hashchange` event. As @chilblane points out this might be some other script blocking the `hashchange` event.\n. Thank you for the quick feedback. I will close this issue. If you run into this behavior again, please let me know :)\n. Done. Thank you for the heads up.\n. On master in `index.html` all modals are loaded via ajax and the modal closes perfectly. Can you please try with the current version?\nCan you please also provide a reduced test case for this behavior?\n. Hi, thanks for the heads up and thanks for using CSS Modal.\n\nWe've build two plugins for that. Please see the plugins folder and search\nthe issues. We've already answered this, I think. I hope it helps :)\n\nPlease let us know if you need anything else.\n\nOn Mon, Apr 20, 2015, 3:41 PM droidsignage notifications@github.com wrote:\n\n> Both HTML5 and Youtube video keep playing after the modal has been closed.\n> How would I link the close function to stopping both video types?\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/drublic/css-modal/issues/185.\n. @tmpkco Please check out master and test index.html: css-modal/#modal-html5video. Does the video stop function for you? You can always post a reduced example. That is what I'd be happy to work with :)\n. Closing this as there was no more information provided. Please let me know if the bug persists.\n. Have you checked this with the version on master? I have now pushed a fix for the index file. This fixes it for me.\nCan you please have another look at the issue?\n. Will not be handled, IE8 support will be removed.. Thanks for the report. I've now worked around this by setting a default height of `auto` when setting `.has-layout` to `html`. This should fix it. If you have any other issue with this implementation, please let me know :)\n. Thanks for reporting this problem. It's fixed and will land in the next version.\n. Just push a new hash to the location object:\n\n```\nlocation.hash = '';\n```\n\nAlso see: https://github.com/drublic/css-modal/blob/master/FAQ.md#is-it-possible-to-show-modal-on-page-load You cant to do the reverse thing.\n. Good point. Thank you. I've merged it in 6d671d7e2c77fd1136d9f6bc4cf2cd97ceab2564.\n\nCheers!\n. Thanks for reporting. Is this still a bug? I think this was something we had in earlier versions.\nI currently cannot reproduce this problem with my Chrome on Mac.\n. Work is going on.. Thank you for the heads up. Just landed.\n. Thanks. Merged in b1c94a1bc2090c64d442a247895e774e49ab4e91.\n. It's needed for modals with iframes. Please specify the reason behind your question.\nWe might namespace the data-attributes with the next version\n. Thanks for the report.\nNever experienced this before. I will investigate and test this.\nDid you use Chrome Mobile as a Browser?\n. I have tested this with the current Chrome Mobile and it works nice for me.\nIf you think there is a bug please provide a short video of the behavior you get :)\n. Thank you. This is fixed in 6e3c773647e85cd57f8343337236a20dbf93328c.\r\nWill not be present in the new version.. Very nice. Thank you!\n. Great. Thank you!\n. Done\n. Double check is better. Thanks.\n. I am sorry, people. I will change this with the new version.\r\n\r\nWhat do you need, CSS or Sass?. Next version will be better (CSS only aso).. Ok, thanks.. Thanks for the report. I am in the middle of a rewrite and will close this bug with the next version.\r\nAre you talking about HTML5 Video or a YouTube/Vimeo… iframe?. Thanks.. ",
    "anselmh": "True. Only max-width then.\n. You also probably be a bit more flexible using this additional line of code:\n\n```\n.modal-content {\n    max-height: 400px;\n    max-height: 70vh;\n}\n```\n\nAlthough vh should be 90vh to the whole modal I think. This 70vh is a quick fix for current base.\n. I am not sure if we should drop vh also in here as iOS has a problem interpreting vh in media queries…\n. Found the solution. This is because the modal is small enough so Firefox removes vertical scrollbars.\nSolved by adding `overflow-y: scroll` but not sure if this should be prevented somehow in modal…?\n. As I never again experienced this 'bug' and nothing was raised by other users here, I am closing this issue now. Please reopen with more details on which browser is affected if you can reproduce this.\n. @sebald Without knowing you exact problem I don't see a reason why this should result in an error. It's up to you how you name your modal's ID. If I misunderstood you, please can you elaborate on your issue?\n. I vote against. This is unexpected behavior for the user and should not be done in js. If aria is not used by developers this is a different problem which should be tackled other way.\n. Opera, Firefox on OS X working pretty fine. Browserstack can have issues on that kind of things as it's loading an embedded iframe with some delay which might not be awaited by browserstack.\n. I personally prefer the current (not PR) text except for the one sentence I commented on in diff. But this is just my opinion.\n. This also applies for Android Chrome and Opera 14.\n. As all related issues are closed, what's the status here?\n. Have you guys checked out branch [wip-1.1.0](https://github.com/drublic/css-modal/tree/wip-1.1.0) yet? This issue should be fixed already in the upcoming release. You can use this branch's code already although not all tasks for 1.1 have been finished.\n. @jme783 Thanks for reporting back. Then we need to investigate further here +@drublic.\n. It would be great if you could write down your working hack here then, so others can profit from it, too. :)\n. ```\nselector { \n    … \n    last-property: value\\0/; \n}\n```\n\nshould be enough.\n. Of course, sorry. Then you have to go the MQ way \n. Nope, this no bug, there is no interactivity on the example yet. I'm closing this for now but you're kindly invited to fork, edit and send a pull-request to add the feature you expected to see here.\n. Sorry for closing, @drublic. I do think it would make sense, yes.\n. I would prefer an extra branch over extra repository.\n. Valid PR and looks fine to me to be merged.\n. Can you provide the code example where it is not working?\n\nI cannot confirm the issue using IE8 (w/Flash as nothing else would work in IE8) and the demo video modal (http://drublic.github.io/css-modal/#modal-embed).\n. Hey, unfortunately jsfiddle itself seems to have no IE8 support. Viewing it as fullscreen jsfiddle-preview has the following result:\n- YouTube is displayed directly (without triggering the modal) – might be a Flash embed issue (wmode might be necessary)\n- The modal seems to not work at all. Do you use the latest code of the modal?\n\nTo properly debug this we would need the complete test case I think. You can also send this via e-mail if you don't want to have it public.\n. This might be related to Flash playback used in IE8. Not sure if this can be fixed.\n. Hi @richardatwork, could you provide a working example or at least a screenshot what error happens?\n. Well, I can confirm that somehow on my iPhone5 but this rather looks like a general issue with the site on mobile. Maybe another script is catching calls? I don't have the time to dig in deeper right now, sorry. Maybe in the next days…\n. Looks good to me and makes sense to convert to hex code.\n. Thanks for the additional details. As I am able to confirm this, I now reopen the issue. A bugfix is coming soon! For the time being you can fix this by extending the `:target` selectors by:\n\n```\n&:target,\n&.is-active {\n    …\n}\n```\n\nAs the `.is-active` class is set by the js this will then trigger your modal on load.\n. Damn you stole my feature request :D just wanted to propose this when I read the cordons article. If you want you can assign this to me and I'll try to do this in the next days\n. So we need to close down less-branch properly and separate this into a new repository. I therefore am changing the title according to the tasks.\n. Oh man, sorry I must have overseen this issue :(\nYou can adjust the modal height by changing the `.modal-content` `max-height: 70vh` value. This currently limits the height to 70% of the viewport height on Desktop. Ensure you are also updating the different values specified in several media-queries.\n\nIf this doesn't work for you, a working demo would be great for analyzing.\n. I am closing this issue now hoping you have solved the problem. If not, feel free to provide more details and reopen it. :)\n. Thanks for reporting and fixing (LGTM). I would prefer a colon instead because the `-` is not a true replacement but have no strong opinion on that and leave it to @drublic to decide. ;)\n. Hi @jimzar you can simply call the modal by targeting the id of the html element by the hash:\n\n```\nwindow.location.hash = 'modal';\n```\n. Fully agree on that.\n\n---\n\nAnselm\n\n> On 25.09.2013, at 10:14, Hans Christian Reinl notifications@github.com wrote:\n> \n> I've changed my mind in so for that I think the LESS port should be maintained in another repo.\n> Here are the advantages:\n> \n> own build status for with Travis\n> clear separation in PRs and issues\n> own repo registered in Bower\n> Any objections?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Hi,\n\nThis is not yet \"supported\" by default (think it will be in 1.1). You have to deal with the modals own events.\n\n```\ncssmodal:show / hide\n```\n\nFires when an modal is open or not. You need to start stop and target the video within your event handler function.\nI've done that once and can show you the code in ~1 week when I'm back from vacation (if no one else jumps in here).\n\n---\n\nAnselm\n\n> On 02.09.2013, at 04:49, Santiago Baigorria notifications@github.com wrote:\n> \n> Hi guys,\n> \n> I'd like to submit an update request. I'm experiencing a bug when trying to \"load\" or \"use\" multiple modal boxes with different YouTube iFrame's each (one vid for each modal).\n> \n> However, when I click for instance in modal 1, and then close it (with or without having played the video), and then click to open modal 2 (containing another video), the same video that was on modal one shows up. BUT if I refresh the page, and open modal 2 first, then that video will show up in modal 1 instead.\n> \n> Don't understand what's going on... I'm anyways no jQuery expert so... I'd love to know if anyone knows how to fix this.\n> \n> Thanks a lot,\n> Santiago Baigorria\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. That's what I exactly planned to integrate into v1.1 - allowing multiple videos and more important - better documentation on such cases.\n\n---\n\nCheers!\n-Anselm\n\n> On 02.09.2013, at 11:39, SergeySnegirev notifications@github.com wrote:\n> \n> Hi,\n> I just ran into this issue and solved it. CSS Modal guys use the following technique to stop video when modal is closed (pseudocode):\n> \n> on HIDE store iframe source into data-src attribute, then set src to empty string\n> on SHOW check if iframce source is empty, then restore it from data-src attribute\n> The problem is, they only planned for ONE video on the page, so they use the following selector to catch the iframe: var $video = $('.semantic-content iframe');\n> \n> Now we need to only catch the currently displayed video, so let's modify the selector to:\n> var $video = $('.semantic-content.is-active iframe');\n> \n> Voila, enjoy.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Here are quite a few IE8- hacks listed: http://browserhacks.com/\n. Hey,\n\nregarding 1: Yes, definitely wanted but I do think we will need to shift this into 1.2.0 as this needs some more re-structuring in the code and 1.1 should be served as soon as possible now.\nregarding 2: Do you have a proposal how to handle this? It could be done with an data-attribute but I'm not sure if we want to do that as it shifts layout properties into html markup. But maybe you have a better solution how to handle that?\n\nThanks for your feedback! :)\n-Anselm\n. Well, be sure we will keep care of this (in my personal opinion right after 1.1 shipped). But I want to let the decision about the handling of this up to @drublic so let's wait what he says about this feature-request.\n. Hm… not directly. This issue is more about more manageable breakpoints but at least branch `plugin-resize` will tackle a bit of the problem.\n. Hi @SandraK, thank you for reporting this issue. I can reproduce this viewing your demo page but haven't had the time yet to look closer into the code you use.\nYou could try to use the css-modal from the v1.1.0 branch but I am not sure if this will fix it. I hope to find some time in the next days to have a closer look into the issue.\n\nThank you so much for your patience, I am very sorry that it took that long for a first reply!\n. The demo doesn't include CSS-Modal anymore. Therefore I am closing this issue as it's not reproducible anymore.\n. You need to move the `@keyframes` sections outside the `@media` section because IE10 gets mixed up by the 'nested @'. The call to keyframes can stay there. \n\nInteresting but this isn't our problem. It is simply we are not using the `-ms-` prefix in the transition. Thanks for reporting, we will fix this soon. For now simply add in before line 319 (https://github.com/drublic/css-modal/blob/master/modal.scss#L319) a `-ms-transition: opacity 0.4s;`.\n. Well, it would be awesome if you could look into it and report (or maybe send a PR rearding this on v1.1). :)\n. This works fine in my tests in IE10, 11 under WIN7 + WIN 8 with both, v1.0 and v1.1. Therefore closing this now.\n. Yeah, reading the docs from MS they confirm it works w/o prefix. Must have been a wrong information I got somewhere else. Therefore closing the PR. Thanks for reviewing and comments!\n. @alrra @impressivewebs you can read about this here as described by impressivewebs: http://msdn.microsoft.com/en-us/library/ie/hh673535(v=vs.85).aspx\n\n> Note  The properties and event described in this topic previously required a Microsoft-specific vendor prefix, \"-ms-\", to work with Internet Explorer 10 and Windows Store apps using JavaScript. This prefix is no longer required, but will still be recognized. To ensure compatibility in the future, applications using the Microsoft vendor prefix with transition properties should be updated accordingly.\n. Just had a quick look on it, here are my comments:\n- livereload is missing as dependency in package.json while it is called in Gruntfile.js\n- you have introduced a line-break issue at least in the package.json file (check the diff)\n  In general I would prefer to have different smaller commits and Pull-Requests, one for each task. This makes it more maintainable and easier to merge parts of it.\n  It would be great if you could fix the remaining issues first by amending the commit.\n. Hi, thanks for your comment but it seems the elements have been eaten by github. Can you fix that so we can see what tags you mean?\n. Hi,\n\nyou can see the details in #34. Be sure to use v1.1.0 branch for that as there landed a fix (#55) which will work better on pageload.\nPlease re-open if you still have problems with it.\n. You're welcome! :)\n\n---\n\nAnselm\n\n> On 10 Oct 2013, at 20:23, mard73 notifications@github.com wrote:\n> \n> Worked great! Thanks so much for all your help.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks for the updates on the issues. This would be a very unexpected behavior indeed. I am closing this issue for now. Please report back here if you can reproduce this within a fresh browser.\n. Hi,\ncan you please elaborate what the misbehavior is here and in what IE versions it happens? From the screenshot I cannot really see the problem so it would be great if you could say what 'too big' means (by providing the calculated values or just a comparison screenshot).\nThank you for reporting this issue.\n. Hi, can you tell us what version you use here? Is it the master branch or wip-1.1.0? If it's the master branch, please check out the latest code from wip-1.1.0 and #70 and report back if it's solved or not with more details. \n. Thanks for your feedback. This is most probably due to the fact that the page uses the older version and it is likely already fixed in upcoming v1.1. Until I confirmed that, I'm leaving this issue open.\n. Hi @SantzDesign, they're already in the v1.1.0 branch. You can find them here https://github.com/drublic/css-modal/blob/wip-1.1.0/_modal-core.scss#L333 and use them. \n. Works fine (in my tests) so I'm going to close this issue now.\n. Sent a pull request with the changed naming here: #82 \n. I tested this in our basic visual test. Though I cannot speak for the given case (stated by the author) I think this should be fixed by the commit.\n. Hi, it's hard to follow your issues without seeing the code you use. Could you either provide us a link to the (non)working demo or create a jsbin?\n. The only issue I can confirm on the link you've sent is that the video doesn't stop when hiding the modal. This should be done with JavaScript. All other issues don't appear in the browsers I tested (Firefox, Chrome).\n. I'm going to close this now. The solution is to add the `?wmode=transparent` parameter to YouTube URLs so that video works within the modal if it is played through Flash.\n\nPlease re-open if this is not the correct solution and clarify.\n. Yes, this should be done in JavaScript IMO. It’s a simple thing and should be added in a future version to improve video/audio support.\n. I think there’s a better way to do this. Will dig into when finding some time, thanks for your report and quick solution.\n. Yes, think this would be a good idea. We also could provide one plugin for html5 video and another for the vimeo API then…\n. There is a 404 error on the modal.js file so fixing that might probably fix your problem.\n. Now take this one. Fine now? ;)\n. Could you please elaborate which method to embed the Wufoo form you used and how you implemented it? Also, a demo / link to it would be very useful to track the issues down. :) Thanks!\n. This is a bit weird… do you use a tagged version or the latest master? Also, have you done some customizing in the scss?\n. Thanks, can you share a demo link of this? Also, could you see some issues looking into the Developer Tools of your browser that gives you a clue why this happens? Would help us a lot to track down the issue.\n. It’s hard to say what went wrong here and I’m not quite sure what the jQuery Migrate code does exactly (maybe this could also affect the modal though it shouldn't). Unfortunately I’ll not be able to help you further without a fully reproducable page to have a look at. If you can provide such, I’m happy to have a look at.\n. I'll see if I can do in the upcoming week but I'm in favor of only providing a small set of 1-2 effects for it to keep this maintainable and tiny.\n\n> On 12 Oct 2014, at 19:19, Hans Christian Reinl notifications@github.com wrote:\n> \n> @anselmh Is this something you want to work on?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. I guess your 1) is related to #32 and should be discussed over there. It would be great to have some more insight over there and maybe the demo link.\n\n2) I can't confirm that with your given link. Can you assure that still happens and if, in which browser and OS and where exactly so we can try to reproduce this?\n. Hi, I still can’t reproduce any jumping behavior on your page (tested Mavericks + Firefox, Chrome, Safari). Also your description talks about 'jumping', about 'wrongly shown images'—I can’t confirm them on your test page. If these issues still exist on your side and you can eliminate that it’s only a local problem on your computer, I'd be happy to see a short screencast so that we can know what you experience as issues. Otherwise it’s bit hard to debug as we don’t even know for sure what you experience.\n. Hi, it’s an [1*1px png as dataURI](https://github.com/drublic/css-modal/blob/master/_modal-theme.scss#L61) that is used as overlay currently. You’d need to replace this currently to change the color of it. But it’s a good call and I’m totally for making this more configurable…\n. We should re test this behavior on the latest version of iOS I guess. I'll see if I can do in the upcoming week.=\n. So I couldn’t reproduce this anymore in iOS8 and the current master from css-modal.\n. Firefox gives me this result:\n![screen shot 2014-04-17 at 13 18 56](https://cloud.githubusercontent.com/assets/399345/2730906/1f02c276-c622-11e3-932d-8a6ecf12956c.png)\n. Oh, OS X 10.9, Firefox 31 (Nightly)\n. Thanks!\n. should be 100% or centered or smaller modal size:\n![screen shot 2014-04-30 at 10 09 50](https://cloud.githubusercontent.com/assets/399345/2838981/0f66022a-d03f-11e3-9c14-dbf7db53863b.png)\nsame:\n![screen shot 2014-04-30 at 10 10 27](https://cloud.githubusercontent.com/assets/399345/2838982/0f808834-d03f-11e3-8d62-de6e20f2da4a.png)\nvery same:\n![screen shot 2014-04-30 at 10 10 34](https://cloud.githubusercontent.com/assets/399345/2838983/0f91fae2-d03f-11e3-944c-830e19e7d698.png)\nimg should be centered in mobile view, looks not ideal right now. \n![screen shot 2014-04-30 at 10 10 41](https://cloud.githubusercontent.com/assets/399345/2838984/0f9413ea-d03f-11e3-8bbe-3809b78fc78a.png)\n. > check if we really want to include third party stuff like polyfills\n\nI do see this is a problem because it bloats up the other code. Can we modularize the whole thing and split it up again in two files, the plugin itself and a polyfill file?\n. > test cross devices and browser\n- Currently, IE8 fails completely for me do show a modal\n- IE9 kind of works but fails on portrait image calculating the height (probably 'on load' only?!), also cannot apply the close pseudo-element position\n- IE10 fails also calculating the proper height (probably 'on load' only?!)\n- IE11 fails also calculating the proper height (probably 'on load' only?!)\n. Hi, thanks for the great feedback. We’ll have a look at it and will definitely try to fix all the issues occurring with libsass. Until now, css-modal does not support libsass officially, but it’s a goal to support it. Any Pull Request fixing some of the issues is greatly appreciated by the way.\n. You want to write @extend %modal not mention me I guess.\nAlso you have the img elements commented out, toggle that to get it work? Hope this helps…\n\n---\n\nAnselm\n\n> On 03 May 2014, at 14:06, ziiweb notifications@github.com wrote:\n> \n> Hi,\n> \n> Im trying to set up a modal example, but I can not get it..\n> \n> This is my ALL my code:\n> \n>   <section class=\"semantic-content\" id=\"modal-text\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label\" aria-hidden=\"true\">\n>     <div class=\"modal-inner\">\n>       <div class=\"modal-content\">\n>          <!-- <img 1>-->\n>          <!-- <img 2>-->\n>       </div>\n>     </div>\n>     <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\" data-close=\"Close\" data-dismiss=\"modal\">×</a>\n>   </section>\n> A demo with some pictures\n> \n> Inside a .scss I have this:\n> \n> @import \"modal\";\n>   //...\n>   .content {\n>     .modal-inner {\n>     @anselmh extend %modal;\n> }\n> The pictures insde .modal-content are hidden, but how to show them when I click on one of them?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. You point the a href to the id modal-pictures but the modal only has the id modal-text. If you unify this, does it work then?\n\n---\n\nAnselm\n\n> On 04 May 2014, at 05:35, ziiweb notifications@github.com wrote:\n> \n> Sorry, I don't know exactly why I mentioned you 0_o, actually my code is:\n> \n>   <a title=\"Clicking this link shows the modal\" class=\"call-modal\" href=\"#modal-pictures\">A demo with some pictures</a>\n>   <section class=\"semantic-content\" id=\"modal-text\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label\" aria-hidden=\"true\">\n>     <div class=\"modal-inner\">\n>       <div class=\"modal-content\">\n>         <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n>         <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n>       </div>\n>     </div>\n>     <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\" data-close=\"Close\" data-dismiss=\"modal\">×</a>\n>   </section>\n> and\n> \n> @import \"modal\";\n>   //...\n> \n> ```\n> .modal-inner {\n>     extend %modal;\n> }\n> ```\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. The code now looks okay but we cannot reconstruct the issue unless you provide us a live demo of your code where we can debug. Thanks!\n. Currently not but you can target each photo by its id.\n\nA full sliding plugin with arrows is in the works and may follow in the next weeks here.\n\n---\n\nAnselm\n\n> On 03 May 2014, at 14:32, ziiweb notifications@github.com wrote:\n> \n> Is is possible to click on an arrow to slide the pictures?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. You can do this with not too much effort by using another div or similar to apply the background to and then shifting the close button into the dialog. But it's unfortunately not something that could be offered as a direct option.\n. You can use stacked modals for it with which it should work by default: https://github.com/drublic/css-modal/blob/master/modal.js#L210\nOr you can call these methods manually listening to the custom events fired by CSS Modal.\n\nThird option, if you use it to display images or similar things, there’s a gallery plugin in the plugins folder. This takes care of displaying a prev/next navigation and uses only one modal for the different contents.\n\nDoes that answer your question?\n. Could you please provide some details about the OS version you're using?\n\n---\n\nAnselm\n\n> On 03 Sep 2014, at 18:26, drimlike notifications@github.com wrote:\n> \n> Hey!\n> Would you have a solution to fix this issue? See picture.\n> \n> In fact when the browser bar is hidden, either on iOS or Android, the X pixels used by the bar in the screen is missing at the bottom of the modal.\n> \n> Steps\n> \n> the iOS browser bar is 40px high\n> click the button to display the modal\n> scroll the modal to the bottom\n> as soon as the bar is hiding, there is a space equivalent to the bar height that is created at the bottom of the screen. Something to do with the overflow.\n> you then see the scrollable content of the body\n> Would you have a pure CSS fix for that?\n> Cheers,\n> Damien\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Fully agree.\n\n> On 12 Oct 2014, at 22:00, Hans Christian Reinl notifications@github.com wrote:\n> \n> Remove all effects from the core behavior of the modal and provide it as a plugin.\n> Mostly these effects won't be used on any serious website and thus should not be part of the modal.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Merged in https://github.com/drublic/css-modal/commit/b573a7a92b757f2d53d6a0af8c63cf97ead4f637, thanks!\n. True. Only max-width then.\n. You also probably be a bit more flexible using this additional line of code:\n\n```\n.modal-content {\n    max-height: 400px;\n    max-height: 70vh;\n}\n```\n\nAlthough vh should be 90vh to the whole modal I think. This 70vh is a quick fix for current base.\n. I am not sure if we should drop vh also in here as iOS has a problem interpreting vh in media queries…\n. Found the solution. This is because the modal is small enough so Firefox removes vertical scrollbars.\nSolved by adding `overflow-y: scroll` but not sure if this should be prevented somehow in modal…?\n. As I never again experienced this 'bug' and nothing was raised by other users here, I am closing this issue now. Please reopen with more details on which browser is affected if you can reproduce this.\n. @sebald Without knowing you exact problem I don't see a reason why this should result in an error. It's up to you how you name your modal's ID. If I misunderstood you, please can you elaborate on your issue?\n. I vote against. This is unexpected behavior for the user and should not be done in js. If aria is not used by developers this is a different problem which should be tackled other way.\n. Opera, Firefox on OS X working pretty fine. Browserstack can have issues on that kind of things as it's loading an embedded iframe with some delay which might not be awaited by browserstack.\n. I personally prefer the current (not PR) text except for the one sentence I commented on in diff. But this is just my opinion.\n. This also applies for Android Chrome and Opera 14.\n. As all related issues are closed, what's the status here?\n. Have you guys checked out branch [wip-1.1.0](https://github.com/drublic/css-modal/tree/wip-1.1.0) yet? This issue should be fixed already in the upcoming release. You can use this branch's code already although not all tasks for 1.1 have been finished.\n. @jme783 Thanks for reporting back. Then we need to investigate further here +@drublic.\n. It would be great if you could write down your working hack here then, so others can profit from it, too. :)\n. ```\nselector { \n    … \n    last-property: value\\0/; \n}\n```\n\nshould be enough.\n. Of course, sorry. Then you have to go the MQ way \n. Nope, this no bug, there is no interactivity on the example yet. I'm closing this for now but you're kindly invited to fork, edit and send a pull-request to add the feature you expected to see here.\n. Sorry for closing, @drublic. I do think it would make sense, yes.\n. I would prefer an extra branch over extra repository.\n. Valid PR and looks fine to me to be merged.\n. Can you provide the code example where it is not working?\n\nI cannot confirm the issue using IE8 (w/Flash as nothing else would work in IE8) and the demo video modal (http://drublic.github.io/css-modal/#modal-embed).\n. Hey, unfortunately jsfiddle itself seems to have no IE8 support. Viewing it as fullscreen jsfiddle-preview has the following result:\n- YouTube is displayed directly (without triggering the modal) – might be a Flash embed issue (wmode might be necessary)\n- The modal seems to not work at all. Do you use the latest code of the modal?\n\nTo properly debug this we would need the complete test case I think. You can also send this via e-mail if you don't want to have it public.\n. This might be related to Flash playback used in IE8. Not sure if this can be fixed.\n. Hi @richardatwork, could you provide a working example or at least a screenshot what error happens?\n. Well, I can confirm that somehow on my iPhone5 but this rather looks like a general issue with the site on mobile. Maybe another script is catching calls? I don't have the time to dig in deeper right now, sorry. Maybe in the next days…\n. Looks good to me and makes sense to convert to hex code.\n. Thanks for the additional details. As I am able to confirm this, I now reopen the issue. A bugfix is coming soon! For the time being you can fix this by extending the `:target` selectors by:\n\n```\n&:target,\n&.is-active {\n    …\n}\n```\n\nAs the `.is-active` class is set by the js this will then trigger your modal on load.\n. Damn you stole my feature request :D just wanted to propose this when I read the cordons article. If you want you can assign this to me and I'll try to do this in the next days\n. So we need to close down less-branch properly and separate this into a new repository. I therefore am changing the title according to the tasks.\n. Oh man, sorry I must have overseen this issue :(\nYou can adjust the modal height by changing the `.modal-content` `max-height: 70vh` value. This currently limits the height to 70% of the viewport height on Desktop. Ensure you are also updating the different values specified in several media-queries.\n\nIf this doesn't work for you, a working demo would be great for analyzing.\n. I am closing this issue now hoping you have solved the problem. If not, feel free to provide more details and reopen it. :)\n. Thanks for reporting and fixing (LGTM). I would prefer a colon instead because the `-` is not a true replacement but have no strong opinion on that and leave it to @drublic to decide. ;)\n. Hi @jimzar you can simply call the modal by targeting the id of the html element by the hash:\n\n```\nwindow.location.hash = 'modal';\n```\n. Fully agree on that.\n\n---\n\nAnselm\n\n> On 25.09.2013, at 10:14, Hans Christian Reinl notifications@github.com wrote:\n> \n> I've changed my mind in so for that I think the LESS port should be maintained in another repo.\n> Here are the advantages:\n> \n> own build status for with Travis\n> clear separation in PRs and issues\n> own repo registered in Bower\n> Any objections?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Hi,\n\nThis is not yet \"supported\" by default (think it will be in 1.1). You have to deal with the modals own events.\n\n```\ncssmodal:show / hide\n```\n\nFires when an modal is open or not. You need to start stop and target the video within your event handler function.\nI've done that once and can show you the code in ~1 week when I'm back from vacation (if no one else jumps in here).\n\n---\n\nAnselm\n\n> On 02.09.2013, at 04:49, Santiago Baigorria notifications@github.com wrote:\n> \n> Hi guys,\n> \n> I'd like to submit an update request. I'm experiencing a bug when trying to \"load\" or \"use\" multiple modal boxes with different YouTube iFrame's each (one vid for each modal).\n> \n> However, when I click for instance in modal 1, and then close it (with or without having played the video), and then click to open modal 2 (containing another video), the same video that was on modal one shows up. BUT if I refresh the page, and open modal 2 first, then that video will show up in modal 1 instead.\n> \n> Don't understand what's going on... I'm anyways no jQuery expert so... I'd love to know if anyone knows how to fix this.\n> \n> Thanks a lot,\n> Santiago Baigorria\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. That's what I exactly planned to integrate into v1.1 - allowing multiple videos and more important - better documentation on such cases.\n\n---\n\nCheers!\n-Anselm\n\n> On 02.09.2013, at 11:39, SergeySnegirev notifications@github.com wrote:\n> \n> Hi,\n> I just ran into this issue and solved it. CSS Modal guys use the following technique to stop video when modal is closed (pseudocode):\n> \n> on HIDE store iframe source into data-src attribute, then set src to empty string\n> on SHOW check if iframce source is empty, then restore it from data-src attribute\n> The problem is, they only planned for ONE video on the page, so they use the following selector to catch the iframe: var $video = $('.semantic-content iframe');\n> \n> Now we need to only catch the currently displayed video, so let's modify the selector to:\n> var $video = $('.semantic-content.is-active iframe');\n> \n> Voila, enjoy.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Here are quite a few IE8- hacks listed: http://browserhacks.com/\n. Hey,\n\nregarding 1: Yes, definitely wanted but I do think we will need to shift this into 1.2.0 as this needs some more re-structuring in the code and 1.1 should be served as soon as possible now.\nregarding 2: Do you have a proposal how to handle this? It could be done with an data-attribute but I'm not sure if we want to do that as it shifts layout properties into html markup. But maybe you have a better solution how to handle that?\n\nThanks for your feedback! :)\n-Anselm\n. Well, be sure we will keep care of this (in my personal opinion right after 1.1 shipped). But I want to let the decision about the handling of this up to @drublic so let's wait what he says about this feature-request.\n. Hm… not directly. This issue is more about more manageable breakpoints but at least branch `plugin-resize` will tackle a bit of the problem.\n. Hi @SandraK, thank you for reporting this issue. I can reproduce this viewing your demo page but haven't had the time yet to look closer into the code you use.\nYou could try to use the css-modal from the v1.1.0 branch but I am not sure if this will fix it. I hope to find some time in the next days to have a closer look into the issue.\n\nThank you so much for your patience, I am very sorry that it took that long for a first reply!\n. The demo doesn't include CSS-Modal anymore. Therefore I am closing this issue as it's not reproducible anymore.\n. You need to move the `@keyframes` sections outside the `@media` section because IE10 gets mixed up by the 'nested @'. The call to keyframes can stay there. \n\nInteresting but this isn't our problem. It is simply we are not using the `-ms-` prefix in the transition. Thanks for reporting, we will fix this soon. For now simply add in before line 319 (https://github.com/drublic/css-modal/blob/master/modal.scss#L319) a `-ms-transition: opacity 0.4s;`.\n. Well, it would be awesome if you could look into it and report (or maybe send a PR rearding this on v1.1). :)\n. This works fine in my tests in IE10, 11 under WIN7 + WIN 8 with both, v1.0 and v1.1. Therefore closing this now.\n. Yeah, reading the docs from MS they confirm it works w/o prefix. Must have been a wrong information I got somewhere else. Therefore closing the PR. Thanks for reviewing and comments!\n. @alrra @impressivewebs you can read about this here as described by impressivewebs: http://msdn.microsoft.com/en-us/library/ie/hh673535(v=vs.85).aspx\n\n> Note  The properties and event described in this topic previously required a Microsoft-specific vendor prefix, \"-ms-\", to work with Internet Explorer 10 and Windows Store apps using JavaScript. This prefix is no longer required, but will still be recognized. To ensure compatibility in the future, applications using the Microsoft vendor prefix with transition properties should be updated accordingly.\n. Just had a quick look on it, here are my comments:\n- livereload is missing as dependency in package.json while it is called in Gruntfile.js\n- you have introduced a line-break issue at least in the package.json file (check the diff)\n  In general I would prefer to have different smaller commits and Pull-Requests, one for each task. This makes it more maintainable and easier to merge parts of it.\n  It would be great if you could fix the remaining issues first by amending the commit.\n. Hi, thanks for your comment but it seems the elements have been eaten by github. Can you fix that so we can see what tags you mean?\n. Hi,\n\nyou can see the details in #34. Be sure to use v1.1.0 branch for that as there landed a fix (#55) which will work better on pageload.\nPlease re-open if you still have problems with it.\n. You're welcome! :)\n\n---\n\nAnselm\n\n> On 10 Oct 2013, at 20:23, mard73 notifications@github.com wrote:\n> \n> Worked great! Thanks so much for all your help.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks for the updates on the issues. This would be a very unexpected behavior indeed. I am closing this issue for now. Please report back here if you can reproduce this within a fresh browser.\n. Hi,\ncan you please elaborate what the misbehavior is here and in what IE versions it happens? From the screenshot I cannot really see the problem so it would be great if you could say what 'too big' means (by providing the calculated values or just a comparison screenshot).\nThank you for reporting this issue.\n. Hi, can you tell us what version you use here? Is it the master branch or wip-1.1.0? If it's the master branch, please check out the latest code from wip-1.1.0 and #70 and report back if it's solved or not with more details. \n. Thanks for your feedback. This is most probably due to the fact that the page uses the older version and it is likely already fixed in upcoming v1.1. Until I confirmed that, I'm leaving this issue open.\n. Hi @SantzDesign, they're already in the v1.1.0 branch. You can find them here https://github.com/drublic/css-modal/blob/wip-1.1.0/_modal-core.scss#L333 and use them. \n. Works fine (in my tests) so I'm going to close this issue now.\n. Sent a pull request with the changed naming here: #82 \n. I tested this in our basic visual test. Though I cannot speak for the given case (stated by the author) I think this should be fixed by the commit.\n. Hi, it's hard to follow your issues without seeing the code you use. Could you either provide us a link to the (non)working demo or create a jsbin?\n. The only issue I can confirm on the link you've sent is that the video doesn't stop when hiding the modal. This should be done with JavaScript. All other issues don't appear in the browsers I tested (Firefox, Chrome).\n. I'm going to close this now. The solution is to add the `?wmode=transparent` parameter to YouTube URLs so that video works within the modal if it is played through Flash.\n\nPlease re-open if this is not the correct solution and clarify.\n. Yes, this should be done in JavaScript IMO. It’s a simple thing and should be added in a future version to improve video/audio support.\n. I think there’s a better way to do this. Will dig into when finding some time, thanks for your report and quick solution.\n. Yes, think this would be a good idea. We also could provide one plugin for html5 video and another for the vimeo API then…\n. There is a 404 error on the modal.js file so fixing that might probably fix your problem.\n. Now take this one. Fine now? ;)\n. Could you please elaborate which method to embed the Wufoo form you used and how you implemented it? Also, a demo / link to it would be very useful to track the issues down. :) Thanks!\n. This is a bit weird… do you use a tagged version or the latest master? Also, have you done some customizing in the scss?\n. Thanks, can you share a demo link of this? Also, could you see some issues looking into the Developer Tools of your browser that gives you a clue why this happens? Would help us a lot to track down the issue.\n. It’s hard to say what went wrong here and I’m not quite sure what the jQuery Migrate code does exactly (maybe this could also affect the modal though it shouldn't). Unfortunately I’ll not be able to help you further without a fully reproducable page to have a look at. If you can provide such, I’m happy to have a look at.\n. I'll see if I can do in the upcoming week but I'm in favor of only providing a small set of 1-2 effects for it to keep this maintainable and tiny.\n\n> On 12 Oct 2014, at 19:19, Hans Christian Reinl notifications@github.com wrote:\n> \n> @anselmh Is this something you want to work on?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. I guess your 1) is related to #32 and should be discussed over there. It would be great to have some more insight over there and maybe the demo link.\n\n2) I can't confirm that with your given link. Can you assure that still happens and if, in which browser and OS and where exactly so we can try to reproduce this?\n. Hi, I still can’t reproduce any jumping behavior on your page (tested Mavericks + Firefox, Chrome, Safari). Also your description talks about 'jumping', about 'wrongly shown images'—I can’t confirm them on your test page. If these issues still exist on your side and you can eliminate that it’s only a local problem on your computer, I'd be happy to see a short screencast so that we can know what you experience as issues. Otherwise it’s bit hard to debug as we don’t even know for sure what you experience.\n. Hi, it’s an [1*1px png as dataURI](https://github.com/drublic/css-modal/blob/master/_modal-theme.scss#L61) that is used as overlay currently. You’d need to replace this currently to change the color of it. But it’s a good call and I’m totally for making this more configurable…\n. We should re test this behavior on the latest version of iOS I guess. I'll see if I can do in the upcoming week.=\n. So I couldn’t reproduce this anymore in iOS8 and the current master from css-modal.\n. Firefox gives me this result:\n![screen shot 2014-04-17 at 13 18 56](https://cloud.githubusercontent.com/assets/399345/2730906/1f02c276-c622-11e3-932d-8a6ecf12956c.png)\n. Oh, OS X 10.9, Firefox 31 (Nightly)\n. Thanks!\n. should be 100% or centered or smaller modal size:\n![screen shot 2014-04-30 at 10 09 50](https://cloud.githubusercontent.com/assets/399345/2838981/0f66022a-d03f-11e3-9c14-dbf7db53863b.png)\nsame:\n![screen shot 2014-04-30 at 10 10 27](https://cloud.githubusercontent.com/assets/399345/2838982/0f808834-d03f-11e3-8d62-de6e20f2da4a.png)\nvery same:\n![screen shot 2014-04-30 at 10 10 34](https://cloud.githubusercontent.com/assets/399345/2838983/0f91fae2-d03f-11e3-944c-830e19e7d698.png)\nimg should be centered in mobile view, looks not ideal right now. \n![screen shot 2014-04-30 at 10 10 41](https://cloud.githubusercontent.com/assets/399345/2838984/0f9413ea-d03f-11e3-8bbe-3809b78fc78a.png)\n. > check if we really want to include third party stuff like polyfills\n\nI do see this is a problem because it bloats up the other code. Can we modularize the whole thing and split it up again in two files, the plugin itself and a polyfill file?\n. > test cross devices and browser\n- Currently, IE8 fails completely for me do show a modal\n- IE9 kind of works but fails on portrait image calculating the height (probably 'on load' only?!), also cannot apply the close pseudo-element position\n- IE10 fails also calculating the proper height (probably 'on load' only?!)\n- IE11 fails also calculating the proper height (probably 'on load' only?!)\n. Hi, thanks for the great feedback. We’ll have a look at it and will definitely try to fix all the issues occurring with libsass. Until now, css-modal does not support libsass officially, but it’s a goal to support it. Any Pull Request fixing some of the issues is greatly appreciated by the way.\n. You want to write @extend %modal not mention me I guess.\nAlso you have the img elements commented out, toggle that to get it work? Hope this helps…\n\n---\n\nAnselm\n\n> On 03 May 2014, at 14:06, ziiweb notifications@github.com wrote:\n> \n> Hi,\n> \n> Im trying to set up a modal example, but I can not get it..\n> \n> This is my ALL my code:\n> \n>   <section class=\"semantic-content\" id=\"modal-text\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label\" aria-hidden=\"true\">\n>     <div class=\"modal-inner\">\n>       <div class=\"modal-content\">\n>          <!-- <img 1>-->\n>          <!-- <img 2>-->\n>       </div>\n>     </div>\n>     <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\" data-close=\"Close\" data-dismiss=\"modal\">×</a>\n>   </section>\n> A demo with some pictures\n> \n> Inside a .scss I have this:\n> \n> @import \"modal\";\n>   //...\n>   .content {\n>     .modal-inner {\n>     @anselmh extend %modal;\n> }\n> The pictures insde .modal-content are hidden, but how to show them when I click on one of them?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. You point the a href to the id modal-pictures but the modal only has the id modal-text. If you unify this, does it work then?\n\n---\n\nAnselm\n\n> On 04 May 2014, at 05:35, ziiweb notifications@github.com wrote:\n> \n> Sorry, I don't know exactly why I mentioned you 0_o, actually my code is:\n> \n>   <a title=\"Clicking this link shows the modal\" class=\"call-modal\" href=\"#modal-pictures\">A demo with some pictures</a>\n>   <section class=\"semantic-content\" id=\"modal-text\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label\" aria-hidden=\"true\">\n>     <div class=\"modal-inner\">\n>       <div class=\"modal-content\">\n>         <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n>         <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n>       </div>\n>     </div>\n>     <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\" data-close=\"Close\" data-dismiss=\"modal\">×</a>\n>   </section>\n> and\n> \n> @import \"modal\";\n>   //...\n> \n> ```\n> .modal-inner {\n>     extend %modal;\n> }\n> ```\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. The code now looks okay but we cannot reconstruct the issue unless you provide us a live demo of your code where we can debug. Thanks!\n. Currently not but you can target each photo by its id.\n\nA full sliding plugin with arrows is in the works and may follow in the next weeks here.\n\n---\n\nAnselm\n\n> On 03 May 2014, at 14:32, ziiweb notifications@github.com wrote:\n> \n> Is is possible to click on an arrow to slide the pictures?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. You can do this with not too much effort by using another div or similar to apply the background to and then shifting the close button into the dialog. But it's unfortunately not something that could be offered as a direct option.\n. You can use stacked modals for it with which it should work by default: https://github.com/drublic/css-modal/blob/master/modal.js#L210\nOr you can call these methods manually listening to the custom events fired by CSS Modal.\n\nThird option, if you use it to display images or similar things, there’s a gallery plugin in the plugins folder. This takes care of displaying a prev/next navigation and uses only one modal for the different contents.\n\nDoes that answer your question?\n. Could you please provide some details about the OS version you're using?\n\n---\n\nAnselm\n\n> On 03 Sep 2014, at 18:26, drimlike notifications@github.com wrote:\n> \n> Hey!\n> Would you have a solution to fix this issue? See picture.\n> \n> In fact when the browser bar is hidden, either on iOS or Android, the X pixels used by the bar in the screen is missing at the bottom of the modal.\n> \n> Steps\n> \n> the iOS browser bar is 40px high\n> click the button to display the modal\n> scroll the modal to the bottom\n> as soon as the bar is hiding, there is a space equivalent to the bar height that is created at the bottom of the screen. Something to do with the overflow.\n> you then see the scrollable content of the body\n> Would you have a pure CSS fix for that?\n> Cheers,\n> Damien\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Fully agree.\n\n> On 12 Oct 2014, at 22:00, Hans Christian Reinl notifications@github.com wrote:\n> \n> Remove all effects from the core behavior of the modal and provide it as a plugin.\n> Mostly these effects won't be used on any serious website and thus should not be part of the modal.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Merged in https://github.com/drublic/css-modal/commit/b573a7a92b757f2d53d6a0af8c63cf97ead4f637, thanks!\n. ",
    "sebald": "I ran into a similiar problem today, b/c Sizzle did throw some weird errors. I tracked the source down to CSS-Modal. I doesn't brake the site or anything. But the error messages are kinda unpleasant.\n\nWhat about an additional \"namespace\" for the modal to solve conflicts like that.\nLike: `http://example.com/#modal=myModal` and care only about hashchange events with the namespace.\n\nThe `=` maybe not a good idea here. But it is semantically clear.\n. @anselmh I actually noticed that the version the project I am working on is older. Newser version of CSS-Modal do not use jQuery anymore, but I think it still could lead to problems with other JS.\nLet me try again :)\n\nCCS-Modal and the other plugin are working toghether without disrupting one another. But what make me uncomfortable is the fact that CSS-Modal is greedy when it comes to hash changes. Meaning, for whatever reason the hash changes CSS-Modal recognizes that change and tries to find and show a modal.\n\nI find it problematic that it always tries to find/show a modal, because this could possibly lead to a conflict with other JavaScript if the CSS-Modal isn't robust enough and throws an error. I guess in 80% of the time there will be no issue, but it would be nice if you could pass the CSS-Modal an option so it \"runs\" in its own scope.\n\nOne solution to this woul be what @Schepp suggested. Another one would be to use a prefix in the hash so that CSS-Modal only runs when the hash contains the prefix.\n. I ran into a similiar problem today, b/c Sizzle did throw some weird errors. I tracked the source down to CSS-Modal. I doesn't brake the site or anything. But the error messages are kinda unpleasant.\n\nWhat about an additional \"namespace\" for the modal to solve conflicts like that.\nLike: `http://example.com/#modal=myModal` and care only about hashchange events with the namespace.\n\nThe `=` maybe not a good idea here. But it is semantically clear.\n. @anselmh I actually noticed that the version the project I am working on is older. Newser version of CSS-Modal do not use jQuery anymore, but I think it still could lead to problems with other JS.\nLet me try again :)\n\nCCS-Modal and the other plugin are working toghether without disrupting one another. But what make me uncomfortable is the fact that CSS-Modal is greedy when it comes to hash changes. Meaning, for whatever reason the hash changes CSS-Modal recognizes that change and tries to find and show a modal.\n\nI find it problematic that it always tries to find/show a modal, because this could possibly lead to a conflict with other JavaScript if the CSS-Modal isn't robust enough and throws an error. I guess in 80% of the time there will be no issue, but it would be nice if you could pass the CSS-Modal an option so it \"runs\" in its own scope.\n\nOne solution to this woul be what @Schepp suggested. Another one would be to use a prefix in the hash so that CSS-Modal only runs when the hash contains the prefix.\n. ",
    "xzyfer": "If it isn't already a thing, maybe history api integration is a better approach here. Being able to navigate backward through a chain of modals could be really useful.\n. If it isn't already a thing, maybe history api integration is a better approach here. Being able to navigate backward through a chain of modals could be really useful.\n. ",
    "juliangruber": "Cool! I'd place the `open example` links on the top of the page though so the page doesn't jump to top.\n. Cool! I'd place the `open example` links on the top of the page though so the page doesn't jump to top.\n. ",
    "staabm": "just add a \"return false\" onclick handler and you are fine.\n. just add a \"return false\" onclick handler and you are fine.\n. ",
    "kahlil": "Or use a button tag instead of a link?\n. Yes, I am very confident in @drublic's ability to find a fix as well. :+1: :smile: \n. Sweet. Works great now. \n\nAm 10.05.2013 um 23:10 schrieb Hans Christian Reinl notifications@github.com:\n\n> And here is the solution. Pretty easy. Please let me know if you find any bugs in this fix.\n> I've also added a test to prevent regression.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Or use a button tag instead of a link?\n. Yes, I am very confident in @drublic's ability to find a fix as well. :+1: :smile: \n. Sweet. Works great now. \n\nAm 10.05.2013 um 23:10 schrieb Hans Christian Reinl notifications@github.com:\n\n> And here is the solution. Pretty easy. Please let me know if you find any bugs in this fix.\n> I've also added a test to prevent regression.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. ",
    "Schepp": "I think it's the doctype! ;D\n\nJokes aside, the reason is that the body is being set to `overflow: hidden`, and I think @drublic is well aware of it and will find a good fix.\n. I think it's the doctype! ;D\n\nJokes aside, the reason is that the body is being set to `overflow: hidden`, and I think @drublic is well aware of it and will find a good fix.\n. ",
    "ryanseddon": "You may want to checkout @benschwarz http://benschwarz.github.io/gallery-css/ project where he uses a super cool trick to stop the jump happening by using hidden divs with the ids that then use general sibling combinator (~) to target the right item.\n. You may want to checkout @benschwarz http://benschwarz.github.io/gallery-css/ project where he uses a super cool trick to stop the jump happening by using hidden divs with the ids that then use general sibling combinator (~) to target the right item.\n. ",
    "benschwarz": "Thanks @ryanseddon, I was actually going to PR something when I saw this project, but I hadn't had the chance yet. \n. No sweat. Danke. \n. Thanks @ryanseddon, I was actually going to PR something when I saw this project, but I hadn't had the chance yet. \n. No sweat. Danke. \n. ",
    "tzi": "Less code for less bug.\nIt is the better way to fix issue :)\n. Sure!\nThanks for testing this!\n. I am on Linux 12.04\nI understand that you closed this issue, since it seems just not working for me ;)\n\nSee you,\nThomas.\n. Less code for less bug.\nIt is the better way to fix issue :)\n. Sure!\nThanks for testing this!\n. I am on Linux 12.04\nI understand that you closed this issue, since it seems just not working for me ;)\n\nSee you,\nThomas.\n. ",
    "mkkwon": "Same here. Just posting to bump this thread and check the status of this. Apparently it also happens in the Chrome iOS app.\n\niOS 6.1.2\n. There is a workaround for this,.. Sorta. Make the anchor href link for \"Close\" button to href=\"#page\" and then set the body's id to \"page\". The close button will serve as an anchor link to redirect users to the top of the page. This pattern is seen in lukew.com, with his navigation serving as bottom anchor links that also has a link redirecting to the top.\n\nHowever it does not address the main issue of modal triggering page jump, so the issue should still remain open.\n. Same here. Just posting to bump this thread and check the status of this. Apparently it also happens in the Chrome iOS app.\n\niOS 6.1.2\n. There is a workaround for this,.. Sorta. Make the anchor href link for \"Close\" button to href=\"#page\" and then set the body's id to \"page\". The close button will serve as an anchor link to redirect users to the top of the page. This pattern is seen in lukew.com, with his navigation serving as bottom anchor links that also has a link redirecting to the top.\n\nHowever it does not address the main issue of modal triggering page jump, so the issue should still remain open.\n. ",
    "jme783": "Does anyone have a way to prevent this mkkwon's solution works for closing the modal but what about opening it?\n. Has anyone discovered a workaround for this issue that they can share here?  The page jump for iOS is creating other issues that are causing breakages in the style, especially on changing orientation from portrait to landscape.\n\nHelp would be greatly appreciated.\n. Just tried the new modal.css and modal.js files for this branch. Still seeing this issue.\n. No problem. Just let me know if/when there is a fix. I'll try to hack something in the intermediary\n. Here's what I did to prevent this from happening on my end. It's not ideal, but the page jump doesn't happen. I think the key is the fact that position:fixed is used for the modal.\n\nIf the user loads the page with the modal hash, remove it so the page doesn't jump.\n\n```\nvar hash = window.location.hash;\nif (hash == \"#lf-widget-modal\") {\n  window.location.hash = \"\";\n}\n```\n\nAlso change the position of the semantic content div, modal inner, and modal close to absolute for mobile devices\n\n```\n@media screen and (max-width: 30em) {\n    .semantic-content, .semantic-content .modal-inner, .semantic-content .modal-close {\n    /* styles */\n    position: absolute;\n }\n```\n\nThis gets rid of the nice slide up animation of the modal for mobile, but it was a price I had to pay to prevent the page jump.\n. Does anyone have a way to prevent this mkkwon's solution works for closing the modal but what about opening it?\n. Has anyone discovered a workaround for this issue that they can share here?  The page jump for iOS is creating other issues that are causing breakages in the style, especially on changing orientation from portrait to landscape.\n\nHelp would be greatly appreciated.\n. Just tried the new modal.css and modal.js files for this branch. Still seeing this issue.\n. No problem. Just let me know if/when there is a fix. I'll try to hack something in the intermediary\n. Here's what I did to prevent this from happening on my end. It's not ideal, but the page jump doesn't happen. I think the key is the fact that position:fixed is used for the modal.\n\nIf the user loads the page with the modal hash, remove it so the page doesn't jump.\n\n```\nvar hash = window.location.hash;\nif (hash == \"#lf-widget-modal\") {\n  window.location.hash = \"\";\n}\n```\n\nAlso change the position of the semantic content div, modal inner, and modal close to absolute for mobile devices\n\n```\n@media screen and (max-width: 30em) {\n    .semantic-content, .semantic-content .modal-inner, .semantic-content .modal-close {\n    /* styles */\n    position: absolute;\n }\n```\n\nThis gets rid of the nice slide up animation of the modal for mobile, but it was a price I had to pay to prevent the page jump.\n. ",
    "anselm-urban": "Here you´ll find a hack for only influencing IE8: http://browserhacks.com/\nYou could do the following for IE8: @media \\0screen {} \n. According to http://browserhacks.com/#ie this also covers IE9!\n. How can I update my pull request??\n. Sorry, now I finally know how to update pull requests! :grin: \n. You´re right, I just wanted to figure out how to update my PR on my forked repo. (not with git bash)\n. The problem occurs on http://drublic.github.io/css-modal/#modal-text\nNot only is the transition not displayed at all, you also can´t click the close link (in the mobile version of the modal). To close the modal, you must click BELOW the button.\n\nIn Firefox, the closing transition is only sometimes displayed, the opening transition works fine. The problem also occurs on the official site.\n\nI will try out the latest code from wip-1.1.0, hopefully it works.\n. Here you´ll find a hack for only influencing IE8: http://browserhacks.com/\nYou could do the following for IE8: @media \\0screen {} \n. According to http://browserhacks.com/#ie this also covers IE9!\n. How can I update my pull request??\n. Sorry, now I finally know how to update pull requests! :grin: \n. You´re right, I just wanted to figure out how to update my PR on my forked repo. (not with git bash)\n. The problem occurs on http://drublic.github.io/css-modal/#modal-text\nNot only is the transition not displayed at all, you also can´t click the close link (in the mobile version of the modal). To close the modal, you must click BELOW the button.\n\nIn Firefox, the closing transition is only sometimes displayed, the opening transition works fine. The problem also occurs on the official site.\n\nI will try out the latest code from wip-1.1.0, hopefully it works.\n. ",
    "DeanMachine": "Thanks so much for the quick response.  Works like a charm!\n. Thanks so much for the quick response.  Works like a charm!\n. ",
    "matt-bailey": "My thoughts are that at the moment it looks like a gallery, but doesn't behave like one (hence my original question). It's not a problem at all if you don't want to add any gallery functionality (after all, it's not what your module is about), but I would suggest maybe just laying out the images in a grid, rather than one main image and some thumbnails. Does that make sense do you think?\n. My thoughts are that at the moment it looks like a gallery, but doesn't behave like one (hence my original question). It's not a problem at all if you don't want to add any gallery functionality (after all, it's not what your module is about), but I would suggest maybe just laying out the images in a grid, rather than one main image and some thumbnails. Does that make sense do you think?\n. ",
    "4nduril": "I am happy that my little work is appreciated.\nI guess you are right not wanting to have Sass and LESS in parallel in the same branch. But I'm with @anselmh here: extra repo seems to be too much.\nAlso I added some changes (grunt tasks, test file) which should cover what you mentioned. I'm not competely sure about it though, because working with grunt is utterly new to me. (As is contributing to a Github project …)\n. You can load it by opening a url with fragment identifier. I.e. somesite.com/#modal1 for example.\n. You could do something like `location.hash = \"modal1\";`. Wrap it in any (callback) function you want to.\n. I am happy that my little work is appreciated.\nI guess you are right not wanting to have Sass and LESS in parallel in the same branch. But I'm with @anselmh here: extra repo seems to be too much.\nAlso I added some changes (grunt tasks, test file) which should cover what you mentioned. I'm not competely sure about it though, because working with grunt is utterly new to me. (As is contributing to a Github project …)\n. You can load it by opening a url with fragment identifier. I.e. somesite.com/#modal1 for example.\n. You could do something like `location.hash = \"modal1\";`. Wrap it in any (callback) function you want to.\n. ",
    "audibledesigns": "Thanks for the update!\n\nOn May 21, 2013, at 2:16 PM, Hans Christian Reinl notifications@github.com wrote:\n\n> Awesome work, @4nduril. Thanks again!\n> We now have a less-branch. I will publish the less version with the 1.1.0 release I think which should be pretty soon. I will also add another Bower component css-modal-less.\n> \n> Please let me know if you find any bugs or have more ideas on the LESS branch.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks for the update!\n\nOn May 21, 2013, at 2:16 PM, Hans Christian Reinl notifications@github.com wrote:\n\n> Awesome work, @4nduril. Thanks again!\n> We now have a less-branch. I will publish the less version with the 1.1.0 release I think which should be pretty soon. I will also add another Bower component css-modal-less.\n> \n> Please let me know if you find any bugs or have more ideas on the LESS branch.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. ",
    "esanmiguelc": "Here you go, it's got minor css modifications to padding and positioning but nothing else is changed from the download files. http://jsfiddle.net/Z5HFU/\n\nSideNote: I also see on the example files that when you close the modal youtube video while still runs it stops automatically. On my end it keeps running. I was looking for answers and only saw solutions for JS based modals, How did you work this out?\n\nThis is what i get from IE8:\n![image](https://f.cloud.github.com/assets/4564231/584869/394b3fc4-c929-11e2-8ea7-d25bb2328a89.png)\n\nAlso noticed it won't open after I closed it once on IE8 _sigh_\n. I somehow got this working on IE8, Did some redesign moved some things around, not sure what may have fixed it. Still having issues with the video playing after I exit the modal or use esc. key\n\nEDIT: what are you using to stop the video from running after I have hit the escape key? Video keeps running regardless of browser.\n. Here you go, it's got minor css modifications to padding and positioning but nothing else is changed from the download files. http://jsfiddle.net/Z5HFU/\n\nSideNote: I also see on the example files that when you close the modal youtube video while still runs it stops automatically. On my end it keeps running. I was looking for answers and only saw solutions for JS based modals, How did you work this out?\n\nThis is what i get from IE8:\n![image](https://f.cloud.github.com/assets/4564231/584869/394b3fc4-c929-11e2-8ea7-d25bb2328a89.png)\n\nAlso noticed it won't open after I closed it once on IE8 _sigh_\n. I somehow got this working on IE8, Did some redesign moved some things around, not sure what may have fixed it. Still having issues with the video playing after I exit the modal or use esc. key\n\nEDIT: what are you using to stop the video from running after I have hit the escape key? Video keeps running regardless of browser.\n. ",
    "hvc012": "ok. thank you\n. ok. thank you\n. ",
    "eirikhm": "Never mind. I can just include the skeleton modal and replace the contents :)\n. Never mind. I can just include the skeleton modal and replace the contents :)\n. ",
    "richardatwork": "I'll try it on a 4S, I got upgraded by my employer… I'll get you a screenshot.\nHere's the code for one of the modals - all I changed was the labels (I'm using the modals as lightweight slideshows). The media queries are all unaltered - I had a go at changing the max/min em values but it didn't seem to have any effect.\nOne thing did occur to me, to wrap the slideshow in a div to control the scaling, but that's already driven by flexsilder.js and behaves in everything else?\nFYI, also does the same thing on Blackberry (Curve).\n\nSorry of the bother, I know IOS is a pain...\n\n```\n<!-- modal -->\n\n        <!-- Call the modal by clicking this link -->\n        <a href=\"#modal-text1\" class=\"call-modal\" title=\"Clicking this link shows the modal\">Tell me about Volvo</a>\n\n        <!-- A modal with its content -->\n        <section class=\"semantic-content\" id=\"modal-text1\"\n                tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label1\" aria-hidden=\"true\">\n\n            <div class=\"modal-inner\">\n                <header>\n                    <h2 id=\"modal-label1\">Volvo Europe</h2>\n                </header>\n\n                <div class=\"modal-content\">\n                    <p><div class=\"flexslider\">\n                  <ul class=\"slides\">\n                    <li> <img src=\"images/sliderExample1.jpg\" /> </li>\n                    <li> <img src=\"images/sliderExample2.jpg\" /> </li>\n                    <li> <img src=\"images/sliderExample3.jpg\" /> </li>\n                  </ul>\n                </div></p>\n                </div>\n\n                <footer>\n                    <p>Commissioned in early 2011, Meda have be working with Volvo to deliver an experience strategy, aligning places, people and messages across the network, with the aim of creating a more effective - and carefully planned – retail sales and service environment.</p>\n<h6 class=\"icon icon-envelope\"><a href=\"mailto:info@experiencemeda.com?subject=The Volvo Europe Project on your website\"><br>\nGet in touch about this project</a></h6>\n</footer>\n            </div>\n\n          <!-- Use Hash-Bang to maintain scroll position when closing modal -->\n            <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\"\n                    data-dismiss=\"modal\">&times;</a>\n</section>\n\n<!-- /modal --> \n```\n. Hey, sure, thanks for the quick response. A (very rough and ready) experimental build is here http://www.medadesign.co.uk/responsive/index.html. \n. Hey, thanks for taking a look anyway. I'll keep testing and let you know if I find the fix.\n. I'll try it on a 4S, I got upgraded by my employer… I'll get you a screenshot.\nHere's the code for one of the modals - all I changed was the labels (I'm using the modals as lightweight slideshows). The media queries are all unaltered - I had a go at changing the max/min em values but it didn't seem to have any effect.\nOne thing did occur to me, to wrap the slideshow in a div to control the scaling, but that's already driven by flexsilder.js and behaves in everything else?\nFYI, also does the same thing on Blackberry (Curve).\n\nSorry of the bother, I know IOS is a pain...\n\n```\n<!-- modal -->\n\n        <!-- Call the modal by clicking this link -->\n        <a href=\"#modal-text1\" class=\"call-modal\" title=\"Clicking this link shows the modal\">Tell me about Volvo</a>\n\n        <!-- A modal with its content -->\n        <section class=\"semantic-content\" id=\"modal-text1\"\n                tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label1\" aria-hidden=\"true\">\n\n            <div class=\"modal-inner\">\n                <header>\n                    <h2 id=\"modal-label1\">Volvo Europe</h2>\n                </header>\n\n                <div class=\"modal-content\">\n                    <p><div class=\"flexslider\">\n                  <ul class=\"slides\">\n                    <li> <img src=\"images/sliderExample1.jpg\" /> </li>\n                    <li> <img src=\"images/sliderExample2.jpg\" /> </li>\n                    <li> <img src=\"images/sliderExample3.jpg\" /> </li>\n                  </ul>\n                </div></p>\n                </div>\n\n                <footer>\n                    <p>Commissioned in early 2011, Meda have be working with Volvo to deliver an experience strategy, aligning places, people and messages across the network, with the aim of creating a more effective - and carefully planned – retail sales and service environment.</p>\n<h6 class=\"icon icon-envelope\"><a href=\"mailto:info@experiencemeda.com?subject=The Volvo Europe Project on your website\"><br>\nGet in touch about this project</a></h6>\n</footer>\n            </div>\n\n          <!-- Use Hash-Bang to maintain scroll position when closing modal -->\n            <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\"\n                    data-dismiss=\"modal\">&times;</a>\n</section>\n\n<!-- /modal --> \n```\n. Hey, sure, thanks for the quick response. A (very rough and ready) experimental build is here http://www.medadesign.co.uk/responsive/index.html. \n. Hey, thanks for taking a look anyway. I'll keep testing and let you know if I find the fix.\n. ",
    "ScotsScripts": "That makes sense.  I was thinking more along the lines of arbitrarily opening it up on a page load regardless of which link they click on. For example, have the modal open on the 4th page load by a site visitor.  Is there a way to set that  #modal1 fragment identifie using javascript when the page loads?  Thanks for the help, I appreciate it.\n.  I was able to figure out how to make it work with your suggestion. This is going to help with something I'm working on, really appreciate the tip, thanks!\n. I just ran into an issue with this. In firefox when I change the hash, the modal doesn't automatically pop up.  The other browsers work as expected. Perhaps I'm not doing it right. In the head I have this (sm is the id of the modal):\n\n<script type=\"text/javascript\">window.location.hash = \"sm\";</script>\n\n<link rel=\"stylesheet\" href=\"css/modal.css\"></script>\n\n<script src=\"js/modal.js\"></script>\n\nIt's a very simple setup but even though #sm is being added to the URL, the modal doesn't automatically pop up. It will come up if I reload the URL with the #sm on it.  Any ideas?\n. Head example didn't come through, I'll try indenting it.\n\n```\n<script type=\"text/javascript\">window.location.hash = \"sm\";</script>\n<link rel=\"stylesheet\" href=\"css/modal.css\"></script>\n<script src=\"js/modal.js\"></script>\n```\n. That worked!  I went into the css file and found every instance of :target and basic went from this:\n\n```\n.semantic-content:target {\ndisplay: block\\9;\n }\n```\n\nto this:\n\n```\n.semantic-content:target, .semantic-content.is-active {\ndisplay: block\\9;\n }\n```\n\nThanks a lot for the help, it's very much appreciated.\n. That makes sense.  I was thinking more along the lines of arbitrarily opening it up on a page load regardless of which link they click on. For example, have the modal open on the 4th page load by a site visitor.  Is there a way to set that  #modal1 fragment identifie using javascript when the page loads?  Thanks for the help, I appreciate it.\n.  I was able to figure out how to make it work with your suggestion. This is going to help with something I'm working on, really appreciate the tip, thanks!\n. I just ran into an issue with this. In firefox when I change the hash, the modal doesn't automatically pop up.  The other browsers work as expected. Perhaps I'm not doing it right. In the head I have this (sm is the id of the modal):\n\n<script type=\"text/javascript\">window.location.hash = \"sm\";</script>\n\n<link rel=\"stylesheet\" href=\"css/modal.css\"></script>\n\n<script src=\"js/modal.js\"></script>\n\nIt's a very simple setup but even though #sm is being added to the URL, the modal doesn't automatically pop up. It will come up if I reload the URL with the #sm on it.  Any ideas?\n. Head example didn't come through, I'll try indenting it.\n\n```\n<script type=\"text/javascript\">window.location.hash = \"sm\";</script>\n<link rel=\"stylesheet\" href=\"css/modal.css\"></script>\n<script src=\"js/modal.js\"></script>\n```\n. That worked!  I went into the css file and found every instance of :target and basic went from this:\n\n```\n.semantic-content:target {\ndisplay: block\\9;\n }\n```\n\nto this:\n\n```\n.semantic-content:target, .semantic-content.is-active {\ndisplay: block\\9;\n }\n```\n\nThanks a lot for the help, it's very much appreciated.\n. ",
    "SantzDesign": "Hey guys look there are GREAT effects here at Codrops: http://tympanus.net/codrops/2013/06/25/nifty-modal-window-effects/\n\nIt would be great if all of them could be added. Thanks.\n. Hi guys, you're both awesome! Answers where really quick. Love when good \"plugins\" have good fast support.\n\nLook- I've used a illion jQuery Lightboxes plugins. THe thing is, the ONLY one I really like is CSS Modal, since it's the only one that is SO SO lichtweight and stylizable. I'm not yet a jQuery programmer, thought, I can say I'm learning quite a bit and fast on a new job I have.\n\nI'm sorry to bother again Sergey Snegirev.. But I need to solve the issue the best way possible. Take a look at the code I stole from the CSS Modal page (to stop the video on modal close):\n\n```\n(function ($) {\n\n  $(document)\n    .on('cssmodal:hide', function () {\n      var $video = $('.semantic-content iframe');\n      var source;\n\n      if ($video.length > 0) {\n        source = $video.attr('src');\n\n        $video.attr('src', '').attr('data-src', source);\n      }\n    })\n\n    .on('cssmodal:show', function () {\n      var $video = $('.semantic-content iframe');\n      var dataSource = $video.attr('data-src');\n      if ($video.length > 0 && dataSource !== '') {\n        $video.attr('src', dataSource).attr('data-src', '');\n      }\n    });\n\n}(jQuery));\n```\n\nFrom what I read on your answer, I must make an edit here to solve the problem right? Would you mind making it for me, so that I just have to copy the code right away and voila? Please man, I'm actually kind of a jQuery modifier or understander, I cannot quite well develop fixes or anything actually...\n\nIf you can help me, thanks a lot!\nGreetings from Argentina,\nSantiago\n. Awesome! Did work ;) Will Leave a demo too when I finish the site.\n\nThanks a lot!\n. Guys it would be great if you could develop a way to integrate the animations you can see here: http://tympanus.net/codrops/2013/06/25/nifty-modal-window-effects/\n\nTo CSS Modal. Not to add them all but to bundle them in different pieces so that you're able to pick one and integrate it easily, just for the sake of speed and performance.\n\nThanks and luck.\n. Hey guys look there are GREAT effects here at Codrops: http://tympanus.net/codrops/2013/06/25/nifty-modal-window-effects/\n\nIt would be great if all of them could be added. Thanks.\n. Hi guys, you're both awesome! Answers where really quick. Love when good \"plugins\" have good fast support.\n\nLook- I've used a illion jQuery Lightboxes plugins. THe thing is, the ONLY one I really like is CSS Modal, since it's the only one that is SO SO lichtweight and stylizable. I'm not yet a jQuery programmer, thought, I can say I'm learning quite a bit and fast on a new job I have.\n\nI'm sorry to bother again Sergey Snegirev.. But I need to solve the issue the best way possible. Take a look at the code I stole from the CSS Modal page (to stop the video on modal close):\n\n```\n(function ($) {\n\n  $(document)\n    .on('cssmodal:hide', function () {\n      var $video = $('.semantic-content iframe');\n      var source;\n\n      if ($video.length > 0) {\n        source = $video.attr('src');\n\n        $video.attr('src', '').attr('data-src', source);\n      }\n    })\n\n    .on('cssmodal:show', function () {\n      var $video = $('.semantic-content iframe');\n      var dataSource = $video.attr('data-src');\n      if ($video.length > 0 && dataSource !== '') {\n        $video.attr('src', dataSource).attr('data-src', '');\n      }\n    });\n\n}(jQuery));\n```\n\nFrom what I read on your answer, I must make an edit here to solve the problem right? Would you mind making it for me, so that I just have to copy the code right away and voila? Please man, I'm actually kind of a jQuery modifier or understander, I cannot quite well develop fixes or anything actually...\n\nIf you can help me, thanks a lot!\nGreetings from Argentina,\nSantiago\n. Awesome! Did work ;) Will Leave a demo too when I finish the site.\n\nThanks a lot!\n. Guys it would be great if you could develop a way to integrate the animations you can see here: http://tympanus.net/codrops/2013/06/25/nifty-modal-window-effects/\n\nTo CSS Modal. Not to add them all but to bundle them in different pieces so that you're able to pick one and integrate it easily, just for the sake of speed and performance.\n\nThanks and luck.\n. ",
    "fabien-d": "I'm not a fan of filters - but in these small cases I tend to use them! You could always rely on `rgba()` and fallback to the `data:image` to give more flexibility to supported browsers and not for others.\n\nAnd again, feel free to ignore this - I was simply going to open an issue to separate core and theme since the look and feel I'm using for my project is very different than your default. But since I had done something to solve my problem, I figured it would be a great discussion point! \n\nThe issue I'd like to get resolved is to be able to update the modal without having to go through restyling for every versions.\n. I'm not a fan of filters - but in these small cases I tend to use them! You could always rely on `rgba()` and fallback to the `data:image` to give more flexibility to supported browsers and not for others.\n\nAnd again, feel free to ignore this - I was simply going to open an issue to separate core and theme since the look and feel I'm using for my project is very different than your default. But since I had done something to solve my problem, I figured it would be a great discussion point! \n\nThe issue I'd like to get resolved is to be able to update the modal without having to go through restyling for every versions.\n. ",
    "ghost": "![screen shot 2013-08-04 at 1 14 44 pm](https://f.cloud.github.com/assets/440298/907361/2761bd50-fd32-11e2-9040-66f1796d8748.png)\n. Thanks guys.\n. Thank you!\n\nHere\nhttp://zao-dom.ru/\n\n1) Click on button http://joxi.ru/owF-U_3JTJDUMA7K-LI\n2) Click on close button in  modal window form\n3) Reload page (F5)\n4) jQuery error\n. Hello! Thanks for your help!\nOn my chrome browser this error not exist that in your screen\n\nOk, I disabled the social button, but the error still remained for me\nhttp://joxi.ru/47d-U_3JTJC5MOFNJVI\n\nOn this site, your plugin works perfectly, but in IE-8 error #119 issue\nhttp://sianie1.ru/#!\n. @drublic , hello!\nNow i'm update css-modal to 1.3.0 version and it's still not working for me in IE8\n![2015-03-22_01 57 48](https://cloud.githubusercontent.com/assets/1108013/6766616/185b75b0-d037-11e4-9db2-7924577edfd5.png)\n. error appears after about a minute, the browser hangs\n. on some old release, it worked\n. I would also like to see this issue solved!\n. ![screen shot 2013-08-04 at 1 14 44 pm](https://f.cloud.github.com/assets/440298/907361/2761bd50-fd32-11e2-9040-66f1796d8748.png)\n. Thanks guys.\n. Thank you!\n\nHere\nhttp://zao-dom.ru/\n\n1) Click on button http://joxi.ru/owF-U_3JTJDUMA7K-LI\n2) Click on close button in  modal window form\n3) Reload page (F5)\n4) jQuery error\n. Hello! Thanks for your help!\nOn my chrome browser this error not exist that in your screen\n\nOk, I disabled the social button, but the error still remained for me\nhttp://joxi.ru/47d-U_3JTJC5MOFNJVI\n\nOn this site, your plugin works perfectly, but in IE-8 error #119 issue\nhttp://sianie1.ru/#!\n. @drublic , hello!\nNow i'm update css-modal to 1.3.0 version and it's still not working for me in IE8\n![2015-03-22_01 57 48](https://cloud.githubusercontent.com/assets/1108013/6766616/185b75b0-d037-11e4-9db2-7924577edfd5.png)\n. error appears after about a minute, the browser hangs\n. on some old release, it worked\n. I would also like to see this issue solved!\n. ",
    "robsonfgjunior": "Thank you so much! This was exactly what I needed. Didn't thought about using 'document' as the target :) You should consider adding this snippet to the docs. It would certainly help a lot of people like me.\n\nThanks for the awesome plugin. This is the easiest and yet coolest lightbox ever. Great work! :+1: \n. Thank you so much! This was exactly what I needed. Didn't thought about using 'document' as the target :) You should consider adding this snippet to the docs. It would certainly help a lot of people like me.\n\nThanks for the awesome plugin. This is the easiest and yet coolest lightbox ever. Great work! :+1: \n. ",
    "SergeySnegirev": "I'm really new to GitHub but I'd like to help. What should I do to help document the events? Unless, of course, directing me is a bigger liability than actually documenting the issue :)\n. Hi,\nI just ran into this issue and solved it. CSS Modal guys use the following technique to stop video when modal is closed (pseudocode): \n- on hide event: store iframe source into data-src attribute, then set src to empty string\n- on show event: check if iframe source is empty, then restore it from data-src attribute\n\nThe problem is, they only planned for ONE video on the page, so they use the following selector to catch the iframe:     var $video = $('.semantic-content iframe'); \n\nNow we need to only catch the currently displayed video, so I tried to modify the selector to:\n    var $video = $('.semantic-content.is-active iframe');\n\n...but it didn't work, because \"is-active\" class is removed BEFORE the event is fired. So we have to iterate through all videos and stop all of them. I'm sure the code could be better, but here goes: \n\n```\n  $(document)\n  .on('cssmodal:hide', function () {\n    var $video = $('.semantic-content iframe');\n    var source;\n    $video.each(function(){\n      if ($(this).length > 0) {\n        source = $(this).attr('src');\n        $(this).attr('src', '');\n     if ( source !== '' ) $(this).attr('data-src', source);\n      }\n    });\n  })\n  .on('cssmodal:show', function () {\n    var $video = $('.semantic-content.is-active iframe');\n    var dataSource = $video.attr('data-src');\n    if ($video.length > 0 && dataSource !== '') {\n      $video.attr('src', dataSource).attr('data-src', '');\n    }\n  });\n```\n. First of all, my solution above DIDN'T work. I am sorry for confusing you, Santiago. \nNow the good news is that I have a working solution (and I edited my above comment to include it). Please look at my comment above, again. \n\nAlso, here's a working demo: http://intea.lv/september (there are videos under J and L).\n. I'm really new to GitHub but I'd like to help. What should I do to help document the events? Unless, of course, directing me is a bigger liability than actually documenting the issue :)\n. Hi,\nI just ran into this issue and solved it. CSS Modal guys use the following technique to stop video when modal is closed (pseudocode): \n- on hide event: store iframe source into data-src attribute, then set src to empty string\n- on show event: check if iframe source is empty, then restore it from data-src attribute\n\nThe problem is, they only planned for ONE video on the page, so they use the following selector to catch the iframe:     var $video = $('.semantic-content iframe'); \n\nNow we need to only catch the currently displayed video, so I tried to modify the selector to:\n    var $video = $('.semantic-content.is-active iframe');\n\n...but it didn't work, because \"is-active\" class is removed BEFORE the event is fired. So we have to iterate through all videos and stop all of them. I'm sure the code could be better, but here goes: \n\n```\n  $(document)\n  .on('cssmodal:hide', function () {\n    var $video = $('.semantic-content iframe');\n    var source;\n    $video.each(function(){\n      if ($(this).length > 0) {\n        source = $(this).attr('src');\n        $(this).attr('src', '');\n     if ( source !== '' ) $(this).attr('data-src', source);\n      }\n    });\n  })\n  .on('cssmodal:show', function () {\n    var $video = $('.semantic-content.is-active iframe');\n    var dataSource = $video.attr('data-src');\n    if ($video.length > 0 && dataSource !== '') {\n      $video.attr('src', dataSource).attr('data-src', '');\n    }\n  });\n```\n. First of all, my solution above DIDN'T work. I am sorry for confusing you, Santiago. \nNow the good news is that I have a working solution (and I edited my above comment to include it). Please look at my comment above, again. \n\nAlso, here's a working demo: http://intea.lv/september (there are videos under J and L).\n. ",
    "jimzarkadas": "@drublic Is there anyway to show the modal with javascript ?\n\nI have a posts table and want to show in modal the details for each post. Here are the steps:\n- Click on post title\n- Add hash to the url (#post?id=1 or #post1)\n- AJAX call\n- render modal template\n- show modal\n. Ok i' ll check it out thanks! :)\n. @drublic Is there anyway to show the modal with javascript ?\n\nI have a posts table and want to show in modal the details for each post. Here are the steps:\n- Click on post title\n- Add hash to the url (#post?id=1 or #post1)\n- AJAX call\n- render modal template\n- show modal\n. Ok i' ll check it out thanks! :)\n. ",
    "grayghostvisuals": "Yeah I'm down. What I am doing right now with my project Typeplate (also on bower) is taking advantage of a separate var file. The main project file contains vars with Sass' !default flag. I don't know how I still feel about this method though :\\  It really blows that bower rewrites the file when you update it.\n\nWhere do u want me to start? Don't wanna begin on something someone else is doing or does not agree with.\n. Yup makes sense. Kind of the only way around this atm w/Bower. Users will have to duplicate the `modal-config` file and manually bring it over into their Sass folder if they want customization.\n\nI can start on creating the config files. What's the workflow you want? Thinking a branch called development that pulls in branches from other contributors might be a good flow.\n. yup that works.\n. @drublic Can u explain briefly on your build process with the v1.0.0 branch? Seems like we can also tackle a good contributing doc from this discussion.\n. @drublic \n\nVery, very minor as of right now…\n1. `npm install` for fresh projects\n2. What current version of Sass you're using\n. > I think we should not depend on these classes atm\n\nYeah I figured as much. Agreed it is bad for business.\n\n> What's the reason to have a 16x16px background image instead of a 1x1px?\n\nNo reason. Probably was working too fast and just ended up there.\n\n>  But we can use CSS hacks for IE8 and we can utilize these maybe\n\nHow do u want to handle this? I rly hate even bringing up IE8 but Im still supporting it :(\n. @anselmh \nNot sure on a solution ATM, but handling multiple sizes should be a priority high on the list. I do like the idea of data attributes just unsure how that correlates with the rest of the library. I haven't had time to dig deeper into the project code :( Gotstah be solution out there for sure. :beers:\n. if you all like it then I'm all :+1:  for it.\n. @anselmh \n\n> livereload is missing as dependency in package.json while it is called in Gruntfile.js\n\nActually `grunt-contrib-watch` includes Live Reload already. [https://github.com/gruntjs/grunt-contrib-watch#live-reloading](https://github.com/gruntjs/grunt-contrib-watch#live-reloading)\n. > Please stick to one task and one task only for each PR as Anselm said.\n\nI can remove the grunt options and just send back with the separated Sass (config, core and theme). LMK.\n. @drublic Thanks. G2K :metal:\n. @drublic Updated commit when you're ready. Thanks again for the tip above,\n. @drublic Thanks. I wish I could take the credit though. Most was from #58 (great work in there btw), but definitely happy to help out.\n. I'm doing this right now with Froogaloop that hooks into the Vimeo API. [https://github.com/vimeo/player-api/tree/master/javascript](https://github.com/vimeo/player-api/tree/master/javascript)\n\n``` javascript\n// Robodemo\nvar roboDemo = $('#ipad_video');\n\n// Play Robodemo\nfunction playRoboDemo(playerID) {\n    var player = $f(playerID.get(0));\n\n    // Player Ready Event\n    player.addEvent('ready', function() {\n        player.api('play');\n    });\n}\n\n// Pause Robodemo\nfunction pauseRoboDemo(playerID) {\n    var player = $f(playerID.get(0));\n\n    // Player Ready Event\n    player.addEvent('ready', function() {\n        player.api('pause');\n    });\n}\n\n// Add these to your click events or scroll if you want\nplayRoboDemo(roboDemo);\npuaseRoboDemo(roboDemo);\n```\n. Yeah I'm down. What I am doing right now with my project Typeplate (also on bower) is taking advantage of a separate var file. The main project file contains vars with Sass' !default flag. I don't know how I still feel about this method though :\\  It really blows that bower rewrites the file when you update it.\n\nWhere do u want me to start? Don't wanna begin on something someone else is doing or does not agree with.\n. Yup makes sense. Kind of the only way around this atm w/Bower. Users will have to duplicate the `modal-config` file and manually bring it over into their Sass folder if they want customization.\n\nI can start on creating the config files. What's the workflow you want? Thinking a branch called development that pulls in branches from other contributors might be a good flow.\n. yup that works.\n. @drublic Can u explain briefly on your build process with the v1.0.0 branch? Seems like we can also tackle a good contributing doc from this discussion.\n. @drublic \n\nVery, very minor as of right now…\n1. `npm install` for fresh projects\n2. What current version of Sass you're using\n. > I think we should not depend on these classes atm\n\nYeah I figured as much. Agreed it is bad for business.\n\n> What's the reason to have a 16x16px background image instead of a 1x1px?\n\nNo reason. Probably was working too fast and just ended up there.\n\n>  But we can use CSS hacks for IE8 and we can utilize these maybe\n\nHow do u want to handle this? I rly hate even bringing up IE8 but Im still supporting it :(\n. @anselmh \nNot sure on a solution ATM, but handling multiple sizes should be a priority high on the list. I do like the idea of data attributes just unsure how that correlates with the rest of the library. I haven't had time to dig deeper into the project code :( Gotstah be solution out there for sure. :beers:\n. if you all like it then I'm all :+1:  for it.\n. @anselmh \n\n> livereload is missing as dependency in package.json while it is called in Gruntfile.js\n\nActually `grunt-contrib-watch` includes Live Reload already. [https://github.com/gruntjs/grunt-contrib-watch#live-reloading](https://github.com/gruntjs/grunt-contrib-watch#live-reloading)\n. > Please stick to one task and one task only for each PR as Anselm said.\n\nI can remove the grunt options and just send back with the separated Sass (config, core and theme). LMK.\n. @drublic Thanks. G2K :metal:\n. @drublic Updated commit when you're ready. Thanks again for the tip above,\n. @drublic Thanks. I wish I could take the credit though. Most was from #58 (great work in there btw), but definitely happy to help out.\n. I'm doing this right now with Froogaloop that hooks into the Vimeo API. [https://github.com/vimeo/player-api/tree/master/javascript](https://github.com/vimeo/player-api/tree/master/javascript)\n\n``` javascript\n// Robodemo\nvar roboDemo = $('#ipad_video');\n\n// Play Robodemo\nfunction playRoboDemo(playerID) {\n    var player = $f(playerID.get(0));\n\n    // Player Ready Event\n    player.addEvent('ready', function() {\n        player.api('play');\n    });\n}\n\n// Pause Robodemo\nfunction pauseRoboDemo(playerID) {\n    var player = $f(playerID.get(0));\n\n    // Player Ready Event\n    player.addEvent('ready', function() {\n        player.api('pause');\n    });\n}\n\n// Add these to your click events or scroll if you want\nplayRoboDemo(roboDemo);\npuaseRoboDemo(roboDemo);\n```\n. ",
    "richie-y": "Hi,\n\nI seem to be having this issue with modal.  The URL to my site is:\nhttp://www.thruair.co.uk/\n\nPlease can you help.\n\nThanks,\n. I'm testing in both Google Chrome and Safari on OSX Maverick.\n\nFor an example of the issue:\nIf a css-modal light box is activated via this URL:\nhttp://www.thruair.co.uk/#modal-pictures-proav\nand then some of the thumbnails are clicked, then images from the first css-modal light box on the page are triggered. Then if another css-modal light box is triggered without refreshing the page then main image from the previous lightbox is triggered.\n\nI hope that this is a little more informative and that there is a solution. Thanks.\n. Hi,\n\nI seem to be having this issue with modal.  The URL to my site is:\nhttp://www.thruair.co.uk/\n\nPlease can you help.\n\nThanks,\n. I'm testing in both Google Chrome and Safari on OSX Maverick.\n\nFor an example of the issue:\nIf a css-modal light box is activated via this URL:\nhttp://www.thruair.co.uk/#modal-pictures-proav\nand then some of the thumbnails are clicked, then images from the first css-modal light box on the page are triggered. Then if another css-modal light box is triggered without refreshing the page then main image from the previous lightbox is triggered.\n\nI hope that this is a little more informative and that there is a solution. Thanks.\n. ",
    "impressivewebs": "No, I don't think that's going to work. IE10 supports transitions without the prefix, so that is a non-issue, as far as I can tell. I've slapped together a quick version on JS Bin, which I've tested on IE10:\n\nhttp://jsbin.com/atituzA/1/edit\n\nIt still doesn't show the transition in IE10, even after I add -ms-. If you want, when I get some time, I can try to debug it, because I know it should work as long as the transition is put in the right place in the code, without the prefix.\n. (sorry I originally pasted the wrong JS Bin link, corrected now)\n. Sure, I'll see what I can do. If someone has a reduced test case ready, that would be nice for me to start with, but I could just strip down the JS Bin I created and go from there.\n. As discussed in the original issue, I don't think this is going to work. Maybe I'm wrong, but I've tested it in IE10, even with the -ms- prefix and I don't see a difference:\n\nhttp://jsbin.com/atituzA/1/edit\n. @alrra That's not 100% correct. They used the -ms- prefix for IE10's Platform Preview and Developer Preview. The -ms- prefixes still work in IE10, but only as a 'legacy' thing for those who had included them without the standard prefix.\n\nIf you have access to IE10, test this:\n\nhttp://jsbin.com/urUzuxE/1/edit\n\nThe only prefix included is -ms- (no standard property) and it works fine on my IE10 on Win7.\n. No, I don't think that's going to work. IE10 supports transitions without the prefix, so that is a non-issue, as far as I can tell. I've slapped together a quick version on JS Bin, which I've tested on IE10:\n\nhttp://jsbin.com/atituzA/1/edit\n\nIt still doesn't show the transition in IE10, even after I add -ms-. If you want, when I get some time, I can try to debug it, because I know it should work as long as the transition is put in the right place in the code, without the prefix.\n. (sorry I originally pasted the wrong JS Bin link, corrected now)\n. Sure, I'll see what I can do. If someone has a reduced test case ready, that would be nice for me to start with, but I could just strip down the JS Bin I created and go from there.\n. As discussed in the original issue, I don't think this is going to work. Maybe I'm wrong, but I've tested it in IE10, even with the -ms- prefix and I don't see a difference:\n\nhttp://jsbin.com/atituzA/1/edit\n. @alrra That's not 100% correct. They used the -ms- prefix for IE10's Platform Preview and Developer Preview. The -ms- prefixes still work in IE10, but only as a 'legacy' thing for those who had included them without the standard prefix.\n\nIf you have access to IE10, test this:\n\nhttp://jsbin.com/urUzuxE/1/edit\n\nThe only prefix included is -ms- (no standard property) and it works fine on my IE10 on Win7.\n. ",
    "alrra": "@impressivewebs @anselmh IE never used the `-ms-` prefix for animations, gradients, transforms and transitions in a stable release. See: [Moving the Stable Web Forward in IE10 Release Preview](http://blogs.msdn.com/b/ie/archive/2012/06/06/moving-the-stable-web-forward-in-ie10-release-preview.aspx).\n. @anselmh @impressivewebs In my [previous comment](https://github.com/drublic/css-modal/pull/71#issuecomment-24643347), I've specified: _**\"in a stable release\"**_.\n. @impressivewebs @anselmh IE never used the `-ms-` prefix for animations, gradients, transforms and transitions in a stable release. See: [Moving the Stable Web Forward in IE10 Release Preview](http://blogs.msdn.com/b/ie/archive/2012/06/06/moving-the-stable-web-forward-in-ie10-release-preview.aspx).\n. @anselmh @impressivewebs In my [previous comment](https://github.com/drublic/css-modal/pull/71#issuecomment-24643347), I've specified: _**\"in a stable release\"**_.\n. ",
    "mard73": "Worked great! Thanks so much for all your help.\n. Worked great! Thanks so much for all your help.\n. ",
    "apechimp": "It looks like it's up on the [website](http://drublic.github.io/css-modal/#howto-javascript) now.\n. It looks like it's up on the [website](http://drublic.github.io/css-modal/#howto-javascript) now.\n. ",
    "chriscantu": "Did you mean for me to use bower to install v1.1.0-alpha because it does not seem to be available via bower?\n\nOn Nov 12, 2013, at 3:42 PM, Hans Christian Reinl notifications@github.com wrote:\n\n> This will be fixed with the new version. For the time being, please update the css-modal to v1.1.0-alpha.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks… that worked!\n\nOn Nov 12, 2013, at 4:08 PM, Hans Christian Reinl notifications@github.com wrote:\n\n> Oops, sorry. The release is called v1.1.0alpha.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Did you mean for me to use bower to install v1.1.0-alpha because it does not seem to be available via bower?\n\nOn Nov 12, 2013, at 3:42 PM, Hans Christian Reinl notifications@github.com wrote:\n\n> This will be fixed with the new version. For the time being, please update the css-modal to v1.1.0-alpha.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks… that worked!\n\nOn Nov 12, 2013, at 4:08 PM, Hans Christian Reinl notifications@github.com wrote:\n\n> Oops, sorry. The release is called v1.1.0alpha.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. ",
    "edi9999": "Hey,\n\nI have exactly the same problem with the actual version. Any workarounds ?\n. Hey,\n\nI have exactly the same problem with the actual version. Any workarounds ?\n. ",
    "di5abled": "very nice, perfekt! keep up the good work :+1: \n\nis this package already available via bower? i currently use v1.1.0alpha\n. very nice, perfekt! keep up the good work :+1: \n\nis this package already available via bower? i currently use v1.1.0alpha\n. ",
    "ultraflash": "Hi,  I closed this shortly after posting the issue as I realised that it only happens when I have a word in the content that is wider than the width of the iOS7 screen.\n\nFor example it was a long URL hyperlink that caused it. I used the URL as the hyperlink address which is unusual in most cases so I don't think many people will experience the problem I had. If I had a long URL that was wider than the screen, scrolling stopped working, as a workaround I simply but a <br /> in the middle of the URL. I tried doing some sort of word wrap CSS thing but failed miserably, maybes something like this will fix it so others don't get the issue when using long words/hyperlink labels.\n. Hi,  I closed this shortly after posting the issue as I realised that it only happens when I have a word in the content that is wider than the width of the iOS7 screen.\n\nFor example it was a long URL hyperlink that caused it. I used the URL as the hyperlink address which is unusual in most cases so I don't think many people will experience the problem I had. If I had a long URL that was wider than the screen, scrolling stopped working, as a workaround I simply but a <br /> in the middle of the URL. I tried doing some sort of word wrap CSS thing but failed miserably, maybes something like this will fix it so others don't get the issue when using long words/hyperlink labels.\n. ",
    "EmDew219": "I'll send you the link here because I don't want it to be public yet\nhttp://www.runamukrecords.com/kaliber.html\nand the three videos are at the bottom of the page......if you open one and play the video then try to pause the video or mess with the sound...you'll get what I'm talking about. :)\n\nOn Wednesday, 8 January 2014, 18:47:36, Anselm Hannemann notifications@github.com wrote:\n\nHi, it's hard to follow your issues without seeing the code you use. Could you either provide us a link to the (non)working demo or create a jsbin?\n—\nReply to this email directly or view it on GitHub.\n. I'll send you the link here because I don't want it to be public yet\nhttp://www.runamukrecords.com/kaliber.html\nand the three videos are at the bottom of the page......if you open one and play the video then try to pause the video or mess with the sound...you'll get what I'm talking about. :)\n\nOn Wednesday, 8 January 2014, 18:47:36, Anselm Hannemann notifications@github.com wrote:\n\nHi, it's hard to follow your issues without seeing the code you use. Could you either provide us a link to the (non)working demo or create a jsbin?\n—\nReply to this email directly or view it on GitHub.\n. ",
    "karabey": "The Error comes from Firefox Shockwave Flash Plugin. Deactivate it and it will work.\nhttp://stackoverflow.com/questions/20796646/video-not-working-in-bootstrap-modal-pop-up-on-firefox\n\n@drublic \nYou are right the CSS could solve it too. This is the Problem part.\n\n```\n.semantic-content {\n  -webkit-transform: translate(0, 100%);\n  -moz-transform: translate(0, 100%);\n  -o-transform: translate(0, 100%);\n  -ms-transform: translate(0, 100%);\n  transform: translate(0, 100%);\n  -webkit-transform: translate3d(0, 100%, 0);\n  transform: translate3d(0, 100%, 0);\n}\n\n.semantic-content:target {\n  -webkit-transform: translate(0, 0);\n  -moz-transform: translate(0, 0);  \n  -o-transform: translate(0, 0);\n  -ms-transform: translate(0, 0);\n  transform: translate(0, 0);\n}\n```\n\nOne of the solution is to add at the end of Youtube Link `?wmode=transparent`\n. The Error comes from Firefox Shockwave Flash Plugin. Deactivate it and it will work.\nhttp://stackoverflow.com/questions/20796646/video-not-working-in-bootstrap-modal-pop-up-on-firefox\n\n@drublic \nYou are right the CSS could solve it too. This is the Problem part.\n\n```\n.semantic-content {\n  -webkit-transform: translate(0, 100%);\n  -moz-transform: translate(0, 100%);\n  -o-transform: translate(0, 100%);\n  -ms-transform: translate(0, 100%);\n  transform: translate(0, 100%);\n  -webkit-transform: translate3d(0, 100%, 0);\n  transform: translate3d(0, 100%, 0);\n}\n\n.semantic-content:target {\n  -webkit-transform: translate(0, 0);\n  -moz-transform: translate(0, 0);  \n  -o-transform: translate(0, 0);\n  -ms-transform: translate(0, 0);\n  transform: translate(0, 0);\n}\n```\n\nOne of the solution is to add at the end of Youtube Link `?wmode=transparent`\n. ",
    "Wakkos": "I suck at JS, but I came with this quick solution:\n\n``` JavaScript\nfunction stopVideo() {\n document.getElementById('video').pause();\n}\n```\n\nAnd then add the ID=\"video\" to my video tag in HTML.\n\nThe problem is that we have t modify the close link with onclick=\"stopVideo()\". I can bet that there's a better way to do it if we detect the bookmark URL to play or pause the video.\n. @drublic is kind of right, it it's a _CSS_ modal then it would stop being _CSS_. but as you said, this JS would be for \"flavoring\" its use. Allowing html5 video in modal. (and maybe a fullscreen mode?).\n\nBut it ups to you guys!\n. That sounds Awesome.\n. I suck at JS, but I came with this quick solution:\n\n``` JavaScript\nfunction stopVideo() {\n document.getElementById('video').pause();\n}\n```\n\nAnd then add the ID=\"video\" to my video tag in HTML.\n\nThe problem is that we have t modify the close link with onclick=\"stopVideo()\". I can bet that there's a better way to do it if we detect the bookmark URL to play or pause the video.\n. @drublic is kind of right, it it's a _CSS_ modal then it would stop being _CSS_. but as you said, this JS would be for \"flavoring\" its use. Allowing html5 video in modal. (and maybe a fullscreen mode?).\n\nBut it ups to you guys!\n. That sounds Awesome.\n. ",
    "sylvaincombes": "It was a pleasure ! :) Thank you for this project :+1: \n. Hello drublic, \nThanks for your response and your css-modal project :smile: \n\nI did the requested syntax corrections and have added the commit message to the change log.\n\nWhat is buggy in Safari ? Perhaps we could try to correct it ?\n\nAlso all this part is acceptable but not \"perfect\" because we have no tests covering it and some edge cases aren't managed (empty tabbables elements via querySelectorAll, null returned because of no matching element etc).\n\nThank you to let me know what you think of this, should we move on or try to update the code and adding tests.\n. It was a pleasure ! :) Thank you for this project :+1: \n. Hello drublic, \nThanks for your response and your css-modal project :smile: \n\nI did the requested syntax corrections and have added the commit message to the change log.\n\nWhat is buggy in Safari ? Perhaps we could try to correct it ?\n\nAlso all this part is acceptable but not \"perfect\" because we have no tests covering it and some edge cases aren't managed (empty tabbables elements via querySelectorAll, null returned because of no matching element etc).\n\nThank you to let me know what you think of this, should we move on or try to update the code and adding tests.\n. ",
    "barsaraf": "Yes, I just add to your example the jquerymobile.com quick access files.\nLive Demo :\nhttp://www.appix.co.il/GitHub/\n. Lol, I added target=\"_self\" to a link and the problem fixed.\n\nThanks for the helping.\n. Yes, I just add to your example the jquerymobile.com quick access files.\nLive Demo :\nhttp://www.appix.co.il/GitHub/\n. Lol, I added target=\"_self\" to a link and the problem fixed.\n\nThanks for the helping.\n. ",
    "charliewilco": "i apologize i let this lapse, i was working with a 5 page form. set in an iframe, that wouldn't be responsive. so i think it came down to the `overflow: hidden;` not a big deal anymore, i talked my client out of that ux decision. sorry for any headache i caused.\n. i apologize i let this lapse, i was working with a 5 page form. set in an iframe, that wouldn't be responsive. so i think it came down to the `overflow: hidden;` not a big deal anymore, i talked my client out of that ux decision. sorry for any headache i caused.\n. ",
    "abielpaltao": "I'm using ver 1.0.3 and i didnt customize the css of this.\n. Here's a screenshot. Never mind those 404 files since im not using them.\n![hris3](https://f.cloud.github.com/assets/130994/2333688/66c2ee62-a46f-11e3-9b8f-92c149f23056.png)\n\nI'll try to create a demo webpage for this. This is jsp so not much free web host.\n\nAlso, i'll using this with other plugins: Footable and Notify.js. Do you think there is conflict between those three?\n. Hi drublic, i agree with you. I think other plugins are messing with the modal. I cant recreate the website so i cant post any for anselmh. I guess we can close this for now.\n. I'm using ver 1.0.3 and i didnt customize the css of this.\n. Here's a screenshot. Never mind those 404 files since im not using them.\n![hris3](https://f.cloud.github.com/assets/130994/2333688/66c2ee62-a46f-11e3-9b8f-92c149f23056.png)\n\nI'll try to create a demo webpage for this. This is jsp so not much free web host.\n\nAlso, i'll using this with other plugins: Footable and Notify.js. Do you think there is conflict between those three?\n. Hi drublic, i agree with you. I think other plugins are messing with the modal. I cant recreate the website so i cant post any for anselmh. I guess we can close this for now.\n. ",
    "cyxou": "Yep, I guess I need to also inject the script element referencing the modal.js file. Could you please provide an example of how to show a modal using javascript (without hashbangs)?\n. Yep, I guess I need to also inject the script element referencing the modal.js file. Could you please provide an example of how to show a modal using javascript (without hashbangs)?\n. ",
    "fredfortier": "Thanks! No problem. I was not familiar with the technique but it was easy to figure out. I got the transparency where I wanted by tweaking the png.\n. Thanks! No problem. I was not familiar with the technique but it was easy to figure out. I got the transparency where I wanted by tweaking the png.\n. ",
    "DuckSportsFan": "Thanks, Hans, I understand. The iPhone OS version is 7.1, which is the current version.  I've done some research and found the ability to scroll is restored when I remove about half of what I have, originally....   So, it's not a matter of your modal not scrolling, but why is there a limit in the amount of text that causes scrolling to stop.\n\nThanks for looking into to this for me.\n\nPaul Fenley\n\nOn Apr 10, 2014, at 12:06 AM, Hans Christian Reinl wrote:\n\n> I've removed the text, since it is without value for this issue. Can you please let me know which OS you're using on the iPhone.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Okay. I decided to go w/ WP, anywho. Thanks for the reply.\n\nPaul\n\nOn Oct 12, 2014, at 10:21 AM, Hans Christian Reinl wrote:\n\n> Sorry for the long wait. Currently I don't see any chance we will fix this. I don't know if this is a problem on our end or on iOS' but I think it might be the latter.\n> If you still have problems with iOS 8 please let us know.\n> \n> Thanks so much for your time to report this problem.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Thanks, Hans, I understand. The iPhone OS version is 7.1, which is the current version.  I've done some research and found the ability to scroll is restored when I remove about half of what I have, originally....   So, it's not a matter of your modal not scrolling, but why is there a limit in the amount of text that causes scrolling to stop.\n\nThanks for looking into to this for me.\n\nPaul Fenley\n\nOn Apr 10, 2014, at 12:06 AM, Hans Christian Reinl wrote:\n\n> I've removed the text, since it is without value for this issue. Can you please let me know which OS you're using on the iPhone.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Okay. I decided to go w/ WP, anywho. Thanks for the reply.\n\nPaul\n\nOn Oct 12, 2014, at 10:21 AM, Hans Christian Reinl wrote:\n\n> Sorry for the long wait. Currently I don't see any chance we will fix this. I don't know if this is a problem on our end or on iOS' but I think it might be the latter.\n> If you still have problems with iOS 8 please let us know.\n> \n> Thanks so much for your time to report this problem.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. ",
    "Melros": "On which Firefox Version/OS did you encounter this result?\n. On which Firefox Version/OS did you encounter this result?\n. ",
    "Ziiweb": "Sorry, I don't know exactly why I mentioned you 0_o, actually my code is:\n\n```\n  <a title=\"Clicking this link shows the modal\" class=\"call-modal\" href=\"#modal-pictures\">A demo with some pictures</a>\n  <section class=\"semantic-content\" id=\"modal-text\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label\" aria-hidden=\"true\">\n    <div class=\"modal-inner\">\n      <div class=\"modal-content\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n      </div>\n    </div>\n    <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\" data-close=\"Close\" data-dismiss=\"modal\">×</a>\n  </section>\n```\n\nand\n\n```\n@import \"modal\";\n  //...\n\n    .modal-inner {\n        extend %modal;\n    }\n```\n. The dark transparency for the hole page appears, and the close button (X) too, but I still can not see the pictures..\n\nThis is my code:\n\n```\n<a href=\"#modal-text\" class=\"call-modal\" title=\"Clicking this link shows the modal\">A demo with some pictures</a>\n<section aria-hidden=\"true\" aria-labelledby=\"modal-label\" role=\"dialog\" tabindex=\"-1\" id=\"modal-text\" class=\"semantic-content\">\n    <div class=\"modal-inner\">\n      <div class=\"modal-content\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n      </div>\n    </div>\n    <a data-dismiss=\"modal\" data-close=\"Close\" title=\"Close this modal\" class=\"modal-close\" href=\"#!\">×</a>\n  </section>\n```\n. Sorry, I don't know exactly why I mentioned you 0_o, actually my code is:\n\n```\n  <a title=\"Clicking this link shows the modal\" class=\"call-modal\" href=\"#modal-pictures\">A demo with some pictures</a>\n  <section class=\"semantic-content\" id=\"modal-text\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modal-label\" aria-hidden=\"true\">\n    <div class=\"modal-inner\">\n      <div class=\"modal-content\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n      </div>\n    </div>\n    <a href=\"#!\" class=\"modal-close\" title=\"Close this modal\" data-close=\"Close\" data-dismiss=\"modal\">×</a>\n  </section>\n```\n\nand\n\n```\n@import \"modal\";\n  //...\n\n    .modal-inner {\n        extend %modal;\n    }\n```\n. The dark transparency for the hole page appears, and the close button (X) too, but I still can not see the pictures..\n\nThis is my code:\n\n```\n<a href=\"#modal-text\" class=\"call-modal\" title=\"Clicking this link shows the modal\">A demo with some pictures</a>\n<section aria-hidden=\"true\" aria-labelledby=\"modal-label\" role=\"dialog\" tabindex=\"-1\" id=\"modal-text\" class=\"semantic-content\">\n    <div class=\"modal-inner\">\n      <div class=\"modal-content\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n        <img src=\"http://www.seobook.com/images/smallfish.jpg\">\n      </div>\n    </div>\n    <a data-dismiss=\"modal\" data-close=\"Close\" title=\"Close this modal\" class=\"modal-close\" href=\"#!\">×</a>\n  </section>\n```\n. ",
    "myndzi": "The ability to readily implement a design given to me by our designers...\n\nI've got it, now, but it's kind of hacky.\n. I simply mean an X-button that is not hovering outside the dialog itself. Standard as in, it looks approximately like every other dialog window you see.\n. It's honestly been a long time and I don't remember the details. It makes more sense to locate the div inside and shift it out than the reverse. I think the problem may have had to do with what was contained in what, either for selector purposes or units of measure. Either way, I am no longer invested.\n. The ability to readily implement a design given to me by our designers...\n\nI've got it, now, but it's kind of hacky.\n. I simply mean an X-button that is not hovering outside the dialog itself. Standard as in, it looks approximately like every other dialog window you see.\n. It's honestly been a long time and I don't remember the details. It makes more sense to locate the div inside and shift it out than the reverse. I think the problem may have had to do with what was contained in what, either for selector purposes or units of measure. Either way, I am no longer invested.\n. ",
    "jonathanweiss": "Looks good to me - GTM. ;)\n. GTM\n. Looks good - GTM! :)\n. Your changes are good. +1\n. gtm\n. Looks fine - GTM!\n. Works fine in my tests.\nWhat about moving the animation stuff to `_modal-animation.scss` and inform the user about the side effects of using animation?\n. GTM\n. I'll look at it on Monday (evening/night).\n. I can't confirm this behavior. On my IE8 the styles are applied as soon as the modal opens. I added this line for a quick visual test:\n`rule += 'body {border: 10px solid lime;}';`\n. Good idea to use jQuery, since there is a high chance that it is already included in the page the modal is used on. However, this brakes the gallery in IE8. Can't examine this ATM, can you have a look?\n. Looks good to me - GTM. ;)\n. GTM\n. Looks good - GTM! :)\n. Your changes are good. +1\n. gtm\n. Looks fine - GTM!\n. Works fine in my tests.\nWhat about moving the animation stuff to `_modal-animation.scss` and inform the user about the side effects of using animation?\n. GTM\n. I'll look at it on Monday (evening/night).\n. I can't confirm this behavior. On my IE8 the styles are applied as soon as the modal opens. I added this line for a quick visual test:\n`rule += 'body {border: 10px solid lime;}';`\n. Good idea to use jQuery, since there is a high chance that it is already included in the page the modal is used on. However, this brakes the gallery in IE8. Can't examine this ATM, can you have a look?\n. ",
    "gudinne": "I apologize if I alarmed you.\nAfter removing all code and styling from page and just trying out the links from my phone it seems there is something strange happening with the deep links themselves.\n\nThank you for your prompt reply. I'll close this.\n. I apologize if I alarmed you.\nAfter removing all code and styling from page and just trying out the links from my phone it seems there is something strange happening with the deep links themselves.\n\nThank you for your prompt reply. I'll close this.\n. ",
    "robertfausk": "Am i able to prevent stacking of modals?\nIf yes, how can I do it. I didn't find anything in doc and issues about that. Only that stacking modals is enabled per default if it's used with javascript.\n. Am i able to prevent stacking of modals?\nIf yes, how can I do it. I didn't find anything in doc and issues about that. Only that stacking modals is enabled per default if it's used with javascript.\n. ",
    "hwaal": "Exactly what Robertfausk says, I want to close the current modal when calling a new modal. So disable stacking of modals if possible? \n. Exactly what Robertfausk says, I want to close the current modal when calling a new modal. So disable stacking of modals if possible? \n. ",
    "bartveneman": "Np\n. Np\n. ",
    "dhunink": "Not by CSS. But in the javascript, when the modal is created, the original classes are transferred. You could transfer the ID in the same way I guess \n. You did had a look at the demos, haven't you? The modal will center. Check out the CSS and Js sources if you want to understand why. Those files did have me a much better understanding of how things work. \nNot to be hostile, but if you're experiecing trouble to get things working like they work in the demo, you probably be better of asking your question on a forum like stackoverflow.com, since github is mainly the place to discuss bugs and feature improvements.\n. You're right. I've read you're message to quickly and thought you were talking about horizontal centering. My mistake, sorry.\nVertical centering is not an option right now. I'd suggest opening an suggestion for feature improvement and in the mean time dive into the css/JS files and ask for help on stack overflow if you don't manage it yourself. Pretty sure it can be done (since i've seen it before in other modal libraries).\n. Not by CSS. But in the javascript, when the modal is created, the original classes are transferred. You could transfer the ID in the same way I guess \n. You did had a look at the demos, haven't you? The modal will center. Check out the CSS and Js sources if you want to understand why. Those files did have me a much better understanding of how things work. \nNot to be hostile, but if you're experiecing trouble to get things working like they work in the demo, you probably be better of asking your question on a forum like stackoverflow.com, since github is mainly the place to discuss bugs and feature improvements.\n. You're right. I've read you're message to quickly and thought you were talking about horizontal centering. My mistake, sorry.\nVertical centering is not an option right now. I'd suggest opening an suggestion for feature improvement and in the mean time dive into the css/JS files and ask for help on stack overflow if you don't manage it yourself. Pretty sure it can be done (since i've seen it before in other modal libraries).\n. ",
    "drimlike": "It's our oldest iPod in the device lab :) iOS 5.1.1\nBut we have the exact same issue on an Android 4.+ and other recent devices.\nThanks! :)\n. It's our oldest iPod in the device lab :) iOS 5.1.1\nBut we have the exact same issue on an Android 4.+ and other recent devices.\nThanks! :)\n. ",
    "vvo": "Just tried it out and yes it works, thanks.\n. Just tried it out and yes it works, thanks.\n. ",
    "stanggt3": "I opened the index.html file that is provided in the zip download and only added the following line.  This will cause the issue I am referring to.  Had to remove the brackets for it to post.\n\nscript src=\"//cdnjs.cloudflare.com/ajax/libs/respond.js/1.4.2/respond.min.js\"\n\nI hope that helps enough....here is a screenshot of the result in IE8\n\n![cssmodal](https://cloud.githubusercontent.com/assets/4763946/4379997/dd7099a2-4365-11e4-9035-562299d16464.jpg)\n. I opened the index.html file that is provided in the zip download and only added the following line.  This will cause the issue I am referring to.  Had to remove the brackets for it to post.\n\nscript src=\"//cdnjs.cloudflare.com/ajax/libs/respond.js/1.4.2/respond.min.js\"\n\nI hope that helps enough....here is a screenshot of the result in IE8\n\n![cssmodal](https://cloud.githubusercontent.com/assets/4763946/4379997/dd7099a2-4365-11e4-9035-562299d16464.jpg)\n. ",
    "zharris6": "I have the exact same issue that stanggt3 has reported. This is fine until Respond.js is loaded. \n\nAnything you can do to help would be appreciated. \n. I have the exact same issue that stanggt3 has reported. This is fine until Respond.js is loaded. \n\nAnything you can do to help would be appreciated. \n. ",
    "ithilethiel": "The thing is, in the demos, I see them not being vertically centered. \n. http://drublic.github.io/css-modal/ They are not being vertically centered in Chrome, Firefox or IE. Haven't checked in other browsers.\n. ok :) I was about to do it via jquery.\nI'll open a suggestion for feature improvement later. Thanks!!\n. The thing is, in the demos, I see them not being vertically centered. \n. http://drublic.github.io/css-modal/ They are not being vertically centered in Chrome, Firefox or IE. Haven't checked in other browsers.\n. ok :) I was about to do it via jquery.\nI'll open a suggestion for feature improvement later. Thanks!!\n. ",
    "jasonhuck": "Also, adding bean as a dependency gets rid of the error and allows other javascript to execute, but the modal itself does not seem to work.\n. Also, adding bean as a dependency gets rid of the error and allows other javascript to execute, but the modal itself does not seem to work.\n. ",
    "jgadbois": "I'd also like to see this\n. Any ideas on this one?\n. I believe I was using youtube iframe embeds.\n. I'd also like to see this\n. Any ideas on this one?\n. I believe I was using youtube iframe embeds.\n. ",
    "jolidog": "With transforms2D this can easily be achieved. We make the top and left 50% and then bring it back with transform: translate(-50%, -50%). We don't even care what the width or height of the modal is, it will be perfectly centered.\n\nThe issue it raises is the placement of the close button, but that could be solved by having the close button separate from modal background, they could both be links with the same behaviour.\nThe close button would inside the header or wherever users want to place it.\n. With transforms2D this can easily be achieved. We make the top and left 50% and then bring it back with transform: translate(-50%, -50%). We don't even care what the width or height of the modal is, it will be perfectly centered.\n\nThe issue it raises is the placement of the close button, but that could be solved by having the close button separate from modal background, they could both be links with the same behaviour.\nThe close button would inside the header or wherever users want to place it.\n. ",
    "Komald": "I tried by replacing the css and js with v1.2 but that wont work. Instead it disturbed the design completely. I don't know if I did this correct, but you can have a look \nhttp://jsfiddle.net/komalAD/seyfso6L/1/\n. Ok, I checked it, but still its not working as expected. If I click on Forgot Password then it should close the existing Sign In modal and open the Forgot Password modal. just I said the initial fiddle works for all browsers except IE. is it possible to do something on that script and start working on IE too?\n. I tried by replacing the css and js with v1.2 but that wont work. Instead it disturbed the design completely. I don't know if I did this correct, but you can have a look \nhttp://jsfiddle.net/komalAD/seyfso6L/1/\n. Ok, I checked it, but still its not working as expected. If I click on Forgot Password then it should close the existing Sign In modal and open the Forgot Password modal. just I said the initial fiddle works for all browsers except IE. is it possible to do something on that script and start working on IE too?\n. ",
    "michaelthorne": "Pull request: https://github.com/drublic/css-modal/pull/172\n\nI built the project too `grunt dist`, but noticed the `modal.css` generated is quite different to the current version in your repo.\n. I'd rather go with what the current W3C spec says:\n\nProperty: _word-break_\nValue(s): `normal | keep-all | break-all`\n\nhttp://www.w3.org/TR/css3-text/#word-break\n\nProperty: _overflow-wrap/word-wrap_\nValue(s): `normal | break-word`\n\nhttp://www.w3.org/TR/css3-text/#overflow-wrap-property\n\nThis article [\"Word wrapping/hyphenation using CSS.\"](https://kenneth.io/blog/2012/03/04/word-wrapping-hypernation-using-css) from that Stack Overflow thread discusses it further.\n. @drublic Updated to include the non-standard `word-break` for WebKit, as well as the CHANGELOG.md and version in package.json.\n\nBut now there's a merge conflict due to the earlier commit.\n. :+1: Thanks!\n. Pull request: https://github.com/drublic/css-modal/pull/172\n\nI built the project too `grunt dist`, but noticed the `modal.css` generated is quite different to the current version in your repo.\n. I'd rather go with what the current W3C spec says:\n\nProperty: _word-break_\nValue(s): `normal | keep-all | break-all`\n\nhttp://www.w3.org/TR/css3-text/#word-break\n\nProperty: _overflow-wrap/word-wrap_\nValue(s): `normal | break-word`\n\nhttp://www.w3.org/TR/css3-text/#overflow-wrap-property\n\nThis article [\"Word wrapping/hyphenation using CSS.\"](https://kenneth.io/blog/2012/03/04/word-wrapping-hypernation-using-css) from that Stack Overflow thread discusses it further.\n. @drublic Updated to include the non-standard `word-break` for WebKit, as well as the CHANGELOG.md and version in package.json.\n\nBut now there's a merge conflict due to the earlier commit.\n. :+1: Thanks!\n. ",
    "smnk": "Can't reproduce it with the latest commit. Thanks!\n. Can't reproduce it with the latest commit. Thanks!\n. ",
    "chilblane": "Are you using any iframes, such as to youtube? Having an issue where modal.js is trying to listen for hashchange within the youtube iframe and breaking as a result.\n. Are you using any iframes, such as to youtube? Having an issue where modal.js is trying to listen for hashchange within the youtube iframe and breaking as a result.\n. ",
    "tmpkco": "Hans,\n\nI've contacted you about some issues previously, and this was one of them. Including the plugins that you mention above did not solve the issue on the site I was developing. Unfortunately, I cannot provide the code. I had it configured as shown, an even referenced your examples, but I had the same issue.\n. Hans,\n\nI've contacted you about some issues previously, and this was one of them. Including the plugins that you mention above did not solve the issue on the site I was developing. Unfortunately, I cannot provide the code. I had it configured as shown, an even referenced your examples, but I had the same issue.\n. ",
    "rafagaseo": "I solved adding **onclick=\"pauseVid()\"** in the element that have the class `.modal-close` \n\nAnd I Added in js\n\n``` javascript\nvar vid = document.getElementById(\"video\");\nfunction pauseVid() {\n    video.pause();\n}\n```\n. I solved adding **onclick=\"pauseVid()\"** in the element that have the class `.modal-close` \n\nAnd I Added in js\n\n``` javascript\nvar vid = document.getElementById(\"video\");\nfunction pauseVid() {\n    video.pause();\n}\n```\n. ",
    "mendelk": "+1\n. +1\n. ",
    "josh1324": "I had the same problem, I removed this in modal-core.scss to fix the problem.\n\n```\n .has-overlay {\n    overflow: hidden;\n    > body {\n        height: 100%;\n        overflow: hidden;\n    }\n }\n```\n. I had the same problem, I removed this in modal-core.scss to fix the problem.\n\n```\n .has-overlay {\n    overflow: hidden;\n    > body {\n        height: 100%;\n        overflow: hidden;\n    }\n }\n```\n. ",
    "HTMLGuyLLC": "Try jAlert http://flwebsites.biz/jAlert/ and use $('.jAlert').closeAlert();\n. Try jAlert http://flwebsites.biz/jAlert/ and use $('.jAlert').closeAlert();\n. ",
    "bojidar-bg": "Seems like it's gone...\n. Seems like it's gone...\n. ",
    "m4nuC": "Ok thanks. Would love to use this modal on our next project but that makes it a no go. Yes it was on chrome. \n. Ok thanks. Would love to use this modal on our next project but that makes it a no go. Yes it was on chrome. \n. ",
    "adriaanbaelus": "Chris\n\nI had the same issue as you, so I submitted a pull request. I can't quite seem to fix it in your JSFiddle, but I suspect that may be because JSFiddle wraps the whole page in yet another iframe.\n\nTry with #200, it might solve your issues.\n\nRegards\nAdriaan\n. Chris\n\nI had the same issue as you, so I submitted a pull request. I can't quite seem to fix it in your JSFiddle, but I suspect that may be because JSFiddle wraps the whole page in yet another iframe.\n\nTry with #200, it might solve your issues.\n\nRegards\nAdriaan\n. ",
    "mlumbroso": "Same behaviour, both iPhone and iPad, Chrome and Safari.\r\nIt seems to be related to the `position: fixed` of `modal--show`\r\n\r\nI'm trying to find a workaround, if you have one don't hesitate to share !. At the end, I used this stackoverflow answer : http://stackoverflow.com/a/35675094/374395\r\n\r\nIn the CSS of the parent page, you need\r\n```\r\n\r\nhtml,body{\r\n    -webkit-overflow-scrolling : touch !important;\r\n    overflow: auto !important;\r\n    height: 100% !important;\r\n}\r\n```. Same behaviour, both iPhone and iPad, Chrome and Safari.\r\nIt seems to be related to the `position: fixed` of `modal--show`\r\n\r\nI'm trying to find a workaround, if you have one don't hesitate to share !. At the end, I used this stackoverflow answer : http://stackoverflow.com/a/35675094/374395\r\n\r\nIn the CSS of the parent page, you need\r\n```\r\n\r\nhtml,body{\r\n    -webkit-overflow-scrolling : touch !important;\r\n    overflow: auto !important;\r\n    height: 100% !important;\r\n}\r\n```. ",
    "Julix91": "Update: I reduced it to a few lines of content, and only the modal.css and it still happened... [see better example page](http://julix.ca/misc/comp1950/A1/modal-error.html). then I realized, even though I didn't indent to, I may have changed the modal.css file at some point, so I look in it again for the first time in a long time and see:\r\n\r\n```\r\nhtml {\r\n  overflow-y: scroll;\r\n  -webkit-overflow-scrolling: touch; }\r\n```\r\nDon't remember adding that, maybe it was part of it originally? Anyway, pretty clear what I should do about it... (i.e. comment that out and it works! :) ) -- oh and I declared modal css later than my css - thus why changing the rules in my file didn't make a difference. \r\n\r\nOh the head-scratching, I was so sure it was something in my file... Haha\r\n\r\nUpdate II: Confirmed its from your code, but didn't manage to find out _why_ it's there to begin with. What's up with that? How is it necessary / a good idea for modal css to come with that rule for html?. Update: I reduced it to a few lines of content, and only the modal.css and it still happened... [see better example page](http://julix.ca/misc/comp1950/A1/modal-error.html). then I realized, even though I didn't indent to, I may have changed the modal.css file at some point, so I look in it again for the first time in a long time and see:\r\n\r\n```\r\nhtml {\r\n  overflow-y: scroll;\r\n  -webkit-overflow-scrolling: touch; }\r\n```\r\nDon't remember adding that, maybe it was part of it originally? Anyway, pretty clear what I should do about it... (i.e. comment that out and it works! :) ) -- oh and I declared modal css later than my css - thus why changing the rules in my file didn't make a difference. \r\n\r\nOh the head-scratching, I was so sure it was something in my file... Haha\r\n\r\nUpdate II: Confirmed its from your code, but didn't manage to find out _why_ it's there to begin with. What's up with that? How is it necessary / a good idea for modal css to come with that rule for html?. ",
    "Firegarden": "I have the same issue - when I use the modal there is a scroll bar that is not needed. Can you please help us understand why this scroll bar is necessary? The css that causes this is html {\r\n    overflow-y: scroll;\r\n\r\nThank you. Man this is frustrating. I have the same issue - why are the core files not easily available for download?. I appreciate you putting up the Sass but really I just want the CSS and JavaScript files so I can quickly test the code. Sorry if I sound grumpy I do appreciate you sharing your code with the world. . I wonder if this speaks to the issue? https://css-tricks.com/snippets/css/force-vertical-scrollbar/ Specifically it suggests body { height: 100%; margin-bottom: 1px; }\r\n\r\nIt would really help me if I could understand why the html overflow-y scroll is included in modal css?. I have the same issue - when I use the modal there is a scroll bar that is not needed. Can you please help us understand why this scroll bar is necessary? The css that causes this is html {\r\n    overflow-y: scroll;\r\n\r\nThank you. Man this is frustrating. I have the same issue - why are the core files not easily available for download?. I appreciate you putting up the Sass but really I just want the CSS and JavaScript files so I can quickly test the code. Sorry if I sound grumpy I do appreciate you sharing your code with the world. . I wonder if this speaks to the issue? https://css-tricks.com/snippets/css/force-vertical-scrollbar/ Specifically it suggests body { height: 100%; margin-bottom: 1px; }\r\n\r\nIt would really help me if I could understand why the html overflow-y scroll is included in modal css?. ",
    "diomed": "youtube/vimeo iframe - you can easily see it [hear it that is] in example, after you open it, and close it.. youtube/vimeo iframe - you can easily see it [hear it that is] in example, after you open it, and close it.. "
}