{
    "somerandomdude": "The Wiki is now activated.\n. I've been trying to design a print icon for quite some time with little success. I'll continue to try.\n. Agreed. If you look at markup within the SVG file, you'll see a series of _glyph_ elements with a _unicode_ attribute. You could reverse engineer what each glyph is bound to and remove the ones you don't need. It's a hack, but it should work.\n. Hey Yann, I was planning on adding all the fonts, but unfortunately it is such a considerable pain that I have decided to drop it. I would love to see someone else take this piece on - if you're interested, I'd be happy to lend assistance.\n. Hey Yann,\n\nI used font creation software which does not do a good job at all.\n\nI do know how to convert a font from SVG to all the main formats - I can\nhandle that. If you can create that script, I will help you in any way you\nneed - it would be a tremendous help! I would like to add the script to the\nGit repository if you wouldn't mind.\n\nI also planned on following a different organization for which Unicode\npositions to use based on the following article:\nhttp://www.codestyle.org/css/at-font-face/StandardUnicodeIconsWebFonts.shtml.\nI would be happy to do some of the dirty work if it makes your life\neasier.\n\nI have a lot of ideas around this space and would love to work with you on\na couple other ideas if you're interested. I would like to create a\nJavascript version of Iconic which allows the rendering of icons in Canvas\nand/or WebGL. I have been stymied by my inability to create a script to\nconvert SVG paths to Javascript code. There is a lot of work in this space,\nbut nothing that was directly translatable. If you're interested in that, I\nwould be happy to provide a modest compensation for your work.\n\nI'm eager to hear back from you.\n\nOn Wed, Dec 7, 2011 at 6:49 AM, Yann Hourdel <\nreply@reply.github.com\n\n> wrote:\n> \n> I hope I can help you.\n> How did you do it the first time? (which soft, etc)\n> Do you know how to convert a svg font into all others formats ? I think\n> generating the svg font is quite easy since it is made of very simple\n> XML-like code. I could create a script that creates that file from scratch\n> with little pain, but then I have no idea how to convert it into ttf and\n> other formats...\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/4#issuecomment-3047979\n. Sounds awesome. Let's fork it for now and change it roles as it become necessary. \n\nThis is wonderful, I will make sure to provide significant credit to you.\n\nOn Dec 7, 2011, at 10:16 AM, Yann Hourdel wrote:\n\n> Ok I'll try the script as soon as I can. Should I fork your repository ? Or would you prefer to add me as a collaborator ?\n> \n> About the unicode idea: I think it would be a good thing, and the modification is very easy to make in the SVG file.\n> \n> About the JS idea: I think I can help you on this one too, but not right now 'cause I'm in quite a hurry in my current project. But when it's done I'll have a look at it.\n> \n> About the compensation: the right to use this font will be more than enough ;-)\n> \n> I'll come back to you as soon as I have tried the script (maybe tonight).\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/4#issuecomment-3051030\n. Thank you so much for all the effort on this! I will be working on integrating this tonight and tomorrow. Quick question, would it be just as easy to bind each icon to the Unicode decimal or hex value? The reason I mention this is that many of the characters I will be binding icons to don't actually have a character associated with them. That being said, that's not a deal-killer.\n\nThanks again so very much. I'll post updates the second I have them.\n. I couldn't get it to work on my Mac, but I it's working like a charm on my Ubuntu VM. I'm having a hard time finding fontforge documentation - especially for the 'createChar' method. Any tips?\n. Perfect, I'll get to work translating each icon to the appropriate unicode character. Thanks again for all the help.\n\nOn Dec 15, 2011, at 11:10 PM, Yann Hourdel wrote:\n\n> I put the \"ord\" method but you can change the script to put directly the hex code, see my diff comment.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/pull/5#issuecomment-3174201\n. The Ubuntu VM is working just fine - I'll just keep using that to move forward.\n\nOn Dec 15, 2011, at 11:10 PM, Yann Hourdel wrote:\n\n> I put the \"ord\" method but you can change the script to put directly the hex code, see my diff comment.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/pull/5#issuecomment-3174201\n. Hey Ian, quick question before I close this issue - when you made those JSON files, did you address this mismatch? I don't want to make an assumption one way or the other.\n. FINALLY fixed this. Apologies for the delay.\n. Hey man, thanks for helping out! \n\nI'll take a look at everything you've brought up tonight and get you a response ASAP. From my brief look, it seems like a much better way to manage it.\n\nThanks again, I'll be in touch soon.\n. Hey man, thanks for the patience. \n\nThis all looks great. I agree having the font creation scripts pull from the JSON file will work nicely. I will be working to get this into the master branch this week. \n\nThanks again. I'll make sure you're on the list of contributors.\n. The reason why they're broken up is that each icon is bound to a matching Unicode character. Having the same icon on a different Unicode character screws things up dramatically. However, please feel free to make a new font generation script that includes all icons in one font set.\n. A lot of those symbols match to a Unicode equivalent in a very high range. There are a ton of un-implemented Unicode glyphs up in the high ranges. \n. Thanks - I'll look into it this weekend.\n. I'm a little conflicted here. I don't want to bloat the HTML/CSS to support outdated browsers. However, I would at least like to provide a working EOT file. I may just replace the EOT and leave it as is. The other option could be to create a separate HTML/CSS file for IE8 and below. Thoughts?\n. Sorry guys, I missed the \"deadline\" for this. :) I'm planning on taking care of this tomorrow.\n. OK, I'm WAY late on this issue, but I've committed new EOT files. Unfortunately I don't have a PC to test on - would anyone be willing to give it a shot?\n. Awesome! I used FontSquirrel's font generator. Now I just need to figure out why the FontForge Python scripts are not generating usable EOT files...\n\nThanks for the confirmation!\n. Grrr... OK. I'm kind of at a loss as to what's happening with the EOT file. I'll see what I can do to fix this.\n. Is the EOT file not working for you?\n\nOn Sep 28, 2012, at 4:48 PM, Chad Burt notifications@github.com wrote:\n\n> I've tried putting the .ttf (both my own build and the own from the packaged download) through fontsquirrel and ttf2eot with no luck :(\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Let me know how it works out for you.\n\nOn Sep 28, 2012, at 4:48 PM, Chad Burt notifications@github.com wrote:\n\n> I've tried putting the .ttf (both my own build and the own from the packaged download) through fontsquirrel and ttf2eot with no luck :(\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. I'll look into this tonight/tomorrow.\n\nOn Jan 31, 2013, at 3:27 PM, Anthony Bruno notifications@github.com wrote:\n\n> Having this problem as well. Nothing I do to regenerate an EOT seems to work. Any follow up?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. OK\n. Sorry, I accidentally closed this. So I've updated the fonts and I know the EOT file is working. My demo code is not working though and I am still trying to figure out why that's the case. I'll update when I have a solution.\n. No problem! Let me know if you have any issues.\n\nOn Thu, Feb 14, 2013 at 9:57 AM, Petr Chutný notifications@github.comwrote:\n\n> Good, thanks!\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/somerandomdude/Iconic/issues/9#issuecomment-13568951.\n. Great idea. I'll get on that this week.\n. .woff files have been added to the latest commit. Thanks for the suggestion!\n. Thanks Lucas, I'm fixing this right now.\n. Ah, I see - so a separate font face that merges all of the icons into one font. I'm still conflicted on the mapping structure for duplicate icons (with different styles). I wrote about the subject here: http://somerandomdude.com/2012/01/31/font-embedding-icons-the-right-way/. Having one document icon map to the Unicode document glyph and another map to an unused glyph seems semantically inappropriate.  \n\nI would prefer to have this unified font exist in a fork. I think a unified font is useful, but I strongly support proper Unicode mapping when possible. To me, this seems akin to putting regular and bold weights of the letter 'a' in one font where the regular weight was mapped to 'a' and the other was mapped to a character in the private range. \n. OK, let's give this a shot and see what people think. Thanks again for all the help.\n. Right now, it's manual. I can't think of any _good_ way to automate the process. I was considering using the JSX files which generate PNGs and SVGs from the source Illustrator file to write the JSON files, but there still needs to be a Unicode mapping to each icon at some point in the process - and that can never be automated. If you have any thoughts on the process, I would love to hear them.\n. Thank you sir! Would you mind if I added this to the wiki?\n. This is good to hear. For some reason, it didn't work for me, I need to do a little more research as to why that was the case.\n. Hey guys, I just wanted to thank you for all the effort you're putting into this and let you know how much I appreciate it. I'm having one hell of a time wrangling FontForge to get it what I need to do, so any help in that area would be great. \n\nI am more than happy to contribute however I can. This is exactly what I was hoping to see by open-sourcing Iconic, so I'm pretty stoked about this. Thanks!\n. Made a significant push on the font sizes which should alleviate this issue.\n. Given the style guide of Iconic, a stroked star is literally impossible. I would need to change the weight of the stroke for that one icon and I think that would cause more problems than it would solve. I don't think there will be a stroked star in Iconic, but it will definitely show up in any new icon set I design.\n. Hey man, your work looks great!\n\nFontAwesome is a great icon set and probably a better fit for Bootstrap. Iconic was designed for some very specific purposes (a large range of legibility, usually down to 8 pixels) and a über minimal style (often too minimal) based on an 8x8 grid system. This limits what icons I can make and how I can make them.\n\nThat said, I am _highly_ considering making a new icon set without those tight restrictions and just go for aesthetics. I feel very confident that I could provide a top-tier icon set that would be a good fit for something like Bootstrap. I am seriously mulling it, I just need the time and resources to make it happen. \n. I honestly thought it would be impossible, but I was able to design a decent-looking paperclip icon in the 8x8 grid. It will be in the next release.\n. I will be working on this soon. Apologies for the radio silence.\n. Great call on this guys. The latest commit addresses this issue.\n. Yeah, that makes good sense. I'll see if I can fix that in the coming days.\n\nOn Oct 11, 2012, at 12:18 AM, Bryce Adams notifications@github.com wrote:\n\n> Didn't want to open a new issue for this but I was thinking why not just change it so instead of:\n> .book_alt2:before {content:'\\e049';} or .iconic-book_alt2:before {content:'\\e049';}\n> it be made:\n> .iconic.book_alt2:before {content:'\\e049';}\n> as the .iconic class is required regardless.\n> \n> Any thoughts on this? I personally find it to be much more useful.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Well, I'd like to change the scripts that generate the CSS. If you'd be up for making those changes as well, I wouldn't stand in your way. :)\n\nOn Oct 11, 2012, at 12:18 AM, Bryce Adams notifications@github.com wrote:\n\n> Didn't want to open a new issue for this but I was thinking why not just change it so instead of:\n> .book_alt2:before {content:'\\e049';} or .iconic-book_alt2:before {content:'\\e049';}\n> it be made:\n> .iconic.book_alt2:before {content:'\\e049';}\n> as the .iconic class is required regardless.\n> \n> Any thoughts on this? I personally find it to be much more useful.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Damn. Thanks for the heads up.\n\nP.J. \n\nOn Friday, May 18, 2012 at 3:14 PM, Vitaly Puzrin wrote:\n\n> I've got report in fontello, that generated SVG must have header `<svg xmlns=\"http://www.w3.org/2000/svg\">` instead of just `<svg>`. Or webkit (chrome/chromium) can't use such fonts.\n> \n> https://github.com/fontello/fontello/issues/53\n> \n> Your fonts have the same problem. Please, fix.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/19\n. To be honest, my bandwidth is not too open at this point. I can't guarantee when I'll get to this. If you would like to go about fixing this issue, by all means, feel free to do whatever is necessary.\n\nOn Friday, May 18, 2012 at 3:14 PM, Vitaly Puzrin wrote:\n\n> I've got report in fontello, that generated SVG must have header `<svg xmlns=\"http://www.w3.org/2000/svg\">` instead of just `<svg>`. Or webkit (chrome/chromium) can't use such fonts.\n> \n> https://github.com/fontello/fontello/issues/53\n> \n> Your fonts have the same problem. Please, fix.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/19\n. This should be fixed now - sorry for the slow turn around.\n. You bring up a good point. I could possibly add an optimization script - I'd just need to find an elegant way to add that to the collection.\n\nOn Sunday, June 3, 2012 at 11:57 PM, Visa Kopu wrote:\n\n> When running the PNGs through ImageOptim (a Mac OS X app that uses several different *nix image optimizers), you can easily shave 20-30% from the file size. I can optimize the current images for you and make a pull request, but I guess the optimization should be incorporated to your build process somehow.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/20\n. I finally got around to fixing this. The latest commit has PNG optimization tools added.\n. Thanks! I'll fix this in future versions.\n\nOn Sunday, June 17, 2012 at 2:01 AM, rSSi wrote:\n\n> Hi.\n> I love your font, but it has no Font-Name set in it's properties:\n> Full-Font-Name and Font-Family are set to \"Untitled\" in the ttf-version.\n> I haven't checked the other files yet.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/21\n. This should be fixed now. Let me know if it works for you.\n. This is finally fixed in the latest commit. Thanks for the patience. \n. Oh, that's great to hear! I'll update the documentation.\n\nOn Sep 20, 2012, at 8:26 AM, roelvanhintum notifications@github.com wrote:\n\n> I tested the scripts and they seem to run fine on osx. I did install libpng and fontforge through brew.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Hey Rafal, I'm sorry - I didn't see your message until now. Apologies. I've been working on something along those lines - I should have something significant to show in the coming weeks/months.\n. Thank you so much for your contribution and my apologies for the late response to this!\n. Hey guys, apologies for the delay in responding. I've intentionally left logos out of Iconic because I never felt they belonged in the icon set. I think providing vector logos for influential online properties is useful, but it flirts with intellectual property and I'd like to avoid it. Especially as an open source project, making vector versions of logos \"open\" seems strange. \n\nOn the general subject of Iconic, there's a lot happening behind the scenes. I can't wait to share some pretty big news.\n. Agreed\nP.J.\n\nOn Fri, May 17, 2013 at 5:56 AM, Bengt Lüers notifications@github.com\nwrote:\n\n> Social and other company icons are subject of other icon sets, already. A quick search brought these up:\n> -   [danleech/simple-icons](https://github.com/danleech/simple-icons)\n> -   [adamfairhead/webicons](https://github.com/adamfairhead/webicons)\n>   Since the sets of icons of these projects and Iconis are disjunct, they both have they complement each other without overlap. One can combine this set as seamlessly as possible with a plain logo icon set like \"Simple Icons\", already. So I do not see the necessity to include social respectively company icons in this icon set. Also, these icons will most likely not fit into to grid-based design of Iconic. \n>   ---\n>   Reply to this email directly or view it on GitHub:\n>   https://github.com/somerandomdude/Iconic/issues/26#issuecomment-18059689\n. I'll fix that today.\n\nOn Mar 9, 2013, at 11:32 PM, Stephen Bussey notifications@github.com wrote:\n\n> I tried to fork and fix this myself, but wasn't able to. In raster\\gray_dark the arrow_down_alt2 images are actually arrow_up_alt2 and arrow_up_alt2 is actually arrow_down_alt2 (they're flipflopped in names). It appears to be this way for all raster colors.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. All fixed, thanks for catching it!\n. Good call. I'll need to update the download. The reason why they're different is that I don't include all the different variations of PNG files in the Github repo. So I need to have separate downloads. Thanks for catching this!\n. The link for the new Open Iconic will be live very soon. Lots will be changing around this project very soon.\n. Hey James, thanks for the email!\n\n​Let me see what I can do. I'll dig into the concepts you're trying to convey and see how it fits into Iconic.\n\nThanks!\n\nP.J. \n\nP.J.\n\nOn Tue, Jun 4, 2013 at 6:19 AM, James Moger notifications@github.com\nwrote:\n\n> I'm the author of Gitblit, an open source pure java Git server.  I have recently integrated your currently release of Iconic and I love it!  Scalable glyphs in colors of my choosing... woohoo!\n> I could use a few extra glyphs/icons related to DVCS operations... if you'd be willing to design them.  :)\n> Concepts I want to represent:\n> - open a pull/merge request (I am currently using your share glyph)\n> - close a pull/merge request or, more simply, merge\n> - a group of commits (I am currently using one of your cycle/loop glyphs to indicate 'changes')\n> - open issue / bug report / task\n> - close issue / bug report / task\n>   You can see Iconic in action in Gitblit at my demo site for the current SNAPSHOT release here:  https://next-gitblit.rhcloud.com\n>   Thanks for your consideration,\n>   -James\n>   ---\n>   Reply to this email directly or view it on GitHub:\n>   https://github.com/somerandomdude/Iconic/issues/29\n. You bet. We'll definitely be providing Bower support for all open-source front-end code and Open Iconic. :)\n. You most certainly can, and will.\n. This entire repo is going to be removed and replaced with a from-the-ground-up improvement of this set. So I'm going to hold off on accepting any pull requests until the new set is up.\n. But thank you so much for the contribution!\n. Hi there! This project is going to be closing soon and has moved to https://github.com/iconic/open-iconic. Hope this helps!\n. Hi @cwysong85, apologies for the late response. We've added a Database icon in version 1.4.0 and plan to add a Server icon really soon (perhaps even in the next version).\n\nThanks!\n. Hi Fingermark. We may add a class to allow a fixed width. There seem to be times where it makes sense and others where it doesn't. Thanks for the feedback!\n. The Wiki is now activated.\n. I've been trying to design a print icon for quite some time with little success. I'll continue to try.\n. Agreed. If you look at markup within the SVG file, you'll see a series of _glyph_ elements with a _unicode_ attribute. You could reverse engineer what each glyph is bound to and remove the ones you don't need. It's a hack, but it should work.\n. Hey Yann, I was planning on adding all the fonts, but unfortunately it is such a considerable pain that I have decided to drop it. I would love to see someone else take this piece on - if you're interested, I'd be happy to lend assistance.\n. Hey Yann,\n\nI used font creation software which does not do a good job at all.\n\nI do know how to convert a font from SVG to all the main formats - I can\nhandle that. If you can create that script, I will help you in any way you\nneed - it would be a tremendous help! I would like to add the script to the\nGit repository if you wouldn't mind.\n\nI also planned on following a different organization for which Unicode\npositions to use based on the following article:\nhttp://www.codestyle.org/css/at-font-face/StandardUnicodeIconsWebFonts.shtml.\nI would be happy to do some of the dirty work if it makes your life\neasier.\n\nI have a lot of ideas around this space and would love to work with you on\na couple other ideas if you're interested. I would like to create a\nJavascript version of Iconic which allows the rendering of icons in Canvas\nand/or WebGL. I have been stymied by my inability to create a script to\nconvert SVG paths to Javascript code. There is a lot of work in this space,\nbut nothing that was directly translatable. If you're interested in that, I\nwould be happy to provide a modest compensation for your work.\n\nI'm eager to hear back from you.\n\nOn Wed, Dec 7, 2011 at 6:49 AM, Yann Hourdel <\nreply@reply.github.com\n\n> wrote:\n> \n> I hope I can help you.\n> How did you do it the first time? (which soft, etc)\n> Do you know how to convert a svg font into all others formats ? I think\n> generating the svg font is quite easy since it is made of very simple\n> XML-like code. I could create a script that creates that file from scratch\n> with little pain, but then I have no idea how to convert it into ttf and\n> other formats...\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/4#issuecomment-3047979\n. Sounds awesome. Let's fork it for now and change it roles as it become necessary. \n\nThis is wonderful, I will make sure to provide significant credit to you.\n\nOn Dec 7, 2011, at 10:16 AM, Yann Hourdel wrote:\n\n> Ok I'll try the script as soon as I can. Should I fork your repository ? Or would you prefer to add me as a collaborator ?\n> \n> About the unicode idea: I think it would be a good thing, and the modification is very easy to make in the SVG file.\n> \n> About the JS idea: I think I can help you on this one too, but not right now 'cause I'm in quite a hurry in my current project. But when it's done I'll have a look at it.\n> \n> About the compensation: the right to use this font will be more than enough ;-)\n> \n> I'll come back to you as soon as I have tried the script (maybe tonight).\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/4#issuecomment-3051030\n. Thank you so much for all the effort on this! I will be working on integrating this tonight and tomorrow. Quick question, would it be just as easy to bind each icon to the Unicode decimal or hex value? The reason I mention this is that many of the characters I will be binding icons to don't actually have a character associated with them. That being said, that's not a deal-killer.\n\nThanks again so very much. I'll post updates the second I have them.\n. I couldn't get it to work on my Mac, but I it's working like a charm on my Ubuntu VM. I'm having a hard time finding fontforge documentation - especially for the 'createChar' method. Any tips?\n. Perfect, I'll get to work translating each icon to the appropriate unicode character. Thanks again for all the help.\n\nOn Dec 15, 2011, at 11:10 PM, Yann Hourdel wrote:\n\n> I put the \"ord\" method but you can change the script to put directly the hex code, see my diff comment.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/pull/5#issuecomment-3174201\n. The Ubuntu VM is working just fine - I'll just keep using that to move forward.\n\nOn Dec 15, 2011, at 11:10 PM, Yann Hourdel wrote:\n\n> I put the \"ord\" method but you can change the script to put directly the hex code, see my diff comment.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/pull/5#issuecomment-3174201\n. Hey Ian, quick question before I close this issue - when you made those JSON files, did you address this mismatch? I don't want to make an assumption one way or the other.\n. FINALLY fixed this. Apologies for the delay.\n. Hey man, thanks for helping out! \n\nI'll take a look at everything you've brought up tonight and get you a response ASAP. From my brief look, it seems like a much better way to manage it.\n\nThanks again, I'll be in touch soon.\n. Hey man, thanks for the patience. \n\nThis all looks great. I agree having the font creation scripts pull from the JSON file will work nicely. I will be working to get this into the master branch this week. \n\nThanks again. I'll make sure you're on the list of contributors.\n. The reason why they're broken up is that each icon is bound to a matching Unicode character. Having the same icon on a different Unicode character screws things up dramatically. However, please feel free to make a new font generation script that includes all icons in one font set.\n. A lot of those symbols match to a Unicode equivalent in a very high range. There are a ton of un-implemented Unicode glyphs up in the high ranges. \n. Thanks - I'll look into it this weekend.\n. I'm a little conflicted here. I don't want to bloat the HTML/CSS to support outdated browsers. However, I would at least like to provide a working EOT file. I may just replace the EOT and leave it as is. The other option could be to create a separate HTML/CSS file for IE8 and below. Thoughts?\n. Sorry guys, I missed the \"deadline\" for this. :) I'm planning on taking care of this tomorrow.\n. OK, I'm WAY late on this issue, but I've committed new EOT files. Unfortunately I don't have a PC to test on - would anyone be willing to give it a shot?\n. Awesome! I used FontSquirrel's font generator. Now I just need to figure out why the FontForge Python scripts are not generating usable EOT files...\n\nThanks for the confirmation!\n. Grrr... OK. I'm kind of at a loss as to what's happening with the EOT file. I'll see what I can do to fix this.\n. Is the EOT file not working for you?\n\nOn Sep 28, 2012, at 4:48 PM, Chad Burt notifications@github.com wrote:\n\n> I've tried putting the .ttf (both my own build and the own from the packaged download) through fontsquirrel and ttf2eot with no luck :(\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Let me know how it works out for you.\n\nOn Sep 28, 2012, at 4:48 PM, Chad Burt notifications@github.com wrote:\n\n> I've tried putting the .ttf (both my own build and the own from the packaged download) through fontsquirrel and ttf2eot with no luck :(\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. I'll look into this tonight/tomorrow.\n\nOn Jan 31, 2013, at 3:27 PM, Anthony Bruno notifications@github.com wrote:\n\n> Having this problem as well. Nothing I do to regenerate an EOT seems to work. Any follow up?\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. OK\n. Sorry, I accidentally closed this. So I've updated the fonts and I know the EOT file is working. My demo code is not working though and I am still trying to figure out why that's the case. I'll update when I have a solution.\n. No problem! Let me know if you have any issues.\n\nOn Thu, Feb 14, 2013 at 9:57 AM, Petr Chutný notifications@github.comwrote:\n\n> Good, thanks!\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/somerandomdude/Iconic/issues/9#issuecomment-13568951.\n. Great idea. I'll get on that this week.\n. .woff files have been added to the latest commit. Thanks for the suggestion!\n. Thanks Lucas, I'm fixing this right now.\n. Ah, I see - so a separate font face that merges all of the icons into one font. I'm still conflicted on the mapping structure for duplicate icons (with different styles). I wrote about the subject here: http://somerandomdude.com/2012/01/31/font-embedding-icons-the-right-way/. Having one document icon map to the Unicode document glyph and another map to an unused glyph seems semantically inappropriate.  \n\nI would prefer to have this unified font exist in a fork. I think a unified font is useful, but I strongly support proper Unicode mapping when possible. To me, this seems akin to putting regular and bold weights of the letter 'a' in one font where the regular weight was mapped to 'a' and the other was mapped to a character in the private range. \n. OK, let's give this a shot and see what people think. Thanks again for all the help.\n. Right now, it's manual. I can't think of any _good_ way to automate the process. I was considering using the JSX files which generate PNGs and SVGs from the source Illustrator file to write the JSON files, but there still needs to be a Unicode mapping to each icon at some point in the process - and that can never be automated. If you have any thoughts on the process, I would love to hear them.\n. Thank you sir! Would you mind if I added this to the wiki?\n. This is good to hear. For some reason, it didn't work for me, I need to do a little more research as to why that was the case.\n. Hey guys, I just wanted to thank you for all the effort you're putting into this and let you know how much I appreciate it. I'm having one hell of a time wrangling FontForge to get it what I need to do, so any help in that area would be great. \n\nI am more than happy to contribute however I can. This is exactly what I was hoping to see by open-sourcing Iconic, so I'm pretty stoked about this. Thanks!\n. Made a significant push on the font sizes which should alleviate this issue.\n. Given the style guide of Iconic, a stroked star is literally impossible. I would need to change the weight of the stroke for that one icon and I think that would cause more problems than it would solve. I don't think there will be a stroked star in Iconic, but it will definitely show up in any new icon set I design.\n. Hey man, your work looks great!\n\nFontAwesome is a great icon set and probably a better fit for Bootstrap. Iconic was designed for some very specific purposes (a large range of legibility, usually down to 8 pixels) and a über minimal style (often too minimal) based on an 8x8 grid system. This limits what icons I can make and how I can make them.\n\nThat said, I am _highly_ considering making a new icon set without those tight restrictions and just go for aesthetics. I feel very confident that I could provide a top-tier icon set that would be a good fit for something like Bootstrap. I am seriously mulling it, I just need the time and resources to make it happen. \n. I honestly thought it would be impossible, but I was able to design a decent-looking paperclip icon in the 8x8 grid. It will be in the next release.\n. I will be working on this soon. Apologies for the radio silence.\n. Great call on this guys. The latest commit addresses this issue.\n. Yeah, that makes good sense. I'll see if I can fix that in the coming days.\n\nOn Oct 11, 2012, at 12:18 AM, Bryce Adams notifications@github.com wrote:\n\n> Didn't want to open a new issue for this but I was thinking why not just change it so instead of:\n> .book_alt2:before {content:'\\e049';} or .iconic-book_alt2:before {content:'\\e049';}\n> it be made:\n> .iconic.book_alt2:before {content:'\\e049';}\n> as the .iconic class is required regardless.\n> \n> Any thoughts on this? I personally find it to be much more useful.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Well, I'd like to change the scripts that generate the CSS. If you'd be up for making those changes as well, I wouldn't stand in your way. :)\n\nOn Oct 11, 2012, at 12:18 AM, Bryce Adams notifications@github.com wrote:\n\n> Didn't want to open a new issue for this but I was thinking why not just change it so instead of:\n> .book_alt2:before {content:'\\e049';} or .iconic-book_alt2:before {content:'\\e049';}\n> it be made:\n> .iconic.book_alt2:before {content:'\\e049';}\n> as the .iconic class is required regardless.\n> \n> Any thoughts on this? I personally find it to be much more useful.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Damn. Thanks for the heads up.\n\nP.J. \n\nOn Friday, May 18, 2012 at 3:14 PM, Vitaly Puzrin wrote:\n\n> I've got report in fontello, that generated SVG must have header `<svg xmlns=\"http://www.w3.org/2000/svg\">` instead of just `<svg>`. Or webkit (chrome/chromium) can't use such fonts.\n> \n> https://github.com/fontello/fontello/issues/53\n> \n> Your fonts have the same problem. Please, fix.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/19\n. To be honest, my bandwidth is not too open at this point. I can't guarantee when I'll get to this. If you would like to go about fixing this issue, by all means, feel free to do whatever is necessary.\n\nOn Friday, May 18, 2012 at 3:14 PM, Vitaly Puzrin wrote:\n\n> I've got report in fontello, that generated SVG must have header `<svg xmlns=\"http://www.w3.org/2000/svg\">` instead of just `<svg>`. Or webkit (chrome/chromium) can't use such fonts.\n> \n> https://github.com/fontello/fontello/issues/53\n> \n> Your fonts have the same problem. Please, fix.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/19\n. This should be fixed now - sorry for the slow turn around.\n. You bring up a good point. I could possibly add an optimization script - I'd just need to find an elegant way to add that to the collection.\n\nOn Sunday, June 3, 2012 at 11:57 PM, Visa Kopu wrote:\n\n> When running the PNGs through ImageOptim (a Mac OS X app that uses several different *nix image optimizers), you can easily shave 20-30% from the file size. I can optimize the current images for you and make a pull request, but I guess the optimization should be incorporated to your build process somehow.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/20\n. I finally got around to fixing this. The latest commit has PNG optimization tools added.\n. Thanks! I'll fix this in future versions.\n\nOn Sunday, June 17, 2012 at 2:01 AM, rSSi wrote:\n\n> Hi.\n> I love your font, but it has no Font-Name set in it's properties:\n> Full-Font-Name and Font-Family are set to \"Untitled\" in the ttf-version.\n> I haven't checked the other files yet.\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/somerandomdude/Iconic/issues/21\n. This should be fixed now. Let me know if it works for you.\n. This is finally fixed in the latest commit. Thanks for the patience. \n. Oh, that's great to hear! I'll update the documentation.\n\nOn Sep 20, 2012, at 8:26 AM, roelvanhintum notifications@github.com wrote:\n\n> I tested the scripts and they seem to run fine on osx. I did install libpng and fontforge through brew.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Hey Rafal, I'm sorry - I didn't see your message until now. Apologies. I've been working on something along those lines - I should have something significant to show in the coming weeks/months.\n. Thank you so much for your contribution and my apologies for the late response to this!\n. Hey guys, apologies for the delay in responding. I've intentionally left logos out of Iconic because I never felt they belonged in the icon set. I think providing vector logos for influential online properties is useful, but it flirts with intellectual property and I'd like to avoid it. Especially as an open source project, making vector versions of logos \"open\" seems strange. \n\nOn the general subject of Iconic, there's a lot happening behind the scenes. I can't wait to share some pretty big news.\n. Agreed\nP.J.\n\nOn Fri, May 17, 2013 at 5:56 AM, Bengt Lüers notifications@github.com\nwrote:\n\n> Social and other company icons are subject of other icon sets, already. A quick search brought these up:\n> -   [danleech/simple-icons](https://github.com/danleech/simple-icons)\n> -   [adamfairhead/webicons](https://github.com/adamfairhead/webicons)\n>   Since the sets of icons of these projects and Iconis are disjunct, they both have they complement each other without overlap. One can combine this set as seamlessly as possible with a plain logo icon set like \"Simple Icons\", already. So I do not see the necessity to include social respectively company icons in this icon set. Also, these icons will most likely not fit into to grid-based design of Iconic. \n>   ---\n>   Reply to this email directly or view it on GitHub:\n>   https://github.com/somerandomdude/Iconic/issues/26#issuecomment-18059689\n. I'll fix that today.\n\nOn Mar 9, 2013, at 11:32 PM, Stephen Bussey notifications@github.com wrote:\n\n> I tried to fork and fix this myself, but wasn't able to. In raster\\gray_dark the arrow_down_alt2 images are actually arrow_up_alt2 and arrow_up_alt2 is actually arrow_down_alt2 (they're flipflopped in names). It appears to be this way for all raster colors.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. All fixed, thanks for catching it!\n. Good call. I'll need to update the download. The reason why they're different is that I don't include all the different variations of PNG files in the Github repo. So I need to have separate downloads. Thanks for catching this!\n. The link for the new Open Iconic will be live very soon. Lots will be changing around this project very soon.\n. Hey James, thanks for the email!\n\n​Let me see what I can do. I'll dig into the concepts you're trying to convey and see how it fits into Iconic.\n\nThanks!\n\nP.J. \n\nP.J.\n\nOn Tue, Jun 4, 2013 at 6:19 AM, James Moger notifications@github.com\nwrote:\n\n> I'm the author of Gitblit, an open source pure java Git server.  I have recently integrated your currently release of Iconic and I love it!  Scalable glyphs in colors of my choosing... woohoo!\n> I could use a few extra glyphs/icons related to DVCS operations... if you'd be willing to design them.  :)\n> Concepts I want to represent:\n> - open a pull/merge request (I am currently using your share glyph)\n> - close a pull/merge request or, more simply, merge\n> - a group of commits (I am currently using one of your cycle/loop glyphs to indicate 'changes')\n> - open issue / bug report / task\n> - close issue / bug report / task\n>   You can see Iconic in action in Gitblit at my demo site for the current SNAPSHOT release here:  https://next-gitblit.rhcloud.com\n>   Thanks for your consideration,\n>   -James\n>   ---\n>   Reply to this email directly or view it on GitHub:\n>   https://github.com/somerandomdude/Iconic/issues/29\n. You bet. We'll definitely be providing Bower support for all open-source front-end code and Open Iconic. :)\n. You most certainly can, and will.\n. This entire repo is going to be removed and replaced with a from-the-ground-up improvement of this set. So I'm going to hold off on accepting any pull requests until the new set is up.\n. But thank you so much for the contribution!\n. Hi there! This project is going to be closing soon and has moved to https://github.com/iconic/open-iconic. Hope this helps!\n. Hi @cwysong85, apologies for the late response. We've added a Database icon in version 1.4.0 and plan to add a Server icon really soon (perhaps even in the next version).\n\nThanks!\n. Hi Fingermark. We may add a class to allow a fixed width. There seem to be times where it makes sense and others where it doesn't. Thanks for the feedback!\n. ",
    "gr2m": "I don't know much about Icon design, but I like how the print Icon from Raphael Icon-Set is made\nhttp://icons.marekventur.de/\n\nCheers\n. I don't know much about Icon design, but I like how the print Icon from Raphael Icon-Set is made\nhttp://icons.marekventur.de/\n\nCheers\n. ",
    "yhourdel": "I hope I can help you.\nHow did you do it the first time? (which soft, etc)\nDo you know how to convert a svg font into all others formats ? I think generating the svg font is quite easy since it is made of very simple XML-like code. I could create a script that creates that file from scratch with little pain, but then I have no idea how to convert it into ttf and other formats...\n. Ok I'll try the script as soon as I can. Should I fork your repository ? Or would you prefer to add me as a collaborator ?\n\nAbout the unicode idea: I think it would be a good thing, and the modification is very easy to make in the SVG file.\n\nAbout the JS idea: I think I can help you on this one too, but not right now 'cause I'm in quite a hurry in my current project. But when it's done I'll have a look at it.\n\nAbout the compensation: the right to use this font will be more than enough ;-)\n\nI'll come back to you as soon as I have tried the script (maybe tonight).\n. I put the \"ord\" method but you can change the script to put directly the hex code, see my diff comment.\n. No tips to make it work on Mac since I have no idea about it, but here is the doc I used:\nhttp://fontforge.sourceforge.net/python.html\n. I hope I can help you.\nHow did you do it the first time? (which soft, etc)\nDo you know how to convert a svg font into all others formats ? I think generating the svg font is quite easy since it is made of very simple XML-like code. I could create a script that creates that file from scratch with little pain, but then I have no idea how to convert it into ttf and other formats...\n. Ok I'll try the script as soon as I can. Should I fork your repository ? Or would you prefer to add me as a collaborator ?\n\nAbout the unicode idea: I think it would be a good thing, and the modification is very easy to make in the SVG file.\n\nAbout the JS idea: I think I can help you on this one too, but not right now 'cause I'm in quite a hurry in my current project. But when it's done I'll have a look at it.\n\nAbout the compensation: the right to use this font will be more than enough ;-)\n\nI'll come back to you as soon as I have tried the script (maybe tonight).\n. I put the \"ord\" method but you can change the script to put directly the hex code, see my diff comment.\n. No tips to make it work on Mac since I have no idea about it, but here is the doc I used:\nhttp://fontforge.sourceforge.net/python.html\n. ",
    "ianstormtaylor": "Nope, I left it because I wasn't sure if it was purposeful.\n. Awesome! glad to help\n. Nope, I left it because I wasn't sure if it was purposeful.\n. Awesome! glad to help\n. ",
    "puzrin": "I've started remapping, and noticed, that your statement about matching original symbols is not enougth correct.\n\nhttps://github.com/somerandomdude/Iconic/blob/master/scripts/font%20creation/iconic_fill.json#L34\n\n75% of your symbols are mapped to Private Use Area (E000+). Only 25% have ~ correct equivalent.\n. There can be 2 problems:\n- included HTML demo will not work in IE 6/7, because it uses `:before` to add glyphs\n- fontforge can lack of EOT support & write PS1 instead. This header doesn't seems to be EOT:\n\n```\n\\80\u0001l\u0003\\00\\00%!PS-AdobeFont-1.0: IconicFill 001.000\n%%Title: IconicFill\n%Version: 001.000\n%%CreationDate: Thu Dec 29 18:55:15 2011\n%%Creator: PJ Onori,,,\n%Copyright: Icons by PJ Onori, font creation script by Yann\n% Generated by FontForge 20110222 (http://fontforge.sf.net/)\n%%EndComments\n\n10 dict begin\n/FontType 1 def\n/FontMatrix [0.001 0 0 0.001 0 0 ]readonly def\n/FontName /IconicFill def\n/FontBBox {15 -201 1016 801 }readonly def\n/PaintType 0 def\n/FontInfo 10 dict dup begin\n /version (001.000) readonly def\n /Notice (Icons by PJ Onori, font creation script by Yann) readonly def\n /FullName (Untitled1) readonly def\n /FamilyName (Untitled1) readonly def\n /Weight (Medium) readonly def\n /FSType 0 def\n /ItalicAngle 0 def\n /isFixedPitch false def\n /UnderlinePosition -100 def\n /UnderlineThickness 50 def\nend readonly def\n/Encoding StandardEncoding def\ncurrentdict end\ncurrentfile eexec\n```\n\nHere is convertor http://code.google.com/p/ttf2eot/\n. Hm... who cares about HTML/CSS internals, if those are only for testing? Anyway, i'll be fine with any solution, that allow to check, that EOT is really working.\n. Sorry for wrong name in commit lines. All internals are correct. I'm trying to improve several OFL fonts, and had to sleep a bit more :) .\n. 1. Imho, semantic criteria is not appliable here. If we are speaking about bold/italic - all font symbols differs. In your case, only a small count. It's more \"different symbols\", than \"different style\". I think, the proper way is just to request adding new glyphs to unicode standard. And it's a normal pracrtice to add \"not existing\" symbols in PUA until that happens.\n2. In practice, it's more convenient (for users) to have all icons in one file too.\n3. Thechnically, i can maintain separate repo. But design is not my business, and i'd prefer to return results in upstream. I don't ask to remove Stroke/Fill. Just to add third variand. It will not cost you anything. Iconnic font files still have some bugs, and it's much more easy to fix those in single place.\n. There are several ways to allign icons around text for nice look. This problem become essential, if you need to conbine several symbols from different fonts, like in fontomas. As result - we did convertor, to rescale Entypo.\n\nPersonally, i don't use original fonts \"as is\". But i'd be glad to get advices about alligments, that should be supported by fontomas.\n\nAbout original formats - i'd prefer \"fullsize\" (alligned to acsent/descent) + SVG. That's the most convenient for futher processing.\n. I think, by the end of this month i'll be able to provide scripts to quickly experiment with glyphs scale/alligment. Then it will be possible to find several optimal settings, without manual work.\n. https://github.com/fontello/font-builder/commit/a747402df01688af3f201dc1e07bc27479525352 that was fix for my scripts. It should be ok for you with minimal changes.\n\nDon't know, if you are interested. I think it would be more effective to cleanup your repo - remove raster deals (as rarely used) & switch scripts to `font-builder`. Then i'll be able to effectively maintain your font (as i do for Entypo). Result will be like this https://github.com/fontello/iconic-uni.font , but with separate filled/stroke & old mapping, if those are important for you.\n. I've started remapping, and noticed, that your statement about matching original symbols is not enougth correct.\n\nhttps://github.com/somerandomdude/Iconic/blob/master/scripts/font%20creation/iconic_fill.json#L34\n\n75% of your symbols are mapped to Private Use Area (E000+). Only 25% have ~ correct equivalent.\n. There can be 2 problems:\n- included HTML demo will not work in IE 6/7, because it uses `:before` to add glyphs\n- fontforge can lack of EOT support & write PS1 instead. This header doesn't seems to be EOT:\n\n```\n\\80\u0001l\u0003\\00\\00%!PS-AdobeFont-1.0: IconicFill 001.000\n%%Title: IconicFill\n%Version: 001.000\n%%CreationDate: Thu Dec 29 18:55:15 2011\n%%Creator: PJ Onori,,,\n%Copyright: Icons by PJ Onori, font creation script by Yann\n% Generated by FontForge 20110222 (http://fontforge.sf.net/)\n%%EndComments\n\n10 dict begin\n/FontType 1 def\n/FontMatrix [0.001 0 0 0.001 0 0 ]readonly def\n/FontName /IconicFill def\n/FontBBox {15 -201 1016 801 }readonly def\n/PaintType 0 def\n/FontInfo 10 dict dup begin\n /version (001.000) readonly def\n /Notice (Icons by PJ Onori, font creation script by Yann) readonly def\n /FullName (Untitled1) readonly def\n /FamilyName (Untitled1) readonly def\n /Weight (Medium) readonly def\n /FSType 0 def\n /ItalicAngle 0 def\n /isFixedPitch false def\n /UnderlinePosition -100 def\n /UnderlineThickness 50 def\nend readonly def\n/Encoding StandardEncoding def\ncurrentdict end\ncurrentfile eexec\n```\n\nHere is convertor http://code.google.com/p/ttf2eot/\n. Hm... who cares about HTML/CSS internals, if those are only for testing? Anyway, i'll be fine with any solution, that allow to check, that EOT is really working.\n. Sorry for wrong name in commit lines. All internals are correct. I'm trying to improve several OFL fonts, and had to sleep a bit more :) .\n. 1. Imho, semantic criteria is not appliable here. If we are speaking about bold/italic - all font symbols differs. In your case, only a small count. It's more \"different symbols\", than \"different style\". I think, the proper way is just to request adding new glyphs to unicode standard. And it's a normal pracrtice to add \"not existing\" symbols in PUA until that happens.\n2. In practice, it's more convenient (for users) to have all icons in one file too.\n3. Thechnically, i can maintain separate repo. But design is not my business, and i'd prefer to return results in upstream. I don't ask to remove Stroke/Fill. Just to add third variand. It will not cost you anything. Iconnic font files still have some bugs, and it's much more easy to fix those in single place.\n. There are several ways to allign icons around text for nice look. This problem become essential, if you need to conbine several symbols from different fonts, like in fontomas. As result - we did convertor, to rescale Entypo.\n\nPersonally, i don't use original fonts \"as is\". But i'd be glad to get advices about alligments, that should be supported by fontomas.\n\nAbout original formats - i'd prefer \"fullsize\" (alligned to acsent/descent) + SVG. That's the most convenient for futher processing.\n. I think, by the end of this month i'll be able to provide scripts to quickly experiment with glyphs scale/alligment. Then it will be possible to find several optimal settings, without manual work.\n. https://github.com/fontello/font-builder/commit/a747402df01688af3f201dc1e07bc27479525352 that was fix for my scripts. It should be ok for you with minimal changes.\n\nDon't know, if you are interested. I think it would be more effective to cleanup your repo - remove raster deals (as rarely used) & switch scripts to `font-builder`. Then i'll be able to effectively maintain your font (as i do for Entypo). Result will be like this https://github.com/fontello/iconic-uni.font , but with separate filled/stroke & old mapping, if those are important for you.\n. ",
    "matiaskorhonen": "It's not a CSS/HTML issue; I just recreated the EOT files with `ttf2eot` and those work just fine (in IE8).\n\nI committed the new files to my test repo: k33l0r/iconic_test_page@d044024ecb0b7cdc4d0a626f3e209ddabcc727f3\n\n(though you're right that the test file wouldn't work in IE6/7...)\n. I **really** don't care if the test page works in IE6/7 as long as the EOT file does (and IE8 _does_ support the `:before` pseudo element).\n. It's not a CSS/HTML issue; I just recreated the EOT files with `ttf2eot` and those work just fine (in IE8).\n\nI committed the new files to my test repo: k33l0r/iconic_test_page@d044024ecb0b7cdc4d0a626f3e209ddabcc727f3\n\n(though you're right that the test file wouldn't work in IE6/7...)\n. I **really** don't care if the test page works in IE6/7 as long as the EOT file does (and IE8 _does_ support the `:before` pseudo element).\n. ",
    "francocatena": "Fill and Stroke now works great to me in Explorer 7 and 8.\n. Fill and Stroke now works great to me in Explorer 7 and 8.\n. ",
    "petrchutny": "It seems like EOT file isn't working again (IE7,8) – while the EOT generated from FontSquirrel (based on the TTF) works fine, BUT I can't manage to include all glyphs – even with no subsetting, the paper glyph is missing for instance.\n. Thank you kindly, may the force be with you and others who stand up to the god damn IE.\n. Good, thanks!\n. It seems like EOT file isn't working again (IE7,8) – while the EOT generated from FontSquirrel (based on the TTF) works fine, BUT I can't manage to include all glyphs – even with no subsetting, the paper glyph is missing for instance.\n. Thank you kindly, may the force be with you and others who stand up to the god damn IE.\n. Good, thanks!\n. ",
    "underbluewaters": "I've tried putting the .ttf (both my own build and the own from the packaged download) through fontsquirrel and ttf2eot with no luck :(\n. I wasn't able to get the one in the packaged download to work, or any custom builds. I ended up using Fontello to put together a custom font which works. It took some fiddling with the character mappings though. I wonder if that could have had more to do with it. I'll try to do some tinkering in the morning. \n. I've tried putting the .ttf (both my own build and the own from the packaged download) through fontsquirrel and ttf2eot with no luck :(\n. I wasn't able to get the one in the packaged download to work, or any custom builds. I ended up using Fontello to put together a custom font which works. It took some fiddling with the character mappings though. I wonder if that could have had more to do with it. I'll try to do some tinkering in the morning. \n. ",
    "anthonybruno": "Having this problem as well. Nothing I do to regenerate an EOT seems to work. Any follow up?\n. Having this problem as well. Nothing I do to regenerate an EOT seems to work. Any follow up?\n. ",
    "MoOx": "Yayyy !\n. Yayyy !\n. ",
    "lucasmazza": "Just a head's up, I think that the .zip available at http://somerandomdude.com/work/iconic/ doesn't ship with the .woff files. Would be great to update that package too.\n. Just a head's up, I think that the .zip available at http://somerandomdude.com/work/iconic/ doesn't ship with the .woff files. Would be great to update that package too.\n. ",
    "krisbulman": "sure thing, environments may differ, so i will update it as i install it on other boxes\n. I'm willing to take a look at whatever you have to get things moving. I am off to Denver next week for Drupalcon, but after that I can get down to business. \n\nPersonally, I think your approach of an even height and width has attributed to the reason they work well in lists, however they do hover above the baseline. It just goes to prove I need more test cases than just lists.. I will test with buttons and size variance as well. \n\nExcited to hear the thoughts of @somerandomdude around the variances and approaches that can be taken from here.. \n\nI certainly have a lot to learn about fonts, mostly what I know about them has been from a front-end developer perspective, as my initial post likely depicts. I'm a great believer in font icons (pictograms), and I think they will ease the pain front end devs have to endure with upcoming hi-res monitors on the web (most notably the iPad HD). \n\nThe Compass extension I am building is being created to help front-end developers who use sass/compass deal with implementing pictograms, by writing less css but still giving control over them (the control part I have yet to get to) and by deploying icon sets.. The struggle I have is the great variances between icon-sets .. and as you can see from the screenshot there is definitely a wide variance. \n\nI am willing to just adjust the code in the extension to deal with each set, but I would feel much better contributing back to the existing projects and to the overall standardization process if there is one, at the very least I may have to smooth out the fonts just for the extension itself if I had the source files (which i do for iconic). \n\nI'm willing to help Entypo get set up with git and move the project more into the realm of Iconic if that's desirable.. as I'm sure @somerandomdude would be willing to at least provide input as well. Tis the nature of open source, right? \n. sure thing, environments may differ, so i will update it as i install it on other boxes\n. I'm willing to take a look at whatever you have to get things moving. I am off to Denver next week for Drupalcon, but after that I can get down to business. \n\nPersonally, I think your approach of an even height and width has attributed to the reason they work well in lists, however they do hover above the baseline. It just goes to prove I need more test cases than just lists.. I will test with buttons and size variance as well. \n\nExcited to hear the thoughts of @somerandomdude around the variances and approaches that can be taken from here.. \n\nI certainly have a lot to learn about fonts, mostly what I know about them has been from a front-end developer perspective, as my initial post likely depicts. I'm a great believer in font icons (pictograms), and I think they will ease the pain front end devs have to endure with upcoming hi-res monitors on the web (most notably the iPad HD). \n\nThe Compass extension I am building is being created to help front-end developers who use sass/compass deal with implementing pictograms, by writing less css but still giving control over them (the control part I have yet to get to) and by deploying icon sets.. The struggle I have is the great variances between icon-sets .. and as you can see from the screenshot there is definitely a wide variance. \n\nI am willing to just adjust the code in the extension to deal with each set, but I would feel much better contributing back to the existing projects and to the overall standardization process if there is one, at the very least I may have to smooth out the fonts just for the extension itself if I had the source files (which i do for iconic). \n\nI'm willing to help Entypo get set up with git and move the project more into the realm of Iconic if that's desirable.. as I'm sure @somerandomdude would be willing to at least provide input as well. Tis the nature of open source, right? \n. ",
    "andyvanee": "Works for me as well, though I arrived at the same solution via this thread:\n\nhttps://github.com/Lokaltog/vim-powerline/issues/13\n\n`fontforge -script iconic_stroke.py`\n. Works for me as well, though I arrived at the same solution via this thread:\n\nhttps://github.com/Lokaltog/vim-powerline/issues/13\n\n`fontforge -script iconic_stroke.py`\n. ",
    "danielbruce": "First, I hope you like the pictograms despite its shortcomings.\n\nSecond, I'm a graphic designer, not a developer and the pictograms are carefully design to work not only as a web font but also in many other situations. \n\nThe Entypo pictograms is optimized for a size of 20x20 px at 72dpi. As a graphic designer i felt that 16 px is to small and 32 px to big and by making them 20x20 they would also render well at 15x15. So it is at that size as the pictograms should look as sharp as possible.\n\nAt a size of 20x20 all pictograms are also designed to have a even hight and width so they always align nicely in the middle of—let's say—a square 30x30 px button.\n\nThe aesthetics of the pictograms has also been high importance to me apart from the obvious of them being functional. So my approach has—in many cases—been more optical than mechanical in getting the perfect result. \n\nThe font's UPM size is 1000—as it should be for an OpenType font. So to achieve the same result when using Entypo as a font as you get when using vectors—or a result as close as possible—I had the option of making the glyphs either 1000 or 500 high and so they should render perfect at 20pt or 40pt. I went for the second option. None of the options would render the glyphs at a perfect size next to a text in the same size.\n\nThe pictograms are also design to vertically alight to middle in relation to each other. \n\nI'll see what changes I will make to the font in the next release. Better hinting and 20-30 new glyphs will be a part of it for sure.\n\nMaybe I can send you some stripped down versions playing with the dimensions for you to try out. Would you be up for that?\n\nAlso. I'm on parental leave with my two daughters so I don't find to much time to work on this right now.\n\nCheers\n. Here you can see what I was talking about. Size 20 and 15, as a part of a button and alignment.\n\nhttp://cl.ly/3l0e3y220y2X0b1E1r0H\n. Good to have you here Vitaly.\n\nSo how should we move forward with all these issues.\n. Sounds great.\n. First, I hope you like the pictograms despite its shortcomings.\n\nSecond, I'm a graphic designer, not a developer and the pictograms are carefully design to work not only as a web font but also in many other situations. \n\nThe Entypo pictograms is optimized for a size of 20x20 px at 72dpi. As a graphic designer i felt that 16 px is to small and 32 px to big and by making them 20x20 they would also render well at 15x15. So it is at that size as the pictograms should look as sharp as possible.\n\nAt a size of 20x20 all pictograms are also designed to have a even hight and width so they always align nicely in the middle of—let's say—a square 30x30 px button.\n\nThe aesthetics of the pictograms has also been high importance to me apart from the obvious of them being functional. So my approach has—in many cases—been more optical than mechanical in getting the perfect result. \n\nThe font's UPM size is 1000—as it should be for an OpenType font. So to achieve the same result when using Entypo as a font as you get when using vectors—or a result as close as possible—I had the option of making the glyphs either 1000 or 500 high and so they should render perfect at 20pt or 40pt. I went for the second option. None of the options would render the glyphs at a perfect size next to a text in the same size.\n\nThe pictograms are also design to vertically alight to middle in relation to each other. \n\nI'll see what changes I will make to the font in the next release. Better hinting and 20-30 new glyphs will be a part of it for sure.\n\nMaybe I can send you some stripped down versions playing with the dimensions for you to try out. Would you be up for that?\n\nAlso. I'm on parental leave with my two daughters so I don't find to much time to work on this right now.\n\nCheers\n. Here you can see what I was talking about. Size 20 and 15, as a part of a button and alignment.\n\nhttp://cl.ly/3l0e3y220y2X0b1E1r0H\n. Good to have you here Vitaly.\n\nSo how should we move forward with all these issues.\n. Sounds great.\n. ",
    "jasny": "_slightly disapointed_\n\nB.t.w. check out iconic in my extended version of bootstrap: http://jasny.github.com/bootstrap/base-css.html#iconic\n\nUnfortunately this probably won't make it into the original project, because most votes go out to FontAwsome :/. https://github.com/twitter/bootstrap/issues/966\n. _cool_ merci :)\n. _slightly disapointed_\n\nB.t.w. check out iconic in my extended version of bootstrap: http://jasny.github.com/bootstrap/base-css.html#iconic\n\nUnfortunately this probably won't make it into the original project, because most votes go out to FontAwsome :/. https://github.com/twitter/bootstrap/issues/966\n. _cool_ merci :)\n. ",
    "loremipson": "I don't think the issue is with the CSS. The .eot file had some problems with it according to this closed issue: https://github.com/somerandomdude/Iconic/issues/9\n\nTry downloading the new .eot font, that fixed it for me.\n. I don't think the issue is with the CSS. The .eot file had some problems with it according to this closed issue: https://github.com/somerandomdude/Iconic/issues/9\n\nTry downloading the new .eot font, that fixed it for me.\n. ",
    "borisrorsvort": "+1\n. +1\n. ",
    "bryceadams": "Didn't want to open a new issue for this but I was thinking why not just change it so instead of:\n`.book_alt2:before {content:'\\e049';}` **or** `.iconic-book_alt2:before {content:'\\e049';}`\nit be made:\n`.iconic.book_alt2:before {content:'\\e049';}`\nas the .iconic class is required regardless.\n\nAny thoughts on this? I personally find it to be much more useful.\n. If you'd like I can make a pull request with the changes already made?  \n\n## \n\nBryce Adams\n\nOn Friday, 12 October 2012 at 4:35 PM, P.J. Onori wrote:\n\n> Yeah, that makes good sense. I'll see if I can fix that in the coming days.  \n> \n> On Oct 11, 2012, at 12:18 AM, Bryce Adams <notifications@github.com (mailto:notifications@github.com)> wrote:  \n> \n> > Didn't want to open a new issue for this but I was thinking why not just change it so instead of:  \n> > .book_alt2:before {content:'\\e049';} or .iconic-book_alt2:before {content:'\\e049';}  \n> > it be made:  \n> > .iconic.book_alt2:before {content:'\\e049';}  \n> > as the .iconic class is required regardless.  \n> > \n> > Any thoughts on this? I personally find it to be much more useful.  \n> > \n> > —  \n> > Reply to this email directly or view it on GitHub.  \n> \n> —\n> Reply to this email directly or view it on GitHub (https://github.com/somerandomdude/Iconic/issues/18#issuecomment-9367083).  \n. Probably best you do it then :)\n. Didn't want to open a new issue for this but I was thinking why not just change it so instead of:\n`.book_alt2:before {content:'\\e049';}` **or** `.iconic-book_alt2:before {content:'\\e049';}`\nit be made:\n`.iconic.book_alt2:before {content:'\\e049';}`\nas the .iconic class is required regardless.\n\nAny thoughts on this? I personally find it to be much more useful.\n. If you'd like I can make a pull request with the changes already made?  \n\n## \n\nBryce Adams\n\nOn Friday, 12 October 2012 at 4:35 PM, P.J. Onori wrote:\n\n> Yeah, that makes good sense. I'll see if I can fix that in the coming days.  \n> \n> On Oct 11, 2012, at 12:18 AM, Bryce Adams <notifications@github.com (mailto:notifications@github.com)> wrote:  \n> \n> > Didn't want to open a new issue for this but I was thinking why not just change it so instead of:  \n> > .book_alt2:before {content:'\\e049';} or .iconic-book_alt2:before {content:'\\e049';}  \n> > it be made:  \n> > .iconic.book_alt2:before {content:'\\e049';}  \n> > as the .iconic class is required regardless.  \n> > \n> > Any thoughts on this? I personally find it to be much more useful.  \n> > \n> > —  \n> > Reply to this email directly or view it on GitHub.  \n> \n> —\n> Reply to this email directly or view it on GitHub (https://github.com/somerandomdude/Iconic/issues/18#issuecomment-9367083).  \n. Probably best you do it then :)\n. ",
    "rSSi": "Thanks! I tried the *.ttf and it works.\n. Thanks! I tried the *.ttf and it works.\n. ",
    "rafalchmiel": "Hi, no problem. Glad to hear it. Have a nice day!\n. Hi, no problem. Glad to hear it. Have a nice day!\n. ",
    "Kalus": "I'm willing to help add social media icons. I'm thinking three styles: Circle, Box with rounded corners, and a plain social icon. I'll start with Facebook and Twitter. Someone let me know if they're interested in other social icons, or if they'd like to join in. I'm forking now.\n. I'm willing to help add social media icons. I'm thinking three styles: Circle, Box with rounded corners, and a plain social icon. I'll start with Facebook and Twitter. Someone let me know if they're interested in other social icons, or if they'd like to join in. I'm forking now.\n. ",
    "MaPePeR": "The problem is, that you are not allowed to modify the icon-style/use an alternative icon for facebook, twitter, etc. \nEven GitHub is very strict about that.\n. The problem is, that you are not allowed to modify the icon-style/use an alternative icon for facebook, twitter, etc. \nEven GitHub is very strict about that.\n. ",
    "danielepiccone": "We can consider the monochome version of each logo, or maybe we can add just the glyphs, Fontawesome has those . Anyway i am willing to help in this, really miss social media pictorgrams in Iconic.\n. We can consider the monochome version of each logo, or maybe we can add just the glyphs, Fontawesome has those . Anyway i am willing to help in this, really miss social media pictorgrams in Iconic.\n. ",
    "Bengt": "Social and other company icons are subject of other icon sets, already. A quick search brought these up:\n-   [danleech/simple-icons](https://github.com/danleech/simple-icons)\n-   [adamfairhead/webicons](https://github.com/adamfairhead/webicons)\n\nSince the sets of icons of these projects and Iconis are disjunct, they both have they complement each other without overlap. One can combine this set with a plain logo icon set like \"Simple Icons\" as seamlessly as possible, already. So I do not see the necessity to include social respectively company icons in this icon set. Also, these icons will most likely not fit into to grid-based design of Iconic. \n. Social and other company icons are subject of other icon sets, already. A quick search brought these up:\n-   [danleech/simple-icons](https://github.com/danleech/simple-icons)\n-   [adamfairhead/webicons](https://github.com/adamfairhead/webicons)\n\nSince the sets of icons of these projects and Iconis are disjunct, they both have they complement each other without overlap. One can combine this set with a plain logo icon set like \"Simple Icons\" as seamlessly as possible, already. So I do not see the necessity to include social respectively company icons in this icon set. Also, these icons will most likely not fit into to grid-based design of Iconic. \n. ",
    "alexlangberg": "No longer maintained. Closing.\n. No longer maintained. Closing.\n. ",
    "chid": "Right now there doesn't seem to be any download link / reference to open iconic on the https://useiconic.com/ website is that the way it was meant to be?\n. Exciting :+1: \n. Right now there doesn't seem to be any download link / reference to open iconic on the https://useiconic.com/ website is that the way it was meant to be?\n. Exciting :+1: \n. ",
    "fingermark": "Found this in font awesome.  Applied it, and it seems to work: \n\n```\nwidth: (18em / 14);\ntext-align: center;\n```\n. Found this in font awesome.  Applied it, and it seems to work: \n\n```\nwidth: (18em / 14);\ntext-align: center;\n```\n. "
}