{
    "thedjpetersen": "I went ahead and put in @akavlie 's work on this I forgot to tag the commit for this issue.\n. Thinking out loud.\n\nI think there should be the UI views that derive from each other\n- ChatApplicationView\n  - OverviewView\n  - ChatView\n    - ChannelView\n    - ChatView\n      - ChatTitleView\n      - ChatWordsView\n      - ChatInputView\n    - UserListView\n      - UserListTitleView\n      - UserListDisplayView (Need to think of a better name)\n. We'll say that at this point this is good.\n. Its only a problem with the logo correct?\n. I _really_ like the animated scroll. I think it looks great, but it does call issues when you have multiple messages. What about having a smaller time for the new messages to scroll?\n. I guess you really should be only scrolling to the last recieved message.\n. I like the idea of speech bubbles but it doesn't always work so well with lots of messages. I also like the idea of 37signals campfire esque messages.\n. At the very least you should be able to turn off the showing the date. I feel like this could be a checkbox on the input box.\n. Note here are some of the different ideas:\n- http://www.solutionwatch.com/images/office_campfire_chat_full.gif\n- http://watchingapple.com/wp-content/uploads/2007/05/ichat-tabs.png\n- http://dribbble.com/shots/349379-Skype-chat-in-my-world\n- http://dribbble.com/shots/194068-More-chat-console-interface-UX-UI\n. I will try to work something out. I think its really good idea to keep the background of the chat contents white though.\n. The new UI addresses these issues.\n. The only real problem is with the logo correct?\n. At what resolution would the percentage resolution become a problem?\n. I'll checkout the code and get back to you as soon as possible.\n. Good work @akavlie done.\n. We can process these ourselves, I did it in the subway-web code.\n. If you filter on the first characters of the stream, you just have to look for the 'ACTION' string.\n. Here is the line in subway-web:\n\nhttps://github.com/thedjpetersen/subway-web/blob/master/assets/javascripts/subway_views.js#L13\n. No I just wanted you to see the code before I merged it. It gives me a little bit more accountability. \n. If you wanted me just to merge branches though I am fine doing that too.\n. I feel like this is more or less ready to be merged. I would like a way though for the user to define regexs and colors to be alerted. I guess that is a feature for later down the line.\n. Could we put this in a try catch block?\n. I need to design the logo...getting around to it. Someday?\n\n/part should work without a channel, and just quit the current active channel, and set the active channel to the last one in the list.\n. No I am just saying that it is on my things to do. I think that is sensible to do the nearest one.\n. I'll leave the 'x' buttons to you.\n. The X buttons look good but I think they should only be displayed when the user hovers over a tab. I am thinking about how to do this.\n. I might roll that back until I have a good idea how to do it. You would need two hover states, one for the tab and one for the actual button itself.\n. Replace the scrollTo plugin with this.\n. I played around with this for a while and it looks like it isn't going to happen for a bit. The scrollTo plugin works well enough for what we need.\n. I resolved this with some of the userlist updates.\n. Looks good. Merging.\n. I think the twitter bootstrap alert would be fine.\n. Looks fine, I am not sure of the best practices for having your package.json file. \n. This issue is getting more important.\n. Implemented in the `refactor` branch\n. I read the diff and its looks good.\n. Hmm it is working for me...maybe I have unpushed work?\n. That would work too. We would still need a way for them to type in a server if they wanted though.\n. Here are some of the regressions I have seen:\n- Userlist behavior is unusual, idle/active icons not working as expected\n- There are at times the same user listed several times in the userlist\n- Links embedding not working.\n. I have fixed the userlist issues and the embedded media working on getting unread_mentions working correctly again.\n. Use the 'part' icon.\n. Yeh in essence I could just send you a link and then you would be able to follow it and would end up in a room.\n. Its really for people with no technical ability, they would just get dropped in the channel and then have that username.\n. I'll go ahead and take a look at this tomorrow morning.\n. You rock. High five.\n. I like this idea its probably a good idea to this with /part as well make the following all the same:\n\n/part /wc /close\n. /wc and /close are supported by irssi and weechat\n. @niftylettuce are you interested in maybe trying to implement this?\n. There was an issue with the template the userlist should be working now.\n. I think at the moment it is more important just to get the frontend client working well before we worry about a mobile version.\n. If you wanted to help with that, that would be awesome!\n. Ok I will start playing with it. If I can find another way to display it might be better.\n. So I have tried a few other designs but I cannot find something better. I think we are going to have to stick with this for the time being.\n. This is getting merged. Full steam ahead.\n. This should also probably be implemented as a plugin. #180\n. In the `refactor` branch you can now specify which messages you want to print\n. This is resolved now.\n. Ok I'll try to plan accordingly around that.\n. I am considering migrating the datastore to sqlite. I am hoping to get peoples feedback. Advantages/Disadvantages?\n. It may be easier to port with LevelDB as well since it is a key-value store.\n. Your server needs to be 'irc.freenode.net'\n. Ah ok, I am seeing it as well now. I'll try to track it down.\n. I'll close this as the client has been refactored.\n. At the moment we have only programmed it to use a mongodb backend. It would probably take about a day though to make a version that uses couchdb.\n. Thanks!\n. Thanks!\n. Thanks I will try to get to this in the next couple of days.\n. Just curious what are some of the problems that could crop up?\n. At this point using the latest versions of all the packages should be fine, it seems to me that this would be a problem that would manifest itself pretty clearly, when it becomes a problem. \n. I am a little confused what is the issue this is resolving?\n. @akavlie implemented something similar to this. Look here:\n\nhttps://github.com/thedjpetersen/subway/blob/master/assets/js/views/chat_application.js#L19\n. Does it usually happen after a small amount of inactivity? This might be a focus issue.\n. Related gist: https://gist.github.com/1975421\n. I believe this is still causing problems: https://github.com/thedjpetersen/subway/blob/master/assets/js/views/chat_application.js#L29\n\nAs far as I can tell this is a race condition where the client loses focus and somehow the previous window gets assigned as the active one.\n. I haven't been able to duplicate the issue, as far as I can tell the focus for you is never getting fired. Could you confirm that L29 is getting called? @bitemyapp \n. Closing as this should be fixed in the new client. If more people run into it I think it will get reopened.\n. This should be taken care of now with this fix: https://github.com/thedjpetersen/subway/commit/afff83eb0414452ca007546166d8b570d85f8b31\n. This is probably a client side error, can you get the trace from the chrome debugger?\n. As this issue has likely gone stale do you have any additional info @bitemyapp ? I will close unless you feel otherwise. Sorry about the delay.\n. This should be handled more gracefully now as in the `refactor` client we won't get caught in a reconnect loop\n. @tjfontaine did you update the pull request?\n. Done in the `refactor` client. We send all client errors to status window for that server.\n. I went ahead and added the fade, by putting opacity on the main container. I like the idea of adding a reconnect button somewhere on the page.\n. Resolving this as per @ericbarch s response\n. I went ahead and resolved this, nick changes weren't implemented yet, thanks for the detailed bug report.\n. I don't think I understand that this issue, you want the bcrypt dependency removed?\n. Now in the `refactor` branch you can connect to as many servers as you want from one active session.\n. @cwc this looks like it might resolve your earlier issue.\n. I don't really like adding an additional installation step. \n. Just make `config.js.sample` `config.js` and this able to automatically merge and it will be good.\n. This will be resolved with the plugins issue. #180\n. There is a embedImage plugin for the new client: https://gist.github.com/thedjpetersen/dd420dd13d9c5c35ba31 . This could be added as a setting for that plugin.\n. I am not to familiar with this protocol - would someone want to take a whack at implementing this?\n. You probably need to set up your http server to proxy traffic to the node.js instance.\n. Sorry about the very late response.\n. Thanks!\n. Right now we are storing channel history for each channel on the `refactor` branch. I think its pretty standard to just store messages from a channel - is there any reason not to?\n. Do you have a suggestion for an implementation?\n. Not necessarily code wise. I was more referring to how the implementation should look/feel.\n. Moving discussion to newer feature request.\n. Implemented in the `refactor` branch. Normal session storage.\n. Go ahead feel free to PM me if you are still having issues.\n. Looked at the commit - looks fine to me feel free to send a pull request\n. This would probably be implemented as a plugin - once the plugin system is implemented.\n. At this point it would take some kind spirit to host it. I don't have the resources personally to keep a demo running. Nodejitsu doesn't have an unlimited free plan. Heroku might be a good option for this as well.\n. This looks good - I am not sure what the error is for setup though :/\n. This may help: https://devcenter.heroku.com/articles/using-socket-io-with-node-js-on-heroku\n. Linode was gracious enough to let me use a instance to host a demo installation I went ahead and updated the readme to reflect this.\n. If you switch channels and then come back to the original channel does the problem persist?\n. Working on this in the refactored version of the client see #292 for progress\n. This is difficult, because I for one prefer to see the server in that spot. This seems like it would be something to add in the settings area(if they ever get implemented).\n. It looks like to accomplish need to do the following:\n- Add some parameters to the `config.js` file specifying the server and channel to connect to\n- You would then need to somehow trigger the `connect` event and then after you have connected the `join` event\n\nI have played around with this but have not found an easy way to implement it.\n. I spent the day thinking about this and I probably closed it prematurely. I will reopen this in case someone else wants to take a whack at it.\n. For those still interested you can now set a list of default servers/channels in the server settings file that the client will connect to on startup\n. Would it go to reason that if a person set a list of default server/channels they wouldn't want to allow additional server/channels?\n. Right now you have to refresh the page to connect to a new IRC server.\n. It is definitely something I would be interested in seeing implemented. I would gladly look over any patch.\n. Looks good to me! Thanks!\n. Probably could implement arrows to scroll up and down - the implementation of this needs to happen in `ChannelListView`\n. The solution to this is probably using the bootstraps up/down carets and having a backbone view control behavior.\n. so this has been done in the refactored version please see the `refactor` branch\n. @ngokevin poke poke\n. Looks like this might have gone stale. I'll look at re-opening it if it gets updated.\n. Thanks\n. Thanks!\n. This should resolve #154\n. Looks great thanks for including the link.\n. Thanks!\n. Never mind about the leaving it up, I wasn't aware of the nodejitsu pricing plan. The subway app there now is not mine, I don't know how put it up, I have been thinking I need to have an example app somewhere. I hosted it for a while on my own VPS but was receiving more traffic than I liked.\n. I went ahead and added you as a major contributor.\n. Thanks!\n. This was done here https://github.com/thedjpetersen/subway/pull/157\n. Looks good to me thanks.\n. In the refactored version I am just using the font-awesome circle. It seems to work pretty well.\n. It might be valuable to look at the `subway` charm as well.\n. Can you find a reproduce case?\n. @cwc thanks I'll dig into it this weekend\n. Is there any client side error during this?\n. I'll go ahead and investigate this.\n. Relevant error:\n\n```\n TypeError: Cannot read property 'chans' of undefined\nat Socket.module.exports.socket.on.socket.on.name (../subway/lib/socket.js:107:28)\n```\n. Fixed with the latest commit.\n. I have a different approach in mind for this.\n. You can specify a remote mongo source here: https://github.com/thedjpetersen/subway/blob/master/config.js#L10 I am not sure how you would pass the password though - it might take some monkeying in the source.\n. I am not quite sure what this issue is asking for. Do you want to specify the port for your instance of subway?\n. I am not sure how I would implement this do you want to take a crack at it?\n. Double clicking is a good idea but I think I will go about this a message icon instead.\n. There should probably be a plugin folder that contains plugins and then a variable in the config where you specify which plugins you want to enable.\n. Updated the node-irc dep, as well the bootstrap/backbone ones.\n. @hermansc Unfortunately this bug has mutated a bit in the new branch - want to take a look at it?\n. @Fauntleroy did you have any luck tracking this down? If you can provide any additional info I can go ahead and take a look at it as well.\n. Thanks! Looking forward to seeing your IRC client. I would love to hear more about it. Feel free to ping me on freenode if you want to talk about it, I idle under the nick `petersed`\n. Are you running ubuntu @tvamsisai ?\n. You did this? \n\n```\nsudo apt-get install libssl-dev\n```\n. If people are still using this, I can also update the package dependencies. But I would highly encourage all of you to take a look at shout, which is actively maintained.. Thanks!\n. I am sorry I am little confused. What do you mean using subway \"only for localhost\"?\n. Right you beat me to the punch - I'll go ahead and review again.\n. Thanks Kevin.\n. Thanks!\n. Thanks!\n. I'll take another pass on this.\n. Pulled this down and am re-architecting it a bit.\n. So I feel bad for leaving this open for so long. After taking a long look at it I don't think this is the approach that most people have requested. The idea would be for a server to connect to as soon as the client is opened and then drop the person in a room. So I am closing this for now.\n. Thanks for reporting!\n. Can you please keep your pull requests seperate. The default server code is correctly in a seperate pull request and should not be here. \n. I am running into this same problem - I will change the package.json to reference connect-assets github repo\n. Thanks!\n. Thanks!\n. Thanks!\n. This is an issue with node-irc https://github.com/thedjpetersen/subway/issues/190\n. Mentions should match anywhere.\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. Should be fixed. Feel like a bit of a broken record referencing the `refactor` branch.\n. The overlay/confirm dialog is gone in the `refactor` version of the app.\n. Would changing the color of the font work as well?\n. Thanks @eirikb !\n. Right now both the frontend and backend are tightly coupled so this functionality is not available.\n. Thanks for the pull request! I don't necessarily like the way this changes the UI though. If you have other ideas for the way this could be implemented feel free to re-open.\n. Full topic displayed in the `reactor` branch\n. This issue is a dupe \nhttps://github.com/thedjpetersen/subway/issues/179\n. Sorry for the confusion. This ended up being decided in a separate issue( see here: #70 ). I am afraid there isn't any clear migration path.\n. Thanks!\n. Would be useful to have a setting to turn this on/off as well\n. Server messages, specifically MOTD, should be rendering cleanly in the `refactor` branch\n. Subway is in the process of being refactored - this should be fixed in the refactor branch. If you test it and the issue still persists could you reopen?\n. I agree - its probably something to come back and revisit a later date\n. Looks so cool :smile: \n. Thanks!\n. Thanks - probably overly aggressively merged the last solution.\n. As soon as conflicts are resolved I'll merge this\n. I went ahead and committed this - let me know if you are still running into trouble\n. Could you pull the latest and test again?\n. Dupe of #252 \n. Subway is in the process of being refactored - this should be fixed in the refactor branch. If you test it and the issue still persists could you reopen?\n. Thanks!\n. Published\n. Subway is in the process of being refactored - this should be fixed in the `refactor` branch. If you test it and the issue still persists could you reopen?\n. Implemented in the `refactor` branch.\n. @badosu could you take a quick look at this since you added the `client_port` attribute?\n. Thanks for the input @badosu , guess it all LGTM!\n. In the future I believe this should just be a plugin\n. See #292 \n. Do any of you have a repro case? I would like to try to solve this one? Is there someplace I can just go copy and paste colored text?\n. I am going to go ahead and close this one out. As mentioned above let's have this be implemented as a plugin.\n. @BYK is your only issue with react a stylistic thing?\n. Ok I have put the work on the refactor branch - very little works, just a heads up\n. @46bit I am taking that approach from the beginning with the rewrite\n. @hermansc as soon as the newer version reaches feature parity - I would like it to replace the master branch. If the refactor stagnates - nothing will change.\n. @46bit sure I'll hop on for a bit\n. Quick update: \n\nThe rewrite is coming swimmingly so far. Handling and emitting raw IRC commands has been much easier than working with the node-irc wrapper commands. As you can see from the checkbox list above I am working slowly trying to get parity with weechat commands. I need to ensure that I am handling every received event on the frontend as well. If anyone wants to help with this be sure to ping me and I would love to give more info on this. After the client can is fully functional, I'll work on adding persistence and then polishing up the UI.\n. Took some time off of writing support of commands to polish up the settings. Next up is porting the legacy persistence/auth setup. I would love to hear feedback about the settings work I did as well. \n. So the work for backend persistence is well underway. I have sketched out something basic right now and committed it. I will have to revisit it. At the moment everytime there is a state change in the client I am just persisting it with a sync call on the client. I will need to implement something that keeps track of a logged in client through a server method.\n. After discussing with @hermansc in the IRC channel - its clear the most optimal way to keep track of the state of client on the server is to modify the client code so it can be used by the server. This includes the backbone models and the irc handling code.\n. Fixed some minor bugs with the persistence going to add logging of messages next - also need to move that massive checklist of commands above somewhere else\n. Basic logging implemented - need to make it so when history is loaded it doesn't greedily continue to load history. This should be accomplished by maintaining the scrollbar position. \n\nIf I could get some feedback on this work from anyone I would really appreciate it as well.\n. Getting really close to a RC - could really use some people to help me test the client out and identify bugs.\n. Badosu - I haven't documented it yet but it works more or less like this:\n\nInfo about creating a plugin:\n- Plugins are Github gists(the easiest way to create them is to fork an existing one)\n- To add a plugin to subway you need to add it here(https://github.com/thedjpetersen/subway-plugins/blob/master/plugins.json)\n\n---\n\nPlugin syntax\n- Plugins are defined to the `app.plugins` namespace\n- The plugin method accepts the message - and returns the parsed message(as an html object) and a listener(which can be attached to the element)\n. ah ok - still new to the npm dependencies thing\n. what is the format?\n. This is really neat. A quick note: I have worked on refactoring the client trying to make it more robust and easier to maintain the frontend code(using bower and grunt). If you would consider porting this work over to the `refactor` branch I would love to get it in here. Sorry that the work for this branch was lost.\n. Thanks\n. I can totally get behind this - cool!\n. Thanks!\n. I dropped bootstrap and am just writing lightweight css for most of the client.\n. Making it mobile compatible needs to be a priority, but probably needs to be captured as a separate issue. \n. Closing - server messages should be rendering cleanly in the `refactor` branch\n. Is this when you have an active session(i.e logged into the server?)\n. Thanks!\n. This is resolved now\n. haven't created a way to do this yet no\n. Also there is a on-going rewrite tracked in #292 this is something that I could target to add in that.\n. Right now I am leaning towards leaving this info in the config instead of env variables\n. Going forward we'll be working off the `refactor` branch. I am kind of on the fence as far as whether or I want to disable the login/register buttons - but if there was more support for this feature I would roll it in.\n. neato\n. Looks like I wiped them out when I replaced it with the refactored version - I'll go ahead and manually re-add these. Sorry about that\n. Having a little trouble understanding the issue on this one - if you could provide a little more context I might be able to help more.\n. what is the error you are getting?\n. Could this be implemented as a plugin? I assume you want these handlers to act on URIs in messages. Example of a plugin: https://gist.github.com/thedjpetersen/9140203\n. Ah ok I think I understand a little better now. This is something I would consider as a pull request more than an issue - handling the query string parameters could be a little tricky.\n\nClosing for now.\n. This is fixed in the `refactor` branch which will be the source of future development. Thanks for the pull request - sorry the work wasn't included.\n. Neat project - but right now outside the scope of subway. I would probably reconsider if this was brought back as a pull request.\n. hermansc - try to catch me on irc where we can flesh this out a little bit more and then maybe circle back to comment here\n\nnote this is the idea of the settings/server.js settings/client.js files\n. Since we all seem to be in agreement about this - we'll close this issue. If there is a specific thing you want added - that can be opened as a seperate issue.\n. Looks like this is related to somehow having a bad session cookie - the fix should just be testing whether or not the user is defined.\n. Fixed with last push\n. Any other Linux users able to repro this? It seems to work fine for me on Mac.\n. I think the problem he is having @totokaka is that it doesn't go away even when there is no where to scroll.\n. I was able to fix the jumping up bug - it happens when you are embedding image/youtube. That is unrelated.\n. Should be fixed now\n. This is another tough one to repro. This happened I believe when two users were simultaneously connected to the same room? \n. Note: This is when two logged in users are connected - it happens to one of the logged in users\n. Can you provide any more context I am having a little trouble repro-ing?\n. Should now be resolved \n. You can do this right now in the settings - you can select what types of messages you want to see\n. It should be saving your settings everytime you make a change something.\n\nSee here: https://github.com/thedjpetersen/subway/blob/refactor/src/components/settings/general.jsx#L33\n. This is implemented for different highlights. See here: https://github.com/thedjpetersen/subway/blob/refactor/src/js/boilerplate.js#L124\n. ah I understand - there isn't currently a way to do this. Do you think this justifies a notification? \n. This is the line that is failing: https://github.com/thedjpetersen/subway/blob/refactor/src/components/settings/general.jsx#L33\n. I would love to dig into this more, but this error message/description is just to brief to reproduce more. Was this happening after you disconnected and refreshed? I'll go ahead and close this - feel free to reopen if you have more info.\n. Most likely related to a bug with kicking users - leaving this open a bit to see if it crops up again for me\n. Hi Wilfried!\n\nUntil the client is really finished there is a target date for distributing Subway other than with github and eventually npm.\n. So locally I am able to join a channel named '#' using the tip of master\n. Could you retest please?\n. Dupe of #152 \n. Is there any documentation on this standard?\n. the package.json standard - I am just wondering why you need the 'js' extension\n. ah ok I found it https://www.npmjs.org/doc/files/package.json.html\n. A bit out of the scope of this project\n. A little tough to read the diff - what is this changing besides removing jQuery?\n. OK great! Just one little stylistic thing and this should be good to merge. Thanks!\n. Thanks!\n. What is the error you are getting? Did you install the dependencies?\n. Great! So it looks like you started the chat client correctly. To connect to freenode you type the following into the connect form:\n\n  irc.freenode.net\n  Abc_123\n\nThen push \"connect\" - after you have connected to join the node.js channel you just type in \"/join #node.js\"\n\nHope that works for you!\n. Interesting - this feature is not in subway yet please refer to issue #152 \n. @Elmit2015 just a heads up this just landed in the tip of master - you can now set default channel/nick for users\n. no your config is correct this looks like it is definitely a bug\n. @abruzzihraig I am having quite a bit of trouble reproducing usually this is related to earlier activity could you paste a longer log of the irc activity before this broke?\n. If you create a user and then are logged in with the user it will log messages. Otherwise it doesn't. \n. Just a quick note - user persistence though is not working very well atm check some of the more recent issues. It may not be a bad idea to check out 'shout'.\n. @hrj probably not going to write a guide. Too busy working on the stability of the client. If you wanted to open a pull request with a doc in the support folder I would give it a good look.\n. Did you say this was after a connection reset? It looks like you somehow stayed on a channel after you were disconnected\n. I'm down with this\n. I went ahead and put in @akavlie 's work on this I forgot to tag the commit for this issue.\n. Thinking out loud.\n\nI think there should be the UI views that derive from each other\n- ChatApplicationView\n  - OverviewView\n  - ChatView\n    - ChannelView\n    - ChatView\n      - ChatTitleView\n      - ChatWordsView\n      - ChatInputView\n    - UserListView\n      - UserListTitleView\n      - UserListDisplayView (Need to think of a better name)\n. We'll say that at this point this is good.\n. Its only a problem with the logo correct?\n. I _really_ like the animated scroll. I think it looks great, but it does call issues when you have multiple messages. What about having a smaller time for the new messages to scroll?\n. I guess you really should be only scrolling to the last recieved message.\n. I like the idea of speech bubbles but it doesn't always work so well with lots of messages. I also like the idea of 37signals campfire esque messages.\n. At the very least you should be able to turn off the showing the date. I feel like this could be a checkbox on the input box.\n. Note here are some of the different ideas:\n- http://www.solutionwatch.com/images/office_campfire_chat_full.gif\n- http://watchingapple.com/wp-content/uploads/2007/05/ichat-tabs.png\n- http://dribbble.com/shots/349379-Skype-chat-in-my-world\n- http://dribbble.com/shots/194068-More-chat-console-interface-UX-UI\n. I will try to work something out. I think its really good idea to keep the background of the chat contents white though.\n. The new UI addresses these issues.\n. The only real problem is with the logo correct?\n. At what resolution would the percentage resolution become a problem?\n. I'll checkout the code and get back to you as soon as possible.\n. Good work @akavlie done.\n. We can process these ourselves, I did it in the subway-web code.\n. If you filter on the first characters of the stream, you just have to look for the 'ACTION' string.\n. Here is the line in subway-web:\n\nhttps://github.com/thedjpetersen/subway-web/blob/master/assets/javascripts/subway_views.js#L13\n. No I just wanted you to see the code before I merged it. It gives me a little bit more accountability. \n. If you wanted me just to merge branches though I am fine doing that too.\n. I feel like this is more or less ready to be merged. I would like a way though for the user to define regexs and colors to be alerted. I guess that is a feature for later down the line.\n. Could we put this in a try catch block?\n. I need to design the logo...getting around to it. Someday?\n\n/part should work without a channel, and just quit the current active channel, and set the active channel to the last one in the list.\n. No I am just saying that it is on my things to do. I think that is sensible to do the nearest one.\n. I'll leave the 'x' buttons to you.\n. The X buttons look good but I think they should only be displayed when the user hovers over a tab. I am thinking about how to do this.\n. I might roll that back until I have a good idea how to do it. You would need two hover states, one for the tab and one for the actual button itself.\n. Replace the scrollTo plugin with this.\n. I played around with this for a while and it looks like it isn't going to happen for a bit. The scrollTo plugin works well enough for what we need.\n. I resolved this with some of the userlist updates.\n. Looks good. Merging.\n. I think the twitter bootstrap alert would be fine.\n. Looks fine, I am not sure of the best practices for having your package.json file. \n. This issue is getting more important.\n. Implemented in the `refactor` branch\n. I read the diff and its looks good.\n. Hmm it is working for me...maybe I have unpushed work?\n. That would work too. We would still need a way for them to type in a server if they wanted though.\n. Here are some of the regressions I have seen:\n- Userlist behavior is unusual, idle/active icons not working as expected\n- There are at times the same user listed several times in the userlist\n- Links embedding not working.\n. I have fixed the userlist issues and the embedded media working on getting unread_mentions working correctly again.\n. Use the 'part' icon.\n. Yeh in essence I could just send you a link and then you would be able to follow it and would end up in a room.\n. Its really for people with no technical ability, they would just get dropped in the channel and then have that username.\n. I'll go ahead and take a look at this tomorrow morning.\n. You rock. High five.\n. I like this idea its probably a good idea to this with /part as well make the following all the same:\n\n/part /wc /close\n. /wc and /close are supported by irssi and weechat\n. @niftylettuce are you interested in maybe trying to implement this?\n. There was an issue with the template the userlist should be working now.\n. I think at the moment it is more important just to get the frontend client working well before we worry about a mobile version.\n. If you wanted to help with that, that would be awesome!\n. Ok I will start playing with it. If I can find another way to display it might be better.\n. So I have tried a few other designs but I cannot find something better. I think we are going to have to stick with this for the time being.\n. This is getting merged. Full steam ahead.\n. This should also probably be implemented as a plugin. #180\n. In the `refactor` branch you can now specify which messages you want to print\n. This is resolved now.\n. Ok I'll try to plan accordingly around that.\n. I am considering migrating the datastore to sqlite. I am hoping to get peoples feedback. Advantages/Disadvantages?\n. It may be easier to port with LevelDB as well since it is a key-value store.\n. Your server needs to be 'irc.freenode.net'\n. Ah ok, I am seeing it as well now. I'll try to track it down.\n. I'll close this as the client has been refactored.\n. At the moment we have only programmed it to use a mongodb backend. It would probably take about a day though to make a version that uses couchdb.\n. Thanks!\n. Thanks!\n. Thanks I will try to get to this in the next couple of days.\n. Just curious what are some of the problems that could crop up?\n. At this point using the latest versions of all the packages should be fine, it seems to me that this would be a problem that would manifest itself pretty clearly, when it becomes a problem. \n. I am a little confused what is the issue this is resolving?\n. @akavlie implemented something similar to this. Look here:\n\nhttps://github.com/thedjpetersen/subway/blob/master/assets/js/views/chat_application.js#L19\n. Does it usually happen after a small amount of inactivity? This might be a focus issue.\n. Related gist: https://gist.github.com/1975421\n. I believe this is still causing problems: https://github.com/thedjpetersen/subway/blob/master/assets/js/views/chat_application.js#L29\n\nAs far as I can tell this is a race condition where the client loses focus and somehow the previous window gets assigned as the active one.\n. I haven't been able to duplicate the issue, as far as I can tell the focus for you is never getting fired. Could you confirm that L29 is getting called? @bitemyapp \n. Closing as this should be fixed in the new client. If more people run into it I think it will get reopened.\n. This should be taken care of now with this fix: https://github.com/thedjpetersen/subway/commit/afff83eb0414452ca007546166d8b570d85f8b31\n. This is probably a client side error, can you get the trace from the chrome debugger?\n. As this issue has likely gone stale do you have any additional info @bitemyapp ? I will close unless you feel otherwise. Sorry about the delay.\n. This should be handled more gracefully now as in the `refactor` client we won't get caught in a reconnect loop\n. @tjfontaine did you update the pull request?\n. Done in the `refactor` client. We send all client errors to status window for that server.\n. I went ahead and added the fade, by putting opacity on the main container. I like the idea of adding a reconnect button somewhere on the page.\n. Resolving this as per @ericbarch s response\n. I went ahead and resolved this, nick changes weren't implemented yet, thanks for the detailed bug report.\n. I don't think I understand that this issue, you want the bcrypt dependency removed?\n. Now in the `refactor` branch you can connect to as many servers as you want from one active session.\n. @cwc this looks like it might resolve your earlier issue.\n. I don't really like adding an additional installation step. \n. Just make `config.js.sample` `config.js` and this able to automatically merge and it will be good.\n. This will be resolved with the plugins issue. #180\n. There is a embedImage plugin for the new client: https://gist.github.com/thedjpetersen/dd420dd13d9c5c35ba31 . This could be added as a setting for that plugin.\n. I am not to familiar with this protocol - would someone want to take a whack at implementing this?\n. You probably need to set up your http server to proxy traffic to the node.js instance.\n. Sorry about the very late response.\n. Thanks!\n. Right now we are storing channel history for each channel on the `refactor` branch. I think its pretty standard to just store messages from a channel - is there any reason not to?\n. Do you have a suggestion for an implementation?\n. Not necessarily code wise. I was more referring to how the implementation should look/feel.\n. Moving discussion to newer feature request.\n. Implemented in the `refactor` branch. Normal session storage.\n. Go ahead feel free to PM me if you are still having issues.\n. Looked at the commit - looks fine to me feel free to send a pull request\n. This would probably be implemented as a plugin - once the plugin system is implemented.\n. At this point it would take some kind spirit to host it. I don't have the resources personally to keep a demo running. Nodejitsu doesn't have an unlimited free plan. Heroku might be a good option for this as well.\n. This looks good - I am not sure what the error is for setup though :/\n. This may help: https://devcenter.heroku.com/articles/using-socket-io-with-node-js-on-heroku\n. Linode was gracious enough to let me use a instance to host a demo installation I went ahead and updated the readme to reflect this.\n. If you switch channels and then come back to the original channel does the problem persist?\n. Working on this in the refactored version of the client see #292 for progress\n. This is difficult, because I for one prefer to see the server in that spot. This seems like it would be something to add in the settings area(if they ever get implemented).\n. It looks like to accomplish need to do the following:\n- Add some parameters to the `config.js` file specifying the server and channel to connect to\n- You would then need to somehow trigger the `connect` event and then after you have connected the `join` event\n\nI have played around with this but have not found an easy way to implement it.\n. I spent the day thinking about this and I probably closed it prematurely. I will reopen this in case someone else wants to take a whack at it.\n. For those still interested you can now set a list of default servers/channels in the server settings file that the client will connect to on startup\n. Would it go to reason that if a person set a list of default server/channels they wouldn't want to allow additional server/channels?\n. Right now you have to refresh the page to connect to a new IRC server.\n. It is definitely something I would be interested in seeing implemented. I would gladly look over any patch.\n. Looks good to me! Thanks!\n. Probably could implement arrows to scroll up and down - the implementation of this needs to happen in `ChannelListView`\n. The solution to this is probably using the bootstraps up/down carets and having a backbone view control behavior.\n. so this has been done in the refactored version please see the `refactor` branch\n. @ngokevin poke poke\n. Looks like this might have gone stale. I'll look at re-opening it if it gets updated.\n. Thanks\n. Thanks!\n. This should resolve #154\n. Looks great thanks for including the link.\n. Thanks!\n. Never mind about the leaving it up, I wasn't aware of the nodejitsu pricing plan. The subway app there now is not mine, I don't know how put it up, I have been thinking I need to have an example app somewhere. I hosted it for a while on my own VPS but was receiving more traffic than I liked.\n. I went ahead and added you as a major contributor.\n. Thanks!\n. This was done here https://github.com/thedjpetersen/subway/pull/157\n. Looks good to me thanks.\n. In the refactored version I am just using the font-awesome circle. It seems to work pretty well.\n. It might be valuable to look at the `subway` charm as well.\n. Can you find a reproduce case?\n. @cwc thanks I'll dig into it this weekend\n. Is there any client side error during this?\n. I'll go ahead and investigate this.\n. Relevant error:\n\n```\n TypeError: Cannot read property 'chans' of undefined\nat Socket.module.exports.socket.on.socket.on.name (../subway/lib/socket.js:107:28)\n```\n. Fixed with the latest commit.\n. I have a different approach in mind for this.\n. You can specify a remote mongo source here: https://github.com/thedjpetersen/subway/blob/master/config.js#L10 I am not sure how you would pass the password though - it might take some monkeying in the source.\n. I am not quite sure what this issue is asking for. Do you want to specify the port for your instance of subway?\n. I am not sure how I would implement this do you want to take a crack at it?\n. Double clicking is a good idea but I think I will go about this a message icon instead.\n. There should probably be a plugin folder that contains plugins and then a variable in the config where you specify which plugins you want to enable.\n. Updated the node-irc dep, as well the bootstrap/backbone ones.\n. @hermansc Unfortunately this bug has mutated a bit in the new branch - want to take a look at it?\n. @Fauntleroy did you have any luck tracking this down? If you can provide any additional info I can go ahead and take a look at it as well.\n. Thanks! Looking forward to seeing your IRC client. I would love to hear more about it. Feel free to ping me on freenode if you want to talk about it, I idle under the nick `petersed`\n. Are you running ubuntu @tvamsisai ?\n. You did this? \n\n```\nsudo apt-get install libssl-dev\n```\n. If people are still using this, I can also update the package dependencies. But I would highly encourage all of you to take a look at shout, which is actively maintained.. Thanks!\n. I am sorry I am little confused. What do you mean using subway \"only for localhost\"?\n. Right you beat me to the punch - I'll go ahead and review again.\n. Thanks Kevin.\n. Thanks!\n. Thanks!\n. I'll take another pass on this.\n. Pulled this down and am re-architecting it a bit.\n. So I feel bad for leaving this open for so long. After taking a long look at it I don't think this is the approach that most people have requested. The idea would be for a server to connect to as soon as the client is opened and then drop the person in a room. So I am closing this for now.\n. Thanks for reporting!\n. Can you please keep your pull requests seperate. The default server code is correctly in a seperate pull request and should not be here. \n. I am running into this same problem - I will change the package.json to reference connect-assets github repo\n. Thanks!\n. Thanks!\n. Thanks!\n. This is an issue with node-irc https://github.com/thedjpetersen/subway/issues/190\n. Mentions should match anywhere.\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. Should be fixed. Feel like a bit of a broken record referencing the `refactor` branch.\n. The overlay/confirm dialog is gone in the `refactor` version of the app.\n. Would changing the color of the font work as well?\n. Thanks @eirikb !\n. Right now both the frontend and backend are tightly coupled so this functionality is not available.\n. Thanks for the pull request! I don't necessarily like the way this changes the UI though. If you have other ideas for the way this could be implemented feel free to re-open.\n. Full topic displayed in the `reactor` branch\n. This issue is a dupe \nhttps://github.com/thedjpetersen/subway/issues/179\n. Sorry for the confusion. This ended up being decided in a separate issue( see here: #70 ). I am afraid there isn't any clear migration path.\n. Thanks!\n. Would be useful to have a setting to turn this on/off as well\n. Server messages, specifically MOTD, should be rendering cleanly in the `refactor` branch\n. Subway is in the process of being refactored - this should be fixed in the refactor branch. If you test it and the issue still persists could you reopen?\n. I agree - its probably something to come back and revisit a later date\n. Looks so cool :smile: \n. Thanks!\n. Thanks - probably overly aggressively merged the last solution.\n. As soon as conflicts are resolved I'll merge this\n. I went ahead and committed this - let me know if you are still running into trouble\n. Could you pull the latest and test again?\n. Dupe of #252 \n. Subway is in the process of being refactored - this should be fixed in the refactor branch. If you test it and the issue still persists could you reopen?\n. Thanks!\n. Published\n. Subway is in the process of being refactored - this should be fixed in the `refactor` branch. If you test it and the issue still persists could you reopen?\n. Implemented in the `refactor` branch.\n. @badosu could you take a quick look at this since you added the `client_port` attribute?\n. Thanks for the input @badosu , guess it all LGTM!\n. In the future I believe this should just be a plugin\n. See #292 \n. Do any of you have a repro case? I would like to try to solve this one? Is there someplace I can just go copy and paste colored text?\n. I am going to go ahead and close this one out. As mentioned above let's have this be implemented as a plugin.\n. @BYK is your only issue with react a stylistic thing?\n. Ok I have put the work on the refactor branch - very little works, just a heads up\n. @46bit I am taking that approach from the beginning with the rewrite\n. @hermansc as soon as the newer version reaches feature parity - I would like it to replace the master branch. If the refactor stagnates - nothing will change.\n. @46bit sure I'll hop on for a bit\n. Quick update: \n\nThe rewrite is coming swimmingly so far. Handling and emitting raw IRC commands has been much easier than working with the node-irc wrapper commands. As you can see from the checkbox list above I am working slowly trying to get parity with weechat commands. I need to ensure that I am handling every received event on the frontend as well. If anyone wants to help with this be sure to ping me and I would love to give more info on this. After the client can is fully functional, I'll work on adding persistence and then polishing up the UI.\n. Took some time off of writing support of commands to polish up the settings. Next up is porting the legacy persistence/auth setup. I would love to hear feedback about the settings work I did as well. \n. So the work for backend persistence is well underway. I have sketched out something basic right now and committed it. I will have to revisit it. At the moment everytime there is a state change in the client I am just persisting it with a sync call on the client. I will need to implement something that keeps track of a logged in client through a server method.\n. After discussing with @hermansc in the IRC channel - its clear the most optimal way to keep track of the state of client on the server is to modify the client code so it can be used by the server. This includes the backbone models and the irc handling code.\n. Fixed some minor bugs with the persistence going to add logging of messages next - also need to move that massive checklist of commands above somewhere else\n. Basic logging implemented - need to make it so when history is loaded it doesn't greedily continue to load history. This should be accomplished by maintaining the scrollbar position. \n\nIf I could get some feedback on this work from anyone I would really appreciate it as well.\n. Getting really close to a RC - could really use some people to help me test the client out and identify bugs.\n. Badosu - I haven't documented it yet but it works more or less like this:\n\nInfo about creating a plugin:\n- Plugins are Github gists(the easiest way to create them is to fork an existing one)\n- To add a plugin to subway you need to add it here(https://github.com/thedjpetersen/subway-plugins/blob/master/plugins.json)\n\n---\n\nPlugin syntax\n- Plugins are defined to the `app.plugins` namespace\n- The plugin method accepts the message - and returns the parsed message(as an html object) and a listener(which can be attached to the element)\n. ah ok - still new to the npm dependencies thing\n. what is the format?\n. This is really neat. A quick note: I have worked on refactoring the client trying to make it more robust and easier to maintain the frontend code(using bower and grunt). If you would consider porting this work over to the `refactor` branch I would love to get it in here. Sorry that the work for this branch was lost.\n. Thanks\n. I can totally get behind this - cool!\n. Thanks!\n. I dropped bootstrap and am just writing lightweight css for most of the client.\n. Making it mobile compatible needs to be a priority, but probably needs to be captured as a separate issue. \n. Closing - server messages should be rendering cleanly in the `refactor` branch\n. Is this when you have an active session(i.e logged into the server?)\n. Thanks!\n. This is resolved now\n. haven't created a way to do this yet no\n. Also there is a on-going rewrite tracked in #292 this is something that I could target to add in that.\n. Right now I am leaning towards leaving this info in the config instead of env variables\n. Going forward we'll be working off the `refactor` branch. I am kind of on the fence as far as whether or I want to disable the login/register buttons - but if there was more support for this feature I would roll it in.\n. neato\n. Looks like I wiped them out when I replaced it with the refactored version - I'll go ahead and manually re-add these. Sorry about that\n. Having a little trouble understanding the issue on this one - if you could provide a little more context I might be able to help more.\n. what is the error you are getting?\n. Could this be implemented as a plugin? I assume you want these handlers to act on URIs in messages. Example of a plugin: https://gist.github.com/thedjpetersen/9140203\n. Ah ok I think I understand a little better now. This is something I would consider as a pull request more than an issue - handling the query string parameters could be a little tricky.\n\nClosing for now.\n. This is fixed in the `refactor` branch which will be the source of future development. Thanks for the pull request - sorry the work wasn't included.\n. Neat project - but right now outside the scope of subway. I would probably reconsider if this was brought back as a pull request.\n. hermansc - try to catch me on irc where we can flesh this out a little bit more and then maybe circle back to comment here\n\nnote this is the idea of the settings/server.js settings/client.js files\n. Since we all seem to be in agreement about this - we'll close this issue. If there is a specific thing you want added - that can be opened as a seperate issue.\n. Looks like this is related to somehow having a bad session cookie - the fix should just be testing whether or not the user is defined.\n. Fixed with last push\n. Any other Linux users able to repro this? It seems to work fine for me on Mac.\n. I think the problem he is having @totokaka is that it doesn't go away even when there is no where to scroll.\n. I was able to fix the jumping up bug - it happens when you are embedding image/youtube. That is unrelated.\n. Should be fixed now\n. This is another tough one to repro. This happened I believe when two users were simultaneously connected to the same room? \n. Note: This is when two logged in users are connected - it happens to one of the logged in users\n. Can you provide any more context I am having a little trouble repro-ing?\n. Should now be resolved \n. You can do this right now in the settings - you can select what types of messages you want to see\n. It should be saving your settings everytime you make a change something.\n\nSee here: https://github.com/thedjpetersen/subway/blob/refactor/src/components/settings/general.jsx#L33\n. This is implemented for different highlights. See here: https://github.com/thedjpetersen/subway/blob/refactor/src/js/boilerplate.js#L124\n. ah I understand - there isn't currently a way to do this. Do you think this justifies a notification? \n. This is the line that is failing: https://github.com/thedjpetersen/subway/blob/refactor/src/components/settings/general.jsx#L33\n. I would love to dig into this more, but this error message/description is just to brief to reproduce more. Was this happening after you disconnected and refreshed? I'll go ahead and close this - feel free to reopen if you have more info.\n. Most likely related to a bug with kicking users - leaving this open a bit to see if it crops up again for me\n. Hi Wilfried!\n\nUntil the client is really finished there is a target date for distributing Subway other than with github and eventually npm.\n. So locally I am able to join a channel named '#' using the tip of master\n. Could you retest please?\n. Dupe of #152 \n. Is there any documentation on this standard?\n. the package.json standard - I am just wondering why you need the 'js' extension\n. ah ok I found it https://www.npmjs.org/doc/files/package.json.html\n. A bit out of the scope of this project\n. A little tough to read the diff - what is this changing besides removing jQuery?\n. OK great! Just one little stylistic thing and this should be good to merge. Thanks!\n. Thanks!\n. What is the error you are getting? Did you install the dependencies?\n. Great! So it looks like you started the chat client correctly. To connect to freenode you type the following into the connect form:\n\n  irc.freenode.net\n  Abc_123\n\nThen push \"connect\" - after you have connected to join the node.js channel you just type in \"/join #node.js\"\n\nHope that works for you!\n. Interesting - this feature is not in subway yet please refer to issue #152 \n. @Elmit2015 just a heads up this just landed in the tip of master - you can now set default channel/nick for users\n. no your config is correct this looks like it is definitely a bug\n. @abruzzihraig I am having quite a bit of trouble reproducing usually this is related to earlier activity could you paste a longer log of the irc activity before this broke?\n. If you create a user and then are logged in with the user it will log messages. Otherwise it doesn't. \n. Just a quick note - user persistence though is not working very well atm check some of the more recent issues. It may not be a bad idea to check out 'shout'.\n. @hrj probably not going to write a guide. Too busy working on the stability of the client. If you wanted to open a pull request with a doc in the support folder I would give it a good look.\n. Did you say this was after a connection reset? It looks like you somehow stayed on a channel after you were disconnected\n. I'm down with this\n. ",
    "akavlie": "Tried it, min-width doesn't seem to work here.\nMethinks fluid layout everywhere is problematic.\n. I like it as well. A shorter scroll time will help a bit, but won't really solve the underlying problem for motd -- we're getting a flood of individual events for every line, rather than a single scroll event for the whole thing. May be able to solve this with some logic.\n. Looking at campfire screenshots... yeah, that's not bad as an inspiration (without directly copying). It's sensible, but not necessarily attractive.\n. Those two dribble shots are pretty good; I like quite a few aspects of those (but not everything). Moreso the Skype chat example than the other.\n. btw, I have a decent solution for the JS resizing on window resize in web-irc.\n. I think the chat contents should resize fluidly, but most other elements would be better off with fixed sizing.\n. Yes and no... the sidebar needs a minimum width to show the logo, as well as channel names and unread counts.\n. I just tested it out, and it starts cutting off when the window is about 645px wide. Granted, that's narrower than users would typically be sizing their browser windows (other than on mobile).\n. If you don't have any objections, I think I'll try a version of the layout without percentage sizing, and port my window resizing code from web-irc.\n. any thoughts?\n. Changed top bars & input to be fixed height with absolute positioning. I think the fluid sizing can cause issues at very small horizontal sizes as well, but that's a relatively minor issue, and not likely to occur with normal usage.\n. ACTION input is supported in node-irc, but not events (for output). There's an outstanding pull request to add support:\nhttps://github.com/martynsmith/node-irc/pull/58\n\nI'll bug Martyn about it if he doesn't get around to it soon.\n. Asked Martyn about this one via email.\n. I only see support for sending a /me message (the easy case). Did you do anything with incoming messages? That's a bit trickier.\n\nMay code it in if the code isn't merged into node-irc soon, but looking for events from node-irc would make for simpler and more consistent code.\n. Why pull requests? Are you working off of a fork somewhere?\n. Ah, OK. Didn't realize you could do pull requests from/to one and the same repository.\nI'll look it over.\n. as in, \"incorrect server address\".\n\nWill ask Martyn if a new release is coming.\n. I don't think so; the failure is up in node.js somewhere because an error\nevent isn't defined. I'm not sure it's possible to do a try/catch block\nwithin our code to deal with that.\n\nThe fix is already in node-irc; we can wait for the new version on npm or\npoint our packages to github if there isn't a new version soon.\n\nOn Thu, Jan 12, 2012 at 11:28 PM, David Petersen <\nreply@reply.github.com\n\n> wrote:\n> \n> Could we put this in a try catch block?\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/thedjpetersen/subway/issues/16#issuecomment-3476118\n\n## \n\nfreelance web development\naaron.kavlie.net\n. Taken care of since resetting the dependency to github master branch for node-irc.\n. Done -- moved into ChatView\n. Added support for /part command. Don't yet have a graphic.\nIf I add that, it will be a lame placeholder until @thedjpetersen does it right  ;-)\n. Think the chat window model/view also need to be removed.\n. You're going to design a new logo?? Saying that that will come before X buttons on tabs or something? I'm confused...\n\nFor active channel after parting, I'm setting it to the previous one in the list, unless that's status. Some variation of \"nearest tab\" seems more sensible than last tab -- most tab UIs will do nearest to left or right.\n. Added in x buttons.\n. That's trivial with the :hover pesudo-class\nhttp://reference.sitepoint.com/css/pseudoclass-hover\n\nI'll leave this to you, if you want to take a stab at it... I want to investigate Backbone 0.9 issues. LMK if you have questions.\n. Done -- see my pull request.\n. are you seeing a lot of CPU consumption from that feature?\n. Pull request submitted.\n. Added count in title. Needs two things:\n- Get rid of `(0)` when no unread messages\n- Count all unread private messages, even if it's not a mention\n\nThese are both done.\n. One more thing: even for the active tab, messages should not be counted as read if the window is out of focus.\nThere ought to be a way to detect window focus with JS... I hope.\n. Sounds are now in.\n\nTwo more features remain:\n- Don't mark read when window is not in focus\n- Try desktop notifications\n. One issue: sound fires for a new private chat, even if I start it. This shouldn't happen.\n_Update_: fixed.\n\nFor marking read when in focus, there's a new browser API for that sort of thing -- it's in Chrome, and just added to Firefox with FF10.\n. Just did a little exeriment with `document.mozHidden`. Turns out this doesn't work as expected -- it continues to return false if you focus on other windows and such. It only returns true if you change browser tabs.\n. Messages are now considered unread if window is not in focus.\n\nI'll consider this implemented no. Desktop notifications are still only in Chrome; may revisit those again if at least Firefox also gets support. Besides, those are more tricky -- they would be annoying if overdone.\n. Pull request submitted.\n. We've got the dependency switched, and the backend is supporting this. Have a console.log statement dumping the error object when a connection failure happens (errno ENOTFOUND). The remaining task is translating that, and any other error states, into a good error message for the end user.\n\nA Twitter Bootstrap alert would be nice here.\n. @thedjpetersen Did you want to try some custom alert style here? Or shall I just put in a twitter bootstrap alert message?\n. @thedjpetersen Is this resolved with commit d84f?\n. Works for me now, maybe was just broken in the middle of my refactoring... _shrug_\n. In addition to / rather than autocomplete on typing, a dropdown/select menu would be nice.\n. The userlist regressions are odd. Do you think the work that I did last night caused that?\n. Done. Also upgraded underscore to 1.3.1 (a necessary prereq for Backbone 0.9.0).\n. Seems that references to `this.$()` elements are broken in Backbone 0.9.0 for some reason.\nReverted to 0.5.3 in master, and created a separate branch for testing 0.9.0.\n. After using setElement() and wrapping chat template, it works.\n\nThe former method of assigning this.el to the chat template happened to work, but it's evident that Backbone wasn't designed with that in mind -- it should be a single element, whereas the former chat template had two root elements.\n. Closest possible match to what? Would the user specify a nick for their friend when they get the link?\n. Yeah, that part I got. But the \"closest possible match for that username\" part is a little odd. I'd think that when the user follows the link, we would need a prompt asking for desired username (assuming it's a first-time user).\n. What clients support `/wc` and `/close`?\n. Just pushed a commit to add `/privmsg` & `/query`.\n. Added /wc & /close.\n. fixed!\n. Agreed, other similar apps (where closing the window means losing connection to a real-time service) have a warning like this.\n\nOtoh, with persistent connection, closing the window might not be so destructive. Hmm....\n. That's exactly the domain I want  :-)\n\n.io domains aren't cheap though\n. I'm gonna go ahead and close this, because it doesn't address issues with the software itself.\n. @niftylettuce I think it's worth experimenting with how to scale the app down to mobile sizing via media queries and such. @thedjpetersen will probably have our hands full with other tasks for the time being, but I'd really like to see it happen. Feel free to play with that.\n\nI think the design lends itself to downscaling pretty well by simply cutting out the two sidebars and making the central column occupy the whole screen on mobile. The hard part, then, is how to make those other two columns accessible. Popovers or slide-in panels would probably be best for those.\n. @niftylettuce, can you elaborate a bit on where we need support for HTML5 tags?\n\nI'm familiar with H5BP, and I like it a lot as a reference. I'm just not sure what Subway is missing that extra html tags would solve.\n. Just took a peek at this... it looks nice, but I think it looks too much like a button. I tried to click it.\n. done!\n. Having lots of trouble with this.\nFirst problem: they're still on node 0.4 (0.4.9 to be exact). So had to use an older version of connect-assets.\n\nAfter taking care of that, I get this:\n\n`Error: failed to locate view \"index.jade\"\n    at Function.compile (/node_modules/express/lib/view.js:61:15)\n    at ServerResponse._render (/node_modules/express/lib/view.js:417:18)\n    at ServerResponse.render (/node_modules/express/lib/view.js:318:17)\n    at /app/lib/webserver.js:23:7\n    at callbacks (/node_modules/express/lib/router/index.js:272:11)\n    at param (/node_modules/express/lib/router/index.js:246:11)\n    at pass (/node_modules/express/lib/router/index.js:253:5)\n    at Router._dispatch (/node_modules/express/lib/router/index.js:280:4)\n    at Object.handle (/node_modules/express/lib/router/index.js:45:10)\n    at next (/node_modules/express/node_modules/connect/lib/http.js:203:15)`\n\nHow does the app pick up the `views` dir anyway, @thedjpetersen ? It's not defined as a static directory in `webserver.js`.\n. Deploy done... but with issues. Might not be solvable on our end, we shall see.\n. @proksoup Thanks for the suggestion.\n\nI'm sure others are doing it, because it's mentioned right in the node.js docs:\nhttp://nodejs.org/docs/latest/api/process.html#event_uncaughtException_\n\nSo I guess that one line of code would prevent crashes... though other libraries might be useful for good logging of those exceptions when they do occur.\n. Just added in the code to catch uncaught exceptions.\nShould hopefully prevent the obscure bugs we've been seeing from bringing down the application.\n. Looked into this extensively, and can reproduce on Nodester but not locally. Now have a bug on the Nodester repo to see if anyone there can figure it out: https://github.com/nodester/nodester/issues/304\n\nThe error is handled just fine when running locally.\n. Can you provide an issue description for this? The title is a little ambiguous.\nThanks.\n. Is the intention to connect to a different IRC network?\n\nI think an explicit disconnect button might be better, as disconnecting is a destructive action; the \"logo navigates to the home page\" paradigm doesn't feel right in a single-page app like this IMO.\n. Thanks!\n. beberlei,\n\nI've looked into CouchDB a bit recently, but never worked with it. What would be the advantage (for the user) to a separate individual database? And where would the average user set one up? If it requires hosting your own Couch instance on your own server, the audience for that would be pretty small.\n\nAlso, consider that the unified DB model does bring with it one big advantage: you can see channel history even when you're not present in the channel.\n. Ah, cool.\nI kinda like the idea, but I'm not sure there's a significant benefit to most users. At least when you consider the time investment vs. other issues.\n\nThe biggest upside I see is that it alleviates resource/disk capacity stress on a single server. But otoh, it also makes the shared channel logging impossible.\n. I'm gonna go ahead and pin down the packages.json to the version I have running locally. On NodeUp one of the devs said he spent hours tracking down a bug that was due to a dependency version difference. That doesn't sound like my idea of fun.\n. done\n. I think it's an issue related to IMEs (Input Method Editors) for languages like Chinese & Japanese. I've used them before.\nI'll test this one out.\n. In an IME, keyboard input initially enters a middle state, where characters are auto-converted to kanji, etc. based on the IME's best guess at the words you intend. You make modifications, then typically press enter to confirm that string. After that, enter can be used as usual for the text field.\n. thanks!\n. Derek,\n\nI'm on Chrome 17, though on a Mac. May be a platform-specific bug, or maybe it's cropping up in specific circumstances.\nAre you able to test a bit under Firefox, and try some different scenarios, so we can narrow down what's causing this?\n. Yes, the idea is that even if the tab is focused, it should be treated as if it's inactive as soon as the user blurs the window (to use another app etc.) so that new message notifications would be seen/heard.\n. And the reason for the timer is that blur is fired even if the user clicks on browser chrome (like the location bar), and I wanted to avoid it firing on quick switches to things like that. It might make sense to extend it a bit.\n. I remember now... it's working as intended.\n\nThe intended behavior was that we would notify the user of unread PMs + unread mentions. I figured that titlebar notifications for all unread messages would be a little too intrusive... I view that (and the sounds we have) similar to new mail notifications -- they signify messages aimed at you.\n\nWhat sort of behavior would be ideal to you?\n. OK cool, we'll stick with what we've got for now then.  :-)\n. @bitemyapp What browser/version/OS are you on?\n. Well that rules out browser differences as the cause then. Same OS/browser here.\n. This could be related:\nhttps://github.com/thedjpetersen/subway/blob/master/assets/js/collections.js#L37\n\n@bitemyapp does it seem to trigger by certain actions (focus on another app, add/remove channels, new private message, etc.), or does it seem to happen randomly mid-conversation?\n. Should surface this error in the UI. I'll look into it.\n. Thanks for working on this. Just tried it out locally, it seems to work just fine. No clues about the SSL status in the app or logs though... it would help if we added something.\n\nOne issue I have, that should be rectified before we merge this into master: the UI has a blank input for the port, implying that the field requires input... there's no hint that it will supply the correct port if you leave it blank. I'd like to see that change so the port is pre-filled (and switches automatically when you check/uncheck SSL).\n\nAnother request: I think the port input and SSL checkbox should be combined onto the same line in the UI, as the port field doesn't need that much space. Should be easy with `.form-inline`: http://twitter.github.com/bootstrap/base-css.html#forms\n. Pushed a minimal solution to this. All it does it throw an alert box.\n\nMuch more could be done to improve the UI and handling of a disconnect, so I'll leave this open.\n. Some ideas for more elegant notification of a disconnect:\n- Show red Bootstrap alert within/above chat window (should remain in place even if user switches chat windows)\n- Fade out chat text\n- Attempt/offer to auto-reconnect; if user declines, return to connect dialog.\n. Tried it, min-width doesn't seem to work here.\nMethinks fluid layout everywhere is problematic.\n. I like it as well. A shorter scroll time will help a bit, but won't really solve the underlying problem for motd -- we're getting a flood of individual events for every line, rather than a single scroll event for the whole thing. May be able to solve this with some logic.\n. Looking at campfire screenshots... yeah, that's not bad as an inspiration (without directly copying). It's sensible, but not necessarily attractive.\n. Those two dribble shots are pretty good; I like quite a few aspects of those (but not everything). Moreso the Skype chat example than the other.\n. btw, I have a decent solution for the JS resizing on window resize in web-irc.\n. I think the chat contents should resize fluidly, but most other elements would be better off with fixed sizing.\n. Yes and no... the sidebar needs a minimum width to show the logo, as well as channel names and unread counts.\n. I just tested it out, and it starts cutting off when the window is about 645px wide. Granted, that's narrower than users would typically be sizing their browser windows (other than on mobile).\n. If you don't have any objections, I think I'll try a version of the layout without percentage sizing, and port my window resizing code from web-irc.\n. any thoughts?\n. Changed top bars & input to be fixed height with absolute positioning. I think the fluid sizing can cause issues at very small horizontal sizes as well, but that's a relatively minor issue, and not likely to occur with normal usage.\n. ACTION input is supported in node-irc, but not events (for output). There's an outstanding pull request to add support:\nhttps://github.com/martynsmith/node-irc/pull/58\n\nI'll bug Martyn about it if he doesn't get around to it soon.\n. Asked Martyn about this one via email.\n. I only see support for sending a /me message (the easy case). Did you do anything with incoming messages? That's a bit trickier.\n\nMay code it in if the code isn't merged into node-irc soon, but looking for events from node-irc would make for simpler and more consistent code.\n. Why pull requests? Are you working off of a fork somewhere?\n. Ah, OK. Didn't realize you could do pull requests from/to one and the same repository.\nI'll look it over.\n. as in, \"incorrect server address\".\n\nWill ask Martyn if a new release is coming.\n. I don't think so; the failure is up in node.js somewhere because an error\nevent isn't defined. I'm not sure it's possible to do a try/catch block\nwithin our code to deal with that.\n\nThe fix is already in node-irc; we can wait for the new version on npm or\npoint our packages to github if there isn't a new version soon.\n\nOn Thu, Jan 12, 2012 at 11:28 PM, David Petersen <\nreply@reply.github.com\n\n> wrote:\n> \n> Could we put this in a try catch block?\n> \n> ---\n> \n> Reply to this email directly or view it on GitHub:\n> https://github.com/thedjpetersen/subway/issues/16#issuecomment-3476118\n\n## \n\nfreelance web development\naaron.kavlie.net\n. Taken care of since resetting the dependency to github master branch for node-irc.\n. Done -- moved into ChatView\n. Added support for /part command. Don't yet have a graphic.\nIf I add that, it will be a lame placeholder until @thedjpetersen does it right  ;-)\n. Think the chat window model/view also need to be removed.\n. You're going to design a new logo?? Saying that that will come before X buttons on tabs or something? I'm confused...\n\nFor active channel after parting, I'm setting it to the previous one in the list, unless that's status. Some variation of \"nearest tab\" seems more sensible than last tab -- most tab UIs will do nearest to left or right.\n. Added in x buttons.\n. That's trivial with the :hover pesudo-class\nhttp://reference.sitepoint.com/css/pseudoclass-hover\n\nI'll leave this to you, if you want to take a stab at it... I want to investigate Backbone 0.9 issues. LMK if you have questions.\n. Done -- see my pull request.\n. are you seeing a lot of CPU consumption from that feature?\n. Pull request submitted.\n. Added count in title. Needs two things:\n- Get rid of `(0)` when no unread messages\n- Count all unread private messages, even if it's not a mention\n\nThese are both done.\n. One more thing: even for the active tab, messages should not be counted as read if the window is out of focus.\nThere ought to be a way to detect window focus with JS... I hope.\n. Sounds are now in.\n\nTwo more features remain:\n- Don't mark read when window is not in focus\n- Try desktop notifications\n. One issue: sound fires for a new private chat, even if I start it. This shouldn't happen.\n_Update_: fixed.\n\nFor marking read when in focus, there's a new browser API for that sort of thing -- it's in Chrome, and just added to Firefox with FF10.\n. Just did a little exeriment with `document.mozHidden`. Turns out this doesn't work as expected -- it continues to return false if you focus on other windows and such. It only returns true if you change browser tabs.\n. Messages are now considered unread if window is not in focus.\n\nI'll consider this implemented no. Desktop notifications are still only in Chrome; may revisit those again if at least Firefox also gets support. Besides, those are more tricky -- they would be annoying if overdone.\n. Pull request submitted.\n. We've got the dependency switched, and the backend is supporting this. Have a console.log statement dumping the error object when a connection failure happens (errno ENOTFOUND). The remaining task is translating that, and any other error states, into a good error message for the end user.\n\nA Twitter Bootstrap alert would be nice here.\n. @thedjpetersen Did you want to try some custom alert style here? Or shall I just put in a twitter bootstrap alert message?\n. @thedjpetersen Is this resolved with commit d84f?\n. Works for me now, maybe was just broken in the middle of my refactoring... _shrug_\n. In addition to / rather than autocomplete on typing, a dropdown/select menu would be nice.\n. The userlist regressions are odd. Do you think the work that I did last night caused that?\n. Done. Also upgraded underscore to 1.3.1 (a necessary prereq for Backbone 0.9.0).\n. Seems that references to `this.$()` elements are broken in Backbone 0.9.0 for some reason.\nReverted to 0.5.3 in master, and created a separate branch for testing 0.9.0.\n. After using setElement() and wrapping chat template, it works.\n\nThe former method of assigning this.el to the chat template happened to work, but it's evident that Backbone wasn't designed with that in mind -- it should be a single element, whereas the former chat template had two root elements.\n. Closest possible match to what? Would the user specify a nick for their friend when they get the link?\n. Yeah, that part I got. But the \"closest possible match for that username\" part is a little odd. I'd think that when the user follows the link, we would need a prompt asking for desired username (assuming it's a first-time user).\n. What clients support `/wc` and `/close`?\n. Just pushed a commit to add `/privmsg` & `/query`.\n. Added /wc & /close.\n. fixed!\n. Agreed, other similar apps (where closing the window means losing connection to a real-time service) have a warning like this.\n\nOtoh, with persistent connection, closing the window might not be so destructive. Hmm....\n. That's exactly the domain I want  :-)\n\n.io domains aren't cheap though\n. I'm gonna go ahead and close this, because it doesn't address issues with the software itself.\n. @niftylettuce I think it's worth experimenting with how to scale the app down to mobile sizing via media queries and such. @thedjpetersen will probably have our hands full with other tasks for the time being, but I'd really like to see it happen. Feel free to play with that.\n\nI think the design lends itself to downscaling pretty well by simply cutting out the two sidebars and making the central column occupy the whole screen on mobile. The hard part, then, is how to make those other two columns accessible. Popovers or slide-in panels would probably be best for those.\n. @niftylettuce, can you elaborate a bit on where we need support for HTML5 tags?\n\nI'm familiar with H5BP, and I like it a lot as a reference. I'm just not sure what Subway is missing that extra html tags would solve.\n. Just took a peek at this... it looks nice, but I think it looks too much like a button. I tried to click it.\n. done!\n. Having lots of trouble with this.\nFirst problem: they're still on node 0.4 (0.4.9 to be exact). So had to use an older version of connect-assets.\n\nAfter taking care of that, I get this:\n\n`Error: failed to locate view \"index.jade\"\n    at Function.compile (/node_modules/express/lib/view.js:61:15)\n    at ServerResponse._render (/node_modules/express/lib/view.js:417:18)\n    at ServerResponse.render (/node_modules/express/lib/view.js:318:17)\n    at /app/lib/webserver.js:23:7\n    at callbacks (/node_modules/express/lib/router/index.js:272:11)\n    at param (/node_modules/express/lib/router/index.js:246:11)\n    at pass (/node_modules/express/lib/router/index.js:253:5)\n    at Router._dispatch (/node_modules/express/lib/router/index.js:280:4)\n    at Object.handle (/node_modules/express/lib/router/index.js:45:10)\n    at next (/node_modules/express/node_modules/connect/lib/http.js:203:15)`\n\nHow does the app pick up the `views` dir anyway, @thedjpetersen ? It's not defined as a static directory in `webserver.js`.\n. Deploy done... but with issues. Might not be solvable on our end, we shall see.\n. @proksoup Thanks for the suggestion.\n\nI'm sure others are doing it, because it's mentioned right in the node.js docs:\nhttp://nodejs.org/docs/latest/api/process.html#event_uncaughtException_\n\nSo I guess that one line of code would prevent crashes... though other libraries might be useful for good logging of those exceptions when they do occur.\n. Just added in the code to catch uncaught exceptions.\nShould hopefully prevent the obscure bugs we've been seeing from bringing down the application.\n. Looked into this extensively, and can reproduce on Nodester but not locally. Now have a bug on the Nodester repo to see if anyone there can figure it out: https://github.com/nodester/nodester/issues/304\n\nThe error is handled just fine when running locally.\n. Can you provide an issue description for this? The title is a little ambiguous.\nThanks.\n. Is the intention to connect to a different IRC network?\n\nI think an explicit disconnect button might be better, as disconnecting is a destructive action; the \"logo navigates to the home page\" paradigm doesn't feel right in a single-page app like this IMO.\n. Thanks!\n. beberlei,\n\nI've looked into CouchDB a bit recently, but never worked with it. What would be the advantage (for the user) to a separate individual database? And where would the average user set one up? If it requires hosting your own Couch instance on your own server, the audience for that would be pretty small.\n\nAlso, consider that the unified DB model does bring with it one big advantage: you can see channel history even when you're not present in the channel.\n. Ah, cool.\nI kinda like the idea, but I'm not sure there's a significant benefit to most users. At least when you consider the time investment vs. other issues.\n\nThe biggest upside I see is that it alleviates resource/disk capacity stress on a single server. But otoh, it also makes the shared channel logging impossible.\n. I'm gonna go ahead and pin down the packages.json to the version I have running locally. On NodeUp one of the devs said he spent hours tracking down a bug that was due to a dependency version difference. That doesn't sound like my idea of fun.\n. done\n. I think it's an issue related to IMEs (Input Method Editors) for languages like Chinese & Japanese. I've used them before.\nI'll test this one out.\n. In an IME, keyboard input initially enters a middle state, where characters are auto-converted to kanji, etc. based on the IME's best guess at the words you intend. You make modifications, then typically press enter to confirm that string. After that, enter can be used as usual for the text field.\n. thanks!\n. Derek,\n\nI'm on Chrome 17, though on a Mac. May be a platform-specific bug, or maybe it's cropping up in specific circumstances.\nAre you able to test a bit under Firefox, and try some different scenarios, so we can narrow down what's causing this?\n. Yes, the idea is that even if the tab is focused, it should be treated as if it's inactive as soon as the user blurs the window (to use another app etc.) so that new message notifications would be seen/heard.\n. And the reason for the timer is that blur is fired even if the user clicks on browser chrome (like the location bar), and I wanted to avoid it firing on quick switches to things like that. It might make sense to extend it a bit.\n. I remember now... it's working as intended.\n\nThe intended behavior was that we would notify the user of unread PMs + unread mentions. I figured that titlebar notifications for all unread messages would be a little too intrusive... I view that (and the sounds we have) similar to new mail notifications -- they signify messages aimed at you.\n\nWhat sort of behavior would be ideal to you?\n. OK cool, we'll stick with what we've got for now then.  :-)\n. @bitemyapp What browser/version/OS are you on?\n. Well that rules out browser differences as the cause then. Same OS/browser here.\n. This could be related:\nhttps://github.com/thedjpetersen/subway/blob/master/assets/js/collections.js#L37\n\n@bitemyapp does it seem to trigger by certain actions (focus on another app, add/remove channels, new private message, etc.), or does it seem to happen randomly mid-conversation?\n. Should surface this error in the UI. I'll look into it.\n. Thanks for working on this. Just tried it out locally, it seems to work just fine. No clues about the SSL status in the app or logs though... it would help if we added something.\n\nOne issue I have, that should be rectified before we merge this into master: the UI has a blank input for the port, implying that the field requires input... there's no hint that it will supply the correct port if you leave it blank. I'd like to see that change so the port is pre-filled (and switches automatically when you check/uncheck SSL).\n\nAnother request: I think the port input and SSL checkbox should be combined onto the same line in the UI, as the port field doesn't need that much space. Should be easy with `.form-inline`: http://twitter.github.com/bootstrap/base-css.html#forms\n. Pushed a minimal solution to this. All it does it throw an alert box.\n\nMuch more could be done to improve the UI and handling of a disconnect, so I'll leave this open.\n. Some ideas for more elegant notification of a disconnect:\n- Show red Bootstrap alert within/above chat window (should remain in place even if user switches chat windows)\n- Fade out chat text\n- Attempt/offer to auto-reconnect; if user declines, return to connect dialog.\n. ",
    "mythmon": "I think that notices should stay in the channel where the originated. For example, many bots send messages as notices (because the irc spec says bots should never respond to notices as a normal message.)\n. I think that notices should stay in the channel where the originated. For example, many bots send messages as notices (because the irc spec says bots should never respond to notices as a normal message.)\n. ",
    "johsoe": "Are there any progress on this?\n\nIt could potentially solve issue #64 and issue #116 in a nicer way.\n. I fixed this issue in my fork. I don't know how to properly embed the code, but here's the links to the commits:\n\nhttps://github.com/johsoe/subway/commit/aa527ecb7683b34baa1959b2f47d453349f3e090\n\nhttps://github.com/johsoe/subway/commit/4a150d946b146d1db575a2f1f4fb644927175f74\n. Are there any progress on this?\n\nIt could potentially solve issue #64 and issue #116 in a nicer way.\n. I fixed this issue in my fork. I don't know how to properly embed the code, but here's the links to the commits:\n\nhttps://github.com/johsoe/subway/commit/aa527ecb7683b34baa1959b2f47d453349f3e090\n\nhttps://github.com/johsoe/subway/commit/4a150d946b146d1db575a2f1f4fb644927175f74\n. ",
    "dinsley": "i'll be working on this on the weekend at some point i think\n. +1 to this functionality. \n\nI would like to add the ability to specify a server and have it hide the server options when hitting it in the browser, so that IRC networks can lock it to their server if they want. Is this branch the direction the configuration is heading, or are there changes that need to be made first? This ticket is blocking ;)\n. Yeah, the only thing that's holding me back is this ticket..  I just need to know if this branch is going to be merged in or what intentions @thedjpetersen has with the pull request. I think external configuration is definitely needed, rather than directly editing the values in the Javascript. Just throwing my two cents in.\n. Was there something that needs to change for this to be merged? The self-signed certificate is an option in the config now. Not quite sure what you're referring to @cwc, as the config would be per-server.\n. My apologies, I mistook what you were referring to.\n\nI don't think there's any downside to just having this option enabled by default and not having a configuration option for it. If the user wants to connect to a IRC server that has a self-signed certificate, they shouldn't have to click a box in order to connect imo.\n\nAccepting expired certificates is a little more iffy.. thoughts/opinions?\n. i'll be working on this on the weekend at some point i think\n. +1 to this functionality. \n\nI would like to add the ability to specify a server and have it hide the server options when hitting it in the browser, so that IRC networks can lock it to their server if they want. Is this branch the direction the configuration is heading, or are there changes that need to be made first? This ticket is blocking ;)\n. Yeah, the only thing that's holding me back is this ticket..  I just need to know if this branch is going to be merged in or what intentions @thedjpetersen has with the pull request. I think external configuration is definitely needed, rather than directly editing the values in the Javascript. Just throwing my two cents in.\n. Was there something that needs to change for this to be merged? The self-signed certificate is an option in the config now. Not quite sure what you're referring to @cwc, as the config would be per-server.\n. My apologies, I mistook what you were referring to.\n\nI don't think there's any downside to just having this option enabled by default and not having a configuration option for it. If the user wants to connect to a IRC server that has a self-signed certificate, they shouldn't have to click a box in order to connect imo.\n\nAccepting expired certificates is a little more iffy.. thoughts/opinions?\n. ",
    "niftylettuce": "sure\n. Changed title from jQuery to simply Mobile -- since we could actually do this much better in a customized bottom up approach using H5BP Mobile Boilerplate and a grid system with media queries.\n. Closing for reasons related to https://github.com/thedjpetersen/subway/issues/58 -- but yes I have many ideas for this down the road :)\n. I'm sorry I'm extremely busy lately, just wanted to let you know this is on my mind but it is unclear when I'll have the chance to go through it all.  Eventually I will get sick of IRCCloud and develop the hell out of this.\n. sure\n. Changed title from jQuery to simply Mobile -- since we could actually do this much better in a customized bottom up approach using H5BP Mobile Boilerplate and a grid system with media queries.\n. Closing for reasons related to https://github.com/thedjpetersen/subway/issues/58 -- but yes I have many ideas for this down the road :)\n. I'm sorry I'm extremely busy lately, just wanted to let you know this is on my mind but it is unclear when I'll have the chance to go through it all.  Eventually I will get sick of IRCCloud and develop the hell out of this.\n. ",
    "robbl": "I'd like to add, that there are no messages coming through from a user that changed its nick until it changes back.\n. I'd like to add, that there are no messages coming through from a user that changed its nick until it changes back.\n. ",
    "tjfontaine": "Also clients whose nick is forcibly changed by the network cease to update\n. The initial error comes from the ircd you're connecting to, you're hitting a class limit of how many connections are allowed.\n\nSubway should probably handle this case better, but you need to inform the irc network that they'll need to allow more simultaneous connections from your ip.\n. I think most of this information should be propagated to the status window, especially if it falls into the category of \"um, I don't know where this goes\"\n. see code attached to #97 does not handle certificates currently, I don't see a reason to work too hard on that until the settings are handled.\n. ok I'll do these fix ups and update the pull\n. Also clients whose nick is forcibly changed by the network cease to update\n. The initial error comes from the ircd you're connecting to, you're hitting a class limit of how many connections are allowed.\n\nSubway should probably handle this case better, but you need to inform the irc network that they'll need to allow more simultaneous connections from your ip.\n. I think most of this information should be propagated to the status window, especially if it falls into the category of \"um, I don't know where this goes\"\n. see code attached to #97 does not handle certificates currently, I don't see a reason to work too hard on that until the settings are handled.\n. ok I'll do these fix ups and update the pull\n. ",
    "ghost": "An easy fix for this might be a\n\n```\nprocess.on 'uncaughtException', log_err\n```\n\nSee: https://github.com/proksoup/Hardboiled/blob/master/app.coffee#L13\n\nIs what I usually do as a good start towards that without requiring additional monitoring/restarting. I've found it to be very stable for all of my random apps I build on heroku/nodejitsu/joyent (e.g. http://kickbackcard.com , http://cards.ly , http://hardboiled.nodejitsu.com , http://hardboiled.heroku.com , http://proksoup.com , http://insanelylucky.com all use it and all just responded for me just now despite some use and crappy code in all of them :) \n\nBut I didn't do a pull request because I'm unsure if it's a \"bad practice\" since I don't see hardly anyone else doing it :)\n. I know _that_, but through my stupidity, I found that, if you do enter an incorrect server, the messages pop up over and over again, even if you've stopped trying to connect.\n. I found this is true on older versions. The latest git pull didn't display this issue for me. Not sure where the fix was but it looks like its been caught.\n. Sorry folks, false alarm. His corp firewall is doing DPI and this seems to be the issue. he just tired from the same machine via his 3g and it worked great. \n. An easy fix for this might be a\n\n```\nprocess.on 'uncaughtException', log_err\n```\n\nSee: https://github.com/proksoup/Hardboiled/blob/master/app.coffee#L13\n\nIs what I usually do as a good start towards that without requiring additional monitoring/restarting. I've found it to be very stable for all of my random apps I build on heroku/nodejitsu/joyent (e.g. http://kickbackcard.com , http://cards.ly , http://hardboiled.nodejitsu.com , http://hardboiled.heroku.com , http://proksoup.com , http://insanelylucky.com all use it and all just responded for me just now despite some use and crappy code in all of them :) \n\nBut I didn't do a pull request because I'm unsure if it's a \"bad practice\" since I don't see hardly anyone else doing it :)\n. I know _that_, but through my stupidity, I found that, if you do enter an incorrect server, the messages pop up over and over again, even if you've stopped trying to connect.\n. I found this is true on older versions. The latest git pull didn't display this issue for me. Not sure where the fix was but it looks like its been caught.\n. Sorry folks, false alarm. His corp firewall is doing DPI and this seems to be the issue. he just tired from the same machine via his 3g and it worked great. \n. ",
    "cwc": "I'm not very familiar with MongoDB, but if it has similar features to SQLite (.db file in the application's data directory, or an in-memory mode), they would probably be ideal for simple use cases.\n. The current version now has a field for a custom port number.\n. Current version supports SSL and custom ports but not client certificates; this still does not seem to be supported by the [Node IRC module](http://node-irc.readthedocs.org/en/latest/API.html).\n. The README lists the dependencies needed prior to installing (Node, NPM, and MongoDB). The output from `npm install` should indicate any problems with module dependencies (as seen in @digitalfiz's comment, where the version of Node is newer than what the express module supports). On a fresh Ubuntu VM, `npm install` completed successfully for me.\n\nPossible changes:\n\nThe README could have a separate Dependencies section, so they're more clear. \nThe package.json could be updated to specify that the Node version should be less than 0.7.0.\n. Maybe we can take advantage of the [scripts field](http://npmjs.org/doc/scripts.html) to copy an editable config.js post-install? That way there's still a centralized place to change these settings, and the extra step becomes optional.\n. @dinsley Off the top of my head, I think that would be simple to add (after these changes, that is).\n. @thedjpetersen Done, though with Git aware of config.js, developers will have to avoid doing `commit -a` to keep from committing their configs.\n. Have noticed this myself. Relevant console output (attempting to change from cwc1 to cwc):\n\n```\n[ 'NICK', 'cwc' ]\n1 Jun 18:15:07 - SEND: NICK,cwc\nEvent error sent\n{ message:\n   { prefix: 'irc.server.com',\n     server: 'irc.server.com',\n     command: 'err_unknowncommand',\n     rawCommand: '421',\n     commandType: 'error',\n     args: [ 'cwc1', 'NICK,cwc', 'Unknown command' ] } }\n   debug - websocket writing 5:::{\"name\":\"error\",\"args\":[{\"message\":{\"prefix\":\"irc.server.com\",\"server\":\"irc.server.com\",\"command\":\"err_unknowncommand\",\"rawCommand\":\"421\",\"commandType\":\"error\",\"args\":[\"cwc1\",\"NICK,cwc\",\"Unknown command\"]}}]}\n1 Jun 18:15:07 - ERROR: { prefix: 'irc.server.com',\n  server: 'irc.server.com',\n  command: 'err_unknowncommand',\n  rawCommand: '421',\n  commandType: 'error',\n  args: [ 'cwc1', 'NICK,cwc', 'Unknown command' ] }\n```\n. The self-signed cert option seems more like a per-server thing to me; I had to add it to connect to our IRC server because it's configured with an SSL cert the admin created & signed himself.\n. I do agree about not liking the extra hoop to jump through. Other IRC clients I've used haven't complained about the cert being self-signed when connecting to our server. I guess the Node IRC library is just being safe by default. I haven't looked at the `irc` module's code in depth, but if passing `selfSigned` as `true` for all connections doesn't cause a complaint against a properly SSL'd server, then Subway is no worse than i.e. Colloquy or irssi.\n\nIt might be nice to warn the user when connecting to a server that uses a self-signed cert, in case they are particularly security conscious. I think that would be the ideal UX for expired certs as well - let the user choose whether to continue connecting.\n. The issue is pretty sporadic (happens once per day at most so far) but I'll try that next time.\n. Okay I finally remembered to test this properly when it happened. :) Yes, switching to another channel fixed it. In fact, I was still able to use the /join command despite the unresponsiveness. Guessing that's because of special handling for / commands.\n. I checked the debug logs and found that the mangled messages are actually written to the websocket that way, so it's definitely a server-side thing.\n. Have not been able to consistently reproduce yet. Also worth noting that it happens in some PMs as well.\n. Just found one! My coworker @DDRBoxman sent me a message that ended with the `:D` emoticon. The message I receive after it's mangled by the server always starts with `:<word>` where `<word>` is the first word of the message they were trying to send.\n. Looking into it a bit myself.\n\nFWIW, the messages are going into the database just fine, but reconnecting on the client side still shows messages in the mangled format once it reaches the client.\n\nEDIT: Actually, I take that back. Working with two separate Subway users talking to each other in chat, a mangled message received by one user goes into the DB linked to that user with the message mangled. The Subway user that sent the message has the original text show up in the DB correctly.\n. Actually I'm 99% sure this is a node-irc bug now. If you check out irc/lib/irc.js around line 463 (`case \"PRIVMSG\":`), the text variable is set to `message.args[1]`. This is what leads to only the first word in a message containing an emoticon being set to that variable.\n\nI'm playing around with a solution involving splicing the rest of the message.args array.\n. Okay, it's actually this logic: https://github.com/martynsmith/node-irc/blob/master/lib/irc.js#L875-882\n\nIt's trying to parse something out, I assume having to do with the IRC protocol. I think it's buggy.\n. Closing since it's not actually a Subway bug.\n. I can reproduce this consistently now:\n1. PM yourself (`/msg mynick asdfasdf`)\n2. Close the PM tab\n3. Wait for the crash\n. :beers:\n. Haven't seen this one in awhile.\n. This seems to have been fixed at some point - just tried to replicate and couldn't.\n. Just tried a couple case-change scenarios, including closing the PM window in between PMs and leaving it open. No doubling :grin:.\n. Sounds like a good preference option. I also leave the window open most of the time, but like having the notification to remind me to glance over and catch up.\n. :+1: the line. Would make it much easier to find where the unread messages begin.\n. I had this problem awhile back. IIRC it was due to a bug in node-irc which has since been fixed.\n. FWIW, I've been connecting to a server that does self-signed SSL for awhile, so it definitely works in at least some cases.\n. For the record, the behavior I'm seeing occurs in normal (not bouncer) mode.\n. I'm not very familiar with MongoDB, but if it has similar features to SQLite (.db file in the application's data directory, or an in-memory mode), they would probably be ideal for simple use cases.\n. The current version now has a field for a custom port number.\n. Current version supports SSL and custom ports but not client certificates; this still does not seem to be supported by the [Node IRC module](http://node-irc.readthedocs.org/en/latest/API.html).\n. The README lists the dependencies needed prior to installing (Node, NPM, and MongoDB). The output from `npm install` should indicate any problems with module dependencies (as seen in @digitalfiz's comment, where the version of Node is newer than what the express module supports). On a fresh Ubuntu VM, `npm install` completed successfully for me.\n\nPossible changes:\n\nThe README could have a separate Dependencies section, so they're more clear. \nThe package.json could be updated to specify that the Node version should be less than 0.7.0.\n. Maybe we can take advantage of the [scripts field](http://npmjs.org/doc/scripts.html) to copy an editable config.js post-install? That way there's still a centralized place to change these settings, and the extra step becomes optional.\n. @dinsley Off the top of my head, I think that would be simple to add (after these changes, that is).\n. @thedjpetersen Done, though with Git aware of config.js, developers will have to avoid doing `commit -a` to keep from committing their configs.\n. Have noticed this myself. Relevant console output (attempting to change from cwc1 to cwc):\n\n```\n[ 'NICK', 'cwc' ]\n1 Jun 18:15:07 - SEND: NICK,cwc\nEvent error sent\n{ message:\n   { prefix: 'irc.server.com',\n     server: 'irc.server.com',\n     command: 'err_unknowncommand',\n     rawCommand: '421',\n     commandType: 'error',\n     args: [ 'cwc1', 'NICK,cwc', 'Unknown command' ] } }\n   debug - websocket writing 5:::{\"name\":\"error\",\"args\":[{\"message\":{\"prefix\":\"irc.server.com\",\"server\":\"irc.server.com\",\"command\":\"err_unknowncommand\",\"rawCommand\":\"421\",\"commandType\":\"error\",\"args\":[\"cwc1\",\"NICK,cwc\",\"Unknown command\"]}}]}\n1 Jun 18:15:07 - ERROR: { prefix: 'irc.server.com',\n  server: 'irc.server.com',\n  command: 'err_unknowncommand',\n  rawCommand: '421',\n  commandType: 'error',\n  args: [ 'cwc1', 'NICK,cwc', 'Unknown command' ] }\n```\n. The self-signed cert option seems more like a per-server thing to me; I had to add it to connect to our IRC server because it's configured with an SSL cert the admin created & signed himself.\n. I do agree about not liking the extra hoop to jump through. Other IRC clients I've used haven't complained about the cert being self-signed when connecting to our server. I guess the Node IRC library is just being safe by default. I haven't looked at the `irc` module's code in depth, but if passing `selfSigned` as `true` for all connections doesn't cause a complaint against a properly SSL'd server, then Subway is no worse than i.e. Colloquy or irssi.\n\nIt might be nice to warn the user when connecting to a server that uses a self-signed cert, in case they are particularly security conscious. I think that would be the ideal UX for expired certs as well - let the user choose whether to continue connecting.\n. The issue is pretty sporadic (happens once per day at most so far) but I'll try that next time.\n. Okay I finally remembered to test this properly when it happened. :) Yes, switching to another channel fixed it. In fact, I was still able to use the /join command despite the unresponsiveness. Guessing that's because of special handling for / commands.\n. I checked the debug logs and found that the mangled messages are actually written to the websocket that way, so it's definitely a server-side thing.\n. Have not been able to consistently reproduce yet. Also worth noting that it happens in some PMs as well.\n. Just found one! My coworker @DDRBoxman sent me a message that ended with the `:D` emoticon. The message I receive after it's mangled by the server always starts with `:<word>` where `<word>` is the first word of the message they were trying to send.\n. Looking into it a bit myself.\n\nFWIW, the messages are going into the database just fine, but reconnecting on the client side still shows messages in the mangled format once it reaches the client.\n\nEDIT: Actually, I take that back. Working with two separate Subway users talking to each other in chat, a mangled message received by one user goes into the DB linked to that user with the message mangled. The Subway user that sent the message has the original text show up in the DB correctly.\n. Actually I'm 99% sure this is a node-irc bug now. If you check out irc/lib/irc.js around line 463 (`case \"PRIVMSG\":`), the text variable is set to `message.args[1]`. This is what leads to only the first word in a message containing an emoticon being set to that variable.\n\nI'm playing around with a solution involving splicing the rest of the message.args array.\n. Okay, it's actually this logic: https://github.com/martynsmith/node-irc/blob/master/lib/irc.js#L875-882\n\nIt's trying to parse something out, I assume having to do with the IRC protocol. I think it's buggy.\n. Closing since it's not actually a Subway bug.\n. I can reproduce this consistently now:\n1. PM yourself (`/msg mynick asdfasdf`)\n2. Close the PM tab\n3. Wait for the crash\n. :beers:\n. Haven't seen this one in awhile.\n. This seems to have been fixed at some point - just tried to replicate and couldn't.\n. Just tried a couple case-change scenarios, including closing the PM window in between PMs and leaving it open. No doubling :grin:.\n. Sounds like a good preference option. I also leave the window open most of the time, but like having the notification to remind me to glance over and catch up.\n. :+1: the line. Would make it much easier to find where the unread messages begin.\n. I had this problem awhile back. IIRC it was due to a bug in node-irc which has since been fixed.\n. FWIW, I've been connecting to a server that does self-signed SSL for awhile, so it definitely works in at least some cases.\n. For the record, the behavior I'm seeing occurs in normal (not bouncer) mode.\n. ",
    "jperras": "+1 to this. SQLite would make this infinitely more portable.\n\nOn Fri, Nov 16, 2012 at 12:11 PM, David Petersen\nnotifications@github.comwrote:\n\n> I am considering migrating the datastore to sqlite. I am hoping to get\n> peoples feedback. Advantages/Disadvantages?\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/70#issuecomment-10454153.\n\n## \n\nI do know everything, just not all at once. It's a virtual memory problem.\nYou should follow me on Twitter: http://twitter.com/jperras\n. +1 to this. SQLite would make this infinitely more portable.\n\nOn Fri, Nov 16, 2012 at 12:11 PM, David Petersen\nnotifications@github.comwrote:\n\n> I am considering migrating the datastore to sqlite. I am hoping to get\n> peoples feedback. Advantages/Disadvantages?\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/70#issuecomment-10454153.\n\n## \n\nI do know everything, just not all at once. It's a virtual memory problem.\nYou should follow me on Twitter: http://twitter.com/jperras\n. ",
    "mgrabowski84": ":+1: SQLite sound much better then MongoDB in this project\n. :+1: SQLite sound much better then MongoDB in this project\n. ",
    "ebraminio": "I want to use subway on my Raspberry Pi but its dependency to mongodb and not so-easy way (and safe way) to compile mongodb for Raspberry Pi didn't allow me to use subway.  It's not available on Raspberry Pi repository and compiling mongodb will take few hours http://elsmorian.com/post/24395639198/building-mongodb-on-raspberry-pi that I want to prevent to do that.\n\nI think this could be a good use-case. Mongodb is not portable as Node.js.\n. Also I want to propose using [leveldb](https://code.google.com/p/leveldb/) instead of SQLite. Chromium itself completely ported on Raspberry Pi and I think Leveldb that as a sub-project of chromium is also ported to ARM or everywhere node.js is present. Also here is an interesting [benchmark](http://leveldb.googlecode.com/svn/trunk/doc/benchmark.html) about it. \n. I want to use subway on my Raspberry Pi but its dependency to mongodb and not so-easy way (and safe way) to compile mongodb for Raspberry Pi didn't allow me to use subway.  It's not available on Raspberry Pi repository and compiling mongodb will take few hours http://elsmorian.com/post/24395639198/building-mongodb-on-raspberry-pi that I want to prevent to do that.\n\nI think this could be a good use-case. Mongodb is not portable as Node.js.\n. Also I want to propose using [leveldb](https://code.google.com/p/leveldb/) instead of SQLite. Chromium itself completely ported on Raspberry Pi and I think Leveldb that as a sub-project of chromium is also ported to ARM or everywhere node.js is present. Also here is an interesting [benchmark](http://leveldb.googlecode.com/svn/trunk/doc/benchmark.html) about it. \n. ",
    "eirikb": "Or even [nStore](https://github.com/creationix/nstore).\n. I use this hack: https://github.com/eirikb/subway/commit/c26eee551cb960b26bc73a136a677406493a43c8  \nNot pretty, actually very ugly, but works.\n. This is a completely different feature, but:  \nHaving an unread-notification-line indicating last read message could give the same visual aid, but in a more subtle way). Something like this:\n![subway-indication-line](https://f.cloud.github.com/assets/241706/117501/fa6b4f68-6c41-11e2-8214-378623f734ae.PNG)\nI'm not sure if this is already a feature, but at least I can't see it in my version. If it is not perhaps merging this issue and creating a new issue for such a feature is an idea?\n. https://github.com/thedjpetersen/subway/issues/207\n. The example image was done with a simple `.message-box { border-top: 1px solid darkred;}`.\n. Or even [nStore](https://github.com/creationix/nstore).\n. I use this hack: https://github.com/eirikb/subway/commit/c26eee551cb960b26bc73a136a677406493a43c8  \nNot pretty, actually very ugly, but works.\n. This is a completely different feature, but:  \nHaving an unread-notification-line indicating last read message could give the same visual aid, but in a more subtle way). Something like this:\n![subway-indication-line](https://f.cloud.github.com/assets/241706/117501/fa6b4f68-6c41-11e2-8214-378623f734ae.PNG)\nI'm not sure if this is already a feature, but at least I can't see it in my version. If it is not perhaps merging this issue and creating a new issue for such a feature is an idea?\n. https://github.com/thedjpetersen/subway/issues/207\n. The example image was done with a simple `.message-box { border-top: 1px solid darkred;}`.\n. ",
    "aeosynth": ":+1: optional db\n. :+1: optional db\n. ",
    "ericbarch": "Mongodb is replaced with sqlite in the 030_dev branch. Look forward to this soon.\n. This is now in master.\n. This is fixed now, we should be good to close this.\n. This issues is fixed...definitely need to look into a fix for displaying the entire topic, though.\n. I've seen this happen on very slow internet connections, will continue to investigate.\n. Not sure if this is still valid as the backend has changed a bit. Please re-open if you see it again.\n. This has been implemented, we should be able to close this.\n. This is all set...we should be able to close this.\n. I just bumped up the versions in the package file...that may fix it.\n. Just tried a deploy to nodejitsu myself. Looks like it's getting hung up on bcrypt. Maybe something with the version of Python they're using? Continuing to look into it...\n. Reported this on the node bcrypt repo. jwerre gave us an answer: \"Apparently this is an issue on Nodejitu due to their recent switch from Rackpace (linux) servers to Joynet's SmartOS. They're working on the issue.\"\n. Added the python environment to the package file to solve this.\n. Been testing this all under node 0.8.x, FYI. Everything appears to be working properly.\n. The syntax to join a channel is:\n\n/join #channelname\n\nTo message another user you can use:\n\n/msg username\n\nThis could be in reference to issue #123 to make it clearer to users unfamiliar with IRC syntax.\n. Good to go.\n. This is probably more in line with issue #108 - but this would be a nice feature.\n. Starting to work on this in the 030_dev branch. Just saw your config option recommendations...fairly similar to what I've got in there now.\n. Closing this because the bulk of implementation lies in other modules. We can revisit this.\n. Could this be a case related issue? What if the user who sends you a PM changes their nick case?\n. Yup...thank you for implementing this!\n. Fixed in the 030_dev branch.\n. Looks like that option is set to false by default according to the bottom of this page: https://github.com/LearnBoost/socket.io/wiki/Configuring-Socket.IO\n. Thanks for the update, cwc. Closing for now. Please re-open if issues persist with the latest node-irc.\n. You'll need something that can proxy websocket connections in addition to http. Nginx now has this in the development version or haproxy is also an excellent choice.\n. Removed the link for the time being. I'll see if I can put another together here for the new 0.3.0 version I've been working on.\n. Removed them for the time being.\n. Thanks for the info!\n. Looks good...thanks!\n. Just about to merge in my 0.3.0 dev branch to master which uses sqlite now, so the db state is no longer relevant. Included your scroll fixes though. Make sure to pull in from master as quite a bit on the backend changed :)\n. Just swapped out node-orm2 (which seemed to be quite finicky) for jugglingdb. Could you give it one more shot with the latest from master?\n. Good stuff! There was a bit of a debate but I think this will suit most for now.\n. Sorry for the delay...this looks good!\n. Good catch =)\n. No, thank you =)\n. Mongodb is replaced with sqlite in the 030_dev branch. Look forward to this soon.\n. This is now in master.\n. This is fixed now, we should be good to close this.\n. This issues is fixed...definitely need to look into a fix for displaying the entire topic, though.\n. I've seen this happen on very slow internet connections, will continue to investigate.\n. Not sure if this is still valid as the backend has changed a bit. Please re-open if you see it again.\n. This has been implemented, we should be able to close this.\n. This is all set...we should be able to close this.\n. I just bumped up the versions in the package file...that may fix it.\n. Just tried a deploy to nodejitsu myself. Looks like it's getting hung up on bcrypt. Maybe something with the version of Python they're using? Continuing to look into it...\n. Reported this on the node bcrypt repo. jwerre gave us an answer: \"Apparently this is an issue on Nodejitu due to their recent switch from Rackpace (linux) servers to Joynet's SmartOS. They're working on the issue.\"\n. Added the python environment to the package file to solve this.\n. Been testing this all under node 0.8.x, FYI. Everything appears to be working properly.\n. The syntax to join a channel is:\n\n/join #channelname\n\nTo message another user you can use:\n\n/msg username\n\nThis could be in reference to issue #123 to make it clearer to users unfamiliar with IRC syntax.\n. Good to go.\n. This is probably more in line with issue #108 - but this would be a nice feature.\n. Starting to work on this in the 030_dev branch. Just saw your config option recommendations...fairly similar to what I've got in there now.\n. Closing this because the bulk of implementation lies in other modules. We can revisit this.\n. Could this be a case related issue? What if the user who sends you a PM changes their nick case?\n. Yup...thank you for implementing this!\n. Fixed in the 030_dev branch.\n. Looks like that option is set to false by default according to the bottom of this page: https://github.com/LearnBoost/socket.io/wiki/Configuring-Socket.IO\n. Thanks for the update, cwc. Closing for now. Please re-open if issues persist with the latest node-irc.\n. You'll need something that can proxy websocket connections in addition to http. Nginx now has this in the development version or haproxy is also an excellent choice.\n. Removed the link for the time being. I'll see if I can put another together here for the new 0.3.0 version I've been working on.\n. Removed them for the time being.\n. Thanks for the info!\n. Looks good...thanks!\n. Just about to merge in my 0.3.0 dev branch to master which uses sqlite now, so the db state is no longer relevant. Included your scroll fixes though. Make sure to pull in from master as quite a bit on the backend changed :)\n. Just swapped out node-orm2 (which seemed to be quite finicky) for jugglingdb. Could you give it one more shot with the latest from master?\n. Good stuff! There was a bit of a debate but I think this will suit most for now.\n. Sorry for the delay...this looks good!\n. Good catch =)\n. No, thank you =)\n. ",
    "ngokevin": "The logo on the left sidebar could be a link to navigate back to the dashboard. I found myself trying to click it to go back.\n. Okay good point\n. i'm working on something like this now.\n. The logo on the left sidebar could be a link to navigate back to the dashboard. I found myself trying to click it to go back.\n. Okay good point\n. i'm working on something like this now.\n. ",
    "puffnfresh": "Also experienced this.\n. Also experienced this.\n. ",
    "mcpherrinm": "It's socket.io behavior.  http://groups.google.com/group/socket_io/browse_thread/thread/5315a2978f31868e/ffda8fd107c1b35b?lnk=raot&pli=1\n\nI have a fork that applies the suggested fix from that thread, but doesn't entirely solve the issue.\n. Honestly, this was a year ago and I've forgotten.\n. It's socket.io behavior.  http://groups.google.com/group/socket_io/browse_thread/thread/5315a2978f31868e/ffda8fd107c1b35b?lnk=raot&pli=1\n\nI have a fork that applies the suggested fix from that thread, but doesn't entirely solve the issue.\n. Honestly, this was a year ago and I've forgotten.\n. ",
    "mcfiredrill": "@mcpherrinm Why did it not entirely solve the issue?\n. The fix from that thread solved the issue for me.\n. Hmm, however the docs say this is 'false' by default? \nhttps://github.com/LearnBoost/socket.io/wiki/Configuring-Socket.IO\n. Anyone else still having this issue? Not sure why the issue was closed if so...\n. :thumbsup:\n. I'm trying to set up an installation on heroku and mongohq here:\nhttp://subway-demo.herokuapp.com/\nI have the source code here:\nhttps://github.com/mcfiredrill/subway-demo\n\nIt seems to flash the menu for a second, then go straight to the status screen. Perhaps there are problems connecting to the database? Any ideas? I've tested using subway with my mongohq database locally, and it worked fine.\n. Not seeing anything in the logs, and I'm not really familiar with setting up node.js apps on heroku. \n. Ah it appears I wasn't specifying the right NODE_ENV. Still getting the same problem though.\n. @SpenserJ Well, I just learned that apparently websockets don't work on heroku at all. https://devcenter.heroku.com/articles/using-socket-io-with-node-js-on-heroku\n\nCurrently trying to get it to use the long-polling.... \n. Tried that, still seems to be trying to use the websocket on heroku. Locally, I can tell its using the long polling.\nhttps://github.com/mcfiredrill/subway-demo/commit/10422e391b77808b0ea34e7ea0b543bec4885f2d#L0R39\n. Thanks to fauntle on irc I was able to get this working! It was trying to add a port number to the url, causing the initial request to socket.io to fail. I specified no port in io.connect and its working now.\nhttps://github.com/mcfiredrill/subway-demo/commit/9d8fd4586a387f9465830eb764f9a4a4361a7871\n. :+1: :+1: :+1: :+1: :+1: :+1: \n. I experienced this issue as well. Switching channels fixed it. I noticed this error in the console:\n`Uncaught TypeError: Cannot call method 'get' of undefined.           chat.js:82\nUncaught TypeError: Cannot call method 'get' of undefined.           chat.js:45`\n. Upgraded my version of node from v0.4.something to the latest, works now, sorry about that.\n. @mcpherrinm Why did it not entirely solve the issue?\n. The fix from that thread solved the issue for me.\n. Hmm, however the docs say this is 'false' by default? \nhttps://github.com/LearnBoost/socket.io/wiki/Configuring-Socket.IO\n. Anyone else still having this issue? Not sure why the issue was closed if so...\n. :thumbsup:\n. I'm trying to set up an installation on heroku and mongohq here:\nhttp://subway-demo.herokuapp.com/\nI have the source code here:\nhttps://github.com/mcfiredrill/subway-demo\n\nIt seems to flash the menu for a second, then go straight to the status screen. Perhaps there are problems connecting to the database? Any ideas? I've tested using subway with my mongohq database locally, and it worked fine.\n. Not seeing anything in the logs, and I'm not really familiar with setting up node.js apps on heroku. \n. Ah it appears I wasn't specifying the right NODE_ENV. Still getting the same problem though.\n. @SpenserJ Well, I just learned that apparently websockets don't work on heroku at all. https://devcenter.heroku.com/articles/using-socket-io-with-node-js-on-heroku\n\nCurrently trying to get it to use the long-polling.... \n. Tried that, still seems to be trying to use the websocket on heroku. Locally, I can tell its using the long polling.\nhttps://github.com/mcfiredrill/subway-demo/commit/10422e391b77808b0ea34e7ea0b543bec4885f2d#L0R39\n. Thanks to fauntle on irc I was able to get this working! It was trying to add a port number to the url, causing the initial request to socket.io to fail. I specified no port in io.connect and its working now.\nhttps://github.com/mcfiredrill/subway-demo/commit/9d8fd4586a387f9465830eb764f9a4a4361a7871\n. :+1: :+1: :+1: :+1: :+1: :+1: \n. I experienced this issue as well. Switching channels fixed it. I noticed this error in the console:\n`Uncaught TypeError: Cannot call method 'get' of undefined.           chat.js:82\nUncaught TypeError: Cannot call method 'get' of undefined.           chat.js:45`\n. Upgraded my version of node from v0.4.something to the latest, works now, sorry about that.\n. ",
    "beberlei": "You can signup with a free couchdb platform such as http://www.iriscouch.com/\n. You can signup with a free couchdb platform such as http://www.iriscouch.com/\n. ",
    "pksunkara": "You might be using a particular version locally and developing subway based on that and there might be a latest version in npm which can break that.\n. You might be using a particular version locally and developing subway based on that and there might be a latest version in npm which can break that.\n. ",
    "derek-smith": "Cool. I did end up finding your code that implements it.\n\nJust to follow up... it doesn't change the title for me on Chrome 17.0.963.56 in Ubuntu 11.10\n\nThat's why I originally didn't know about it... \n. Yeah, I'll look into it, maybe tonight.\n\nI didn't totally understand the way you were checking for an inactive tab.\nLooked like you have a timer go off every second on window.blur until the tab is active again (I think).\n. OK, so I tested it with PMs/mentions and it does work.\n\nI thought it would work for any message (not joins/parts) as well :)\n\nNo biggie though... the behavior you've implemented is good.\n. Cool. I did end up finding your code that implements it.\n\nJust to follow up... it doesn't change the title for me on Chrome 17.0.963.56 in Ubuntu 11.10\n\nThat's why I originally didn't know about it... \n. Yeah, I'll look into it, maybe tonight.\n\nI didn't totally understand the way you were checking for an inactive tab.\nLooked like you have a timer go off every second on window.blur until the tab is active again (I think).\n. OK, so I tested it with PMs/mentions and it does work.\n\nI thought it would work for any message (not joins/parts) as well :)\n\nNo biggie though... the behavior you've implemented is good.\n. ",
    "bitemyapp": "It has happened after inactivity, but I know of at least one instance where I was in a steady conversation in a /query, with little/no pauses and I saw in my terminal that the JSON was getting PRIVMSG'd to the channel above (to my mild embarrassment).\n\nSo inactivity may be one cause, as that had happened before, but not necessarily.\n\nI will attempt a repro and start dumping data once I have it occurring. Is there any data in particular in the front-end client you would like me to snag?\n. Mac OS X, Chrome 17.\n. Pretty sure if you join multiple channels, and use it for a few days in a row, you'll see it crop up.\n. There might've been a pause between two messages, but I doubt the mid-conversation misdirection was due to any changes in UI focus.\n. Found a potential cause, appeared to occur when the network and/or my computer was slowing down.\n\nThis is lame as hell, but I can't actually determine which of those symptoms caused it at the time, but it definitely seemed related when it occurred.\n\nI would recommend simulating packet loss/connection loss, and if that doesn't reproduce it, try loading the machine down. \n. It has happened after inactivity, but I know of at least one instance where I was in a steady conversation in a /query, with little/no pauses and I saw in my terminal that the JSON was getting PRIVMSG'd to the channel above (to my mild embarrassment).\n\nSo inactivity may be one cause, as that had happened before, but not necessarily.\n\nI will attempt a repro and start dumping data once I have it occurring. Is there any data in particular in the front-end client you would like me to snag?\n. Mac OS X, Chrome 17.\n. Pretty sure if you join multiple channels, and use it for a few days in a row, you'll see it crop up.\n. There might've been a pause between two messages, but I doubt the mid-conversation misdirection was due to any changes in UI focus.\n. Found a potential cause, appeared to occur when the network and/or my computer was slowing down.\n\nThis is lame as hell, but I can't actually determine which of those symptoms caused it at the time, but it definitely seemed related when it occurred.\n\nI would recommend simulating packet loss/connection loss, and if that doesn't reproduce it, try loading the machine down. \n. ",
    "hermansc": "Heh, this seemed pretty random. I have not experienced it lately. Anyone care to look into this, or should we just close it?\n. Kind of related to #302 . Some feedback should be given to the user.\n\n@akavlie did you ever look into this?\n. +1, and just pointing out that the collection of sent messages should be stored \"globally\" per user, and not per channel. So that one can easily distribute sent messages to several channels. \n. Fixed in #299 , if it gets merged into master.\n. This is fixed when #296 is merged into master, I guess. \n. I've been looking on the following implementation of a sidebar:\nhttp://startbootstrap.com/templates/simple-sidebar.html\n\nWorks pretty good actually, the problem however is that I'm not able to create fixed elements inside the content area, at least not with my average CSS-skills. In fact we probably want two sidebars, one on each side: left one for channels and right ones for userlist. Then a responsive stylesheet that just hides/show them at given widths with a toggle-button as the site provided above has.\n\nIf anyone want to take a look at my code for upgrading to bootstrap 3 and in the same time enabling scrollable sidebar/content-view, please see my branch which is very much half-working and not done:\nhttps://github.com/hermansc/subway/commit/1b975a88af8223c7316552e0fab4f08230eafd50\n\nTry comparing the layout in my commit, with the current layout, by re-sizing the window etc. Hopefully, with the \"new\" layout, which uses the principle of the sidebar-example given above, should be more deterministic and fluid.\n\nCheers. \n. Hm, perhaps just use the unicode symbol _BLACK CIRCLE (25CF)_ which looks like ● and then finding a good font-size and set the `text-color` property on the span surrounding the circle?\n\nThat is: `<span style=\"text-color:orange;font-size:14px\" title=\"Inactive\">●</span>`\n. We probably just want to use Glyphicons included in the Bootstrap. E.g. `icon-comment` or even better `icon-envelope`. See:  http://getbootstrap.com/2.3.2/base-css.html#icons\n. Hm. Anyone here with plugin experience using Javascript? I feel we perhaps just create a separate issue where we discuss architectural designs in regards to them?\n\nDid you ever manage to extract the youtube/image parsing into a separate file/plugin based setup, @thedjpetersen ? :-)\n. So current situation is, as you say, the auto-completion works fine first time and second time, but then does not \"loop\" back to the first name again.\n\nExpected behavior should be: `al -> (tab) -> alice -> (tab) -> alice2 -> (tab) -> alice -> (tab) -> alice2 -> ...`\nHowever currently we have: `al -> (tab) -> alice -> (tab) -> alice2 -> (tab) -> alice2 -> (tab) -> alice2 -> ...`\n\nDefinitely a bug which should be fixed.\n. I'm not experiencing this problem in the current code. That is 2b151f162cd.\n. Should be easy to do, adding a `title=\"{{topic}}\"` or something on the topic-div. Marking it an easy fix, perhaps someone feels the urge to help?\n. Somewhat related to #270, that is the optimal solution in my mind would be to first sort by role then alphanumerically. Perhaps we should close this and continue the discussion there?\n. How would this work? You mean highlighting all op's in a channel at the same time? Is this a feature found in other clients?\n. +1 , should be up to each user creating their own regexes or whatever in a \"settings-page\" which hopefully comes in the near future.\n. Auto-joining server + channel will be possible after #296 . However, given these presets it will be possible to quit channel / join new channels. \n\nAuto-generated nicknames for guests should perhaps just be a separate issue.\n. I'd like to close this issue. It would definitely be great supporting XMPP (and being the best web-based chat client out there), but personally I'd like to see Subway manage the IRC-protocol flawlessly first. Then at sometime in the future when the project is larger and more mature, look into extending with other protocols.\n\nAny thoughts from others?\n. Is this still an issue? I guess a new version of Ubuntu has been released since the creation of this issue. For the record I successfully installed node and subway's needed packages on **Debian Jessie (testing)** with the following commands:\n\n```\n$ sudo apt-get install nodejs npm\n$ sudo ln -s /usr/bin/nodejs /usr/bin/node\n$ npm install\n```\n\nNode.js is not in wheezy (stable), but you can fetch it from wheezy-backports:\n\n```\n$ sudo echo \"deb http://ftp.debian.org/debian wheezy-backports main contrib non-free\" >> /etc/apt/sources.list\n$ sudo apt-get update\n$ sudo apt-get install -t wheezy-backports nodejs\n$ curl https://www.npmjs.org/install.sh | sudo sh\n$ npm install\n```\n\nI haven't tested the last one though (wheezy install).\n. Agreed. First sort on role, then alphabetically. Currently we sort by last active, which is kind of weird and non-deterministic. Should be \"simple\" enough to fix, backbone.js has some functions for sorting strategies: http://stackoverflow.com/a/9865920.\n\nSo I guess creating a `comparator` function is `assets/js/collections.js` for the `UserList` collection and call `sort()` at some point?\n. @thedjpetersen you want to look into this? If it is just hitting `npm publish` then I guess anyone can upload to _npmjs_, but perhaps it should be the maintainer?\n. Would be simpler to pin-point this bug if some more details were added. Could you add some steps to replicate this bug? Possibly it is related to #265 or private conversations in general, which is a bit buggy atm.\n. As the sidebar does not resize itself at the moment, a mobile experience of Subway is currently pretty bad, imo.\nPerhaps it would be easier to fix using Bootstrap 3.1.1 and a responsive grid (issue #301), but it's definitively not impossible to fix at current stage as well.\n. Hi. Thanks for your bug report. I'm not able to replicate this issue, could you verify that it is still happening and give any more details on how you experienced this? Please see the following screenshot for my experience changing nick:\n\n![nick-change](https://f.cloud.github.com/assets/116978/2191084/5ce81a32-983c-11e3-8c49-db38162f4f2c.png)\n. Agreed and this is actually a duplicate of #270 . Hence I'll close this one and we'll continue our discussion in that issue. In regards of the icons they are a good idea, and should perhaps be added as separate issue?\n. This issue is a duplicate of #244 .\nUntil #292 is done and we have plugin support I propose a setting per user (such as we do with desktop notifications). As to implementation we could just have an array of 10 colors and then use the following snippet from nickcolor.pl:\n\n```\nforeach my $char (@chars) {\n    $counter += ord $char;\n}\n$counter = $colors[$counter % 11];\n```\n\nThat is we accumulate the ascii-values for each char in the different nicks, take `mod 11` (or as many colors that we have) and voilà an even distribution of colors.\n. @totokaka ah, you are right and this is of course not a duplicate. Sorry.\n. So we actually have two issues in this one:\n1. Displaying colors in Subway works fine for foreground-colors but background colors are added as a border, instead of background-color. See irc-colors.css. Replicate by typing `Ctrl-c3,1Hello World` where `Ctrl-c` is the actual control character, in a irc-client such as irssi. Should be green on black background, but rather one obtains green text with dotted black border.\n2. It is not possible to add foreground or background colors, using Subway.\n. How will this affect future commits and pull-requests to the master branch?\n. A great idea and nice implementation! I love the focus on making subway more accessible to non-technical people. \n\nI have a question though with regards to the `presets.password` variable and its meaning? I mean, it is obviously not referring to a channel password - since one can preset multiple channels? And we don't want to preset user-password either, now do we? :-)\n\nAlso, when we are talking about passwords. It is not possible to preset a channel with a password - or it is possible if one writes `channels: [\"#channelname password\", \"#anotherchannel foobar\"]`, but perhaps a solution such as: \n\n```\nchannels: [{ name: \"#channelname\", password: \"password\"}, {name: \"#anotherchannel\", password: \"\"}] \n```\n\nis better?\n. Hey, no problem, nice to see people contributing to this project. As I said, I know it will work writing it `#channel password`, I just thought it would perhaps be more verbose and clearer if one separated them and did the join in the background. But, as you say there is perhaps not much point in it :-)\n. @harishbsrinivas : You could always just do it in the (Sqlite3) database directly, if you have access to it.\n\nLets say you call it `subway.db` in `config.js`, then:\n\n```\n$ sqlite3 subway.db\nsqlite> UPDATE User SET password = 'foobar' WHERE username = 'zomg';\n```\n\nAnd voilà. But as thedjpetersen says, there are no way to do this as of yet in the UI.\n. I'm closing this one, and I'll re-open the original one.\n. I support this. Don't think we necessarily should differentiate between two different users, but rather strive to have a configurable application where you can limit IRC-servers/channels, disable user-profiles/plugins and support external authentication systems, such as Kerberos.\n. Heh, this seemed pretty random. I have not experienced it lately. Anyone care to look into this, or should we just close it?\n. Kind of related to #302 . Some feedback should be given to the user.\n\n@akavlie did you ever look into this?\n. +1, and just pointing out that the collection of sent messages should be stored \"globally\" per user, and not per channel. So that one can easily distribute sent messages to several channels. \n. Fixed in #299 , if it gets merged into master.\n. This is fixed when #296 is merged into master, I guess. \n. I've been looking on the following implementation of a sidebar:\nhttp://startbootstrap.com/templates/simple-sidebar.html\n\nWorks pretty good actually, the problem however is that I'm not able to create fixed elements inside the content area, at least not with my average CSS-skills. In fact we probably want two sidebars, one on each side: left one for channels and right ones for userlist. Then a responsive stylesheet that just hides/show them at given widths with a toggle-button as the site provided above has.\n\nIf anyone want to take a look at my code for upgrading to bootstrap 3 and in the same time enabling scrollable sidebar/content-view, please see my branch which is very much half-working and not done:\nhttps://github.com/hermansc/subway/commit/1b975a88af8223c7316552e0fab4f08230eafd50\n\nTry comparing the layout in my commit, with the current layout, by re-sizing the window etc. Hopefully, with the \"new\" layout, which uses the principle of the sidebar-example given above, should be more deterministic and fluid.\n\nCheers. \n. Hm, perhaps just use the unicode symbol _BLACK CIRCLE (25CF)_ which looks like ● and then finding a good font-size and set the `text-color` property on the span surrounding the circle?\n\nThat is: `<span style=\"text-color:orange;font-size:14px\" title=\"Inactive\">●</span>`\n. We probably just want to use Glyphicons included in the Bootstrap. E.g. `icon-comment` or even better `icon-envelope`. See:  http://getbootstrap.com/2.3.2/base-css.html#icons\n. Hm. Anyone here with plugin experience using Javascript? I feel we perhaps just create a separate issue where we discuss architectural designs in regards to them?\n\nDid you ever manage to extract the youtube/image parsing into a separate file/plugin based setup, @thedjpetersen ? :-)\n. So current situation is, as you say, the auto-completion works fine first time and second time, but then does not \"loop\" back to the first name again.\n\nExpected behavior should be: `al -> (tab) -> alice -> (tab) -> alice2 -> (tab) -> alice -> (tab) -> alice2 -> ...`\nHowever currently we have: `al -> (tab) -> alice -> (tab) -> alice2 -> (tab) -> alice2 -> (tab) -> alice2 -> ...`\n\nDefinitely a bug which should be fixed.\n. I'm not experiencing this problem in the current code. That is 2b151f162cd.\n. Should be easy to do, adding a `title=\"{{topic}}\"` or something on the topic-div. Marking it an easy fix, perhaps someone feels the urge to help?\n. Somewhat related to #270, that is the optimal solution in my mind would be to first sort by role then alphanumerically. Perhaps we should close this and continue the discussion there?\n. How would this work? You mean highlighting all op's in a channel at the same time? Is this a feature found in other clients?\n. +1 , should be up to each user creating their own regexes or whatever in a \"settings-page\" which hopefully comes in the near future.\n. Auto-joining server + channel will be possible after #296 . However, given these presets it will be possible to quit channel / join new channels. \n\nAuto-generated nicknames for guests should perhaps just be a separate issue.\n. I'd like to close this issue. It would definitely be great supporting XMPP (and being the best web-based chat client out there), but personally I'd like to see Subway manage the IRC-protocol flawlessly first. Then at sometime in the future when the project is larger and more mature, look into extending with other protocols.\n\nAny thoughts from others?\n. Is this still an issue? I guess a new version of Ubuntu has been released since the creation of this issue. For the record I successfully installed node and subway's needed packages on **Debian Jessie (testing)** with the following commands:\n\n```\n$ sudo apt-get install nodejs npm\n$ sudo ln -s /usr/bin/nodejs /usr/bin/node\n$ npm install\n```\n\nNode.js is not in wheezy (stable), but you can fetch it from wheezy-backports:\n\n```\n$ sudo echo \"deb http://ftp.debian.org/debian wheezy-backports main contrib non-free\" >> /etc/apt/sources.list\n$ sudo apt-get update\n$ sudo apt-get install -t wheezy-backports nodejs\n$ curl https://www.npmjs.org/install.sh | sudo sh\n$ npm install\n```\n\nI haven't tested the last one though (wheezy install).\n. Agreed. First sort on role, then alphabetically. Currently we sort by last active, which is kind of weird and non-deterministic. Should be \"simple\" enough to fix, backbone.js has some functions for sorting strategies: http://stackoverflow.com/a/9865920.\n\nSo I guess creating a `comparator` function is `assets/js/collections.js` for the `UserList` collection and call `sort()` at some point?\n. @thedjpetersen you want to look into this? If it is just hitting `npm publish` then I guess anyone can upload to _npmjs_, but perhaps it should be the maintainer?\n. Would be simpler to pin-point this bug if some more details were added. Could you add some steps to replicate this bug? Possibly it is related to #265 or private conversations in general, which is a bit buggy atm.\n. As the sidebar does not resize itself at the moment, a mobile experience of Subway is currently pretty bad, imo.\nPerhaps it would be easier to fix using Bootstrap 3.1.1 and a responsive grid (issue #301), but it's definitively not impossible to fix at current stage as well.\n. Hi. Thanks for your bug report. I'm not able to replicate this issue, could you verify that it is still happening and give any more details on how you experienced this? Please see the following screenshot for my experience changing nick:\n\n![nick-change](https://f.cloud.github.com/assets/116978/2191084/5ce81a32-983c-11e3-8c49-db38162f4f2c.png)\n. Agreed and this is actually a duplicate of #270 . Hence I'll close this one and we'll continue our discussion in that issue. In regards of the icons they are a good idea, and should perhaps be added as separate issue?\n. This issue is a duplicate of #244 .\nUntil #292 is done and we have plugin support I propose a setting per user (such as we do with desktop notifications). As to implementation we could just have an array of 10 colors and then use the following snippet from nickcolor.pl:\n\n```\nforeach my $char (@chars) {\n    $counter += ord $char;\n}\n$counter = $colors[$counter % 11];\n```\n\nThat is we accumulate the ascii-values for each char in the different nicks, take `mod 11` (or as many colors that we have) and voilà an even distribution of colors.\n. @totokaka ah, you are right and this is of course not a duplicate. Sorry.\n. So we actually have two issues in this one:\n1. Displaying colors in Subway works fine for foreground-colors but background colors are added as a border, instead of background-color. See irc-colors.css. Replicate by typing `Ctrl-c3,1Hello World` where `Ctrl-c` is the actual control character, in a irc-client such as irssi. Should be green on black background, but rather one obtains green text with dotted black border.\n2. It is not possible to add foreground or background colors, using Subway.\n. How will this affect future commits and pull-requests to the master branch?\n. A great idea and nice implementation! I love the focus on making subway more accessible to non-technical people. \n\nI have a question though with regards to the `presets.password` variable and its meaning? I mean, it is obviously not referring to a channel password - since one can preset multiple channels? And we don't want to preset user-password either, now do we? :-)\n\nAlso, when we are talking about passwords. It is not possible to preset a channel with a password - or it is possible if one writes `channels: [\"#channelname password\", \"#anotherchannel foobar\"]`, but perhaps a solution such as: \n\n```\nchannels: [{ name: \"#channelname\", password: \"password\"}, {name: \"#anotherchannel\", password: \"\"}] \n```\n\nis better?\n. Hey, no problem, nice to see people contributing to this project. As I said, I know it will work writing it `#channel password`, I just thought it would perhaps be more verbose and clearer if one separated them and did the join in the background. But, as you say there is perhaps not much point in it :-)\n. @harishbsrinivas : You could always just do it in the (Sqlite3) database directly, if you have access to it.\n\nLets say you call it `subway.db` in `config.js`, then:\n\n```\n$ sqlite3 subway.db\nsqlite> UPDATE User SET password = 'foobar' WHERE username = 'zomg';\n```\n\nAnd voilà. But as thedjpetersen says, there are no way to do this as of yet in the UI.\n. I'm closing this one, and I'll re-open the original one.\n. I support this. Don't think we necessarily should differentiate between two different users, but rather strive to have a configurable application where you can limit IRC-servers/channels, disable user-profiles/plugins and support external authentication systems, such as Kerberos.\n. ",
    "halfhalo": "I had to hack it almost the same way trying to get it to talk to my bouncer.  I ended up just adding some form fields to the login page for port and password, then passing those through to the irc module.\n\n(course, connecting to my bouncer leads to more issues, like the fact not all the messages make it through on connect to webui, but those can be solved)\n. I had to hack it almost the same way trying to get it to talk to my bouncer.  I ended up just adding some form fields to the login page for port and password, then passing those through to the irc module.\n\n(course, connecting to my bouncer leads to more issues, like the fact not all the messages make it through on connect to webui, but those can be solved)\n. ",
    "jacobwgillespie": "Awesome - I'm closing the issue...\n. Awesome - I'm closing the issue...\n. ",
    "mhemesath": "Cool, thanks for the info!\n. Thanks! I promise soon I'll start doing more pull requests than bug reports :p\n. Cool, thanks for the info!\n. Thanks! I promise soon I'll start doing more pull requests than bug reports :p\n. ",
    "gagarine": "why default to to off?\n. why default to to off?\n. ",
    "yuukari": "That's a good idea. Possibly either in the status tab or in a brand new tab like \"system\"\n. Do you mean the npm modules or other parts? Mine seems to work just fine, but I had to manually find and install most (if not all) of the npm modules.\n. socket.io-client, underscore, snockets, connect-file-cache, express, http, url, prototype, qs, connect, hooks, bcrypt, and mongodb we're the libraries I had to install from npm.\n. @Cat4D What do you mean by \"fails\"?\n. That's a good idea. Possibly either in the status tab or in a brand new tab like \"system\"\n. Do you mean the npm modules or other parts? Mine seems to work just fine, but I had to manually find and install most (if not all) of the npm modules.\n. socket.io-client, underscore, snockets, connect-file-cache, express, http, url, prototype, qs, connect, hooks, bcrypt, and mongodb we're the libraries I had to install from npm.\n. @Cat4D What do you mean by \"fails\"?\n. ",
    "jancborchardt": "Apparently that is in now, but the new problem is that the channel topic is not completely readable. The title box should wrap and expand to the height it needs.\n. If you mean code-wise (apart from the description I gave above), unfortunately not.\n. Check out the playlist adding interface on [Youtify](http://www.youtify.com/) (in the left sidebar). It’s not perfect, but a good start to make adding channels easier.\n. Super nice, solved all my problems (2 shadow accounts left). Big thanks.\n. I got the same problem. Trying to run Subway out of a subdirectory, and it doesn’t work.\n\nThe message looks like it was successful though:\n\n```\n  info  - socket.io started\nSubway started on port 3000\n```\n. Apparently that is in now, but the new problem is that the channel topic is not completely readable. The title box should wrap and expand to the height it needs.\n. If you mean code-wise (apart from the description I gave above), unfortunately not.\n. Check out the playlist adding interface on [Youtify](http://www.youtify.com/) (in the left sidebar). It’s not perfect, but a good start to make adding channels easier.\n. Super nice, solved all my problems (2 shadow accounts left). Big thanks.\n. I got the same problem. Trying to run Subway out of a subdirectory, and it doesn’t work.\n\nThe message looks like it was successful though:\n\n```\n  info  - socket.io started\nSubway started on port 3000\n```\n. ",
    "Cat4D": "Yes, is there a list of these required npm?\n. both ssl and password hashing are available from node, bcrypt is native cpp and should either be an optional or replaced with a js for now... At least not inlined with the system's operation.\n. Yes, is there a list of these required npm?\n. both ssl and password hashing are available from node, bcrypt is native cpp and should either be an optional or replaced with a js for now... At least not inlined with the system's operation.\n. ",
    "digitalfiz": "When I try to do \"npm install\" this is what I get:\n\ndigitalfiz@server1:~/subway/subway$ npm update\nnpm http GET https://registry.npmjs.org/express/2.5.2\nnpm http GET https://registry.npmjs.org/jade/0.19.0\nnpm http GET https://registry.npmjs.org/connect-assets/2.1.6\nnpm http GET https://registry.npmjs.org/mongoose/2.5.7\nnpm http GET https://registry.npmjs.org/bcrypt/0.5.0\nnpm http GET https://registry.npmjs.org/socket.io\nnpm http 304 https://registry.npmjs.org/connect-assets/2.1.6\nnpm http 304 https://registry.npmjs.org/jade/0.19.0\nnpm http 304 https://registry.npmjs.org/express/2.5.2\nnpm http 304 https://registry.npmjs.org/bcrypt/0.5.0\nnpm http 200 https://registry.npmjs.org/mongoose/2.5.7\nnpm http GET https://registry.npmjs.org/mongoose/-/mongoose-2.5.7.tgz\nnpm http 304 https://registry.npmjs.org/socket.io\nnpm http 200 https://registry.npmjs.org/mongoose/-/mongoose-2.5.7.tgz\nnpm http GET https://registry.npmjs.org/irc/0.3.4\nnpm http GET https://registry.npmjs.org/socket.io/0.9.6\nnpm http GET https://registry.npmjs.org/connect-assets/2.1.6\nnpm http GET https://registry.npmjs.org/jade/0.19.0\nnpm http GET https://registry.npmjs.org/express/2.5.2\nnpm http GET https://registry.npmjs.org/bcrypt/0.5.0\nnpm http GET https://registry.npmjs.org/mongoose/2.5.7\nnpm http 304 https://registry.npmjs.org/express/2.5.2\n\nnpm ERR! Unsupported\nnpm ERR! Not compatible with your version of node/npm: express@2.5.2\nnpm ERR! Required: {\"node\":\">= 0.4.1 < 0.7.0\"}\nnpm ERR! Actual:   {\"npm\":\"1.1.18\",\"node\":\"0.7.9-pre\"}\nnpm ERR! \nnpm ERR! System Linux 3.0.0-17-virtual\nnpm ERR! command \"node\" \"/usr/local/bin/npm\" \"update\"\nnpm ERR! cwd /storage/home/digitalfiz/subway/subway\nnpm ERR! node -v v0.7.9-pre\nnpm ERR! npm -v 1.1.18\nnpm ERR! code ENOTSUP\nnpm ERR! message Unsupported\nnpm ERR! errno {}\nnpm ERR! \nnpm ERR! Additional logging details can be found in:\nnpm ERR!     /storage/home/digitalfiz/subway/subway/npm-debug.log\nnpm not ok\n. When I try to do \"npm install\" this is what I get:\n\ndigitalfiz@server1:~/subway/subway$ npm update\nnpm http GET https://registry.npmjs.org/express/2.5.2\nnpm http GET https://registry.npmjs.org/jade/0.19.0\nnpm http GET https://registry.npmjs.org/connect-assets/2.1.6\nnpm http GET https://registry.npmjs.org/mongoose/2.5.7\nnpm http GET https://registry.npmjs.org/bcrypt/0.5.0\nnpm http GET https://registry.npmjs.org/socket.io\nnpm http 304 https://registry.npmjs.org/connect-assets/2.1.6\nnpm http 304 https://registry.npmjs.org/jade/0.19.0\nnpm http 304 https://registry.npmjs.org/express/2.5.2\nnpm http 304 https://registry.npmjs.org/bcrypt/0.5.0\nnpm http 200 https://registry.npmjs.org/mongoose/2.5.7\nnpm http GET https://registry.npmjs.org/mongoose/-/mongoose-2.5.7.tgz\nnpm http 304 https://registry.npmjs.org/socket.io\nnpm http 200 https://registry.npmjs.org/mongoose/-/mongoose-2.5.7.tgz\nnpm http GET https://registry.npmjs.org/irc/0.3.4\nnpm http GET https://registry.npmjs.org/socket.io/0.9.6\nnpm http GET https://registry.npmjs.org/connect-assets/2.1.6\nnpm http GET https://registry.npmjs.org/jade/0.19.0\nnpm http GET https://registry.npmjs.org/express/2.5.2\nnpm http GET https://registry.npmjs.org/bcrypt/0.5.0\nnpm http GET https://registry.npmjs.org/mongoose/2.5.7\nnpm http 304 https://registry.npmjs.org/express/2.5.2\n\nnpm ERR! Unsupported\nnpm ERR! Not compatible with your version of node/npm: express@2.5.2\nnpm ERR! Required: {\"node\":\">= 0.4.1 < 0.7.0\"}\nnpm ERR! Actual:   {\"npm\":\"1.1.18\",\"node\":\"0.7.9-pre\"}\nnpm ERR! \nnpm ERR! System Linux 3.0.0-17-virtual\nnpm ERR! command \"node\" \"/usr/local/bin/npm\" \"update\"\nnpm ERR! cwd /storage/home/digitalfiz/subway/subway\nnpm ERR! node -v v0.7.9-pre\nnpm ERR! npm -v 1.1.18\nnpm ERR! code ENOTSUP\nnpm ERR! message Unsupported\nnpm ERR! errno {}\nnpm ERR! \nnpm ERR! Additional logging details can be found in:\nnpm ERR!     /storage/home/digitalfiz/subway/subway/npm-debug.log\nnpm not ok\n. ",
    "evasconcelos": "i'm installing an old NODE version to fix it.\n\nafter cloning-it you need to :\ngit checkout v0.6.18\nthen make and install everything again\n. i'm installing an old NODE version to fix it.\n\nafter cloning-it you need to :\ngit checkout v0.6.18\nthen make and install everything again\n. ",
    "totokaka": "This should be high priority. IMO this is the biggest missing feature, and is really something subway should have.\n. Please close this issue, as it is resolved.\n. This is still a problem.\n\nAfter looking a bit at the issue, I think we should split the logo and \"Subway\", \"IRC Client\" into it's own element in the sidebar that could have a static position in the upper left corner, and then have the channel list(including network address and username) scrollable. When we have multiple networks per account it would also be nice to have the username and network address stay on the top(scroll the channels 'under' them) until the next network reaches the top.\n. Why is this issue closed? The errors still appears, even though they are false, they should be removed.\n. I'm having the same issue. Running a ZNC bouncer with certificate signed by private CA.\nSymptoms are exactly the same as fculpo reports.\n. I just realized I only tried to access it through nginx. When accessing it directly it worked.\nHow is my nginx config supposed to look to get this to work?\n. Ok, It turns out this was because I hadn't configured nginx to proxy websockets.\nThis is the config I now use:\n\n```\nupstream subway {\n        server localhost:14858;\n}\n\nserver {\n        listen          80;\n        server_name     irc.hidd.en;\n\n        location / {\n                proxy_pass http://subway;\n\n                proxy_http_version 1.1;\n                proxy_set_header Upgrade $http_upgrade;\n                proxy_set_header Connection \"upgrade\";\n\n                proxy_set_header X-Real-IP $remote_addr;\n                proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n                proxy_set_header Host $proxy_host;\n                proxy_set_header X-NginX-Proxy true;\n        }\n\n        location /assets {\n                alias /srv/http/totokaka.io/apps/subway/assets/;\n        }\n}\n```\n\nThis is what got me on the right track: https://github.com/thedjpetersen/subway/issues/134#issuecomment-19489275\n. Indeed a duplicate. I'll create a new issue about redoing the activity icons.\n. I was thinking the colors that are regularly supported by IRC clients. They are in range 00-16, IIRC. And there's italics, underline and bold too, I think. \n. OK, but subway still needs to filter out the color codes so they are not displayed as numbers in the chat.\n. @hermansc sounds good. \n\nJust two notes:\n1. I believe there are 16 colors normally, not sure though.\n2. #244 is about colors on the nicknames so it's easier to follow the conversation. This is about actual color codes in the chat. \n. After looking at what @badosu said again, I realized this is actually implemented. I'll look into why it don't work for me when I get back from vacation.\n. I have (finally) found out what this issue really was:\n\n**Colors aren't displayed in the scrollback**\n. This sounds good. It's nice to see some activity on the project.\n. I would like to thank you for doing this rewrite, @thedjpetersen. I really appreciate it.\n\nI will look into doing some of the commands later this weekend.\n. I take it you figured it out?\n\nIt should be something like git+https IIRC.\n. I suggest we do both.\n\nWhen something is written to the status tab, it should have a unread count like other channels. And when an error is printed it should also be printed in the channel it affects. At least this is the way I, as a user, would expect it to be and how I'd like it to be.\n. Yeah.\n\nMany of the forks have only changed the name and icon. Maybe also add a setting to remove direct connections? And when we get LDAP support, the register button.\n. What does this do with the icons?\n\nI will probably create an issue later today for discussion about a redesign of active/inactive and IRCs away/available statuses.\n. I've had the same problem on the refactored version, but I thought it was a\nfeature.\n9. mai 2014 10:14 skrev \"David Petersen\" notifications@github.com\nfølgende:\n\n> Any other Linux users able to repro this? It seems to work fine for me on\n> Mac.\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/327#issuecomment-42642884\n> .\n. Hmm , it's quite a while since I did this, but I seem to remember the box\nwas there from the start, and didn't go away, even though there was nowhere\nto scroll.\n9. mai 2014 16:31 skrev \"David Petersen\" notifications@github.com\nfølgende:\n\n> I think the problem he is having @totokaka https://github.com/totokakais that it doesn't go away even when there is no where to scroll.\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/327#issuecomment-42672304\n> .\n. This should be high priority. IMO this is the biggest missing feature, and is really something subway should have.\n. Please close this issue, as it is resolved.\n. This is still a problem.\n\nAfter looking a bit at the issue, I think we should split the logo and \"Subway\", \"IRC Client\" into it's own element in the sidebar that could have a static position in the upper left corner, and then have the channel list(including network address and username) scrollable. When we have multiple networks per account it would also be nice to have the username and network address stay on the top(scroll the channels 'under' them) until the next network reaches the top.\n. Why is this issue closed? The errors still appears, even though they are false, they should be removed.\n. I'm having the same issue. Running a ZNC bouncer with certificate signed by private CA.\nSymptoms are exactly the same as fculpo reports.\n. I just realized I only tried to access it through nginx. When accessing it directly it worked.\nHow is my nginx config supposed to look to get this to work?\n. Ok, It turns out this was because I hadn't configured nginx to proxy websockets.\nThis is the config I now use:\n\n```\nupstream subway {\n        server localhost:14858;\n}\n\nserver {\n        listen          80;\n        server_name     irc.hidd.en;\n\n        location / {\n                proxy_pass http://subway;\n\n                proxy_http_version 1.1;\n                proxy_set_header Upgrade $http_upgrade;\n                proxy_set_header Connection \"upgrade\";\n\n                proxy_set_header X-Real-IP $remote_addr;\n                proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n                proxy_set_header Host $proxy_host;\n                proxy_set_header X-NginX-Proxy true;\n        }\n\n        location /assets {\n                alias /srv/http/totokaka.io/apps/subway/assets/;\n        }\n}\n```\n\nThis is what got me on the right track: https://github.com/thedjpetersen/subway/issues/134#issuecomment-19489275\n. Indeed a duplicate. I'll create a new issue about redoing the activity icons.\n. I was thinking the colors that are regularly supported by IRC clients. They are in range 00-16, IIRC. And there's italics, underline and bold too, I think. \n. OK, but subway still needs to filter out the color codes so they are not displayed as numbers in the chat.\n. @hermansc sounds good. \n\nJust two notes:\n1. I believe there are 16 colors normally, not sure though.\n2. #244 is about colors on the nicknames so it's easier to follow the conversation. This is about actual color codes in the chat. \n. After looking at what @badosu said again, I realized this is actually implemented. I'll look into why it don't work for me when I get back from vacation.\n. I have (finally) found out what this issue really was:\n\n**Colors aren't displayed in the scrollback**\n. This sounds good. It's nice to see some activity on the project.\n. I would like to thank you for doing this rewrite, @thedjpetersen. I really appreciate it.\n\nI will look into doing some of the commands later this weekend.\n. I take it you figured it out?\n\nIt should be something like git+https IIRC.\n. I suggest we do both.\n\nWhen something is written to the status tab, it should have a unread count like other channels. And when an error is printed it should also be printed in the channel it affects. At least this is the way I, as a user, would expect it to be and how I'd like it to be.\n. Yeah.\n\nMany of the forks have only changed the name and icon. Maybe also add a setting to remove direct connections? And when we get LDAP support, the register button.\n. What does this do with the icons?\n\nI will probably create an issue later today for discussion about a redesign of active/inactive and IRCs away/available statuses.\n. I've had the same problem on the refactored version, but I thought it was a\nfeature.\n9. mai 2014 10:14 skrev \"David Petersen\" notifications@github.com\nfølgende:\n\n> Any other Linux users able to repro this? It seems to work fine for me on\n> Mac.\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/327#issuecomment-42642884\n> .\n. Hmm , it's quite a while since I did this, but I seem to remember the box\nwas there from the start, and didn't go away, even though there was nowhere\nto scroll.\n9. mai 2014 16:31 skrev \"David Petersen\" notifications@github.com\nfølgende:\n\n> I think the problem he is having @totokaka https://github.com/totokakais that it doesn't go away even when there is no where to scroll.\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/327#issuecomment-42672304\n> .\n. ",
    "albins": "I'm not sure how to debug this, so suggestions are welcome. The node.js ecosystem is all new to me.\n. I'm not sure how to debug this, so suggestions are welcome. The node.js ecosystem is all new to me.\n. ",
    "algernon": "I've just seen this happen while connected to Freenode (and on OFTC too).\n. I suspected this might be erroneous parsing of IRC messages, and as such, might be a bug in node-irc, and not subway itself. Having had a look at the node-irc issues, I found this pull request: https://github.com/martynsmith/node-irc/pull/95\n\nApplying that fixed the emote issue for me.\n. It'd be useful even without #108. I, for one, have no need for that, and actually prefer running multiple tabs for multiple networks (otherwise my channel list would be waaaay too long, for one).\n. I've just seen this happen while connected to Freenode (and on OFTC too).\n. I suspected this might be erroneous parsing of IRC messages, and as such, might be a bug in node-irc, and not subway itself. Having had a look at the node-irc issues, I found this pull request: https://github.com/martynsmith/node-irc/pull/95\n\nApplying that fixed the emote issue for me.\n. It'd be useful even without #108. I, for one, have no need for that, and actually prefer running multiple tabs for multiple networks (otherwise my channel list would be waaaay too long, for one).\n. ",
    "tehsu": "Any ideas when this will be added? thanks\n. Any ideas when this will be added? thanks\n. ",
    "mikesheen": "I'm keen to see this implemented also.  At the moment my ircd config has a limit set to a maximum of 5 connections per ip as a defensive measure - currently I have qwebirc and mibbit happily using the webirc protocol which exempts them from this limit, but still routes the users real ip and hostname to my irc server - making disruptive users possible to manage.\n\nWithout webirc implemented I can't deploy Subway in production.\n\nA nice explanation of the webirc protocol is here : http://wiki.mibbit.com/index.php/WebIRC\n\nThanks\n. It's not just a good idea, it's pretty much essential for web based IRC clients.  Long ago I moved on and found another web IRC client that does use the WEBIRC protocol, but Subway is purty so if this makes it into the codebase - I'll give it another try :)\n. I'm keen to see this implemented also.  At the moment my ircd config has a limit set to a maximum of 5 connections per ip as a defensive measure - currently I have qwebirc and mibbit happily using the webirc protocol which exempts them from this limit, but still routes the users real ip and hostname to my irc server - making disruptive users possible to manage.\n\nWithout webirc implemented I can't deploy Subway in production.\n\nA nice explanation of the webirc protocol is here : http://wiki.mibbit.com/index.php/WebIRC\n\nThanks\n. It's not just a good idea, it's pretty much essential for web based IRC clients.  Long ago I moved on and found another web IRC client that does use the WEBIRC protocol, but Subway is purty so if this makes it into the codebase - I'll give it another try :)\n. ",
    "Thermionix": "+1\n. https://pushover.net/ is also quite popular, would be good if this was done generically so that adding a specific 'notification service's api calls are easy\n. I'm hoping to take a look into multi-network stuff soon and default server stuff would be useful, couple of config options I can think of being useful;\n\n```\ndefault_server: 'localhost:6667',\ndefault_server_ssl: false,\ndefault_server_channel: '#defaultchannel',\ndefault_server_autoconnect: false, // don't force users into network i.e. just list it if false \ndefault_server_sole_network: false // disable users from connecting to other networks\n```\n. this fixed `npm install` for me on ubuntu server 12.04.2;\n\n```\nsudo apt-get install python-software-properties\nsudo add-apt-repository ppa:chris-lea/node.js\nsudo apt-get update\nsudo apt-get install nodejs npm\n```\n. +1\n. https://pushover.net/ is also quite popular, would be good if this was done generically so that adding a specific 'notification service's api calls are easy\n. I'm hoping to take a look into multi-network stuff soon and default server stuff would be useful, couple of config options I can think of being useful;\n\n```\ndefault_server: 'localhost:6667',\ndefault_server_ssl: false,\ndefault_server_channel: '#defaultchannel',\ndefault_server_autoconnect: false, // don't force users into network i.e. just list it if false \ndefault_server_sole_network: false // disable users from connecting to other networks\n```\n. this fixed `npm install` for me on ubuntu server 12.04.2;\n\n```\nsudo apt-get install python-software-properties\nsudo add-apt-repository ppa:chris-lea/node.js\nsudo apt-get update\nsudo apt-get install nodejs npm\n```\n. ",
    "zenware": "Didn't realize what this was at first and I thought it might be something related to URI handlers, but I was wrong. I'm going to create a new issue, but I definitely think this is a good idea though!\n+1\n. I just want to add https://www.pushbullet.com/ to this list even though it's irrelevant because all that needs to be implemented is a callback API. And then everything can use it.\n. Upon actually testing this it seems chrome does now allow you to register more of the aforementioned whitelisted protocols including irc without the web prefix, I'm still unsure of precisely how to include this into the subway application but I'll poke around some more because I've already got most of it implemented separately.\n. I was thinking more along the lines of, the subway application registers a handler with the browser, and then when you click on a \"irc://\" URI at some other location on the internet it would launch within subway. If plugins can run on the main page without a user being signed in then I think that's the right way to go. Thanks for reminding me I had this idea by the way, now I just need to look at my copy of the source and try to fix the mess I've made.\n. Didn't realize what this was at first and I thought it might be something related to URI handlers, but I was wrong. I'm going to create a new issue, but I definitely think this is a good idea though!\n+1\n. I just want to add https://www.pushbullet.com/ to this list even though it's irrelevant because all that needs to be implemented is a callback API. And then everything can use it.\n. Upon actually testing this it seems chrome does now allow you to register more of the aforementioned whitelisted protocols including irc without the web prefix, I'm still unsure of precisely how to include this into the subway application but I'll poke around some more because I've already got most of it implemented separately.\n. I was thinking more along the lines of, the subway application registers a handler with the browser, and then when you click on a \"irc://\" URI at some other location on the internet it would launch within subway. If plugins can run on the main page without a user being signed in then I think that's the right way to go. Thanks for reminding me I had this idea by the way, now I just need to look at my copy of the source and try to fix the mess I've made.\n. ",
    "Polsaker": "@thedjpetersen: It is pretty easy:\nThe client sends _before_ the USER/NICK/PASS a WEBCHAT like with the following syntax:\nWEBIRC [password] [username] [hostname] [ip]\nAnd the IRCd changes the user hostname/ip to the one specified in the webirc line.\n(The password is configured on the ircd side and hostname is the resolved ip of the user)\n. @thedjpetersen: It is pretty easy:\nThe client sends _before_ the USER/NICK/PASS a WEBCHAT like with the following syntax:\nWEBIRC [password] [username] [hostname] [ip]\nAnd the IRCd changes the user hostname/ip to the one specified in the webirc line.\n(The password is configured on the ircd side and hostname is the resolved ip of the user)\n. ",
    "Zodzie": "Any update on this? I can't use this to connect to the good servers due to \"MAXIMUM USERS FROM THIS ADDRESS\" limit\n. Any update on this? I can't use this to connect to the good servers due to \"MAXIMUM USERS FROM THIS ADDRESS\" limit\n. ",
    "badosu": "Awesome @hermansc!\n. I am interested in making the port of the colors plugins if this gets sorted out.\n. Just to add some context on this issue:\n\n@thedjpetersen refactored subway and introduced a plugin functionality that has a prototypical description at https://github.com/thedjpetersen/subway/issues/292#issuecomment-42988189\n. @hoxca @ericbarch Can we close this?\n. Just for reference, this is probably not related to #290.\n\nOnly if users can set color codes on `/nick`.\n. @rayshan \nThere's a live demo at http://subway-chat.herokuapp.com/ but long outdated.\n\nWe would just have to redeploy it.\n. @rayshan \nWould you be able to develop this?\n. @rayshan Take a look at this: https://blog.heroku.com/archives/2014/8/7/heroku-button.\n\nDo you think you can setup something like this for subway?\n. Hmmm.. so this is an issue for a long-lived app.\n\nWe don't want this demo to be an _actual_ irc client for everyone to use, but a simple demo that should work for the user session and show the capabilities of subway.\n\nSo I guess it would be fine, at least for me.\n. I am verifying the stability of this, so please do not merge it yet.\n. @ericbarch Tested this in my subway chat server.\n\nI think it would be ok to set the No Colors option to default false, since most of the time output is not colored, and when it is it is not obstrusively like bgcolor. Besides that, we can adjust it with the `irc-colors.css` file.\n\nI don't know if I changed the models accordingly, or even if it is needed, so if you could check if it is ok I sould be glad.\n\nEverything is okay now, after seeing some bugs I adjusted the Pull Request. I am tuning the `irc-colors.css` now to match our client interface best needs.\n\nWhat do you think?\n. I think it is ok now. Just adjusted the colors to not be intrusive in the chat, so I set the default option to be off.\n. Rebased it against master.\n. Thanks!\n. I think it is ok now!\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. @lukske123 are you running as root?\n\nIs this the output of npm install?\n. @lukske123 Nice!\n\nSo this issue is not related to subway, right?\n\nCan you close it?\n. Thanks!\n. Thanks!\n. Thanks!\n. Hello @LordWingZero, @Myster62 !\n\nHow are you installing? Could you copy and paste the commands here?\n\nWhich platforms do you use?\n\nThanks for the report!\n. Cool! Thanks @LordWingZero!\n. Thanks @nrn!\n. @thedjpetersen @BYK How will the users set a different port for the client?\n\nFor example, will I not be able anymore to run subway on heroku with this patch?\n\nIf not, can we use another approach to solve our issue?\n. Is'nt it possible to support Dokku **and** support people who can't use websockets as well?\n\nI am totally into supporting a new infrasctructure provider, but removing support for another or the fallback for websockets, as a consequence, does not seem a good idea.\n\nAlso, this would revert #226 too.\n. So it is ok for me. :+1:\n. @totokaka Displaying colors is possible, what specifically do you have in mind?\n. Take a look at this: https://github.com/badosu/ircparser.js\n\nIt is a project I made to support colors on subway.\n\nIt should be working as you intend, maybe the configuration option is not set?\n. @hermansc The idea behind using a colored border instead of a background color was to not mess with the screen.\n\nBut as you pointed out, you just need to change irc-colors.css.\n. @totokaka Hmmm, this makes sense.\n\nIs it possible that recovered messages are not rendered here: https://github.com/thedjpetersen/subway/blob/master/assets/js/views/message.js#L30-L32?\n. This should provide some context: https://github.com/thedjpetersen/subway/commit/66f7aefa784adba7d1e57cd810a4658ef0014705\n. @hermansc This is probably not related to #244, only if users can set color codes on `/nick`.\n\nBut even then, they are totally orthogonal features.\n\nI can probably fix one of both issues, but I want to know if I should wait for the refactor.\n. @thedjpetersen This issue is probably outdated now as I assume you probably changed the color highlighting plugin.\n\nAnyway, to reproduce the scrollback thing would be to receive a colorized message, log out and log in again and check whether the message is still colorized.\n. Really really good job @thedjpetersen!\n\nKnow if the plugin api is already defined? Would care to explain how it works, if so?\n\nI am thinking in cleaning: https://github.com/badosu/subway/blob/master/assets/js/views/message.js#L30-32\n. Cool! Thanks!\n. Wow, this is quite awesome!! Thanks!!\n. This is nice!\n\nI am just not sure of which config should have priority the env vars or the file config /cc @thedjpetersen @hermansc \n. Awesome!\n\nMaybe you could write a simple wiki page about how to use your scripts?\n\nSomething like https://github.com/gitlabhq/gitlab-ci/blob/3-2-stable/doc/installation.md but simpler?\n. Maybe a markdown file at `support/README.md`?\n. :+1: /cc @thedjpetersen \n. Thanks!!\n. Awesome @hermansc!\n. I am interested in making the port of the colors plugins if this gets sorted out.\n. Just to add some context on this issue:\n\n@thedjpetersen refactored subway and introduced a plugin functionality that has a prototypical description at https://github.com/thedjpetersen/subway/issues/292#issuecomment-42988189\n. @hoxca @ericbarch Can we close this?\n. Just for reference, this is probably not related to #290.\n\nOnly if users can set color codes on `/nick`.\n. @rayshan \nThere's a live demo at http://subway-chat.herokuapp.com/ but long outdated.\n\nWe would just have to redeploy it.\n. @rayshan \nWould you be able to develop this?\n. @rayshan Take a look at this: https://blog.heroku.com/archives/2014/8/7/heroku-button.\n\nDo you think you can setup something like this for subway?\n. Hmmm.. so this is an issue for a long-lived app.\n\nWe don't want this demo to be an _actual_ irc client for everyone to use, but a simple demo that should work for the user session and show the capabilities of subway.\n\nSo I guess it would be fine, at least for me.\n. I am verifying the stability of this, so please do not merge it yet.\n. @ericbarch Tested this in my subway chat server.\n\nI think it would be ok to set the No Colors option to default false, since most of the time output is not colored, and when it is it is not obstrusively like bgcolor. Besides that, we can adjust it with the `irc-colors.css` file.\n\nI don't know if I changed the models accordingly, or even if it is needed, so if you could check if it is ok I sould be glad.\n\nEverything is okay now, after seeing some bugs I adjusted the Pull Request. I am tuning the `irc-colors.css` now to match our client interface best needs.\n\nWhat do you think?\n. I think it is ok now. Just adjusted the colors to not be intrusive in the chat, so I set the default option to be off.\n. Rebased it against master.\n. Thanks!\n. I think it is ok now!\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. @lukske123 are you running as root?\n\nIs this the output of npm install?\n. @lukske123 Nice!\n\nSo this issue is not related to subway, right?\n\nCan you close it?\n. Thanks!\n. Thanks!\n. Thanks!\n. Hello @LordWingZero, @Myster62 !\n\nHow are you installing? Could you copy and paste the commands here?\n\nWhich platforms do you use?\n\nThanks for the report!\n. Cool! Thanks @LordWingZero!\n. Thanks @nrn!\n. @thedjpetersen @BYK How will the users set a different port for the client?\n\nFor example, will I not be able anymore to run subway on heroku with this patch?\n\nIf not, can we use another approach to solve our issue?\n. Is'nt it possible to support Dokku **and** support people who can't use websockets as well?\n\nI am totally into supporting a new infrasctructure provider, but removing support for another or the fallback for websockets, as a consequence, does not seem a good idea.\n\nAlso, this would revert #226 too.\n. So it is ok for me. :+1:\n. @totokaka Displaying colors is possible, what specifically do you have in mind?\n. Take a look at this: https://github.com/badosu/ircparser.js\n\nIt is a project I made to support colors on subway.\n\nIt should be working as you intend, maybe the configuration option is not set?\n. @hermansc The idea behind using a colored border instead of a background color was to not mess with the screen.\n\nBut as you pointed out, you just need to change irc-colors.css.\n. @totokaka Hmmm, this makes sense.\n\nIs it possible that recovered messages are not rendered here: https://github.com/thedjpetersen/subway/blob/master/assets/js/views/message.js#L30-L32?\n. This should provide some context: https://github.com/thedjpetersen/subway/commit/66f7aefa784adba7d1e57cd810a4658ef0014705\n. @hermansc This is probably not related to #244, only if users can set color codes on `/nick`.\n\nBut even then, they are totally orthogonal features.\n\nI can probably fix one of both issues, but I want to know if I should wait for the refactor.\n. @thedjpetersen This issue is probably outdated now as I assume you probably changed the color highlighting plugin.\n\nAnyway, to reproduce the scrollback thing would be to receive a colorized message, log out and log in again and check whether the message is still colorized.\n. Really really good job @thedjpetersen!\n\nKnow if the plugin api is already defined? Would care to explain how it works, if so?\n\nI am thinking in cleaning: https://github.com/badosu/subway/blob/master/assets/js/views/message.js#L30-32\n. Cool! Thanks!\n. Wow, this is quite awesome!! Thanks!!\n. This is nice!\n\nI am just not sure of which config should have priority the env vars or the file config /cc @thedjpetersen @hermansc \n. Awesome!\n\nMaybe you could write a simple wiki page about how to use your scripts?\n\nSomething like https://github.com/gitlabhq/gitlab-ci/blob/3-2-stable/doc/installation.md but simpler?\n. Maybe a markdown file at `support/README.md`?\n. :+1: /cc @thedjpetersen \n. Thanks!!\n. ",
    "hardcore": "Also made a feature request x) https://github.com/thedjpetersen/subway/issues/179\n. Message icon should be also a good idea. If I can help please let me know.\nThere's a lot of free icons out there you can use for open source projects like:\n\nhttp://iconsweets.com\nhttp://iconsweets2.com\nhttp://glyphicons.com\nhttp://www.icondeposit.com\n\n:-)\n. Message icon should be also a good idea. If I can help please let me know.\nThere's a lot of free icons out there you can use for open source projects like:\n\nhttp://iconsweets.com\nhttp://iconsweets2.com\nhttp://glyphicons.com\nhttp://www.icondeposit.com\n\n:-)\n. Also made a feature request x) https://github.com/thedjpetersen/subway/issues/179\n. Message icon should be also a good idea. If I can help please let me know.\nThere's a lot of free icons out there you can use for open source projects like:\n\nhttp://iconsweets.com\nhttp://iconsweets2.com\nhttp://glyphicons.com\nhttp://www.icondeposit.com\n\n:-)\n. Message icon should be also a good idea. If I can help please let me know.\nThere's a lot of free icons out there you can use for open source projects like:\n\nhttp://iconsweets.com\nhttp://iconsweets2.com\nhttp://glyphicons.com\nhttp://www.icondeposit.com\n\n:-)\n. ",
    "aa2like": "When ever we are login , we are getting error \"Socket is closed \" . how to create a channel ?.\n\nIf knows please help me.\n\nthanks in advance \n. When ever we are login , we are getting error \"Socket is closed \" . how to create a channel ?.\n\nIf knows please help me.\n\nthanks in advance \n. ",
    "clkao": "apparently the auth was done with username/password over websocket messages, and there's current no token or whatsoever for client to authenticate again for reconnecting.\n. apparently the auth was done with username/password over websocket messages, and there's current no token or whatsoever for client to authenticate again for reconnecting.\n. ",
    "pavellishin": "Quick update - I can still type things into the web client, and the text shows up in the channel, but I can't actually see anything said in the channel.\n. Quick update - I can still type things into the web client, and the text shows up in the channel, but I can't actually see anything said in the channel.\n. ",
    "maikelwever": "Also, if another coworker uses subway, the kicked user is not removed from his user list. \n. I just finished implementing this. You can find the commit here: https://github.com/maikelwever/subway/commit/da7af0d8cd159a0bb417917020339e3024c70385\n\nHow does this work:\n- Before logging in to IRC, go to the settings screen and press the green button. Chrome will now ask you for permission on the current domain to send notifications.\n- Join IRC and PROFIT!\n\nThe current implementation notifies on PM and mentions, in which case it will show a notification for 5 seconds (hardcoded at the moment). It uses document.webkitHidden to determine if subway is not visible for the user, in which case a notification will be sent. This is to prevent loads of messages while you are looking at the screen.\n\nIn some time I will submit a pull-request to get this feature into master. If you think this commit needs work before that, please let me know.\n. You can achieve this by settings the client_port to 443 in your settings, and putting an Nginx instance in front of node.js. Since Nginx 1.3.1 (i believe), it is capable of proxying websockets (wss too). This is my current setup, and it works fine.\nEDIT: 1.3.13 it is\n. You need NginX 1.3.13 to proxy websockets. I use Ubuntu 12.04LTS, and got the latest version from the NginX PPAs\n\nNginX config:\n\n``` nginx\nupstream subway {\n        server localhost:3000;\n}\n\nserver {\n        listen 443 ssl;\n        server_name irc.reallysecretdomain.nl;\n\n        ssl_certificate cert.crt;\n        ssl_certificate_key cert.key;\n\n        ssl_session_timeout 5m;\n        ssl_protocols SSLv3 TLSv1;\n        ssl_ciphers ALL:!ADH:!EXPORT56:RC4+RSA:+HIGH:+MEDIUM:+LOW:+SSLv3:+EXP;\n        ssl_prefer_server_ciphers on;\n\n        location / {\n                proxy_pass http://subway;\n\n                # These three seem to be specific to proxying websockets.\n                proxy_http_version 1.1;\n                proxy_set_header Upgrade $http_upgrade;\n                proxy_set_header Connection \"upgrade\";\n\n                proxy_set_header X-Real-IP $remote_addr;\n                proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n                proxy_set_header Host $proxy_host;\n                proxy_set_header X-NginX-Proxy true;\n        }\n\n        location /assets {  # Serving your statics with NginX is good practice\n                alias /path/to/subway/assets/;\n        }\n}\n```\n\nSubway's config.js\n\n``` javascript\n  dev: {\n    port: process.env.PORT || 3000,\n    // This is to make sure the client does not try to connect to port 3000\n    client_port: process.env.CLIENT_PORT || process.env.PORT || 443 \n  },\n  prod: {\n    port: process.env.PORT || 3000,\n    // And again\n    client_port: 443\n  },\n```\n. Yeah, I tried that too, but have found no way to let node.js know it's in a folder, which breaks all static files.\n\n@ericbarch: Do you think the NginX as a reverse proxy solution is sufficient to close this issue?\n. Ow, and there seems to be someone that has implemented this in subway itself: https://github.com/pdxcat/subway/commit/a90c58b94a2bc040890b97d957f75e6cffe7d3cc\n. Why would you not want to watch those nice ASCII arts.\nI agree it's not suited for open channels, but for your IRC channel with your friends?\n. Also, if another coworker uses subway, the kicked user is not removed from his user list. \n. I just finished implementing this. You can find the commit here: https://github.com/maikelwever/subway/commit/da7af0d8cd159a0bb417917020339e3024c70385\n\nHow does this work:\n- Before logging in to IRC, go to the settings screen and press the green button. Chrome will now ask you for permission on the current domain to send notifications.\n- Join IRC and PROFIT!\n\nThe current implementation notifies on PM and mentions, in which case it will show a notification for 5 seconds (hardcoded at the moment). It uses document.webkitHidden to determine if subway is not visible for the user, in which case a notification will be sent. This is to prevent loads of messages while you are looking at the screen.\n\nIn some time I will submit a pull-request to get this feature into master. If you think this commit needs work before that, please let me know.\n. You can achieve this by settings the client_port to 443 in your settings, and putting an Nginx instance in front of node.js. Since Nginx 1.3.1 (i believe), it is capable of proxying websockets (wss too). This is my current setup, and it works fine.\nEDIT: 1.3.13 it is\n. You need NginX 1.3.13 to proxy websockets. I use Ubuntu 12.04LTS, and got the latest version from the NginX PPAs\n\nNginX config:\n\n``` nginx\nupstream subway {\n        server localhost:3000;\n}\n\nserver {\n        listen 443 ssl;\n        server_name irc.reallysecretdomain.nl;\n\n        ssl_certificate cert.crt;\n        ssl_certificate_key cert.key;\n\n        ssl_session_timeout 5m;\n        ssl_protocols SSLv3 TLSv1;\n        ssl_ciphers ALL:!ADH:!EXPORT56:RC4+RSA:+HIGH:+MEDIUM:+LOW:+SSLv3:+EXP;\n        ssl_prefer_server_ciphers on;\n\n        location / {\n                proxy_pass http://subway;\n\n                # These three seem to be specific to proxying websockets.\n                proxy_http_version 1.1;\n                proxy_set_header Upgrade $http_upgrade;\n                proxy_set_header Connection \"upgrade\";\n\n                proxy_set_header X-Real-IP $remote_addr;\n                proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n                proxy_set_header Host $proxy_host;\n                proxy_set_header X-NginX-Proxy true;\n        }\n\n        location /assets {  # Serving your statics with NginX is good practice\n                alias /path/to/subway/assets/;\n        }\n}\n```\n\nSubway's config.js\n\n``` javascript\n  dev: {\n    port: process.env.PORT || 3000,\n    // This is to make sure the client does not try to connect to port 3000\n    client_port: process.env.CLIENT_PORT || process.env.PORT || 443 \n  },\n  prod: {\n    port: process.env.PORT || 3000,\n    // And again\n    client_port: 443\n  },\n```\n. Yeah, I tried that too, but have found no way to let node.js know it's in a folder, which breaks all static files.\n\n@ericbarch: Do you think the NginX as a reverse proxy solution is sufficient to close this issue?\n. Ow, and there seems to be someone that has implemented this in subway itself: https://github.com/pdxcat/subway/commit/a90c58b94a2bc040890b97d957f75e6cffe7d3cc\n. Why would you not want to watch those nice ASCII arts.\nI agree it's not suited for open channels, but for your IRC channel with your friends?\n. ",
    "lukespragg": "This issue should be resolved now. The feature is available in the latest source and working great!\n. I haven't tried PMs yet, but I have found that history in general is not restored when logging back in with bouncer mode enabled.\n. I noticed this as well. Your secure step at least allows working connections @mlutfy, so thanks!\n. Many Linux distros do not have the latest and greatest Node.js and NPM versions available, so additional steps would be needed, but I do agree that it would help. Right now the Node.js requirement is only found in config.js.\n\nThe steps below would get the current Subway repo running on Ubuntu 12.04 for example.\n\n## Update packages and install Node.js\n\nsudo apt-get update\nsudo apt-get install python-software-properties python g++ make\nsudo add-apt-repository ppa:chris-lea/node.js\nsudo apt-get install nodejs=0.10.18-1chl1~precise1\n\n## Install NPM (Node.js package manager)\n\ncurl https://npmjs.org/install.sh | sudo sh\nnpm -v\n. This issue should be resolved now. The feature is available in the latest source and working great!\n. I haven't tried PMs yet, but I have found that history in general is not restored when logging back in with bouncer mode enabled.\n. I noticed this as well. Your secure step at least allows working connections @mlutfy, so thanks!\n. Many Linux distros do not have the latest and greatest Node.js and NPM versions available, so additional steps would be needed, but I do agree that it would help. Right now the Node.js requirement is only found in config.js.\n\nThe steps below would get the current Subway repo running on Ubuntu 12.04 for example.\n\n## Update packages and install Node.js\n\nsudo apt-get update\nsudo apt-get install python-software-properties python g++ make\nsudo add-apt-repository ppa:chris-lea/node.js\nsudo apt-get install nodejs=0.10.18-1chl1~precise1\n\n## Install NPM (Node.js package manager)\n\ncurl https://npmjs.org/install.sh | sudo sh\nnpm -v\n. ",
    "cpdean": "+1\n. +1\n. ",
    "fculpo": "could you describe you nginx conf and end to end setup plz ?\ni'm currently trying to implement this feature on my subway\n. yep, that worked !! thx\nhowever, is it possible to change location / to location /irc so that users access subway via (in your example) irc.reallysecretdomain.nl/irc (i didnt managed to get it working) ?\n. yeah its only 5 more lines of code, i did it yesterday too, but i still prefer the nginx fronted.\nMaybe we could add a prefix variable which do the trick mentionned above\n. I wasn't able to reproduce this one. Is the issue still occuring on your end ?\n. Hi,\n\nAs shown in issue #134 we managed to run subway behind a nginx reverse proxy.\nHowever, subway is unaware of that and still requires static assets from its hardcoded base directory.\n\nFor this reason, accessing it via a location managed by nginx is impossible (ie. example.com/subway) and only the base / location is functional.\n\nPlz correct me if i'm wrong or if you have some workaround.\nIn the meantime i'll try to implement a solution in my fork\n. This fix broke the Windows runtime. I think putting simply models (not ./models or __dirname+\"/models\") could do the trick\n. yeah i can confirm that \"models\" works on Debian/Windows, plz test out with MacOSX\n. Shouldn't it be path.resolve instead of path.join ?\n\n## \n\nFabien\n\nLe mardi 18 juin 2013 à 02:30, Adam Snodgrass a écrit :\n\n> @fculpo (https://github.com/fculpo), I found a solution. (https://github.com/thedjpetersen/subway/pull/251)\n> \n> —\n> Reply to this email directly or view it on GitHub (https://github.com/thedjpetersen/subway/pull/243#issuecomment-19584044).\n. So it seems ofc that all img are correctly loaded, but node is still displaying some error for some reason.\nBtw, regarding the static definitions in webserver.js, images can be loaded via \"/img/active.png\" instead of \"/assets/images/active.png\"\n. indeed that should do the trick and it's more cross platform aware\n. If you are on Mac OSX that's normal, see #251 \n. could you describe you nginx conf and end to end setup plz ?\ni'm currently trying to implement this feature on my subway\n. yep, that worked !! thx\nhowever, is it possible to change location / to location /irc so that users access subway via (in your example) irc.reallysecretdomain.nl/irc (i didnt managed to get it working) ?\n. yeah its only 5 more lines of code, i did it yesterday too, but i still prefer the nginx fronted.\nMaybe we could add a prefix variable which do the trick mentionned above\n. I wasn't able to reproduce this one. Is the issue still occuring on your end ?\n. Hi,\n\nAs shown in issue #134 we managed to run subway behind a nginx reverse proxy.\nHowever, subway is unaware of that and still requires static assets from its hardcoded base directory.\n\nFor this reason, accessing it via a location managed by nginx is impossible (ie. example.com/subway) and only the base / location is functional.\n\nPlz correct me if i'm wrong or if you have some workaround.\nIn the meantime i'll try to implement a solution in my fork\n. This fix broke the Windows runtime. I think putting simply models (not ./models or __dirname+\"/models\") could do the trick\n. yeah i can confirm that \"models\" works on Debian/Windows, plz test out with MacOSX\n. Shouldn't it be path.resolve instead of path.join ?\n\n## \n\nFabien\n\nLe mardi 18 juin 2013 à 02:30, Adam Snodgrass a écrit :\n\n> @fculpo (https://github.com/fculpo), I found a solution. (https://github.com/thedjpetersen/subway/pull/251)\n> \n> —\n> Reply to this email directly or view it on GitHub (https://github.com/thedjpetersen/subway/pull/243#issuecomment-19584044).\n. So it seems ofc that all img are correctly loaded, but node is still displaying some error for some reason.\nBtw, regarding the static definitions in webserver.js, images can be loaded via \"/img/active.png\" instead of \"/assets/images/active.png\"\n. indeed that should do the trick and it's more cross platform aware\n. If you are on Mac OSX that's normal, see #251 \n. ",
    "bkerensa": "I would love any of the above integrated.\n. I would love any of the above integrated.\n. ",
    "drobati": "Here is my error log on this [gist](https://gist.github.com/3098132).\n. Here is my error log on this [gist](https://gist.github.com/3098132).\n. ",
    "SpenserJ": "I don't have access to a computer to check right now, but I experienced a similar issue when the websocket failed to connect, or disconnected prematurely. I'd suggest checking the network tab of any Web Inspector, and seeing what is happening with the socket, and what messages are being passed.\n. This is something that would need to be implemented in the IRC module first. Specifically by changing the [net.createConnection parameters](https://github.com/martynsmith/node-irc/blob/b30e1f6e22cb0fabd1125afdb0fecce3f23f646c/lib/irc.js#L611) to accept an [options object](http://nodejs.org/api/net.html#net_net_createconnection_options_connectionlistener) instead of port and host. I don't know of a way to implement it for TLS as well, otherwise I would write the patch myself.\n\nYou would also want to add localAddress support to Socket.io (I don't see any documentation for it at least) and to the webserver ([add an IP after the port in server.listen()](https://github.com/thedjpetersen/subway/blob/5bfefdcb573694852eecbfbc98db941a2f127cbb/lib/webserver.js#L35))\n. David, I'm a bit rusty on the capabilities of the pull request system, but if I remember correctly, you should be able to merge SpenserJ/Subway@600123b manually after you merge this request. If not, I can send a fresh pull request with both.\n. Scratch that, seems I can push to a specific branch and it adds to the pull request, so you should have both in the same now. Let me know if you want me to tweak anything else in it.\n. This is a problem in Node-IRC (martynsmith/node-irc#122) and should be fixed as soon as Martyn pushes a new version to NPM (martynsmith/node-irc#124)\n. New version of IRC has been pushed to NPM now (#197).\n. Hoxca, you're going to want to make commits that you'd like pulled on a separate branch. Otherwise every commit you make will appear in this pull request, and hoxca@8d9346d is a duplicate of thedjpetersen@b6ce807, while hoxca@37ee050 looks like more of a personal change. The first and second commit, I can see being accepted with only a few minor tweaks:\n- Using === instead of == in lib/socket.js,\n- Setting the default server and channel to something more generic (irc.freenode.net #subway)\n. I don't have access to a computer to check right now, but I experienced a similar issue when the websocket failed to connect, or disconnected prematurely. I'd suggest checking the network tab of any Web Inspector, and seeing what is happening with the socket, and what messages are being passed.\n. This is something that would need to be implemented in the IRC module first. Specifically by changing the [net.createConnection parameters](https://github.com/martynsmith/node-irc/blob/b30e1f6e22cb0fabd1125afdb0fecce3f23f646c/lib/irc.js#L611) to accept an [options object](http://nodejs.org/api/net.html#net_net_createconnection_options_connectionlistener) instead of port and host. I don't know of a way to implement it for TLS as well, otherwise I would write the patch myself.\n\nYou would also want to add localAddress support to Socket.io (I don't see any documentation for it at least) and to the webserver ([add an IP after the port in server.listen()](https://github.com/thedjpetersen/subway/blob/5bfefdcb573694852eecbfbc98db941a2f127cbb/lib/webserver.js#L35))\n. David, I'm a bit rusty on the capabilities of the pull request system, but if I remember correctly, you should be able to merge SpenserJ/Subway@600123b manually after you merge this request. If not, I can send a fresh pull request with both.\n. Scratch that, seems I can push to a specific branch and it adds to the pull request, so you should have both in the same now. Let me know if you want me to tweak anything else in it.\n. This is a problem in Node-IRC (martynsmith/node-irc#122) and should be fixed as soon as Martyn pushes a new version to NPM (martynsmith/node-irc#124)\n. New version of IRC has been pushed to NPM now (#197).\n. Hoxca, you're going to want to make commits that you'd like pulled on a separate branch. Otherwise every commit you make will appear in this pull request, and hoxca@8d9346d is a duplicate of thedjpetersen@b6ce807, while hoxca@37ee050 looks like more of a personal change. The first and second commit, I can see being accepted with only a few minor tweaks:\n- Using === instead of == in lib/socket.js,\n- Setting the default server and channel to something more generic (irc.freenode.net #subway)\n. ",
    "ElijahLynn": "This isn't working as of now.\n. This isn't working as of now.\n. ",
    "creack": "+1! Seems critical to me. Any news on this?\n. +1\n. +1! Seems critical to me. Any news on this?\n. +1\n. ",
    "iwoj": "++\n. ++\n. ",
    "KittyKatt": "I'd be interested in such a use as well.\n. I'd be interested in such a use as well.\n. ",
    "tr00per": "+1\n. So it's not exactly a logout/disconnect now :P Will this make it to the features list or is it out of scope right now?\n. +1\n. So it's not exactly a logout/disconnect now :P Will this make it to the features list or is it out of scope right now?\n. ",
    "ePirat": "Would be great If someone could take a look at this, this is a really important feature for most IRC Network operators which are looking for a webchat I think…\n. Yes, I think so. For example when using it to provide a webchat for a specific server/channel maybe.\n. I agree, I just wanted to note that there should be the ability to prevent the User from changing it.\n. Would be great If someone could take a look at this, this is a really important feature for most IRC Network operators which are looking for a webchat I think…\n. Yes, I think so. For example when using it to provide a webchat for a specific server/channel maybe.\n. I agree, I just wanted to note that there should be the ability to prevent the User from changing it.\n. ",
    "ricardobeat": "I've just released a library that could facilitate this, [konf](https://npmjs.org/package/konf). You could declare the current `config.js` as the defaults, then load a user-defined `config.(js|json)` file or environment variables on top. I'll put together a PR if wanted.\n. Just hit this.\n. Though Google fonts usually suck, [Cousine](http://www.google.com/fonts/#UsePlace:use/Collection:Cousine) is a nice monospaced font similar to Nitti (used in the IA writer app), worth of consideration.\n. I've just released a library that could facilitate this, [konf](https://npmjs.org/package/konf). You could declare the current `config.js` as the defaults, then load a user-defined `config.(js|json)` file or environment variables on top. I'll put together a PR if wanted.\n. Just hit this.\n. Though Google fonts usually suck, [Cousine](http://www.google.com/fonts/#UsePlace:use/Collection:Cousine) is a nice monospaced font similar to Nitti (used in the IA writer app), worth of consideration.\n. ",
    "dgw": "`IF default servers/channels are set THEN disallow adding other servers/channels` doesn't work, because sometimes defaults are just that: defaults, which the user can then modify if needed. Whether or not the client allows adding or removing servers/channels should really be a separate configuration option.\n. Shout hasn't seen any development in about a year. If you're looking to switch off of subway, look at the repo thelounge/lounge (a fork of shout) instead.. `IF default servers/channels are set THEN disallow adding other servers/channels` doesn't work, because sometimes defaults are just that: defaults, which the user can then modify if needed. Whether or not the client allows adding or removing servers/channels should really be a separate configuration option.\n. Shout hasn't seen any development in about a year. If you're looking to switch off of subway, look at the repo thelounge/lounge (a fork of shout) instead.. ",
    "bnb": "+1. I also don't get messages saying that someone has been promoted.\n. Yes, that would work.\n. +1. I also don't get messages saying that someone has been promoted.\n. Yes, that would work.\n. ",
    "marcoceppi": "This now works with the latest Quantal BETA\n. This now works with the latest Quantal BETA\n. ",
    "utatti": "Hi, I'm recently working on the jQuery scrollbar pluin, [perfect-scrollbar](http://noraesae.github.com/perfect-scrollbar/).\n\nI think this plugin can be helpful for this issue.\n\nIf possible, I can look into this issue, but I'm a little bit busy nowadays.\n\nAnyway, if there's someone interested in scrollbar plugin, please try that.\n\nThank you.\n\nRegards.\n. Hi there,\nI worked on this and just uploaded a pull request. Check please.\n. Sure! I'll be very appreciated if you add me as a contributor.\n\nAbout nodejitsu link, yes, It's okay to link, but I can't assure that the app'll be on continuously because jitsu's price plan'll start in the next month and i'm not sure i'd maintain the app if I have to pay for it.\n\nBy the way, there's already the app named 'subway' in nodejitsu. Isn't it yours?\n. Thanks!\n. Sorry this patch has a bug. I'll fix it and re-request. Until then, ignore this request.\n. now it'll works.\n. this patch is for #166\n. Hello,\nCould you please let me know which os and version of browser you use.\nI've seen that kind of problem in IE, but it worked well in Chrome.\nhttp://chauffer.freebnc.net:3000/ seems not to work now, so i don't know exactly what the problem is.\nthanks\n\nregards,\nnoraesae\n. I checked the link and it doesn't work on my pc too(chrome).\nI think there's a problem with server-side.\nIt doesn't provide images and socket.io socket properly.\nThere may be a problem on node.js itself or a module.\nI re-installed the subway the way below and it works well(on ubuntu 12.04). Could you please re-install subway?(re-installing nodejs itself can be helpful i think)\n\n```\n# git clone git://github.com/thedjpetersen/subway.git\n# cd subway\n# npm install\n# node subway\n```\n\nthanks!\n\nRegards,\nnoraesae\n. Hmm... the only difference is \"--nodedir=/root/node/\" and I don't know why this argument needed.\nHow did you install the node? From source?\nWhat version of node did you use?\nI installed node 0.8.9 through \n\n```\n# sudo apt-get install nodejs\n```\n\nIf possible, please re-install nodejs with apt-get and try again without \"--nodedir=...\"\n\nThank you.\n\nRegards,\nnoraesae\n. Hi, I'm recently working on the jQuery scrollbar pluin, [perfect-scrollbar](http://noraesae.github.com/perfect-scrollbar/).\n\nI think this plugin can be helpful for this issue.\n\nIf possible, I can look into this issue, but I'm a little bit busy nowadays.\n\nAnyway, if there's someone interested in scrollbar plugin, please try that.\n\nThank you.\n\nRegards.\n. Hi there,\nI worked on this and just uploaded a pull request. Check please.\n. Sure! I'll be very appreciated if you add me as a contributor.\n\nAbout nodejitsu link, yes, It's okay to link, but I can't assure that the app'll be on continuously because jitsu's price plan'll start in the next month and i'm not sure i'd maintain the app if I have to pay for it.\n\nBy the way, there's already the app named 'subway' in nodejitsu. Isn't it yours?\n. Thanks!\n. Sorry this patch has a bug. I'll fix it and re-request. Until then, ignore this request.\n. now it'll works.\n. this patch is for #166\n. Hello,\nCould you please let me know which os and version of browser you use.\nI've seen that kind of problem in IE, but it worked well in Chrome.\nhttp://chauffer.freebnc.net:3000/ seems not to work now, so i don't know exactly what the problem is.\nthanks\n\nregards,\nnoraesae\n. I checked the link and it doesn't work on my pc too(chrome).\nI think there's a problem with server-side.\nIt doesn't provide images and socket.io socket properly.\nThere may be a problem on node.js itself or a module.\nI re-installed the subway the way below and it works well(on ubuntu 12.04). Could you please re-install subway?(re-installing nodejs itself can be helpful i think)\n\n```\n# git clone git://github.com/thedjpetersen/subway.git\n# cd subway\n# npm install\n# node subway\n```\n\nthanks!\n\nRegards,\nnoraesae\n. Hmm... the only difference is \"--nodedir=/root/node/\" and I don't know why this argument needed.\nHow did you install the node? From source?\nWhat version of node did you use?\nI installed node 0.8.9 through \n\n```\n# sudo apt-get install nodejs\n```\n\nIf possible, please re-install nodejs with apt-get and try again without \"--nodedir=...\"\n\nThank you.\n\nRegards,\nnoraesae\n. ",
    "nwgat": "this needs to be on the priority list, a irc client without scrollable channel list is kinda fun\nsubway is realy nice, but i cannot use it because of no scroll bar on channels :O\n![4v2wwoa](https://cloud.githubusercontent.com/assets/5809156/2625732/06f565f4-bda7-11e3-8537-3b6f7e009a54.png)\n\n@eirikb thx for the patch\n. nevermind, used the wrong file, \n`pm2 start subway --name subway` is the right way\nnot `pm2 start config.js --name subway`\n\nFYI: with ghost i had to use `pm2 start server.js --name ghost`\nso it is a bit confusing, hope this ticket will help others anyway keep up the good work\n. this needs to be on the priority list, a irc client without scrollable channel list is kinda fun\nsubway is realy nice, but i cannot use it because of no scroll bar on channels :O\n![4v2wwoa](https://cloud.githubusercontent.com/assets/5809156/2625732/06f565f4-bda7-11e3-8537-3b6f7e009a54.png)\n\n@eirikb thx for the patch\n. nevermind, used the wrong file, \n`pm2 start subway --name subway` is the right way\nnot `pm2 start config.js --name subway`\n\nFYI: with ghost i had to use `pm2 start server.js --name ghost`\nso it is a bit confusing, hope this ticket will help others anyway keep up the good work\n. ",
    "jasontclark": "Love the project, but w/o this working, it prevents me from migrating to Subway completely. Has there been any movement on this topic? I agree with @nwgat, this should be on the priority list.\n. Love the project, but w/o this working, it prevents me from migrating to Subway completely. Has there been any movement on this topic? I agree with @nwgat, this should be on the priority list.\n. ",
    "chauffer": "I'm using Chromium 22.0.1229.79 (158531) on Arch Linux, the exact thing happened on Firefox 15.0.1 (still Linux)\nSubway should be running now.\n\nThanks.\n. I redownloaded subway, installed the modules (except manually, because some of them gave errors and installed with the --nodedir parameter), running it still does the same thing\n\n<code># ls node_modules/\nactive-x-obfuscator  connect-file-cache  iconv    mongoose   socket.io bcrypt               express             irc      prototype  uglify-js connect              hooks               jade     qs         underscore connect-assets       http                mongodb  snockets\n</code>\n\nedit: since I'm doing this on a new server, I'll reinstall ubuntu 12.04 (running 10.04 now) and try again\nI'll let you know\n. Fresh install of Ubuntu 12.04, installed build-essential, curl, mongodb, git, ssl and ssllibs\nInstalled node.js and npm again, cloned subway and issued `npm install --nodedir=/root/node/` - all modules correctly installed.\nI run it, and it's still the same.\nHere's what happens: (also a `find` for the path files)\nhttp://pastebin.com/jRRTap0n\n. I'm using Chromium 22.0.1229.79 (158531) on Arch Linux, the exact thing happened on Firefox 15.0.1 (still Linux)\nSubway should be running now.\n\nThanks.\n. I redownloaded subway, installed the modules (except manually, because some of them gave errors and installed with the --nodedir parameter), running it still does the same thing\n\n<code># ls node_modules/\nactive-x-obfuscator  connect-file-cache  iconv    mongoose   socket.io bcrypt               express             irc      prototype  uglify-js connect              hooks               jade     qs         underscore connect-assets       http                mongodb  snockets\n</code>\n\nedit: since I'm doing this on a new server, I'll reinstall ubuntu 12.04 (running 10.04 now) and try again\nI'll let you know\n. Fresh install of Ubuntu 12.04, installed build-essential, curl, mongodb, git, ssl and ssllibs\nInstalled node.js and npm again, cloned subway and issued `npm install --nodedir=/root/node/` - all modules correctly installed.\nI run it, and it's still the same.\nHere's what happens: (also a `find` for the path files)\nhttp://pastebin.com/jRRTap0n\n. ",
    "Phixion-zz": "No more like the IP Adress. The Server I'm using it on has 4 Network adapters not all of the IP Adresses have Trustlines in the IRCNetworks I'm using, so I want to chose which adapter subway should take\n. No more like the IP Adress. The Server I'm using it on has 4 Network adapters not all of the IP Adresses have Trustlines in the IRCNetworks I'm using, so I want to chose which adapter subway should take\n. ",
    "Fauntleroy": "This is due to two different events being triggered for the first PM in a conversation. I'll take a closer look into it and see if I can nix the extra event.\n. Sorry, I've actually been building my own node.js IRC client--I'll open source that soon (within a month).\n\nBest I can tell after using the node-irc api for a while now is that you're likely listening to `pm` and `msg` at some point. Since this only occurs on the first shot I'd have to assume it's in the logic that creates the new chat. \n. While that works, it leaves out the (rare) case where someone uses a short youtube URL. Here's the method I use:\n\n``` javascript\n// Get Youtube ID out of a URL\ntestYoutube: function( url ){\n\n    var id = url.match( /(?:youtube\\.com.*[\\?&]v=|youtu\\.be\\/)(.{11})/i );\n    id = ( id )? id[1]: id;\n\n    return id;\n\n}\n```\n. This is due to two different events being triggered for the first PM in a conversation. I'll take a closer look into it and see if I can nix the extra event.\n. Sorry, I've actually been building my own node.js IRC client--I'll open source that soon (within a month).\n\nBest I can tell after using the node-irc api for a while now is that you're likely listening to `pm` and `msg` at some point. Since this only occurs on the first shot I'd have to assume it's in the logic that creates the new chat. \n. While that works, it leaves out the (rare) case where someone uses a short youtube URL. Here's the method I use:\n\n``` javascript\n// Get Youtube ID out of a URL\ntestYoutube: function( url ){\n\n    var id = url.match( /(?:youtube\\.com.*[\\?&]v=|youtu\\.be\\/)(.{11})/i );\n    id = ( id )? id[1]: id;\n\n    return id;\n\n}\n```\n. ",
    "rocsteady": "I was able to get some help from the guys in the osu-lug channel, and it turned out that I just needed to install libssl-dev. I used `apt-get` to install it, and then `npm install` was successful. \n. I was able to get some help from the guys in the osu-lug channel, and it turned out that I just needed to install libssl-dev. I used `apt-get` to install it, and then `npm install` was successful. \n. ",
    "roadking753": "I get the same error on my windows machine... any advice for the same.. will be helpful.\n. I get the same error on my windows machine... any advice for the same.. will be helpful.\n. ",
    "tvamsisai": "The above remedy doesn't work for me. :/\n. @thedjpetersen: yes\n. @thedjpetersen how should i go about it?\n. It is already installed.\n. The above remedy doesn't work for me. :/\n. @thedjpetersen: yes\n. @thedjpetersen how should i go about it?\n. It is already installed.\n. ",
    "dileeptp": "Just download bcrypt-nodejs from this link  https://github.com/shaneGirish/bcrypt-nodejs .Rename the folder from bcrypt-nodejs to bcrypt and put it inside node_modules direcory. This solved my problem\n. Just download bcrypt-nodejs from this link  https://github.com/shaneGirish/bcrypt-nodejs .Rename the folder from bcrypt-nodejs to bcrypt and put it inside node_modules direcory. This solved my problem\n. ",
    "karthickyuva": "Hi Dileeptp, its working fine for me. \n\nThanks\n. Hi Dileeptp, its working fine for me. \n\nThanks\n. ",
    "rituraj841": "Thanks dileeptp ..I had the same issue and this worked for me too... Thanks dileeptp ..I had the same issue and this worked for me too... ",
    "linux08": "Thanks dileeptp,it worked. Thanks dileeptp,it worked. ",
    "borellaster": "Thanks @dileeptp. Works fine for me too.. Thanks @dileeptp. Works fine for me too.. ",
    "eltel": "Thanks @dileeptp - Youre the man!. Thanks @dileeptp - Youre the man!. ",
    "predominant": "What @theonlydoo wants to do restrict the hosts that subway will allow connection to. Essentially remove the host box for connection, and force hostname/port to be a predefined set.\n. What @theonlydoo wants to do restrict the hosts that subway will allow connection to. Essentially remove the host box for connection, and force hostname/port to be a predefined set.\n. ",
    "theonlydoo": "exactly @predominant thats what I wanted to say. Plus, I've experienced a few segmentation fault during the execution of the program ... its weird that there is no log output either ! \n. exactly @predominant thats what I wanted to say. Plus, I've experienced a few segmentation fault during the execution of the program ... its weird that there is no log output either ! \n. ",
    "pepijndevos": "I'd like this feature too.\n. I'd like this feature too.\n. ",
    "kaihendry": "Hi, I'm looking for a default server / channel setup for our hackerspace. Wondering when you are going to this on. :)\n. Hi, I'm looking for a default server / channel setup for our hackerspace. Wondering when you are going to this on. :)\n. ",
    "hoxca": "Yes sir, I will :)\n\nIn fact, the debian policy tell that we should not include the debian directory in the upstream source.\nbut until you push subway to debian community this will not be a problem. (note that node is not in a compatible version on weezy)\n\nAnyway, i will make a merged pull request without the default server patch !\n\nLe 4 janv. 2013 à 18:38, David Petersen a écrit :\n\n> Can you please keep your pull requests seperate. The default server code is correctly in a seperate pull request and should not be here.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. Yes sir, I will :)\n\nIn fact, the debian policy tell that we should not include the debian directory in the upstream source.\nbut until you push subway to debian community this will not be a problem. (note that node is not in a compatible version on weezy)\n\nAnyway, i will make a merged pull request without the default server patch !\n\nLe 4 janv. 2013 à 18:38, David Petersen a écrit :\n\n> Can you please keep your pull requests seperate. The default server code is correctly in a seperate pull request and should not be here.\n> \n> —\n> Reply to this email directly or view it on GitHub.\n. ",
    "kennu": "You should probably upgrade to Node 0.8 to avoid this problem.\n. You should probably upgrade to Node 0.8 to avoid this problem.\n. ",
    "getsetbro": "I get this error too \"Unity support not available\" client.js 42.\nI am on my home network. I also tried while tethered to my phone.\n. I get this error too \"Unity support not available\" client.js 42.\nI am on my home network. I also tried while tethered to my phone.\n. ",
    "Ibuprofen": "No that function is to convert characters into their html equivalents. An example is & to `&amp;` The bug I ran into is when a username contains one of the regex characters like the pipe (|) that will be passed into the expression without escaping and then alter the expression.\n. ae775026d658984acf64b195298d36e1a910f764 should support short youtube urls (youtu.be). I tested http://youtu.be/WF34N4gJAKE locally and embed worked as expected.\n. No that function is to convert characters into their html equivalents. An example is & to `&amp;` The bug I ran into is when a username contains one of the regex characters like the pipe (|) that will be passed into the expression without escaping and then alter the expression.\n. ae775026d658984acf64b195298d36e1a910f764 should support short youtube urls (youtu.be). I tested http://youtu.be/WF34N4gJAKE locally and embed worked as expected.\n. ",
    "mlutfy": "I also experienced this problem. Enabling debug shows that it's trying to send messages to \"status\".\n. I'm not very familiar with nodejs programming, but while debugging in ./node_modules/irc/lib/irc.js, I logged the exception by changing to:\n\n```\nself.conn.addListener(\"error\", function(exception) {\n    // added this\n    if ( self.opt.debug ) {\n        util.log(exception);\n    }\n    self.emit(\"netError\", exception);\n});\n```\n\nAlso, in lib/irclink.js, I added \"debug: true\" in the call to \"instance.client = new irc.Client\".\n\nOn Freenode: even if I had not selected the \"SSL\" option when connecting, it was trying to connect to port 6667 and to validate the SSL client.\n\nI modified the \"new irc.Client\" in lib/irclink.js to explicitely set the SSL flag to \"false\":\n\n```\n    secure: false, // userConn.ssl,\n```\n\nDoing a \"console.log(userConn)\" shows that userConn.ssl is an empty array.\n. I also experienced this problem. Enabling debug shows that it's trying to send messages to \"status\".\n. I'm not very familiar with nodejs programming, but while debugging in ./node_modules/irc/lib/irc.js, I logged the exception by changing to:\n\n```\nself.conn.addListener(\"error\", function(exception) {\n    // added this\n    if ( self.opt.debug ) {\n        util.log(exception);\n    }\n    self.emit(\"netError\", exception);\n});\n```\n\nAlso, in lib/irclink.js, I added \"debug: true\" in the call to \"instance.client = new irc.Client\".\n\nOn Freenode: even if I had not selected the \"SSL\" option when connecting, it was trying to connect to port 6667 and to validate the SSL client.\n\nI modified the \"new irc.Client\" in lib/irclink.js to explicitely set the SSL flag to \"false\":\n\n```\n    secure: false, // userConn.ssl,\n```\n\nDoing a \"console.log(userConn)\" shows that userConn.ssl is an empty array.\n. ",
    "themgt": "We setup a demo on Pogoapp here: http://subway.pogoapp.com/\nUsers can also fork their own copy: https://hub.pogoapp.com/pogoapp/subway\n. We setup a demo on Pogoapp here: http://subway.pogoapp.com/\nUsers can also fork their own copy: https://hub.pogoapp.com/pogoapp/subway\n. ",
    "garlandkr": "thank you.\n. thank you.\n. ",
    "DevBOFH": "Okay so this is an issue with the version of nodejs that ubuntu installs from it's standard repo.\n\nSo don't use it, and if you've already installed it, remove it.\n\nYou want to get the latest stable version, and can do so on Ubuntu 12.x with the following steps:\n\nsudo apt-get install python-software-properties python g++ make\nsudo add-apt-repository ppa:chris-lea/node.js\nsudo apt-get update\nsudo apt-get install nodejs\n\nOnce you have that, `npm install` should run correctly. and a `nodejs subway` should start subway.\n. Okay so this is an issue with the version of nodejs that ubuntu installs from it's standard repo.\n\nSo don't use it, and if you've already installed it, remove it.\n\nYou want to get the latest stable version, and can do so on Ubuntu 12.x with the following steps:\n\nsudo apt-get install python-software-properties python g++ make\nsudo add-apt-repository ppa:chris-lea/node.js\nsudo apt-get update\nsudo apt-get install nodejs\n\nOnce you have that, `npm install` should run correctly. and a `nodejs subway` should start subway.\n. ",
    "flyingdev": "Thanks.\n. Thanks.\n. ",
    "JaTochNietDan": "Sounds great! :+1:\n. Sounds great! :+1:\n. ",
    "driverdan": "Understood. The README should still include a section about breaking changes so users of older versions can know about it before upgrading.\n. Understood. The README should still include a section about breaking changes so users of older versions can know about it before upgrading.\n. ",
    "martindale": "+1.\n. +1.\n. ",
    "overra": "Doesn't look like just \"models\" works on osx. I'll see if I can find something they all agree on.\n. @fculpo, [I found a solution.](https://github.com/thedjpetersen/subway/pull/251)\n. Doesn't look like just \"models\" works on osx. I'll see if I can find something they all agree on.\n. @fculpo, [I found a solution.](https://github.com/thedjpetersen/subway/pull/251)\n. ",
    "naggie": "How about all server messages in monospace? It would at least solve one of @maikelwever's problems. I'm not sure ASCII art belongs in a chat room, however ;-)\n. How about all server messages in monospace? It would at least solve one of @maikelwever's problems. I'm not sure ASCII art belongs in a chat room, however ;-)\n. ",
    "mixinmax": "@naggie I second that. Monospace all the way.\n. @naggie I second that. Monospace all the way.\n. ",
    "modembug": "I am seeing the same issue with the current build: https://github.com/thedjpetersen/subway/commit/53eb543d9f82a94ae9733e116438ad8a712a4748\n. I am seeing the same issue with the current build: https://github.com/thedjpetersen/subway/commit/53eb543d9f82a94ae9733e116438ad8a712a4748\n. ",
    "gyng": "I think this might be related:\n\nSubway crashes when I try to connect to some IRC servers with SSL enabled (self-signed or not). For some other servers with SSL it just hangs like in the first post, without any useful info in the console output. _However, Freenode SSL works!_ Non-SSL connections also work fine.\n\nUsing node.js v0.10.12 on an Ubuntu box.\n[npm list](https://gist.github.com/Fauxface/5858938)\n\nOutput when it crashes:\n\n```\nuser@box:/opt/subway# ./subway\n   info  - socket.io started\nSubway started on port 3000\nCan't resolve image path: ../img/glyphicons-halflings.png\nCan't resolve image path: ../img/glyphicons-halflings-white.png\nCan't resolve image path: /assets/images/join.png\nCan't resolve image path: /assets/images/part.png\nCan't resolve image path: /assets/images/topic.png\nCan't resolve image path: /assets/images/active.png\nCan't resolve image path: /assets/images/idle.png\n   debug - served static content /socket.io.js\n   debug - client authorized\n   info  - handshake authorized PPFN0A-ZJfPqGRywe12N\n   debug - setting request GET /socket.io/1/websocket/PPFN0A-ZJfPqGRywe12N\n   debug - set heartbeat interval for client PPFN0A-ZJfPqGRywe12N\n   debug - client authorized for\n   debug - websocket writing 1::\n   debug - emitting heartbeat for client PPFN0A-ZJfPqGRywe12N\n   debug - websocket writing 2::\n   debug - set heartbeat timeout for client PPFN0A-ZJfPqGRywe12N\n   debug - got heartbeat packet\n   debug - cleared heartbeat timeout for client PPFN0A-ZJfPqGRywe12N\n   debug - set heartbeat interval for client PPFN0A-ZJfPqGRywe12N\nRestoring connection 1...\nnode: ../src/node_object_wrap.h:61: static T* node::ObjectWrap::Unwrap(v8::Handle<v8::Object>) [with T = node::crypto::Connection]: Assertion `handle-    >InternalFieldCount() > 0' failed.\nAborted\n```\n. This issue seems to be resolved now.\n. I think this might be related:\n\nSubway crashes when I try to connect to some IRC servers with SSL enabled (self-signed or not). For some other servers with SSL it just hangs like in the first post, without any useful info in the console output. _However, Freenode SSL works!_ Non-SSL connections also work fine.\n\nUsing node.js v0.10.12 on an Ubuntu box.\n[npm list](https://gist.github.com/Fauxface/5858938)\n\nOutput when it crashes:\n\n```\nuser@box:/opt/subway# ./subway\n   info  - socket.io started\nSubway started on port 3000\nCan't resolve image path: ../img/glyphicons-halflings.png\nCan't resolve image path: ../img/glyphicons-halflings-white.png\nCan't resolve image path: /assets/images/join.png\nCan't resolve image path: /assets/images/part.png\nCan't resolve image path: /assets/images/topic.png\nCan't resolve image path: /assets/images/active.png\nCan't resolve image path: /assets/images/idle.png\n   debug - served static content /socket.io.js\n   debug - client authorized\n   info  - handshake authorized PPFN0A-ZJfPqGRywe12N\n   debug - setting request GET /socket.io/1/websocket/PPFN0A-ZJfPqGRywe12N\n   debug - set heartbeat interval for client PPFN0A-ZJfPqGRywe12N\n   debug - client authorized for\n   debug - websocket writing 1::\n   debug - emitting heartbeat for client PPFN0A-ZJfPqGRywe12N\n   debug - websocket writing 2::\n   debug - set heartbeat timeout for client PPFN0A-ZJfPqGRywe12N\n   debug - got heartbeat packet\n   debug - cleared heartbeat timeout for client PPFN0A-ZJfPqGRywe12N\n   debug - set heartbeat interval for client PPFN0A-ZJfPqGRywe12N\nRestoring connection 1...\nnode: ../src/node_object_wrap.h:61: static T* node::ObjectWrap::Unwrap(v8::Handle<v8::Object>) [with T = node::crypto::Connection]: Assertion `handle-    >InternalFieldCount() > 0' failed.\nAborted\n```\n. This issue seems to be resolved now.\n. ",
    "Preston4tw": "Also having this issue. nodejs 0.10.16-1 on cent6 x64 from epel. Self signed SSL cert with IRC server inspircd 2.0.13, not sure to what extent that's relevant.\n. Also having this issue. nodejs 0.10.16-1 on cent6 x64 from epel. Self signed SSL cert with IRC server inspircd 2.0.13, not sure to what extent that's relevant.\n. ",
    "subterfugium": "I'm having same issue with node 0.10.21 and ZNC bouncer...\n. I'm having same issue with node 0.10.21 and ZNC bouncer...\n. ",
    "zhongfu": "Oh yes, forgot to mention that it was on Ubuntu Server 12.04\n. Pulled the latest node.js from launchpad ppa:chris-lea/node.js (0.10.12-1chl1~quantal1), pulled and did `npm install`. Now it gives this:\n\n```\nsrv@zeta:/srv/subway$ ./subway\n\nmodule.js:340\n    throw err;\n          ^\nError: Cannot find module 'connect'\n    at Function.Module._resolveFilename (module.js:338:15)\n    at Function.Module._load (module.js:280:25)\n    at Module.require (module.js:364:17)\n    at require (module.js:380:17)\n    at Object.<anonymous> (/srv/subway/node_modules/express/lib/express.js:5:15)\n    at Module._compile (module.js:456:26)\n    at Object.Module._extensions..js (module.js:474:10)\n    at Module.load (module.js:356:32)\n    at Function.Module._load (module.js:312:12)\n    at Module.require (module.js:364:17)\n```\n. Starts fine now, thanks!\n. Oh yes, forgot to mention that it was on Ubuntu Server 12.04\n. Pulled the latest node.js from launchpad ppa:chris-lea/node.js (0.10.12-1chl1~quantal1), pulled and did `npm install`. Now it gives this:\n\n```\nsrv@zeta:/srv/subway$ ./subway\n\nmodule.js:340\n    throw err;\n          ^\nError: Cannot find module 'connect'\n    at Function.Module._resolveFilename (module.js:338:15)\n    at Function.Module._load (module.js:280:25)\n    at Module.require (module.js:364:17)\n    at require (module.js:380:17)\n    at Object.<anonymous> (/srv/subway/node_modules/express/lib/express.js:5:15)\n    at Module._compile (module.js:456:26)\n    at Object.Module._extensions..js (module.js:474:10)\n    at Module.load (module.js:356:32)\n    at Function.Module._load (module.js:312:12)\n    at Module.require (module.js:364:17)\n```\n. Starts fine now, thanks!\n. ",
    "rayshan": "Can this be re-opened? Live demo would greatly help new users.\n. Thanks, that'll be nice. Due to the limited dependencies, you could even set up hooks b/t Github / Travis CI / Heroku to have the app auto-redeploy upon release.\n. @badosu maybe, let me play w/ this given heroku's latest websocket changes and i'll report back\n. Hi, I saw that too, pretty cool.\n\nSo I did play with this combo the other day. Websockets seem to work out of the box, which is nice. However the issue I had was that heroku dynos go to sleep if server isn't being pinged, and I guess websocket activity isn't counted. This causes settings (logins, etc.) to be erased. Doesn't Subway work w/ MongoDB? Where are the docs on how to set up db?\n. Can this be re-opened? Live demo would greatly help new users.\n. Thanks, that'll be nice. Due to the limited dependencies, you could even set up hooks b/t Github / Travis CI / Heroku to have the app auto-redeploy upon release.\n. @badosu maybe, let me play w/ this given heroku's latest websocket changes and i'll report back\n. Hi, I saw that too, pretty cool.\n\nSo I did play with this combo the other day. Websockets seem to work out of the box, which is nice. However the issue I had was that heroku dynos go to sleep if server isn't being pinged, and I guess websocket activity isn't counted. This causes settings (logins, etc.) to be erased. Doesn't Subway work w/ MongoDB? Where are the docs on how to set up db?\n. ",
    "OchenZloy": "Same problem. Tested on node.js 0.10.12 in CentOS 6\n. Same problem. Tested on node.js 0.10.12 in CentOS 6\n. ",
    "michaelr": "This is an issue in node-orm2. see https://github.com/dresende/node-orm2/pull/234\n. This is an issue in node-orm2. see https://github.com/dresende/node-orm2/pull/234\n. ",
    "lorenzhs": "Thanks!\n. Thanks!\n. ",
    "kparaju": "@Wulfspider: the bouncer is not writing any data to the database.\n\nThis seems to be because of line `83` and `96` in `irclink.js`. If you change the lines from `if (!userConn.temporary) {`  to `if (true) {` in both places it will start logging.\n\nThis is a temporary fix around the logging issue (does not seem to fix this bug). Looks like it's also related to #268.\n. @Wulfspider: the bouncer is not writing any data to the database.\n\nThis seems to be because of line `83` and `96` in `irclink.js`. If you change the lines from `if (!userConn.temporary) {`  to `if (true) {` in both places it will start logging.\n\nThis is a temporary fix around the logging issue (does not seem to fix this bug). Looks like it's also related to #268.\n. ",
    "Code-nomad": "i am installing it as root and this is the result of npm install after\nfollowing all instructions. I am on debian 6.0 minimal on a vps.\n\n2013/8/14 Amadeus Folego notifications@github.com\n\n> @lukske123 https://github.com/lukske123 are you running as root?\n> \n> Is this the output of npm install?\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/267#issuecomment-22640242\n> .\n\n## \n\nBeste\n\nMet vriendelijke groeten\n\nLucas Van Beneden\n. i reinstalled the OS just to be sure and managed to capture the commandline output this time: here goes:\n\n> sqlite3@2.1.15 install /opt/subway/node_modules/jugglingdb-sqlite3/node_modules/sqlite3\n> node-gyp rebuild\n\nnpm http 200 https://registry.npmjs.org/uglify-js/1.2.5\nnpm http GET https://registry.npmjs.org/uglify-js/-/uglify-js-1.2.5.tgz\nnpm http 200 https://registry.npmjs.org/active-x-obfuscator/0.0.1\nnpm http GET https://registry.npmjs.org/active-x-obfuscator/-/active-x-obfuscator-0.0.1.tgz\ngyp ERR! configure error \ngyp ERR! stack Error: \"pre\" versions of node cannot be installed, use the --nodedir flag instead\ngyp ERR! stack     at install (/usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/install.js:65:16)\ngyp ERR! stack     at Object.self.commands.(anonymous function) [as install](/usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/node-gyp.js:66:37)\ngyp ERR! stack     at getNodeDir (/usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/configure.js:228:20)\ngyp ERR! stack     at /usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/configure.js:110:9\ngyp ERR! stack     at ChildProcess.exithandler (child_process.js:640:7)\ngyp ERR! stack     at ChildProcess.EventEmitter.emit (events.js:103:17)\ngyp ERR! stack     at maybeClose (child_process.js:740:16)\ngyp ERR! stack     at Process.ChildProcess._handle.onexit (child_process.js:807:5)\ngyp ERR! System Linux 3.1.2-vs2.3.2.1.build1-cti\ngyp ERR! command \"node\" \"/usr/local/lib/node_modules/npm/node_modules/node-gyp/bin/node-gyp.js\" \"rebuild\"\ngyp ERR! cwd /opt/subway/node_modules/jugglingdb-sqlite3/node_modules/sqlite3\ngyp ERR! node -v v0.11.6-pre\ngyp ERR! node-gyp -v v0.10.6\ngyp ERR! not ok \nnpm ERR! weird error 1\nnpm http 200 https://registry.npmjs.org/xmlhttprequest/1.4.2\nnpm http 200 https://registry.npmjs.org/wordwrap/-/wordwrap-0.0.2.tgz\nnpm http GET https://registry.npmjs.org/xmlhttprequest/-/xmlhttprequest-1.4.2.tgz\nnpm http 200 https://registry.npmjs.org/amdefine/-/amdefine-0.0.8.tgz\nnpm http 200 https://registry.npmjs.org/minimatch/-/minimatch-0.2.12.tgz\nnpm http 200 https://registry.npmjs.org/ws\nnpm http GET https://registry.npmjs.org/ws/-/ws-0.4.27.tgz\nnpm http 200 https://registry.npmjs.org/active-x-obfuscator/-/active-x-obfuscator-0.0.1.tgz\nnpm http 200 https://registry.npmjs.org/uglify-js/-/uglify-js-1.2.5.tgz\nnpm http 200 https://registry.npmjs.org/xmlhttprequest/-/xmlhttprequest-1.4.2.tgz\nnpm http 200 https://registry.npmjs.org/ws/-/ws-0.4.27.tgz\nnpm ERR! not ok code 0\n. update: installing npm and nodejs from checkinstall produced deb did the trick. Running it now. Runs like a charm :+1: kudos to all participators in this project!\n. i am installing it as root and this is the result of npm install after\nfollowing all instructions. I am on debian 6.0 minimal on a vps.\n\n2013/8/14 Amadeus Folego notifications@github.com\n\n> @lukske123 https://github.com/lukske123 are you running as root?\n> \n> Is this the output of npm install?\n> \n> —\n> Reply to this email directly or view it on GitHubhttps://github.com/thedjpetersen/subway/issues/267#issuecomment-22640242\n> .\n\n## \n\nBeste\n\nMet vriendelijke groeten\n\nLucas Van Beneden\n. i reinstalled the OS just to be sure and managed to capture the commandline output this time: here goes:\n\n> sqlite3@2.1.15 install /opt/subway/node_modules/jugglingdb-sqlite3/node_modules/sqlite3\n> node-gyp rebuild\n\nnpm http 200 https://registry.npmjs.org/uglify-js/1.2.5\nnpm http GET https://registry.npmjs.org/uglify-js/-/uglify-js-1.2.5.tgz\nnpm http 200 https://registry.npmjs.org/active-x-obfuscator/0.0.1\nnpm http GET https://registry.npmjs.org/active-x-obfuscator/-/active-x-obfuscator-0.0.1.tgz\ngyp ERR! configure error \ngyp ERR! stack Error: \"pre\" versions of node cannot be installed, use the --nodedir flag instead\ngyp ERR! stack     at install (/usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/install.js:65:16)\ngyp ERR! stack     at Object.self.commands.(anonymous function) [as install](/usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/node-gyp.js:66:37)\ngyp ERR! stack     at getNodeDir (/usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/configure.js:228:20)\ngyp ERR! stack     at /usr/local/lib/node_modules/npm/node_modules/node-gyp/lib/configure.js:110:9\ngyp ERR! stack     at ChildProcess.exithandler (child_process.js:640:7)\ngyp ERR! stack     at ChildProcess.EventEmitter.emit (events.js:103:17)\ngyp ERR! stack     at maybeClose (child_process.js:740:16)\ngyp ERR! stack     at Process.ChildProcess._handle.onexit (child_process.js:807:5)\ngyp ERR! System Linux 3.1.2-vs2.3.2.1.build1-cti\ngyp ERR! command \"node\" \"/usr/local/lib/node_modules/npm/node_modules/node-gyp/bin/node-gyp.js\" \"rebuild\"\ngyp ERR! cwd /opt/subway/node_modules/jugglingdb-sqlite3/node_modules/sqlite3\ngyp ERR! node -v v0.11.6-pre\ngyp ERR! node-gyp -v v0.10.6\ngyp ERR! not ok \nnpm ERR! weird error 1\nnpm http 200 https://registry.npmjs.org/xmlhttprequest/1.4.2\nnpm http 200 https://registry.npmjs.org/wordwrap/-/wordwrap-0.0.2.tgz\nnpm http GET https://registry.npmjs.org/xmlhttprequest/-/xmlhttprequest-1.4.2.tgz\nnpm http 200 https://registry.npmjs.org/amdefine/-/amdefine-0.0.8.tgz\nnpm http 200 https://registry.npmjs.org/minimatch/-/minimatch-0.2.12.tgz\nnpm http 200 https://registry.npmjs.org/ws\nnpm http GET https://registry.npmjs.org/ws/-/ws-0.4.27.tgz\nnpm http 200 https://registry.npmjs.org/active-x-obfuscator/-/active-x-obfuscator-0.0.1.tgz\nnpm http 200 https://registry.npmjs.org/uglify-js/-/uglify-js-1.2.5.tgz\nnpm http 200 https://registry.npmjs.org/xmlhttprequest/-/xmlhttprequest-1.4.2.tgz\nnpm http 200 https://registry.npmjs.org/ws/-/ws-0.4.27.tgz\nnpm ERR! not ok code 0\n. update: installing npm and nodejs from checkinstall produced deb did the trick. Running it now. Runs like a charm :+1: kudos to all participators in this project!\n. ",
    "vektah": "+1\n\nSubway seems broken in master when using v0.10.20. This patch seems to fix it.\n. +1\n\nSubway seems broken in master when using v0.10.20. This patch seems to fix it.\n. ",
    "Paperback": "I'm amazed this isn't already included.\n. I'm amazed this isn't already included.\n. ",
    "VictorioBerra": "Same error here.\n. After the holidays ill spin up a fresh VM with the latest Ubuntu and test your install instructions and I will do the same with a Mint 16 install and report back. \n. Okay.\n\nFresh Ubuntu VM. I installed NODE and NPM with this tutorial: http://ariejan.net/2011/10/24/installing-node-js-and-npm-on-ubuntu-debian/\n\nThen I simply followed the tutorial on this github. There is a problem with this package on newer systems and it appears to be the fault of sqlite3\n. This is why: https://github.com/mapbox/node-sqlite3/issues/194 which was 3 months ago. :(\n\n\"node-sqlite3 does not currently support node v0.11.x. We will plan to add support for the latest node once v0.12.x     is released. So if you want to use this module you will need to stick with the stable node series: v0.10.x.\"\n. Okay I fixed it by installing Node latest 0.10 version (git checkout v0.10.24) and then (npm install sqlite3). \n. Same error here.\n. After the holidays ill spin up a fresh VM with the latest Ubuntu and test your install instructions and I will do the same with a Mint 16 install and report back. \n. Okay.\n\nFresh Ubuntu VM. I installed NODE and NPM with this tutorial: http://ariejan.net/2011/10/24/installing-node-js-and-npm-on-ubuntu-debian/\n\nThen I simply followed the tutorial on this github. There is a problem with this package on newer systems and it appears to be the fault of sqlite3\n. This is why: https://github.com/mapbox/node-sqlite3/issues/194 which was 3 months ago. :(\n\n\"node-sqlite3 does not currently support node v0.11.x. We will plan to add support for the latest node once v0.12.x     is released. So if you want to use this module you will need to stick with the stable node series: v0.10.x.\"\n. Okay I fixed it by installing Node latest 0.10 version (git checkout v0.10.24) and then (npm install sqlite3). \n. ",
    "BYK": "Updated!\n. > For example, will I not be able anymore to run subway on heroku with this patch?\n\nDefinitely not. On the contrary, I'm making this change to prevent custom configuration for Heroku-like systems (I use Dokku).\n\nThe point is, `client_port` is always the port you get from `document.location.port` since we listen on the same port with the asset server.\n\nIf you think this will break your setup, feel free to get this fork and push it to Heroku but again, I did this to be able to run this on my Dokku server which runs smoothly, without any configuration change.\n. @badosu, this is **not** removing support for Heroku or anything else. Even if you don't use websockets, you still use the same port on the client: `document.location.port`.\n\nAnd it does not revert #226 either. We still use the port provided by the environment. Dokku is not a new provider, it is just an open source Heroku clone which has exactly the same properties with it except for the websocket limitation: https://github.com/progrium/dokku\n. @badosu, if this regresses anything related to Heroku or other service, I give you my word that I'll fix it ;)\n\nThanks for the quick response! :+1: \n. I kind of think React's way of mixing JS and HTML is not really good. Otherwise all looks great and I'd like to give this a hand if possible.\n\nI've actually ported the IRC handling library on the backend to front-end, if you think that would be useful. I'm willing to help with any other tasks too.\n. @thedjpetersen, it is more of a philosophical thing. I believe in separation of concerns but I'm also open to new ideas. Since you've already done the hard work, I say why not? :)\n. Updated!\n. > For example, will I not be able anymore to run subway on heroku with this patch?\n\nDefinitely not. On the contrary, I'm making this change to prevent custom configuration for Heroku-like systems (I use Dokku).\n\nThe point is, `client_port` is always the port you get from `document.location.port` since we listen on the same port with the asset server.\n\nIf you think this will break your setup, feel free to get this fork and push it to Heroku but again, I did this to be able to run this on my Dokku server which runs smoothly, without any configuration change.\n. @badosu, this is **not** removing support for Heroku or anything else. Even if you don't use websockets, you still use the same port on the client: `document.location.port`.\n\nAnd it does not revert #226 either. We still use the port provided by the environment. Dokku is not a new provider, it is just an open source Heroku clone which has exactly the same properties with it except for the websocket limitation: https://github.com/progrium/dokku\n. @badosu, if this regresses anything related to Heroku or other service, I give you my word that I'll fix it ;)\n\nThanks for the quick response! :+1: \n. I kind of think React's way of mixing JS and HTML is not really good. Otherwise all looks great and I'd like to give this a hand if possible.\n\nI've actually ported the IRC handling library on the backend to front-end, if you think that would be useful. I'm willing to help with any other tasks too.\n. @thedjpetersen, it is more of a philosophical thing. I believe in separation of concerns but I'm also open to new ideas. Since you've already done the hard work, I say why not? :)\n. ",
    "46bit": "This sounds great. I've been working on a refactor to enable multiple IRC networks etc (https://github.com/46bit/subway) but trying to keep it working the same.\n. @thedjpetersen: It would be great if you could hang out in #subway on Freenode?\n. This sounds great. I've been working on a refactor to enable multiple IRC networks etc (https://github.com/46bit/subway) but trying to keep it working the same.\n. @thedjpetersen: It would be great if you could hang out in #subway on Freenode?\n. ",
    "chiguireitor": "Going to download it right now, i'm using this as the support channel for my business :)\n. Going to download it right now, i'm using this as the support channel for my business :)\n. ",
    "jdve": "@hermansc, thanks for the feedback!  Yes, I agree, `presets.password` really doesn't make any sense.  I've removed that now.  Also, AFAIK, the `channels: [\"#channelname password\", \"#anotherchannel foobar\"]` syntax will work, because under-the-hood it's just calling the same \"join\" method that we use when manually joining a channel.\n. @hermansc, thanks for the feedback!  Yes, I agree, `presets.password` really doesn't make any sense.  I've removed that now.  Also, AFAIK, the `channels: [\"#channelname password\", \"#anotherchannel foobar\"]` syntax will work, because under-the-hood it's just calling the same \"join\" method that we use when manually joining a channel.\n. ",
    "jamietech": "The issue with this change is that when multiple accounts are being used (i.e., to be able to connect to more than one network) it is now no longer possible to \"logout\" (or the option is hidden from the UI).\n. Would it not be better to use `//fonts.googleapis.com/css?family=Open+Sans:400italic,400,300,600,700,800` which will load over the protocol of the page?\n. The issue with this change is that when multiple accounts are being used (i.e., to be able to connect to more than one network) it is now no longer possible to \"logout\" (or the option is hidden from the UI).\n. Would it not be better to use `//fonts.googleapis.com/css?family=Open+Sans:400italic,400,300,600,700,800` which will load over the protocol of the page?\n. ",
    "mgill25": "Indeed.\n. Indeed.\n. ",
    "dnissley": "My guess is that the page needs a `<base href=\"/subway/\">` element in the head, so all relative paths will be appended to that value.\n. My guess is that the page needs a `<base href=\"/subway/\">` element in the head, so all relative paths will be appended to that value.\n. ",
    "LouisKottmann": "@dnissley I just tried that to no avail.\n\n+1 for help on this issue!\n. @dnissley I just tried that to no avail.\n\n+1 for help on this issue!\n. ",
    "pschichtel": "sure I can\n. should I do this as a wiki page or a similar to gitlab as a bunch of markdown files in a docs folder?\n. @cjb well I don't think that's necessary and there is actually a lot to configure for a proper SSL setup.\nPeople that want to use it with SSL probably know how to configure it.\n. Seems like this disappeared from master\n. no problem, that's why we have git right? :)\n\nI just looked through the project as it became quite active recently and I thought about setting it up again, but could not find my stuff\n. sure I can\n. should I do this as a wiki page or a similar to gitlab as a bunch of markdown files in a docs folder?\n. @cjb well I don't think that's necessary and there is actually a lot to configure for a proper SSL setup.\nPeople that want to use it with SSL probably know how to configure it.\n. Seems like this disappeared from master\n. no problem, that's why we have git right? :)\n\nI just looked through the project as it became quite active recently and I thought about setting it up again, but could not find my stuff\n. ",
    "cjb": "Nice!  Maybe also a working SSL example?\n. Sure, good idea.  Updating the patch.\n. It happens when I join the first channel.  It's a pretty big channel (user list requires scrolling), could that be it?\n. Hm, now Subway keeps jumping back up to an early time in the channel instead of staying at the bottom.  I wonder if that's the same bug.\n. Hi, I saw this again.  I'd just identified with nickserv, and I clicked the close button on the nickserv privmsg window (which didn't make it disappear?) and then the same crash as above for a different channel.\n. And again, another time.  I don't think I was interacting with Subway when it happened this time, was just in response to a new channel message coming in.\n. I guess the good news is that this happens within five mins of me launching Subway, so we aren't going to have problems getting it to reproduce here.  :)\n. Confirmed fixed.\n. Just saw this again :(  Pretty sure it's related to closing a server status window.\n\n```\n/home/ubuntu/subway/node_modules/irc/lib/irc.js:664\n                    throw err;\n                          ^\nTypeError: Cannot call method 'get' of undefined\n    at app.models.Connection.Backbone.Model.extend.addMessage (/home/ubuntu/subway/src/js/models/models.js:98:59)\n    at util.handle_irc (/home/ubuntu/subway/src/js/handle_irc.js:62:16)\n    at Client.<anonymous> (/home/ubuntu/subway/lib/connection.js:69:7)\n    at Client.EventEmitter.emit (events.js:117:20)\n    at /home/ubuntu/subway/node_modules/irc/lib/irc.js:661:22\n    at Array.forEach (native)\n    at Socket.<anonymous> (/home/ubuntu/subway/node_modules/irc/lib/irc.js:655:15)\n    at Socket.EventEmitter.emit (events.js:95:17)\n    at Socket.<anonymous> (_stream_readable.js:746:14)\n    at Socket.EventEmitter.emit (events.js:92:17)\n```\n. I see it's at a different line of code this time (src/js/models/models.js:98) and that line still uses `app.irc.getActiveChannel()`.\n. The missing messages showed up as soon as I hit refresh in the browser, so the clientside websocket communication probably failed somehow.\n. Ah okay, I didn't think I'd had two users logged into Subway (but it's quite possible).\n. Cool, I see.  Are the settings saved anywhere?  If not, should we file a bug to save them?  It looks like they get reset if I just log out of Subway and back in.  (Also saw a UI glitch checking and unchecking actions, but can't reproduce that at the moment.)\n. Sorry, don't understand.  It looks like highlights are working on a regex of the received text.  How do I set up a highlight for someone doing \"/msg cjb hi\", without hardcoding the \"hi\"?  I have highlights for \"cjb: hi\" working, but they don't fire for a privmsg.\n. Sure, I think so -- a /msg is just like an IM, right?  Everyone wants notifications for those.\n. Nice!  Maybe also a working SSL example?\n. Sure, good idea.  Updating the patch.\n. It happens when I join the first channel.  It's a pretty big channel (user list requires scrolling), could that be it?\n. Hm, now Subway keeps jumping back up to an early time in the channel instead of staying at the bottom.  I wonder if that's the same bug.\n. Hi, I saw this again.  I'd just identified with nickserv, and I clicked the close button on the nickserv privmsg window (which didn't make it disappear?) and then the same crash as above for a different channel.\n. And again, another time.  I don't think I was interacting with Subway when it happened this time, was just in response to a new channel message coming in.\n. I guess the good news is that this happens within five mins of me launching Subway, so we aren't going to have problems getting it to reproduce here.  :)\n. Confirmed fixed.\n. Just saw this again :(  Pretty sure it's related to closing a server status window.\n\n```\n/home/ubuntu/subway/node_modules/irc/lib/irc.js:664\n                    throw err;\n                          ^\nTypeError: Cannot call method 'get' of undefined\n    at app.models.Connection.Backbone.Model.extend.addMessage (/home/ubuntu/subway/src/js/models/models.js:98:59)\n    at util.handle_irc (/home/ubuntu/subway/src/js/handle_irc.js:62:16)\n    at Client.<anonymous> (/home/ubuntu/subway/lib/connection.js:69:7)\n    at Client.EventEmitter.emit (events.js:117:20)\n    at /home/ubuntu/subway/node_modules/irc/lib/irc.js:661:22\n    at Array.forEach (native)\n    at Socket.<anonymous> (/home/ubuntu/subway/node_modules/irc/lib/irc.js:655:15)\n    at Socket.EventEmitter.emit (events.js:95:17)\n    at Socket.<anonymous> (_stream_readable.js:746:14)\n    at Socket.EventEmitter.emit (events.js:92:17)\n```\n. I see it's at a different line of code this time (src/js/models/models.js:98) and that line still uses `app.irc.getActiveChannel()`.\n. The missing messages showed up as soon as I hit refresh in the browser, so the clientside websocket communication probably failed somehow.\n. Ah okay, I didn't think I'd had two users logged into Subway (but it's quite possible).\n. Cool, I see.  Are the settings saved anywhere?  If not, should we file a bug to save them?  It looks like they get reset if I just log out of Subway and back in.  (Also saw a UI glitch checking and unchecking actions, but can't reproduce that at the moment.)\n. Sorry, don't understand.  It looks like highlights are working on a regex of the received text.  How do I set up a highlight for someone doing \"/msg cjb hi\", without hardcoding the \"hi\"?  I have highlights for \"cjb: hi\" working, but they don't fire for a privmsg.\n. Sure, I think so -- a /msg is just like an IM, right?  Everyone wants notifications for those.\n. ",
    "hrj": "I experience this too on Chromium 39 + Ubuntu.\n\nBtw, there are quite a few warnings from react:\n\n> Warning: Something is calling a React component directly. Use a factory or JSX instead. See: http://fb.me/react-legacyfactory\n> Warning: React.renderComponent will be deprecated in a future version. Use React.render instead.\n> Each child in an array should have a unique \"key\" prop. Check the renderComponent call using `<undefined>`. See http://fb.me/react-warning-keys for more information.\n. I was able to manage most of the installation issues in OpenShift.\n\nBut I got stuck at one place where bower is getting called when subway is running. This doesn't work well because bower requires write access to directories which are not permitted in OpenShift. After commenting out bower it ran into other errors.\n\nWould be great if someone knowledgeable in nodejs and npm can make it compatible with OpenShift.\n. I experience this too on Chromium 39 + Ubuntu.\n\nBtw, there are quite a few warnings from react:\n\n> Warning: Something is calling a React component directly. Use a factory or JSX instead. See: http://fb.me/react-legacyfactory\n> Warning: React.renderComponent will be deprecated in a future version. Use React.render instead.\n> Each child in an array should have a unique \"key\" prop. Check the renderComponent call using `<undefined>`. See http://fb.me/react-warning-keys for more information.\n. I was able to manage most of the installation issues in OpenShift.\n\nBut I got stuck at one place where bower is getting called when subway is running. This doesn't work well because bower requires write access to directories which are not permitted in OpenShift. After commenting out bower it ran into other errors.\n\nWould be great if someone knowledgeable in nodejs and npm can make it compatible with OpenShift.\n. ",
    "theVDude": "I've gotten the same with +o\n. I've gotten the same with +o\n. ",
    "nibalizer": "Bump\n. Bump\n. ",
    "Palid": "Fixed by: https://github.com/thedjpetersen/subway/pull/358\n. Moved the logic from onKeyUp to onKeyDown - we can prevent the event so browser won't change the focus and modify input's value as supposed. On keyup it wasn't really working as intended.\n. @thedjpetersen I've ammended the commit with your proposed fixes. Ready to merge!\n. Fixed by: https://github.com/thedjpetersen/subway/pull/358\n. Moved the logic from onKeyUp to onKeyDown - we can prevent the event so browser won't change the focus and modify input's value as supposed. On keyup it wasn't really working as intended.\n. @thedjpetersen I've ammended the commit with your proposed fixes. Ready to merge!\n. ",
    "dbkaplun": "@thedjpetersen which standard?\n. @thedjpetersen sorry I was not specific enough!\n\nTOR uses SOCKS, which is a common feature among clients. It would be great if subway also supported this!\n. @thedjpetersen which standard?\n. @thedjpetersen sorry I was not specific enough!\n\nTOR uses SOCKS, which is a common feature among clients. It would be great if subway also supported this!\n. ",
    "Elmit2015": "Assuming you already have node.js, and npm, run:\n1. $ git clone https://github.com/thedjpetersen/subway.git\n2. $ cd subway\n3. sudo npm install\n4. ./subway.js\n   Fetching Subway plugins...\n   Downloading dependencies...\n   Compiling static resources...\n   Running \"clean:0\" (clean) task\n   Cleaning tmp/...OK\n\nRunning \"symlink:main\" (symlink) task\n\n> > Created 5 symbolic links.\n\nRunning \"jade:compile\" (jade) task\nFile \"tmp/index.ejs\" created.\n\nRunning \"react:main\" (react) task\n[react] Compiling src/components/app/messageInput.jsx --> tmp/components/components.js\n[react] Compiling src/components/app/messages.jsx --> tmp/components/components.js\n[react] Compiling src/components/app/userList.jsx --> tmp/components/components.js\n[react] Compiling src/components/menu.jsx --> tmp/components/components.js\n[react] Compiling src/components/settings/general.jsx --> tmp/components/components.js\n[react] Compiling src/components/settings/highlight.jsx --> tmp/components/components.js\n[react] Compiling src/components/settings/plugins.jsx --> tmp/components/components.js\n[react] Compiling src/components/irc.jsx --> tmp/components/components.js\n[react] File tmp/components/components.js created.\n\nRunning \"styl:dist\" (styl) task\n\nDone, without errors.\n\n---\n\nGoto http://xxxx:3000\nI see Connect, Login, Register, Settings\n\nHOW TO USE IT?\nI want to use Freenode, with the nick Abc_123, in the channel #Node.js\n. Assuming you already have node.js, and npm, run:\n1. $ git clone https://github.com/thedjpetersen/subway.git\n2. $ cd subway\n3. sudo npm install\n4. ./subway.js\n   Fetching Subway plugins...\n   Downloading dependencies...\n   Compiling static resources...\n   Running \"clean:0\" (clean) task\n   Cleaning tmp/...OK\n\nRunning \"symlink:main\" (symlink) task\n\n> > Created 5 symbolic links.\n\nRunning \"jade:compile\" (jade) task\nFile \"tmp/index.ejs\" created.\n\nRunning \"react:main\" (react) task\n[react] Compiling src/components/app/messageInput.jsx --> tmp/components/components.js\n[react] Compiling src/components/app/messages.jsx --> tmp/components/components.js\n[react] Compiling src/components/app/userList.jsx --> tmp/components/components.js\n[react] Compiling src/components/menu.jsx --> tmp/components/components.js\n[react] Compiling src/components/settings/general.jsx --> tmp/components/components.js\n[react] Compiling src/components/settings/highlight.jsx --> tmp/components/components.js\n[react] Compiling src/components/settings/plugins.jsx --> tmp/components/components.js\n[react] Compiling src/components/irc.jsx --> tmp/components/components.js\n[react] File tmp/components/components.js created.\n\nRunning \"styl:dist\" (styl) task\n\nDone, without errors.\n\n---\n\nGoto http://xxxx:3000\nI see Connect, Login, Register, Settings\n\nHOW TO USE IT?\nI want to use Freenode, with the nick Abc_123, in the channel #Node.js\n. ",
    "twk3": "Problem re-occurs after npm start, then joining again, but went away after I logged out/logged back into subway.\n. Problem re-occurs after npm start, then joining again, but went away after I logged out/logged back into subway.\n. ",
    "mgj": "Im also receiving this error, frequently, with a default setup\n. Im also receiving this error, frequently, with a default setup\n. ",
    "crivetimihai": "I have encountered the same issue connecting to a private IRC daemon.\n\n# Actual result:\n- Subway crashes with /opt/dockerapp/node_modules/irc/lib/irc.js:682 TypeError: Cannot call method 'set' of undefined\n\n# How to reproduce:\n1. Install a IRC daemon - such as: carver/ngircd\n2. Install subway\n3. Log into subway\n4. Connect to the private IRC server (just provide the IP, nick and port)\n\n# Logs\n\n## server.js\n\n```\nDone, without errors.\n17 Jul 21:59:42 - SEND: NICK test\n17 Jul 21:59:42 - SEND: USER subway 8 * :nodeJS IRC client\n{ prefix: 'irc.example.net',\n  server: 'irc.example.net',\n  command: 'rpl_welcome',\n  rawCommand: '001',\n  commandType: 'reply',\n  args:\n   [ 'test',\n     'Welcome to the Internet Relay Network test!~subway@172.17.42.1' ],\n  client_server: '192.168.0.5' }\n\n/opt/dockerapp/node_modules/irc/lib/irc.js:682\n                    throw err;\n                          ^\nTypeError: Cannot call method 'set' of undefined\n    at util.handle_irc (/opt/dockerapp/src/js/handle_irc.js:167:14)\n    at Client.<anonymous> (/opt/dockerapp/lib/connection.js:81:7)\n    at Client.emit (events.js:117:20)\n    at /opt/dockerapp/node_modules/irc/lib/irc.js:679:22\n    at Array.forEach (native)\n    at Socket.<anonymous> (/opt/dockerapp/node_modules/irc/lib/irc.js:673:15)\n    at Socket.emit (events.js:95:17)\n    at Socket.<anonymous> (_stream_readable.js:748:14)\n    at Socket.emit (events.js:92:17)\n    at emitReadable_ (_stream_readable.js:410:10)\n```\n\n# Assumptions\n- https://nodejs.org/api/events.html#events_class_events_eventemitter\n- See also: https://github.com/martynsmith/node-irc \"Helps it keeps crashing\"\n\nThanks!\n. I have encountered the same issue connecting to a private IRC daemon.\n\n# Actual result:\n- Subway crashes with /opt/dockerapp/node_modules/irc/lib/irc.js:682 TypeError: Cannot call method 'set' of undefined\n\n# How to reproduce:\n1. Install a IRC daemon - such as: carver/ngircd\n2. Install subway\n3. Log into subway\n4. Connect to the private IRC server (just provide the IP, nick and port)\n\n# Logs\n\n## server.js\n\n```\nDone, without errors.\n17 Jul 21:59:42 - SEND: NICK test\n17 Jul 21:59:42 - SEND: USER subway 8 * :nodeJS IRC client\n{ prefix: 'irc.example.net',\n  server: 'irc.example.net',\n  command: 'rpl_welcome',\n  rawCommand: '001',\n  commandType: 'reply',\n  args:\n   [ 'test',\n     'Welcome to the Internet Relay Network test!~subway@172.17.42.1' ],\n  client_server: '192.168.0.5' }\n\n/opt/dockerapp/node_modules/irc/lib/irc.js:682\n                    throw err;\n                          ^\nTypeError: Cannot call method 'set' of undefined\n    at util.handle_irc (/opt/dockerapp/src/js/handle_irc.js:167:14)\n    at Client.<anonymous> (/opt/dockerapp/lib/connection.js:81:7)\n    at Client.emit (events.js:117:20)\n    at /opt/dockerapp/node_modules/irc/lib/irc.js:679:22\n    at Array.forEach (native)\n    at Socket.<anonymous> (/opt/dockerapp/node_modules/irc/lib/irc.js:673:15)\n    at Socket.emit (events.js:95:17)\n    at Socket.<anonymous> (_stream_readable.js:748:14)\n    at Socket.emit (events.js:92:17)\n    at emitReadable_ (_stream_readable.js:410:10)\n```\n\n# Assumptions\n- https://nodejs.org/api/events.html#events_class_events_eventemitter\n- See also: https://github.com/martynsmith/node-irc \"Helps it keeps crashing\"\n\nThanks!\n. ",
    "BehroozWolf": "Well, I start the subway in shell then and i connect the server until here everything okay. BUT when somebody or i part any chanell or quit the server, subway shut down. I have to start again. I mean is there any bug or something? Centos 5.11 and ircd: Unreal3.2.10.4\n. Well, I start the subway in shell then and i connect the server until here everything okay. BUT when somebody or i part any chanell or quit the server, subway shut down. I have to start again. I mean is there any bug or something? Centos 5.11 and ircd: Unreal3.2.10.4\n. ",
    "astorije": "Thanks!\n. Thanks!\n. "
}