{
    "1N3": "WhatWeb is already added to the project. Were you looking for something else?\n. I'll look into adding some HTML reporting capabilities. It's a good idea. \n. This is now implemented via the 'sniper loot' command which will convert all reports to html which can be loaded in a browser from /usr/share/sniper/loot/reports/ directory. . Awesome, thanks!\n. Hi, the quickest way would probably be to clone to a new directory and re-run the install.sh. Basically a re-install but I'll see if I can allow more dynamic updates going forward.\n. Hi, will look into how to add support for this in future releases.\n. thanks! merged.\n. Hi, I just checked in a fix for this in the latest master repo. Should work if you re-download and run install.sh. \n. thanks for the heads up. Changes have been checked in for v1.4d!\n. Thanks! this is fixed in 1.4e.\n. Thanks! this is fixed in 1.4e.\n. Fixed! thanks for the heads up!\n. Hi, closing this out as sniper already runs nikto, arachni and a bunch of other automated web tools. I don't think adding more tools/programs will improve overall output at this point, so going to close out for now. Thanks for the suggestion. . Thanks for the feedback. This should be fixed in the latest version.\n. Thanks for the heads up. This is fixed in v1.4g.\n. Are you running the latest Sn1per version? 1.5a? If so, did you run the install.sh script? There was some changes to BruteX that were recently updated so re-running the install.sh should clean up the issue. Let me know.\n. Thanks for the heads up.. did you by chance run the install.sh script?\n. I fixed some options in the setup.sh to install theHarvester but let me know if this is still an issue.\n. I put in a fix for #2 and #3 which should allow you to run your scans. I'll need to look into compatibility issues with Ubuntu though as Sn1per was made primarily for Kali Linux.\n. You can now run a docker container from any Linux flavor (Check the main project README...) in order to run sniper which should solve your issue. Closing out for now, but let me know if you're still having issues getting it to run. . cheers!\n. Thanks for the heads up.. I added an option in setup.sh to install shodan and enter the API key. Should be good now.\n. Thanks. Added a fix in 1.5b.\n. Thanks, this is fixed in 1.5d.\n. Thanks, this is fixed in 1.5d.\n. Thanks, this was a mistake so I removed the module/code here.\n. Hey thanks for the feedback. EyeWitness is already on the roadmap to add in and I like the idea of the sub-directories for each scan/target. I'm also going to look into how to utilize this better for internal recon and scanning.\n. @morganh83 Sn1per includes the ability to disable brute forcing, google hacking queries and full nmap port scanning in the sniper script itself (see below). Simply change the settings for each from 1 to 0 to enable/disable. Eventually, I'll add more robust options for other toolsets, but this should help you out for now. \n```\nENABLE/DISABLE AUTOMATIC BRUTE FORCE\nDEFAULT IS \"1\" (ENABLED)\nAUTOBRUTE=\"1\"\nENABLE/DISABLE FULL DETAILED NMAP SCAN\nDEFAULT IS \"1\" (ENABLED)\nFULLNMAPSCAN=\"1\"\nENABLE/DISABLE AUTOMATIC GOOGLE HACKING QUERIES\nDEFAULT IS \"1\" (ENABLED)\nGOOHAK=\"1\"\n```. This is fixed now. Closing out. \n. Please provide some further technical details here to troubleshoot.\n. Fixed this in 1.6d. Thanks for the heads up!\n. Thanks for the heads up! merging into the next release.\n. Checked in the fix in 1.6d!\n. Cool. Will look into this.. \n. Thanks for the heads up. I checked this out but it seems to break the .xml parser in Sn1per... To remedy, I've updated the NMap scan options to do more aggressive scans and narrowed the port range to only the targeted ports used by Sn1per. This should decrease scan time significantly.\n. Yes, actually, I'm thinking the next version will automatically include a masscan full port scan to help speed up things and I'm definitely looking at getting some sort of async XML port scan working to speed up the port scan functions. I should have a new release ready soon.\n. Nice man, good stuff and thanks for the feedback! \n. Thanks, will fix this.\n. Fixed in 1.6e! Cheers!\n. hey, thanks for the feedback and suggestions... I like the idea of the client/server model, but this will obviously take some time to develop. I'll leave this open in the meantime and see what can be done here in the future. :) \n. As much as I would like to implement a more robust model for sniper, I think at this time, development will take too long and add too much complexity to an already simplified process. As sniper grows and matures, this may be something we pursue more, but for the time being, I'm gonna close this out.. Hi, are you running as root? If not, try running as root and be sure to run the ./install.sh script first before running sniper for the first time. \n. Thanks. I updated the code in 1.8a which is now public! \n. Hmm.. interesting. They must have changed some things in Kali rolling that's causing this. I'll try to install it at some point to test and see if I figure out what's happening. Thanks for the heads up. \n. Still looking into this. Will keep you posted.\n. @rfare thanks for your help! This is fixed in 1.8b.\n. Thanks for the updates/fixes!\n. Hi, thanks for the heads up.. I'll look into fixing the install.sh script in the next release. \nRegarding the reports, the script saves 2 files under the loot directory under console/ and reports/. Both are just a stored console log from the output generated from the script. To view reports, you can run 'sniper loot' and it will automatically open the loot directory and allow you browse/view the reports from each scan and screenshots. \nIf you're looking for something else with the reports, let me know. I have future plans to improve the reporting options to include HTML output/formats, but that will take some time.\nCheers,\n1N3\n. Looks like a firewall has blocked you or port 443/tcp is no longer open. In most cases, it should continue to run if the port is closed, but if the firewall blocks you mid-scan, it could cause the script to hang. Since MassBleed relies on sslscan, you could also just run 'killall sslscan' to kill it which will continue with any remaining tests. I'll see what I can do to fix this in the meantime.\n. no prob!\n. Thanks for the heads up! I will update this in the next release sometime in the next day or so.\n. Regarding PHP on Ubuntu 16, I'll probably need some time to figure out the best solution but I'll keep around for reference to fix. \n. Cool, good to know. I'm working on adding various OS flavors to the install options, so I could probably make an Ubuntu specific install to pull the package and install it automatically for Ubuntu users.\n. Cool man. Let me know and I will link it in the main project page for people.\nI'm thinking about scaling back the 3rd party tools/dependencies and limiting the core packages to just the main ones to make it easier to install across various distros. That will take some time though. \n. Nice man! Will check this out and keep you posted!\n. Hey man, thanks for your help with this. I was able to test it on a fresh Ubuntu 16.04 install and everything works great but I am getting some errors below. The 'nslookup' thing should be easy to fix. I can add that to the install.sh. \nNot sure what's going on with the Metasploit error but it would be nice to get that working as well. \nThe other errors are less critical but I noted them below. I also added the docker links to the README.md file on the main project page. Let me know if you're able to figure out the Metasploit thing though. It might be a bug with Ubuntu but I'm only speculating.\n/usr/bin/sniper: line 431: nslookup: command not found\n/usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/bcrypt-3.1.11/lib/bcrypt.rb:16:in require': incompatible library version - /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/bcrypt-3.1.11/lib/bcrypt_ext.so (LoadError)\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/bcrypt-3.1.11/lib/bcrypt.rb:16:inrescue in '\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/bcrypt-3.1.11/lib/bcrypt.rb:12:in <top (required)>'\n    from /usr/share/metasploit-framework/lib/metasploit/framework.rb:9:inrequire'\n    from /usr/share/metasploit-framework/lib/metasploit/framework.rb:9:in <top (required)>'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/database.rb:1:inrequire'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/database.rb:1:in <top (required)>'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/parsed_options/base.rb:17:inrequire'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/parsed_options/base.rb:17:in <top (required)>'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/parsed_options/console.rb:2:inrequire'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/parsed_options/console.rb:2:in <top (required)>'\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/activesupport-4.2.7/lib/active_support/inflector/methods.rb:263:inrequire'\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/activesupport-4.2.7/lib/active_support/inflector/methods.rb:263:in const_get'\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/activesupport-4.2.7/lib/active_support/inflector/methods.rb:263:inblock in constantize'\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/activesupport-4.2.7/lib/active_support/inflector/methods.rb:259:in each'\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/activesupport-4.2.7/lib/active_support/inflector/methods.rb:259:ininject'\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/activesupport-4.2.7/lib/active_support/inflector/methods.rb:259:in constantize'\n    from /usr/share/metasploit-framework/vendor/bundle/ruby/2.3.0/gems/activesupport-4.2.7/lib/active_support/core_ext/string/inflections.rb:66:inconstantize'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/command/base.rb:73:in parsed_options_class'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/command/base.rb:69:inparsed_options'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/command/base.rb:47:in require_environment!'\n    from /usr/share/metasploit-framework/lib/metasploit/framework/command/base.rb:81:instart'\nTraceback (most recent call last):\n  File \"bin/samrdump.py\", line 159, in \n    logger.init()\nAttributeError: 'module' object has no attribute 'init'\ncutycapt: cannot connect to X server\n. Nice man. I checked again and everything's working good now! 👍 \n. Awesome man! Good stuff!. Hey @menzow, when you have a chance, can you take a look at https://github.com/1N3/Sn1per/issues/55 ? If you're able to assist, that would be great but no worries if you can't... ;)  . Thanks @menzow. I'll let him know!. Gonna close this out for now to clean up the backlog... . thanks for helping @menzow! \n@mehranexpert did you run the install.sh script first before running by chance? It looks like the /usr/share/sniper/loot/nmap/ directory doesn't exist. Can you verify? ie. ls -lh /usr/share/sniper/loot/\nThis should have been created during install, so curious to know if you did in fact run it already or not.. \n. Hi, which version of sniper are you running? Also, be sure that the contents of dvrsvr.txt contains either a domain or IP address separated by a new line (ie. don't include URL's like http://site.com, etc.). \n. I would first clone the latest github release: \"git clone https://github.com/1N3/Sn1per\" and run the install.sh (./install.sh) after. Once complete, just use \"sniper \" to scan a single host. \nThe text files should only be used when scanning multiple hosts separated by a new line with airstrike and nuke modes. You'll also need to set the full path to the text file for this to work (ie. sniper /usr/share/sniper/loot/ips.txt airstrike) etc.\nHope that helps.. looks like you're missing some directories under the loot dir.... try running the following to fix:\nmkdir -p /usr/share/sniper/loot 2> /dev/null\nmkdir /usr/share/sniper/loot/domains 2> /dev/null\nmkdir /usr/share/sniper/loot/screenshots 2> /dev/null\nmkdir /usr/share/sniper/loot/nmap 2> /dev/null\nmkdir /usr/share/sniper/loot/reports 2> /dev/null\nmkdir /usr/share/sniper/loot/output 2> /dev/null\n. no prob man. . Thanks for the heads up! This is fixed in 2.3 and pushed to the main branch.. Cool, thanks again.. Just fixed in v2.3a.. This is normal except for having to re-launch firefox each time. The cause for this is usually closing the initial firefox window too early before it loads the other tabs.\nBasically, try re-running again but let firefox load completely first (it will load a blank page to start which is normal). There's a short delay after but it should load a few tabbed windows with results. There's 2 parts to the script here, so there's a small delay again which will load the remaining firefox tabs. After everything is loaded and you've reviewed the results, you can just close the main firefox program to quit.\nHope that helps.\n. Closing out for now. Let me know if you need anything else.. Which OS are you running?. @OMarciano were you still having issues with this? Did the suggestions by @menzow help?. hi, target definitions can't include protocols (ie. http/https). Instead, just use the hostname/IP. That should solve the issue, but let me know if that doesn't work. . can you paste the new output? . hey guys, I think this might be worth the effort to include support for Ubuntu specifically in addition to Kali out of the box. Since Sn1per is now included as part of PTF (Penetration Tester's Framework by TrustedSec), one of their original requests was to have a compatible Ubuntu installer. It also seems to be a common request/issue from various users running Ubuntu specifically, so I think it might be worthwhile (though, I'm a fan of docker for these things as well...). I'll leave this open as a future enhancement request, but  it may take a little time to rewrite it and test since I've been pretty busy lately. . Gonna close this out for now as sniper runs great in docker and due to dependencies of various OS flavors, it would take away from core development of features to make sniper more effective. Currently, sniper is mainly written for Kali Linux and Debian and docker can be used to run sniper from any other OS which seems like the easiest and best solution. . This should be fixed now but feel free to re-open if the issue still exists. . The web vulnerability scan does some google hacking using GooHak (https://github.com/1N3/Goohak/blob/master/goohak). See source code for details on what it's querying. \nI will check in a feature shortly to disable GooHak in the Sn1per options which should help in your case.. No prob and thanks for the feedback. I released v2.4 which includes an option to disable Google hacking queries in the main sniper script. Just set GOOHAK = \"0\" to disable and you should be all set.. Thanks for the heads up! Fixed in v2.4b which is now pushed to the master branch. . Thanks for the feedback. I will definitely look into this over the next week or two to implement as I've been meaning to do the same for a while now. I'll keep you posted.. I changed discovery scans to now do a full sniper scan in v2.5. I will eventually add a configurable option to discovery scans to specify either stealth, normal or web modes but for now, this should do what you want. . This is fixed in v2.4c. It should strip all $TARGETS with http:// https://. . I added an init function at the top of the script to init the loot directory every time sniper runs. Should be fixed now in 2.4c. . Cool man, I'll check it out! 👍 . Will look into changing this in the next release. . This is fixed in v2.4e which is pushed to the master branch. . This is fixed in 2.4d which is now in the master branch. . Thanks for the heads up! This is fixed in 2.4d. I fixed the install.sh script. . Will look into this but currently sniper only supports the full report path, so you would have to type out or tab complete /home/user/scanme.txt for now. . Thanks for the heads up! I will definitely fix this in the next release.. This is fixed 2.5a which is currently released. . Hey guys, thanks for the feedback and suggestions... This is definitely on the road map to work on so I'll keep this open until that work is done.. Hi, Sn1per Professional and Sn1per Community Edition 5.0 have been released which save the output of several tools to the workspace directory (/usr/share/sniper/loot/). Sn1per Professional, which is available from the xerosecurity.com website (https://xerosecurity.com) takes this a step further by providing a GUI interface with the scan results to easily parse through each host. This should help finding the data you want more easily. Let me know if you have any questions. . Hi, thanks for the feedback here. Setting RHOSTS and RHOST together should still make the exploit run, you'll just get an error if the script doesn't accept the parameter. I will look into cleaning this up though in a future release.. Closing this out for now as Sn1per currently sets both RHOST and RHOSTS variable for metasploit. The warnings received should not affect functionality of any exploits as long as one of the variables is set correctly. . cool, thanks for the heads up. I may put this in the install.sh going forward to prevent this. . Thanks for the feedback. I added auto updates to the script which is now public in v2.5a. . As @menzow suggested, there's some variables in the sniper script to set the users, passwords and domains referenced below:\nUSER_FILE=\"/usr/share/brutex/wordlists/simple-users.txt\"\nPASS_FILE=\"/usr/share/brutex/wordlists/password.lst\"\nDNS_FILE=\"/usr/share/brutex/wordlists/namelist.txt\"\nYou can change these to whatever you want to use. \nAlso in BruteX which installs by default when installing sniper, you can set the following variables in /usr/share/brutex/brutex:\nFTP_USER_PASS=\"/usr/share/brutex/wordlists/ftp-default-userpass.txt\"\nMYSQL_USER_PASS=\"/usr/share/brutex/wordlists/mssql-default-userpass.txt\"\nORACLE_USER_PASS=\"/usr/share/brutex/wordlists/oracle-default-userpass.txt\"\nPOSTGRES_USER_PASS=\"/usr/share/brutex/wordlists/postgres-default-userpass.txt\"\nWINDOWS_USER_LIST=\"/usr/share/brutex/wordlists/windows-users.txt\"\nUSER_FILE=\"/usr/share/brutex/wordlists/simple-users.txt\"\nPASS_FILE=\"/usr/share/brutex/wordlists/password.lst\"\nDNS_FILE=\"/usr/share/brutex/wordlists/namelist.txt\"\nSNMP_FILE=\"/usr/share/brutex/wordlists/snmp-strings.txt\"\n. Closing this out for now, but let us know if this works or not. . This is fixed in 2.5a which is now public.. This is fixed in 2.5a which is now public.. This is fixed in 2.5a which is now public.. hey, thanks for the feedback. I'll look into this.. . I believe this was resolved in the latest version of sniper. If you're still having probs, feel free to reopen. . Hey, just a heads up, I had to role back the changes of the merge since I was having issues getting it to work on my system. I will investigate further as running the commands manually seemed to work fine for me, just not as part of the script.. I should be able to figure it out, but it may take a day or two to figure out and repush the pull request. Thanks for the effort here though and I like the solution. . Getting the following error on my system when I run it from the script:\n$ vim ~/ips.txt and add two IP's\n$ sniper ips.txt nuke\ncat: /usr/share/sniper/ips.txt: No such file or directory\nFor some reason, $(realpath ips.txt) is returning /usr/share/sniper/ as the real path, even though it's actually ~/ips.txt. \nAny ideas? I assume it works for you?. yeah, I totally agree. I'll work on implementing this in the next release. Thanks for the feedback!. I changed the update function in the latest version (2.5e) to display a message to inform the user if an update is available and users can now update sniper via the 'sniper update' command.. hey, thanks for the feedback. I like the idea and will work on this in a future release.. This is definitely on my list of things to do eventually, so I will leave this open to track this. Thanks for the feedback.. Hi, I added two new modes to sniper called 'webporthttp' and 'webporthttps' to run full web application scans against non-standard ports (ie. sniper 127.0.0.1 webporthttp 8080). This is a shorter term workaround but it should get the job done until there is more dynamic detection of web services. Closing out for now but this is definitely something I will be looking at in the future.. Thanks for the suggestion. I implemented the fix in v2.5e which is now public!. Thanks for the heads up! This is fixed in the v2.5e which is now public. . sniper nuke and airstrike modes were created to scan a list of IP's from a text file (ie. sniper /full/path/to/target.txt nuke). Just create a new .txt with IP's or domains separated by a new line and it should work. . airstrike mode runs a stealth scan which is basically a simple surface scan.\nnuke mode will run all standard sniper tests for each IP/domain in the text file. \nHave you tried nuke mode?\nThe only thing nuke mode doesn't currently do is the 'web' mode scan of websites. However, it still does the nikto/whatweb scans, etc. that the normal sniper scan does. \nLet me know if that works or if you're looking for something more for this. . I believe there was some minor bugs with the airstrike mode that may have caused this. My suggestion is to try downloading the latest version (3.0) from github and try again (ie. sniper /path/to/targets.txt airstrike or sniper /path/to/targets.txt nuke) to scan multiple IP's/hosts. \nRegarding the report output, I'm looking at better ways to format reporting and findings but at this time, it is difficult to parse various tool outputs for consistent report so this may be difficult. Perhaps over time as sniper matures, new features will be added for better reporting of vulnerabilities discovered.. I believe this has been implemented/pushed  to the main branch already so closing out for now. Thanks for the pull request btw. . I will look into this.. Changes merged.. Changes merged.. Thanks, I will look into this.. Changes merged.. Changes merged.. Thanks man! appreciate the pull request for this... I've been super busy lately and haven't had a lot of time to implement changes and fixes. This is now merged into the master branch. . Hi, there's actually already an update option via the 'sniper update' command. I added more documentation for this under the README page to help document it better.. hey, thanks for the feedback and glad you like the tools. I can definitely look into this but it will require some work to implement properly. I'll leave this open while I look into the options. privoxy and proxychains should be able to proxy the traffic through TOR or some other proxy pretty easily.. This is a duplicate of https://github.com/1N3/Sn1per/issues/7. Closing this bug out.. Hey, thanks for the heads up... looks like there was a error in the Blackarch checks that were added so I've went ahead and fixed those. Can you check the latest public release and let me know if that works for you?. Hi, there were some bugs that were fixed in the latest version. To fix, you'll need to git clone sniper into a new directory and run ./install.sh to re-install. These errors should go away after. . Just re-ran the latest install.sh script for Sn1per v4.0 on Kali 2.0 rolling and everything installed without error. If you're running any other Linux flavor, I'd recommend running the docker container for sniper instead as this will work on all platforms. . Hi, the 'sniper nuke' is used to scan multiple IP's or domains so the $TARGET value is actually the full path to a file that contains multiple IP's or domains separated by new lines. If you want to run all tests, sniper  will do the job. For web applications, sniper  web will do a full web scan.\nHope that helps.\n-1N3. hey, sorry for the delay here.. I've published a new release of sniper to fix the syntax errors you noted and others that I found. Can you try running 'sniper update' to see if that resolves the problem?. I located the issue with the 'update' command which is fixed in 2.7. To fix, you will need to do a git clone of sniper into a fresh directory and run install.sh to update. That should fix a lot of errors in the previous version but let me know if you run into anything else.. awesome man, glad to hear it!. This was an issue in one of the last releases which has since been fixed. To fix, you'll need to git clone sniper into a new directory and re-run ./install.sh to re-install the latest version. Thanks for the feedback! 👍 . hmm.. yeah, it might be causing some instability due to the amount of traffic/packets being sent. Hard to say what's causing this... I use VPN as well but don't have this. . Hi, CMSMap with the base install seems to be working for me. . Tried updating CMSmap manually and got this error:\n[-] Date & Time: 07/01/2018 15:34:37\n[-] Updating CMSmap to the latest version from GitHub repository... \nAlready up-to-date.\n[-] CMSmap is now updated to the latest version!\n[-] Downloading wordpress plugins from svn website\n[-] 71922 plugins found\n[-] Wordpress Plugin File: /usr/share/sniper/plugins/CMSmap/data/wp_plugins.txt\n[-] Downloading WordPress plugins from ExploitDB website\nTraceback (most recent call last):\n  File \"./cmsmap.py\", line 2003, in \n    initializer.UpdateRun()\n  File \"./cmsmap.py\", line 46, in UpdateRun\n    self.GetExploitDBPlugins(self.wp_exploitdb_url, self.wp_plugins_small, 'Wordpress', 'wp-content/plugins/(.+?)/')\n  File \"./cmsmap.py\", line 142, in GetExploitDBPlugins\n    htmltext = urllib2.urlopen(self.exploitdb_url).read()\n  File \"/usr/lib/python2.7/urllib2.py\", line 154, in urlopen\n    return opener.open(url, data, timeout)\n  File \"/usr/lib/python2.7/urllib2.py\", line 435, in open\n    response = meth(req, response)\n  File \"/usr/lib/python2.7/urllib2.py\", line 548, in http_response\n    'http', request, response, code, msg, hdrs)\n  File \"/usr/lib/python2.7/urllib2.py\", line 467, in error\n    result = self._call_chain(args)\n  File \"/usr/lib/python2.7/urllib2.py\", line 407, in _call_chain\n    result = func(args)\n  File \"/usr/lib/python2.7/urllib2.py\", line 654, in http_error_302\n    return self.parent.open(new, timeout=req.timeout)\n  File \"/usr/lib/python2.7/urllib2.py\", line 435, in open\n    response = meth(req, response)\n  File \"/usr/lib/python2.7/urllib2.py\", line 548, in http_response\n    'http', request, response, code, msg, hdrs)\n  File \"/usr/lib/python2.7/urllib2.py\", line 473, in error\n    return self._call_chain(args)\n  File \"/usr/lib/python2.7/urllib2.py\", line 407, in _call_chain\n    result = func(args)\n  File \"/usr/lib/python2.7/urllib2.py\", line 556, in http_error_default\n    raise HTTPError(req.get_full_url(), code, msg, hdrs, fp)\nurllib2.HTTPError: HTTP Error 403: Forbidden\nLooks to be a bug in the update process so suffice to say, it seems that running the base install from github is the way to go until this is fixed. Closing this out for now but let me know if you still need help with this. . Hi, this is actually already built into the latest sniper version 2.8 but I like the idea of the sniper 'support' command too. I may add a new alias for that but let me know if that doesn't work for you. The syntax is either sniper help or sniper --help.. Hi, thanks for the heads up. This is definitely a known issue I've been meaning to find a solution to due to the way hydra handles/tests basic authentication against sites that do not have basic auth enabled. I may disable basic auth checks or use another tool but will leave this open in the meantime. . Closing this out as this seems to be resolved.. Hi, \nThe correct command to scan multiple hosts is via the 'airstrike' and 'nuke' modes only. This is done via 'sniper /root/targets.txt airstrike/nuke' command. The normal sniper mode is to scan a single host only.. cool, glad you got it.. . Hi, wpscan is already integrated with sniper via the 'web' mode. To test, run 'sniper target.com web'. . it should run wpscan once if port 80 is open and again if port 443 is open... alternatively, you could just run sniper  webportonly 80 to just do a webscan on port 80/tcp. Let me know if that makes sense or if I'm missing something.. Hey, thanks for the heads up... I did notice this myself and will be putting in a fix for this in the near future. I'll leave this open for the time being. . I removed the automatic loot command at the end of the scans in v2.9 which is now available. I definitely want to incorporate a legit a command switch parser with the options suggested by @menzow but that will take a bit more time. Hopefully that works for you in the meantime. . In the process of adding this to the main sniper build, but in the meantime, you can run the below commands to remove sniper:\nrm -Rf /usr/share/sniper/\nrm -f /usr/bin/sniper. hmm.. it should run fine on Debian in theory since everything uses apt to install/update. If you have any errors, I can definitely take a look but as it stands currently, the script has only been tested on Kali Linux and Ubuntu mostly.. I see the xdg-open errors which is a change I will be making in the next version. The default browser going forward will just be firefox.\nI would need to see the full output of running ./install.sh and a sample sniper scan to troubleshoot all issues but I totally understand if you don't have that or can't provide the entire log. \n. Thanks for the feedback and video... I see a few errors that should be fixed in the latest version (v2.9) which is now available. I still noticed some gem install errors in the install.sh that I don't know the cause of but will keep this open to track the issues. I also added an uninstall.sh script to make removal a bit easier. . hey, not sure if I'll have a fix for this anytime soon. The only official supported platform is currently Kali Linux. Outside of this, all other OS's would be more beneficial to use docker instead as it will run on any linux distro.. Currently, CentOS is not supported officially. We recommend using Kali Linux until we have official support for other OS flavors. Gonna close out for now as Kali Linux does not appear to have this issue. . Thanks for the heads up... I believe this was an issue that was fixed with 2.9. Glad to hear that it's working now.. I have similar plans to implement dependency checking in future versions of sniper, so I'll leave this open in the meantime. I can easily add the 'support' command to the next version though. . Hey Cegi, Firefox is used to view workspaces in sniper and launch google hacking queries. This is done via apt-get install firefox so depending on which distribution you're running, it may not have the latest version of firefox available unless you have optional repos enabled via /etc/apt/sources.list. I can try to find alternative solutions for this but I'm not sure how to get around this at this time. Perhaps additional checks for already installed packages would help, but that will require quite a few code changes to implement fully.. Closing this out for now until a more permanent solution is found. Until then, review install.sh and remove apt-get install firefox to avoid this if you are running newer versions of firefox.. Hi, This feature is still present but manually done via the 'sniper loot' command. I did this to allow more automation and streamlined function without user intervention. Let me know if that works.. @pentester123 you ran the 'sniper loot' command? What was the output? I've just tested this on the latest version and it prompts me where to save the files. Let me know if that is not the case.. agreed. . Cool, thanks for the heads up and fix here.. I believe you need to start the MSF DB: msfdb start. Closing out for now. Feel free to re-open if that doesn't work. . Cool, glad to hear. I will be putting in a check/fix for this to make sure the DB is started after running the 'loot' command. . Thanks, I will take a look. It may just be that the sniper script didn't get copied to /usr/bin for some reason.. . I believe this should be fixed now in 4.0. I did re-run sniper --update from 3.0 -> 4.0 and everything appears to have upgraded as expected on Kali 2.0. Closing out for now but let me know if you run into anything else.. Thanks for the heads up. This was removed from 3.0 for efficiency and redundancy reasons since sslyze and sslscan already cover most of the tests for SSL/TLS much quicker. I will update the release notes in the next version with this info though.  . I'll take a look at this... I believe I already have code to do this but for some reason, it never made it into the public release.. This is getting fixed in the next release. . This should also be fixed in v4.0. Closing out for now. . This is something I've wanted to add for a while, but currently, sniper only supports txt and html output via the 'sniper report/loot' commands. Adding PDF support is rather easy but RTF/Docx support I'm not sure about. I'll leave this open in the meantime but this is definitely something I would like to see in future releases.. I don't manage the docker images but you can open an issue here https://github.com/menzow/sn1per-docker and see if there's anything @menow can do. I think this is due to the extensive plugins required by Sn1per to run, so there may not be a great solution. I may develop a sniper \"light\" version that will only use core Kali tools, but that will take some time.. Thanks for the feedback. The next release of sniper will offer lots of versatility on what scan options you want to select and use and which ones you don't. I should be able to add an option exclude any of the intrusive scan checks from MSF along with that.. No prob! Next release should be ready in the next week or two.. . Thanks for the heads up... I'll look into fixing this in the next release.. This is fixed in v4.0 which is now in the master branch. . strange... I'll take a look at this but throughout the scan, a global var of $TARGET is used and passed to all tools so I'm not sure what could have caused this. . Hi, figured out that this is caused by doing IP reverse lookups via the 'host' command. This is normal and the message here is stating that the reverse IP lookup for 127.0.0.1 is a pointer to 'localhost'. Gonna close this out for now but hope that helps.. Hi, The syntax is:\nsniper 172.17.0.6 report\nAfter, the report will be located under /usr/share/sniper/loot/. . thanks for the heads up. I fixed this in v4.1 which is now in the master branch. To fix, I'd do another git clone and re-run install.sh.. whoops.. my bad! You will need to do a manual git clone https://github.com/1N3/Sn1per and re-run install.sh. I won't be pushing 4.1 until I have more fixes/updates to include.. Just uploaded v4.1. You should be able to upgrade using sniper -u now.. hey, in sniper v4, single target scans can use the following with all modules enabled:\nsniper -t target_ip --osint --bruteforce --recon --fullportonly -w workspace_alias\nNuke and airstrike are specifically for scanning multiple hosts where nuke basically runs all scan options on all hosts and airstrike is basically a stealthier/light scan of all hosts. I can look into adding specific options for each mode but alternatively, you could also create a file with the sniper specific flags/modes you want to run via a bash script to accomplish this. \n```\n!/bin/bash\nsniper -t target.com --osint --bruteforce --recon --fullportonly -w target\nsniper -f targets.txt -m nuke\n...\n...\n```. Yeah, so I think what's happening is that sniper uses whatever NMap XML files are in the workspace directory (ie. /usr/share/sniper/loot/workspace/alias/nmap) and imports all XML files into metasploit's workspace which uses the same name. Kind of confusing but essentially, metasploit must have historical scan data for that workspace alias even though the sniper scan did not go through and actively scan the host again. \nThe fix is simple though. The workspace switch (sniper -w alias_name) should be new/unique if you want a fresh workspace. Otherwise, it will combine whatever is scanned into the workspace specified even if it already contains old/past scan data. This will create a new sniper workspace and also a new Metasploit workspace with the same name if that makes sense.\nsniper -w domain_alias -t target.com . The changes were pushed to master but I can't update the version yet as people will get bombarded with autoupdate notifications everytime they run... Once I push 4.1 branch, I'll update the version info to reflect the changes. . Hey, congrats with the new role. Feel free to send any pull requests for any blackarch integration you want to include (assuming it doesn't affect existing Kali functionality/integration, etc. of course. I'm definitely open to having support for other OS's is people are willing to contribute the code to make it happen.. which distro are you installing from?. ah! yeah, unfortunately, as of right now, sniper is only officially supported on Kali Linux. The package dependencies vary greatly from Kali to Ubuntu, so it's a little tough keeping the dependencies in line. I would like to add Ubuntu support eventually but in the meantime, docker is the only real solution to run from other distros. There's instructions to run from docker in the README if you're interested. Just keep in mind that the docker image isn't always up to date with the latest sniper release so you may need to wait for 4.0 via docker until @menzow can build the new image.. No prob! The install.sh has all of the required dependency packages. You can use that as a reference which should be everything you'll need. If not, let me know.. Ubuntu and other Linux distros sometimes use different names for the same packages in some cases. I believe in other cases, the packages are just plain not available under Ubuntu without 3rd party repos, etc.. yeah, best bet is running the ./uninstall.sh script in the sniper directory which should remove everything installed by sniper.. Sorry, this was a bad merge.. It should be fixed in 4.3 which is now available.. yeah, totally agree.. I'll keep this open.. it should be fairly easy to implement.. Thanks for the heads up.. I'll take a look.. Strange.. I'll take another look.. Okay, think I've found the bug. I will release a fix for this in the next update coming by end of month.. Hi, \nThis issue should be fixed in Sn1per v5.1 which is now public. Please update and let me know if this is still an issue. Closing out but will re-open if needed.. This was a result of a bad merge in 4.1. I fixed the first issue in 4.3 which is now available. You should be able to run sniper -u to update.. which OS are you running on? Currently, sniper is only officially supported on Kali linux 2.0+. The only other option is to use the docker image in the README. . @admin0day Haven't tested Sn1per on Kali-Pi but I assume in has it's own packages and slight differences from Kali 2.0 which is currently the only supported OS for Sn1per. I will leave this open in case someone is able to assist in the meantime. \nRegarding the \"sniper -u\" command not working, I think the best way to get sniper working is to run \"git clone https://github.com/1N3/Sn1per into a new directory and re-run ./install.sh. The bug in 4.1 is likely causing the sniper file to not execute properly which is preventing you from upgrading. . This was fixed in 4.3 which is now public. You should be able to run sniper -u to upgrade to git clone sn1per and re-run install.sh.. hey, what syntax are you using? Can you provide a sample of the command? \nTry: sniper -m airstrike -f targets.txt -w targets to see if that works. It seems to be working fine for me, but let me know if that doesn't work. . sorry man, not sure what the issue is. I re-ran the same commands on 4.3 and they worked just fine...\nDoes targets.txt contain IP's or domain names seperated by a new line? I'm not sure what else could be the problem. . hey guys, not sure what the issue is but I just tested this on my own system and it's working fine so I have uploaded the exact script I've been using here: https://gist.github.com/1N3/4803cce29fcce6ffc27554a6979aff79\nCan you download the script and replace /usr/share/sniper/sniper with the v4.4 script and let me know if that works? . awesome. thanks for confirming. I will push out the fix to the master branch shortly.. domain flyover is strictly run via aquatone and may take several minutes to hours depending on the size of the scope/domains in use. Not much I can do about that.. Thanks!. Thanks! . Hey @jaikishantulswani sorry for the delay here.. it appears that the socket is timing out (socket.timeout: timed out). Have you tried multiple domains/targets?. I don't know of any work around. It could mean that the target being scanned is specifically blocking XST or host header injections and results in a timeout. Unfortunately I can't change that behavior but you could try using native curl commands to see if that works (ie. curl -X TRACE https://target.com) and (curl -H \"Host: google.com\" https://target.com) etc.. . Yes, just open the sniper script /usr/bin/sniper and add a # before each xsstracer command and that should do the trick. . Hey, thanks for the heads up. How did you update sniper exactly? Did you run sudo sniper --update or something else? . Hi, \nThis was a bug that was fixed in 5.0. Can you try upgrading and let me know if this is still an issue. Closing out for now but will re-open if it's still an issue.. Awesome, thanks again for the heads up. I will take a look!. This is fixed in the latest v6.0 release. Thanks! . Thanks for the heads up! I will take a look... . hey, thanks for the heads up. Since @menzow manages the docker image, can you open up an issue on the docker project page https://github.com/menzow/sn1per-docker? He should be able to assist with that.. This is coming very soon in Sn1per 5.0 Professional. I'm hoping to have it released and ready some time this month.. Hi,\nSn1per Professional 5.0 is available now from the xerosecurity.com website: https://xerosecurity.com. This produces a full HTML reporting interface of all sn1per scan results and workspaces. Let me know if you have any questions.. thanks!. Thanks, I'll take a look... Done. Pushed changes to master to fix this and slurp.zip was added to /bin.. Unfortunately, I do not. Perhaps it's cached somewhere online? I'll have to take a look but not sure where to get it right now.. Whoops! Thanks for the heads up! I'll push the fix in the next version. . Fixed! Will be pushing to master branch soon. . Removed. This was old code left behind. Will be pushing to master branch soon. . These have already been removed in Sn1per 5.0 which will be pushed out to the public shortly. Before, it was running nikto automatically on high ports but now with the new scan modes, users can scan high web ports with sniper -t  -m webporthttp -p  -w workspace_alias. . Fixed! Changes will be merged into the master branch shortly. . Fixed! Changes will be merged into master branch shortly. Thanks for combing through and finding all these 👍 . For sure! will do!. This is fixed now. Changes will be pushed to master soon.. Thanks, this is fixed. Will push out shortly.. Yeah, I'm trying to integrate it into the web scan mode but need to cut down on the verbosity of BlackWidow first... I can definitely do that but it will take a little time. . This has been added. Closing out!. This appears to be a Ruby error from Yasuo. Would suggest opening a bug report there https://github.com/0xsauby/yasuo. . To gather subdomains, you need to use 'sniper -re -t target.com -w workspace_alias'. That will gather all subdomains and put them in a workspace called 'workspace_alias'.. msf > use exploit/multi/http/struts2_rest_xstream\n      msf exploit(struts2_rest_xstream) > show targets\n            ...targets...\n      msf exploit(struts2_rest_xstream) > set TARGET <target-id>\n      msf exploit(struts2_rest_xstream) > show options\n            ...show and set options...\n      msf exploit(struts2_rest_xstream) > exploit. Added to v5.2.. Hi,\nThis is a tool I wrote but haven't published yet... I mistakenly left the commands in the sniper script for testing purposes. If you want to test it, you can clone it from here https://github.com/1N3/CloudHunter and chmod +x cloudhunter and move it to /usr/bin/cloudhunter after so sniper can reference it. . I removed CloudHunter from v5.1 until it's been tested/implemented properly. Closing out for now but I may include this in future versions.. Hi, thanks for the suggestion. I've been meaning to add this for a while but will try to get this in the next version. Think it makes sense to still try both as I've still come across some environments with MS08-067 surprisingly.. ;) . Hey, I added  this to v5.2 which is now public. Thanks! . Added to v5.2.. Hi, what command did you run to perform subdomain brute forcing? The syntax to perform subdomain brute forcing is 'sniper -t target.com --recon -w target'. The --recon or -re flag performs brute forcing and subdomain enumeration. Also, the screenshot you posted which states \"SKIPPING FULL NMAP PORT SCAN\" are normal debug messages. These are optional scan parameters that must be enabled. To enable full NMap port scans for a scan, use 'sniper -t target.com -fp -w target' and to brute force all services, use the -b flag (ie. sniper -t target.com -w target -b). These options can also be combined, so 'sniper -t target.com -b -fp -o -re -w target) will perform a normal sniper scan + scan all ports, + perform OSINT/recon + brute force all services + enumerate all subdomains. Hope that helps 👍 . @1522402210 try 'sniper -t target.com -b -fp -re -o -w target'. That will enable all modules. . Closing this out for now. Let me know if you still need help with this.. Hi, \nAre you running v5.2 and did you run the install.sh after downloading 5.2? The slurp.zip file should be in the /bin/ directory in the main repo. This zip needs to be extracted under /usr/share/sniper/plugins/slurp/ to work. You should be able to run the 5.2 install.sh to do this but let me know if that doesn't work. . Can you check to see if you have a slurp.zip file under /usr/share/sniper/bin/ ? Also, can you try re-running the install.sh in /usr/share/sniper/ to see if that fixes the issue? After the install, it should create a directory under /usr/share/sniper/plugins/slurp/.. hmm. Okay, thanks for trying. I will try on a fresh box to see if I can reproduce and fix.. Thanks for the heads up. I fixed the issue with dnscan having an invalid location - I'll checkin the fix sometime today. For subfinder, I reviewed the code and did some testing but can't reproduce. Can you try running the following command to see if it works for you?\nsubfinder -o /tmp/subfinder.txt -b -d target.com. Actually, I re-downloaded a fresh copy of subfinder and it looks like it now requires a wordlist to run. I put in a fix in the latest master repo http://github.com/1N3/Sn1per/. I'll publish the official release sometime this week so people can upgrade via 'sniper -u' command.. Thanks for the heads up. I'll take a look at this today.. So I removed CloudFail from the installer since it is no longer used in Sn1per. I was able to reproduce the error for AMass but found that it did not affect the functioning of amass in Sn1per. Can you double-check to see if you can run the 'amass' command from a terminal? If it still works fine, I will put in a change to remove the errors from being displayed in the installer since it doesn't affect anything.. I believe it was causing interruptions in the automation/scan process but I can take another look and potentially make it an optional addon that people can either enabled/disable.. Thanks for the heads up. I'm working on some of the fixes you mentioned here but have not published the release yet until everything is tested. I should have this done in the next day or two. The DNScan bug will be fixed as well. I'll take a look at the GVM and Amass stuff though and see what can be done.. This should be fixed now so closing out.. Awesome! Thanks! . I believe it may be the DNS server throttling your connection due to sending too many requests. I'll take a look at the options to see if there's a good solution, but I believe that's the only logical explanation at this point. There may be some request limit/throttle in amass that can be implemented to slow down the rate, but I'll have to check. . Hi, are you able to run amass/sublist3r against the target standalone to see what the difference in results are? If no subdomains are found, there may not be any that the tool has found. Also, regarding the scan progress/speed, brute forcing subdomains and web files  can take while (This is normal). Best to either switch to a less intrusive scan mode like \"stealth\" mode or \"normal\" mode to brute force less files or wait. I'll do some testing on a fresh kali box to see if I can reproduce.. This should be fixed in Sn1per v6.0. Please git clone the latest release and let me know if that does not work. . Hi, I don't know if this is possible through metasploit's options unless each module contains a safe \"check\" option to verify without actually exploiting the vulnerability. I'm not sure if this helps but from experience, you can always type 'exit' at the metasploit shell prompt and the sniper scan should continue as normal. In the meantime, I'll see if there's any good options for this and also if you have any suggestions, do let me know and I'll do my best to get it implemented.. Unfortunately, I would have to change how metasploit modules/exploits are ran to completely open every exploit attempt in a new window which would result in potentially tons of new windows. Not sure what the best route is for this but if I can think of a better way to handle these, I'll definitely implement it.. I know you can background shell processes in metasploit but the problem is that the sessions are killed as soon as metasploit exits, so that won't help either. . Thanks for the feedback. These two things have been requested in the past and I would like to implement them into Sn1per eventually. Just a matter having time to test and implement all new features, etc. I'll leave this open to track though. . Hi, looks like the sniper script isn't installed. Which OS are you running on and have you tried running the install.sh script yet to install sniper?. Sn1per is only compatible with Kali Linux 2.0 out of the box. Which Linux distro did you try installing on?. Hi, Thanks for the feedback. All valid points btw. By default, sniper runs all tools as 'root' and saves all files to /usr/share/sniper/. I haven't tried using a different install dir or user but will see how much work is required to do this and will keep you posted. This could introduce tons of issues with how Sn1per was designed, but I think with time, this is achievable. . Thanks for the heads up and sorry about that! This is now fixed in the current v6.0 branch!. Can you try running the following command to confirm if the output says 6.0? I've noticed that if I don't have an internet connection, the curl command doesn't return anything and causing the logic in the update check to fail, so also confirm you have a valid internet connection as well.\ncurl --connect-timeout 3 -s https://api.github.com/repos/1N3/Sn1per/tags | grep -Po '\"name\":.?[^\\]\",'| head -1 | cut -c11-13. Cool. Glad it’s working now. I’ll see if I can add a change to check for an active connection prior to checking which should help. . Hi, thanks for the heads up. I looked at the install.sh script which upgrades sniper and see that the only command that installs go is apt-get install golang. I believe these messages are a byproduct of the upgrade process but should not affect functionality. I did re-run the install script on my own system again to be sure but did not receive the same messages. Perhaps I just had a more recent version of go installed prior? shrugs* Also, the symlinks in /usr/lib appear to be normal as well and likely the result of the kali install process (I checked my system and have the same files present). \nI think everything is fine despite the messages above but I'm not 100% sure why you're getting the messages to begin with. I'll leave this open for now in case anyone else has this issue and can help if needed.. I just installed the latest amass and it appears to have made a change to the command line options which made the commands used in sniper invalid... I fixed the amass command now in the master branch for sniper. To fix, you can git clone https://github.com/1N3/Sn1per /tmp/Sn1per and re-run the install.sh in /tmp/Sn1per/ after to get the update. The version will still be 6.0 until I publish the changes, but let me know if that helps.\nAlso, the issue with subfinder should also be fixed. It's complaining that no wordlist was specified which should be fixed now. If you re-run the install.sh after cloning the github repo again, I'll take another look but it is working for me right now.\nKeep me posted.. Awesome. Glad to hear it! 👍. Hi,\nThe correct syntax is sniper -t 192.168.10.1/24 -m discover -w 192.168.10.0\nThat should work, but let me know if it doesn't.. Thanks!. Hi,\nIt looks like you may have lost internet connectivity based on the error:\nCould not resolve host: github.com\npackage github.com/bogdanovich/dns_resolver: exit status 1\nI would try running 'host github.com' first to make sure it resolves, then run ./install.sh again to see if that works. . This is likely the result of running metagoofil as part of the 'recon' mode. This is fairly common/normal but should continue with all other search engines before finalizing the results. That being said, it might be worth checking with the metagoofil Github page or developer as I'm not sure if there's anything different I can do on my side to get around this. You mentioned though that the scan scan stopped? Does that mean it's just hanging on metagoofil indefinitely or just that the results from the tool just don't display any results? Also, if you recon mode multiple times in a short period of time from the same IP, you're more likely to get blocked. If you use VPN, I found it's better to switch IP's before running recon mode to avoid setting off any alarms or getting blocked. Just a thought... Hi, I believe this is related to https://github.com/nmap/nmap/issues/1320. I would try updating NMap from github to see if that fixes the issue as this appears to be a native NMap bug that was introduced recently. . hey! This exploit is actually maintained here: https://github.com/leapsecurity/libssh-scanner. I'm not familiar with the error, but it might be best to open the request with the original development to troubleshoot. . Thanks for the request. Going to push this manually in v6.1 which should be  out in the next week or so.. Thanks for the heads up! This should be fixed now.. Awesome! thanks!. ",
    "glira": "sorry, I not found in the sample report, in any way the report has a lot of information it would be nice if it were in html with tables and colors to facilitate.\nif I some work in this regard inform you.\ncongratulations is a good job!\n. ",
    "JayMaree": "Still the same, got the following errors:\n[1]\n./sniper: line 89: theHarvester: command not found\n./sniper: line 90: theHarvester: command not found\n./sniper: line 91: theHarvester: command not found\n./sniper: line 92: theHarvester: command not found\n./sniper: line 93: dnsrecon: command not found\n./sniper: line 94: dnsrecon: command not found\n./sniper: line 95: dnsrecon: command not found\n./sniper: line 96: dnsenum: command not found\n./sniper: line 98: shodan: command not found\n[2]\nFailed to open XML output file loot/nmap-veiling.infotheek.com.xml for writing\nQUITTING!\n[3]\n./sniper: line 667: cd: yasuo: No such file or directory\nruby: No such file or directory -- yasuo.rb (LoadError)\n./sniper: line 669: cd: ../BruteX: No such file or directory\n./sniper: line 670: ./brutex: No such file or directory\nmv: cannot stat ‘loot/*’: No such file or directory\nA few things works fine now, like the Shodan install step. Didn't work either before.\nBtw, I'm running the install.sh on a NON-GUI ubuntu vm (digital ocean)\n. ",
    "menzow": "@JayMaree @1N3 ; The docker solution is the perfect solution with guaranteed compatibility on any OS that runs docker. \nBut that doesn't solve the issue at hand: running sn1per on Ubuntu. Your problem is that you're missing specific programs sn1per tries to run. Some sn1per dependencies reside in the kali linux repository.\nTo install these dependencies you need to add the kali repository to your sources list. This can be done through the following commands: \necho \"deb http://http.kali.org/kali kali-rolling main contrib non-free\" >> /etc/apt/sources.list.d/kali.sources.list\ngpg --keyserver pgpkeys.mit.edu --recv-key  ED444FF07D8D0BF6\ngpg -a --export ED444FF07D8D0BF6 | apt-key add -\napt-get update\nMore info\nNow you can manually install each missing dependency, or run the following command to install them all:\n```\napt-get install -y \\\n    ruby \\\n    rubygems \\\n    python \\\n    dos2unix \\\n    zenmap \\\n    sslyze \\\n    uniscan \\\n    xprobe2 \\\n    cutycapt \\\n    unicornscan \\\n    waffit \\\n    host \\\n    whois \\\n    dirb \\\n    dnsrecon \\\n    curl \\\n    nmap \\\n    php \\\n    php-curl \\\n    hydra \\\n    iceweasel \\\n    wpscan \\\n    sqlmap \\\n    nbtscan \\\n    enum4linux \\\n    cisco-torch \\\n    metasploit-framework \\\n    theharvester \\\n    dnsenum \\\n    nikto \\\n    smtp-user-enum \\\n    whatweb \\\n    dnsutils \\\n    sslscan \\\n    amap \\\n    arachni && \\\nmv /usr/bin/python /usr/bin/python.unknown && \\\nln -s /usr/bin/python2.7 /usr/bin/python && \\\ncurl https://bootstrap.pypa.io/get-pip.py | python && \\\ngem install  \\\n    mechanize \\\n    bcrypt \\\n    net-http-persistent \\\n    rake \\\n    ruby-nmap \\\n    text-table && \\\npip install  \\\n    colorama \\\n    dnspython \\\n    ipaddress \\\n    tldextract \\\n    urllib3\n```\nAfter installing all dependencies, I'd advice to re-install sn1per through the following command:\ngit clone https://github.com/1N3/Sn1per.git ~/Sn1per\ncd ~/Sn1per\n./install.sh\nWith the previous commands ran you should now have a fully working copy of sn1per installed on your host OS.. This would indeed be a huge upgrade to the current service provided by sn1per, here you're talking about expanding sn1per to a complete pentesting software package that includes a full UI, probably web-based.\nIn a abstract view you're looking at a way to execute programs remotely and storing the output for later review. This is a task commonly executed by continuous integration tools like Jenkins. It's common to have a cluster of build and testing (workers) servers that run a set of tasks (programs) and store the output for review in the CI web-panel. \nSo what you could do is setup a copy of Jenkins or any other continuous integration tool /  task runner (CI master). \nAfter that setup a worker that has sniper installed and connect it to your CI master.\nIn your CI master create a task that runs sniper and configure it to run on your worker(s).\nTasks support parameters, so you'd be able to specify the domain for sniper to target when you run the task.\nWhenever you want to run sniper on your worker; you run the task with the domain it should target. Your CI tool will run it when the worker is available, so you can even queue multiple tasks/scans.\nOn top of that most CI tools support webhooks, so you'd even be able to create a simple bash scripts you can run locally to create tasks.\nExample (sniper-scan):\ncurl -X POST -H \"Content-Type: multipart/form-data; boundary=----WebKitFormBoundary7MA4YWxkTrZu0gW\" -H \"Cache-Control: no-cache\" -F \"key=some-key\" -F \"domain=target.com\" \"${1}\" \"http://127.0.0.1/scan\"\nRun:\n./sniper-scan target.com. @royharoush Jenkins is quite bloated for the specific action you want to achieve, but it's definitely easy to use for what you want to achieve. See https://wiki.jenkins-ci.org/display/JENKINS/Distributed+builds for more info on master/slave setups.\nAnother option is Bistro. It's a distributed task runner developed  by Facebook. I don't have any experience with it myself, but from the docs it looks quite promising. \nThe concept is simple: you have a scheduler process and worker processes which communicate over TCP. The scheduler process can be controlled through a REST api for reading data and starting tasks. Tasks will be queued and distributed over the available workers.\nThis seems like more lightweight and better suited solution for your goal. 👍 \nRead more: https://facebook.github.io/bistro/ & https://facebook.github.io/bistro/docs/getting-started/. It's still possible to get php5 from the following repository:\nhttps://launchpad.net/~ondrej/+archive/ubuntu/php\n. Great! Thanks.\nIf you need any help let me know\n. Some extra notes:\nWhen adding the repository:\nadd-apt-repository ppa:ondrej/php\nThe package: software-properties-common has to be installed.\napt-get install software-properties-common\nAnd the current language has to support UTF-8 export LC_ALL=C.UTF-8 or you will get errors while adding the repository.\nAnd make sure to run apt-get update again so the new package list is loaded.\n. I'm making a docker image that will run on ubuntu 16.04 and have a working copy of Sn1per installed.\nPeople can pull this image and instantly run Sn1per in a docker container without worrying about dependencies. You can check out the docker file for all the required dependencies to get Sn1per working in a clean ubuntu 16.04 installation.\nSince you use a lot of kali tools, I added the kali-rolling repository found here: http://docs.kali.org/general-use/kali-linux-sources-list-repositories\nThis did give me some issues with ubuntu 14.04. I'm not entirely sure how this happened, after I finish the 16.04 version I'll start working on 14.04.\nI think because the many dependencies this tool has, it's going to be difficult to guarantee a successful installation across different linux distros where you don't know what was already installed.\n. Awesome.\nBeen trying for a few hours building and fixing bugs, almost got the docker image complete.\nMy current issue is that it's trying to install 1500 MB of dependencies.\nI'm going to continue tomorrow, see if I can cut that overhead back one way or another.\nCurrent progress:\nhttps://github.com/menzow/sn1per-docker\nBuild: \nhttps://hub.docker.com/r/menzo/sn1per-docker/builds/bqez3h7hwfun4odgd2axvn4/\n. Quick update:\nThere's now a (almost) working image available on docker hub.\nExample usage:\n```\nmenzo@menzo:~$ docker pull menzo/sn1per-docker\nmenzo@menzo:~$ docker run --rm -ti menzo/sn1per-docker sniper menzo.io\n                _\n    _  /  /  __\n   / / _ \\ / //  \\/ _ \\/ /\n  (  ) / / // // // /  / /\n /_// /_// ./_//\n               /_/\n\n-- --=[http://crowdshield.com\n-- --=[sn1per v1.8 by 1N3\n......\n```\n\n@1N3 : would be great if you could test it out and point out any issues with this version.\n. Thanks for the feedback!\nYour host environment should not impacting the container environment. So I'll be able to fix these issues within the image for sure.\nI'm currently working on a develop branch (unstable) where everything is ordered a bit better.\nI'll implement fixes for these issues there, and merge them into master tomorrow.\nMetasploit seems to have some conflicting dependency versions, this can be fixed easy I guess.\nAfter I merge this into master, I'll look into decreasing image size.\n. @1N3 I just pushed a new release to master.\nResolves the following issues:\n- Conflicting dependencies for metasploit\n- nslookup missing\n- dig missing\nI also cleaned up the Dockerfile so it's more in line with the docker recommendations.\nWould be great if you could run through it again.\nImage size is still around 2.5GB at the moment.\nI'll see if I have some time this weekend to sort that out.\n. Hey @1N3 ,\nIt would be nice that the Docker version of Sn1per automatically rebuilds when you push changes to your repository.\nI have a web hook that you can trigger to start a new build, you can add that web hook in the settings of this repository.\nSend me a email at: hello+sn1per@menzo.io and I'll send you the URL for the webhook.\n. Hey @1N3,\nI just updated the docker image to v2.3a, I also decreased the target image size from 2GB to 911 MB 👍 . Hey @1N3, sure thing. Changes have been applied and new build will be available in a few hours.. Found it:\n/usr/share/sniper/loot/domains.\n. Hey @mehranexpert ,\nThis tool was built mainly to run on Kali linux, and has some dependencies on tools available in the kali linux repository.\nTo install those tools, run the following code (as root or with sudo):\n```\necho \"deb http://http.kali.org/kali kali-rolling main contrib non-free\" >> /etc/apt/sources.list.d/kali.sources.list\ngpg --keyserver pgpkeys.mit.edu --recv-key  ED444FF07D8D0BF6\ngpg -a --export ED444FF07D8D0BF6 | apt-key add -\napt-get update\n```\nHere's the list of all packages you need installed for sn1per to run correctly:\napt-get install -y \\\n    amap \\\n    arachni \\\n    bsdmainutils \\\n    build-essential \\\n    cisco-torch \\\n    curl \\\n    cutycapt \\\n    dirb \\\n    dnsenum \\\n    dnsrecon \\\n    dnsutils \\\n    dos2unix \\\n    enum4linux \\\n    git \\\n    git-core \\\n    golismero \\\n    host \\\n    hydra \\\n    iceweasel \\\n    iputils-ping \\\n    joomscan \\\n    libcurl4-openssl-dev \\\n    libffi-dev \\\n    libreadline-dev \\\n    libsqlite3-dev \\\n    libssl-dev \\\n    libxml2-dev \\\n    libxslt1-dev \\\n    libyaml-dev \\\n    metasploit-framework \\\n    nbtscan \\\n    nikto \\\n    nmap \\\n    php \\\n    php-curl \\\n    python \\\n    python-software-properties \\\n    python2.7 \\\n    rubygems \\\n    ruby-bcrypt \\\n    smtp-user-enum \\\n    software-properties-common \\\n    sqlite3 \\\n    sqlmap \\\n    sslscan \\\n    sslyze \\\n    theharvester \\\n    unicornscan \\\n    uniscan \\\n    w3af \\\n    waffit \\\n    wapiti \\\n    whatweb \\\n    whois \\\n    wpscan \\\n    xprobe2 \\\n    zenmap \\\n    zlib1g-dev\nOnce you've installed all those tools, sn1per should run without problems.\n. Sn1per depends on archini as provided through the kali repository. Try adding this repository to your sources.list and installing it again.\necho \"deb http://http.kali.org/kali kali-rolling main contrib non-free\" >> /etc/apt/sources.list.d/kali.sources.list\ngpg --keyserver pgpkeys.mit.edu --recv-key  ED444FF07D8D0BF6\ngpg -a --export ED444FF07D8D0BF6 | apt-key add -\napt-get update\nFor more info on dependencies please see my answer here: https://github.com/1N3/Sn1per/issues/20#issuecomment-281225074. Hello @roothaxor, \nCould you please report your exact issue and how you resolved it? This will help assisting other users in the future. . Hello Zibri,\nI agree that the installer should indeed perform checks and run installs for all required dependencies.\nUntil that is implemented however you can opt for using the Docker image available (instructions can be found in the README) or follow the steps I provided here #20 (comment) to install all dependencies on your OS.. I experimented slightly with implementing this idea. I however stopped this effort and decided to provide a Docker Image that runs Sn1per. \nMy concern was the following: Sn1per is not 1 piece of software, but a collection of different tools developed by various authors. All these tools come with a plethora of possibly conflicting dependencies and constant individual updates possibly causing new issues. \nIf you look at Kali's bug tracker ( https://bugs.kali.org/view_all_bug_page.php?refresh=true ) you'll see how much constant effort is required in keeping all individual tools up-to-date and stable. Providing a installation script for Sn1per and all of its dependencies covering varying distros and user environments will cause similar issues.\nI must admit that I'm by far not an expert on the subject of maintaining the compatibility of multiple tools and their dependencies across distros. There might be some simple solutions that I'm overseeing or overestimating the possible issues. It would be great to hear @1N3's opinion on the subject. To me it seems as a nice enhancement but must be worth the effort 👍 . Hey @pbullian thanks for your contribution. A new build will be available from docker in a few hours.\nBtw if you have another contribution, you can also create an issue or create a merge request directly at https://github.com/menzow/sn1per-docker/ .\n. I think @ifly53e these lines: https://github.com/1N3/Sn1per/blob/master/sniper#L280-L288 which does seem like a bug.\nI think you were planning to add an if/else statement there. Right now a discover scan with reporting on causes these two loops to execute:\nbash\nfor a in `cat $LOOT_DIR/domains/sniper-ips.txt` \n    do sniper $a stealth report\ndone\nfor a in `cat $LOOT_DIR/domains/sniper-ips.txt` \n    do sniper $a stealth\ndone\n. Great! Encountered the issue while doing a big polish on the docker image.\nBiggest changes listed here: https://github.com/menzow/sn1per-docker/commit/5508afc147affef10637f054ee8e2f398f96b0e6\nMost important change is that there's a VOLUME which persists the scan reports to your host operating system, and another VOLUME that allows you to add your own wordlists etc. Oh and I added xvfb so cutycapt actually take screenshots.\nRight now still running some tests, expect to push the release to hub.docker.com somewhere this week. . Since sniper is chaining metasploit modules it's gonna need both RHOST and RHOSTS. These verbose warnings are just modules complaining that a global parameter is being set while they're loaded.\nMaybe it's a good idea sniper first sets up the exploit context and then runs the exploit chain. I just tried this locally and seems to work great. I think a simple search and replace would fix all \"issues\" /msfconsole -x \"/msfconsole -x\"setg RHOST \"$TARGET\"; setg RHOSTS \"$TARGET\";/. Currently there's a 2 fixed locations for user and password files. \nUSER_FILE=\"/usr/share/brutex/wordlists/simple-users.txt\"\nPASS_FILE=\"/usr/share/brutex/wordlists/password.lst\"\nhttps://github.com/1N3/Sn1per/blob/master/sniper#L96-L98\n. I've been testing it as sniper ~/ips.txt nuke report and that ran fine. sniper ips.txt nuke report isn't a path and thus defaults back to the current directory in which the running script resides.\nI'll look into this issue later.\nEdit: I think using basename for the report file location will be enough to fix the issue. Will issue a new merge request once confirmed.. Hey @mpkosewski ,\nIt might help to run sniper as a background task and use tail to view the output. This will keep the scan running even if your terminal gets disconnected.\nExample:\nsniper <target> <report> &> /tmp/sniper.scan.log &\ntail -f /tmp/sniper.scan.log. Hey @gbiagomba , thanks for your report.\nDo you maybe still have the output from the sniper update command and/or the gem install errors?\nAnd which operating system are you running? Distro + version number.\nSince Sn1per is basically a wrapper around a bunch of different tools, the cause of your issue(s) can be a breaking change in sn1per, one of the tools it runs on or possible one of the many dependencies that each of those tools have. Any information that helps replicating your issue will help resolving the problem 👍 \nMy best guess right now is that the failing ruby task from #102 is the cause of this issue. Solving that issue will probably also resolve this one.\nThanks.. Hey @gbiagomba,\nA bit late for a response but are you able to reproduce this issue? I've been able to run installs and updates on a clean system. I might be able to add a fallback if I can reproduce the issue :). @SaberSecurity what is the perceived advantage of moving this to the metasploit step?\nI think it should be possible to have uninterrupted runs so sniper can be used in a automated toolchain. This can be achieved by passing (optional) configurations through the command line. \nExample:\nsniper example.com report --workspace=example-workspace\nOR\nsniper example.com report -w example-workspace. I think there's two issues causing this problem. The first issue is bash not being able to determine the DISTRO, leaving the variable empty. The second issue is that there's multiple if statements not wrapping this variable in a string before validating it.\nThe execution on empty variables currently looks something like this:\n```\nset empty distro\nDISTRO=\ninvalid: if [ ${DISTRO} == \"blackarch\" ]; then\nif [  == \"blackarch\" ]; then\n   ...\nfi\nvalid:  if [ \"$DISTRO\" == \"blackarch\" ]; then\nif [ \"\"  == \"blackarch\" ]; then\n   ...\nfi\n```\nI will see if I have time to spin up a centOS VM tomorrow to check why the DISTRO is not properly set on CentOS. In a future update it would be best to fix all if else blocks with proper string wrapping. (more info on that here: http://linuxcommand.org/lc3_wss0090.php). Sn1per strings together various applications so there's no insurance those will support proxies or wether they will all accept the same format. \nWhat you could try to do is setup the HTTP_PROXY and HTTPS_PROXY environment variables to point to a proxy server. Most developers will implement those out of convention. You can use a load balancer to redistribute the requests over a list of proxies. ProxyBroker is a great solution for that. \nproxychains-ng is another solution. It may not be 100% reliable but generally works. To quote from their README:\n\nProxyChains is a UNIX program, that hooks network-related libc functions\n  in DYNAMICALLY LINKED programs via a preloaded DLL (dlsym(), LD_PRELOAD)\n  and redirects the connections through SOCKS4a/5 or HTTP proxies.\n  It supports TCP only (no UDP/ICMP etc).\nThe way it works is basically a HACK; so it is possible that it doesn't\n  work with your program, especially when it's a script, or starts\n  numerous processes like background daemons or uses dlopen() to load\n  \"modules\" (bug in glibc dynlinker).\n  It should work with simple compiled (C/C++) dynamically linked programs\n  though.\n. ProxyBroker isn't suitable as a loadbalancer if you want to use your own list of proxies. I just found cow (Climb Over the Wall) which is a amazing proxy load balancer written in golang. Great feature is that it automatically detects and changes proxies blocking a specific domain.. \n",
    "hariom282538": "SCANNING FOR COMMON VULNERABILITIES\nTraceback (most recent call last):\n    2: from yasuo.rb:34:in <main>'\n    1: from /usr/lib/ruby/2.5.0/rubygems/core_ext/kernel_require.rb:59:inrequire'\n/usr/lib/ruby/2.5.0/rubygems/core_ext/kernel_require.rb:59:in `require': cannot load such file -- sqlite3 (LoadError).  “brute force file not specified, bay.” . ",
    "absane": "Sounds good! Also, one thing that just occurred to me is that it might also be nice to have an option to use Masscan/Unicornscan for port enumeration and then use Nmap to do service enumeration + anything else (scripts, etc). Nmap is great but it does not scale well for port scanning a large set of IPs.\nMuch of this might be a tall order but the script is so far very good. Keep up the awesome work.\n. ",
    "No-0Peration": "Checkout my recon script it had some of those features... But its still in development\n. ",
    "morganh83": "Excellent tool. I love it! The only feature I would like to see is the ability to select the tests it runs. For example, I do not want to run Hydra and brute force any logins on my client's network. Would love to be able to select (or configure) which tools are executed during one of the modes.. ",
    "mero01": "No Problems Mate! \nThanks for the hard work. \n. ^_^ look forward to your response. \n. Okay thank you for investigating  - That's unfortunate. \nSo now if a random port is open the script wont detect it?  that a shame - think it may even be woth going back? \nI've been using this daily and often it will pick up random ports say 9505 which I will then manually investigate. \nCan you implement a separate full port scan option as it was previously? say Nuke-Full\nThanks mate - awesome script! \n. Awesome! \nLove the work! - As I said I have been using this daily - saves a lot of typing and effort. Yesterday I left it scanning on a machine - came back with a Meterpreter shell, cant ask for much more :+1: \nI have been able to use the output on each machine for a quicker exploitation and information. \nThanks Again, look forward to the next release!\n. ",
    "royharoush": "I'll definitely look into jenkins to automate tasks, wasn't aware of the\nmaster slave architecture, onlynof the command execution...\nYou can look on my profile for the distributedscanning project, it uses\nnested loops to execute paramterized tasks on remote hosts, amongsts other\nthings\nOn Thu, Feb 16, 2017, 9:46 PM Menzo Wijmenga notifications@github.com\nwrote:\n\nThis would indeed be a huge upgrade to the current service provided by\nsn1per, here you're talking about expanding sn1per to a complete pentesting\nsoftware package that includes a full UI, probably web-based.\nIn a abstract view you're looking at a way to execute programs remotely\nand storing the output for later review. This is a task commonly executed\nby continuous integration tools like Jenkins. It's common to have a cluster\nof build and testing (workers) servers that run a set of tasks (programs)\nand store the output for review in the CI web-panel.\nSo what you could do is setup a copy of Jenkins or any other continuous\nintegration tool / task runner (CI master).\nAfter that setup a worker that has sniper installed and connect it to your\nCI master.\nIn your CI master create a task that runs the sniper and configure it to\nrun on your worker.\nTasks support parameters, so you'd be able to specify the domain for\nsniper to target when you run the task.\nWhenever you want to run sniper on your worker; you run the task with the\ndomain it should target. Your CI tool will run it when the worker is\navailable, so you can even queue multiple tasks/scans.\nOn top of that most CI tools support webhooks, so you'd even be able to\ncreate a simple bash scripts you can run locally to create tasks.\nExample (sniper-scan):\ncurl -X POST -H \"Content-Type: multipart/form-data;\nboundary=----WebKitFormBoundary7MA4YWxkTrZu0gW\" -H \"Cache-Control:\nno-cache\" -F \"key=some-key\" -F \"domain=target.com\" \"${1}\"\nRun:\n./sniper-scan target.com\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/1N3/Sn1per/issues/34#issuecomment-280437992, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/AHvLoOEJRBOYanJs9KlmYV9d2pa8VNPUks5rdKeSgaJpZM4ImaeK\n.\n. \n",
    "rfare": "Not a problem. I'll keep digging for working solutions as well. Hopefully one of us will figure it out eventually.\n. Found the solution, the -sU flag is missing on all 4 Nmap UDP scans in the script.\nI clearly remember it being optional back in Nmap 5/6, as long as the ports were prefixed with U: (Like you had them). Not sure when that change was introduced O.o\n. ",
    "windmillnl": "Same error here on Kali :(\nCouldn't fix it either, did you guys ever figure it out?\n. Thank you 1N3, great work btw! Love this script!\n. Actually, I've encountered another thing:\nWhen the scan is done it's generating the report but it never makes it to the folder.\nNo errors or anything but the folders are always empty. \n. ",
    "Biedubbeljoe": "Thx.\n. if sniper stops at massbleed use the command: \nps aux\nfind the PID number (first row) for the massbleed proces and use the command:\nkill xxxxx\nwhere xxxxx is the PID number, to kill the massbleed proces, and the script will keep on running..\n. ",
    "dukeminus": "tried using killall sslscan it does nothing. ",
    "mehranexpert": "Thanks @menzow .\nYes im run install.sh before running .\n```\nls -lh /usr/share/sniper/loot/\ntotal 4.0K\n-rw-r--r-- 1 root root 113 Oct 28 17:48 README.md\n```\nseems Dependence @menzow Provided helped me , Thanks . \n. ",
    "magiclcj": "Sorry for the delay in posting 1N3. I am using version 2.0. Also I only have the 1 ip when I ran sniper for dvrsvr.txt which is in usr->shr. Should I reinstall?. I am still getting this: Failed to open XML output file /usr/share/sniper/loot/nmap/nmap-96.4...xml for writing\nQUITTING!\nand\n+ -- ----------------------------=[Running Intrusive Scans]=----------------- -- +\ngrep: /usr/share/sniper/loot/nmap/nmap-96.4...xml: No such file or directory\ngrep: /usr/share/sniper/loot/nmap/nmap-96.4...xml: No such file or directory\ngrep: /usr/share/sniper/loot/nmap/nmap-96.4...xml: No such file or directory\nI appreciate the response so fast. I'm learning to test straight from cmd like you mention on your blog so I just want to make sure I have done things right. Thanks again for suggesting to use sniper IP it did work I just got those errors. . That worked. I did not realize just creating those dir would fix it. Thanks again for the response so promptly!. ",
    "OMarciano": "i'm running on Kali 2. ",
    "roothaxor": "tried same problem. my bad problem with installation . Hello @menzow there is no problem i had problem with my OS not in Sniper. ",
    "Zibri": "Sure. I don't have a problem even installing the prerequisites myself. It was just a heads-up since the nature of the script.\n Glad you agree.\n-------- Messaggio originale --------\nDa: Menzo Wijmenga notifications@github.com \nData:22/02/2017  16:39  (GMT+02:00) \nA: 1N3/Sn1per Sn1per@noreply.github.com \nCc: Zibri zibri@zibri.org,Author author@noreply.github.com \nOggetto: Re: [1N3/Sn1per] Kali ok.. Ubuntu KO (#54) \nHello Zibri,\nI agree that the installer should indeed perform checks and run installs for all required dependencies.\nUntil that is implemented however you can opt for using the Docker image available (instructions can be found in the README) or follow the steps I provided here #20 (comment) to install all dependencies on your OS.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n. As a programmer I agree and understand that :)\n-------- Messaggio originale --------\nDa: Menzo Wijmenga notifications@github.com \nData:22/02/2017  19:10  (GMT+02:00) \nA: 1N3/Sn1per Sn1per@noreply.github.com \nCc: Zibri zibri@zibri.org,Author author@noreply.github.com \nOggetto: Re: [1N3/Sn1per] Kali ok.. Ubuntu KO (#54) \nI experimented slightly with implementing this idea. I however stopped this effort and decided to provide a Docker Image that runs Sn1per.\nMy concern was the following: Sn1per is not 1 piece of software, but a collection of different tools developed by various authors. All these tools come with a plethora of possibly conflicting dependencies and constant individual updates possibly causing new issues.\nIf you look at Kali's bug tracker ( https://bugs.kali.org/view_all_bug_page.php?refresh=true ) you'll see how much constant effort is required in keeping all individual tools up-to-date and stable. Providing a installation script for Sn1per and all of its dependencies covering varying distros and user environments will cause similar issues.\nI must admit that I'm by far not an expert on the subject of maintaining the compatibility of multiple tools and their dependencies across distros. Their might be some simple solutions that I'm overseeing or overestimating the possible issues. It would be great to hear @1N3's opinion on the subject. To me it seems as a nice enhancement but must be worth the effort 👍\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n. ",
    "white-widow": "The same for Parrot Security OS would be nice ;) I´m installing, i think it will work fine. Not much different from kali. It seems we can't use tor or proxys. it would be very usefull. sry my english\n. ",
    "Caner112": "Check Docker version of Sn1per, its based on Ubuntu, it will give you some guidelines . ",
    "MaximoPortal": "Thank you so much for explanation.\nNice work and keep on with good work.\nthank you . ",
    "ifly53e": "Ugh....nevermind.....\n\"apt-get install rpcbind\" will install rpcinfo if it is missing....\nMaybe this is something the install script can solve for us?\nAdd rpcbind to this line?\nhttps://github.com/1N3/Sn1per/blob/master/install.sh#L39\n. On second thought, db_import probably won't like an xml file with multiple top roots.  For getting everything into metasploit, will probably have to give each output xml file a unique name (probably just add the port number to the filename) and then let the wildcard do it's thing in the db_import call...\ndb_import $LOOT_DIR/nmap/nmap*.xml;\nhttps://github.com/1N3/Sn1per/blob/master/sniper#L203\n. I have code that implements my second comment.. On a side note, I can't find slurp.zip anywhere...if you have a copy of 2.0 (dated late Dec), would you mind uploading it?. Thanks for the file.  This slurp,zip was made on 12/4/2017.  There is a 2.0 release dated 12/24/2017 with enhanced features.  If you have the newer file, request you post that to the bin.  Thanks! . No problem...A shout out in the changelog like you used to do would be cool.  Thanks!. ",
    "GitHipster": "I am struggling with the same thing. Structured xml output would be great indeed.\nUntil there is a structured output mechanism in sniper (if it even ends up as a feature) i can offer you my approach. Using Excel and leveraging formula's i run sniper and collect the results almost automatically. The following lines run sniper, save the output to the desktop, convert the terminal output to HTML and clean up the leftovers in the sniper directory:\n```\nmkdir /root/Desktop/sniper/www.github.com\ncp -r /usr/share/sniper/loot/ /root/Desktop/sniper/www.github.com\nmkdir /root/Desktop/sniper/www.github.com/_backup\ncd /root/Desktop/sniper/www.github.com/\ncp .txt /root/Desktop/sniper/www.github.com/_backup/\nfor i in ?????????????????*.txt; do mv -i \"$i\" \"${i%?????????????????}\"; done\nmv /root/Desktop/sniper/www.github.com/sniper-www.github.com /root/Desktop/sniper/www.github.com/sniper-www.github.com.txt\ncat /root/Desktop/sniper/www.github.com/sniper-www.github.com.txt | aha --black > sniper-www.github.com.html\nrm /usr/share/sniper/loot/domains/\nrm /usr/share/sniper/loot/nmap/\nrm /usr/share/sniper/loot/output/\nrm /usr/share/sniper/loot/reports/\nrm /usr/share/sniper/loot/screenshots/\nrm /usr/share/sniper/loot/.txt\nrm /usr/share/sniper/loot/notes/*\nnautilus /root/Desktop/sniper/\nfirefox /root/Desktop/sniper/www.github.com/sniper-www.github.com.html\n```\nThe only thing is that output isn't converted to HTML properly keeping the color coding. The sniper 'logo' is in red when running sniper. It's uncolored in the HTML file. Most of the findings / interesting results are colored correctly.\nMaybe you can put these couple of lines to good use. \nYou will need to install aha of course. This can be done by:\napt-get install aha\n. ",
    "amanelis": "+1. ",
    "ghost": "solved: https://github.com/sullo/nikto/issues/444\nin /etc/nikto.conf\nchange \"UPDATES=yes\" to desired setting. ",
    "pentester123": "@1N3 Thank you for the info. I just tried both of them and it does not look like to me that they go though the whole thing like how it is when you do it just one IP address at a time. they also seem to finish very fast.\nI need to be able to run it though all the collected tools the list of ip addresses that I have just as if I was only doing 1 ip at a time. Is that something that can be done/fixed?. @1N3 I did try both of them but I think they might be broken because they are finishing up way to fast and giving me very little read out compared to when I do a single IP at a time.\nI also noticed that it is not dumping the reports into the folder it is claiming. I am not sure where it is putting the reports because I can't find them.\nAlso I am not sure if it is possible but if it is I would suggest that anything of interest like if sniper happens to RDP or finds any usernames and passwords or really comes back with anything other then not being able to find anything that it should be reported at the bottom when all tools are done. Instead of having to scroll though the whole scan.. I found what I believe might be a bug with that command. It seems to be looping doing the same scanners again and again.. @1N3 it did not work. @1N3 No it does not work for me would it be possible to have one that will auto take everything from the current project that has it do and put everything into 1 older than I name?\nLike what it did back in 2.9.. @1N3 \nI have tried:\nsniper -m airstrike -f filename.txt\nsniper -m airstrike -f path/to/filename.txt\nsniper -f  '/path/to/filename.txt' -m airstrike\nsniper -f /path/to/filename.txt -m airstrike\nsniper --file /path/to/filename.txt --mode airstrike\nsniper -f filename.txt -m airstrike. @1N3 \nmy targets.txt contains ip addresses and it is one per line. ",
    "UbuntuStrike": "hey , thanks for the quick reply ! Yeah I figure it'd take a bit of work and I may look into it myself and report back although as I'm sure you are , I'm short on free time. yes I have custom script for tor to set transparent proxy with socks5 forward privoxy and the issue itself isn't sniper perse but the way nmap and tor interact, often I run JonDo as well to exit out of tor as I never get blocked like nmap does exiting out of tor where ass jondo runs on 127.0.0.1 :4001. for examoe with nikto I'd use the --use-proxy flag where I have it set in the config. anyhow I do appreciate the reply and we'll see how it plays out. Thank you . I have a temporary workaround for my situation with that if anyone else finds helpful is very easy to deploy and that was to simply add \" --proxy http://127.0.0.1:4001 \" to every instance of nmap, no more false closed ports ! . ",
    "ReK2Fernandez": "I will be interested in adding proxy support as well.. at the moment adding blackarch support will create a pullrequest when rdy.. ",
    "lnkakalink": "Hi i re-install \nroot@kali:~/Sn1per# ./install.sh\n                _             \n_  /  /  __\n   / / _ \\ / //  \\/ _ \\/ /\n  (  ) / / // // // /  / /  \n /_// /_// ./_//   \n               /_/                 \n\n\n-- --=[http://crowdshield.com\n\n\n-- --=[This script will install sniper under /usr/share/sniper. Are you sure you want to continue?\ny\n\n-- --=[Installing package dependencies...\nReading package lists... Done\nBuilding dependency tree     \nReading state information... Done\nNote, selecting 'ruby' instead of 'rubygems'\nNote, selecting 'xprobe' instead of 'xprobe2'\naha is already the newest version (0.4.10.6-3).\namap is already the newest version (5.4-4).\ncisco-torch is already the newest version (0.4b-1kali4).\ncurl is already the newest version (7.55.0-1).\ncutycapt is already the newest version (0.0~svn10-0.1).\ndirb is already the newest version (2.22-0kali3).\ndnsenum is already the newest version (1.2.4.2-0kali1).\ndnsrecon is already the newest version (0.8.10-0kali1).\ndos2unix is already the newest version (7.3.4-3).\nenum4linux is already the newest version (0.8.9-1kali2).\nhost is already the newest version (1:9.10.3.dfsg.P4-12.5).\nhydra is already the newest version (8.6-1).\niceweasel is already the newest version (52.3.0esr-2).\nlibxml2-utils is already the newest version (2.9.4+dfsg1-3.1).\nmetasploit-framework is already the newest version (4.16.2-0kali1).\nnbtscan is already the newest version (1.5.1-6+b2).\nnmap is already the newest version (7.60-1).\nphp is already the newest version (1:7.0+54).\nphp-curl is already the newest version (1:7.0+54).\npython is already the newest version (2.7.13-2).\nrpcbind is already the newest version (0.2.3-0.6).\nruby is already the newest version (1:2.3.3).\nsmtp-user-enum is already the newest version (1.2-1kali2).\nsqlmap is already the newest version (1.1.8-1).\nsslscan is already the newest version (1.11.10-rbsec-0kali1).\nsslyze is already the newest version (0.12-0kali1).\ntheharvester is already the newest version (2.7-0kali1).\nunicornscan is already the newest version (0.4.7-1kali2).\nuniscan is already the newest version (6.3-0kali1).\nwaffit is already the newest version (0.9.3-0kali2).\nwhatweb is already the newest version (0.4.8~git20161009-1).\nwhois is already the newest version (5.2.18).\nxprobe is already the newest version (0.3-3).\nzenmap is already the newest version (7.60-1).\narachni is already the newest version (1.5.1-0kali1).\nnikto is already the newest version (1:2.1.6+git20150709-0kali1).\nwpscan is already the newest version (2.9.3-0kali1).\nThe following packages were automatically installed and are no longer required:\n  jsql libass5 libavdevice57 libbluray1 libcoin80v5 libdap23 libebur128-1\n  libevent-core-2.0-5 libevent-openssl-2.0-5 libevent-pthreads-2.0-5\n  libgfortran3 libgraphicsmagick-q16-3 libhunspell-1.4-0 libiso9660-8\n  libjs-mochikit liblua5.1-0 libmad0 libntfs-3g871 libopenscenegraph100v5\n  libopenthreads20 libpango1.0-0 libpangox-1.0-0 libpcre16-3 libperl5.24\n  libqgis-analysis2.14.17 libqgis-core2.14.11 libqgis-core2.14.17\n  libqgis-gui2.14.11 libqgis-gui2.14.17 libqgis-networkanalysis2.14.11\n  libqgis-networkanalysis2.14.17 libqgis-server2.14.17 libqgispython2.14.11\n  libqgispython2.14.17 libqgsttools-p1 libqt5multimedia5-plugins\n  libqt5multimediawidgets5 libradare2-1.1 libsdl2-2.0-0 liburcu4 libuv1\n  libuv1-dev libvcdinfo0 libwebpmux2 libwireshark8 libwiretap6 libwsutil7\n  libx265-116 libx265-95 libxine2 libxine2-bin libxine2-doc libxine2-ffmpeg\n  libxine2-misc-plugins libxine2-plugins linux-image-4.9.0-kali3-amd64\n  python-advancedhttpserver python-alembic python-boltons python-cheetah\n  python-dap python-editor python-formencode python-geoip2 python-geojson\n  python-icalendar python-maxminddb python-mpltoolkits.basemap python-openid\n  python-pampy python-paste python-pastedeploy python-pastedeploy-tpl\n  python-pastescript python-pluginbase python-pyotp python-scgi\n  python-smoke-zephyr python-tempita python-tzlocal\nUse 'apt autoremove' to remove them.\n0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.\nTraceback (most recent call last):\n  File \"/usr/bin/pip\", line 9, in \n    from pip import main\n  File \"/usr/lib/python2.7/dist-packages/pip/init.py\", line 21, in \n    from pip._vendor.requests.packages.urllib3.exceptions import DependencyWarning\n  File \"/usr/lib/python2.7/dist-packages/pip/_vendor/init.py\", line 64, in \n    vendored(\"cachecontrol\")\n  File \"/usr/lib/python2.7/dist-packages/pip/_vendor/init.py\", line 36, in vendored\n    import(modulename, globals(), locals(), level=0)\n  File \"/usr/share/python-wheels/CacheControl-0.11.7-py2.py3-none-any.whl/cachecontrol/init.py\", line 9, in \n  File \"/usr/share/python-wheels/CacheControl-0.11.7-py2.py3-none-any.whl/cachecontrol/wrapper.py\", line 1, in \n  File \"/usr/share/python-wheels/CacheControl-0.11.7-py2.py3-none-any.whl/cachecontrol/adapter.py\", line 4, in \n  File \"/usr/share/python-wheels/requests-2.12.4-py2.py3-none-any.whl/requests/init.py\", line 52, in \n  File \"/usr/share/python-wheels/requests-2.12.4-py2.py3-none-any.whl/requests/packages/init.py\", line 59, in \n  File \"/usr/share/python-wheels/requests-2.12.4-py2.py3-none-any.whl/requests/packages/init.py\", line 32, in vendored\n  File \"/usr/share/python-wheels/urllib3-1.19.1-py2.py3-none-any.whl/urllib3/contrib/pyopenssl.py\", line 47, in \n  File \"/usr/local/lib/python2.7/dist-packages/OpenSSL/init.py\", line 8, in \n    from OpenSSL import rand, crypto, SSL\n  File \"/usr/local/lib/python2.7/dist-packages/OpenSSL/SSL.py\", line 118, in \n    SSL_ST_INIT = _lib.SSL_ST_INIT\nAttributeError: 'module' object has no attribute 'SSL_ST_INIT'\n. Hi i start and have error \nSmartmatch is experimental at /usr/bin/dnsenum line 698.\nSmartmatch is experimental at /usr/bin/dnsenum line 698.\n/usr/bin/goohak: line 13: //: Is a directory\nFile \"/usr/bin/wafw00f\", line 8, in \n    main()\n  File \"/usr/lib/python2.7/dist-packages/wafw00f/init.py\", line 808, in main\n    if attacker.normalrequest() is None:\n  File \"/usr/lib/python2.7/dist-packages/wafw00f/init.py\", line 96, in normalrequest\n    return self.request(usecache=usecache, cacheresponse=cacheresponse, headers=headers)\n  File \"/usr/lib/python2.7/dist-packages/wafw00f/lib/evillib.py\", line 323, in request\n    h.request(method, path, headers=headers)\n  File \"/usr/lib/python2.7/httplib.py\", line 1042, in request\n    self._send_request(method, url, body, headers)\n  File \"/usr/lib/python2.7/httplib.py\", line 1082, in _send_request\n    self.endheaders(body)\n  File \"/usr/lib/python2.7/httplib.py\", line 1038, in endheaders\n    self._send_output(message_body)\n  File \"/usr/lib/python2.7/httplib.py\", line 882, in _send_output\n    self.send(msg)\n  File \"/usr/lib/python2.7/httplib.py\", line 844, in send\n    self.connect()\n  File \"/usr/lib/python2.7/httplib.py\", line 1263, in connect\n    server_hostname=server_hostname)\n  File \"/usr/lib/python2.7/ssl.py\", line 363, in wrap_socket\n    _context=self)\n  File \"/usr/lib/python2.7/ssl.py\", line 611, in init\n    self.do_handshake()\n  File \"/usr/lib/python2.7/ssl.py\", line 848, in do_handshake\n    match_hostname(self.getpeercert(), self.server_hostname)\n  File \"/usr/lib/python2.7/ssl.py\", line 282, in match_hostname\n    % (hostname, ', '.join(map(repr, dnsnames))))\n.  ./install.sh \n\n'apt autoremove' to remove them.\n0 upgraded, 0 newly installed, 0 to remove and 28 not upgraded.\nTraceback (most recent call last):\n  File \"/usr/bin/pip\", line 9, in \n    from pip import main\n  File \"/usr/lib/python2.7/dist-packages/pip/init.py\", line 21, in \n    from pip._vendor.requests.packages.urllib3.exceptions import DependencyWarning\n  File \"/usr/lib/python2.7/dist-packages/pip/_vendor/init.py\", line 64, in \n    vendored(\"cachecontrol\")\n  File \"/usr/lib/python2.7/dist-packages/pip/_vendor/init.py\", line 36, in vendored\n    import(modulename, globals(), locals(), level=0)\n  File \"/usr/share/python-wheels/CacheControl-0.11.7-py2.py3-none-any.whl/cachecontrol/init.py\", line 9, in \n  File \"/usr/share/python-wheels/CacheControl-0.11.7-py2.py3-none-any.whl/cachecontrol/wrapper.py\", line 1, in \n  File \"/usr/share/python-wheels/CacheControl-0.11.7-py2.py3-none-any.whl/cachecontrol/adapter.py\", line 4, in \n  File \"/usr/share/python-wheels/requests-2.12.4-py2.py3-none-any.whl/requests/init.py\", line 52, in \n  File \"/usr/share/python-wheels/requests-2.12.4-py2.py3-none-any.whl/requests/packages/init.py\", line 59, in \n  File \"/usr/share/python-wheels/requests-2.12.4-py2.py3-none-any.whl/requests/packages/init.py\", line 32, in vendored\n  File \"/usr/share/python-wheels/urllib3-1.19.1-py2.py3-none-any.whl/urllib3/contrib/pyopenssl.py\", line 47, in \n  File \"/usr/local/lib/python2.7/dist-packages/OpenSSL/init.py\", line 8, in \n    from OpenSSL import rand, crypto, SSL\n  File \"/usr/local/lib/python2.7/dist-packages/OpenSSL/SSL.py\", line 118, in \n    SSL_ST_INIT = _lib.SSL_ST_INIT\nAttributeError: 'module' object has no attribute 'SSL_ST_INIT'\n. ",
    "psychomad": "Hi\nThanks for answer, the problem is not with nuke option but directly invoking sniper.\nEven if i invoke \nlabs@labs# sniper 192.168.1.99 report\n/usr/bin/sniper: riga 324: /sniper: File o directory non esistente\nbasically after update i can't add any options\nJust want to understand if i made some mistake after update. Hey\ni tried....\nsniper update\n + -- --=[Sn1per v2.6 is available to download... To update, type \"sniper update\"\n                _\n    _  /  /  __\n   / / _ \\ / //  \\/ _ \\/ /\n  (  ) / / // // // /  / /\n /_// /_// ./_//\n               /_/\n\n-- --=[http://crowdshield.com\n\n-- --=[sniper v2.6c by 1N3\n\n\n-- ----------------------------=[Running Nslookup]=------------------------ -- +\nServer:         192.x.x.x\nAddress:        192.x.x.x#53\n\n\n** server can't find update: NXDOMAIN\nHost update not found: 3(NXDOMAIN)\nNo luck. \n. Hey\nGreat job, now everything work fine... thanks a lot!\n. ",
    "Jinovas": "That's pretty much what I've been doing to update it. \nI did have a couple general questions but I'll post them later when I have a bit more time. =) . UPDATE2: ran nikto scan separately and it didn't break the connection. @_@ . Ok I'll give it a shot today. \nI'm still not sure if it's possibly my VPN (pia)  or what. But I know running nikto separate it doesn't break. I'll play around with it some more =) . It looks like it might actually be the VPN itself after looking at a few error logs. I'm waiting to hear back from PIA support to verify and see what they say. . Sorry, forgot to update this a while ago. But turns out it was a miss-configuration with OpenVPN and PIA. Now it works without disconnecting :). It does for me too but I'm not sure off-hand if it's using updated database or? I'm just curious because the same one that's pulled down during the install ran by itself has updating bug due to the fact that exploitdb now has a captcha on their search page. @_@. No worries! I just did ran the sniper upgrade on my desktop VM and it didn't actually have those messages nor did it actually override the version I had on there(which was the same versions of sniper and go I had installed on my laptop). So I think it was probably just a one time thing and another sign of me needing to re-setup my laptop again lol. I did have something minor issue with \"recon\" mode and it not finding the domain save files but I'll double check it on my VM to make sure it just not my laptop being dumb and if it happens on my desktop I'll let you know in separate bug :). Ok will do! I'll do it later tonight after work. \nThx! :). Good news! Amass looks like it's working normal as well as subfinder. Yay! :). ",
    "gbiagomba": "Ya it works, thank you! But ya i thought you would like that. @menzow Unfortunately I do not have the original output but I am running Kali Linux 2. But thank you for getting back to me @menzow . @menzow Apologies for the tardy reply, I was able to manually update to 2.8, I have checked sniper to see if there was a new version but I will check shortly and let you know if I come across anything!. I did not get any issues with running sniper update, i can try it on another build I have to see if it works. @xenonfox You should probably open a separate ticket for that request.... @1N3 Thank you for getting back to me. So I tried running sniper update again and it installs a bunch of stuff but doesn't recognize that the update was done. So when I enter sniper update again I get the above prompt. . I just tried running the install script and it still doesn't recognize that version 2.9 is installed. I saw the uninstall issue and followed it, so I ran the following commands\nrm -Rf /usr/share/sniper/\nrm -f /usr/bin/sniper\nThen I tried downloading it from git and installing it, and I still get the same error. It turns out when I did a git pull in Sn1per it didnt update the files. I removed the git file and re-downloaded it. I uninstalled it and reinstalled it and it now works under 2,9. But the update function in version 2.8 wouldnt let it update to 2.9...just an fyi. @pentester123 can you share the output of when you run sn1per loot? because I used it today and it worked fine for me. So maybe if we see output we can better understand what may have gone wrong.. @1N3 I think it might be safe to close this now since @pentester123 has not responded in over a month. I still ran into this issue when upgrading to version 4.4 if memory serves me right. . Thank you for the update!. Ah!. Thank you!. Thank you, at least PDF would be good, because I can send that to \"technical managers\" . @Cheban1996 come again?. I will run it again tonight and I will check if it happens again. \nJust so you know version 4 still has it. Yes it does thank you. Thank you!. So I just tried to update it and version 4.0 is still in master not 4.1. Okay, version 4.1 has not been uploaded yet, I will upgrade when it gets posted. Got it, thank you. understood, thanks again. Hello @ppazos ,\nFor the lock command, it sounds like either \nA. Something else was being installed simultaneously (e.g., apt was running independent of this install doing something else) \nB. If you are not running the install script as root, it could be a permissions thing. \nAs for the token error, am not entirely sure...looking at his code everything looks fine but than again I could be wrong so I will direct that to @1N3 \nOut of curiosity, can you share what version of sniper your running and screen output?. Awesome thank you sir. Just an FYI - I upgraded to version 4.4 and the issue is still there. @1N3 thank you good sir. I was able to fix it. ",
    "xenonfox": "there are some bugs with ur programme its not making the dir in the form of\nntfs partition so plz re debug the code and forward it to evaluate .\nOn Thu, Sep 28, 2017 at 5:36 AM, 1N3 notifications@github.com wrote:\n\nHi, thanks for the heads up. This is definitely a known issue I've been\nmeaning to find a solution to due to the way hydra handles/tests basic\nauthentication against sites that do not have basic auth enabled. I may\ndisable basic auth checks or use another tool but will leave this open in\nthe meantime.\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/1N3/Sn1per/issues/101#issuecomment-332689782, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/Ab1CMKxP5v1nfkwdtRWYGyvBe1I0XjZhks5smuMbgaJpZM4Phu2e\n.\n. \n",
    "mother2110": "just reinstalled and it is working ... Thanks.  + -- --=[Enter a name for the workspace:\nLot781\n + -- --=[Generating reports...\n + -- --=[Removing blank web screenshots...\n + -- --=[Starting Metasploit service...\n + -- --=[Importing NMap XML files into Metasploit...\n[-] Failed to connect to the database: could not connect to server: Connection refused\n    Is the server running on host \"localhost\" (::1) and accepting\n    TCP/IP connections on port 5432?\ncould not connect to server: Connection refused\n    Is the server running on host \"localhost\" (127.0.0.1) and accepting\n    TCP/IP connections on port 5432?\nUnable to handle kernel NULL pointer dereference at virtual address 0xd34db33f\nEFLAGS: 00010046\neax: 00000001 ebx: f77c8c00 ecx: 00000000 edx: f77f0001\nesi: 803bf014 edi: 8023c755 ebp: 80237f84 esp: 80237f60\nds: 0018   es: 0018  ss: 0018\n. Thanks. I will give that a go.. Sorry. It worked. Thanks. ",
    "SaberSecurity": "Hey, Thanks for the quick reply. \nSniper is really a fantastic tool, I really like the way it works. \nLooking forward for the fix. . Tool is automated in an efficient way, but creating workspace for every attack is making the user to sit all they way till tye complete process ends. \nThought that if workspace step is automated/skipped it will better for the user. \nThanks a lot for giving the (optional) switch. (y). ",
    "ProfDrPikachu": "Thank you for the Fast Response!\nIm uninstalling it because i tried to use it on my Debian (8) VPS. A Small part worked but it ended with error code 4 and 5. If you need any Logs before i delete it just tell me :)\nAny ideas for making it work on my VPS Running Debain?. whats the File you need for maybe helping me?. i needed to install metaspolit by hand but all other things didnt got installed. and it looks like all the programms he should try to install werent in the sources.list. http://prntscr.com/hc6ezo. I like your Project and i will do it :) Just wait a couple hours.. https://youtu.be/zOaDdEP3030 This is the Link to the Video. its Private. Sorry that its around 20 Mins. At the end it Crashed the SSH and the only fix was to Restart the VPS :/\nPlease Message me for a Fix and i hope i can Help you with providing you with Informations.. At the Start there are errors. Looks like Following packets are not installed. (Maybe not in the Apt-Get Repo)\n-xporbe2 (line 1105)\n-metagoofil (line 1112)\n-dnsenum (line 1115)\nAnd one Bug\n[:== Unary operator Expected \n(Line 1224. Ruby\nHydra\nWafw00f\nWhatweb. Cutycapt is missing. All of the Packs i Told you are missing. Maybe Check them.. ",
    "HacKanCuBa": "Check the PR #115 . ",
    "Cheban1996": "How It's making. ",
    "Clutchisback1": "Dude... awesome! Any ETA on that release! This is my first time ever submitting a question, so thank you for your patient and quick response!. ",
    "d0nu75": "any update on this?  Would be awesome to have.. ",
    "Kaicastledine": "No worries :). ",
    "ppazos": "@1N3 I'm on Linux Mint 17.3, based on Ubuntu 14.04. @1N3 thanks! is there any documentation with the list of dependencies that I can use to install required packages manually?. @1N3 interesting, if dependencies are on the install, why not all of them get installed during the installation process?. gotcha!. @1N3 one last question, I decided to create a VM with Kali. Is there a way to uninstall the packages installed by the failed install on linux mint?. wonderful. Hey @gbiagomba \nI installed a clean & new Kali downloaded yesterday.\nThe Sn1per install was running as root.\nThe same for Sn1per, I downloaded the latest version from master yesterday by git clone https://github.com/1N3/Sn1per.git\nYou can see here, there was an issue with some merge\nhttps://github.com/1N3/Sn1per/blob/799ead64bbba8b075ca4964fe0e8593ad440da57/sniper#L220-L224. The change was from about 12 hours ago, bad luck for me https://github.com/1N3/Sn1per/blame/799ead64bbba8b075ca4964fe0e8593ad440da57/sniper#L220-L224. +1 will pull again. ",
    "pgd988": "yep  there is bug for workspace. It create divided directory for any IP in nuke list into loot. And one directory for workspace name seted by -w with report txt file.. ",
    "m4d3bug": "but also return this when i installing:\nve unmet dependencies:\n arachni:i386 : Depends: ruby:i386 but it is not going to be installed or\n                         ruby-interpreter:i386 but it is not installable\n                Depends: bundler:i386 but it is not installable\n eyewitness:i386 : Depends: python:i386 but it is not going to be installed\n                   Depends: python-bs4:i386 but it is not installable\n                   Depends: python-fuzzywuzzy:i386 but it is not installable\n                   Depends: python-levenshtein:i386 but it is not going to be installed\n                   Depends: python-netaddr:i386 but it is not installable\n                   Depends: python-pyasn1:i386 but it is not installable\n                   Depends: python-pyvirtualdisplay:i386 but it is not installable\n                   Depends: python-qt4reactor:i386 but it is not installable\n                   Depends: python-selenium:i386 but it is not installable\n                   Depends: firefoxdriver:i386 but it is not going to be installed\n                   Depends: python-openssl:i386 but it is not installable\n                   Depends: python-rsa:i386 but it is not installable\n                   Depends: python-service-identity:i386 but it is not installable\n                   Depends: python-twisted:i386 but it is not installable\nby the way,my platform note is \nLinux xxxxxxx 4.9.59-v7_Re4son-Kali-Pi+ #1 SMP Tue Nov 21 00:36:47 CST 2017 armv7l GNU/Linux\n. it seem i can't install arachni:i386&eyewitness:i386 in my platform.is there any problems will affect use?. u just remind me,i will return when i finished full-upgrade.. when i finished full-upgrade,the problem still inside when i am installing.\nThe following packages have unmet dependencies:\n arachni:i386 : Depends: ruby:i386 but it is not going to be installed or\n                         ruby-interpreter:i386 but it is not installable\n                Depends: bundler:i386 but it is not installable\n eyewitness:i386 : Depends: python:i386 but it is not going to be installed\n                   Depends: python-bs4:i386 but it is not installable\n                   Depends: python-fuzzywuzzy:i386 but it is not installable\n                   Depends: python-levenshtein:i386 but it is not going to be installed\n                   Depends: python-netaddr:i386 but it is not installable\n                   Depends: python-pyasn1:i386 but it is not installable\n                   Depends: python-pyvirtualdisplay:i386 but it is not installable\n                   Depends: python-qt4reactor:i386 but it is not installable\n                   Depends: python-selenium:i386 but it is not installable\n                   Depends: firefoxdriver:i386 but it is not going to be installed\n                   Depends: python-openssl:i386 but it is not installable\n                   Depends: python-rsa:i386 but it is not installable\n                   Depends: python-service-identity:i386 but it is not installable\n                   Depends: python-twisted:i386 but it is not installable\nE: Unable to correct problems, you have held broken packages.\nthis platform is my Kali-Pi\n4.9.59-v7_Re4son-Kali-Pi+ #1 SMP Tue Nov 21 00:36:47 CST 2017 armv7l GNU/Linux\nby the way,i try in two machine,they both got the same return when i run \"sniper -u\"\nsniper -u\n/usr/bin/sniper: line 220: syntax error near unexpected token <<<'\n/usr/bin/sniper: line 220:<<<<<<< HEAD'\nthese platform are \n4.9.59-v7_Re4son-Kali-Pi+ #1 SMP Tue Nov 21 00:36:47 CST 2017 armv7l GNU/Linux\n4.14.0-kali3-amd64 #1 SMP Debian 4.14.17-1kali1 (2018-02-16) x86_64 GNU/Linux. ",
    "fb11": "I'm getting the same error. I made updates.\nuname -a \n4.14.0-kali3-amd64 #1 SMP Debian 4.14.12-2kali2 (2018-01-11) x86_64 GNU/Linux. ",
    "samsesh": "\nfixed bug!!. ",
    "0xCC32": "i have same issue too.\ni tried full path and even copying targets file in it's dir and didn't work\n. yea it works fine now.\ni guess it lacked of -w parameter for workspace even in airstrike and that wasn't described in airstrike parameters. ",
    "JayT33": "Anytime!\nJustin Cole\ncole.justin.thomas@gmail.com\nOn Sun, Mar 25, 2018 at 11:00 AM, 1N3 notifications@github.com wrote:\n\nThanks!\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/1N3/Sn1per/pull/140#issuecomment-375981293, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/AYOB4cbJsNn0uRIw5tl4TBKbV1YtHbftks5th781gaJpZM4S6MAQ\n.\n. \n",
    "jaikishantulswani": "Hello @1N3 any workout to resolve this issue ?. @1N3 No, I am running it with single target only ! Any workout to resolve ?. @1N3 , I have also tried it with different targets but result in error is the same, stuck at xsstracer, is that possible to skip that xsstracer event?. Done !. ",
    "akrolla": "sudo sniper --update. ",
    "MiteshShah": "Okay :). ",
    "jauharvp": "Great, I found the update on twitter. \nKudos and Thanks @1N3 . ",
    "Lz1y": "sooo thanks！. ",
    "recoverycount": "maybe i'm wrong but you can exploit the same targets with ms17 replacing ms08, but its true ms08 still exploitable, thanks for sn1per!. ",
    "1522402210": "\n. @1N3 oh..  thank you~. i used sniper -t baidu.com -b\nit does not work also..\n\n. ",
    "moorer2k": "Also, I am using GVM to manage my go installation. Would be nice to maybe add support for this in the future when detecting the go path!\nAmass always seems to have issues for me when tunneling through tor. However, by using \"-nodns\" feature, it works great and quick. Might be worth trying in the script so it doesn't hangup on amass. \n^ Scratch that. Realized you're using IP scanning, not domain names. I just changed this to amass -whois -nodns, it proceeds fine. Probably will break something later, but it works for now.. Another thing I noticed, you may want to change that \"/pentest/recon/dnscan/dnscan.py\" to the proper path. I see you have it in there another time properly, but it def throws an error when it hits this.. Thanks. I know there are some limits, given it's a bash script, but it's def one of the more promising ones I've seen in the less noisy automation game, especially dns related. \nAlso a note about my previous problems with dns resolution (using nodns), it was actually on my end. Looks like my pi-hole might of had a hickup.. ",
    "ojaschauhan44": "i updated to latest but in that amass does nothing?? it just shows amass\nGATHERING DNS SUBDOMAINS VIA SUBLIST3R \n=================================================================================\n GATHERING DNS SUBDOMAINS VIA AMASS \n=================================================================================\n GATHERING DNS SUBDOMAINS VIA SUBFINDER \n... then move in to next scans......\n. SubFinder gets some domains but amass/sublist3r never do. no result is\nshown its just name pops up and then shuts down.\nand problem with report too no image is shown.\nyeah please look it up in kali.\nthankyou\nOn Wed, Sep 5, 2018 at 6:48 AM 1N3 notifications@github.com wrote:\n\nHi, are you able to run amass/sublist3r against the target standalone to\nsee what the difference in results are? If no subdomains are found, there\nmay not be any that the tool has found. Also, regarding the scan\nprogress/speed, brute forcing subdomains and web files can take while (This\nis normal). Best to either switch to a less intrusive scan mode like\n\"stealth\" mode or \"normal\" mode to brute force less files or wait. I'll do\nsome testing on a fresh kali box to see if I can reproduce.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/1N3/Sn1per/issues/174#issuecomment-418567652, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/AXGYwpoUzcbggOiwEjpH93Xy3_2qL4Nvks5uXyZPgaJpZM4WYzFc\n.\n. \n",
    "decapstrike": "Hey, sorry for the delay in responding and your quick answer! Could sniper potentially open the shell in a second window? Then proceed with testing in the main window? . An alternate idea, maybe easier to implement : a mode where it DOES close the shell upon exploit, and on conclusion of the scan, a section in the report listing all successful exploits, possibly with some type of “ranking” or “recommended” ordering with description. Could even go one step further and offer a mode that’s sort of a “post scan” version, which allows you to select from the list the scan identified. . ",
    "goyalvartul": "I tried Mac and Linux\nOn Sat, Oct 13, 2018, 08:49 xer0dayz notifications@github.com wrote:\n\nHi, looks like the sniper script isn't installed. Which OS are you running\non and have you tried running the install.sh script yet to install sniper?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/1N3/Sn1per/issues/177#issuecomment-429506824, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/ARZ2_f1VIgteRWIHET5O7UOfWqfSJ7Tiks5ukVvGgaJpZM4XMVPq\n.\n. \n",
    "fr0stedfl4ke": "Update looping still exists, but for the existing version. The tool found an update, downloaded and installed applicable tools. Ran update once more and it states that there's a new update. \n\n. The output states 6.0. After I run sniper -u, the tool confirms Sn1per is up-to-date. This must have been a internet connection issue on my end. Thanks for pointing that out.. ",
    "saczysmark": "Hi,\nnow it works. Thank you. . "
}