{
    "danpastori": "This is now handled through an HTML5 range input.\n. This is complete.\n. All the configs are JSON\n. Touchstart events are now bound for mobile devices allowing for amplitude to have better UX through the web.\n. These are now HTML5 range inputs so they have much better support.\n. The entire amplitude app is now configured through JSON object.\n. Vertical volume bar support has been added.\n. The amplitude config JSON now controls all of the elements and playlist. No need to even add an audio tag.\n. Default volume specification has been added to the amplitude config.\n. The volume and track sliders are now HTML5 range inputs.\n. This is enabled in Amplitude 2.0\n. I think you got this one taken care of, thanks man!\n. I just added the song-time-visualizations for multiple song indexes.  To uses this just add a class of amplitude-song-time-visualization with an attribute of amplitude-song-time-visualization-index and set it equal to the index of the song.\n. I just added a mute control for multiple players and pushed the changes.\n. This has been added in the newest release: https://open.521dimensions.com/amplitudejs/docs#adding-a-repeat-button\n. This is enabled in Amplitude 2.0 update.  You'd need to do a class on an element of 'amplitude-pause' then add the attribute for which index in the config it is. Such as: 'amplitude-song-index=\"3\"'.\n. This issue should be resolved in the Amplitude 2.0 update since there isn't a variable 'amplitude_config' but a public method that configs amplitude.\n. This is resolved in the newest update: https://open.521dimensions.com/amplitudejs/docs#autoplay\n. Awesome! Thanks for solving this!\n. Made a public function Amplitude.playNow() which accepts a JSON song.\n. This won't be included in AmplitudeJS. This can be done using the public facing API using 3rd party libraries such as: http://bernii.github.io/gauge.js/. This has been added to version 3.2 and pushed. Appended to active_metadata.\n. Thanks for the pull request. Sorry for not getting back sooner, its been a bit crazy around here. We released Amplitude 3.0, so now this has a merge conflict.\nWhat I will do is take what you have and updated it to work in Amplitude 3.1 on the next release.\nThanks for your contribution!. Hi @mathieuforest ,\nI believe this is my lack of updating documentation, my bad! Add, \nuse_visualizations: true\nIn your init function:\nEx:\nAmplitude.init({\nuse_visualizations: true\n})\nLet me know if that solves your issue.. We were running to so many issues with visualizations and CORS with cross domain visuals, I turned them off by default.\n. Hi @jinpark, this should be resolved in the update, sorry for the late reply! Let me know if it fixes it!\n. Hi @jimlee2 thanks for finding the bug. The visualizations from some remote sources (Soundcloud specifically based off of which CDN) has always been an issue with Amplitude 2.0.  It has to do with the CORS header sent over. The skipping has to do with the CDN not sending over chunked bytes. We will have to update that bug on the open.521dimensions.com site.  Are you using visualizations with your player? If you are hosting locally and using visualizations, that's completely fine but remote soundcloud with visualizations is a 50/50.  You can turn visualizations off in the amplitude_config by setting \"visualizations\": false. The \"InvalidStateError: An attempt was made to use an object that is not, or is no longer, usable amplitude.js (line 316)\" is caused by the Web Audio API not being able to visualize the song.  If you turn off visualizations and try your remote source it should work as long as the server you are streaming from has CORS set up correctly.  If you check out the Inspector on Chrome and check the Network -> Response Headers, there should be a header that says: 'Access-Control-Allow-Origin:*'.  Let me know if that solves your problem and if you have any sample code. I'll be working on updating the examples with amplitude 2.0. The changes from 2.0 on will not require an entire re-write. Amplitude 1.0 was mainly an experiment, 2.0 is modular so I plan on keeping it the same and just adding features.\n. Hi @utopiajj @rainman20  I just made a huge push which should have resolved some of the issues. I had some errors in Amplitude with some features that I was adding that accidentally got pushed. Please let me know if the new version resolves these issues. If you are using visualizations, please be cautious with CORS errors and you will now have to add \"use_visualizations\": true in your init function.  I had it messed up that it would pipe to audio API elements even if there weren't visualizations being used which caused errors.\n. Thanks for the heads up, I added the new tag. Let me know if this resolves the issue!\n. Thanks! I just added this feature, let me know if this works out! The documentation is here: https://open.521dimensions.com/amplitudejs/docs#autoplay\n. I will add this to the next release. We will have a config to handle how the ending of a song should be handled.. Hi @DarioSoller ,\nThanks for the feedback! Just a quick question on your implementation. If you have main controls, do you have the 'amplitude-main-play-pause=\"true\"' attribute added to them? That should solve the issue and control whatever song is playing. If you have an individual play button or a row that reacts to a click for a different song, those have the indexes. With the attribute applied it should be in sync with the other songs. Let me know if that works, or if you have any more questions!\n. Hi @quoid ,\nSo the issue lies in a bug I fixed and am currently documenting. What is happening is a design flaw I had in AmplitudeJS where it listens to the document ready event and binds the elements. Since you are making an AJAX request on page load, there are no elements present to bind to. I have updated and added some more features. \namplitude.js.zip\nThe functionality you have should remain the same. Amplitude will now bind ON init instead of ready so when you load your songs and your callback runs the init function, the functionality should be bound. Let me know if this solves the issue and if any help is needed! Site is looking great BTW!\n. Awesome glad to hear it worked! Thanks for the feedback too, I never thought about some of the Soundcloud events. I'll definitely add them to the todo list!\n. Callbacks are now functions in 4.2. Hi 5ch1ll1ng,\nYup this is totally possible. If you want a soundcloud link in a different place, you can bind to a specific index and create a player outside of the div. On her site, she has a \"main\" player div. Check out: https://open.521dimensions.com/amplitudejs/docs#adding-a-pause-button. Let me know if that helps!\n. Thanks for the feedback! I'd love to see the site when you are done with it. Things got real busy for me, but I'm hoping to push a new update for Amplitude in June along with some new docs/site and would love to have some example sites.\n. Sorry for not getting back to you sooner, it's been really busy for me the past 12 months or so. I was able to address this issue in Amplitude 3.0. If you do a skip to link, documented here: https://521dimensions.com/open-source/amplitudejs/docs#skip-to-link it should address the issue.\n. Thanks for the pull request, but I addressed this here: https://github.com/521dimensions/amplitudejs/issues/53#issuecomment-230127962. Hi @blushi,\nI see the bug that you found. I just pushed a release of 2.3 a couple minutes ago. The big change with 2.3 is you have to call the Amplitude.init() function when you are ready to initialize Amplitude. I have a feeling this will solve your issue. There are no breaking changes. If this doesn't solve the issue, could you do a PR I can take a look and merge your code.\nLet me know if you have any questions!\nDan\n. Hi @mrcury,\nI just added a method to access the index of the track that is currently playing. To get the index, you'd just run: Amplitude.activeIndex() and it will return the index of the track that is now playing. You just have to download the new AmplitudeJS that I pushed.\nIf you need more meta data for the song, you can add any data to the song object when initializing amplitude, and retrieve that data with Amplitude.getActiveSongMetadata(). That will return whatever you have in the song object.\nLet me know if this works!. Thanks for your pull request and sorry for not getting back to you sooner. It's been really busy for me the past 12 months or so, but I was able to address this issue in Amplitude 3.0.\nBe sure to check it out! It has a ton of new features, bug fixes, and it's even easier to contribute to the repo now.\nAny questions, let me know. Thanks again for your support!. This should be complete. This has been completed in 4.0. Whenever the package.json file has been updated, the version number is replicated through out the app.. This is what should be supported since everything revolves around the HTML5 audio element: https://www.w3schools.com/html/html5_audio.asp. Please test thoroughly and confirm for display.. This has been added to version 3.2 and pushed. I believe this has something to do with the 'canplaythrough' attribute.. This is actually only a bug in Chrome: https://bugs.chromium.org/p/chromium/issues/detail?id=593273 When they release a patch, we can hopefully account for it. I see a few people have the same issue. It shouldn't affect the functionality of the player. Even when it happens, the song plays as it's supposed to.. Hi @masiha68 ,\nIf you are dynamically adding a songs to a page with Amplitude 3.0 you will have to run Amplitude.bindNewElements() to add songs to the page. Hopefully this helps! . Also, if you need to explicitly stop the song you can always run Amplitude.pause() from anywhere in Javascript which should help!. I narrowed this down a ways because not all config variables should be opened up to be edited.. We can also use this to ensure 100% playability in all browsers. This has been added to version 3.2 and pushed. This has been added in version 3.2: https://521dimensions.com/open-source/amplitudejs/docs#get-songs-in-playlist-(version-3-2). Hi @jaydrogers & @LordBonzi I just built the sample player from the website and added it to the repo. I did not include the .mp3 files in the repo, but everything else should be ready to rock and roll. You can find the example on the dev branch here: https://github.com/521dimensions/amplitudejs/tree/dev/examples \nThere are a load more examples I want to do to show the flexibility of AmplitudeJS so stay tuned!. This is due to IE 9 not supporting a classList. IE 9 is not supported anymore.. @Darker & @jaydrogers The documentation has been added in this commit: https://github.com/521dimensions/amplitudejs/commit/d6c458c130aed170a8cbc79e18a643d67d789401. @fiter92 I fixed the issue thanks to your solution. The window callback was left over code from 2.x. Thanks for your help! Before I close, @Darker I'll add the documentation. @Darker The documentation has been added. My bad, I left a sentence like mid way through: https://github.com/521dimensions/amplitudejs/commit/b20f7369b340aea78832b2f0b66aba12165bade6. I've been thinking about this. What would make this method more useful? In AmplitudeJS 3.2 I opened up a lot of public methods to access the core state and make changes to the core state which will definitely help with debugging or printing to the console. I'm not going to close this right now, but if we could brainstorm a few ways to make the debug method better that'd be great!. @carlsmith is right, this is fixed. We just need to make sure the headers are correct when scrubbing the song. To adjust on a finer value, we just need to set the step attribute of the input to be smaller for larger screens.. Hi @hitaloramon. That's a great idea! I haven't exposed those methods publicly yet. Look for them in 3.1 though ;) We are looking to merge the dev branch early next week!. Hi @hitaloramon, the changes have been pushed to the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev You can now run Amplitude.next() or Amplitude.prev() or Amplitude.next( playlistIndex ) or Amplitude.prev( playlistIndex ). I will add documentation support for these as well.. @lacymorrow Thanks for reaching out! If you have some customized skins and would be willing to make some example players that would be awesome! Even if they are just the HTML/CSS mock ups for players, that'd be awesome! I can add the amplitude markup. The more examples the better! I want to add a gallery of players on our home page and I could link to your site!. @freedomlives & @theefunklord I think the solution would be to structure the page in a single page app type structure: https://vuejs.org/ or https://angular.io/ can solve the issue. The routers for both of these front end frameworks allow for HTML5 History edits so you can link to individual pages. You can then start a song and load up pages while not refreshing the song so it continuously plays throughout navigation. \nIn 3.2 I'll expose the skip to function which will allow you to skip to any location in a specified song. This way you could store the time of the song in session storage and re-load on page initialization.. All of the features should be updated and ready to rock and roll here: https://521dimensions.com/open-source/amplitudejs/docs. This feature was added in this commit: https://github.com/521dimensions/amplitudejs/commit/685e72aeaadec5c73c29dac7dc555bdd67bd018d\n. This is completed and documented here: https://521dimensions.com/open-source/amplitudejs/docs#get-version-(version-3-2). @fiter92 Awesome you are using Amplitude with VueJS, I've been thinking about doing a component for awhile. I love VueJS and would want Amplitude to be coupled really easily with it.\nAnyways what is your use case? Do you have a library of songs on a server and you want to update a list dynamically?. @enemyss I'd do a solution like the following: Start with 10 songs, add 10 more songs. Once you add another 10 songs remove the first 10. Does that make sense? Then you wouldn't be needing to pause the song because it's being removed from the songs array. Or am I missing what you are trying to accomplish?. @snote did you need any more support with this issue?. @jaydrogers Are we looking for AmplitudeJS to auto fill data on load? This is something I considered, if so I'll re-tag this as a feature to have Amplitude fill in the data on load.. Hi @foysalremon,\nYou can definitely add multiple players to each page. You would initialize all of the songs you want in the Amplitude config function and then you would reference the index of these songs in each individual player. You can also have multiple playlist players on a single page. I will make some examples of how this is done and upload them to the site.. @foysalremon Did you get this figured out? If so I'll close the issue. Otherwise I can provide an example with multiple players on the page. AmplitudeJS supports multiple playlists and players. Do you have a link to your set up? What could be happening is the way your set up is hosted your server isn't sending out the byte range headers for the music. Usually this is defaulted but sometimes on live sources it is not. If you have a link to where you are developing I can take a look. It's a header in the song source. . @jaydrogers adding a troubleshooting/common issues section to the documentation would be a great idea. I'll do that.. I added the documentation and a quick tutorial for version 3.2 here: https://serversideup.net/set-song-played-percentage-amplitudejs/. This has been fixed in the following commit: https://github.com/521dimensions/amplitudejs/commit/0b0af09e54c441bca47cbbee4875b4f74928dc3a. @Rulsky Thanks for providing such an awesome reproducible issue, that helped a ton to fix the issue. So I had an undefined variable with SoundCloud which is fixed here if you pull the dev branch:\nhttps://github.com/521dimensions/amplitudejs/commit/098c52a965acd14edb3fab4b959e338dfd32c7dd\nAs for your play pause button you have to add the attribute: amplitude-main-play-pause=\"true\" to the button since it's a main play pause button. I was able to test in plunkr and it should be good to go!. @mistermantas That's a cool use case, I added the functionality in the last push to the dev branch here: https://github.com/521dimensions/amplitudejs/commit/5375f70cf6dc6f1870663713479b458979ad92dd\nIf you grab the dev branch you can use the following methods:\n- Amplitude.getSongs() -> Returns all of the songs in the songs array.\n- Amplitude.getSongsInPlaylist( playlist ) -> Gets all of the songs in a playlist\n- Amplitude.getSongsState() -> Gets all of the songs with respect to the shuffle state. If shuffle is on, then it gets the songs in the order they are shuffled.\n- Amplitude.getSongsStatePlaylist( playlist ) -> Gets all of the songs in a playlist with respect to the shuffle state. If the playlist is shuffled, gets the songs in the order they are shuffled.\n- Amplitude.getActiveIndex() -> Gets the active index of the player\n- Amplitude.getActiveIndexState() -> Gets the active index of the player with respect to the state.\nYou can use these in combination for showing the next and previous songs in your list. Let me know if this helps!. @mistermantas Version 3.2 has been pushed, so these should be stable and ready to rock and roll!. So the best way I could figure out how to do this is by implementing the progress as an HTML5  tag. I also added 2 new public methods in AmplitudeJS 3.2 The first one gets the song played percentage. This way you can access how much of the song has been played: https://521dimensions.com/open-source/amplitudejs/docs#get-song-played-percentage-(version-3-2) \nThe second is set the song played percentage: https://521dimensions.com/open-source/amplitudejs/docs#set-song-played-percentage-(version-3-2) \nI also wrote a quick tutorial on how these two work together here: https://serversideup.net/set-song-played-percentage-amplitudejs/\nEssentially you can work with both methods and implement your own tracking/progress feature so you can style it the way you like. You can do some cool tricks with the HTML 5 Range element for styling, but I definitely see how it can be a pain especially styling what has been played vs not played.  The progress element should allow for that easily. I also added a buffered progress bar which can be used with the song tracking progress bar to make an all in one progress bar. Docs for that are here: https://521dimensions.com/open-source/amplitudejs/docs#song-progress-bar-(version-3-2). We now export a source map on build. See dev: https://github.com/521dimensions/amplitudejs/tree/dev. I'll definitely be looking into this. I'm not too good at CSS so I'll be researching some BEM stuff. Thanks!. If you have an example of a BEM styled player, that'd be great! I have another example I want to use, but want to make sure it's ready to rock and roll before I push it. The documentation has been updated. These have been fixed and pushed. Thanks for the heads up!. So this is something I'm still trying to figure out. I want to add a way to auto loop through kind of \"reactively\" like you would in VueJS/ReactJS. The issue is the song durations. I'm trying to figure out a way we can preload the song durations for all objects. This is still in development. This has been removed in AmplitudeJS 3.2. This is cleaned up and pushed in AmplitudeJS 3.2. Thanks for the heads up!. @rowild This is definitely a good idea! Do you by any chance have any resources for better explanation on doc blocks? It's been awhile since I've thoroughly dove into them. I'd like to grasp them for the next release. @Thatkookooguy & @rowild I added the song_change callback to AmplitudeJS 3.2. The documentation for that is here: https://521dimensions.com/open-source/amplitudejs/docs#callbacks I also added a callback example. Thanks for the idea!. @tveloq Thanks for the heads up! So this is fixed in Version 3.2 which was pushed today. We are updating our marketing site and it will be fixed on there in the next hour or so for an example! Thanks for the kind words too and let us know if there's any other issues.. Awesome, no problem! Let us know if you need any more help!. Hi @BronzeCrab,\nThis functionality is similar to how Spotify works and will repeat after the playlist has completed playing. I will look into adding an individual song repeat button in future releases.. Hi @g-maclean,\nThe original_index is the index of the song in the original songs array. This gets set when we shuffle the playlist. What we are doing is getting the shuffled playlist, then getting the active index in the shuffled playlist, then the original index of the song which is in the song array.\nLet me know if that helps!. Hi @ArmanGrewal ,\nI saw there has been some experimentation with using the Web Audio API to simulate this, but as of right now I don't have a solution for muting/un-muting on iOS. If you find one, I'd gladly take a look at it and I'll keep my eyes open for one!\n. I'll be looking into this for version 3.3. This has been fixed in dev: https://github.com/521dimensions/amplitudejs/tree/dev. Most of this would be done outside of the scope of amplitude with calling the API. However, you can do dynamic playlists. I'll do a tutorial for that when I launch 3.3. amplitude-song-indexis the index of the song in the songs array provided. 0 would be the first song. I'll add a playlist_change event in 3.3.. Hi @coleh33,\nJust so I understand, you want to essentially pause the audio when the advertisement is playing and then resume the audio without triggering an initial play event after the advertisement is complete? You could possibly do some sort of global flag where if the audio is playing, set the flag to true and then on next play don't fire a certain event if the flag is true. Let me know if I'm on the same wavelength and I can get this fixed up for ya.\n. I'd add a global variable that if it's set, calls Amplitude.pause(). This way it will never make a request and pause the player. When the advertisement is completed, run Amplitude.play() with the variable set to false. This will play the stream.. Thanks @isobolewski ! I made the change and it will be merged into the next release!. Hi @warlockdn,\nI don't have any specific demos that work with Angular 5. However, once you include AmplitudeJS on the page, you can have it be accessible from within your Angular application. I usually work with VueJS but I assume it'd be something similar where you globally scope the Amplitude variable and call it when needed within an Angular component. I'll look into adding examples with VueJS and Angular 5.\nAre you doing things with a Single Page App (using an HTML5 Router)? . You should be able to use AmplitudeJS inside of any angular component when you import it. I'll release some examples for how to do this. Hi @ThaoD5 thanks for the awesome level of detail! I really appreciate it!\nI'll look into this right away. I believe I found the issue and will push a fix as soon as I confirm. \n  . Hi @ThaoD5 I fixed this issue. What was happening is I added the playNow() with the song object to be more of a lightweight approach. I added two new methods that will solve your issue. The first is Amplitude.playSongAtIndex(index) which plays the song at the index in the songs array. The second is Amplitude.playPlaylistSongAtIndex(index, playlist) which accepts the index of the song in the playlist and the key for the playlist. \nThese should sync everything to what you are looking for. They will be in the new release but can be found in the dev branch if you want to begin experimenting. Let me know if you have any questions!. This is fixed here: https://github.com/521dimensions/amplitudejs/tree/dev. Hi @ThaoD5 I think this is kind of related to the last bug. I'll dive into this as well and push a fix as soon as I get it all tested and confirmed. I'll be working on this today and hopefully push a fix soon. Thanks again for the detail!. So I think I figured out what is going on. The play/pause button that you have at the bottom of the screen is a main play pause button but is not keyed for your playlist. Your songs are keyed for a playlist named \"podcasts\". Since the song listing is scoped for the podcast, it doesn't get updated since the active playlist is null. \nDo you have multiple playlists? Like \"podcasts\" with 10 songs in it and \"interviews\" with 10 songs or something like that? If not, You can remove the playlist scoping from the player and it should work.\nWhat I will do though is make a way to set the starting playlist so the main play pause button will be keyed correctly to the playlist on initialization and then you just have to set it. It will be pushed in the next release which hopefully will be mid next week.. Oh okay I think looking at the other picture from #232 I can see what's going on. What I'll need to do is add that key for the start playlists because right now, the main play pause button doesn't have a playlist that's active when clicked on initial load. When you click a drop down then the play list is set and everything should be in sync. With the flag, we will set the playlist and when the user initially clicks on the play/pause button it will play the playlist specified.. I just got this fixed up and pushed to the dev branch. I need to fix a few more bugs before I merge, but if you wanted to test it out you can check out the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev What I did was added a key to the config called starting_playlist which you should pass on initialization. This way in a multiple playlist structure everything is keyed up and ready to go. Let me know if that makes sense. I'll hope to do a release with a lot of upgrades next week.. Hi @dijeanbonjour ,\nI just finished adding the start_song parameter to the init method. This way, even with an auto play flag. You can set start_song to be the index of the song you want to autoplay with AmplitudeJS. This will be present in the next release, and the commit can be found on the dev branch right now here: https://github.com/521dimensions/amplitudejs/commit/1f2128e97132368d114a8cc8279f37f4d3d6660b\nLet me know how this works!. Pull the the new file from here: https://github.com/521dimensions/amplitudejs/tree/dev I'll be merging shortly but this is fixed in dev.. I'm not really familiar with React, but if it's anything like Vue, you will need to put the Amplitude.init() method in a created() lifecycle hook or the React equivalent. The HTML needs to be there to bind events to elements.. If you combine what @chromahoen recommended with the getSongPlayedPercentage and add a time_updated callback method https://521dimensions.com/open-source/amplitudejs/docs#callbacks you can wait until the percentage is 95%. Then run what you need to run. If that's a pause, then Amplitude.pause(). AmplitudeJS functions independently of style. You'd need to do this through CSS and visual javascript. I'd look into setting the width and height of your player 100vw & 100vh for 100% of the view width and height respectively. You just need to add classes to your elements so Amplitude operates properly.. @mistermantas This is fixed in the dev branch here: https://github.com/521dimensions/amplitudejs/blob/dev/src/index.js. Use the Amplitude.playSongAtIndex(). Hi @iamlux & @wmech16 As of right now AmplitudeJS only supports what is supported by the HTML 5 Audio element: https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats. Unfortunately we don't have support for the .m3u8 file type. I wrote it down to look into, but honestly don't know too much about. If there are any resources to help me learn more about the file type, I can build it into AmplitudejS. Thanks!. Closing this issue. I put .m3u8 in the backlog for future versions. This is fixed in the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev. This is an issue with the new safari requiring that a user interaction take place to trigger the audio: https://www.reddit.com/r/webdev/comments/71nkym/safari_11_has_a_major_change_to_web_audio_api/ I'll document this issue and decide on if we remove autoplay functionality all together.. Yup! All you have to do is set your song object to have a url of :http://72.13.83.130:8010/;?type=http&nocache=830 -> Got from your server. And then set a property of \"live\" to true' in the object. This will handle the pausing correctly.. I'd definitely take @Bagera 's recommendation of filtering the event target and deciding if you want to stop propagation (user clicks the link) or handle the click through amplitude.. If you use the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev I have a new callback (https://521dimensions.com/open-source/amplitudejs/docs#callbacks) in there called 'playlist_changed'. If you bind to that callback, you can listen to the playlist change and pause the song with Amplitude.pause(). Let me know how that works!. This is fixed in the Dev branch, I didn't pass the event to the handler: https://github.com/521dimensions/amplitudejs/tree/dev. This one I'm trying to figure out. I want to iterate through and load the song duration but I don't know how to do that before playing. You could manually set this in the HTML if you know already.. Hi @ashecret \n1. Right now there is no functionality to cross fade. Hopefully in the near future with AmplitudeFX I can pull it off.\n\nI added this as Document Amplitude.addSongToPlaylist(song, playlist_key) to the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev/. Closing due to inactivity.. Hi @ValiantCuriosity,\n\nI'm starting all of my AmplitudeJS tutorials so be sure to check out: https://serversideup.net/ in the next couple weeks. I'll be writing a course on AmplitudeJS from the ground up with tips and recipes.\nAs for the input delay, I'll add that to the backlog for new features. If you have any specific questions or examples you'd like me to look at feel free to send them over!\nDan\n. @oscar4 This is now available in 4.1. You can now run Amplitude.addSongToPlaylist( songObject, playlist ) and add any song you need to a playlist. Check out the docs here: https://521dimensions.com/open-source/amplitudejs/docs/functions/index.html#add-song-to-playlist. Hi @ValiantCuriosity, the documentation has been updated in the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev Thanks for finding this one!. So in React, you will have to initialize AmplitudeJS after the elements are in the document. I'm familiare with VueJS and the the equivalent in VueJS would be the lifecycle hook of \"mounted()\". The elements have to be in the document before we can bind actions to them. Let me know if this helps!. Thanks, this helps out a lot! . @beanbag99 to adjust the width and height of the player, @ValiantCuriosity is correct, you have to adjust the css.  In the dev branch and in CSS, the player code is: https://github.com/521dimensions/amplitudejs/blob/dev/examples/flat-black/resources/sass/layout/_player.scss. You can set the width to what you want it to be there.. Just pushed this up to the dev branch. The two players are the same now: https://github.com/521dimensions/amplitudejs/tree/dev/examples/blue-playlist. This will be completed in 4.0. The open ticket for this is now #293 . @diplopito @mamunhpath @troubleshooter I just pushed a multiple playlist example to the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev/examples/multiple-playlists. Make sure to use the newest amplitude in the dev branch. I'll be merging shortly.. Hi @mamunhpath So what you'd need to do is add all of your songs to the songs array. Then you'd use the index of the songs to make your playlists. You would only initialize Amplitude once so it'd look something like this:\nAmplitude.init({\n\"songs\": [\n{\n\"name\": \"Lorem Ipsum Dolor Emmet Song\",\n\"artist\": \"Jhon Doe\",\n\"album\": \"Lorem Ipsum Dummy Album\",\n\"url\": \"/media/audios/2018/07/23/wave.mp3\"\n}, {\n\"name\": \"Lorem Ipsum Dolor Emmet Song\",\n\"artist\": \"Jhon Doe\",\n\"album\": \"Lorem Ipsum Dummy Album\",\n\"url\": \"https://www.sample-videos.com/audio/mp3/crowd-cheering.mp3\"\n}, {\n\"name\": \"Lorem Ipsum Dolor Emmet Song\",\n\"artist\": \"Jhon Doe\",\n\"album\": \"Lorem Ipsum Dummy Album\",\n\"url\": \"/media/audios/2018/07/23/wave.mp3\"\n},\n{\n\"name\": \"Lorem Ipsum Dolor Emmet Song\",\n\"artist\": \"Jhon Doe\",\n\"album\": \"Lorem Ipsum Dummy Album\",\n\"url\": \"/media/audios/2018/07/23/wave.mp3\"\n}, {\n\"name\": \"Lorem Ipsum Dolor Emmet Song\",\n\"artist\": \"Jhon Doe\",\n\"album\": \"Lorem Ipsum Dummy Album\",\n\"url\": \"https://www.sample-videos.com/audio/mp3/crowd-cheering.mp3\"\n}, {\n\"name\": \"Lorem Ipsum Dolor Emmet Song\",\n\"artist\": \"Jhon Doe\",\n\"album\": \"Lorem Ipsum Dummy Album\",\n\"url\": \"/media/audios/2018/07/23/wave.mp3\"\n}\n],\n\"playlists\": {\n\"top-hidden-playlist\": [0,1,2]\n},\n\"default-playlist\": [3,4,5]\n},\n});\nYou'd then key your amplitude elements with the playlist like so:\n<span class=\"amplitude-play-pause\" amplitude-playlist=\"default-playlist\"></span>\nor for whatever other elements you have!. When loading dynamically, you can use the addSong() and addSongToPlaylist() methods: https://521dimensions.com/open-source/amplitudejs/docs#add-song. They return the index and then you can get the id in a dynamic setting.. Hi @mamunhpath the playlist key is returned from the method so you'd call index = Amplitude.addSong() the same with the index = Amplitude.addSongToPlaylist(). This is fixed in the development branch: https://github.com/521dimensions/amplitudejs/tree/dev/. @troubleshooter Thanks for pointing this out. I have this fixed in dev now from the method that you provided. This works now! See: https://github.com/521dimensions/amplitudejs/tree/dev. If you use the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev, add a flag in the config of continue_next: false. This will stop the playback when the song ends.\n. Hi @troubleshooter Thank you for your contribution! We use a build method that helps organize code so these would be overwritten. I have this fixed based off of your recommendation and will be pushed into Version 3.3. Thanks again!. Use the development branch, I fixed the player to match the example: https://github.com/521dimensions/amplitudejs/tree/dev/examples/blue-playlist. Hi @MooNiChohan,\nThere's a couple different ways you could do this. I posted a reply to your question here with both methods: https://stackoverflow.com/questions/51081488/continue-song-on-the-next-page-with-amplitude-js/51108573#51108573 I hope this helps! If you need any more information, reach out on Gittr or respond to this issue and I can help you out!\n. See #272 . @Shaiwal If it's resetting to 0, then your headers aren't being passed correctly. If you look at the function itself:\n/**\n   * Allows the user to set how far into the song they want to be. This is\n   * helpful for implementing custom range sliders. Only works on the current song.\n   *\n   * Public Accessor: Amplitude.setSongPlayedPercentage( float );\n   *\n   * @access public\n   * @param {number} percentage     - The percentage of the song played\n   */\n  function setSongPlayedPercentage(percentage) {\n    /*\n            Ensures the percentage is a number and is between 0 and 100.\n        */\n    if (typeof percentage == \"number\" && (percentage > 0 && percentage < 100)) {\n      /*\n                    Sets the current time of the song to the percentage.\n                */\n      config.audio.currentTime = config.audio.duration * (percentage / 100);\n    }\n  }\nWhat it does is simply set the audio to the percentage defined. If the byte-headers are passed, then it will definitely work. You'd have to look into your server configuration to see if you have it set up correctly.. This is fixed in the dev branch. The issue was replicable in the Blue Playlist example. You had to mute the song, then use the slider and the volume was still muted. It had to do with a flag on the audio element. See the dev branch for fix: https://github.com/521dimensions/amplitudejs/tree/dev. Hi @Kezzsim ,\nAwesome idea for an app and thanks for using AmplitudeJS. Right now there is not a method to do this, but I will work on adding one here shortly. I like the idea and hope to have this done this weekend. I'll respond to this thread and you can send a link.\n. Hi @Kezzsim If you use the dev branch: https://github.com/521dimensions/amplitudejs/tree/dev I have a method called Amplitude.setMetaData(index, metaData) which accepts the index of the song you are updating and an array of meta data. This way if you want to update only the title, you'd pass: \nAmplitude.setMetaData(0, {'title': 'YOUR UPDATED TITLE'});\nYou can pass as many updates as you want such as artist, title, album, etc. Or any other new meta data if you want. It will sync with the screen for any element that references that song index. Let me know how this works for you. The only field you can not update is the URL because that'd cause issues if the song is being played.. That is a bizarre issue. \nHere's a few things I'd check:\n1. Does AmplitudeJS look like it's playing, just not sound? If that's the case, then it could be something on their device.\n\n\nUsing cordova in the past, is there anything that's dependent in your app to configure AmplitudeJS? \n\n\nAre they in areas where they might not have good cell service to load the songs? Possibly compress it to load faster. \n\n\nIf the app is in the app store, I could download it and see what I can come up with.. Thanks for sending this over @ValiantCuriosity! The only other thing I could think of if earbuds fix the issue is that the user has their iphone muted and when they plug their headphones in, it resorts back to their initial volume. With iOS through webview, you can't adjust the volume through the app interface. I'm sure this carries over to Cordova as well. It's a stupid apple rule that's hard to find, but here's their info: https://developer.apple.com/library/safari/documentation/AudioVideo/Conceptual/Using_HTML5_Audio_Video/Device-SpecificConsiderations/Device-SpecificConsiderations.html#//apple_ref/doc/uid/TP40009523-CH5-SW4 Let me know if this is the case!. Hi @ValiantCuriosity! Sorry for the late reply. I made the process really simple!\nFirst, download the dev branch of AmplitudeJS: https://github.com/521dimensions/amplitudejs/tree/dev\nThen when you initialize AmplitudeJS add the following to your config:\nAmplitude.init({\n\"songs\": [..your songs array..],\n\"delay\": 5000\n});\nYour delay can be any number of milliseconds. In this case 5000MS = 5 seconds. When the song ends, it will wait the delay amount before the next song begins. Let me know how this works!. @ValiantCuriosity Glad it worked! So what I'll do is add a public method to allow for a time to be set through Javascript. This way you can take the user's input and make it work! Thanks for the kind words on Amplitude as well and let us know if you need any other features added!. If you grab the newest dev branch, there's a public Amplitude.setDelay( time ) method which is the delay in milliseconds before going to the next song. https://github.com/521dimensions/amplitudejs/tree/dev. Right now AmplitudeJS only initializes elements with classes that match an element for Amplitude. Is there a use case an ID? If so we can consider adding it later!. To add data- in front of all of the attributes will be a huge overhaul of AmplitudeJS. I'm considering for like a version 4 because it will require a huge update.. @ewagstaff Thanks so much for sending this over. I'll definitely work on getting this resolved. I'll try to return promises on a lot of these public functions as well!. So the reason it won't play is that's the .pls file. You will need to find what the streaming URL is. It will send back properly encoded audio for you to play through AmplitudeJS.. If you open the .pls file there's a file attribute and a URL in there. In the .pls file you have, the URL is: http://198.245.62.86:8020/stream. . Awesome!. I'll definitely fix this bug. Thanks for pointing this out!. Hi @rhldani which player are you using? Are you using an example player or are you building a custom player?\nSome of the example players I stop the default event from the space bar so it does whatever event I bind it to and not scroll down the page or enter a space. You will have to customize your player with a text input on the screen where you check to see if any input is focused and if it is, then to run the event and stop propagation.\nLet me know how you are designing your player and I can help!. @tobidsn right now the space won't work because Amplitude stops event propagation to prevent a scroll down. The fix is coming in the new version of AmplitudeJS. Hi @tobidsn So I found the issue. I disable the keydown for the space bar to prevent the page from scrolling when hit in the single song example. The code that does that is outside of AmplitudeJS and is here:\nwindow.onkeydown = function(e) {\n          return !(e.keyCode == 32);\n      };\nWhat you can do is check to see if an input is focused on before using the keycode or remove that code entirely. Let me know how that works!. Right now there is no function to de-initialize the player. Is this needed for your project?. I am closing this issue since we are focusing on #280 . So by default AmplitudeJS should pre-buffer before it starts to play. Are you looking for a setting for how much should be buffered before it starts playing?. I'm still looking into this issue. I'd guess we'd have to write an external script to do this. I'll keep you posted on the results.. As of right now, I don't know how to preload after every play pause on a live audio.. Hi @kidconcept! Sounds like an awesome use case. I definitely want to implement wave surfer into AmplitudeJS as like a plugin. Right now, I'm looking to do some of the visualization stuff in the next release as Amplitude-FX. I had it before but it was complicated and not well supported, but now it'd work great. I'll keep you in the loop. However, are you needing it for a time sensitive project?. Hi @kidconcept we just launched version 4.0 that includes visualizations and waveform elements! You can use the ones provided or you can create your own! Let me know how it works!. This has been merged and the new functionality has been pushed. . Thanks @Xayer ! I merged the PR and added a few public functions. Thanks for your contribution!. Hi @will-muir I tested the link with the single song player in IE 11 and it worked. Do you have another link I could test with? \nWhen you get that issue (IndexSizeError) on navigation, it's because the song hasn't been loaded correctly or not set. Essentially, your song is chunked up into parts. The index size error is that you are trying to move to a chunk that isn't, for lack of better terms, registered yet. This could be due to config, slow server, wrong headers from server, a variety of things. If you send a link where I can replicate the issue I can get it resolved.. Hi @will-muir So if you check out https://521dimensions.com/open-source/amplitudejs/examples/single-song in IE 11 and try to skip, you will see it works. Now the thing is, is even yours works AFTER you start playing the song. \nWhen you initially load the page, look at the duration. On yours, it's set to the default 0:00 which means that all of the meta hasn't been pre-loaded for the song. On the example, it gets loaded right away which it should. The only difference I see in your player in IE 11 is I get an error when I load: Unexpected token. single-song (44,3). This could be preventing the rest of the loading. I'd maybe swap out your JS. \nAmplitudeJS should definitely work with IE 11 for skipping. Your server is set up correctly too, I checked the byte headers. . Awesome!! Thanks!!. This issue has been resolved with the release of 4.0. This has been fixed in the 4.0 release. Thanks for pointing this out, I'll get a fix pushed soon!. This has been resolved with the release of 4.0. This was the same as #262 and will be fixed in 4.0 since it's a breaking change. I'll write the migration instructions, but 4.0 will be compliant for sure!. This issue has been resolved with the release of 4.0. @jennykb Thanks for using amplitude and I'm glad you like it! So what's happening is you are running Amplitude.init() each time you load a section of the page. You have a script each time the playlist has been changed that initializes amplitude again. It looks like the players are just hidden on the page through jquery so they should be initialized and ready to go! If you have all the tracks in one init, you should be good to go and won't have to initialize the page each time! \nIf you are loading HTML into the page, you should run Amplitude.bindNewElements(): https://521dimensions.com/open-source/amplitudejs/docs/functions/#bind-new-elements. This will bind the new elements on the screen to Amplitude functions without re-initializing amplitudejs. Let me know if that helps!. Awesome! I'm glad you got it working, let me know if you need anything else!. Hi @jennykb ! So thanks for pointing this out! This is actually a bug, I don't bind the amplitude-repeat-song elements. I'll have this fixed shortly. In the mean time if you want, you can add the following code: \n$('#repeat').on('click', function(){\nAmplitude.setRepeatSong();\n});\nThis will do the same thing and bind the classes when needed! You will want to add that where you add your Amplitude.init() in the javascript.\nLet me know how that works!\n. Awesome glad that worked!! The new version should be out soon and this bug will be fixed!. This issue has been resolved with the release of 4.0. Hi @teddiey So some of the issues I've had with webview and Amplitude is the security permissions to allow remote playing. If you could provide any debug logs, that would be super helpful. However, I'd look into the Content-Security-Policy on your webview: https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy/media-src. \nLet me know if that works, otherwise, if you have a debug logs and send them over I can help!. @teddiey Hmm this is bizarre. I did some searching though and found that it could be an issue with the stream it self. When I looked at the stream: http://50.7.99.155:12087/stream/1/ The format was in audio/mpeg which according to some older sites wasn't well supported. This might not be the case now but the way to test it would be to visit the URL of the stream http://50.7.99.155:12087/stream/1/ in your app and see if it plays.\nThe other issue could be stronger policy against non HTTP sources in your webview. . Hi @lupett To use the Amplitude.getSongDuration() method, you will have to call it from Javascript. It only works on the active song due to it grabs the meta data from what has been loaded regarding the song.\nAs for protecting the URL of the mp3, that wouldn't be possible. Even using the standard <audio> tag you feed it a source file that's open to inspection through the browser. Let me know if that helps!\n. @lupett Unfortunately, right now I do not know of a way to load this. I've been trying to figure this out for awhile, I'd have to loop over the songs and load the meta data I believe. if you have any resources, please send them over and I'll add it to 4.0!. Hi @glvr Do you have a specific example of which phones the streams are not working on? Like the OS version? Sometimes the streams need to have a mime-type set for how the audio is encoded on the streaming server for them to work.. @glvr Did you find out if it was an issue with the stream?. @glvr No problem, I hope you get better!. @jennykb Amplitude will start playing the song when the browser has enough of the song loaded to play: https://www.w3schools.com/tags/av_event_canplay.asp. If you look at the buffering element in your design you can see that it's playing before the song has been loaded 100%. \nAre you experiencing the slow load on mobile or bad internet connection? It could be something where you host your songs.\nLet me know if that helps!. There shouldn't be any difference between the other script and AmplitudeJS. As long as the song is coming from the same server, the load speed should be the same.. @simokassab Are you referring to the active song container that's applied to the current active song?. @mherrero347 & @joshawnard Thanks for pointing this out. This has been fixed in 4.0: https://github.com/521dimensions/amplitudejs/tree/4.0. The callbacks are now also hooked into the native Audio events: https://www.w3schools.com/tags/ref_av_dom.asp. We'll be merging 4.0 soon, but all the docs are pushed up. Let me know if you have any questions.. 4.0 has been launched and this fix has been included.. @seriouslyunderappreciated Thanks for pointing this out. I have this fixed in the 4.0 release. You can check out 4.0 here: https://github.com/521dimensions/amplitudejs/tree/4.0. @coliff The reason there is no AmplitudeJS specific download button is because a lot of it revolves around a server link. You will need a link that sends out the proper headers to ensure the audio is downloaded instead of played by the browser. If needed I can help provide an example of what headers need to be on the server link. . @eman1986 and @enthuzy When using the Web Audio API elements definitely requires the proper headers so they can be processed successfully.\n@enthuzy With the second song in the list, is it returning undefined on a certain event? . Closing due to inactivity. Could be related to #317 . @Shaiwal Is your server set up to partially stream? What this means is you need to return byte range headers: https://developer.mozilla.org/en-US/docs/Web/HTTP/Range_requests. If these aren't returned, then the Amplitude won't scrub the song correctly. You can check the header on the network request it should say \"Accept-Ranges: Bytes\". See attached.\n\n. @Shaiwal Do you have an example for this? I still believe it has something to do with the byte headers or it could be with CORS which can block that as well. You would have to do origin * or whatever you need for your specific project. It can be a real challenge. If you have a public facing URL I can help out.. Thank you for finding this! That's a heck of a typo on my end!. @AhmedHassanEldesoky For Delay you'd call the public method: Amplitude.setDelay(timeInMS) and for speed, you'd have to have an element amplitude-playback-speed. I'll have to add a public method for playback speed changes.. @rajdeepbharati and @musikprylar Are you implementing an autoplay feature? The web audio context should be only implemented if you are using the web audio API and will only be started when a song is played.. So I fixed this in the newest push of 4.1.0. I apologize for the delayed response. Now the Web Audio API is initialized if needed but when the user interacts is when it starts. So even if you aren't benefiting from the features of the Web Audio API, it will still play the audio and everything should work. Let me know if any other issues come up!. @enemyss So the way the active index works is it either references the songs array if shuffle is not on or the shuffle array if shuffle is on. I'm pushing an update in 4.2 where you can get the active song metadata and it will return the index of the song in the songs array or if you are in a playlist the index of the song in the playlist no matter if shuffle is on or not.. @frozendten You will have to include the library in your WP theme through wp_include_script(). You will then have to make your elements either in the code editor or theme itself. . @frozendten You will have to include AmplitudeJS with your theme. To do that, you will have to load AmplitudeJS with: https://developer.wordpress.org/reference/functions/wp_enqueue_script/\nThe call to that method would look like: wp_enqueue_script( 'amplitude-js', '/path/to/your/file', [], false, false )\nYou would then have to write your Javascript and include that as well in a similar fashion. If you had a template where you'd like the HTML, you'd have to include that in your theme as well.. Hi @NesteA88 ,\nWhich player interface are you trying to use? You will have to have the player mark up on the page for it to appear. The init function simply binds the elements to an interaction and tells AmplitudeJS how to interact with your player. Everything you have seems to be set up correctly.\n. @NesteA88 So you will need AmplitudeJS included on your page and you will need the HTML of the player that you wish to use. When I looked at the screenshot, it looks as if AmplitudeJS was configured correctly, but nothing was being bound to it. Do you have a public facing link with the code available?. Hi @NesteA88,\nSo you need to add the actual HTML to the page. AmplitudeJS just activates the HTML on init. So with your player, you have to add the HTML and with all of your songs and then run Amplitude.init(); Right now I don't see the HTML appearing in your page. Let me know how that works!. Ahh, gotcha! So for a single song, you could do something like this:\n```\n\n\n\n\n\n\n        <div class=\"time-container\">\n          <span class=\"current-time\">\n            <span class=\"amplitude-current-minutes\"></span>:<span class=\"amplitude-current-seconds\"></span>\n          </span>\n          <span class=\"duration\">\n            <span class=\"amplitude-duration-minutes\"></span>:<span class=\"amplitude-duration-seconds\"></span>\n          </span>\n        </div>\n\n        <div class=\"control-container\">\n          <div class=\"amplitude-play-pause\" id=\"play-pause\"></div>\n          <div class=\"meta-container\">\n            <span data-amplitude-song-info=\"name\" class=\"song-name\"></span>\n            <span data-amplitude-song-info=\"artist\"></span>\n          </div>\n        </div>\n      </div>\n    </div>\n  </div>\n</div>\n\n```\nThis is a fully functioning HTML markup for AmplitudeJS. You can activate it with the script:\n<script type=\"text/javascript\">\n      Amplitude.init({\n        \"bindings\": {\n          37: 'prev',\n          39: 'next',\n          32: 'play_pause'\n        },\n        \"songs\": [\n          {\n            \"name\": \"Risin' High (feat Raashan Ahmad)\",\n            \"artist\": \"Ancient Astronauts\",\n            \"album\": \"We Are to Answer\",\n            \"url\": \"../songs/Ancient Astronauts - Risin' High (feat Raashan Ahmad).mp3\",\n            \"cover_art_url\": \"../album-art/we-are-to-answer.jpg\"\n          }\n        ]\n      });\n      window.onkeydown = function(e) {\n          return !(e.keyCode == 32);\n      };\n      /*\n        Handles a click on the song played progress bar.\n      */\n      document.getElementById('song-played-progress').addEventListener('click', function( e ){\n        var offset = this.getBoundingClientRect();\n        var x = e.pageX - offset.left;\n        Amplitude.setSongPlayedPercentage( ( parseFloat( x ) / parseFloat( this.offsetWidth) ) * 100 );\n      });\n    </script>\nI have some more JS in there than the necessary just for a few features custom to the player. Hope that helps! You can find more examples here of tons of different types of players: https://github.com/521dimensions/amplitudejs/tree/master/examples. Hi @NesteA88 Did this help solve the problem? If so I'll close the issue.. Hi @teddiey ,\nSo to do the playlist, you will have to provide some HTML that Amplitude will hook into. The playlists simply organize the songs and provide state. If you check out: https://github.com/521dimensions/amplitudejs/blob/master/examples/multiple-playlists/index.html I have some HTML on how to do playlists. Hope this helps!. Hi @teddiey just following up to see if this helped solve the issue? . Ahh great idea! I'll add that. Thanks for pointing it out because none of that is needed, just Amplitude and some markup.\n. To run the timeupdate in your scenario, I'd adjust the code to be like this:\n'timeupdate': () => {\nthis.timeUpdate();\n},\nHave the anonymous function call your function and it should work great!\n. @faten257 This could be a few things. First, are you passing a header with your audio to force a download (https://stackoverflow.com/questions/386845/http-headers-for-file-downloads)? If so, then it'd download and you'd have to remove the header. Are you also trying to play a song that's not an MP3, WAV, or OGG? . This has been pushed to development branch. #316 is referenced as the fix.. ",
    "jaydrogers": "Closed because of a duplicate of #32.\n. Closing and merging with #215 . Thanks @fyockm, I will be taking care of this and will keep you posted once it is completed\n. Thanks for the compliments @fyockm! We're really excited for this new release of AmplitudeJS. I haven't worked too much with NPM, do you have any tips?\nI saw that I could create an account and how to do the publishing process, but I would like to streamline it as much as possible.\nI've also been looking into Travis-CI so we can automate it: http://docs.travis-ci.com/user/deployment/npm/\nAny thoughts or experiences from your end? Thanks again for your help.\n. Yeah I know -- my fault... Sorry its been a crazy year. We do have some great improvements coming (hopefully soon). We will be sure to configure a build process so that we can get this added to npm.\n. Okay, I will look into it. I haven't done an NPM publish before, but I assume it isnt too bad. I will take a look into this and keep you posted.\n. Thanks for the resource! I gave it a try... AMIDOINGITRIGHT? :-D\nLet me know if that worked.\n. Thanks for the PR! @danpastori has been super busy and I was just trying to help out and learn something new. Maybe I should just stick with Ansible :-)\n. Merged into #82 . Hey @mathieuforest thanks for the compliments. Where is the source of your audio? Is it hosted on a different domain than the site that is loading Amplitude?\nWe've been having off and on issues with services like SoundCloud due to CORS restrictions.\n. No if everything is on the same domain name, it should not be related to CORS.\nWhat browser version are you using? http://www.whatsmybrowser.org/\nAre you getting any errors in the console of your browser?\n. Thanks for the information. @danpastori will know a lot more about this issue. He'll be in touch with you soon.\n. Great, thanks for the update!\n. Thanks for the detail @jinpark! @danpastori will be the best one to answer this one. He'll be in touch soon.\n. We removed bower today . Hi @jimlee2 are you hosting the song files on the same domain as where your website is located? Are you getting any specific errors in the console of your browser?\n. Hi @jimlee2 thanks for your patience on this. I spoke with @danpastori and he said that the examples were created for Amplitude 1.0. We just recently released Amplitude 2.0, but we forgot to update the examples (whoops!). We will get these updated and keep you posted.\nAlso, thanks for pointing out the track skipping issue. This is a known issue with SoundCloud. The songs that we are demonstrating are streaming directly from SoundCloud. This seems to be a SoundCloud specific issue and it may be due to their server configurations.\n@danpastori will be in touch shortly to update the examples.\n. This was fixed in 3.3.. This should be fixed in 3.0. We'll be pushing this to the master branch shortly but you can find get the latest code on the dev branch right now: https://github.com/521dimensions/amplitudejs/tree/dev. Are you having any specific issues with Safari 6? If you are having issues, please complete an issue template so we can get more information:\n```\nIssue description\nAmplitude.js Version\nLink to Reproduce-able Issue (Please provide a link to a JSFiddle / JSBin / CodePen or GitHub repo.)\nSteps to reproduce the issue\n\n\n\n\n\nWhat is expected?\n-\nWhat is actually happening?\n-\nAdditional details / screenshot\n- \n```. Sorry for the delay, 2016 was a super busy year for us. Good recommendation, we will look into this.. Thanks for reporting this. I am going to pass this off to @danpastori for more thoughts.\n. We just launched Amplitude 3.0 and this should be fixed now. See dfa858b7edbffa4a7cdf21d8305ca43f926c3552\nLet me know if you have any questions!. Thanks Drew!\n. This should be fixed in 3.0. We'll be pushing this to the master branch shortly but you can find get the latest code on the dev branch right now: https://github.com/521dimensions/amplitudejs/tree/dev. This should be fixed in 3.0. We'll be pushing this to the master branch shortly but you can find get the latest code on the dev branch right now: https://github.com/521dimensions/amplitudejs/tree/dev. Thanks for adding this through Github. I am going to refer this to @danpastori for more information. . Awesome, glad to hear! Thanks for using Amplitude!!. Thanks @fan42, we will review this and possibly add this into 3.1. This is fixed in 3.3.. Hey @Happelation,\nThis is fixed in 3.0. We'll be pushing this to the master branch shortly but you can find get the latest code on the dev branch right now: https://github.com/521dimensions/amplitudejs/tree/dev. Hey @swegins001,\nCheck out the documentation for the current Amplitude release (2.0) here: https://github.com/521dimensions/amplitudejs/blob/master/docs/DOCUMENTATION.md#installation\nIt should cover the basics on how to get started.\nAlso, 3.0 Beta was pushed to the development branch yesterday. There are a ton of changes and improvements. If you are interested in getting a head start on that, look here:\n\n\nAmplitude 3.0 Beta source code: https://github.com/521dimensions/amplitudejs/tree/dev\n\n\nAmplitude 3.0 Docs (work in progress):https://github.com/521dimensions/amplitudejs/blob/dev/docs/DOCUMENTATION.md. I would check your CSS. AmplitudeJS does not control the visual styling, that is up to the designer.. Hi @Reaper10,\n\n\nWe'll consider this, but until we get more demand for it we're going to close this for now.. Hey @masiha68,\nIt should be supported. It might be a server issue. Can you fill out an issue template with where you are experiencing the issue?\n```\nIssue description\nAmplitude.js Version\nLink to Reproduce-able Issue (Please provide a link to a JSFiddle / JSBin / CodePen or GitHub repo.)\nSteps to reproduce the issue\n\n\n\n\n\nWhat is expected?\n-\nWhat is actually happening?\n-\nAdditional details / screenshot\n- \n```. Hi @masiha68,\nFew questions:\n\nWhat version of Amplitude.js are you running? We just launched Amplitude 3 today. Be sure to download the latest version\nIf you are still having issues, are you able to provide us a link to the page where you are having issues?. Thanks for the update. I am going to pass this on to @danpastori who will know a lot more about the issue. It could possibly be a server configuration but I am not 100% sure.. Great! Do you have a public link that you can share where you are having the issue? That will help us out a lot.. No worries, that's why I thought it was a server issue. On your local development, you might want to try adding this to your .htaccess file:\n\nAddType audio/x-ms-wma .wma\nSee this link for more detail: ~~~http://support.spacialaudio.com/wiki/You_might_need_to_add_a_Windows_Media_mime_type_to_your_webserver_for_Windows_Media_to_launch_automatically.~~~\nUPDATE: The website moved their content, so here is a cached version of that page: http://webcache.googleusercontent.com/search?q=cache:jgclQvO8RikJ:support.spacialaudio.com/wiki/You_might_need_to_add_a_Windows_Media_mime_type_to_your_webserver_for_Windows_Media_to_launch_automatically.+&cd=1&hl=en&ct=clnk&gl=us\nHope this helps!. That last link was giving be issue, so here is the Google Cache version of it: http://webcache.googleusercontent.com/search?q=cache:jgclQvO8RikJ:support.spacialaudio.com/wiki/You_might_need_to_add_a_Windows_Media_mime_type_to_your_webserver_for_Windows_Media_to_launch_automatically.+&cd=1&hl=en&ct=clnk&gl=us. The intention of this feature is that it would be automated to prevent further human error through a build process. This for example would not need to be updated manually anymore.\n\n. Here is a good example of what it should look like:\n\nFound it here: https://github.com/godban/browsers-support-badges/\n. Most of this should be covered. Getting the version number can be found by typing in Amplitude.getVersion().. Hi @masiha68,\nCan you send us a public link/URL where this is happening? That would help us out a lot.\nThanks for your reports!. I am going to close this issue because we are assuming that the question or issue has been resolved. If you have any questions or are still having issues, just comment on this thread and I can re-open the issue for you.\nThanks!. This is done in version 3.3.. Damn dude! Thanks! I was just researching a bunch of things on how to get this added. I appreciate your help very much!. Hey @MartinKolarik \nThanks a ton for your help earlier. I see the CDN part is working now, but how long before it would appear on the main site? https://www.jsdelivr.com/?query=amplitu\nI am searching for it but I cannot seem to find it. See image attached. Thanks again!!\n\n. @danpastori: I think we should get on this soon. \nWhat types of players should we have? I can get some designed.. So we have an example in the repository, but we're still going to extend this a little bit more. I am going to leave this issue open since there is more to come.\nWe will keep you posted!. See all the latest examples here: https://github.com/521dimensions/amplitudejs/tree/master/examples. Hi @Ravenmay007,\nThanks for the screenshot and the example of your code. Did you initialize the plugin with your song data? Docs are here: https://521dimensions.com/open-source/amplitudejs/docs#initializing-amplitude-js. Closing this due to inactivity.. This has now been resolved.. Thanks @Muhnad! We greatly appreciate the detail you've provided us on this. We have keybindings currently targeted to be on the v3.2 release (see issue #73) but we never really thought of it from a screen reader perspective.\nI will chat with @danpastori and see if we can merge these together for the 3.2 release.\nFew questions:\n\nWould this be a proper test of what you are suggesting for the keyboard events? http://a11yproject.com/posts/navigate-using-just-your-keyboard/\nWhat is the best way to test that the aria-label attribute is working?\n\n. Awesome, thanks! We will keep you posted. We'll review this thread once we get closer to 3.2.. Thanks for the report on this. We have a few UX improvements to make. Looks like the anchors work in the body (but jump too far down), but the sidebar does not work at all.\nThe link changes at the top, but nothing happens (see this video).\n. @danpastori Can we get this addressed in 3.1?. This should be fixed now. Thanks for reporting it @Darker!. We'll get this updated in our documentation. Thanks for the feedback!. @danpastori This still needs to be addressed. Let me know if you have any questions.. @danpastori Can you take a look into this?. Hmmm, this seems to have fallen off of Dan's radar. I will follow up with him on this. Thanks!. Thanks a ton for your help @Darker! We have this for evaluation for fixing in our next release (3.1). @Darker the changes are on our dev branch if you want to test this out. Otherwise I will take a look at this next week when I return. Hopefully will have 3.1 released very soon once I get back!. This has been merged into master. Thanks for your bug report!. I am re-opening this so that we can make it more effective and useful. @danpastori will have to determine what release would be best, but we can develop some details on what should be displayed when this is enabled.. I agree with this. It feels very unnatural by default. We will review this and get this addressed in a release soon.. Thanks for the detailed demo on this. I am going to send this to @danpastori for further review.. This is similar to #74 . This should be fixed on dev branch, but just making a note here when we go to test it.. I confirmed that this works with your example. Thanks for sending this over! This has now been merged into the master branch.\nThanks for your bug report!. Ignore the failed build on this. I was testing out Travis CI and forgot to have the setting enabled for \"Only build if .travis.yml is present\".\nAssigning to @danpastori for review.. Hi @SteveALee,\nThanks for your compliments. Answers are below:\nSupported Browsers\nSupported browsers are listed in the README on our development branch right now. Basically any browser that supports HTML5 Audio will work: https://github.com/521dimensions/amplitudejs/tree/dev#browsers-support\nAccessibility support\nWe currently have this as a discussion item for our 3.2 release. See issues #73 and #91. If you have any feedback on those items, please comment on those items directly.\nThanks for using Amplitude.js!. Thanks again @Darker! You are awesome!!\nWe will get this under review.. Oh crap! Sorry about that @Playacem. Thanks for catching this and submitting a pull request. I bet that was a pain to trace down... this was my mistake!\nThanks for using Amplitude!. Thanks for catching that!. Thanks for the feedback @freedomlives! @danpastori is much better at Javascript than me so I will have him review this.\nIf you have a link to your musician friends' site that would be great for us to see the behavior. If it is possible for you to share a link to your work that would be awesome to see as well!\nIn the meantime, we are about to release 3.1 very shortly and getting a road map for 3.2/3.3 finalized.\nThanks for using Amplitude.js!. Totally digging the metal! \\m/\nI know you'll likely need to use AJAX, but @danpastori will be the best person to answer. He will be in touch soon!. I am re-opening this because it needs to be documented.. Hey @Darker,\nIs it possible that you could provide a JSFiddle example on this? The last time you provided one it made it super easy for me to replicate and confirm that it was fixed. Thanks!. Do you have a public URL of where the issue is happening? At least we can see the issue, replicate it, and confirm that it is fixed when we make changes.. Okay thanks, I will have @danpastori review and he'll comment if he has any questions. Thanks for the bug report!. Hey @fiter92,\nThanks for using Amplitude! @danpastori is traveling right now and he'll be the best one to answer your question.\nHe'll be back next week and I will be sure to have him reach out to you on this question once he returns.. Hi @snote,\nCan you try upgrading your Amplitude version to Amplitude 3.1? You should just have to replace your current amplitude.js file with the latest one from here: https://github.com/521dimensions/amplitudejs/tree/master/dist\nLet me know if that fixes your issue.. What operating systems are you running? You said one works but the other doesn't? Both are running latest version of Chrome?. I see your site is still running Amplitude 2.3. Could you update your link to Amplitude 3.1 and let me know?\nI don't have an Android device so I will need to email the link out to some friends to test it with.\n\n. Your amplitude.js file is incorrect. It's some sort of HTML. Download the original 3.1 file here and upload it to your server (overwriting amplitude/js/amplitude.js).\n\n. Your auto play is working for me. The new file should be quite backwards compatible. You can double check everything here: https://521dimensions.com/open-source/amplitudejs/docs#initializing-amplitude-js\nIf you need additional support, @danpastori will be your best resource, but I know he has been really busy lately and might be some time before he can look at your code.\nYou can always see the source code of the player on the AmplitudeJS site in the examples folder: https://github.com/521dimensions/amplitudejs/blob/dev/examples/blue-playlist/index.html. Try using the latest version of Amplitude (v3.2.1). If you are having issues, just comment and we will re-open the issue for you.. @danpastori will be your best person to answer this. We'll get you an answer soon!. Awesome! Glad to hear you have this resolved.\nI am still going to leave this open incase it is a feature that exists but needs to be documented better. @danpastori will confirm as soon as he has a chance.. @danpastori: Sure, if this isn't a feature that exists yet let's name it and tag it appropriately for a future release.. This is a known feature request but we have not chosen to pursue it right now since modern devices are preferring physical volume controls over software volume controls. Apple has a better explanation on their site here: https://developer.apple.com/library/content/documentation/AudioVideo/Conceptual/Using_HTML5_Audio_Video/Device-SpecificConsiderations/Device-SpecificConsiderations.html#//apple_ref/doc/uid/TP40009523-CH5-SW11 . Whoops, I was correct by @danpastori on this. It will work for desktop: https://521dimensions.com/open-source/amplitudejs/docs#volume-slider\nBut on mobile it will not (because of that Apple link I posted earlier). Any other questions, let me know.. Closing this because it went stale.. An example would be great. I created a label for this so that we can remember what needs an example for future releases.. Sorry for the confusion, when I said \"an example would be great\", I meant us providing an example of how to have multiple players on a page.\nWe're working on a gallery of different example players and I want to make sure we are providing quality and useful examples.\nWe'll keep you posted as soon as we have this ready!. No worries, we know how it is! I will review this with @danpastori and will keep you posted on your example cases.\nWe've done players with Wordpress using Amplitude, so maybe that might be its own example as well. We'll keep you posted! 😎. @danpastori Will be the best person to answer this. This is done in 3.3. You can find the example here: https://github.com/521dimensions/amplitudejs/tree/master/examples/multiple-playlists. @danpastori This seems to be a common issue. Maybe we should add something like this into the documentation? Maybe a \"Common Issues\" or \"Troubleshooting\" section?. Thanks for reporting this! We will get this addressed in v3.2.\nIt is happening on Chrome on Mac OS X as well. Video of the issue is here: https://www.dropbox.com/s/cquknxpfwqnmjmt/AmplitudeBug191.mp4?dl=0\nAs you can see, when I press next it resets the playlist to the top.. Thanks a ton for taking the time to put together a reproducible issue. This will make it so much easier to help diagnose.\nI'll pass this on to @danpastori for further review. Thanks for using Amplitude!. I completely agree. We have this tagged as a future enhancement in #185. @danpastori said that to do this feature correctly, it would take some time to implement this correctly and make it work for all browsers.\n@danpastori: Maybe instead of putting the pressure on you to develop all of this, we can develop some guidelines what we are looking for and set it up so someone can contribute and get it built?. Just a heads up, @danpastori has this working locally on his computer but he hasn't had a chance to push up his changes and document it. He is hoping sometime next week or the week after for sure.\nHe's had a busy few weeks :-). Hi @danpastori,\nCan you confirm this is working correctly?. Thanks a TON for that codepen. That helps us out immensely. Feel free to use this MP3 as the music sample: https://www.dropbox.com/s/ql0oba06nyzcmiy/sample.mp3?dl=1\nJust out of curiosity (because I am more of a designer than I am a programmer), is this a web standard conflict? If so, do you have any references to this standard?\nI will pass this along to @danpastori for further review.. Ahh, that makes sense. Sorry for the confusion.\nI'll review this further with @danpastori and see if it is a bug or if it is a typo. I can see the error in the documentation here: https://github.com/521dimensions/amplitudejs/blob/master/docs/DOCUMENTATION.md#configuring-amplitudejs\nThanks for your reports!. > you mentioned you're more a designer: do you mean CSS designer or Photoshop stuff?\nUnfortunately I only do graphic based stuff (I use Sketch - https://www.sketchapp.com/). To be completely honest, I am better at server stuff than I am at design. So looking at JavaScript can be a little over my head most times hahaha.\nI'll set a time to review with @danpastori and will keep you posted!\n. Thanks for pointing these errors out. Just an FYI, you can submit a pull request by modifying docs/DOCUMENTATION.md. Our documentation site reads directly from this file.\nI will still have @danpastori incase there are any misspellings in the code itself too.. Thanks for the report. @danpastori will be the best person to resolve this.\n@danpastori: Here is the reference to Line 358 on src/visual/visual.js and the other one for Line 608 on src/visual/visual.js.. Thanks for posting this, I will definitely review this with @danpastori and get his thoughts.. Out of curiosity, what IDEs are you having issues with?. This is completed in 3.3.. Let's see if @danpastori can assist you on this before closing it.. Thanks, we appreciate it! We'll take a look into this and we'll report back. 3.2 was just released literally an hour ago and I know the sample player is being updated as we speak.\nThanks for taking the detail to complete such a detailed bug report!. Thanks for your contribution!. Thanks for the input. I will pass on to @danpastori for review.. Sorry, I haven't heard an update from @danpastori on this. I know 3.3 is being worked on but not sure if this is in it or not. He's been very busy lately and hasn't had too much time to work on Amplitude.\nI'll see if he can post an update.. We'll be considering this for 3.4. Thanks for your ideas!. Are you referring to our player on our homepage? We intentionally hide it because Apple does not allow web elements to control volume on mobile devices. They believe the physical buttons should control the volume.\nI'm sure @danpastori could chime in with a little better explanation if needed.. Here is the official word from Apple explaining things a little more: https://developer.apple.com/library/content/documentation/AudioVideo/Conceptual/Using_HTML5_Audio_Video/Device-SpecificConsiderations/Device-SpecificConsiderations.html#//apple_ref/doc/uid/TP40009523-CH5-SW11. @danpastori Can you confirm this is fixed in 3.3?. That URL doesn't seem right. Did you try entering http://51.15.213.173:8000/;?type=http&nocache=66 instead?. Closing due to inactivity.. Thanks! Yup you can use it in your commercial projects. The full license is here: https://github.com/521dimensions/amplitudejs/blob/master/LICENSE. Hi @shohei000,\nThis should be resolved. We had a bug in one of our recent releases that included that. What version are you running?\nCan you test with including https://cdn.jsdelivr.net/npm/amplitudejs@3.2.1/dist/amplitude.js as your Amplitude source and see if that fixes the issue?. No it was an earlier bug. If you are able to send a URL that we can look that (so we can replicate the issue), that would help us out a ton.. Hey @shohei000,\nWe forgot to push up our changes to the repo. Whoops! 😇\nTry it again with the latest version. We just released v3.2.3 to specifically fix this issue. I tested your site with the new updates on my end and it worked for me!. Thanks for the detailed bug report. I was able to fix this in minutes. 😎\nThanks man!. Since it is a playlist, it loops the playlist (like in iTunes or Spotify). We just need to update the documentation to state this clearly.\nLet us know if you have any thoughts or questions on the behavior of repeating playlists instead of individual songs. Thanks!. We have a number of bugs coming in on this and it has switched back and forth a few times.\nSome people want it to repeat a song, others want a playlist to be repeated.\n@danpastori: Is it possible to have this be any easy option to configure so that the developer can choose?. This was added in 3.3.. This was added in 3.3.. Hey @warlockdn,\nThanks for understanding that this is an open source project. We don't get paid to maintain this and sometimes we have our own lives to take care of.\nYou have just as much capabilities to make contributions, so if you like to speed things up -- volunteer and submit a pull request.. Closing this because this seems to be the answer: https://github.com/521dimensions/amplitudejs/issues/231#issuecomment-374247523. Since this is a duplicate, I am going to close this and continue the discussion in #225 . There is a similar issue being discussed in #225 but as always, the limit of getting things done on an open source project is the developer's time.\nIf it's truly that easy, maybe submit a pull request to help everyone out? 😃. Hi @innovanets,\nDo you have a link where the issue can be replicated?. I am able to replicate this in iOS 11 in Safari as well. I am going to assign this to @danpastori for further review.\nThanks for your patience as our unpaid volunteers review your issue.. Thanks for submitting your issue on Github! We'll have @danpastori review and will keep you posted.. Like a boss, thanks man! 👍. Github is our forum. Just post a detailed question and we will get back to you as soon as we can :-). Thanks Rachel! I know @danpastori is working on articles on the Server Side Up blog that will talk about how to build a player from start to finish.\nNot sure exactly when those articles will be ready, but maybe he can chime in and give an update :-). Hi Rachel,\nIf you want to submit a pull request that would be awesome. The documentation site reads from our Github. You can find it under /docs.\nIf not, I will leave this up for @danpastori's review since he is way better at JavaScript than me 😀. No worries, thanks for the compliments!. Hi @xcrap,\nThanks for using Amplitude! If I understand your question correctly, I just wanted to let you know that we were professionally hired to build the initial release of this Wordpress plugin: http://coolcastplayer.com/\nWe haven't done any updates to the plugin since (their own development team handles that), but we did help them get it on Amplitude. I know for sure it supports SoundCloud because that was part of the project requirements.\nThat might be a good option if you are looking for a plug n' play solution. If you prefer to put it into SoundCloud on your own plugin, it's completely possible but @danpastori would be your best person to answer your questions.. > I've checked coolcastplayer but the design it's also not the best for what I'm looking for, amplitudejs with a little CSS tweak will be perfect.\nThat's the nice thing about Amplitude. Any design you want is possible 😃\nDefinitely do not try to buy coolcastplayer and tweak the designs (I assume you don't have plans to, but just wanted to re-emphasize).\nGood luck, any questions just let us know.. Hi @danpastori, can you confirm this?. This was commented by @danpastori on the wrong thread. Adding his comment to this thread so we do not lose the history:\nhttps://github.com/521dimensions/amplitudejs/issues/277#issuecomment-407833035. I am going to throw a comment on this thread as an FYI because @danpastori has been so busy with his personal life, he hasn't had much time to get back on Github issues.\nDisclaimer: I am a designer, not a JavaScript developer.\nAmplitude.js can support multiple playlists. @danpastori has worked on improving playlists immensely in Amplitude 3.3. A lot of it is ready on his computer, but we still need to go through testing, documentation, examples, tutorials, etc.\nWe've been working on coming up with a way to be more transparent with this (like publishing to a development branch so that other people can help), but again -- being in a 2 person company it gets challenging to devote a large part of your day to open source.\nWe'll keep you updated on the release of Amplitude.js 3.3 as soon as we have more info available!. We'll be considering this in v3.4. Thanks for adding all of the detail for this.. Thanks for the detailed bug report. I am going to assign this to @danpastori for review.. Thanks for being an awesome dude @carlsmith! If you want, you can submit a PR on the documentation to update it (so you get the contrib credit) on this file: https://github.com/521dimensions/amplitudejs/blob/master/docs/DOCUMENTATION.md\nOr we can have @danpastori update this too. Whatever is easiest. Thanks for researching this and contributing a solution. You rock 👍 \nI'll flag this as \"needs documentation\" until it's complete.. Closed by #272 . You are the man, thanks @carlsmith!. @danpastori: Do we have an example player with this function so we can replicate this?. I am closing this because the topic of discussion is related to a different issue.. I am closing this issue because it did not follow the bug report template guidelines: https://github.com/521dimensions/amplitudejs/issues/new?template=bug_report.md. I was able to confirm this in the example provided. @danpastori please investigate and let us know your thoughts.. Hi @will-muir, sorry to hear that your project is due tomorrow. Reality is that we are volunteers and have our own lives too.\nThanks for your understanding that we do not get paid for this and we'll fix this once we have some free time.. Hi @danpastori,\nJust to make it easier for you to review this, here are the two lines that @xRealMaks is referring to:\n\nhttps://github.com/521dimensions/amplitudejs/blob/master/dist/amplitude.js#L5949\nhttps://github.com/521dimensions/amplitudejs/blob/master/dist/amplitude.js#L6053\n\nPlease review and post your thoughts. Thanks!. Sorry, I am going to have to close this again because it does not follow our bug report template. We need it in a format so that we can replicate it so that it saves us time on confirming the bug. Please open a new bug and complete the requested information.. Thanks for submitting it again with our template. Although you had a fix, it is helpful for us to have an example so we can make sure it doesn't break other things in other browsers.\n@danpastori will take a look into this soon.\nThanks again for making Amplitude better!. We were just talking about this the other day. It might be an item for Amplitude 4.0. Maybe @danpastori can chime in?\n@danpastori: Is there another issue open with this same topic?. Thanks for sharing! We'll review and update this thread if it starts to make progress. Contributions are also welcome too :-) . ",
    "joshgachnang": "Hmm, I can't assign it to myself, but I can handle it :)\n. ",
    "a4jp-com": "+1\n. ",
    "fyockm": "Any reason not to just add this to the beginning of the file?\nvar amplitude_config = {\n  amplitude_songs: []\n};\n. @jaydrogers Fantastic! I noticed you guys made a lot of great improvements today. Let me know if there's anything I can do to help with publishing to npm.\n. I've used travis a good bit, though never to publish automatically to npm. Sounds like a good plan.\nNot sure how much you know about node/npm, so apologies if this is old hat for you. To publish on npm, you'll basically need to add a package.json file and wrap your code so it's exposed as a commonJS module. I've done the latter and used browserify.\n. Just saw this on the Node Weekly and thought it might be helpful: https://eladnava.com/publishing-your-first-package-to-npm/\n. Thanks for trying! I have a couple suggestions for your package.json that I will make via another PR.\n. ",
    "sergiovilar": "Just npm publish please 😄 \n. @jaydrogers If you could publish even without a build process would be really great. Unfortunately we are forced to use bower to install Amplitude. I have a project that we only have Bower because of Amplitude. I really appreciate if you could publish it to npm, thank you! \n. Thank you!\n. Amplitude.playNow doesn't solve this problem?\n. Hey guys, any news here? I just patched a feature to allow set the start time for a song in #54. It has been a month after I did this PR and there's no updates from you guys there.\n. ",
    "mathieuforest": "All audio sources are in a folder on the server. I'm developing locally with mamp. Could that be the cause?\n. Chrome 42.\nNo error in console. I see the stars background moving, the music is playing but their is no animations. i tried bars and MichaelBromleyVisualization.\n. I'll try it and i'll give you a feedback.\nThanks for your help!\n. It worked.\nThanks!\n. ",
    "LittleHamster": "@jaydrogers \nhello, thanks for your reply\nyes, they are in the same domain. I also tested this on my local computer (WAMP server) with different audio files from different domains, but still can't get a single example working. \nalso I sometime get this error: \nInvalidStateError: An attempt was made to use an object that is not, or is no longer, usable\namplitude.js (line 316)\nalso this example: https://open.521dimensions.com/amplitudejs\nhas some issues on Google Chrome (latest version). \n\n- Click the play button \n- Move the cursor to different audio length\n- The audio will stop playing\n- It goes blank\n. @jaydrogers not sure if that is the case. If you look at one for the examples from here : \nhttps://github.com/521dimensions/amplitudejs/tree/master/examples\nyou can see that the latest javascript file is attached\n<script type=\"text/javascript\" src=\"../../js/amplitude.js\"></script>\nwhich leads to: \n/*\n    Amplitude.js\n    Version: 2.1\n*/\n...\nif javascript is not the case, does this mean every time you guys update the core files, the structure will break?\n. any updates regarding this matter?\n. @danpastori I am not sure if I completely understand your response. My issue is regarding an audio file hosted on my own server, the other issue I brought up was from the samples which apparently uses the soundcloud service. \n@jaydrogers said that you will be updating the samples, with a correct amplitude version, is it still necessary to do so? I just can't get a single sample working with my own audio file hosted locally or on the net. \nthank you \n. ",
    "utopiajj": "I am having the same issues. I tried to use my shoutcast stream url in the url keys and still cannot get the player to work in the examples. Any luck with using a shoutcast URL? http://nebula.shoutca.st:8521/;stream.mp3\n. ",
    "vbert": "I have the same question. \nIn addition, I have a request for an example using Dynamic Mode ... \n. Added property auto_next default: false :)\nhttps://dl.dropboxusercontent.com/u/1684778/amplitude.zip\n. ",
    "e3vela": "That's exactly what I had to do, after digging the code I saw that Amplitude was playing the next song as default and it doesn't seems to be a way to prevent that, only creating a custom property. Thanks @vbert , so others can see how they can do it. It really confuses me why they remove that property from the older versions of Amplitude.\n. ",
    "janpfeil": "If the song meta data has \"live\" attribute set to true, the stream will be disconnected (privateDisconnectStream).\n. ",
    "DarioSoller": "Hi @danpastori ,\nthanks for the quick response. I have one main control defined, which looks like this:\n``` HTML\n\n```\nSo the amplitude-main-play-pause=\"true\" had been set. But I think, I have just figured it out. The reason for the bug seems to lie in the fact, that I was initially setting the amplitude-song-index=\"0\" on the main control. As you said, this should only be set on the individual play buttons. So this works as intended:\nHTML\n<div class=\"amplitude-play-pause amplitude-paused\" amplitude-main-play-pause=\"true\" id=\"small-player-bottom-play-pause\"></div>\nFeel free to close this issue, as it was my fault, not setting up the main control correctly. Probably caused by trappy copy'n'paste! Thanks for helping me clarifying it.\n. ",
    "quoid": "@danpastori wow, thanks for the quick response - testing now; will report back in a few\n. Thank you again, @danpastori.\nI can't seem to replicate the issue now.\nI am excited to hear about the new features with v2.3; just found Amp a few days ago and already loving it.\nI do have some feedback though (some of it is preferential though, didn't want to make an issue about and apologies if unwarranted).\n- I disabled the touchstart event listeners for my project. It had an adverse affect on the UX on mobile devices. Scrolling (via fingers on mobile) triggers touchstart so it was playing items in the playlist, when the user just wanted to scroll over them. Something like this (using touchend and listening for touchmove) can get around that.\n- somehow utilizing (callback?) buffering_start & buffering_end soundcloud events - that's about the only thing I'm missing - a way to visually tell the user \"stuff is loading, hold your horses\" (probably through a loading icon that gets hidden when buffering_end gets fired)\nAgain, thanks loads and apologies for the super long reply!\n. ",
    "jameslanman": "Thanks @jaydrogers !\n. ",
    "5ch1ll1ng": "Hi Dan, \nthank you for your answer!\nI finally found a solution by placing the playlist on a other page and it's working great. I added the play-pause button and everything's okay.\nYour player is fantastic, it's all I needed for a project for a musician. I'll copy the link when it's completely finished.\nBest,\nPierre\n. ",
    "otusweb": "This was actually happening with another branch, not with this one. So closing\n. ",
    "blushi": "Hi @danpastori,\nThank you for your quick answer.\nUnfortunately, version 2.3 does not fix the bug and something else seems to be broken:\n```\n\n\n\n\n```\nIn this multiple song environment, clicking on the individual song element does not trigger play/pause, only the main play/pause control is still working.\n. ",
    "ryanrca": "I am challenged by this too.   I'm getting an error:\nvar song = [\n                    {\n                        \"name\": \"Song 1\",\n                        \"artist\": \"Artist 1\",\n                        \"album\": \"Album 1\",\n                        \"url\": this.playlist,\n                        \"cover_art_url\": \"/images/logo.jpg\"\n                    }\n                ];\n                publicPlayNow(song);\naccepter.js:14986 Uncaught ReferenceError: publicPlayNow is not defined\nSo I tried:\nAmplitude.publicPlayNow(song);\nSame thing:\naccepter.js:14985 Uncaught TypeError: Amplitude.publicPlayNow is not a function\nhow is this supposed to work?\nNow you can pass a song object using the publicPlayNow() function and Amplitude will play that song right away.\nThanks!\n. Okay, inspecting the dom, I got it to work:\nAmplitude.playNow(song);\nBut now I'm getting lots of new errors:\nPerforming operations that require explicit user interaction on touchstart events is deprecated and will be removed in M54, around October 2016. See https://www.chromestatus.com/features/5649871251963904 for more details.\nplaying:  https://s3-us-west-2.amazonaws.com/music3-public/Business2/BU228-HighTechnology-Lukyanov-96.mp3\nUncaught (in promise) DOMException: The play() request was interrupted by a new load request.\nGET http://localhost:3000/undefined \nUncaught (in promise) DOMException: Failed to load because no supported source was found.\n\"playing\" is console.log(song[0].url);\nQuestion.  Can I use HTTPS for the url?\n. @blackmamb41 Sorry I cannot help you.  I gave up on amplitude because I couldn't get it to work in my environment. \n. ",
    "blackmamb41": "hei @ryanrca can you show me how to stop music on multiple song, i mean i have 3 song, but if i play start on song index 0, and if song ended it's play next on song index 1, i wanna stop playing if song index 0 ended :) thanks\n. oke no problem @ryanrca :D, i have any idea to handle my dynamic song :) , i using JSON object query to handle song,. thanks before to respone my question @ryanrca \n. ",
    "mrcury": "Worked a treat! Thanks, you guys rock 🤘. ",
    "gh-darvishani": "thanks for replay my question\ni see this notification on console \nHTTP “Content-Type” of “audio/x-ms-wma” is not supported. Load of media resource http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/05_I_Still.wma failed.\nCannot play media. No decoders for requested formats: audio/x-ms-wma\nAnd this is header's\nAccept-Ranges   \nbytes\nConnection  \nclose\nContent-Length  \n3825830\nContent-Type    \naudio/x-ms-wma\nDate    \nTue, 23 May 2017 18:23:48 GMT\nEtag    \n\"3a60a6-0-0\"\nLast-Modified   \nThu, 18 May 2017 23:51:12 GMT\nServer  \nLiteSpeed\nview source\nAccept  \naudio/webm,audio/ogg,audio/wav,audio/*;q=0.9,application/ogg;q=0.7,video/*;q=0.6,*/*;q=0.5\nAccept-Language \nen-US,en;q=0.5\nConnection  \nkeep-alive\nCookie  \n_jsuid=591934276\nHost    \ncdn.oneremind.com\nRange   \nbytes=0-\nReferer \nhttp://127.0.0.1/music/main/album/album_id/69\nUser-Agent  \nMozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:52.0) Gecko/20100101 Firefox/52.0\nand this is response:\nReload the page to get source for: http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/05_I_Still.wma\nwhere am i wrong ?. this is my code\n Version: 2.3\n{\n  \"songs\": [\n    {\n      \"name\": \"Somewhere I Belong\",\n      \"artist\": \"من متعلق به جایی هستم\",\n      \"album\": \"من متعلق به جایی هستم\",\n      \"url\": \"http://cdn.oneremind.com/song/Linkin_Park/Hybrid_Theory/02_One_Step_Closer.mp3\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Don’t Stay\",\n      \"artist\": \"نمون\",\n      \"album\": \"نمون\",\n      \"url\": \"http://cdn.oneremind.com/song/Linkin_Park/Hybrid_Theory/01_Papercut.mp3\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Never Gone\",\n      \"artist\": \"هرگز نرفته ای\",\n      \"album\": \"هرگز نرفته ای\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/12_Never_Gone.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Siberia\",\n      \"artist\": \"سیبریه\",\n      \"album\": \"سیبریه\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/11_Siberia.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"The Safest Place to Hide\",\n      \"artist\": \"امن ترین مکان برای مخفی کردن\",\n      \"album\": \"امن ترین مکان برای مخفی کردن\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/10_Safest_Place_to_Hide.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"My Beautiful Woman\",\n      \"artist\": \"زن زیبای من\",\n      \"album\": \"زن زیبای من\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/09_My_Beautiful_Woman.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Climbing The Walls\",\n      \"artist\": \"بالا رفتن از دیوار\",\n      \"album\": \"بالا رفتن از دیوار\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/08_Climbing_the_Walls.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Lose It All\",\n      \"artist\": \"از دست دادن ان همه\",\n      \"album\": \"از دست دادن ان همه\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/07_Lose_It_All.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Poster Girl\",\n      \"artist\": \"پوستر دختر\",\n      \"album\": \"پوستر دختر\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/06_Poster_Girl.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"I Still\",\n      \"artist\": \"من هنوز\",\n      \"album\": \"من هنوز\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/05_I_Still.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Weird World\",\n      \"artist\": \"جهان عجیب و غریب\",\n      \"album\": \"جهان عجیب و غریب\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/04_Weird_World.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Crawling Back To You\",\n      \"artist\": \"برگشتم پیش تو\",\n      \"album\": \"برگشتم پیش تو\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/03_Crawling_Back_to_You.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Just Want You to Know\",\n      \"artist\": \"فقط می خواهم شما بدانید\",\n      \"album\": \"فقط می خواهم شما بدانید\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/02_Just_Want_You_to_Know.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Incomplete\",\n      \"artist\": \"ناقص\",\n      \"album\": \"ناقص\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Backstreet_Boys/Never_Gone/01_Incomplete.wma\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Glitter In The Air\",\n      \"artist\": \"زرق و برق در هوا\",\n      \"album\": \"زرق و برق در هوا\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Pink/Funhouse/06_Glitter_In_The_Air.mp3\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Please Don’t Leave Me\",\n      \"artist\": \"تورو خدا ترکم نکن\",\n      \"album\": \"تورو خدا ترکم نکن\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Pink/Funhouse/05_Please_Don\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"One Foot Wrong\",\n      \"artist\": \"یک قدم اشتباه\",\n      \"album\": \"یک قدم اشتباه\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Pink/Funhouse/04_One_Foot_Wrong.mp3\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"I Don't Believe You\",\n      \"artist\": \"من باورت نمیکنم\",\n      \"album\": \"من باورت نمیکنم\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Pink/Funhouse/03_I_Don\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"Sober\",\n      \"artist\": \"هوشیار\",\n      \"album\": \"هوشیار\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Pink/Funhouse/02_Sober.mp3\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    },\n    {\n      \"name\": \"So What\",\n      \"artist\": \"پس چه\",\n      \"album\": \"پس چه\",\n      \"url\": \"http://cdn.oneremind.com/up/song/Pink/Funhouse/01_So_What.mp3\",\n      \"cover_art_url\": \"http://127.0.0.1/up/albom/384_3df70c2a8d20b341780787af825966324e010b7a0140ef517727ee6810564765cccc.png\"\n    }\n  ]\n}\n. i download v 3 but problem does not fixed ..... thanks ... i upload site on host and check the problems ... and wait for your replay. @jaydrogers i test my problem on host and no problem ...all music are played \ni am sorry\ni think the problem  is ubuntu  or lamp services . thans\nhttp://undermusic.ir/main/album/album_id/85\nfor first choose one song and sreach any word for get new song list and if you select an song last song and new song together palying. ",
    "BronzeCrab": "Im playing now with player:\nhttps://521dimensions.com/open-source/amplitudejs\nAnd I press repeat button but it dont repeat a track. @danpastori \nHi, ok, thanks. ",
    "mistermantas": "Here’s another use case: multiple track qualities. Users could pick either lossless (WAV), lossy but usually good enough (OGG/MP3 320 kbps), very lossy (OGG/MP3 128 kbps), that sort of thing.. Neat. Maybe you know when that dev build could each beta or stable?\nThe music app itself is still in alpha, so this'll work for now, though. I'll report back if I see any issues.. @rowild Good start. I assume there’s a way to add scrubbing events and re-use a bit of this code?. I apologize, I’m dumb. Amplitude.addSong() is a thing, why didn’t I spot that!?. I didn’t find a solution.. No need for help. Whenever I seem to ask for help, I always figure it out right after haha.\nThe issue fixed itself? Maybe I fixed it? I don’t think Amplitude can be loaded async, which may be part of the issue. But also the other issues I experienced — like Snackbar not being defined, which was a whole different library — seemed to stem from a whole different issue that wasn’t related to the library.. To answer your question, @Bagera, yes! Sort of.\nWhen you use playNow(), the track isn't played from the queue. It's like a temporary strap on.\nYou could use it. I chose a different way to do it, I think, which I can share if anyone is looking for it.\nBut it's hacky. That's the thing.. Of course, I do understand, it’s just an interesting oversight. Sorry if I came off as rude. \n. ",
    "MartinKolarik": "... and the best thing is, you actually don't have to do anything. . @jsdelivrbot npm amplitudejs. @jaydrogers please see https://github.com/jsdelivr/jsdelivr/issues/18007#issuecomment-304534797. ",
    "jsdelivrbot": "Browse the CDN files https://cdn.jsdelivr.net/npm/amplitudejs/\nLoad the main file https://cdn.jsdelivr.net/npm/amplitudejs@3.0.2\nMake sure you configure the default file correctly. You can use \"jsdelivr\" or \"cdn\" in package.json to set the correct CDN file.\nVersion aliasing to latest major release https://cdn.jsdelivr.net/npm/amplitudejs@3\nAdd .min. to files to auto-minify.\n--\nFull documentation . ",
    "LordBonzi": "I'd like to see this happen so I can use amplitude.js on my site, even if it was just the exact same one as the demo site i'd still be more than happy. . To be honest, just give us the one from the demo  and I think we'd all be more than happy, I've show it to many people and they too agree it looks superb. Thanks alot @danpastori you've just saved me a week of Sundays trying to tinker with a template myself\n. ",
    "profzoff": "can the playlist coding be adapted to use an API Key and JSON API? . ",
    "Muhnad": "Hi, @jaydrogers\nIt's good to support keyboards I waiting for the new release to see that :smiley: \nthe answer to the first question is yup this is a one of suggesting to test keyboards event in your app beside to test every functionality you should do with the keyboard without using a mouse.\nI recommend reading those links WebAIM: keyboard accessibility  & W3: Keyboard Accessible\nthe second one in usual you don't need to test aria-label because it works if you understand it and use it in the right position but you can test your website by enable accessibility inspector in Chrome.\nif you have any question or need any help for a11y mentions me I'll help you if I can. :smile: . ",
    "Darker": "I tried this, it doesn't work:\nAmplitude.init({\n        \"songs\": [\n            {\n                \"name\": \"Song Name 1\",\n                \"artist\": \"Artist Name\",\n                \"album\": \"Album Name\",\n                \"url\": \"/song/url.mp3\",\n                \"cover_art_url\": \"/cover/art/url.jpg\"\n            }\n        ],\n        before_play: function() {\n             console.log(\"About to start playing.\");\n        }\n    });. It works, but there are only few debug messages so you won't notice it.. This isn't what I wanted to do.. It won't be that easy this time. It actually took me quite a while to find the error myself. Couldn't figure out why the buttons work, but not the song title.. Well, I fixed it by manually changing innerHTML of the nodeif amplitude didn't do it:\nconst LIBRARY_JSON = await VOXSNAP_JSON_DOWNLOADED;\n                // @TODO hack until https://github.com/521dimensions/amplitudejs/issues/183 is fixed\n                if(document.querySelector(\"[amplitude-song-info]\").innerHTML.indexOf(\"SONG_TITLE\")!=-1) {\n                    document.querySelector(\"[amplitude-song-info]\").innerHTML = \"\";\n                    document.querySelector(\"[amplitude-song-info]\").appendChild(new Text(LIBRARY_JSON.narrations[0].title));\n                }. ",
    "fiter92": "I have the same question!. this code doesn't works, but should to =\\\nAmplitude.init({\n                songs: songs,\n                callbacks: {\n                    after_play: function(){\n                        console.log('after_play');\n                    }\n            }\nI've check the source code:\nvar callbackFunction = window[config.callbacks[callbackName]]\nI don't really understand what's the point of calling property of window object, so I replaced it:\nvar callbackFunction = config.callbacks[callbackName]\nAnd that's works fine.. ",
    "carlsmith": "This seems to be fixed, ~~but Amplitude.setSongPlayedPercentage is not working in Chrome (though that's probably unrelated)~~.. I think this may not be a problem with Amplitude after all. Chrome apparently requires Content-Range HTTP headers to stream the content, but FireFox doesn't.\nI tested this using your example code (in Chrome), and it worked when your server served it, but the same code doesn't work when served by my local App Engine dev server.\nI'll fix the headers on my server and make sure that was the issue. You guys may just need a minor update to the docs to let people know about this.. Thanks @jaydrogers. I just got my server sorted and it was the HTTP headers (not Amplitude) that wasn't working.\nI'll submit a PR on the docs tomorrow evening, no problem. Just glad to have caught it before anyone put a bunch of time into looking for a bug that wasn't there.\nThanks again, and for Amplitude. It's an awesome library.. Sorry. I forgot to get this done yesterday, but am starting now.. No problem. Thanks. I was going to go into more detail, but wanted to keep it to a simple note and a link to more information. A lot of server frameworks have support for this (App Engine's Blobstore takes care of it automatically), so the actual solution is often specific to the tools you're using.\nI'm building a site for a musician, and have only played with the Web Audio API a little bit, so was worried it was going to be difficult to get the audio player working, but Amplitude made it really easy. Thanks.. ",
    "hitaloramon": "Thank you worked out well !!!. ",
    "Playacem": "Realized today that the url mistake also creeped into the documentation.. ",
    "freedomlives": "Well, on his friend's site, http://www.stevedigiorgio.com it is all done as one page.  which can be cool, but in this case, on my 12MBps connection, takes half a minute to load and transfers 16MB of data.  But the one page approach means that there is no jumping to different pages, just jumping between anchors, so the music player (top right of page) doesn't reset itself when going to different pages.\nMy client's site is www.rogerstaffelbach.com .   I implemented the player modifying one of your demos in the source code, and honestly, it is just being put up there in an iframe, though eventually I want to make a plugin for the CMS I use a lot-- typesettercms.com \nThanks for the quick response @jaydrogers \n@danpastori is the idea I had how this might be done roughly the right path to follow?. ",
    "theefunklord": "First off, great work on the player! Confirming AJAX/PJAX would likely be the best option for this kind of project. This situation can work, where a song is selected on one page, and keeps playing throughout the rest of the browsing experience.\nChiming in as I'm implementing similar functionality in a beta site for my DJ crew (I used a Soundmanager2 previously on my own site), but wanted a player with less bloat (Flash) and more web-forward (HTML5) adaptability which is why I chose Amplitude this time.  \nI've got everything up and running, however my issue is that the \"changeSong\" and associated functions aren't detecting existing audio playback after navigating back to the page. So I play audio (track 3), leave the page, return (with track 3's audio still playing), but the player (art, progress, metadata) is reset and will also let me play all tracks (including track 3, again) while track 3 is still playing. \nIt seems you created something too schwifty for its own good!\nI really like the idea of sending data to sessionStorage, but I'm also wondering about the best way to achieve this. Alternatively, are there suggested public functions to (re)call during or after a page change event to check if/for current audio instance? I'd like to use existing code to simplify..\nIdeally if audio is already playing, time metadata, progress, album art, etc. could/should be stored from that first play- and updated with following clicks.\nI've got localStorage for CSS running separately on this project, but I'll see If I can hack together some logic to store some Amplitude data for the session. Perhaps JSON from a public function?\n@freedomlives If I may recommend the very handy (Barba.js) for a simple div wrapper concept that makes push state easier to grasp. I found it after getting frustrated with PJAX directly, and wanted to focus more on front-end fun.\nCheers!. Thanks again for the work @danpastori. I look forward to 3.2.\nI was able to figure out a temporary fix after reading Issue 193 today actually. I copied the dev script and it got the gears churning.  I realized I ended up needing to call Amplitude.bindNewElements(); after my page transitions with Barba. It works as intended now. I was also able to properly set up callbacks for after_play and the rest, so the documentation and your work with @jaydrogers has helped a lot.\nGood advice on Vue and Angular as well. I may stick with Barba as I've been messing around with it for a year now, but you're right for sure.. ",
    "schnoddelbotz": "I'm in the same boat as @fiter92 ... I have a single-page-app that queries my song database and displays individual albums. Every time another album is shown, I'd need to re-initialise the song list.\nRisking to get very off-topic here, but a public playByIndex() and stop() function would be helpful for me :). ",
    "enemyss": "I have similar situation, right now to change array I'm re-initializing the player with new song array and before initializing I have to pause previous song otherwise it will play in background while the new ones are playing, is this viable solution? Is there any better way to do this?. @danpastori thanks for replying, I just tried adding new songs and removing old ones, but then the player current song is from previous song list and I have to call Amplitude.next() or press next to get to the new song and also by adding X new songs for each one I get \"uncaught promise error\" in console though I'm not sure how crucial is that since it seems to not affect anything. And since with songAdd/remove I have to use cycle won't it be slower than initializing new array?. @danpastori I'm still confused, it means that it is working as it should? The main issue with this I have is that when switching to next song the DOM element is incorrect for song playing because it just takes next song in array instead of shuffled song, this seems incorrect or am I missing something?. ",
    "snote": "Negative. No change. Sorry.. On windows, both Versions are working with firefox and chrome.\nOn Android 4.2.2 only the older js file is working with icecat, chrome.\nOn Anroid 5 nothing is working on the latest chrome browsers.\nYes, we had two phones of the same brand, one was working, one not.\nThe one that was not working was on the latest chrome, the other i don't\nknow.\nAm 31.07.2017 um 13:06 schrieb Jay Rogers:\n\nWhat operating systems are you running? You said one works but the\nother doesn't? Both are running latest version of Chrome?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/521dimensions/amplitudejs/issues/186#issuecomment-319163540,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AEeomUtDNz_zH78i1Rl6FKhHdHEjoTghks5sTiO0gaJpZM4Onh2S.\n\n\n. The thing is, that with Version 3.1 it is not working even on my win\nComputer..\nI loaded the 3.1 files now.\nSo there must be an issue which is more basic. Nothing to do with Android..\nAm 01.08.2017 um 11:52 schrieb Jay Rogers:\n\nI see your site is still running Amplitude 2.3. Could you update your\nlink to Amplitude 3.1 and let me know?\nI don't have an Android device so I will need to email the link out to\nsome friends to test it with.\nscreen shot 2017-08-01 at 12 50 35 pm\nhttps://user-images.githubusercontent.com/3174134/28839111-35a2a2ea-76b8-11e7-9349-1e309584cadf.png\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/521dimensions/amplitudejs/issues/186#issuecomment-319446360,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AEeomZyQNzwPdP0lN6NZPxMgQWphQpPJks5sT2XJgaJpZM4Onh2S.\n\n\n. ok. I changed it.\nAm 01.08.2017 um 12:44 schrieb Jay Rogers:\n\nYour |amplitude.js| file is incorrect. It's some sort of HTML.\nDownload the original 3.1 file here\nhttps://github.com/521dimensions/amplitudejs/releases/download/v3.1.0/amplitude.js\nand upload it to your server.\nscreen shot 2017-08-01 at 1 42 20 pm\nhttps://user-images.githubusercontent.com/3174134/28841301-6447bf8e-76bf-11e7-8fdc-930efa8ef28e.png\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/521dimensions/amplitudejs/issues/186#issuecomment-319460813,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AEeomcCYVGs4C7K5df1LqOSPYfXmnZqxks5sT3IMgaJpZM4Onh2S.\n\n\n. Seems like it is working now..\nBut now the autoplay function is working no more and the cover art\npictures aren't visible anymore. Does this have something to do with the\nnew file?\n",
    "jwedel": "@jaydrogers Hi, I solved it, changing the template in my backend. However, this would still be cool for client side apps.. @danpastori Ha... interesting. I deployed it on my prod machine and scrubbing works perfectly.\nThis is really strange. Unfortunately, I can't give you access to my local dev machine. I mean, it would be nice if it works on my machine but it's good to know that works in production.\nBy the way, same song files but locally I'm using Django dev server, on prod a gunicorn is running. So this might be the difference.. ",
    "kevibethink": "Hi @danpastori. I think I'm having the same/similar issue and I can't tell if this is the expected behaviour or not, but when I have multiple tracks visible on my page with their durations visible the first song is the only track that has it's duration set on page load. When I click to play the 2nd track the duration gets loaded at that stage, but I'd love if all the songs have their duration set on page load, rather than on play? I tried other ways to fetch the data, but it appears that you can only get the metadata for the active song using getActiveSongMetadata(). Maybe a getSongMetadata() where you could pass an index like jwedel mentioned is the solution?. ",
    "rowild": "@danpastori The examples would be nice, though! Please provide some, would be of great help!\nOn the other hand I wonder, if this couldn't be done with one additional CSS class that is also written to the Amplitude.config object.\nSay, there is a wrapper class or ID for each player that reads like \"amplitude_player_1\", and this is written to the config like \"Amplitude.init({ player: document.querySelector('.amplitude_player_1') })\", so the user can have full control over naming etc.\nThe JS, of course, would have to be adapted to something like this: \n\"...(Amplitude.config.player + ' amplitude-volume-up')\".\nHaving said that, the DOM parsing gets more intense because of that. And since AmplitudeJS has a lot of \"document.getElementById\" and similar code line, I wonder, if it wouldn't be better to put all those classes in a settings tree of the config object, so that the parsing is done only once. This could speed up the rendering and any further interactions and probably could even be helpful in AJAX scenarios...\nJust my 2 cents.... Do you mean an example of my proposal or the announced examples by @jaydrogers ?. I did something similar for the volume slider. To show how much loudness there is, I implemented an extra div and change its width via a addEventListener. To keep it al together, a label wraps the whole thing.\nThis is my code (my naming of classes sucks!!!):\nhtml\n<!-- HTML Markup -->\n<label class=\"c-amp--volume-slider-label\">\n<input type=\"range\" class=\"amplitude-volume-slider  c-amp--volume-drag\"/>\n<!-- the new volume block -->\n<span class=\"c-amp--volume-block\"></span>\n</label>\nSCSS\n// SCSS\n.c-amp--volume-block {\n    box-sizing: border-box;\n    position: absolute;\n    display: block;\n    top: 0;\n    left: 0;\n    bottom: 0;\n    width: 0;\n    //height: 38px; // deduct the border from parent\n    background-color: $color-bg--dark;\n    z-index: 1;\n    transition: width 0.15s;\n}\n```javascript\n// Javascripts\n// AC (AmplitudeConfiguration) is a global that holds the config and the track list\n// Add a new param 'initiated'\nvar AC = {};\nAC.player_1 = {};\nAC.player_1.config = {\n    \"playerId\": \".c-amp__electronics\",\n    \"songs\": AC.player_1.trackList, // do something similiar for playlists\n   // Needed for the \"volume block\", whichs width needs to be adjusted on initialisation\n    \"initiated\": 0\n};\n// From loadAudioPlayerConfig, also call other functions\nfunction loadAudioPlayerConfig() {\n// Create the HTML list of the songs\nbuildAudioPlaylist();\n\n// Initialize the AmplitudeJS player\nAmplitude.init(AC.player_1.config);\n\n// Adjust the 'volume block' width on initialisation\ninitVolumeSlider(AC.player_1.config.volume);\n\n}\n// Initiate the 'volume block' (left of the slider knob)\nfunction initVolumeSlider(vol) {\nvar dragKnob = document.querySelector('.amplitude-volume-slider'),\n    el = document.querySelector('.c-amp--volume-block');\n\n// Define some params (these will be readable on e.target):\ndragKnob.el = el;\ndragKnob.vol = vol;\n\n// Adjust the 'volume block' on initialisation to the user settings' volume.\n// Requires a new settings parameter 'initiated', defaulting to 0\nif(AC.player_1.config.initiated === 0) {\n    el.style.width = vol + \"%\";\n\n    // Once initiated, set the value to 1\n    AC.player_1.config.initiated = 1;\n}\n\n// Now put a eventListener on the volume knob that takes care of\n// adjusting the \"volume block\"'s width\ndragKnob.addEventListener('input', updateExpiredSongTime);\n\n}\n// Expand and shrink the 'volume block', when volume knob is dragged\nfunction updateExpiredSongTime(e) {\n    // 'e.target' has parameters 'el' and 'vol' defined on it; see 'initVolumeSlider'\n// e.target.el.style.width = e.srcElement.value + \"%\"; // not working in FF\ne.target.el.style.width = e.currentTarget.value + \"%\";\n\n}\n```\nThis is just a first-go, but I think it is doable for the player position, too. \nCurrently, the volume handling in amplitude seems to be not fully covered. I had to add some calls to some sync function in the core to make this work, when using volume-up and -down buttons... (And I have not experimented with playlists yet...)\nBut hopefully this is a start.... @mistermantas I have now idea how to handle scrubbing... maybe I find some time to look into it.\nMeanwhile I managed to add the \"already played\" indicator. Needs an additional line in the core, but otherwise works great.\nI actually come to believe that an input.type=range element is pretty awesome for such things. Considering the solutions with divs, all that handling with drag and drop (I've done that with jplayer), this type of element already delivers things that otherwise would have to be built. \nAt MDN it is actually listed as \"commonly used for\" audio controls (volume, balance, filters) etc.\nhttps://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/range\nAnd on IE, you get the \"already played\" section for free, if you use the ::-ms-filled pseudos.\nCurrently, I would vote for keeping this solution, and adding an extra div for the song as well as the volume sliders natively.. Ah! I was just about to open a feature request :-)\nGood! Looking forward to it!\nAnd @danpastori : no stress!!!. Can I be of any support? Would it be of any help if I shared my version of your player? E.g. via a codepen? Or re-style your examples the BEM way?. Cool! Looking forward to it! I'll share mine soon on Codepen!\nRobert M Wildling  ||  web developer  |  composer  |  music\nengraver  |  3D\nGöllnergasse 19/30 || A-1030 Vienna\nph: +43 676 6089613  || @: robertwildling@gmail.com\nhttps://soundcloud.com/rowild\nhttp://www.amplify.at/projects/wildling/wildling_main.htm\n2017-09-28 21:28 GMT+02:00 Dan Pastori notifications@github.com:\n\nIf you have an example of a BEM styled player, that'd be great! I have\nanother example I want to use, but want to make sure it's ready to rock and\nroll before I push it\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/521dimensions/amplitudejs/issues/198#issuecomment-332939668,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AANDK3-lKWx1U3LD6EfikELhuEekqoIkks5sm_NfgaJpZM4PMFEA\n.\n. Hi, thanks for your response!!!\n\n\n\nI updated my post with your mp3-link - thanks a lot!\n\n\nThe problem has nothing to do with a web standard, to my knowledge. but it conflicts with the documentation, where it says that the volume is calculated from a value between 0 and 1. The documentation itself uses a value of .35, which is inaudible.... Well, thanks for your player!!! :-)\n\n\nAs a side note, since you mentioned you're more a designer: do you mean CSS designer or Photoshop stuff? If it is the first one, I would really like to know your opinion about the selector question that I posted!. Ah, good! I didn't know that, sorry! I will do that next time!. OK, I found my way around that:\n- Create a separate \"tracks\" object\n- Reference it in the init({ songs: tacks }) section\n- Create another function that loops through the tracks object and put together the HTML (this function needs to be called before \"Amplitude:init()\"!)\nOne question remains: how do I get the time of the songs?. I have no results so far, but I am looking into this library at the moment:\nhttps://github.com/aadsm/jsmediatags. PS: How about a \"syncVolumes()\" function?. I have no \"issues\", better said: no IDE has any \"issues\" with not having doc blocks. :-)\n(It is just something that would be activated, as soon as doc blocks are there.)\nI use phpStorm.\n(I am really unsure, what the comments with double stars are really called. But for javascript, it would be JSDoc, to my knowledge, that would generate annotations and such - see TypeScript). @danpastori I think http://usejsdoc.org/ is a good source. \n(The changes would be easy: any comment that documents a function, should start with \"/*\" instead of only \"/\".)\nWould be great, if you could implement it! :-)\nThank you!!!. You can do this with simple CSS. The \"amplitude-song-container\", which wraps all infos regarding one track, gets the class \"amplitude-active-song-container\" assigned, once it is the current track. There is also a class (on the same container) \"amplitude-playing\" / \"amplitude-paused\" to handle the respective playing status.\nCan you solve your requirements with these classes? Or did I misunderstand you and you are looking for a different kind of functionality?\n. I understand. There are currently 4 callback methods:\nhttps://521dimensions.com/open-source/amplitudejs/docs#callbacks\nWould \"before_play\" fit your needs?. I understand! Good to know!!! Thanks!\nI fooled around a bit, and the method \"syncActiveContainer\" as well as \"setNewSong\" fire a (manually inserted) console.log() each time the song track changes... maybe that's a place to hook up a \"syncTrackLayoutFunc\"? . ",
    "foysalremon": "Sorry, I was busy with some other stuff. For my last project I have change plugin for audio player. An example would be great, but there will still be some issue while all track have to be listed once. Giving 2 example case:\n\n\nI was actually wanting to generate json track data by collecting information from html data attribute and then push them into amplitude playlist config as track. It was not easy with single config option.\n\n\nIf someone would like to use amplitude with WordPress and they have different custom post for different player where all the track attribute will come from some custom field then it will not be easy them to configure all track at once while showing them different place.\n. \n\n",
    "mamunhpath": "@jaydrogers did you know this example was made or not? If made please give me the HTML file. I need multiple playlist badly. Thanks. @diplopito thank you very much, but without adding another js file how can I add two/three player in same page? You know Amplitude.js minified version is 54 KB so I don't really want to add another js file, we need to make the site faster also. . @danpastori thanks for the solution. But I need to know more about this like when I will initialize for every player like this:\n`Amplitude.init({\n    \"songs\": [\n        {\n            \"name\": \"Lorem Ipsum Dolor Emmet Song\",\n            \"artist\": \"Jhon Doe\",\n            \"album\": \"Lorem Ipsum Dummy Album\",\n            \"url\": \"/media/audios/2018/07/23/wave.mp3\"\n        }, {\n            \"name\": \"Lorem Ipsum Dolor Emmet Song\",\n            \"artist\": \"Jhon Doe\",\n            \"album\": \"Lorem Ipsum Dummy Album\",\n            \"url\": \"https://www.sample-videos.com/audio/mp3/crowd-cheering.mp3\"\n        }, {\n            \"name\": \"Lorem Ipsum Dolor Emmet Song\",\n            \"artist\": \"Jhon Doe\",\n            \"album\": \"Lorem Ipsum Dummy Album\",\n            \"url\": \"/media/audios/2018/07/23/wave.mp3\"\n        }\n    ],\n    \"playlists\": {\n        \"default-playlist\": []\n    },\n});\nAmplitude.init({\n    \"songs\": [\n        {\n            \"name\": \"Lorem Ipsum Dolor Emmet Song\",\n            \"artist\": \"Jhon Doe\",\n            \"album\": \"Lorem Ipsum Dummy Album\",\n            \"url\": \"/media/audios/2018/07/23/wave.mp3\"\n        }, {\n            \"name\": \"Lorem Ipsum Dolor Emmet Song\",\n            \"artist\": \"Jhon Doe\",\n            \"album\": \"Lorem Ipsum Dummy Album\",\n            \"url\": \"https://www.sample-videos.com/audio/mp3/crowd-cheering.mp3\"\n        }, {\n            \"name\": \"Lorem Ipsum Dolor Emmet Song\",\n            \"artist\": \"Jhon Doe\",\n            \"album\": \"Lorem Ipsum Dummy Album\",\n            \"url\": \"/media/audios/2018/07/23/wave.mp3\"\n        }\n    ],\n    \"playlists\": {\n        \"top-hidden-playlist\": []\n    }\n});`\nHow I should initialize playlist for each one? this is my code, what is not working. Can you please help me on this?. @danpastori Thanks, But all my songs added dynamically so, I can't count sequentially and I want to initialize Amplitude for each of them. . @danpastori Thank you very much. Hope it will be my last question: By adding song addSong() and addSongToPlaylist() how I will get the all index in playlistkey like:\"default-playlist\": [0-to-all] and \"top-hidden-playlist\": [0-to-all]?. OK, thanks. Can you please check the W3 validation issue? . ",
    "Thatkookooguy": "i think you misunderstood me.\nI don't want to highlight the song that's being changed. I want to change my site theme based on the band being played right now\nso, eventually, I want to add a class to the body element to change the site's colors based on the band's logo scheme.\nSo, when someone clicks on a song, it's easy to detect. but if the playlist moves to another band, im not able to detect it at the moment (started going over source code to check which events are being thrown). I need some sort of onTrackChange event.\nif you don't have this, I might add an event like that myself. do you want me to propose a pull request if I do?. I tried it and it looks like it is only triggered when clicking a play button. it doesn't trigger on song change if you play the main songs list. Thanks, @danpastori !. ",
    "tveloq": "Wow that's such a great timing! I can confirm the issue is gone on my end, thank you so much @danpastori @jaydrogers !. ",
    "g-maclean": "Hey @danpastori,\nI understand how it works.\nHave you actually tested this with an example involving multiple playlists?\nnextIndex should be the song index in songs[] that is to be played next.\nHowever, as you can clearly see in the above code, nextIndex is being set to the original index of a playlist song in a shuffled playlist - this is not the index of a song in songs[] - a step is missing, which is to get the actual index of the song in songs[] USING the original_index of the playlist song. \n. @danpastori \nI have a client site where this was a problem, I just created a super quick solution otherwise I would have sent you a PR.. @ashecret\n        Get the index of the song that we will be switching to.\n    */\n            nextIndex = _config2.default.shuffled_playlists[playlist][_config2.default.shuffled_active_indexes[playlist]].original_index;\n            nextIndex = _config2.default.playlists[playlist][nextIndex]; //FIX @GM\n\n\n        } else {\n            /*\n    Sets the active shuffled playlist active index to 0 and gets the original index of\n    the song at the shuffled index of 0.\n*/\n            _config2.default.shuffled_active_indexes[playlist] = 0;\n            nextIndex = _config2.default.shuffled_playlists[playlist][0].original_index;\n            nextIndex = _config2.default.playlists[playlist][nextIndex];//FIX @GM\n            endOfList = true;\n\n        }. @ashecret hope this helps.\n",
    "ashecret": "@g-maclean @danpastori \nI am having similar trouble. I have four playlists named playlist_1 ..... playlist_4. However, shuffle works with playlist_1 only. No matter which playlist key is used to turn shuffle on and off.\nEven if the current music is from playlist_2 or playlist_3 or playlist_4 and shuffle is turned on, next music is always from playlist_1. \n@g-maclean would really appreciate if you provide with the quick solution you have implemented.\nAmplitudejs version: 3.2.1. Thanks @g-maclean \nI'll give it a shot. Import amplitudejs as below and you are good to go.\nimport * as amplitudejs from 'amplitudejs'\n. ",
    "GuillaumeSTEIN": "Thank you for your help. Hi :)\nDo you plan on working on this or do you prefer a pull request from me?\nThank you for your job.. ",
    "dijeanbonjour": "Is there any issue ? I want to do exactly the same thing . Thank you so much !!!!! It works. ",
    "ArmanGrewal": "Thank you for response. I read the document, It seems like iphone/ipad issue.\nDo you know any work around for it, It would like to have mute/unmute functionality on iPhone\nFYI -mute/unmute is working fine here https://www.nytimes.com/2017/10/27/podcasts/the-daily/opioid-crisis-donald-trump.html\nhttps://jsfiddle.net/6ys6rw4h/1/\n. ",
    "shohei000": "Thank you for your reply.\nHow can I use this license?\nDo not do anything ok?. Hi @521dimensions\nThank you for contacting us.\nAlthough I could not grasp the version, I could not solve it even if I replaced it with javascript.\nDo I need to set something for continuous playback?\n. Thank you for being kind.\nThis is the URL of the problem.\nhttp://www.birginbargain.com/\n. ",
    "AgentConDier": "Hmm okay. Personally, I also like to have a repeat button that repeats a single song. I've programmed my own now.. @suarezkrac I essentially made the repeat button toggle a variable and registered a song change callback to switch back to the previous song if it was activated. I'll post the code later.. @suarezkrac You can find an example solution to this problem here!. @danpastori PlayNow does not call song_change :-/. ",
    "suarezkrac": "@AgentConDier I have the same problem, do you find a solution of the repeat button?. ",
    "coleh33": "I missed adding the live property for the songs object.  This fixed the issue.. Correct.  The original way I was doing it was just stopping the audio if Google returns a pre-roll video.  I would then just play again once the video was done.  However, that counts as two requests to the live stream URL so for analytic purposes it would count as two stream plays.  I then tried to just mute the audio which works on Desktop but on iPhone it appears that simulating a mute won't work.\nMy goal is to somehow either run the Google side first before actually playing the audio or find a way to not trigger two requests to the audio source URL as it will count as two plays in analytics.  Any help on how I can achieve this using the 'before_play hook or another method would be appreciated.  Maybe I am overlooking a more simple approach that will work.\nThanks for helping out on this issue, I really appreciate it.. I'd just like to comment here, normally that is intended as mobile devices don't allow the auto play of media files.  This is because of data restrictions that customers pay for and it would potentially cause them to use a lot of unwanted data.  This is why you don't see the autoplay of videos or audio on mobile devices unless a user has intended to play the element.. ",
    "warlockdn": "?. Hi,\nI installed the library with npm and trying to import the package but I am not able to import it. Since angular is all typescript based I am not sure how I'll access the underlying functions. May be a vue or angular demo will help clear things yes. \nThanks. any demos please ? I am trying to develop something but not able to move forward. So u took almost 5 months to reply the same message u replied the first\nday. Haha\nOn Wed, May 23, 2018, 9:57 PM Dan Pastori notifications@github.com wrote:\n\nYou should be able to use AmplitudeJS inside of any angular component when\nyou import it. I'll release some examples for how to do this\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/521dimensions/amplitudejs/issues/231#issuecomment-391411535,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ADR8XkJvw3jGX3Bl47W_baQFQ-MvXomPks5t1Y3VgaJpZM4RQFmK\n.\n. \n",
    "tevel": "+1. ",
    "ThaoD5": "Indeed, I have multiple playlists with multiple songs in it.\nWhen you say \"You can remove the playlist scoping from the player and it should work.\" you mean, delete the playlists ? Because we absolutely need that in the case we are using amplitudeJS so .. :/\nAlright, don't hesitate to ping me in case you need \n. ",
    "DavidSSchwartz": "would you share with me how you even started using it with react. where do i put the amplitude.init()\nIm also not seeing any buttons . ",
    "chromahoen": "https://521dimensions.com/open-source/amplitudejs/docs#get-song-played-percentage-(version-3-2)\nAmplitude.getSongPlayedPercentage();\nWill give you the percentage.. ",
    "Bagera": "Can't you use Amplitude.getSongByIndex() and then Amplitude.playNow()?. This is intended on Chrome.\nDifferent browsers have different rules. For Chrome you can read up on it here: https://developers.google.com/web/updates/2017/09/autoplay-policy-changes. If you bind an eventlistener to the link you can stop the click from bubbling up with event.stopPropagation();.\nThis will also stop the link from working as intended.\nYou could also filter for the event target and skip the play/pause if it is a link. Same error in FF on Win10. ",
    "wmech16": "I'm looking for a player that also plays .m3u8 for live audio. I have a pretty short deadline so knowing this would help tremendously.. ",
    "innovanets": "Please can you help me with this query, is it possible that the autoplay works on the cell phone?. I'm using it on this website:\nhttp://www.forevermusicradio.com/\nIn the PC the autoplay works very well, but when I load the page in a cell phone I have to touch it and touch it so that the music sounds, it seems that it loads off. But, for example, if I use my web page (an online radio) in mozilla from my cell phone if it works with autoplay, but if I do it with the browser that comes with the cell phone, I have to activate it by giving it play.. ",
    "pardo-bsso": "@robertjg how are you setting up the source?\n. ",
    "ValiantCuriosity": " Thank you for any help you are willing or have the time to offer\n FEATURE REQUESTS: \n1. Documentation Update or Demo that would show how to display a playlist. I understand how to define a playlist in JSON, but how do I call it for the user to see. The Blue Playlist shows the entire JSON list of objects. I would like to display only the keyed playlist. (I hope this makes sense)\n\n2. Documentation written for \"Dummies\". I like design but I am a terrible coder. I need to know little things that aren't in the current documentation. Maybe examples of how to use the callbacks. I'm sort of lost there. As an example, I've worked for several days to try to figure out how to add a setTimeOut between the songs. Nothing I've tried worked, but I did get a For counter Loop to work. Probably very poor solution, but I have no idea how to get it to work with the song_change  callback!\n\n3. I'd love to see a way that my user could input the delay that they would like between the songs. Maybe some kind of an input element that would work with mobile and web.\n\nI'm enjoying working with AmplitudeJS. (Well, mostly... sometimes, I get frustrated with the lack of information out on the net. Stackoverflow has only a couple of posts and now, about half of them are mine. ;-)\n\nI think you are geniuses at coding. I thank you for sharing Amplitude with us all.\n\nBest Regards,\n-Rachel\n\n\n. Oh boy! The only reason I signed up for github was to send you those emails about AmplitudeJS. I want to help, but just read the github documentation on pull requests. At this point, I don’t understand much of it. I will study it and try to do it. I think it will take me a while. I want to help. Amplitude is a nice open source project. I’m not using it for songs, but it works for my use case. \nWish I were better at this stuff. Thanks again for your help.\n-Rachel\n\nOn Apr 13, 2018, at 5:51 AM, Jay Rogers notifications@github.com wrote:\nHi Rachel,\nIf you want to submit a pull request that would be awesome. The documentation site reads from our Github. You can find it under /docs.\nIf not, I will leave this up for @danpastori https://github.com/danpastori's review since he is way better at JavaScript than me 😀\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub https://github.com/521dimensions/amplitudejs/issues/255#issuecomment-381125345, or mute the thread https://github.com/notifications/unsubscribe-auth/AkhlbpouUqrcjBeZwtUa_phk0tU56JH0ks5toJ8-gaJpZM4TSv-S.\n\n\n. Hi beanbag99,\nI'm using the blue_playlist, but I've also worked a lot with the black_playlist. The styles.css file is included in both and is where you might want to look.\nAs an example, the left for img styling in blue_playlist is as follows:\ndiv#amplitude-left img[amplitude-song-info=\"cover_art_url\"]{\n    width: 400px;\n    height: 400px;\n}\nFor my purposes, I changed it to:\ndiv#amplitude-left img[amplitude-song-info=\"cover_art_url\"]{\n    width: .85;\n    height: auto;\n    text-align: center; /*added this css myself*/\n}\nI went through the css line by line and tried to understand it. Then, I \"tweaked\" it to my specifications. It is a tedious process, but doable. The biggest trouble that I have is trying to figure out how to use the callouts at the end of the json file. I'm not very good at javascript and I've been working for days and days trying to get the setTimeout() function/method to add a pause between the songs. \nThe documents and examples for Amplitudejs are very good, but do to my lack of knowledge, I need a more complete explanation with examples of how things are done.\nHTHs, Rachel\n. \n\nOn Jul 14, 2018, at 5:40 PM, Dan Pastori notifications@github.com wrote:\nThat is a bizarre issue.\nHere's a few things I'd check:\nDoes AmplitudeJS look like it's playing, just not sound? If that's the case, then it could be something on their device.\nInitially that’s what I thought too, but it is occurring on three phones. No one else has had any issues. I’ll send emails asking this to the three people who had issues.\nUsing cordova in the past, is there anything that's dependent in your app to configure AmplitudeJS?\nThe dependencies look like this. I don’t think there is anything different here from what you recommend:\n \n Include Resource Javascript NOTE: These are for handling things outside of the scope of AmplitudeJS —>\n <script type=\"text/javascript\" src=\"resources/js/jquery.js\"></script> \n<script type=\"text/javascript\" src=\"resources/js/foundation.min.js\"></script>\n <!-- Include Amplitude JS  \n Include UX functions JS NOTE: These are for handling things outside of the scope of AmplitudeJS —> \n<script type=\"text/javascript\" src=\"js/functions.js\"></script>\n <!-- Include Style Sheet  \n<link rel=\"stylesheet\" type=\"text/css\" href=\"../styles/myStyles_Style.css\"/>  \n\nAre they in areas where they might not have good cell service to load the songs? Possibly compress it to load faster.\nNo issues with this. The sound plays fine in all other apps that they have. I’ve checked everything that I could think of that would be and issue on their phones. \n\nIf the app is in the app store, I could download it and see what I can come up with.\nI could send you the part of the app that is for “Callouts”. The iOS app is for sale ($1.99) so I wouldn’t want you to pay. I don’t have any beta tests going right now. Besides, this is my problem and you are a pro.\nAfter all, you’ve given me and all of us AplitudeJs. It works well for what I’m trying to do (Training). The only issue is that I wish I was a good enough coder to allow people to choose the amount of time to pause between the Callouts. Everyone learns at a different rate so my included audio pauses are not perfect for all people. I used Audacity to record the “Callouts\" and the silence at the end of the audio. I wonder if that could be an issue. \n\nThanks Dan,\nYou’ve been great. Don’t worry too much about this. I suspect i’m doing something wrong. The three people have been pleased with the earbud “fix”. This isn’t a huge seller. Just something I do as a hobby and to give back to a community that helped me out.\n-Rachel\n\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub https://github.com/521dimensions/amplitudejs/issues/275#issuecomment-405059175, or mute the thread https://github.com/notifications/unsubscribe-auth/Akhlbrtb9Vt6GEvu98eGIzXpRy7UJPIzks5uGo-GgaJpZM4VQCF3.\n\n\n. Hi Dan,\nI received feedback about this issue. The songs look like they are playing, but without sound until the earbuds are plugged in. I guess it must be something in the phone settings as you suggested. Wish I could help them out with a better explanation, but they've been happy to be able to use the earbud solution. . Anyone? Please. :-). Wow! Thanks, it works beautifully. I've been updating a different app and haven't gotten a chance to try  out the delay feature. \nIt seems to work perfectly. Now, if I can just get something programmed with it that will allow a user to input the delay time that they need. In my app, each person needs a different amount of time at the end of the audio. Thanks Dan. Amplitude is a wonderful piece of programming.\n-Rachel. OH THANK YOU! The additional ability to let a user program their own delay would be FANTASTIC. \nThis is kind of you to do the work and allow us to use it. \nWith Gratitude,\n-Rachel\n\nOn Aug 17, 2018, at 1:12 PM, Dan Pastori notifications@github.com wrote:\n@ValiantCuriosity https://github.com/ValiantCuriosity Glad it worked! So what I'll do is add a public method to allow for a time to be set through Javascript. This way you can take the user's input and make it work! Thanks for the kind words on Amplitude as well and let us know if you need any other features added!\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub https://github.com/521dimensions/amplitudejs/issues/276#issuecomment-413976087, or mute the thread https://github.com/notifications/unsubscribe-auth/AkhlbusUNzF9WEE4yIQLkhok5Y4Hr_t7ks5uRyOdgaJpZM4VZUua.\n\n\n. ",
    "arunikayadav42": "Hello all I am e beginner in open source and have a basic knowledge of javascript and want to get started with contributing to this project!Can somebody please help me?\n. ",
    "xcrap": "Well, I'm trying to make my own custom solution, right now I have the default Soundcloud embed code but the design it's really cluttered. I've checked coolcastplayer but the design it's also not the best for what I'm looking for, amplitudejs with a little CSS tweak will be perfect. I'll check and see if it will work with a playlist URL and then if it works I'll create the JS to load the HTML data-vars and make the integration. Thanks :). ",
    "diplopito": "You could try Apls, an alternative playlist to Amplitude.js: https://one.8ue.nl/apls/docs  With Apls you can add as many playlists as you need. I'm working on placing it here in GitHub, but I first have to finish a decent player, stay tuned!. Apls minified is 5KB, which you can recover partially or all by not using Json arrays for your playlists nor extra classes for the main controls and playlists.. ",
    "troubleshooter": "I would welcome a development branch, @jaydrogers. . I've fixed it. I've no real knowledge of javascript so perhaps there's a better way. Demo: https://test/gracemenagerie.com/music4.html\nThe function as it currently is in repo:\n```\n    /--------------------------------------------------------------------------\n    Gets all of the songs in a playlist\n        Public Accessor: Amplitude.getSongsInPlaylist( playlist );\n        @param  string  playlist The playlist key\n --------------------------------------------------------------------------/\n    function getSongsInPlaylist(playlist) {\n        var songsArray = [];\n    for (var i = 0; i < _config2.default.playlist[playlist].length; i++) {\n        songsArray.push(_config2.default.songs[i]);\n    }\n\n    return songsArray;\n}\n\nThe fixed function:\nfunction getSongsInPlaylist(playlist) {\n    var songsArray = [];\n\n    for (var i = 0; i < _config2.default.playlists[playlist].length; i++) {\n            var songIndex = _config2.default.playlists[playlist][i];\n        songsArray.push(_config2.default.songs[songIndex]);\n    }\n\n    return songsArray;\n}\n\n```. ",
    "rcasunshare": "I need help, I want to have only the play button and pause, and at the side volume with the function mute and do not mute.\nI can not make the mute function work, if someone wants to give me an example I will be grateful.. The demo that is included in the source code ZIP does not work the mute function in the blue playlist example. I am looking for each time you play, perform a pre-buffer of a few seconds.\nIt would be as an example this player of this radio: http://www.hitwest.com/. Hello, any new features of this function? Can preload audio be done?. \n\nAs of right now, I don't know how to preload after every play pause on a live audio.\n\nI did not know what to use in the code:\n\"live\": true\nI was missing that. Looking in Google I found an answer that you gave to someone else in the same problem. Is the player adapted for use with SSL protocol in streaming URL?. ",
    "Shaiwal": "@danpastori I am trying to stream audio content via NodeJS and MongoDB(GridFS) with amplitude for audio player and I also face similar Problem for chrome and safari while trying to attempt timing scrubbing everytime the Amplitude.setSongPlayedPercentage gets called the player resets and starts from 0. Can you help with this?. @danpastori @carlsmith   I am trying to stream audio content via NodeJS and MongoDB(GridFS) with amplitude for audio player and I also face similar Problem for chrome and safari while trying to attempt timing scrubbing everytime the Amplitude.setSongPlayedPercentage gets called the player resets and starts from 0. Can you help with this?. Thanks @danpastori for replying back, so yes we are streaming but the stream ends, I am using GridFSBucket with node js, something like this , can you please help, I am facing issue while sending the header, even though I tried with header still no luck, the track resets to 00:00. \n. ",
    "ewagstaff": "Thanks for taking a look!. ",
    "eman1986": "any update on this issue? I notice it still happening.. I ran into that issue too once I upgraded to 4 but adding the proper header to my cdn service resolved my issue.. ",
    "danieloi": "Here's how I solved the issue:\nI noticed it had to do with the 'audio context' being 'uninitialized'.\n1) On document load, I  used the public function 'getConfig()' to retrieve the current config of amplitude. \n2) I then access the state property within the context property of the returned config and check if it's value is 'suspended'\n3) if it was, I added a click event listener to the document body with a handler that calls the resume function which is found on the same context object which I attach a then function to where I remove the event listener to make sure I'm not trying to do this over and over again. \nHope this helps! \n~~~~\nimport * as audioPlayer from \"amplitudejs\";\nonDocumentReady() {\nif (audioPlayer.getConfig().context.state === \"suspended\") {\n      document\n        .querySelector(\"body\")\n        .addEventListener(\"click\", initAudioContext);\n    }\n}\nfunction initAudioContext() {\n  audioPlayer\n    .getConfig()\n    .context.resume()\n    .then(() => {\n      document\n        .querySelector(\"body\")\n        .removeEventListener(\"click\", initAudioContext);\n    });\n}\n~~~~\n. I posted a solution on #278 \nCheck it out. ",
    "calnexus": "and how do i get the streaming url from the pls file. Thank you worked like charm. ",
    "tobidsn": "I'am using example \nhttps://521dimensions.com/open-source/amplitudejs/examples/single-song\nWhy space not working on textarea ?. Thanks @danpastori . Thank you very much @danpastori . ",
    "rhldani": "There is no need to de-initialize player in my project but because of a bug i have raised #280 i need to stop its functionality after player stop.. ",
    "epec254": "+1 this would be very useful for me as well. ",
    "will-muir": "Thanks @jaydrogers I appreciate the help. . Hello @danpastori thanks for looking into this! Can you test at this link please:\nhttp://willmuir.ca/single-song/. @danpastori @jaydrogers Thanks for all your help! I was able to get this working. Great plugin!. ",
    "jennykb": "Thanks so much, Dan! I had been loading HTML, but after reading your reply I changed my code to just show and hide the different playlists… which made it easier to put all the tracks in one init. It’s working now, and I’m thrilled.  \n\nOn Oct 19, 2018, at 1:43 PM, Dan Pastori notifications@github.com wrote:\n@jennykb https://github.com/jennykb Thanks for using amplitude and I'm glad you like it! So what's happening is you are running Amplitude.init() each time you load a section of the page. You have a script each time the playlist has been changed that initializes amplitude again. It looks like the players are just hidden on the page through jquery so they should be initialized and ready to go! If you have all the tracks in one init, you should be good to go and won't have to initialize the page each time!\nIf you are loading HTML into the page, you should run Amplitude.bindNewElements(): https://521dimensions.com/open-source/amplitudejs/docs/functions/#bind-new-elements https://521dimensions.com/open-source/amplitudejs/docs/functions/#bind-new-elements. This will bind the new elements on the screen to Amplitude functions without re-initializing amplitudejs. Let me know if that helps!\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub https://github.com/521dimensions/amplitudejs/issues/294#issuecomment-431442070, or mute the thread https://github.com/notifications/unsubscribe-auth/AiIaowzfUgmIlGPbsn5_40_vSpQEhoe5ks5umg85gaJpZM4Xj0tU.\n\n\n. That worked, thank you!\n\nOn Oct 20, 2018, at 5:46 PM, Dan Pastori notifications@github.com wrote:\nHi @jennykb https://github.com/jennykb ! So thanks for pointing this out! This is actually a bug, I don't bind the amplitude-repeat-song elements. I'll have this fixed shortly. In the mean time if you want, you can add the following code:\n$('#repeat').on('click', function(){\nAmplitude.setRepeatSong();\n});\nThis will do the same thing and bind the classes when needed! You will want to add that where you add your Amplitude.init() in the javascript.\nLet me know how that works!\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub https://github.com/521dimensions/amplitudejs/issues/295#issuecomment-431620483, or mute the thread https://github.com/notifications/unsubscribe-auth/AiIao7bivM54Me2NXZ5TLVycm8FAes51ks5um5nHgaJpZM4Xx7ef.\n\n\n. Hmmm. If you take a look at this page, which features some of the same tracks in a different player (not amplitude.js), you’ll hear that the tracks load quite a bit faster than they do on the page with the amplitude player. So I don’t think it’s a hosting issue or an internet connectivity issue. Any other idea why this might be so?\nhttps://www.freescaling.com/F1/AbMajor-all.php https://www.freescaling.com/F1/AbMajor-all.php\n\nOn Nov 28, 2018, at 2:40 PM, Dan Pastori notifications@github.com wrote:\n@jennykb https://github.com/jennykb Amplitude will start playing the song when the browser has enough of the song loaded to play: https://www.w3schools.com/tags/av_event_canplay.asp https://www.w3schools.com/tags/av_event_canplay.asp. If you look at the buffering element in your design you can see that it's playing before the song has been loaded 100%.\nAre you experiencing the slow load on mobile or bad internet connection? It could be something where you host your songs.\nLet me know if that helps!\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub https://github.com/521dimensions/amplitudejs/issues/301#issuecomment-442578143, or mute the thread https://github.com/notifications/unsubscribe-auth/AiIao0o8KGXImMisI8gpqwdwx7aGTum0ks5uzubGgaJpZM4Y3pys.\n\n\n. ",
    "teddiey": "Hey @danpastori tried twith CSP but nothing worked.\nBelow is printed-out debug from my console:\n{version: \"3.3.1\", active_song: audio, active_metadata: {…}, active_album: \"We Are to Answer\", active_index: 0, …}active_album: \"We Are to Answer\"active_index: 0active_metadata: {name: \"RADIO WAUMINI FM\", artist: \"88.3FM LIVE STREAM\", album: \"We Are to Answer\", url: \"http://50.7.99.155:12087/stream/1/\", cover_art_url: \"img/defaultArt.jpg\", …}active_playlist: \"\"active_song: audioautoplay: falsebindings: {}buffered: 0callbacks: {}continue_next: truedebug: truedefault_album_art: \"\"delay: 0handle_song_elements: trueis_touch_moving: falseplayback_speed: 1playlists: {}pre_mute_volume: 0.5repeat: falserepeat_song: falserepeat_statuses: {}shuffle_active_index: 0shuffle_list: {}shuffle_on: falseshuffled_active_indexes: {}shuffled_playlists: {}shuffled_statuses: {}songs: [{…}]soundcloud_client: \"\"soundcloud_song_count: 0soundcloud_songs_ready: 0soundcloud_use_art: \"\"start_song: \"\"starting_playlist: \"\"starting_playlist_song: \"\"version: \"3.3.1\"volume: 50volume_decrement: 5volume_increment: 5__proto__: Object\n(index):1 Mixed Content: The page at 'https://mcathosmart.com/mcatho/radio/' was loaded over HTTPS, but requested an insecure audio file 'http://50.7.99.155:12087/stream/1/'. This content should also be served over HTTPS.\n. Hi @danpastori I managed to have a look at your HTML, but I'm just wondering is there any way that this can be automated in such a way that I don't have to type all that HTML :(\nI have a playlist of over 1,000 songs. ",
    "lupett": "Thanks @danpastori\nThen is not possible to get song duration dynamically in page load for put it in Duration Time span?\nRegards. ",
    "JocelynDelalande": "Feel free to fix that too :). ",
    "glvr": "Thanks, Dan.\nOn further checking, I think there might be an issue with my stream - so I'll explore further and update.\nI noticed the issue when recently upgrading my Mac and iPhone - although things were ok on the older ones, the issue appears on the new ones... but since originally posting, a quick test I did with a stream from elsewhere seems fine.. Hi Dan...\nI'm sorry, I'd forgotten about this thread.\n(I'm not making excuses, but am dealing with health issues.)\nI did get it sorted... my provider advises the issue was due to the version of Icecast requiring update.\n\nOn 2 Jan 2019, at 16:25, Dan Pastori notifications@github.com wrote:\n@glvr Did you find out if it was an issue with the stream?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub, or mute the thread.\n. Thanks.\n:-)\nOn 2 Jan 2019, at 16:52, Dan Pastori notifications@github.com wrote:\n@glvr No problem, I hope you get better!\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub, or mute the thread.\n. \n",
    "deendoughouz": "Found it, using: Amplitude.audio().currentTime. ",
    "joshawnard": "+1 True for me as well.  On 3.3.1.. ",
    "coliff": "thanks for the reply @danpastori - i opened this issue shortly after starting to use Amplitude but since learnt that its easy to add a custom download icon, so I'll close this issue. :-) I have some other PRs/issues to open though.. ",
    "enthuzy": "This is probably too much headache for everyone! I'll just host songs on my server and process the waveform . \n        Hi Ed,I'm no longer getting the console errors, but the second song in the list with \"OG\" still returns \"undefined\" in the player. It returns the title, graphic, and mp3, just fine. I thought that was a symptom of the error. Ive tried changing the artist name with no avail.🤷‍♂️---- On Thu, 17 Jan 2019 20:11:42 -0800  Ed Lomonaco<notifications@github.com> wrote ----I ran into that issue too once I upgraded to 4 but adding the proper header to my cdn service resolved my issue.  —You are receiving this because you authored the thread.Reply to this email directly, view it on GitHub, or mute the thread.\n\nThis email and any files transmitted with it are confidential and intended solely for the use of the individual or entity to whom they are addressed. If you have received this email in error please notify the sender.. ",
    "AhmedHassanEldesoky": "Anyone can help me, please.. ",
    "musikprylar": "I have the same problem as you. My temp solution was to download v3.3.1 which works just fine. @danpastori thanks for the quick reply. I'm super noob so happy with the roll-back in my case. Sincerely, musikprylar.. ",
    "rajdeepbharati": "@danpastori I'm trying to implement a basic music player (it need not have autoplay). And I didn't get what you meant by 'web audio context'. Could you please explain?. ",
    "postonthehill": "I'm in the same boat. Just using the 'Building a Single Song Player' tutorial on ServerSideUp and getting this error using the provided code there. I can get the player to play by triggering my Amplitude.init on ANY user interaction, but setting it up within my document.ready() shows this error and won't play any audio.\nTo be clear, I am not calling play() and don't want any autoplay. Just trying to get the example to work without errors. Any idea for best way to fix?. > On ios safari & ios firefox the audio file loads and progress bar shows it as playing however no sound is emitted.\n\nSent with GitHawk\n\nI can second this. 'Seeing' playback on Safari, not 'hearing' anything.. ",
    "MrSnowman": "I'm having the same issue. This constructor triggers the suspend state in chrome and the library doesn't handle it.\nI've just made a hacky change to the play() function, adding\nif (window.AudioContext && _config2.default.context.state == \"suspended\") {\n    _config2.default.context.resume()\n}\nright on that line. \nAnother temporary solution for those just wishing to run examples would be to use Firefox.\nI would prefer if the library handled a suspended audiocontext for me (as an option at least). I don't feel requiring the library user to add an event listener to every any play action in the app like the chrome documentation suggests is very friendly design.\nI think it's more appropriate to catch the promise from the audio.play() call and handle potential errors in there. I will probably do that in my own code.. ",
    "artshostak": "Same issue — even when explicitly setting \"autoplay\" to false.. ",
    "emcog": "I'm facing very similar problems here\nAm fairly newb. Have built a player based on \"blueplaylist\" example. \nOn OSX:\n• Works on firefox\n• Chrome returns \"The AudioContext was not allowed to start. It must be resumed (or created) after a user gesture on the page\"\n• Safari goes bonkers.\nmeditations.mindfulnessconnected.com. This error continues when the \"control container\" is removed and tracks are \"played\" (or not!) via Amplitude.playSongAtIndex which leaves me wondering if it is problem when amplitude is initialised.. @MrSnowman have you built a workaround you could share/talk through?. On ios safari & ios firefox the audio file loads and progress bar progresses as though playing, however no sound is emitted. \nSent with GitHawk. ",
    "faten257": "I have the same problem on chrome\namplitude.js:10096 The AudioContext was not allowed to start. It must be resumed (or created) after a user gesture on the page. https://goo.gl/7K7WLu\nwindow.onload @ amplitude.js:10096\nload (async)\nwebAudioAPIAvailable @ amplitude.js:10095\ninitialize @ amplitude.js:4681\ninit @ amplitude.js:10296\n(anonymous) @ audio?category=2\nj @ jquery.min.js:2\nfireWith @ jquery.min.js:2\nready @ jquery.min.js:2\nJ @ jquery.min.js:2\namplitude.js:1380 Uncaught (in promise) DOMException\nchangeSong @ amplitude.js:1380\nhandleSongPlayPause @ amplitude.js:8219 \nhandle @ amplitude.js:8094\nUncaught (in promise) DOMException\nHow can I solve it, please?. ",
    "frozendten": "\n@frozendten You will have to include the library in your WP theme through wp_include_script(). You will then have to make your elements either in the code editor or theme itself.\n\nI'm still confused :'( , can I get the tutorial? it will be very helpful :D. ",
    "NesteA88": "Good day!\nI want to install a player with a playlist.\nWhat do your words mean: \"it is Necessary to mark the player on the page to make it appear\"?\nFrom the archive that I download from GitHub, I only need the file \" amplitude.js\" or any other files and folders need to be added to the site?. Good day! \nI have created the page you are trying to add player - https://armymusic.ru/pesni-pro-pv.html. \nAt this point it should be player - http://prnt.sc/mli34d. \nIt still does not appear. Something else needs to be added, but I don't know what it is.. Dan, good day!\nI have already understood that it is necessary to add HTML-construction. But I can't figure out what she's supposed to look like! Can you use at least one song as an example to show what the HTML code will look like?. Yes! Thank you!. "
}