{
    "vancura": "Actually now I see I used tabs instead of spaces, I hope it's not a problem, and it could be easily fixed :]\n. Actually now I see I used tabs instead of spaces, I hope it's not a problem, and it could be easily fixed :]\n. ",
    "adamdbradley": "Added CSS classnames to the debugger  elements, good thinkin\n. I've just added a demo which may help. It's using existing media queries to dictate which static file to request. This isn't an issue for dynamically resized images because they fill the exact width needed, but with static images its much more difficult to responsively scale to available width.\nStatic Responsive Image using Media Queries\nThis demo is really only showing an option with how it could work with media queries, but I'd prefer to still come up with a way to organize the variants better. Image-set() is great for organizing variants by device pixel ratio and bandwidth requirements, but still needs work for static images which are responsive to their available width.\nI like the events you added to the images and will add that in on my next commit. I'd prefer to keep exploring ways to group image variants by device pixel ratio, bandwidth requirement, and min/max width within the same CSS rule instead of media queries. Maybe we add another optional parameter to the image-set variants?? Thoughts?\n. > I added some logic to make it prevent duplicates, I figure that should make parsing the CSS rules for pages with lots of images more efficient and easier to debug.\nThanks, any improvements are welcomed. I'll work to bring in the code.\n\nI think I didn't want to add to the image-set purpose because I saw it as a way of handling URL patterns, but for me I only have 1 url pattern so it doesn't make sense to create more as the url would always be the same.\n...\n I can see in other use cases that you would want to specify the min/max width on the image-set if you had static files and you wanted it to switch from requesting file1x.png to file2x.png when the size got over say 200px, so perhaps it would make sense to add that as an option there two.\n\nExcellent points. This is a good question, should we leaving image-set() alone and use media queries to decide different breakpoints for static images? Or should the breakpoints live within image-set(). I'm torn on this because media queries already exist and people already understand them. Additionally image-set() already has plenty of complexities already, so adding to it won't help any. But on the other hand, image-set() centralizes each of the image variants and url patterns into one location, and spreading it across CSS may make maintenance more difficult. As more demos are built it may help answer this big question.\n\nThe big problem I have with static requests currently is that I don't know the pixel width of these images at request time on the server and thus can't set the data-width and data-height to any real numbers.\n\nThis is a large problem that many others will have too. My initial thought is load the image into the DOM (but keep it hidden) then do some JS magic to figure out the width/height. But all of a sudden the whole idea of 1 request per image is wasted. So at the moment this is a good issue to solve.\n\nThe other problem with using width as a percentage is that it doesn't seem to recalculate properly on resize and just uses the same size image but stretches it.\n\nYes this requires a fix, my most recent demo for Static Responsive Images using Media Queries pointed that out. What needs to change is after each resize foresight.js should get the image-set values again (from the font-family property because a new value would be assigned by the active media query) and recalculate. Currently it only gets the image-set values on the initial load, so any changes via media queries foresight.js does not know about. I'll log an issue.\nThanks for all the feedback and contributing to the project!\n. closing pull request but will reopen issues for each point discussed.\n. I put a try/catch within the triggerImageEvent just to prevent the errors which IE8 was having. Would you be able to take a look at your triggerImageEvent function and make sure its works with IE?\n. Would you be able to also update the readme file with an explaination of the new features?\n. It looks good. My only concern is to keep the js as small as possible. So if you see any useless code, or code which could be more efficient, please feel free to make any changes to help shrink its size. Thanks for your help!\n. Sorry, I didn't notice until now that I closed it without merging. Sorry about that, I just merged in your latest pull request.\n. Yes, uglify is what I've been using too. I'll make the update quick.\n. Sorry this took so long to merge. Would you be able to whip together an explanation for the readme info?\n. Missing the point of the images. They're that size for a reason.\n. Added CSS classnames to the debugger  elements, good thinkin\n. I've just added a demo which may help. It's using existing media queries to dictate which static file to request. This isn't an issue for dynamically resized images because they fill the exact width needed, but with static images its much more difficult to responsively scale to available width.\nStatic Responsive Image using Media Queries\nThis demo is really only showing an option with how it could work with media queries, but I'd prefer to still come up with a way to organize the variants better. Image-set() is great for organizing variants by device pixel ratio and bandwidth requirements, but still needs work for static images which are responsive to their available width.\nI like the events you added to the images and will add that in on my next commit. I'd prefer to keep exploring ways to group image variants by device pixel ratio, bandwidth requirement, and min/max width within the same CSS rule instead of media queries. Maybe we add another optional parameter to the image-set variants?? Thoughts?\n. > I added some logic to make it prevent duplicates, I figure that should make parsing the CSS rules for pages with lots of images more efficient and easier to debug.\nThanks, any improvements are welcomed. I'll work to bring in the code.\n\nI think I didn't want to add to the image-set purpose because I saw it as a way of handling URL patterns, but for me I only have 1 url pattern so it doesn't make sense to create more as the url would always be the same.\n...\n I can see in other use cases that you would want to specify the min/max width on the image-set if you had static files and you wanted it to switch from requesting file1x.png to file2x.png when the size got over say 200px, so perhaps it would make sense to add that as an option there two.\n\nExcellent points. This is a good question, should we leaving image-set() alone and use media queries to decide different breakpoints for static images? Or should the breakpoints live within image-set(). I'm torn on this because media queries already exist and people already understand them. Additionally image-set() already has plenty of complexities already, so adding to it won't help any. But on the other hand, image-set() centralizes each of the image variants and url patterns into one location, and spreading it across CSS may make maintenance more difficult. As more demos are built it may help answer this big question.\n\nThe big problem I have with static requests currently is that I don't know the pixel width of these images at request time on the server and thus can't set the data-width and data-height to any real numbers.\n\nThis is a large problem that many others will have too. My initial thought is load the image into the DOM (but keep it hidden) then do some JS magic to figure out the width/height. But all of a sudden the whole idea of 1 request per image is wasted. So at the moment this is a good issue to solve.\n\nThe other problem with using width as a percentage is that it doesn't seem to recalculate properly on resize and just uses the same size image but stretches it.\n\nYes this requires a fix, my most recent demo for Static Responsive Images using Media Queries pointed that out. What needs to change is after each resize foresight.js should get the image-set values again (from the font-family property because a new value would be assigned by the active media query) and recalculate. Currently it only gets the image-set values on the initial load, so any changes via media queries foresight.js does not know about. I'll log an issue.\nThanks for all the feedback and contributing to the project!\n. closing pull request but will reopen issues for each point discussed.\n. I put a try/catch within the triggerImageEvent just to prevent the errors which IE8 was having. Would you be able to take a look at your triggerImageEvent function and make sure its works with IE?\n. Would you be able to also update the readme file with an explaination of the new features?\n. It looks good. My only concern is to keep the js as small as possible. So if you see any useless code, or code which could be more efficient, please feel free to make any changes to help shrink its size. Thanks for your help!\n. Sorry, I didn't notice until now that I closed it without merging. Sorry about that, I just merged in your latest pull request.\n. Yes, uglify is what I've been using too. I'll make the update quick.\n. Sorry this took so long to merge. Would you be able to whip together an explanation for the readme info?\n. Missing the point of the images. They're that size for a reason.\n. ",
    "thadcodes": "Hi Adam,\nThanks for the quick response.\nFirst off I think I forgot about one other change I made when I was working\non my other changes.  It seems the code as it existed would generate the\nsame CSS classes for dimensionCssRules over and over without checking to\nsee if they already existed.  I added some logic to make it prevent\nduplicates, I figure that should make parsing the CSS rules for pages with\nlots of images more efficient and easier to debug.  This was again not\nsomething I ended up needing but just something I noticed.\nI think I didn't want to add to the image-set purpose because I saw it as a\nway of handling URL patterns, but for me I only have 1 url pattern so it\ndoesn't make sense to create more as the url would always be the same.  My\npattern is always \"/image/{requestWidth}w/{requestHeight}h/{imageName}\".  I\nhave it drop the requestHeight for this usage because I don't want to\nchange the aspect ratio and the resizing servlet handles that if you leave\nit as just \"h\".  I can see in other use cases that you would want to\nspecify the min/max width on the image-set if you had static files and you\nwanted it to switch from requesting file1x.png to file2x.png when the size\ngot over say 200px, so perhaps it would make sense to add that as an option\nthere two.\nSince the browser will not size the element based on the image-set (and I\ndon't think it should really) it makes sense to have a fallback I think to\nwhatever is in the max-width and assume that is still styling it.\nThe big problem I have with static requests currently is that I don't know\nthe pixel width of these images at request time on the server and thus\ncan't set the data-width and data-height to any real numbers.  Even getting\nthe aspect ratio is annoying on the server side and I'd prefer to leave\nthat to the resizing servlet if possible.\nThe other problem with using width as a percentage is that it doesn't seem\nto recalculate properly on resize and just uses the same size image but\nstretches it.  The percentage value gets returned as a pixel value from\ngetCalculatedStyleValue and so it never changes.\nSince I'm only doing a mobile site it doesn't bother me on that front\ndirectly but this means if I rotate the device it will not request the\nhigher resolution image that I would want.  I don't know a way to do it\nwith width as a percentage in css currently because it makes the value a\nfixed pixel.  Perhaps we could allow you to specify \"percentage\" or\n\"dynamic\" as the value in data-width/data-height to cause it to recalculate\nwidth based on computed width pixels every time the resize happens and not\ntreat it as a fixed pixel size.\nYou have any other thoughts on how to support a case where you don't know\nwhat size the image needs to be or what the aspect ratio will be when\ngenerating the HTML?\nThanks,\nThad\nOn Mon, Apr 16, 2012 at 11:57 PM, Adam Bradley <\nreply@reply.github.com\n\nwrote:\nI've just added a demo which may help. It's using existing media queries\nto dictate which static file to request. This isn't an issue for\ndynamically resized images because they fill the exact width needed, but\nwith static images its much more difficult to responsively scale to\navailable width.\nStatic Responsive Image using Media Queries\nThis demo is really only showing an option with how it could work with\nmedia queries, but I'd prefer to still come up with a way to organize the\nvariants better. Image-set() is great for organizing variants by device\npixel ratio and bandwidth requirements, but still needs work for static\nimages which are responsive to their available width.\nI like the events you added to the images and will add that in on my next\ncommit. I'd prefer to keep exploring ways to group image variants by device\npixel ratio, bandwidth requirement, and min/max width within the same CSS\nrule instead of media queries. Maybe we add another optional parameter to\nthe image-set variants?? Thoughts?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/9#issuecomment-5167907\n. On Tue, Apr 17, 2012 at 10:05 AM, Adam Bradley <\nreply@reply.github.com\nwrote:\n\nI added some logic to make it prevent duplicates, I figure that should\nmake parsing the CSS rules for pages with lots of images more efficient and\neasier to debug.\n\nThanks, any improvements are welcomed. I'll work to bring in the code.\n\nI think I didn't want to add to the image-set purpose because I saw it\nas a way of handling URL patterns, but for me I only have 1 url pattern so\nit doesn't make sense to create more as the url would always be the same.\n...\n I can see in other use cases that you would want to specify the min/max\nwidth on the image-set if you had static files and you wanted it to switch\nfrom requesting file1x.png to file2x.png when the size got over say 200px,\nso perhaps it would make sense to add that as an option there two.\n\nExcellent points. This is a good question, should we leaving image-set()\nalone and use media queries to decide different breakpoints for static\nimages? Or should the breakpoints live within image-set(). I'm torn on this\nbecause media queries already exist and people already understand them.\nAdditionally image-set() already has plenty of complexities already, so\nadding to it won't help any. But on the other hand, image-set() centralizes\neach of the image variants and url patterns into one location, and\nspreading it across CSS may make maintenance more difficult. As more demos\nare built it may help answer this big question.\n\nPerhaps the solution is to allow image-set assigned breakpoints to exist\nand take priority but have it fallback to the other CSS properties for\nguidance if image-set doesn't specify?\n\n\nThe big problem I have with static requests currently is that I don't\nknow the pixel width of these images at request time on the server and thus\ncan't set the data-width and data-height to any real numbers.\n\nThis is a large problem that many others will have too. My initial thought\nis load the image into the DOM (but keep it hidden) then do some JS magic\nto figure out the width/height. But all of a sudden the whole idea of 1\nrequest per image is wasted. So at the moment this is a good issue to solve.\n\nYeah the double request would be a problem.  My thinking is that unless the\npoint is to have it size whatever natural size the image is the developer\nwill specify via CSS a width (or max/min width) that should have some to\ntell the browser how wide they want it (% or px).  It seems to me that\nabsent any info in the image-set or on the element that would be the only\nplace left to look.  I went for max-width because since I don't know the\naspect ratio I just request the max width that would fit in the slot and\nfigure it will resize down on the browser if the img is too tall.\n\n\nThe other problem with using width as a percentage is that it doesn't\nseem to recalculate properly on resize and just uses the same size image\nbut stretches it.\n\nYes this requires a fix, my most recent demo for Static Responsive Images\nusing Media Queries\npointed that out. What needs to change is after each resize foresight.js\nshould get the image-set values again (from the font-family property\nbecause a new value would be assigned by the active media query) and\nrecalculate. Currently it only gets the image-set values on the initial\nload, so any changes via media queries foresight.js does not know about.\nI'll log an issue.\n\nIf you don't have time to work on that now I could take a stab at it.  I\nalready worked a bunch with the loading code so it's on my mind anyway.\n But I wouldn't want to do something you were already working on so I can\nhold off if you would rather do it.  (I'd reset my fork before I did it so\nit would be easy to import without the other stuff I already did)\nThanks for all the feedback and contributing to the project!\n\nNo problem, thanks for getting all this stuff working, best solution out\nthere and fun to watch it re-request images as I resize the browser ;)\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/9#issuecomment-5175742\n. Sorry about that Adam.  I've been out of town this weekend but I'll get\ninto this sometime today if I can.\n\nOn Fri, Apr 27, 2012 at 7:30 PM, Adam Bradley <\nreply@reply.github.com\n\nwrote:\nI put a try/catch within the triggerImageEvent just to prevent the errors\nwhich IE8 was having. Would you be able to take a look at your\ntriggerImageEvent function and make sure its works with IE?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/13#issuecomment-5392509\n. It appears that IE8 will not allow custom events.  The only way to support it is through a hack of using a standard event and passing custom properties on the event object http://stackoverflow.com/questions/2028456/how-to-fire-personal-event-in-javascript.  The other option is to add a framework and start using their event model but that would increase the required weight.  I suggest for the time being that the events are IE9+ support only.  I'll commit code to make sure browsers that don't support custom events don't try to execute them shortly.\n. Sure, Just wanted to see your opinion of it before I spent that time,\ndidn't want to do it if it wasn't included\n\nOn Thu, Apr 26, 2012 at 4:01 PM, Adam Bradley <\nreply@reply.github.com\n\nwrote:\nWould you be able to also update the readme file with an explaination of\nthe new features?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/18#issuecomment-5366358\n. I'll see if I can take a look.  Thanks for including my changes, will really help me to stay on the master branch for my current project.  I'll certainly keep contributing as I can.\n. Also note that I couldn't seem to get the test commit out of for some reason, sorry if there is no way for you to avoid it in the pull request too.  It was simply to make sure that Ray was able to push to my branch.\n. Not sure why you closed this issue but on the off chance that you closed it without merging it because it was too confusing I created a more simple pull request off a different fork for Pull Request #25.\n. No problem the newer pull request is a better commit set anyway.  Learned some new things about git on this one.\n\nI just realized I forgot commit an update to the min version.  I can do it and make a pull request if that is easier or if it's easier for you to just do it directly then I can merge whatever you do into our fork to keep them in line.  Just let me know.\nAlso, do you have a way that you have been compressing it that you prefer?  I used uglifyjs (http://marijnhaverbeke.nl/uglifyjs) for our local project just now and it seemed to do a better job to me then the google closure tools.  Figure it's best to keep the minify tool consistent so I can remember to do it when I do the pull requests in the future.  \nThanks again for making this library, it's great!\n. great, thanks!\n. @adamdbradley  Sorry I messed up and just realized I didn't do a minify of the last change I put in this pull request (added at the end while testing).  If you would like I could do another pull request but I remember you feeling it was easier for you to just do it yourself.\n. Hi Adam,\nThanks for the quick response.\nFirst off I think I forgot about one other change I made when I was working\non my other changes.  It seems the code as it existed would generate the\nsame CSS classes for dimensionCssRules over and over without checking to\nsee if they already existed.  I added some logic to make it prevent\nduplicates, I figure that should make parsing the CSS rules for pages with\nlots of images more efficient and easier to debug.  This was again not\nsomething I ended up needing but just something I noticed.\nI think I didn't want to add to the image-set purpose because I saw it as a\nway of handling URL patterns, but for me I only have 1 url pattern so it\ndoesn't make sense to create more as the url would always be the same.  My\npattern is always \"/image/{requestWidth}w/{requestHeight}h/{imageName}\".  I\nhave it drop the requestHeight for this usage because I don't want to\nchange the aspect ratio and the resizing servlet handles that if you leave\nit as just \"h\".  I can see in other use cases that you would want to\nspecify the min/max width on the image-set if you had static files and you\nwanted it to switch from requesting file1x.png to file2x.png when the size\ngot over say 200px, so perhaps it would make sense to add that as an option\nthere two.\nSince the browser will not size the element based on the image-set (and I\ndon't think it should really) it makes sense to have a fallback I think to\nwhatever is in the max-width and assume that is still styling it.\nThe big problem I have with static requests currently is that I don't know\nthe pixel width of these images at request time on the server and thus\ncan't set the data-width and data-height to any real numbers.  Even getting\nthe aspect ratio is annoying on the server side and I'd prefer to leave\nthat to the resizing servlet if possible.\nThe other problem with using width as a percentage is that it doesn't seem\nto recalculate properly on resize and just uses the same size image but\nstretches it.  The percentage value gets returned as a pixel value from\ngetCalculatedStyleValue and so it never changes.\nSince I'm only doing a mobile site it doesn't bother me on that front\ndirectly but this means if I rotate the device it will not request the\nhigher resolution image that I would want.  I don't know a way to do it\nwith width as a percentage in css currently because it makes the value a\nfixed pixel.  Perhaps we could allow you to specify \"percentage\" or\n\"dynamic\" as the value in data-width/data-height to cause it to recalculate\nwidth based on computed width pixels every time the resize happens and not\ntreat it as a fixed pixel size.\nYou have any other thoughts on how to support a case where you don't know\nwhat size the image needs to be or what the aspect ratio will be when\ngenerating the HTML?\nThanks,\nThad\nOn Mon, Apr 16, 2012 at 11:57 PM, Adam Bradley <\nreply@reply.github.com\n\nwrote:\nI've just added a demo which may help. It's using existing media queries\nto dictate which static file to request. This isn't an issue for\ndynamically resized images because they fill the exact width needed, but\nwith static images its much more difficult to responsively scale to\navailable width.\nStatic Responsive Image using Media Queries\nThis demo is really only showing an option with how it could work with\nmedia queries, but I'd prefer to still come up with a way to organize the\nvariants better. Image-set() is great for organizing variants by device\npixel ratio and bandwidth requirements, but still needs work for static\nimages which are responsive to their available width.\nI like the events you added to the images and will add that in on my next\ncommit. I'd prefer to keep exploring ways to group image variants by device\npixel ratio, bandwidth requirement, and min/max width within the same CSS\nrule instead of media queries. Maybe we add another optional parameter to\nthe image-set variants?? Thoughts?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/9#issuecomment-5167907\n. On Tue, Apr 17, 2012 at 10:05 AM, Adam Bradley <\nreply@reply.github.com\nwrote:\n\nI added some logic to make it prevent duplicates, I figure that should\nmake parsing the CSS rules for pages with lots of images more efficient and\neasier to debug.\n\nThanks, any improvements are welcomed. I'll work to bring in the code.\n\nI think I didn't want to add to the image-set purpose because I saw it\nas a way of handling URL patterns, but for me I only have 1 url pattern so\nit doesn't make sense to create more as the url would always be the same.\n...\n I can see in other use cases that you would want to specify the min/max\nwidth on the image-set if you had static files and you wanted it to switch\nfrom requesting file1x.png to file2x.png when the size got over say 200px,\nso perhaps it would make sense to add that as an option there two.\n\nExcellent points. This is a good question, should we leaving image-set()\nalone and use media queries to decide different breakpoints for static\nimages? Or should the breakpoints live within image-set(). I'm torn on this\nbecause media queries already exist and people already understand them.\nAdditionally image-set() already has plenty of complexities already, so\nadding to it won't help any. But on the other hand, image-set() centralizes\neach of the image variants and url patterns into one location, and\nspreading it across CSS may make maintenance more difficult. As more demos\nare built it may help answer this big question.\n\nPerhaps the solution is to allow image-set assigned breakpoints to exist\nand take priority but have it fallback to the other CSS properties for\nguidance if image-set doesn't specify?\n\n\nThe big problem I have with static requests currently is that I don't\nknow the pixel width of these images at request time on the server and thus\ncan't set the data-width and data-height to any real numbers.\n\nThis is a large problem that many others will have too. My initial thought\nis load the image into the DOM (but keep it hidden) then do some JS magic\nto figure out the width/height. But all of a sudden the whole idea of 1\nrequest per image is wasted. So at the moment this is a good issue to solve.\n\nYeah the double request would be a problem.  My thinking is that unless the\npoint is to have it size whatever natural size the image is the developer\nwill specify via CSS a width (or max/min width) that should have some to\ntell the browser how wide they want it (% or px).  It seems to me that\nabsent any info in the image-set or on the element that would be the only\nplace left to look.  I went for max-width because since I don't know the\naspect ratio I just request the max width that would fit in the slot and\nfigure it will resize down on the browser if the img is too tall.\n\n\nThe other problem with using width as a percentage is that it doesn't\nseem to recalculate properly on resize and just uses the same size image\nbut stretches it.\n\nYes this requires a fix, my most recent demo for Static Responsive Images\nusing Media Queries\npointed that out. What needs to change is after each resize foresight.js\nshould get the image-set values again (from the font-family property\nbecause a new value would be assigned by the active media query) and\nrecalculate. Currently it only gets the image-set values on the initial\nload, so any changes via media queries foresight.js does not know about.\nI'll log an issue.\n\nIf you don't have time to work on that now I could take a stab at it.  I\nalready worked a bunch with the loading code so it's on my mind anyway.\n But I wouldn't want to do something you were already working on so I can\nhold off if you would rather do it.  (I'd reset my fork before I did it so\nit would be easy to import without the other stuff I already did)\nThanks for all the feedback and contributing to the project!\n\nNo problem, thanks for getting all this stuff working, best solution out\nthere and fun to watch it re-request images as I resize the browser ;)\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/9#issuecomment-5175742\n. Sorry about that Adam.  I've been out of town this weekend but I'll get\ninto this sometime today if I can.\n\nOn Fri, Apr 27, 2012 at 7:30 PM, Adam Bradley <\nreply@reply.github.com\n\nwrote:\nI put a try/catch within the triggerImageEvent just to prevent the errors\nwhich IE8 was having. Would you be able to take a look at your\ntriggerImageEvent function and make sure its works with IE?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/13#issuecomment-5392509\n. It appears that IE8 will not allow custom events.  The only way to support it is through a hack of using a standard event and passing custom properties on the event object http://stackoverflow.com/questions/2028456/how-to-fire-personal-event-in-javascript.  The other option is to add a framework and start using their event model but that would increase the required weight.  I suggest for the time being that the events are IE9+ support only.  I'll commit code to make sure browsers that don't support custom events don't try to execute them shortly.\n. Sure, Just wanted to see your opinion of it before I spent that time,\ndidn't want to do it if it wasn't included\n\nOn Thu, Apr 26, 2012 at 4:01 PM, Adam Bradley <\nreply@reply.github.com\n\nwrote:\nWould you be able to also update the readme file with an explaination of\nthe new features?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamdbradley/foresight.js/pull/18#issuecomment-5366358\n. I'll see if I can take a look.  Thanks for including my changes, will really help me to stay on the master branch for my current project.  I'll certainly keep contributing as I can.\n. Also note that I couldn't seem to get the test commit out of for some reason, sorry if there is no way for you to avoid it in the pull request too.  It was simply to make sure that Ray was able to push to my branch.\n. Not sure why you closed this issue but on the off chance that you closed it without merging it because it was too confusing I created a more simple pull request off a different fork for Pull Request #25.\n. No problem the newer pull request is a better commit set anyway.  Learned some new things about git on this one.\n\nI just realized I forgot commit an update to the min version.  I can do it and make a pull request if that is easier or if it's easier for you to just do it directly then I can merge whatever you do into our fork to keep them in line.  Just let me know.\nAlso, do you have a way that you have been compressing it that you prefer?  I used uglifyjs (http://marijnhaverbeke.nl/uglifyjs) for our local project just now and it seemed to do a better job to me then the google closure tools.  Figure it's best to keep the minify tool consistent so I can remember to do it when I do the pull requests in the future.  \nThanks again for making this library, it's great!\n. great, thanks!\n. @adamdbradley  Sorry I messed up and just realized I didn't do a minify of the last change I put in this pull request (added at the end while testing).  If you would like I could do another pull request but I remember you feeling it was easier for you to just do it yourself.\n. "
}