{
    "adamzap": "I applied Particules' commit and this works now.\nhttp://github.com/adamzap/html5-slides-markdown/commit/5cb9fe11f0c273fc690d88d73fde4d4770c1e81f\nThanks\n. Yeah, that would be a great feature. I'll start looking into it.\n. Merged n1k0's branch. I might try to weak the print stylesheet to look more like the slides, but this totally works with princexml.\nThanks!\n. n1k0 implemented this himself.\nThanks!!\n. I applied n1k0's changes and this now works.\nThanks!!\n. Do you mean a table of contents slide with a link to each slide? That could be nice...\n. I like the ToC feature alot, but I am seeing some bugginess when I render the README.md as a presentation and click on the last slide link in the ToC. Theres some weird rendering on the right of the AUTHORS slide.\nI can look at the problem if it's not something obvious to you, n1k0.\n. this works now. many thanks to n1k0.\n. It looks like that's causing problems with the php code sample as well.\nI'm looking into it.\n. I'm working on a solution...I'm going to use a multiline regex to get all the code blocks and highlight and replace them one at a time. It should work.\n. Fixed and pushed.\nI just leveled up in regex.\n. That'd be great, but the javascript implementation of markdown is called showdown\n. I believe I'm going to call it either Landslide or Represent. I'm leaning toward Landslide. Any objections? Going to pypi before the end of the week, I believe.\n. Landslide it is\n. Done and merged. Feedback is encouraged.\n. I was thinking we should keep it black and white for printing. The code is still highlighted though.\nIs the use case printing or just having a PDF of the presentation?\n. It might be this logic...but it works for me.\nI'll try it on a few machines.\ntry:\n    from landslide.generator import Generator\nexcept ImportError:\n    from generator import Generator\nI thought this would work for both working with a checkout and an pip install...\n. n1k0, it works fine for me on an ubuntu machine that's never seen a recent version of our code. I used pip.\n. Hmm ok. Thanks for doing that. It should also be installing markdown, jinja2, and pygments as requirements...\nI'll keep investigating.\n. I think I'm confusing setuptools and distutils...this is my first time to make a python package\n. First i have no landslide installed, then i install it, then it works...\nThis is on my macbook. \n```\n○ python\nPython 2.6.5 (r265:79063, May 17 2010, 13:48:52) \n[GCC 4.2.1 (Apple Inc. build 5664)] on darwin\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\n\n\n\nimport landslide\nTraceback (most recent call last):\n  File \"\", line 1, in \nImportError: No module named landslide\nfrom landslide.generator import Generator\nTraceback (most recent call last):\n  File \"\", line 1, in \nImportError: No module named landslide.generator\n○ sudo pip install landslide\nDownloading/unpacking landslide\n  Downloading landslide-0.4.0.tar.gz (51Kb): 51Kb downloaded\n  Running setup.py egg_info for package landslide\nInstalling collected packages: landslide\n  Running setup.py install for landslide\n    changing mode of build/scripts-2.6/landslide from 644 to 755\n    changing mode of /opt/local/Library/Frameworks/Python.framework/Versions/2.6/bin/landslide to 755\nSuccessfully installed landslide\nCleaning up...\n○ python\nPython 2.6.5 (r265:79063, May 17 2010, 13:48:52) \n[GCC 4.2.1 (Apple Inc. build 5664)] on darwin\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\nimport landslide\n○ python\nPython 2.6.5 (r265:79063, May 17 2010, 13:48:52) \n[GCC 4.2.1 (Apple Inc. build 5664)] on darwin\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\nfrom landslide.generator import Generator\nGenerator\n\n○ landslide\nUsage: landslide [options] input.md ...\n\n\n\nGenerates fancy HTML5 or PDF slideshows from Markdown sources\nOptions:\n  -h, --help            show this help message and exit\n  -b, --debug           Will display any exception trace to stdin\n  -d FILE, --destination=FILE\n                        The path to the to the destination file: .html or .pdf\n                        extensions allowed (default: presentation.html)\n  -e ENCODING, --encoding=ENCODING\n                        The encoding of your files (defaults to utf8)\n  -i, --embed           Embed base64-encoded images in presentation\n  -t FILE, --template=FILE\n                        The path to a Jinja2 compatible template file\n  -o, --direct-ouput    Prints the generated HTML code to stdin; won't work\n                        with PDF export\n  -q, --quiet           Won't write anything to stdin (silent mode)\n  -v, --verbose         Write informational messages to stdin (enabled by\n                        default)\nNote: PDF export requires the prince program: http://princexml.com/\n```\n. n1k0, can you put some debug statements in /usr/local/bin/landslide to see what that import logic is really going? It should be able to import the landslide module after install...\n. Yay :)\n. I added more rst features to samples/example3. That's enough for now\n. I'm not going to worry about this any time soon other than maybe manually editing the default theme. There doesnt seem to be a good option for HTML5 tidying right now other than this nonsense:\ntidy -as-xhtml --input-xml --tidy-mark no -indent --indent-spaces 4 -wrap 0 --new-blocklevel-tags article,header,footer --new-inline-tags video,audio,canvas,ruby,rt,rp --doctype \"<!DOCTYPE HTML>\" --break-before-br yes --sort-attributes alpha --vertical-space yes\nand it doesn't even work. (http://stackoverflow.com/questions/2657658/wanted-command-line-html5-beautifier)\n. Thanks for catching this. It's fixed in my trunk, and I'll push a minor release to pypi soon.\nI just adjusted the encoding of the html file as it went into princeXML.\n. I like the solution of just editing the default theme and creating a new one. This seems simpler to me.\nIt would be great if you could push that extra theme to me and I'll add it to the core distribution.\nAm I understanding correctly?\n. May I include your extra theme in landslide 0.8? I'll figure out the abstraction for theme inheritance in 0.9 or 1.0.\nYou can either update your repository to mine, commit the theme, and push it to me, or I can grab the theme from your repository and commit it myself.\n. I have added your theme and called it \"light\". Also, themes no longer need to include a custom base.html or js/slides.js. If those files are missing, Landslide will use the base.html and js/slides.js from the default theme.\n. Great Idea. I'll do that very soon.\n. I need to do some reading on this and respond.\nThanks for the contribution...Landslide is my first attempt at packaging a python app :)\n. I've just been really busy. I'll try to take a look at it again this afternoon or tomorrow.\nSorry about that.\n. I followed this to package landslide: http://diveintopython3.org/packaging.html\nWas I wrong in doing that? I will play around with your changes to setup.py, but can you explain to me why we should support setuptools and why the files should be renamed as you did?\nThanks...I'm still new at packaging ;)\n. Merged. Many thanks. Sorry for all the delay :)\n. Luckily it was a problem it example2's markup\n. Wow, good catch. I have merged mtryhall's branch so all should be well now.\nThanks!!\n. Done just now. Thanks\n. Aw man how did I miss this? Thanks...\nSo I can ignore Ticket #18?\n. You're right n1k0. I really have a lot to learn about testing. Thanks.\nHandle this stuff in the next few days.\n. Thanks n1k0.\nThis has been fixed in 0.8.1 (just pushed)\n. Yeah, this would be cool. Good find.\nI'll start looking around at how to implement it.\n. Wow this is awesome. I used it but haven't review the code yet. I'll do that before long.\nThanks as always.\n. This is awesome in the main theme. I'll look at porting it to the other themes.\n. I added your expose CSS to the other themes.\nThanks again!!\n. Yeah I was looking last night. I hope to merge everything this weekend.\nYou don't send me pull requests these days ;)\nThanks as always n1k0!!\n. Fixed in master thanks to olivierverdier.\nThanks for reporting this.\n. You sure did. I have merged your branch.\nThanks so much.\n. I am also crediting you in the README.\n. Thanks for the patches, guys.\nn1k0, can you git me an opinion on what to merge? #24? You're better at i18n than I am :)\nthanks\n. I have merged Olivier's branch. \nThank you very much millette, n1k0, and Olivier.\nI'll release 0.8.2 very soon.\n. I found that the help div wasn't hidden on PDF generation, so I wanted to get that fix released as soon as possible. This affected all PDFs.\nI wasn't sure when I'd have time to look at #25 so I went ahead and released 0.8.2. ;)\n. Merged, thanks.\n. Merged. Tanks!\n. I can't make this a priority right now. Someone who knows Windows is going to have to fix this probably.\n. I'm a little confused too. I'm currently review all of this code.\nThanks for the contributions as always!!\n. The code looks great. I am not seeing a safe way to remove those duplicate commits though. Any ideas before I push?\n. Done...I wonder if this is 0.9 worthy? ;)\n. I just implemented support for the :align: directive.\nThe width and height directives work, but you have you put spaces after the image line. Same with :align:.\nThanks for reporting these issues.\n. It looks like the FixImagePaths Macro's regex is a little too pushy. I should have a fix this afternoon.\nI guess I only tested with remote images.\nThanks for reporting this.\n. Ok it should be fixed now.\nThanks\n. I still like having an easily-readable and hopefully-obvious separator for slide.\nThis could be considered when our RST support gets more advanced though.\nThanks!\n. Is that a Restructured Text directive?\nThe table of contents in landslide is built from slide breaks. We are not using ReST specific commands.\nThe ToC generated by rendering samples/example seems to work fine.\n. We do not support the RST Table of Contents directive at this time. Our RST support is just for simple markup.\nMaybe in a later version. Thanks\n. For now we'll just say...do no use directives like sidebar.\nLandslide will only support a subset of ReST for now.\n. Awesome...will merge soon. Thanks\n. Finally merged these changes. Thanks\n. Duplicate \n. Hello. I'm finally ready to merge this, but I'm wondering where you got the theme? Did you make it yourself?\nThanks\n. Awesome. Thanks.\nMerged.\n. Is this the same problem described in issue #39?\n. I just finished implementing this.\nIt works with the -i flag.\nThanks\n. Thanks\n. I merged this but had to make another commit because importing macro messes up variables named macro in generator.py. So I renamed macro.py to macros.py.\nLet me know if you have feedback on this solution.\nAlso feel free to submit a request to have your theme merged. It is nice :)\nThanks\n. Yes, for now I think it would be better to have some kind of config option to include nondefault macros. \nYour change did bring this sort of thing to my attention, which was good.\nWhat do you think?\n. Thanks!\n. This is great!!\nOnce you're done, I'll merge it and cut 1.0. Great work, seriously.\n. Or did you want someone else to finish it?\n. Cool. I'll take a look at the CSS once you're done. No worries. Not that I'm a pro either though... ;)\n'p' would be my first idea for a shortcut key. It's keycode 80.\n. Great, I'm about to merge. One question though.\nDo you intend for markdown content (lists, for instance) to be rendered to presenter notes? I am considering replacing your heading notation with our typical macro or note notation:\n.presenter-notes Blah Blah Blah Blah\nOr something like that. To me, adding a header may confuse things a little. I'm still thinking about it.\nDo you feel strongly either way?\nI didn't encounter that bug in Chrome. I'll look deeper in a bit.\n. Yes, I'd like to move this to a macro as well. I was looking at that the other night. I'll let you know about the refactoring, n1k0. I might have some time early this week.\nI'm mostly concerned with what the input format will look like. Right now I'm leaning toward something like this:\n```\nSlide 1\nHello\nBlah Blah\n.presenter_notes\n\nOne\nTwo\nThree\n\nSlide Two\n```\nThoughts?\n. Oh yes. I forgot the trailing colon ;)\nI'll do it that way. Thanks for the feedback, guys.\n. I like this idea as well. I just merged BestFriendChris' presenter view branch, and now I'll be working on the new macro system.\nHow should we go about including new macros into the rendering of a slideshow? If there's not much overhead, we may as well parse for every macro landslide has (QR codes and all). I do not want a user of landslide to have to touch to the code to enable a macro we ship with.\nn1k0, we talked about about not including the QR macro as default...as we rethink the macro system, how should the user enable it? Or do you also think it should be enabled automatically?\n. I believe Landslide supports this now. Let me know if you have any further problems with it.\n. Yeah, this is a great idea. Could you recommend a python module for landslide to use? I guess the textile module is the obvious choice...\n. I finally added textile support.\nUnfortunately, textile has no way of rendering an  tag, so you'll have to specify those literally to break your slides.\n. Do you mean that you're not able to arbitrarily bring up a keyboard input like on an iPhone? I see what you mean...\nSwiping left and right to change slides works, but I'll see what we can do about detecting your platform and providing a menu.\n. No, you're not missing anything. I agree with you.\nThanks for the docs.\n. I thought I fixed that...thanks.\n. @sdouche I have implemented screen blanking as described and n1k0's page up and page down fix is there as well.\nWhat is freezing?\n. Are you saying that your laser button tells the browser to refresh?\nLandslide has nothing set for key code 63, so I'm a little confused. Maybe you could try to fix it in your fork and submit a pull request?\nWhat model is your pen?\nThanks\n. I'm going to close this issue. Please reopen it if anything changes with the pen.\nThanks!\n. I'm hoping to improve templating a lot in v2.0. \n. Your commits undo each other as blocke said, but thanks for reporting the issue. I'll take a look at it.\n. I fixed presenter notes in the tango and light themes.\n. On a Mac, the open command opens a file in it's associated application, so calling open an an html file would open it a web browser.\nSince you are on linux, you should just open presentation.html in a web browser or use some other command line tool if you prefer.\nUs putting open in the README is just a cool Mac trick ;)\nSorry to confuse. Does this help?\n. Thanks!\n. Good points. This will be considered post-1.0.\nThanks!\n. How do they get in the way? Are you seeing something about presenter notes without pressing p?\nIt looks like your patch just takes the title away from the presenter notes box if they're not present. Help me understand.\nThanks!\n. Weird...could you post the markdown source you are using or is it RST?\nThis .md should work, does it?\n```\nLandslide\n\nSomething\n\n1                                                                                                                                                                                  \n2                                                                                                                                                                                  \n\nPresenter Notes\nhi                                                                                                                                                                                   \n\nOverview\nGenerates a slideshow using the slides that power\n```\n. Ah ok, I'll take a look at the RST stuff next.\nThanks!\n. I changed a slide in that presentation to this:\n```\nThe \"formal\" coding dojo                                                                                                                                                       \n========================                                                                                                                                                         \n(or the French way of doing it...)                                                                                                                                               \n\nProcess\n\n2 minutes: decide on date for next session                                                                                                                                     \n25-30 minutes: quick retrospective of the previous session; what went well, what was interesting, what was frustrating                                                         \n10 minutes: decide on a topic for this session                                                                                                                                 \n40 minutes or so: code! PreparedKata or RandoriKata                                                                                                                            \n5-10 minutes: mid-session break to discuss how things are going                                                                                                                \n40 minutes: code some more                                                                                                                                                     \n\nPresenter Notes\nThese are my presenter notes...                                                                                                                                                  \n\n```\n\nIt looks good to me, so I'm still having trouble reproducing the error. Any ideas?\n. I'm going to close this for now. Please reopen it if you're still having trouble.\nThanks!\n. I don't see the BOM being rendered in the test file you sent me. Can you explain a little more maybe? Or include a screenshot?\nAlso, wouldn't codecs.BOM be a better way to do this?\nThanks!\n. I'm still having trouble reproducing this error. I don't see anything in my editor or in the rendered presentation. I diffed a presentation output file with and without your patch that was made with your test.md file, and I got no differences.\nI have only tested on a macbook thus far. Thanks for your patience.\n. I'm not seeing an attached zip on your email.\n. I got your attachment and I can see the problem now. Thanks for being patient with me.\n. Fixed, thanks.\n. Good catch, Thanks!\n. Thanks!!\n. I think this is a good idea.\nFeel free to go ahead and implement this with a -w flag. Hopefully we can get it in before 1.0.\nThanks!\nOh, and it'd be cool to hear more about how you're using landslide in your course. My email address is on my github page\n. I hope to have 1.0 tagged and on pypi this weekend.\n. And that presentation looks awesome! Thanks for sharing.\n. Discussion moved to #71\n. I just pushed a temporary fix for this, so you should be good.\nStill trying to solve it...it looks like the javascript is moving the last slide's presenter_notes div out from under the slide div to the slides div when there is a certain type of code block present maybe?\nWe'll see.\n. Same here!\nThanks\n. Wow, I bet it would have taken me forever to catch this.\nThanks!\n. I was hoping to get 1.0 up there this weekend. I have some goals to accomplish before I make another real release.\nI'll probably have it on pypi this weekend regardless.\nThanks\n. What does it mean to use Landslide on app engine? Hosting presentations or rendering them?\nI've never used app engine, so maybe I'm missing something.\n. I'm trying to decide whether we should require watchdog or make it optional.\nMaybe if they try the -w flag, it would try to import watchdog and upon a failure, tell them to install it.\nWhat do you think? I guess I'm hesitant to add watchdog as a dependency (along with its many dependencies). Maybe I'm wrong.\n. Whenever I save my .md file in vim, I immediately get this from the watch process:\n```\n○ ./main.py -w ~/Desktop/landslide_test/test.md\nAdding   /Users/adam/Desktop/landslide_test/test.md (markdown)\nGenerated file: presentation.html\nWatching /Users/adam/Desktop/landslide_test/test.md\nAdding   /Users/adam/Desktop/landslide_test/test.md (markdown)Generated file: presentation.html\nWatching /Users/adam/Desktop/landslide_test/test.md\nException in thread Thread-2:Traceback (most recent call last):\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/threading.py\", line 552, in bootstrap_inner\n    self.run()\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/site-packages/watchdog/observers/api.py\", line 192, in run\n    self.queue_events(self.timeout)\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/site-packages/watchdog/observers/kqueue.py\", line 686, in queue_events\n    self.watch.is_recursive)\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/site-packages/watchdog/utils/dirsnapshot.py\", line 227, in __init\n    stat_info = os.stat(self._path)\nOSError: [Errno 2] No such file or directory: '/Users/adam/Desktop/landslide_test/test.md'\n```\nAny ideas? Maybe it's me.\n. I tried smultron, and it's not seeing the changes...weird.\nWhich editor are you using?\nI'll play with this more tonight. I'm probably missing something.\n. I used your code as starting point and finally implemented this...a year later.\nThanks!\n. Merged #93\nThanks\n. I'll do some testing with it today. Thanks!\n. I am fixing this with the suggestion by @millette.\nPlease open a separate pull request for the notes problem.\nThanks!\n. How can I reproduce this?\nThanks\n. Good catch. I was able to reproduce this by trying the -o option with ♥ as slide content. It's odd that I didn't think to try that sooner. Oh well...\nThanks again!\n. I think the previous behavior might correct.\nTry with this example:\n```\nSlide\nI am a normal line\nI am indented\n\n!python\nx = 'first python line'\na = x\n\nI too am a normal line\n!python\ny = 'second python line'\nb = y\n\n```\nIf an indented block starts with a non code block, we can't assume the whole thing should be a code block.\nI guess a more robust solution would be for the code highlighting macro to not pick up a normal indented block. I'll look into that.\nLet me know what you think.\n. I will add author support to the default theme in v2.\n. The extra Presenter Notes pages are now hidden on pdf export in the master brach.\nPictures in PDFs retain their color. What is missing? The simple code block colors are intentional. Reopen this issue if you want to discuss further.\nI'll look into wkhtmltopdf, but it may be a while before our pdf generator changes for Landslide.\nThanks for the feedback!\n. I cannot reproduce this\n. Good catch, but I'm trying to decide if we should use \"Untitled\", a blank/space, or something else...a dash?\n\n\n\nThoughts?\n. Agreed and thanks again!\n. Did this happen from the pypi version (1.0.0)?\nIt should be fixed in master. I'll cut a new release (1.0.1) soon.\n. I'll updated it on PyPi soon. Sorry about that. It should work in master.\n. I've updated Landslide on pypi.\nhttp://pypi.python.org/pypi/landslide/1.0.1\nDid that help?\n. Thanks for the pull request!\nHowever, this adds a bit too complex for my tastes. Maybe one day I can make it easy to include external macros. \n. Thanks!\n. Yeah, generating and installing man pages seems a bit hairy. I'm closing this issue for now since running landslide or main.py with no arguments should be sufficient.\nThanks for the useful links and suggestion though.\n. Is suppressing all ReST errors acceptable behavior?\n. Yeah, I just supressed all ReST rendering errors.\nThanks\n. The current method seems to work fine. If you have some reasoning as to why it should work in the way you have suggested, please reopen the ticket and let me know.\nThanks!\n. Wow, this is great. Not sure why it's taken me 10 months to merge. Sorry about that.\nThanks!\n. Thanks!\n. I have linked to the python markdown extensions documentation in the README.\nYou have to pass in the extension name, so pass in abbr to get markdown.extensions.abbr loaded.\nI think loading them all could be problematic as some users might experience unexpected behavior with their markup. They are extensions for a reason! :wink: \nThanks!\n. This seems to be fixed in newer versions of Firefox. Let me know if you're still experiencing the problem and if there's something I can do on the Landside end of things.\nThanks!\n. Thanks for reporting this...over three years ago :wink: \n. Good catch! I'll add some blockquote styles to the existing themes.\n. Cool, let me know how it goes. I'd be open to adding click advancing as a command-line switch if you really need it.\nThanks!\n. @metal3d This isn't working for me either. Could you make a sample presentation available?\nMy initial thought is that Landslide should not support this feature unless someone else wants to implement it.\n. Thanks @gdyer!\n. Great, thanks!\n. You are currently able to write presenter notes in presentations formatted in ReST. Like so:\n```\nSlide Title\n===========\nThis is my slide content\nPresenter Notes\nThese are my presenter notes\n```\nOr are you trying to achieve something else with this code?\n. Very true, thanks. The examples really need to be redone.\n. Good catch, thanks!\n. First of all, this is great for your first pull request. Thanks helping with Landslide!\nI'm having trouble reproducing your problem though. If I run src/landslide/main.py -i -t tango samples/example1 from a clean checkout of my repo, the tango theme's background.png theme image is embedded in the output file.\nI'm probably misunderstanding something.\nAlso, when would self.theme_dir ever be False since self.find_theme_dir is called in __init__?\n. Thanks @akrabat and @akrabat. I'm going to merge #126.\n. Not currently. I think you'd need to do that with a custom theme at the moment.\n. I'm not able to reproduce your issue. Here's the file I tested with:\n```\nTesting Link Titles\n\nTest\nGoogle\n```\nPlease reopen this issue if it's still a problem.\nThanks!\n. Yeah, I'd like to add this. I need to integrate the latest version of HTML5Slides. Thanks for the suggestion.\n. I'm hoping to implement this in v2.0 after I deal with existing issues and pull requests then do some cleanup and refactoring.\n. Not at the moment.\nCurrently, centering of the title slide is done with a CSS only-child selector, so it'd be hard to add additional content without significant theme changes.\nThat said, I like the idea. What would the markup look like though?\n. Yes, @durden makes a good point, but for now there is no way. See also #111.\n. What happened here? I wonder why it says you merged a commit into my master branch.\n. I'm pretty sure this is the problem (in utils.py):\npython\ndef get_rel_path_url(path, base_path=os.getcwd()):\n    \"\"\" Returns a relative path from the absolute one passed as argument.\n        Silently returns originally provided path on failure.\n    \"\"\"\n    try:\n        path_url = path.split(base_path)[1]\n        if path_url.startswith('/'):\n            return path_url[1:]\n        else:\n            return path_url\n    except (IndexError, TypeError):\n        return path\n. Oh! I didn't see your suggestion, but that's how I fixed it in 62fcba3a :smile: \nThanks!\n. Thanks!\n. I went with Watchdog.\n. Thanks :)\n. Thanks for the pull request. Could you make it into one commit and resubmit?\n. Thanks! I guess this was blocking lexers like c# or html+django\nGood catch!\n. Could you paste in a sample Markdown or ReST file that reproduces the error for me?\nAlso, are you using a custom theme?\nThanks\n. Thanks for the example. I believe I understand your problem now.\nI think it's best to leave the solution to be a workaround. I don't think it's wise to make a special case in the markdown parsing part of landslide for this.\nYou have two options:\n- The underscore workaround\n- Wrapping your mathjax code in <div></div> (this may require some styling, which could be added to the default theme or to your custom theme)\nDoes this sound ok?\n. Good catch. Thanks!\n. Thanks! We should talk more about what you're doing with avalanche. Very cool\n. Thanks!\n. I really like this, but it makes Landslide huge (312K to 5.5M). I'll be thinking about it.\nThanks!\n. Yeah, Google Web Fonts would be great. If you could make that change, I'll worry about any other size issues.\nAlso, do you think we need the scss files?\n. Yeah, I'm good with offline getting some nice defaults.\n. Great, thanks. Have you contacted the author of shower about doing this? I think we're ok on the licensing side of things.\n. Cool. We'll wait until the end of the week to hear from him before merging then. I want to cut a release with this theme included this weekend.\nLet me know what you hear Thanks again.\n. Does that mean we should add shower's license file in the themes/ribbon/ directory?\n. Hooray!\nThanks for all of your work!\n. I merged your pull request. Thanks!\n. Thanks!\n. Hello,\nIt seems that this has more to do with Markdown than Landslide. Perhaps you could add some normal text between the list and the code? Or put a &nbsp; between the two.\nGithub does it too:\n- item 1\n- item 2\n!python\n  import os\n  os.listdir()\nvs.\n- item 1\n- item 2\nsome text\n!python\nimport os\nos.listdir()\n. This has already been added. See the following:\nhttps://github.com/adamzap/landslide/blob/master/src/landslide/generator.py#L113\nhttps://github.com/adamzap/landslide/blob/master/src/landslide/generator.py#L441-443\nThanks though! I'll cut a release soon.\n. Yeah, I cut a bad release. I'm about to push a fix up.\nSorry about that.\n. I've fixed the problem and pushed a new version to pypi.\nLet me know if you still have problems.\n. Great job on this theme!\nI wonder if it would better for you to keep in it's own repository on your account due to it's size and how different it is from the default theme. I can link to it.\n. Sorry I never got back to you on this!\nYou could create a new repository just for this new theme, and I'll link to it in Landslide's readme.\nThanks!\n. Awesome, thanks!\n. I've integrated the presenter notes change and credited you in the CHANGELOG.\nI hope to come back to the copy_theme changes later.\nThanks!\n. Ah ok. Glad you got it figured out :smile: \n. Thanks for the pull request!\nWhat's the harm in embedding an empty JS file if the user has explicitly asked for embedding?\n. I'm going to close this for now. Landslide now has better support for MathJax on the master branch.\nIf you try that and are still having trouble with MathJax, open a new issue and we'll see what we can do.\n. Thanks for the patch.\nThe default ReST math rendering is working, but I think the MathJax approach is breaking due to ReST's HTML preprocessing.\nThis can work for markdown though. I'll make a few adjustments after merging.\n. This is awesome!\nThanks\n. Is there anyway I can confirm that this works with Leap Motion and should be included in Landslide? I don't own the device.\nThanks!\n. That would be great.\nAdam Zapletal\nOn Aug 24, 2013, at 1:02 AM, Izar Tarandach notifications@github.com wrote:\n\nFirst of all, thank you so much for your hard work with landslide - it is \nawesome! \nIf it helps any I can make a quick movie of it working, how about that? \nOn Aug 23, 2013 10:25 PM, \"Adam Zapletal\" notifications@github.com wrote: \n\nIs there anyway I can confirm that this works with Leap Motion and should \nbe included in Landslide? I don't own the device. \nThanks! \n— \nReply to this email directly or view it on GitHubhttps://github.com/adamzap/landslide/pull/146#issuecomment-23203323 \n. \n—\nReply to this email directly or view it on GitHub.\n. Awesome, thanks!\n. Thanks for the bug report!\n. Duplicate of #159 \n. No, not at this time.\n\n\nThanks\n. I'm hoping to implement this in v2.0 after I deal with existing issues and pull requests then do some cleanup and refactoring.\nThanks for the resources!\n. Thanks for the pull request, but I prefer explicit slide breaks. \n. @tjwood100 Thanks!\n. This kind of functionality can be available in a custom theme.\nAs I work toward v2.0, I hope to include a theme that has it built in!\nThanks for the idea!\n. They are both working for me with the examples you cited:\n```\nCSV Table\n=========\n.. csv-table:: Frozen Delights!\n   :header: \"Treat\", \"Quantity\", \"Description\"\n   :widths: 15, 10, 30\n\"Albatross\", 2.99, \"On a stick!\"\n   \"Crunchy Frog\", 1.49, \"If we took the bones out, it wouldn't be\n   crunchy, now would it?\"\n   \"Gannet Ripple\", 1.99, \"On a stick!\"\n```\n\n```\nList Table\n==========\n.. list-table:: Frozen Delights!\n   :widths: 15 10 30\n   :header-rows: 1\n\n\n\nTreat\nQuantity\nDescription\n\n\n\n\nAlbatross\n2.99\nOn a stick!\n\n\n\n\nCrunchy Frog\n1.49\nIf we took the bones out, it wouldn't be\n   crunchy, now would it?\n\n\n\n\nGannet Ripple\n1.99\nOn a stick!\n```\n\n\n\n\nLet me know if you're still having trouble...over a year later :wink: \n. Awesome, thanks!\n. Sure, I'm open to a pull request.\nThanks!\n. Thanks for this work and sorry for the delay in my response.\nThe relative imports break on Python 2.7. Any idea how to fix that?\n. You're right. I've fallen way behind on python packaging and testing. Also I've never touched python3.\nCould you squash you commits into one?\n. Great, thanks :+1: \n. Thanks for the pull request, but I think the RST directives are a bit out of the scope of Landslide. You can always use the .. raw:: html directive to embed multimedia things.\n. I think it's ok the way it is.\nMarkdown wraps images in a <p>, but restructured text does not.\n. What would the source for that look like? I mean how would you specify it in your slides?\nCould you give an example input?\n. I'm unable to reproduce this. It works for the example for me.\nCould you paste some breaking restructured text so I can debug it?\nThanks\n. Reopen this ticket if you're still having problems\n. Thanks!\n. Thanks for the pull request!\nHowever, I think it's to much of an edge case for the user to want to switch line number styles mid-presentation. \n. Thanks for the pull request, but this is too much to merge at one time!\nI'll try to incorporate some of your fixes over time.\n. Thanks, but I don't use travis-ci\n. I removed it before closing your PR :wink: \n. Thanks for reporting this problem and offering a solution.\nI'm going to fix it by simplifying the regex to look for url() in the page that contains an image extension.\n. Awesome, thanks!\n. I'll revisit this in v2.\nThanks for the PR!\n. Which version are you running? Did you download it from pypi or did you clone it from GitHub?\nThanks for the report\n. I think the issue is that I haven't cut a release since #158 was merged.\nI'll try to do that soon. Your problem would probably be solved if you used a version cloned from github in the meantime. \n. I finally cut a release!\nv1.1.2 is now on PyPI\n. I'm having trouble reproducing this issue. Could you post an example source file that where it happens?\n. Reopen this ticket if you're still having problems\n. This is a great idea, but it looks like CSS expressions are deprecated and were only supported by Internet Explorer anyway:\nhttp://stackoverflow.com/questions/6191679/css-expressions\nI appreciate your pull request though!\n. I'm unable to reproduce this with a fresh install on both Python 2 and 3.\nPlease reopen this issue if the problem persists.\nThanks!\n. @ztzt How did you install Landslide?\n. It seems to be a problem with your python or pip installation. Would you consider switching to homebrew and see if it works? http://docs.python-guide.org/en/latest/starting/install/osx/\n. Thanks for the bug report!\n. Every markdown-based slideshow generator has to make decisions on how to interpret the markup to output a slideshow instead of plain HTML.\nI hope the design decisions I've made for Landslide make sense. For instance, Landslide interprets the markup that generates an <hr> as a slide separator.\nI've always gone back to John Gruber's Markdown Syntax Guide as the authority on what markdown is. On top of that, I just pass text into python's markdown module.\nI understand your frustration. Markdown-based slideshow generation is a crowded space these days.\n. Reopen this ticket if you're still having problems\n. Run landslide -m on an .rst file containing this:\n```\nMathJax Test\n============\n\\[ \\left( \\sum_{k=1}^n a_k b_k \\right)^2 \\]\n```\nIt works for me. Does it work for you?\n. That's odd.\nYou can try the -b flag, but I'm not sure that it will help.\nThe best thing to do is probably to look at the generated HTML file and debug from there.\n. Reopen this ticket if you're still having problems\n. Thanks for the PR!\nCould you explain how this improves things and which problems you're having? Landslide doesn't really support mobile yet.\nWhich device are you on?\n. I'm going to close this for now since there should be much better touch support in v2.\nThanks!\n. You're referring to the master branch, right?\nDo you have any suggestions? Maybe put statements like from .generator import Generator in __init__.py?\n. I believe I have fixed the themes directory issue. I can generate presentations after installing via setup.py.\nCould you grab master and try?\nThanks!\n. Awesome!\nI'll close the issue then.\nI'm curious though why you installed with setup.py instead of pip.\n. Got it, thanks!\n. Thanks!\n. @htaslan I am able to use landslide with non-ASCII characters without your patch.\nDid you close this pull request because you discovered the same thing?\n. I'm having trouble reproducing this. Which operating system are you on?\n. Run landslide with -x tables to enable the markdown extension for rendering tables.\nFor example: landslide -x tables slides.md\nSee the markdown documentation here: https://pythonhosted.org/Markdown/extensions/tables.html\n. Your theme should inherit from the default theme...or did you delete it?\nAlso, you could add a blank screen.css file in your theme directory. That's a simple way to bypass it.\n. @vbauer Let me know if you need any more help\n. That's a great idea. Maybe with this? https://github.com/google/py-gfm\nThanks!\n. Fenced code blocks will work when I release v2!\n. - Which version are you using?\n- Can you provide a file that causes it to fail?\n. Closing until a response is received \n. @luwenhegithub Could you provide a file that I can run through Landslide to reproduce the problem?\n. Could you post the input file that generated this error?\n. I'll reopen this if I get more information\n. Thanks for the pull request. Could you provide a slideshow that shows the behavior you are attempting to fix here?\n. This will be fixed when I release v2.\nThanks for reporting!\n. Thanks for the pull request!\nI like your approach here, but I'm in the middle of a full rewrite of Landslide. I'll be happy to integrate this idea (and a much better macro/plugin system) soon after I'm done.\n. Yeah, I think you'd need to write custom CSS for that right now. However, I like the idea of adding a few simply utility classes like center to the default theme.\n. Could you provide an input file that exhibits #188?\n. Thanks for the PR. I'll try to reproduce and test this soon.\nBy the way, you can pass a tuple to isinstance instead of using or, like isinstance('a', (str, int)).. I applied Particules' commit and this works now.\nhttp://github.com/adamzap/html5-slides-markdown/commit/5cb9fe11f0c273fc690d88d73fde4d4770c1e81f\nThanks\n. Yeah, that would be a great feature. I'll start looking into it.\n. Merged n1k0's branch. I might try to weak the print stylesheet to look more like the slides, but this totally works with princexml.\nThanks!\n. n1k0 implemented this himself.\nThanks!!\n. I applied n1k0's changes and this now works.\nThanks!!\n. Do you mean a table of contents slide with a link to each slide? That could be nice...\n. I like the ToC feature alot, but I am seeing some bugginess when I render the README.md as a presentation and click on the last slide link in the ToC. Theres some weird rendering on the right of the AUTHORS slide.\nI can look at the problem if it's not something obvious to you, n1k0.\n. this works now. many thanks to n1k0.\n. It looks like that's causing problems with the php code sample as well.\nI'm looking into it.\n. I'm working on a solution...I'm going to use a multiline regex to get all the code blocks and highlight and replace them one at a time. It should work.\n. Fixed and pushed.\nI just leveled up in regex.\n. That'd be great, but the javascript implementation of markdown is called showdown\n. I believe I'm going to call it either Landslide or Represent. I'm leaning toward Landslide. Any objections? Going to pypi before the end of the week, I believe.\n. Landslide it is\n. Done and merged. Feedback is encouraged.\n. I was thinking we should keep it black and white for printing. The code is still highlighted though.\nIs the use case printing or just having a PDF of the presentation?\n. It might be this logic...but it works for me.\nI'll try it on a few machines.\ntry:\n    from landslide.generator import Generator\nexcept ImportError:\n    from generator import Generator\nI thought this would work for both working with a checkout and an pip install...\n. n1k0, it works fine for me on an ubuntu machine that's never seen a recent version of our code. I used pip.\n. Hmm ok. Thanks for doing that. It should also be installing markdown, jinja2, and pygments as requirements...\nI'll keep investigating.\n. I think I'm confusing setuptools and distutils...this is my first time to make a python package\n. First i have no landslide installed, then i install it, then it works...\nThis is on my macbook. \n```\n○ python\nPython 2.6.5 (r265:79063, May 17 2010, 13:48:52) \n[GCC 4.2.1 (Apple Inc. build 5664)] on darwin\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\n\n\n\nimport landslide\nTraceback (most recent call last):\n  File \"\", line 1, in \nImportError: No module named landslide\nfrom landslide.generator import Generator\nTraceback (most recent call last):\n  File \"\", line 1, in \nImportError: No module named landslide.generator\n○ sudo pip install landslide\nDownloading/unpacking landslide\n  Downloading landslide-0.4.0.tar.gz (51Kb): 51Kb downloaded\n  Running setup.py egg_info for package landslide\nInstalling collected packages: landslide\n  Running setup.py install for landslide\n    changing mode of build/scripts-2.6/landslide from 644 to 755\n    changing mode of /opt/local/Library/Frameworks/Python.framework/Versions/2.6/bin/landslide to 755\nSuccessfully installed landslide\nCleaning up...\n○ python\nPython 2.6.5 (r265:79063, May 17 2010, 13:48:52) \n[GCC 4.2.1 (Apple Inc. build 5664)] on darwin\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\nimport landslide\n○ python\nPython 2.6.5 (r265:79063, May 17 2010, 13:48:52) \n[GCC 4.2.1 (Apple Inc. build 5664)] on darwin\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\nfrom landslide.generator import Generator\nGenerator\n\n○ landslide\nUsage: landslide [options] input.md ...\n\n\n\nGenerates fancy HTML5 or PDF slideshows from Markdown sources\nOptions:\n  -h, --help            show this help message and exit\n  -b, --debug           Will display any exception trace to stdin\n  -d FILE, --destination=FILE\n                        The path to the to the destination file: .html or .pdf\n                        extensions allowed (default: presentation.html)\n  -e ENCODING, --encoding=ENCODING\n                        The encoding of your files (defaults to utf8)\n  -i, --embed           Embed base64-encoded images in presentation\n  -t FILE, --template=FILE\n                        The path to a Jinja2 compatible template file\n  -o, --direct-ouput    Prints the generated HTML code to stdin; won't work\n                        with PDF export\n  -q, --quiet           Won't write anything to stdin (silent mode)\n  -v, --verbose         Write informational messages to stdin (enabled by\n                        default)\nNote: PDF export requires the prince program: http://princexml.com/\n```\n. n1k0, can you put some debug statements in /usr/local/bin/landslide to see what that import logic is really going? It should be able to import the landslide module after install...\n. Yay :)\n. I added more rst features to samples/example3. That's enough for now\n. I'm not going to worry about this any time soon other than maybe manually editing the default theme. There doesnt seem to be a good option for HTML5 tidying right now other than this nonsense:\ntidy -as-xhtml --input-xml --tidy-mark no -indent --indent-spaces 4 -wrap 0 --new-blocklevel-tags article,header,footer --new-inline-tags video,audio,canvas,ruby,rt,rp --doctype \"<!DOCTYPE HTML>\" --break-before-br yes --sort-attributes alpha --vertical-space yes\nand it doesn't even work. (http://stackoverflow.com/questions/2657658/wanted-command-line-html5-beautifier)\n. Thanks for catching this. It's fixed in my trunk, and I'll push a minor release to pypi soon.\nI just adjusted the encoding of the html file as it went into princeXML.\n. I like the solution of just editing the default theme and creating a new one. This seems simpler to me.\nIt would be great if you could push that extra theme to me and I'll add it to the core distribution.\nAm I understanding correctly?\n. May I include your extra theme in landslide 0.8? I'll figure out the abstraction for theme inheritance in 0.9 or 1.0.\nYou can either update your repository to mine, commit the theme, and push it to me, or I can grab the theme from your repository and commit it myself.\n. I have added your theme and called it \"light\". Also, themes no longer need to include a custom base.html or js/slides.js. If those files are missing, Landslide will use the base.html and js/slides.js from the default theme.\n. Great Idea. I'll do that very soon.\n. I need to do some reading on this and respond.\nThanks for the contribution...Landslide is my first attempt at packaging a python app :)\n. I've just been really busy. I'll try to take a look at it again this afternoon or tomorrow.\nSorry about that.\n. I followed this to package landslide: http://diveintopython3.org/packaging.html\nWas I wrong in doing that? I will play around with your changes to setup.py, but can you explain to me why we should support setuptools and why the files should be renamed as you did?\nThanks...I'm still new at packaging ;)\n. Merged. Many thanks. Sorry for all the delay :)\n. Luckily it was a problem it example2's markup\n. Wow, good catch. I have merged mtryhall's branch so all should be well now.\nThanks!!\n. Done just now. Thanks\n. Aw man how did I miss this? Thanks...\nSo I can ignore Ticket #18?\n. You're right n1k0. I really have a lot to learn about testing. Thanks.\nHandle this stuff in the next few days.\n. Thanks n1k0.\nThis has been fixed in 0.8.1 (just pushed)\n. Yeah, this would be cool. Good find.\nI'll start looking around at how to implement it.\n. Wow this is awesome. I used it but haven't review the code yet. I'll do that before long.\nThanks as always.\n. This is awesome in the main theme. I'll look at porting it to the other themes.\n. I added your expose CSS to the other themes.\nThanks again!!\n. Yeah I was looking last night. I hope to merge everything this weekend.\nYou don't send me pull requests these days ;)\nThanks as always n1k0!!\n. Fixed in master thanks to olivierverdier.\nThanks for reporting this.\n. You sure did. I have merged your branch.\nThanks so much.\n. I am also crediting you in the README.\n. Thanks for the patches, guys.\nn1k0, can you git me an opinion on what to merge? #24? You're better at i18n than I am :)\nthanks\n. I have merged Olivier's branch. \nThank you very much millette, n1k0, and Olivier.\nI'll release 0.8.2 very soon.\n. I found that the help div wasn't hidden on PDF generation, so I wanted to get that fix released as soon as possible. This affected all PDFs.\nI wasn't sure when I'd have time to look at #25 so I went ahead and released 0.8.2. ;)\n. Merged, thanks.\n. Merged. Tanks!\n. I can't make this a priority right now. Someone who knows Windows is going to have to fix this probably.\n. I'm a little confused too. I'm currently review all of this code.\nThanks for the contributions as always!!\n. The code looks great. I am not seeing a safe way to remove those duplicate commits though. Any ideas before I push?\n. Done...I wonder if this is 0.9 worthy? ;)\n. I just implemented support for the :align: directive.\nThe width and height directives work, but you have you put spaces after the image line. Same with :align:.\nThanks for reporting these issues.\n. It looks like the FixImagePaths Macro's regex is a little too pushy. I should have a fix this afternoon.\nI guess I only tested with remote images.\nThanks for reporting this.\n. Ok it should be fixed now.\nThanks\n. I still like having an easily-readable and hopefully-obvious separator for slide.\nThis could be considered when our RST support gets more advanced though.\nThanks!\n. Is that a Restructured Text directive?\nThe table of contents in landslide is built from slide breaks. We are not using ReST specific commands.\nThe ToC generated by rendering samples/example seems to work fine.\n. We do not support the RST Table of Contents directive at this time. Our RST support is just for simple markup.\nMaybe in a later version. Thanks\n. For now we'll just say...do no use directives like sidebar.\nLandslide will only support a subset of ReST for now.\n. Awesome...will merge soon. Thanks\n. Finally merged these changes. Thanks\n. Duplicate \n. Hello. I'm finally ready to merge this, but I'm wondering where you got the theme? Did you make it yourself?\nThanks\n. Awesome. Thanks.\nMerged.\n. Is this the same problem described in issue #39?\n. I just finished implementing this.\nIt works with the -i flag.\nThanks\n. Thanks\n. I merged this but had to make another commit because importing macro messes up variables named macro in generator.py. So I renamed macro.py to macros.py.\nLet me know if you have feedback on this solution.\nAlso feel free to submit a request to have your theme merged. It is nice :)\nThanks\n. Yes, for now I think it would be better to have some kind of config option to include nondefault macros. \nYour change did bring this sort of thing to my attention, which was good.\nWhat do you think?\n. Thanks!\n. This is great!!\nOnce you're done, I'll merge it and cut 1.0. Great work, seriously.\n. Or did you want someone else to finish it?\n. Cool. I'll take a look at the CSS once you're done. No worries. Not that I'm a pro either though... ;)\n'p' would be my first idea for a shortcut key. It's keycode 80.\n. Great, I'm about to merge. One question though.\nDo you intend for markdown content (lists, for instance) to be rendered to presenter notes? I am considering replacing your heading notation with our typical macro or note notation:\n.presenter-notes Blah Blah Blah Blah\nOr something like that. To me, adding a header may confuse things a little. I'm still thinking about it.\nDo you feel strongly either way?\nI didn't encounter that bug in Chrome. I'll look deeper in a bit.\n. Yes, I'd like to move this to a macro as well. I was looking at that the other night. I'll let you know about the refactoring, n1k0. I might have some time early this week.\nI'm mostly concerned with what the input format will look like. Right now I'm leaning toward something like this:\n```\nSlide 1\nHello\nBlah Blah\n.presenter_notes\n\nOne\nTwo\nThree\n\nSlide Two\n```\nThoughts?\n. Oh yes. I forgot the trailing colon ;)\nI'll do it that way. Thanks for the feedback, guys.\n. I like this idea as well. I just merged BestFriendChris' presenter view branch, and now I'll be working on the new macro system.\nHow should we go about including new macros into the rendering of a slideshow? If there's not much overhead, we may as well parse for every macro landslide has (QR codes and all). I do not want a user of landslide to have to touch to the code to enable a macro we ship with.\nn1k0, we talked about about not including the QR macro as default...as we rethink the macro system, how should the user enable it? Or do you also think it should be enabled automatically?\n. I believe Landslide supports this now. Let me know if you have any further problems with it.\n. Yeah, this is a great idea. Could you recommend a python module for landslide to use? I guess the textile module is the obvious choice...\n. I finally added textile support.\nUnfortunately, textile has no way of rendering an  tag, so you'll have to specify those literally to break your slides.\n. Do you mean that you're not able to arbitrarily bring up a keyboard input like on an iPhone? I see what you mean...\nSwiping left and right to change slides works, but I'll see what we can do about detecting your platform and providing a menu.\n. No, you're not missing anything. I agree with you.\nThanks for the docs.\n. I thought I fixed that...thanks.\n. @sdouche I have implemented screen blanking as described and n1k0's page up and page down fix is there as well.\nWhat is freezing?\n. Are you saying that your laser button tells the browser to refresh?\nLandslide has nothing set for key code 63, so I'm a little confused. Maybe you could try to fix it in your fork and submit a pull request?\nWhat model is your pen?\nThanks\n. I'm going to close this issue. Please reopen it if anything changes with the pen.\nThanks!\n. I'm hoping to improve templating a lot in v2.0. \n. Your commits undo each other as blocke said, but thanks for reporting the issue. I'll take a look at it.\n. I fixed presenter notes in the tango and light themes.\n. On a Mac, the open command opens a file in it's associated application, so calling open an an html file would open it a web browser.\nSince you are on linux, you should just open presentation.html in a web browser or use some other command line tool if you prefer.\nUs putting open in the README is just a cool Mac trick ;)\nSorry to confuse. Does this help?\n. Thanks!\n. Good points. This will be considered post-1.0.\nThanks!\n. How do they get in the way? Are you seeing something about presenter notes without pressing p?\nIt looks like your patch just takes the title away from the presenter notes box if they're not present. Help me understand.\nThanks!\n. Weird...could you post the markdown source you are using or is it RST?\nThis .md should work, does it?\n```\nLandslide\n\nSomething\n\n1                                                                                                                                                                                  \n2                                                                                                                                                                                  \n\nPresenter Notes\nhi                                                                                                                                                                                   \n\nOverview\nGenerates a slideshow using the slides that power\n```\n. Ah ok, I'll take a look at the RST stuff next.\nThanks!\n. I changed a slide in that presentation to this:\n```\nThe \"formal\" coding dojo                                                                                                                                                       \n========================                                                                                                                                                         \n(or the French way of doing it...)                                                                                                                                               \n\nProcess\n\n2 minutes: decide on date for next session                                                                                                                                     \n25-30 minutes: quick retrospective of the previous session; what went well, what was interesting, what was frustrating                                                         \n10 minutes: decide on a topic for this session                                                                                                                                 \n40 minutes or so: code! PreparedKata or RandoriKata                                                                                                                            \n5-10 minutes: mid-session break to discuss how things are going                                                                                                                \n40 minutes: code some more                                                                                                                                                     \n\nPresenter Notes\nThese are my presenter notes...                                                                                                                                                  \n\n```\n\nIt looks good to me, so I'm still having trouble reproducing the error. Any ideas?\n. I'm going to close this for now. Please reopen it if you're still having trouble.\nThanks!\n. I don't see the BOM being rendered in the test file you sent me. Can you explain a little more maybe? Or include a screenshot?\nAlso, wouldn't codecs.BOM be a better way to do this?\nThanks!\n. I'm still having trouble reproducing this error. I don't see anything in my editor or in the rendered presentation. I diffed a presentation output file with and without your patch that was made with your test.md file, and I got no differences.\nI have only tested on a macbook thus far. Thanks for your patience.\n. I'm not seeing an attached zip on your email.\n. I got your attachment and I can see the problem now. Thanks for being patient with me.\n. Fixed, thanks.\n. Good catch, Thanks!\n. Thanks!!\n. I think this is a good idea.\nFeel free to go ahead and implement this with a -w flag. Hopefully we can get it in before 1.0.\nThanks!\nOh, and it'd be cool to hear more about how you're using landslide in your course. My email address is on my github page\n. I hope to have 1.0 tagged and on pypi this weekend.\n. And that presentation looks awesome! Thanks for sharing.\n. Discussion moved to #71\n. I just pushed a temporary fix for this, so you should be good.\nStill trying to solve it...it looks like the javascript is moving the last slide's presenter_notes div out from under the slide div to the slides div when there is a certain type of code block present maybe?\nWe'll see.\n. Same here!\nThanks\n. Wow, I bet it would have taken me forever to catch this.\nThanks!\n. I was hoping to get 1.0 up there this weekend. I have some goals to accomplish before I make another real release.\nI'll probably have it on pypi this weekend regardless.\nThanks\n. What does it mean to use Landslide on app engine? Hosting presentations or rendering them?\nI've never used app engine, so maybe I'm missing something.\n. I'm trying to decide whether we should require watchdog or make it optional.\nMaybe if they try the -w flag, it would try to import watchdog and upon a failure, tell them to install it.\nWhat do you think? I guess I'm hesitant to add watchdog as a dependency (along with its many dependencies). Maybe I'm wrong.\n. Whenever I save my .md file in vim, I immediately get this from the watch process:\n```\n○ ./main.py -w ~/Desktop/landslide_test/test.md\nAdding   /Users/adam/Desktop/landslide_test/test.md (markdown)\nGenerated file: presentation.html\nWatching /Users/adam/Desktop/landslide_test/test.md\nAdding   /Users/adam/Desktop/landslide_test/test.md (markdown)Generated file: presentation.html\nWatching /Users/adam/Desktop/landslide_test/test.md\nException in thread Thread-2:Traceback (most recent call last):\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/threading.py\", line 552, in bootstrap_inner\n    self.run()\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/site-packages/watchdog/observers/api.py\", line 192, in run\n    self.queue_events(self.timeout)\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/site-packages/watchdog/observers/kqueue.py\", line 686, in queue_events\n    self.watch.is_recursive)\n  File \"/usr/local/Cellar/python/2.7.2/lib/python2.7/site-packages/watchdog/utils/dirsnapshot.py\", line 227, in __init\n    stat_info = os.stat(self._path)\nOSError: [Errno 2] No such file or directory: '/Users/adam/Desktop/landslide_test/test.md'\n```\nAny ideas? Maybe it's me.\n. I tried smultron, and it's not seeing the changes...weird.\nWhich editor are you using?\nI'll play with this more tonight. I'm probably missing something.\n. I used your code as starting point and finally implemented this...a year later.\nThanks!\n. Merged #93\nThanks\n. I'll do some testing with it today. Thanks!\n. I am fixing this with the suggestion by @millette.\nPlease open a separate pull request for the notes problem.\nThanks!\n. How can I reproduce this?\nThanks\n. Good catch. I was able to reproduce this by trying the -o option with ♥ as slide content. It's odd that I didn't think to try that sooner. Oh well...\nThanks again!\n. I think the previous behavior might correct.\nTry with this example:\n```\nSlide\nI am a normal line\nI am indented\n\n!python\nx = 'first python line'\na = x\n\nI too am a normal line\n!python\ny = 'second python line'\nb = y\n\n```\nIf an indented block starts with a non code block, we can't assume the whole thing should be a code block.\nI guess a more robust solution would be for the code highlighting macro to not pick up a normal indented block. I'll look into that.\nLet me know what you think.\n. I will add author support to the default theme in v2.\n. The extra Presenter Notes pages are now hidden on pdf export in the master brach.\nPictures in PDFs retain their color. What is missing? The simple code block colors are intentional. Reopen this issue if you want to discuss further.\nI'll look into wkhtmltopdf, but it may be a while before our pdf generator changes for Landslide.\nThanks for the feedback!\n. I cannot reproduce this\n. Good catch, but I'm trying to decide if we should use \"Untitled\", a blank/space, or something else...a dash?\n\n\n\nThoughts?\n. Agreed and thanks again!\n. Did this happen from the pypi version (1.0.0)?\nIt should be fixed in master. I'll cut a new release (1.0.1) soon.\n. I'll updated it on PyPi soon. Sorry about that. It should work in master.\n. I've updated Landslide on pypi.\nhttp://pypi.python.org/pypi/landslide/1.0.1\nDid that help?\n. Thanks for the pull request!\nHowever, this adds a bit too complex for my tastes. Maybe one day I can make it easy to include external macros. \n. Thanks!\n. Yeah, generating and installing man pages seems a bit hairy. I'm closing this issue for now since running landslide or main.py with no arguments should be sufficient.\nThanks for the useful links and suggestion though.\n. Is suppressing all ReST errors acceptable behavior?\n. Yeah, I just supressed all ReST rendering errors.\nThanks\n. The current method seems to work fine. If you have some reasoning as to why it should work in the way you have suggested, please reopen the ticket and let me know.\nThanks!\n. Wow, this is great. Not sure why it's taken me 10 months to merge. Sorry about that.\nThanks!\n. Thanks!\n. I have linked to the python markdown extensions documentation in the README.\nYou have to pass in the extension name, so pass in abbr to get markdown.extensions.abbr loaded.\nI think loading them all could be problematic as some users might experience unexpected behavior with their markup. They are extensions for a reason! :wink: \nThanks!\n. This seems to be fixed in newer versions of Firefox. Let me know if you're still experiencing the problem and if there's something I can do on the Landside end of things.\nThanks!\n. Thanks for reporting this...over three years ago :wink: \n. Good catch! I'll add some blockquote styles to the existing themes.\n. Cool, let me know how it goes. I'd be open to adding click advancing as a command-line switch if you really need it.\nThanks!\n. @metal3d This isn't working for me either. Could you make a sample presentation available?\nMy initial thought is that Landslide should not support this feature unless someone else wants to implement it.\n. Thanks @gdyer!\n. Great, thanks!\n. You are currently able to write presenter notes in presentations formatted in ReST. Like so:\n```\nSlide Title\n===========\nThis is my slide content\nPresenter Notes\nThese are my presenter notes\n```\nOr are you trying to achieve something else with this code?\n. Very true, thanks. The examples really need to be redone.\n. Good catch, thanks!\n. First of all, this is great for your first pull request. Thanks helping with Landslide!\nI'm having trouble reproducing your problem though. If I run src/landslide/main.py -i -t tango samples/example1 from a clean checkout of my repo, the tango theme's background.png theme image is embedded in the output file.\nI'm probably misunderstanding something.\nAlso, when would self.theme_dir ever be False since self.find_theme_dir is called in __init__?\n. Thanks @akrabat and @akrabat. I'm going to merge #126.\n. Not currently. I think you'd need to do that with a custom theme at the moment.\n. I'm not able to reproduce your issue. Here's the file I tested with:\n```\nTesting Link Titles\n\nTest\nGoogle\n```\nPlease reopen this issue if it's still a problem.\nThanks!\n. Yeah, I'd like to add this. I need to integrate the latest version of HTML5Slides. Thanks for the suggestion.\n. I'm hoping to implement this in v2.0 after I deal with existing issues and pull requests then do some cleanup and refactoring.\n. Not at the moment.\nCurrently, centering of the title slide is done with a CSS only-child selector, so it'd be hard to add additional content without significant theme changes.\nThat said, I like the idea. What would the markup look like though?\n. Yes, @durden makes a good point, but for now there is no way. See also #111.\n. What happened here? I wonder why it says you merged a commit into my master branch.\n. I'm pretty sure this is the problem (in utils.py):\npython\ndef get_rel_path_url(path, base_path=os.getcwd()):\n    \"\"\" Returns a relative path from the absolute one passed as argument.\n        Silently returns originally provided path on failure.\n    \"\"\"\n    try:\n        path_url = path.split(base_path)[1]\n        if path_url.startswith('/'):\n            return path_url[1:]\n        else:\n            return path_url\n    except (IndexError, TypeError):\n        return path\n. Oh! I didn't see your suggestion, but that's how I fixed it in 62fcba3a :smile: \nThanks!\n. Thanks!\n. I went with Watchdog.\n. Thanks :)\n. Thanks for the pull request. Could you make it into one commit and resubmit?\n. Thanks! I guess this was blocking lexers like c# or html+django\nGood catch!\n. Could you paste in a sample Markdown or ReST file that reproduces the error for me?\nAlso, are you using a custom theme?\nThanks\n. Thanks for the example. I believe I understand your problem now.\nI think it's best to leave the solution to be a workaround. I don't think it's wise to make a special case in the markdown parsing part of landslide for this.\nYou have two options:\n- The underscore workaround\n- Wrapping your mathjax code in <div></div> (this may require some styling, which could be added to the default theme or to your custom theme)\nDoes this sound ok?\n. Good catch. Thanks!\n. Thanks! We should talk more about what you're doing with avalanche. Very cool\n. Thanks!\n. I really like this, but it makes Landslide huge (312K to 5.5M). I'll be thinking about it.\nThanks!\n. Yeah, Google Web Fonts would be great. If you could make that change, I'll worry about any other size issues.\nAlso, do you think we need the scss files?\n. Yeah, I'm good with offline getting some nice defaults.\n. Great, thanks. Have you contacted the author of shower about doing this? I think we're ok on the licensing side of things.\n. Cool. We'll wait until the end of the week to hear from him before merging then. I want to cut a release with this theme included this weekend.\nLet me know what you hear Thanks again.\n. Does that mean we should add shower's license file in the themes/ribbon/ directory?\n. Hooray!\nThanks for all of your work!\n. I merged your pull request. Thanks!\n. Thanks!\n. Hello,\nIt seems that this has more to do with Markdown than Landslide. Perhaps you could add some normal text between the list and the code? Or put a &nbsp; between the two.\nGithub does it too:\n- item 1\n- item 2\n!python\n  import os\n  os.listdir()\nvs.\n- item 1\n- item 2\nsome text\n!python\nimport os\nos.listdir()\n. This has already been added. See the following:\nhttps://github.com/adamzap/landslide/blob/master/src/landslide/generator.py#L113\nhttps://github.com/adamzap/landslide/blob/master/src/landslide/generator.py#L441-443\nThanks though! I'll cut a release soon.\n. Yeah, I cut a bad release. I'm about to push a fix up.\nSorry about that.\n. I've fixed the problem and pushed a new version to pypi.\nLet me know if you still have problems.\n. Great job on this theme!\nI wonder if it would better for you to keep in it's own repository on your account due to it's size and how different it is from the default theme. I can link to it.\n. Sorry I never got back to you on this!\nYou could create a new repository just for this new theme, and I'll link to it in Landslide's readme.\nThanks!\n. Awesome, thanks!\n. I've integrated the presenter notes change and credited you in the CHANGELOG.\nI hope to come back to the copy_theme changes later.\nThanks!\n. Ah ok. Glad you got it figured out :smile: \n. Thanks for the pull request!\nWhat's the harm in embedding an empty JS file if the user has explicitly asked for embedding?\n. I'm going to close this for now. Landslide now has better support for MathJax on the master branch.\nIf you try that and are still having trouble with MathJax, open a new issue and we'll see what we can do.\n. Thanks for the patch.\nThe default ReST math rendering is working, but I think the MathJax approach is breaking due to ReST's HTML preprocessing.\nThis can work for markdown though. I'll make a few adjustments after merging.\n. This is awesome!\nThanks\n. Is there anyway I can confirm that this works with Leap Motion and should be included in Landslide? I don't own the device.\nThanks!\n. That would be great.\nAdam Zapletal\nOn Aug 24, 2013, at 1:02 AM, Izar Tarandach notifications@github.com wrote:\n\nFirst of all, thank you so much for your hard work with landslide - it is \nawesome! \nIf it helps any I can make a quick movie of it working, how about that? \nOn Aug 23, 2013 10:25 PM, \"Adam Zapletal\" notifications@github.com wrote: \n\nIs there anyway I can confirm that this works with Leap Motion and should \nbe included in Landslide? I don't own the device. \nThanks! \n— \nReply to this email directly or view it on GitHubhttps://github.com/adamzap/landslide/pull/146#issuecomment-23203323 \n. \n—\nReply to this email directly or view it on GitHub.\n. Awesome, thanks!\n. Thanks for the bug report!\n. Duplicate of #159 \n. No, not at this time.\n\n\nThanks\n. I'm hoping to implement this in v2.0 after I deal with existing issues and pull requests then do some cleanup and refactoring.\nThanks for the resources!\n. Thanks for the pull request, but I prefer explicit slide breaks. \n. @tjwood100 Thanks!\n. This kind of functionality can be available in a custom theme.\nAs I work toward v2.0, I hope to include a theme that has it built in!\nThanks for the idea!\n. They are both working for me with the examples you cited:\n```\nCSV Table\n=========\n.. csv-table:: Frozen Delights!\n   :header: \"Treat\", \"Quantity\", \"Description\"\n   :widths: 15, 10, 30\n\"Albatross\", 2.99, \"On a stick!\"\n   \"Crunchy Frog\", 1.49, \"If we took the bones out, it wouldn't be\n   crunchy, now would it?\"\n   \"Gannet Ripple\", 1.99, \"On a stick!\"\n```\n\n```\nList Table\n==========\n.. list-table:: Frozen Delights!\n   :widths: 15 10 30\n   :header-rows: 1\n\n\n\nTreat\nQuantity\nDescription\n\n\n\n\nAlbatross\n2.99\nOn a stick!\n\n\n\n\nCrunchy Frog\n1.49\nIf we took the bones out, it wouldn't be\n   crunchy, now would it?\n\n\n\n\nGannet Ripple\n1.99\nOn a stick!\n```\n\n\n\n\nLet me know if you're still having trouble...over a year later :wink: \n. Awesome, thanks!\n. Sure, I'm open to a pull request.\nThanks!\n. Thanks for this work and sorry for the delay in my response.\nThe relative imports break on Python 2.7. Any idea how to fix that?\n. You're right. I've fallen way behind on python packaging and testing. Also I've never touched python3.\nCould you squash you commits into one?\n. Great, thanks :+1: \n. Thanks for the pull request, but I think the RST directives are a bit out of the scope of Landslide. You can always use the .. raw:: html directive to embed multimedia things.\n. I think it's ok the way it is.\nMarkdown wraps images in a <p>, but restructured text does not.\n. What would the source for that look like? I mean how would you specify it in your slides?\nCould you give an example input?\n. I'm unable to reproduce this. It works for the example for me.\nCould you paste some breaking restructured text so I can debug it?\nThanks\n. Reopen this ticket if you're still having problems\n. Thanks!\n. Thanks for the pull request!\nHowever, I think it's to much of an edge case for the user to want to switch line number styles mid-presentation. \n. Thanks for the pull request, but this is too much to merge at one time!\nI'll try to incorporate some of your fixes over time.\n. Thanks, but I don't use travis-ci\n. I removed it before closing your PR :wink: \n. Thanks for reporting this problem and offering a solution.\nI'm going to fix it by simplifying the regex to look for url() in the page that contains an image extension.\n. Awesome, thanks!\n. I'll revisit this in v2.\nThanks for the PR!\n. Which version are you running? Did you download it from pypi or did you clone it from GitHub?\nThanks for the report\n. I think the issue is that I haven't cut a release since #158 was merged.\nI'll try to do that soon. Your problem would probably be solved if you used a version cloned from github in the meantime. \n. I finally cut a release!\nv1.1.2 is now on PyPI\n. I'm having trouble reproducing this issue. Could you post an example source file that where it happens?\n. Reopen this ticket if you're still having problems\n. This is a great idea, but it looks like CSS expressions are deprecated and were only supported by Internet Explorer anyway:\nhttp://stackoverflow.com/questions/6191679/css-expressions\nI appreciate your pull request though!\n. I'm unable to reproduce this with a fresh install on both Python 2 and 3.\nPlease reopen this issue if the problem persists.\nThanks!\n. @ztzt How did you install Landslide?\n. It seems to be a problem with your python or pip installation. Would you consider switching to homebrew and see if it works? http://docs.python-guide.org/en/latest/starting/install/osx/\n. Thanks for the bug report!\n. Every markdown-based slideshow generator has to make decisions on how to interpret the markup to output a slideshow instead of plain HTML.\nI hope the design decisions I've made for Landslide make sense. For instance, Landslide interprets the markup that generates an <hr> as a slide separator.\nI've always gone back to John Gruber's Markdown Syntax Guide as the authority on what markdown is. On top of that, I just pass text into python's markdown module.\nI understand your frustration. Markdown-based slideshow generation is a crowded space these days.\n. Reopen this ticket if you're still having problems\n. Run landslide -m on an .rst file containing this:\n```\nMathJax Test\n============\n\\[ \\left( \\sum_{k=1}^n a_k b_k \\right)^2 \\]\n```\nIt works for me. Does it work for you?\n. That's odd.\nYou can try the -b flag, but I'm not sure that it will help.\nThe best thing to do is probably to look at the generated HTML file and debug from there.\n. Reopen this ticket if you're still having problems\n. Thanks for the PR!\nCould you explain how this improves things and which problems you're having? Landslide doesn't really support mobile yet.\nWhich device are you on?\n. I'm going to close this for now since there should be much better touch support in v2.\nThanks!\n. You're referring to the master branch, right?\nDo you have any suggestions? Maybe put statements like from .generator import Generator in __init__.py?\n. I believe I have fixed the themes directory issue. I can generate presentations after installing via setup.py.\nCould you grab master and try?\nThanks!\n. Awesome!\nI'll close the issue then.\nI'm curious though why you installed with setup.py instead of pip.\n. Got it, thanks!\n. Thanks!\n. @htaslan I am able to use landslide with non-ASCII characters without your patch.\nDid you close this pull request because you discovered the same thing?\n. I'm having trouble reproducing this. Which operating system are you on?\n. Run landslide with -x tables to enable the markdown extension for rendering tables.\nFor example: landslide -x tables slides.md\nSee the markdown documentation here: https://pythonhosted.org/Markdown/extensions/tables.html\n. Your theme should inherit from the default theme...or did you delete it?\nAlso, you could add a blank screen.css file in your theme directory. That's a simple way to bypass it.\n. @vbauer Let me know if you need any more help\n. That's a great idea. Maybe with this? https://github.com/google/py-gfm\nThanks!\n. Fenced code blocks will work when I release v2!\n. - Which version are you using?\n- Can you provide a file that causes it to fail?\n. Closing until a response is received \n. @luwenhegithub Could you provide a file that I can run through Landslide to reproduce the problem?\n. Could you post the input file that generated this error?\n. I'll reopen this if I get more information\n. Thanks for the pull request. Could you provide a slideshow that shows the behavior you are attempting to fix here?\n. This will be fixed when I release v2.\nThanks for reporting!\n. Thanks for the pull request!\nI like your approach here, but I'm in the middle of a full rewrite of Landslide. I'll be happy to integrate this idea (and a much better macro/plugin system) soon after I'm done.\n. Yeah, I think you'd need to write custom CSS for that right now. However, I like the idea of adding a few simply utility classes like center to the default theme.\n. Could you provide an input file that exhibits #188?\n. Thanks for the PR. I'll try to reproduce and test this soon.\nBy the way, you can pass a tuple to isinstance instead of using or, like isinstance('a', (str, int)).. ",
    "n1k0": "Check out my fork, I came out with something (plus PDF export using princexml) :)\n. Showoff has a similar feature (well, a bit quirky atm), and it's proven very useful on large presentations. Here's a sample screenshot:\n\n. commited in latest trunk, please test and report feedback\n. ah indeed, but nothing obvious unfortunately :/\nsome javascript/css weirdness seems to happen there, I'll investigate but I won't have much time these days so feel free to give it a look if you get a chance\n. Cool, looks like things are fixing themselves while I sleep, great :)\nThanks Adam!\n. showdown would have been nice indeed ;)\nshowtime? pyshow? pynote? eapyshow? ok I stop here =)\n. I'm fine with Landslide too, go! :)\n. Great ideas\nI leave you this one, I'm so lame at CSS ;)\n. Very nice, it's better :) Now maybe adding some fancy color, background and gradients could improve reader's experience even more?\nI'll try to propose something soon\n. Hmmm good question... true that printing in color wouldn't make much sense. Well I guess people will create their own themes anyway, so it's not really important :)\n. Okay my bad, I was launching the command within the source directory, sorry for the noise :)\n. I just created a new VM running latest Ubuntu (32bits), here's the complete log:\n```\n$ sudo pip install landslide\nDownloading/unpacking landslide\n  Downloading landslide-0.4.0.tar.gz (51Kb): 51Kb downloaded\n  Running setup.py egg_info for package landslide\n    Traceback (most recent call last):\n      File \"\", line 3, in \n    ImportError: No module named setuptools.command\n    Complete output from command python setup.py egg_info:\n    Traceback (most recent call last):\nFile \"\", line 3, in \nImportError: No module named setuptools.command\n\nCommand python setup.py egg_info failed with error code 1\nStoring complete log in ./pip-log.txt\nniko@ubuntu:~$ sudo apt-get install python-setuptools\nReading package lists... Done\nBuilding dependency tree     \nReading state information... Done\nThe following NEW packages will be installed:\n  python-setuptools\n0 upgraded, 1 newly installed, 0 to remove and 200 not upgraded.\nNeed to get 213kB of archives.\nAfter this operation, 922kB of additional disk space will be used.\nGet:1 http://us.archive.ubuntu.com/ubuntu/ lucid/main python-setuptools 0.6.10-4ubuntu1 [213kB]\nFetched 213kB in 0s (299kB/s)          \nSelecting previously deselected package python-setuptools.\n(Reading database ... 124159 files and directories currently installed.)\nUnpacking python-setuptools (from .../python-setuptools_0.6.10-4ubuntu1_all.deb) ...\nSetting up python-setuptools (0.6.10-4ubuntu1) ...\nProcessing triggers for python-central ...\nniko@ubuntu:~$ sudo pip install landslide\nDownloading/unpacking landslide\n  Running setup.py egg_info for package landslide\nInstalling collected packages: landslide\n  Running setup.py install for landslide\n    changing mode of build/scripts-2.6/landslide from 644 to 755\n    changing mode of /usr/local/bin/landslide to 755\nSuccessfully installed landslide\nniko@ubuntu:~$ landslide \nTraceback (most recent call last):\n  File \"/usr/local/bin/landslide\", line 23, in \n    from generator import Generator\nImportError: No module named generator\n``\n. yes, and btwsetuptoolsseems to have a pretty usefulinstall_required` method which distutils doesn't seem to have, I can see lot of python personas using it in their distributed packages...\n. (me too :D)\n. Actually this is weird:\n```\n$ landslide \nTraceback (most recent call last):\n  File \"/usr/local/bin/landslide\", line 23, in \n    from generator import Generator\nImportError: No module named generator\nniko@ubuntu:~$ python\nPython 2.6.5 (r265:79063, Apr 16 2010, 13:09:56) \n[GCC 4.4.3] on linux2\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\n\n\n\nfrom landslide.generator import Generator\nTraceback (most recent call last):\n  File \"\", line 1, in \n  File \"/usr/local/lib/python2.6/dist-packages/landslide/generator.py\", line 23, in \n    import jinja2\nImportError: No module named jinja2\n```\n\n\n\n(the jinja2 error is not related, but here the interactive python shell actually finds the module, whereas the executable doesn't)\nMy knowledge of python is not sufficient here... :/\n. okay this one being no more, I think you can safely mark it as closed\n. yep, it fixes the problem. too bad 0.8 just been pushed on pypi :(\nmaybe time for a 0.8.1?\n. we definitely should add more tests for theme handling… I'll try to dedicate some time on this.\n. Hey no problem Adam, testing fs operations is especially tricky, I'll check if something exists to help in this regard\n. I've created an \"expose\" branch in my fork, check it out https://github.com/n1k0/landslide/tree/expose, works smoothly so far\n. Just to keep you informed, I merged my expose branch to my master one.\n. Don't precipitate releasing the feature, I'd like to port it to the light theme and check for some other enhancement to provide before :)\nBut a code review would be warmly welcome :)\n. Glad you like it =)\nOn Tue, Apr 5, 2011 at 06:06, adamzap\nreply@reply.github.com\nwrote:\n\nThis is awesome in the main theme. I'll look at porting it to the other themes.\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/issues/20#comment_957378\n\n\nNicolas Perriault\nhttp://www.akei.com/ — http://prendreuncafe.com/\nMobile: +33 660 92 08 67 — Skype: nperriault\n. On Sat, Apr 30, 2011 at 07:44, adamzap\nreply@reply.github.com\nwrote:\n\nI added your expose CSS to the other themes.\n\nYou should have a look at some recent enhancements I added to\nlandslide in my fork too :)\n++\n\nNicolas Perriault\nhttp://www.akei.com/ — http://prendreuncafe.com/\nMobile: +33 660 92 08 67 — Skype: nperriault\n. You're right, I should have done so indeed :)\nLe 30 avr. 2011 à 18:37, adamzap\nreply@reply.github.com\na écrit :\n\nYeah I was looking last night. I hope to merge everything this weekend.\nYou don't send me pull requests these days ;)\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/issues/20#comment_1081053\n. For the record, the --encoding option was added to set the encoding of the source file, not the resulting one (OK the doc of the task should be rewritten). But I can't see anybody wanting iso-\\d+ based presentations, as utf-8 will cover everything he needs natively.\n\nAlso, utf-8 is a correct value for html, but AFAICR utf8 is the value used to set the character encoding for python codecs.open function. Here the patch could break things...\nAdam and others, thoughts?\n. Okay interesting, if we could provide clean and transparent I/O encoding transformation, it would be great! (but in my own experience, this usually turns into a nightmare ;))\nI'll investigate…\n. You can safely merge Olivier's branch (I merged it into my own one btw, works like a charm) :)\nNow looking after 0.8.2 ;)\n. There are some tickets remaining, especially #25 looks annoying, we should probably investigate on it before releasing :)\n. Thank you for reporting, we'll take care of this asap\n. I've just added support for it in my fork, check it out\n. just for information I've added support for more standard ways to declare colored code blocks with ReST in my branch, which has been proposed as a pull request\n. I didn't know there was a \"standard\" :/\nI don't personally use ReST, so a good idea would probably to leave the feature be implemented by someone who actually uses it :-)\n. I agree, this is cleaner. And both syntaxes can probably live together... :)\n. +1 for supporting both names (plus generic cross-compatible landslide syntax)\n. I just sent a new pull request to address the issue. Give it a look.\n. Could you check my branch to see if the problem is gone? I fixed several issues and possibly the one you raise here.\n. Hmm, I realize that many things are provided in these commits… as they're mainly fixes, I don't think this will be much a problem though.\n. just realized that every commit I'm making from my branch is now published in this thread, and I can't really see the point… I should definitely make a dedicated branch for each feature I'm working on to avoid this behavior, even if I find it somewhat painful.\n. Just merge my branch as I already fixed many of the problem encountered :)\nDon't forget to run the test suite before tagging and releasing tho ;)\n. I don't think so, as it ships mainly bugfixes and makes things work as they were supposed to :)\n. I understand what you're trying to achieve, but I'm not really sure it's in the scope of Landslide — which is \"just\" a presentation generator, like PPT or Keynote are. Would you ever think producing a thesis using Powerpoint? ;)\nBut that's my point of view, others may have other opinions?\n. Use of a separator allows to manage slide separation and the amount of information you want or can display on each one… This definitely makes sense in a presentation context, while I guess we could introduce an alternative, less semantically obstrusive separator syntax like say .. slide in ReST or ![slide] in Markdown.\nWhat do others think?\n. I'm very tempted to get rid of ReST support reading all the \"features\" it supports. Will be a bunch of painful work to adapt them all to landslide.\nThoughts? Volunteers? Opinions?\n. Sounds good. Well, who?\n. Okay, I'm happy if we got somebody seeing value in this and possibly working on it :)\n. fixed in my \"fork\" https://github.com/n1k0/landslide\n. As I just said in the inline code comment above, I really think the whole presenter stuff should be handled by a dedicated Macro. I think the Generator class is bloated enough for now ;)\nIf you agree, I can help with refactoring the code if needed.\nAwesome work and great feature anyway, can't wait to see it merged =)\n. I would personaly keep the trailing colon to keep a bit of consistency, eg. .presenter_notes:\n. I was wondering nearly the same reading the mentioned conversation, so a big +1 for a Macro system refactoring. At the time I wrote it, I didn't expect landslide to become what it is now ;)\nI like very much the refactoring approach you describe, so you got a big +1 here. My only concerns is backward compatibility and QA, so we should ensure to have sufficient tests to ensure we won't break everything for existing presentations :)\n. The more I think about landslide the more I can't imaging working with it without a config file. Adding a new setting with the list of macro to load would just be the way to go imho, while I can't really imagine passing the macro names in some command line option…\nLast, +1000 for allowing the use of any macro which comply to the standard interface, wherever they are.\n. I'm not sure macros should be tied to the theme concept. IMHO theming is much more about presentation than effective feature, and macros provide features (or at least, processing)…\nDefinitely a tough question.\n. Hmmm you highlight a point I think I missed while designing landslide as it is now: the distinction between a /project/ and a /theme/… I'll have to think a bit more about this\n. As a side note, what do you think about the possibility of importing macros through the config.cfg file, eg:\n[landslide]\nsource = slides/\nmacros = macros.MyMacro\n         macros.OtherMacro\nSo you could have a project structure like this:\nproject/\n    slides/\n        0_intro.md\n        1_conclusion.md\n    config.cfg\n    macros.py\nWith of course some kind of import function smart enough to resolve the macro class paths a bit like how Django does.\nThis could overcome part of the the problem you're raising here… Thoughts?\n. Did you see the personal user javascripts and stylesheets feature in my fork? I think it could provide a decent solution for the use case you describe.\n. We should have a decent API and usage documentation, eg. one powered by sphinx. I started something in docs/ on my fork, but it's far from being complete atm.\n. fixed in my fork\n. okay, only PgUp and PgDown handling are fixed, your \"pen\" stuff isn't =)\nI'm on it.\n. Check out my fork, I came out with something (plus PDF export using princexml) :)\n. Showoff has a similar feature (well, a bit quirky atm), and it's proven very useful on large presentations. Here's a sample screenshot:\n\n. commited in latest trunk, please test and report feedback\n. ah indeed, but nothing obvious unfortunately :/\nsome javascript/css weirdness seems to happen there, I'll investigate but I won't have much time these days so feel free to give it a look if you get a chance\n. Cool, looks like things are fixing themselves while I sleep, great :)\nThanks Adam!\n. showdown would have been nice indeed ;)\nshowtime? pyshow? pynote? eapyshow? ok I stop here =)\n. I'm fine with Landslide too, go! :)\n. Great ideas\nI leave you this one, I'm so lame at CSS ;)\n. Very nice, it's better :) Now maybe adding some fancy color, background and gradients could improve reader's experience even more?\nI'll try to propose something soon\n. Hmmm good question... true that printing in color wouldn't make much sense. Well I guess people will create their own themes anyway, so it's not really important :)\n. Okay my bad, I was launching the command within the source directory, sorry for the noise :)\n. I just created a new VM running latest Ubuntu (32bits), here's the complete log:\n```\n$ sudo pip install landslide\nDownloading/unpacking landslide\n  Downloading landslide-0.4.0.tar.gz (51Kb): 51Kb downloaded\n  Running setup.py egg_info for package landslide\n    Traceback (most recent call last):\n      File \"\", line 3, in \n    ImportError: No module named setuptools.command\n    Complete output from command python setup.py egg_info:\n    Traceback (most recent call last):\nFile \"\", line 3, in \nImportError: No module named setuptools.command\n\nCommand python setup.py egg_info failed with error code 1\nStoring complete log in ./pip-log.txt\nniko@ubuntu:~$ sudo apt-get install python-setuptools\nReading package lists... Done\nBuilding dependency tree     \nReading state information... Done\nThe following NEW packages will be installed:\n  python-setuptools\n0 upgraded, 1 newly installed, 0 to remove and 200 not upgraded.\nNeed to get 213kB of archives.\nAfter this operation, 922kB of additional disk space will be used.\nGet:1 http://us.archive.ubuntu.com/ubuntu/ lucid/main python-setuptools 0.6.10-4ubuntu1 [213kB]\nFetched 213kB in 0s (299kB/s)          \nSelecting previously deselected package python-setuptools.\n(Reading database ... 124159 files and directories currently installed.)\nUnpacking python-setuptools (from .../python-setuptools_0.6.10-4ubuntu1_all.deb) ...\nSetting up python-setuptools (0.6.10-4ubuntu1) ...\nProcessing triggers for python-central ...\nniko@ubuntu:~$ sudo pip install landslide\nDownloading/unpacking landslide\n  Running setup.py egg_info for package landslide\nInstalling collected packages: landslide\n  Running setup.py install for landslide\n    changing mode of build/scripts-2.6/landslide from 644 to 755\n    changing mode of /usr/local/bin/landslide to 755\nSuccessfully installed landslide\nniko@ubuntu:~$ landslide \nTraceback (most recent call last):\n  File \"/usr/local/bin/landslide\", line 23, in \n    from generator import Generator\nImportError: No module named generator\n``\n. yes, and btwsetuptoolsseems to have a pretty usefulinstall_required` method which distutils doesn't seem to have, I can see lot of python personas using it in their distributed packages...\n. (me too :D)\n. Actually this is weird:\n```\n$ landslide \nTraceback (most recent call last):\n  File \"/usr/local/bin/landslide\", line 23, in \n    from generator import Generator\nImportError: No module named generator\nniko@ubuntu:~$ python\nPython 2.6.5 (r265:79063, Apr 16 2010, 13:09:56) \n[GCC 4.4.3] on linux2\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\n\n\n\nfrom landslide.generator import Generator\nTraceback (most recent call last):\n  File \"\", line 1, in \n  File \"/usr/local/lib/python2.6/dist-packages/landslide/generator.py\", line 23, in \n    import jinja2\nImportError: No module named jinja2\n```\n\n\n\n(the jinja2 error is not related, but here the interactive python shell actually finds the module, whereas the executable doesn't)\nMy knowledge of python is not sufficient here... :/\n. okay this one being no more, I think you can safely mark it as closed\n. yep, it fixes the problem. too bad 0.8 just been pushed on pypi :(\nmaybe time for a 0.8.1?\n. we definitely should add more tests for theme handling… I'll try to dedicate some time on this.\n. Hey no problem Adam, testing fs operations is especially tricky, I'll check if something exists to help in this regard\n. I've created an \"expose\" branch in my fork, check it out https://github.com/n1k0/landslide/tree/expose, works smoothly so far\n. Just to keep you informed, I merged my expose branch to my master one.\n. Don't precipitate releasing the feature, I'd like to port it to the light theme and check for some other enhancement to provide before :)\nBut a code review would be warmly welcome :)\n. Glad you like it =)\nOn Tue, Apr 5, 2011 at 06:06, adamzap\nreply@reply.github.com\nwrote:\n\nThis is awesome in the main theme. I'll look at porting it to the other themes.\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/issues/20#comment_957378\n\n\nNicolas Perriault\nhttp://www.akei.com/ — http://prendreuncafe.com/\nMobile: +33 660 92 08 67 — Skype: nperriault\n. On Sat, Apr 30, 2011 at 07:44, adamzap\nreply@reply.github.com\nwrote:\n\nI added your expose CSS to the other themes.\n\nYou should have a look at some recent enhancements I added to\nlandslide in my fork too :)\n++\n\nNicolas Perriault\nhttp://www.akei.com/ — http://prendreuncafe.com/\nMobile: +33 660 92 08 67 — Skype: nperriault\n. You're right, I should have done so indeed :)\nLe 30 avr. 2011 à 18:37, adamzap\nreply@reply.github.com\na écrit :\n\nYeah I was looking last night. I hope to merge everything this weekend.\nYou don't send me pull requests these days ;)\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/issues/20#comment_1081053\n. For the record, the --encoding option was added to set the encoding of the source file, not the resulting one (OK the doc of the task should be rewritten). But I can't see anybody wanting iso-\\d+ based presentations, as utf-8 will cover everything he needs natively.\n\nAlso, utf-8 is a correct value for html, but AFAICR utf8 is the value used to set the character encoding for python codecs.open function. Here the patch could break things...\nAdam and others, thoughts?\n. Okay interesting, if we could provide clean and transparent I/O encoding transformation, it would be great! (but in my own experience, this usually turns into a nightmare ;))\nI'll investigate…\n. You can safely merge Olivier's branch (I merged it into my own one btw, works like a charm) :)\nNow looking after 0.8.2 ;)\n. There are some tickets remaining, especially #25 looks annoying, we should probably investigate on it before releasing :)\n. Thank you for reporting, we'll take care of this asap\n. I've just added support for it in my fork, check it out\n. just for information I've added support for more standard ways to declare colored code blocks with ReST in my branch, which has been proposed as a pull request\n. I didn't know there was a \"standard\" :/\nI don't personally use ReST, so a good idea would probably to leave the feature be implemented by someone who actually uses it :-)\n. I agree, this is cleaner. And both syntaxes can probably live together... :)\n. +1 for supporting both names (plus generic cross-compatible landslide syntax)\n. I just sent a new pull request to address the issue. Give it a look.\n. Could you check my branch to see if the problem is gone? I fixed several issues and possibly the one you raise here.\n. Hmm, I realize that many things are provided in these commits… as they're mainly fixes, I don't think this will be much a problem though.\n. just realized that every commit I'm making from my branch is now published in this thread, and I can't really see the point… I should definitely make a dedicated branch for each feature I'm working on to avoid this behavior, even if I find it somewhat painful.\n. Just merge my branch as I already fixed many of the problem encountered :)\nDon't forget to run the test suite before tagging and releasing tho ;)\n. I don't think so, as it ships mainly bugfixes and makes things work as they were supposed to :)\n. I understand what you're trying to achieve, but I'm not really sure it's in the scope of Landslide — which is \"just\" a presentation generator, like PPT or Keynote are. Would you ever think producing a thesis using Powerpoint? ;)\nBut that's my point of view, others may have other opinions?\n. Use of a separator allows to manage slide separation and the amount of information you want or can display on each one… This definitely makes sense in a presentation context, while I guess we could introduce an alternative, less semantically obstrusive separator syntax like say .. slide in ReST or ![slide] in Markdown.\nWhat do others think?\n. I'm very tempted to get rid of ReST support reading all the \"features\" it supports. Will be a bunch of painful work to adapt them all to landslide.\nThoughts? Volunteers? Opinions?\n. Sounds good. Well, who?\n. Okay, I'm happy if we got somebody seeing value in this and possibly working on it :)\n. fixed in my \"fork\" https://github.com/n1k0/landslide\n. As I just said in the inline code comment above, I really think the whole presenter stuff should be handled by a dedicated Macro. I think the Generator class is bloated enough for now ;)\nIf you agree, I can help with refactoring the code if needed.\nAwesome work and great feature anyway, can't wait to see it merged =)\n. I would personaly keep the trailing colon to keep a bit of consistency, eg. .presenter_notes:\n. I was wondering nearly the same reading the mentioned conversation, so a big +1 for a Macro system refactoring. At the time I wrote it, I didn't expect landslide to become what it is now ;)\nI like very much the refactoring approach you describe, so you got a big +1 here. My only concerns is backward compatibility and QA, so we should ensure to have sufficient tests to ensure we won't break everything for existing presentations :)\n. The more I think about landslide the more I can't imaging working with it without a config file. Adding a new setting with the list of macro to load would just be the way to go imho, while I can't really imagine passing the macro names in some command line option…\nLast, +1000 for allowing the use of any macro which comply to the standard interface, wherever they are.\n. I'm not sure macros should be tied to the theme concept. IMHO theming is much more about presentation than effective feature, and macros provide features (or at least, processing)…\nDefinitely a tough question.\n. Hmmm you highlight a point I think I missed while designing landslide as it is now: the distinction between a /project/ and a /theme/… I'll have to think a bit more about this\n. As a side note, what do you think about the possibility of importing macros through the config.cfg file, eg:\n[landslide]\nsource = slides/\nmacros = macros.MyMacro\n         macros.OtherMacro\nSo you could have a project structure like this:\nproject/\n    slides/\n        0_intro.md\n        1_conclusion.md\n    config.cfg\n    macros.py\nWith of course some kind of import function smart enough to resolve the macro class paths a bit like how Django does.\nThis could overcome part of the the problem you're raising here… Thoughts?\n. Did you see the personal user javascripts and stylesheets feature in my fork? I think it could provide a decent solution for the use case you describe.\n. We should have a decent API and usage documentation, eg. one powered by sphinx. I started something in docs/ on my fork, but it's far from being complete atm.\n. fixed in my fork\n. okay, only PgUp and PgDown handling are fixed, your \"pen\" stuff isn't =)\nI'm on it.\n. ",
    "bradcupit": "cool. I'm guessing that'll happen prior to rendering html (or with the original markdown text)?\n. as a blatant play on 'showoff', you could go with 'showdown'\n. how about 'pslydes' (the p is silent)\n. landslide works for me!\n. this is pretty cool. I was just reading about this bot today on slashdot:\nhttp://developers.slashdot.org/story/11/08/28/2323254/Automatic-Spelling-Corrections-On-Github?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Slashdot%2FslashdotDevelopers+%28Slashdot%3A+Developers%29\n. cool. I'm guessing that'll happen prior to rendering html (or with the original markdown text)?\n. as a blatant play on 'showoff', you could go with 'showdown'\n. how about 'pslydes' (the p is silent)\n. landslide works for me!\n. this is pretty cool. I was just reading about this bot today on slashdot:\nhttp://developers.slashdot.org/story/11/08/28/2323254/Automatic-Spelling-Corrections-On-Github?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Slashdot%2FslashdotDevelopers+%28Slashdot%3A+Developers%29\n. ",
    "agonzalezro": "This is my theme paths:\nalex@big:~/landslide/landslide/themes$ ls -lR extra/\nextra/:\ntotal 4\nlrwxrwxrwx 1 alex alex   20 2010-07-17 18:36 base.html -> ../default/base.html\ndrwxr-xr-x 2 alex alex 4096 2010-07-17 18:36 css\nlrwxrwxrwx 1 alex alex   14 2010-07-17 18:36 js -> ../default/js/\nextra/css:\ntotal 12\n-rw-r--r-- 1 alex alex 1196 2010-07-17 18:36 print.css\n-rw-r--r-- 1 alex alex 4474 2010-07-17 18:36 screen.css\n. Hi Adam!\nI've forked your code here: http://github.com/agonzalezro/landslide and add the extra* functionallity.\nThe problem to create a new theme without extra files is that when you improve your default theme .js or .css I must \"rewrite\" my theme to add your new functionallity. If I can link to your theme and add my stuff in different files we can have all the themes up-to-date.\nI've added you to my gmail chat, if you like we can speak about this.\n. Do it if you like, or I do it next two weeks (no time before, sorry :(\n. Perfect! Thanks Adam.\nIt's a good way to create new themes... If you don't include the print.css landslide includes it for you? Because rare time you need to change this file...\nGood work! Thanks for it!\n. I've just written a little script to \"test\" them manually. Changing the first variables it can generate a slide with all the themes and then, open them.\nI hope that this can help you.\n\nTHEMES=$HOME/landslide/src/landslide/themes\nSLIDE=$HOME/landslide/samples/example1/slides.md\nOUTPUT=/tmp\nfor theme in ls $THEMES; do \n    landslide -i -t $theme $SLIDE -d $OUTPUT/$theme.html\n    landslide -i -t $theme $SLIDE -d $OUTPUT/$theme.pdf\ndone\n\n. Hello again Adam,\nI was searching for the original html5 slides made by madpixel & google but I can't find them now. This theme is a merge between this slides (original idea) and the Tango project (colors): http://tango.freedesktop.org. CSS and background image are my stuff.\n. As I said you mails ago we will have a problem with css+images and it's that when you embed all the stuff in the html file you don't embed the css images. I don't know if n1k0 solved it in her fork.\nI've made test and I know that you can include base64 images in CSS too.\nI can help you if you like but I don't know where this code must go to don't do a bad hack :)\nBye!\n. Yeah, it's I didn't remember post it :p Sorry\n. Thank you adamzap! I will test it ASAP\n. The second commit if for allow the use of @import at CSS. This way we can create new themes basing them on the old themes. You can see tango-clean to see what I'm trying to say.\n. Too old and unstashed. If you want the option let me know. I will close it for now.\n. This is my theme paths:\nalex@big:~/landslide/landslide/themes$ ls -lR extra/\nextra/:\ntotal 4\nlrwxrwxrwx 1 alex alex   20 2010-07-17 18:36 base.html -> ../default/base.html\ndrwxr-xr-x 2 alex alex 4096 2010-07-17 18:36 css\nlrwxrwxrwx 1 alex alex   14 2010-07-17 18:36 js -> ../default/js/\nextra/css:\ntotal 12\n-rw-r--r-- 1 alex alex 1196 2010-07-17 18:36 print.css\n-rw-r--r-- 1 alex alex 4474 2010-07-17 18:36 screen.css\n. Hi Adam!\nI've forked your code here: http://github.com/agonzalezro/landslide and add the extra* functionallity.\nThe problem to create a new theme without extra files is that when you improve your default theme .js or .css I must \"rewrite\" my theme to add your new functionallity. If I can link to your theme and add my stuff in different files we can have all the themes up-to-date.\nI've added you to my gmail chat, if you like we can speak about this.\n. Do it if you like, or I do it next two weeks (no time before, sorry :(\n. Perfect! Thanks Adam.\nIt's a good way to create new themes... If you don't include the print.css landslide includes it for you? Because rare time you need to change this file...\nGood work! Thanks for it!\n. I've just written a little script to \"test\" them manually. Changing the first variables it can generate a slide with all the themes and then, open them.\nI hope that this can help you.\n\nTHEMES=$HOME/landslide/src/landslide/themes\nSLIDE=$HOME/landslide/samples/example1/slides.md\nOUTPUT=/tmp\nfor theme in ls $THEMES; do \n    landslide -i -t $theme $SLIDE -d $OUTPUT/$theme.html\n    landslide -i -t $theme $SLIDE -d $OUTPUT/$theme.pdf\ndone\n\n. Hello again Adam,\nI was searching for the original html5 slides made by madpixel & google but I can't find them now. This theme is a merge between this slides (original idea) and the Tango project (colors): http://tango.freedesktop.org. CSS and background image are my stuff.\n. As I said you mails ago we will have a problem with css+images and it's that when you embed all the stuff in the html file you don't embed the css images. I don't know if n1k0 solved it in her fork.\nI've made test and I know that you can include base64 images in CSS too.\nI can help you if you like but I don't know where this code must go to don't do a bad hack :)\nBye!\n. Yeah, it's I didn't remember post it :p Sorry\n. Thank you adamzap! I will test it ASAP\n. The second commit if for allow the use of @import at CSS. This way we can create new themes basing them on the old themes. You can see tango-clean to see what I'm trying to say.\n. Too old and unstashed. If you want the option let me know. I will close it for now.\n. ",
    "harobed": "Ok, you can contact me if you have some question about it.\n. Hi, have you some difficulty to apply this patch ? Can I help you ?\n. Thanks\n. Currently, distutils (version 1) don't support auto install dependency (\"install_require\" field).\nDon't support \"entry_points\" to install script file in bin…\nI've moved all files to \"src/\" because I want use landslide has namespace.\nYou can play with http://pypi.python.org/pypi/modern-package-template/1.0 to build some dummy package.\nMore information : http://packages.python.org/distribute/\n. Other documentation in work in progress :\nhttp://guide.python-distribute.org/\n. Thanks :)\n. Ok, you can contact me if you have some question about it.\n. Hi, have you some difficulty to apply this patch ? Can I help you ?\n. Thanks\n. Currently, distutils (version 1) don't support auto install dependency (\"install_require\" field).\nDon't support \"entry_points\" to install script file in bin…\nI've moved all files to \"src/\" because I want use landslide has namespace.\nYou can play with http://pypi.python.org/pypi/modern-package-template/1.0 to build some dummy package.\nMore information : http://packages.python.org/distribute/\n. Other documentation in work in progress :\nhttp://guide.python-distribute.org/\n. Thanks :)\n. ",
    "jeromer": "Hi, \nI got exactly the same issue, here is how to reproduce it:\n1. create an ReST file with the following contents:\n   \n   .. -- coding: utf-8 --\nTest\nTest\néèà\n\n1. run landslide input.rst\n2. you will get the following message:\n\nAdding   input.rst (restructuredtext)\nError: 'ascii' codec can't decode byte 0xc3 in position 74: ordinal not in range(128)\n. Grrr Markdown does not like opening php tags:\n\n\nSome test:\n\n.. code-block:: php\n\n    <?php\n    echo 'hello world'\n    >\n\n.. highlightlang:: php\n\n    <?php\n    echo 'hello world'\n    >\n\n. Hi, \nI got exactly the same issue, here is how to reproduce it:\n1. create an ReST file with the following contents:\n   \n   .. -- coding: utf-8 --\nTest\nTest\néèà\n\n1. run landslide input.rst\n2. you will get the following message:\n\nAdding   input.rst (restructuredtext)\nError: 'ascii' codec can't decode byte 0xc3 in position 74: ordinal not in range(128)\n. Grrr Markdown does not like opening php tags:\n\n\nSome test:\n\n.. code-block:: php\n\n    <?php\n    echo 'hello world'\n    >\n\n.. highlightlang:: php\n\n    <?php\n    echo 'hello world'\n    >\n\n. ",
    "olivierverdier": "Thanks!\n. Hi, I'm the one who fixed the unicode bug with rst. I may have broken the support for non unicode sources... I agree with n1k0 that the html produced should always be utf-8 encoded. Much simpler to handle, imho.\n. I think I have a better solution in pull-request #24. For the record, the name of utf-8 encoding in the codecs module is utf_8 (http://docs.python.org/library/codecs.html#standard-encodings). But other aliases as utf8 are accepted as well.\n. Mmmh, why not use standard rst syntax here? I believe the standard way around this is to use a syntax like:\n    .. code-block:: python\nsome code here\nBesides, if i'm not mistaken, it's already in the pygment repo.\nDid I miss something here?\n. I did it in my branch (commit olivierverdier/landslide@d04f0961d2c3cdffb15a64cc22193ff54e9cd800). I think it's cleaner to use rst directives. I use the code in the pygment repo out of the box, and used the same directive name they use, which is sourcecode.\n. I don't think that there is an official name for that directive. I just took the one from the pygment repository, which uses sourcecode.\nI totally agree to change the name to code-block if that achieves a better consensus. (We could also have an alias, i.e., both names working the same, as is done for example there)\n. Here you go: olivierverdier/landslide@36cdc3603a4f838c83cd0b15a465bb8390960914\n. Haha, that's a big pull request indeed. Part of the mess is because I had cherry-picked some of your commits in my branch, so they appear twice now. Sorry for that... :-/\n. My opinion: use rst directives to output precisely the html we want instead of tweaking the current docutils html mode with regex... rst is way more powerful and customizable than markdown, so it would be a pity not to support it... :-/\n. I see that it was not clear enough: I was suggesting to take a look at this when I have a chance (do I have to sign with my blood? :-P). It does not mean that others shouldn't. I'm neither an expert in rst nor in landslide.\nAlso, that's a sizeable refactoring, so it won't happen overnight.\n. Thanks!\n. Hi, I'm the one who fixed the unicode bug with rst. I may have broken the support for non unicode sources... I agree with n1k0 that the html produced should always be utf-8 encoded. Much simpler to handle, imho.\n. I think I have a better solution in pull-request #24. For the record, the name of utf-8 encoding in the codecs module is utf_8 (http://docs.python.org/library/codecs.html#standard-encodings). But other aliases as utf8 are accepted as well.\n. Mmmh, why not use standard rst syntax here? I believe the standard way around this is to use a syntax like:\n    .. code-block:: python\nsome code here\nBesides, if i'm not mistaken, it's already in the pygment repo.\nDid I miss something here?\n. I did it in my branch (commit olivierverdier/landslide@d04f0961d2c3cdffb15a64cc22193ff54e9cd800). I think it's cleaner to use rst directives. I use the code in the pygment repo out of the box, and used the same directive name they use, which is sourcecode.\n. I don't think that there is an official name for that directive. I just took the one from the pygment repository, which uses sourcecode.\nI totally agree to change the name to code-block if that achieves a better consensus. (We could also have an alias, i.e., both names working the same, as is done for example there)\n. Here you go: olivierverdier/landslide@36cdc3603a4f838c83cd0b15a465bb8390960914\n. Haha, that's a big pull request indeed. Part of the mess is because I had cherry-picked some of your commits in my branch, so they appear twice now. Sorry for that... :-/\n. My opinion: use rst directives to output precisely the html we want instead of tweaking the current docutils html mode with regex... rst is way more powerful and customizable than markdown, so it would be a pity not to support it... :-/\n. I see that it was not clear enough: I was suggesting to take a look at this when I have a chance (do I have to sign with my blood? :-P). It does not mean that others shouldn't. I'm neither an expert in rst nor in landslide.\nAlso, that's a sizeable refactoring, so it won't happen overnight.\n. ",
    "millette": "Thanks for looking at this, n1k0.\nI'm far from a python native. But I am a firm believer in UTF-8. When I tested an iso-8859-1 file with the --encoding option, I noticed the html output with in fact iso-8859-1 but the meta tag for content-type pretended it was utf-8.\nAlso, first time I actually use github to fork and patch something. Hope I'm not causing too much trouble :)\nI tested with passing no encoding option, utf8, utf-8, and iso-8859-1 with corresponding input files and it all worked as expected.\n. I noticed that too when I discovered landslide. Found this:\nhttp://pygments.org/docs/rstdirective/\nIt was easier for me at that moment to create a .cfg file and put the code to be syntax highlighted into an .md file, seperate from my usual .rst source.\n. Thanks for looking at this, n1k0.\nI'm far from a python native. But I am a firm believer in UTF-8. When I tested an iso-8859-1 file with the --encoding option, I noticed the html output with in fact iso-8859-1 but the meta tag for content-type pretended it was utf-8.\nAlso, first time I actually use github to fork and patch something. Hope I'm not causing too much trouble :)\nI tested with passing no encoding option, utf8, utf-8, and iso-8859-1 with corresponding input files and it all worked as expected.\n. I noticed that too when I discovered landslide. Found this:\nhttp://pygments.org/docs/rstdirective/\nIt was easier for me at that moment to create a .cfg file and put the code to be syntax highlighted into an .md file, seperate from my usual .rst source.\n. ",
    "ptitmain": "Are you sure that sourcecode is an official directive ? Because I use rst2pdf tools that uses the code-block directive. This directive is no more an official one. I tested the sourcecode directive and rst2pdf does not understand it. I suspect the ReST specification not to have any \"block of source code\" directive...\nNevertheless, I can easily search/replace my code-block directives into sourcecode ones before using landslide.\n. Yes you fixed it !\nIt works fine now with code-block directives.\n. fixed in n1k0's branch.\n. Align directives are not parsed neither...\n\n.. image:: images/arrays.png\n     :align: center\n\n. > I just implemented support for the :align: directive.\n\nThe width and height directives work, but you have you put spaces\nafter the image line. Same with :align:.\nThanks for reporting these issues.\n\nAre you sure it works ?\nI cloned the master's git branch and reinstalled landslide. Then,\nrecompiling my rst file does not align or resize my image. My rst\ncontains:\nJFL - |date|\n.. image:: ensi.png\n   :align: center\n   :width:  30%\nI saw that in the CSS there is:\nsection img.align-center {\n  display: block;\n  margin-left: auto;\n  margin-right: auto;\n}\nbut the generated html is:\n slide source: test.rst \n```\n  \n\n\n    <header><h1>Développement sous Android</h1></header>\n\n\n\n    <section><p><strong>JFL</strong> - July\n\n```\n2011 \n</div>\nAm I missing something ?\n. > Ok it should be fixed now.\nWorks fine !\nThanks !\n. In fact, even if a typical landslide user does not want to produce a course material, I think that it is annoying to put ---- between each slide... But maybe it breaks a fundamental assumption of landslide which is that the user is in charge to decide where are the breaks :)\n. Yes it is a restructured text directive that asks to put a TOC inside the text width depth 1 (the depth is relative to the place of the directive).\nThe text of the TOC is generated well but the links are pointing to slides that do not exist, for example:\n\nfile:///home/jf/swap/presentation.html#second-slide\n\nI have also some troubles with the TOC generated to navigate into the presentation (maybe relative to this problem ?).\n. If you test the example I gave above, you will see that the landslide toc (hitting \"t\" to make appear the toc) is not usable. I think that the ..contents breaks something somewhere because the links are #id1 and #id2 instead of #slide1 and #slide2.\n. I confirm that relative paths works well !! Thanks a lot n1k0 !\n. Erf, it seems to be ok for the small test file I have built, but not for my whole presentation.\nYou can use this presentation to see the problem appear again:\nhttp://dl.free.fr/ohO0nicdW\n. I confirm that the patch of charleso works fine :)\nThanks !\n. It does not work: it includes the \":include:\" directive as a raw text.\n. Not working there. I just re-tested with the current landslide version (1.0.1). I checked that a TAB is put before :include: and I have no blank line between code-block and include. I always have \":4: (ERROR/3) Content block expected for the \"code-block\" directive; none found.\"... Could you post an example of test file somewhere ?\n. Are you sure that sourcecode is an official directive ? Because I use rst2pdf tools that uses the code-block directive. This directive is no more an official one. I tested the sourcecode directive and rst2pdf does not understand it. I suspect the ReST specification not to have any \"block of source code\" directive...\nNevertheless, I can easily search/replace my code-block directives into sourcecode ones before using landslide.\n. Yes you fixed it !\nIt works fine now with code-block directives.\n. fixed in n1k0's branch.\n. Align directives are not parsed neither...\n\n.. image:: images/arrays.png\n     :align: center\n\n. > I just implemented support for the :align: directive.\n\nThe width and height directives work, but you have you put spaces\nafter the image line. Same with :align:.\nThanks for reporting these issues.\n\nAre you sure it works ?\nI cloned the master's git branch and reinstalled landslide. Then,\nrecompiling my rst file does not align or resize my image. My rst\ncontains:\nJFL - |date|\n.. image:: ensi.png\n   :align: center\n   :width:  30%\nI saw that in the CSS there is:\nsection img.align-center {\n  display: block;\n  margin-left: auto;\n  margin-right: auto;\n}\nbut the generated html is:\n slide source: test.rst \n```\n  \n\n\n    <header><h1>Développement sous Android</h1></header>\n\n\n\n    <section><p><strong>JFL</strong> - July\n\n```\n2011 \n</div>\nAm I missing something ?\n. > Ok it should be fixed now.\nWorks fine !\nThanks !\n. In fact, even if a typical landslide user does not want to produce a course material, I think that it is annoying to put ---- between each slide... But maybe it breaks a fundamental assumption of landslide which is that the user is in charge to decide where are the breaks :)\n. Yes it is a restructured text directive that asks to put a TOC inside the text width depth 1 (the depth is relative to the place of the directive).\nThe text of the TOC is generated well but the links are pointing to slides that do not exist, for example:\n\nfile:///home/jf/swap/presentation.html#second-slide\n\nI have also some troubles with the TOC generated to navigate into the presentation (maybe relative to this problem ?).\n. If you test the example I gave above, you will see that the landslide toc (hitting \"t\" to make appear the toc) is not usable. I think that the ..contents breaks something somewhere because the links are #id1 and #id2 instead of #slide1 and #slide2.\n. I confirm that relative paths works well !! Thanks a lot n1k0 !\n. Erf, it seems to be ok for the small test file I have built, but not for my whole presentation.\nYou can use this presentation to see the problem appear again:\nhttp://dl.free.fr/ohO0nicdW\n. I confirm that the patch of charleso works fine :)\nThanks !\n. It does not work: it includes the \":include:\" directive as a raw text.\n. Not working there. I just re-tested with the current landslide version (1.0.1). I checked that a TAB is put before :include: and I have no blank line between code-block and include. I always have \":4: (ERROR/3) Content block expected for the \"code-block\" directive; none found.\"... Could you post an example of test file somewhere ?\n. ",
    "mitechie": "Just to toss on, when I hit these I thought to try the :class: directive so I could just override the styles a bit on the resulting presentation, but that's not applied to the img tag either.\n. Just to toss on, when I hit these I thought to try the :class: directive so I could just override the styles a bit on the resulting presentation, but that's not applied to the img tag either.\n. ",
    "maruel": "You reverted back the change in https://github.com/adamzap/landslide/commit/1b2268c75fb9ddffadf7c8871b8477c6d613316d#diff-6 , was this intended?\n. You reverted back the change in https://github.com/adamzap/landslide/commit/1b2268c75fb9ddffadf7c8871b8477c6d613316d#diff-6 , was this intended?\n. ",
    "BestFriendChris": "Nope. I'm fine doing it. The only thing is my CSS skills suck, so I could probably use some help getting the presenter view to look nice, especially on other browsers.\nOne thing. What would be a good shortcut key for it? I did '4' mostly because I couldn't be bothered to look up keycodes. :-)\n. Here you go. It's not the prettiest bell at the ball, but it seems to work well.\nOne odd problem I ran into is on Chrome (on my mac) it is automatically sending the keydown event to the new window. I wanted 'p' to toggle the presenter view in both windows, but with this bug it closes immediately after opening. Not sure what's happening. For now I just ignore the event from the presenter view, so you have to close it manually. Not a big deal, but I thought you might have some ideas.\n. Yeah, that was my intention. At work we tend to have a lot of content in the presenter notes. Having the entirety of markdown (for lists, headers, code, etc) is way useful. That being said, we definitely don't need it to be a header. Anything we can use as a marker to differentiate between the slide and the notes section would work.\n. The only reason I didn't go the Macro route was because it seemed wrong to include the presenter notes within the 'inner' content div (much like how the footer exists outside of that div as well). Maybe a more generic solution would be to have the Macro (or a different type of Macro) support taking & returning the slide_vars directly. That way it could return a new 'presenter_notes' var and remove it from the 'content' var.\nIf you don't think it's a big deal no include it in the 'inner' div, let me know. I could probably be convinced of that fairly easily.\nThoughts?\n. Looks good to me.\n. I think there are 2 things we could do related to choosing macros:\n- Move all the optional macros (like QR) to the themes directory (as per issue #45). If you don't what a particular macro, you could just make your own theme.\n- Add another setting to the config file that is a list of macro files to load.\nEither one would also solve the other goal I have: be able to write new macros without having to commit to the landslide codebase\n. The problem is that sometimes a macro has an impact on layout. Take the presenter view as an example. That required additions to the HTML, CSS, and JS.\nAnother example: I put my résumé in a landslide slideshow (http://bestfriendchris.github.com/resume). I'd like to add a macro that has first level slides be laid out vertically while sub-slides be laid out horizontally. I don't really believe this belongs in stock landslide, but I'd like to include it in my own project. This will definitely require HTML, CSS, & JS changes...\n. Nope. I'm fine doing it. The only thing is my CSS skills suck, so I could probably use some help getting the presenter view to look nice, especially on other browsers.\nOne thing. What would be a good shortcut key for it? I did '4' mostly because I couldn't be bothered to look up keycodes. :-)\n. Here you go. It's not the prettiest bell at the ball, but it seems to work well.\nOne odd problem I ran into is on Chrome (on my mac) it is automatically sending the keydown event to the new window. I wanted 'p' to toggle the presenter view in both windows, but with this bug it closes immediately after opening. Not sure what's happening. For now I just ignore the event from the presenter view, so you have to close it manually. Not a big deal, but I thought you might have some ideas.\n. Yeah, that was my intention. At work we tend to have a lot of content in the presenter notes. Having the entirety of markdown (for lists, headers, code, etc) is way useful. That being said, we definitely don't need it to be a header. Anything we can use as a marker to differentiate between the slide and the notes section would work.\n. The only reason I didn't go the Macro route was because it seemed wrong to include the presenter notes within the 'inner' content div (much like how the footer exists outside of that div as well). Maybe a more generic solution would be to have the Macro (or a different type of Macro) support taking & returning the slide_vars directly. That way it could return a new 'presenter_notes' var and remove it from the 'content' var.\nIf you don't think it's a big deal no include it in the 'inner' div, let me know. I could probably be convinced of that fairly easily.\nThoughts?\n. Looks good to me.\n. I think there are 2 things we could do related to choosing macros:\n- Move all the optional macros (like QR) to the themes directory (as per issue #45). If you don't what a particular macro, you could just make your own theme.\n- Add another setting to the config file that is a list of macro files to load.\nEither one would also solve the other goal I have: be able to write new macros without having to commit to the landslide codebase\n. The problem is that sometimes a macro has an impact on layout. Take the presenter view as an example. That required additions to the HTML, CSS, and JS.\nAnother example: I put my résumé in a landslide slideshow (http://bestfriendchris.github.com/resume). I'd like to add a macro that has first level slides be laid out vertically while sub-slides be laid out horizontally. I don't really believe this belongs in stock landslide, but I'd like to include it in my own project. This will definitely require HTML, CSS, & JS changes...\n. ",
    "ghost": "As I like Ruby best, I can't really help you, sorry.\n\nCheers, Benedikt 'linopolus' Müller\nSent from my iPod Touch.\nOn 13.05.2011, at 05:28, adamzap\nreply@reply.github.com\nwrote:\n\nYeah, this is a great idea. Could you recommend a python module for landslide to use? I guess the textile module is the obvious choice...\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/issues/47#comment_1150726\n. The solution is to this (with optional line-numbering):\n\n.. include:: tes.h\n        :code: c++\n        :number-lines:\nWhich produces:\n\nMore options: http://docutils.sourceforge.net/docs/ref/rst/directives.html#code\n\nUsing rst2html.py (Docutils 0.12 [release], Python 2.7.6, on linux2)\n. Have the same problem and I'm also interested in a solution, but issue #111 does raise the same question, so i guess there is none at the moment.\n. OS: Windows 7\nPython Version: python 2.7.8\nLandslide version: 1.1.3\nTest filename: 我的测试文件.md\n```\nLandslide\n\nOverview\nGenerate HTML5 slideshows from markdown, ReST, or textile.\n\nLandslide is primarily written in Python, but it's themes use:\n\nHTML5\nJavascript\nCSS\n\n\nCode Sample\nLandslide supports code snippets\n!python\ndef log(self, message, level='notice'):\n    if self.logger and not callable(self.logger):\n        raise ValueError(u\"Invalid logger set, must be a callable\")\n\n    if self.verbose and self.logger:\n        self.logger(message, level)\n\n```\nWhen input the command landslide.exe ./我的测试文件.md in the CMD will occur the following error:\n\nError: 'ascii' codec can't decode byte 0xb2 in position 2: ordinal not in range(128)\n. As I like Ruby best, I can't really help you, sorry.\n\n\nCheers, Benedikt 'linopolus' Müller\nSent from my iPod Touch.\nOn 13.05.2011, at 05:28, adamzap\nreply@reply.github.com\nwrote:\n\nYeah, this is a great idea. Could you recommend a python module for landslide to use? I guess the textile module is the obvious choice...\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/issues/47#comment_1150726\n. The solution is to this (with optional line-numbering):\n\n.. include:: tes.h\n        :code: c++\n        :number-lines:\nWhich produces:\n\nMore options: http://docutils.sourceforge.net/docs/ref/rst/directives.html#code\n\nUsing rst2html.py (Docutils 0.12 [release], Python 2.7.6, on linux2)\n. Have the same problem and I'm also interested in a solution, but issue #111 does raise the same question, so i guess there is none at the moment.\n. OS: Windows 7\nPython Version: python 2.7.8\nLandslide version: 1.1.3\nTest filename: 我的测试文件.md\n```\nLandslide\n\nOverview\nGenerate HTML5 slideshows from markdown, ReST, or textile.\n\nLandslide is primarily written in Python, but it's themes use:\n\nHTML5\nJavascript\nCSS\n\n\nCode Sample\nLandslide supports code snippets\n!python\ndef log(self, message, level='notice'):\n    if self.logger and not callable(self.logger):\n        raise ValueError(u\"Invalid logger set, must be a callable\")\n\n    if self.verbose and self.logger:\n        self.logger(message, level)\n\n```\nWhen input the command landslide.exe ./我的测试文件.md in the CMD will occur the following error:\n\nError: 'ascii' codec can't decode byte 0xb2 in position 2: ordinal not in range(128)\n. \n",
    "guanix": "I just tried on an iPhone, and I was not able to arbitrarily bring up a keyboard input in Safari or iCab. Am I missing something?\nA menu could be nice, maybe triggered by a gesture.\n. I just tried on an iPhone, and I was not able to arbitrarily bring up a keyboard input in Safari or iCab. Am I missing something?\nA menu could be nice, maybe triggered by a gesture.\n. ",
    "vicaya": "Any progress on this issue? My main problem is that the swipe doesn't work very well on both iphone 4 and ipad 2. While swiping left and right seem to change the slide number. The current slide is not shown. Only the last slide shows.\n. Any progress on this issue? My main problem is that the swipe doesn't work very well on both iphone 4 and ipad 2. While swiping left and right seem to change the slide number. The current slide is not shown. Only the last slide shows.\n. ",
    "larsks": "I've just tried accessing a presentation from an iPad, and not only am I unable to control it, but only the \"top-level\" slides displayed.\n. I just got bit by this bug, too:\nError: sub() takes at most 4 arguments (5 given)\nI'm not sure which version this is, but I did \"pip install landslide\" a few minutes ago.\n. That seems to fix the problem.  Thanks!\n. I've just tried accessing a presentation from an iPad, and not only am I unable to control it, but only the \"top-level\" slides displayed.\n. I just got bit by this bug, too:\nError: sub() takes at most 4 arguments (5 given)\nI'm not sure which version this is, but I did \"pip install landslide\" a few minutes ago.\n. That seems to fix the problem.  Thanks!\n. ",
    "sdouche": "@adamzap when you click on the laser button, Landslide reload the presentation. Freeze means to un-set the keycode (no action).\n. @adamzap when you click on the laser button, Landslide reload the presentation. Freeze means to un-set the keycode (no action).\n. ",
    "blocke": "One commit undoes the other.  Am I missing something?\n. Replaced by #59.\n. This is a duplicate of issue #57.\nhttps://github.com/adamzap/landslide/issues/57\n. One commit undoes the other.  Am I missing something?\n. Replaced by #59.\n. This is a duplicate of issue #57.\nhttps://github.com/adamzap/landslide/issues/57\n. ",
    "kivaturi": "That makes a lot of sense...I was sure it would have been that trivial :) \nHappy to say that my first \"Hello World\" presentation is up and running and can't wait \nto build more on them. \nThanks adamzap...you've been of great help. \n. That makes a lot of sense...I was sure it would have been that trivial :) \nHappy to say that my first \"Hello World\" presentation is up and running and can't wait \nto build more on them. \nThanks adamzap...you've been of great help. \n. ",
    "c00kiemon5ter": "That'd be nice, I think. +1\n. That'd be nice, I think. +1\n. ",
    "davidedelvento": "Yes, that would be nice, especially if one can make bullets (lists), which at present work but they are kind of broken\n. Yes, that would be nice, especially if one can make bullets (lists), which at present work but they are kind of broken\n. ",
    "shirou": "oh, I couldn't find it from the title. sorry. \n. oh, I couldn't find it from the title. sorry. \n. ",
    "pagles": "Yes I am seeing the \"Presenter Notes\" h1 element even though no notes are present without pressing p (the title also overlays with my presentation's title probably because they are both h1 elements?). This is surely a quick workaround since I just wanted my slides ready a few hours later. It 's been appearing on both Mac OSX and Ubuntu 11.04 using Google Chrome.\n. This was the actual presentation I was preparing (rst though, not md) https://bitbucket.org/pagles/presentations/src/d09e3591ca91/pygr_1307_dojo/slides/py_code_dojo.rst\nThe md example you posted works fine and is quite cool also now that it's the first time I managed to see presenter notes - me envies :)\n. Yes I am seeing the \"Presenter Notes\" h1 element even though no notes are present without pressing p (the title also overlays with my presentation's title probably because they are both h1 elements?). This is surely a quick workaround since I just wanted my slides ready a few hours later. It 's been appearing on both Mac OSX and Ubuntu 11.04 using Google Chrome.\n. This was the actual presentation I was preparing (rst though, not md) https://bitbucket.org/pagles/presentations/src/d09e3591ca91/pygr_1307_dojo/slides/py_code_dojo.rst\nThe md example you posted works fine and is quite cool also now that it's the first time I managed to see presenter notes - me envies :)\n. ",
    "reagle": "On Thursday, July 14, 2011, adamzap wrote:\n\nI don't see the BOM being rendered in the test file you sent me. Can you explain a little more maybe? Or include a screenshot?\n\nBOM's aren't typically visually rendered by editors -- which makes them so confusing. But will interfere with string tests and parsing. So u'\\ufeff# Heading' on the first line will not be seen as a heading.\n\nAlso, wouldn't codecs.BOM be a better way to do this?\n\nSure, if you don't mind the dependency:\ntext = text.lstrip(unicode(codecs.BOM_UTF8, \"utf8\"))\n. On Saturday, July 16, 2011, adamzap wrote:\n\nI'm still having trouble reproducing this error. I don't see anything in my editor or in the rendered presentation. I diffed a presentation output file with and without your patch that was made with your test.md file, and I got no differences.\n\nBOM stuff is a PITA. If you loaded it in the editor first, it might have automagically removed it. Or, perhaps it got dropped when I encoded the email attachment. (Can you add a BOM with your editor?)\nSo let's start from the start. I've attached a zip file with mdn files with and without a BOM.\nCan you replicate the following?\n```\nurd:/home/reagle/tmp> unzip BOM-tests.zip \nArchive:  BOM-tests.zip\n  inflating: 0714-casper-with-BOM.mdn\n  inflating: 0714-casper-without-BOM.mdn\nurd:/home/reagle/tmp> ls -l\ntotal 32\n-rw-rw-r-- 1 reagle reagle   898 2011-07-16 08:10 0714-casper-with-BOM.mdn\n-rw-rw-r-- 1 reagle reagle   895 2011-07-16 08:11 0714-casper-without-BOM.mdn\n-rw-rw-r-- 1 reagle reagle  1355 2011-07-16 08:13 BOM-tests.zip\nurd:/home/reagle/tmp> md5sum 0714-casper-with-BOM.mdn\nf7d9982f3340bbf6873bffa2798d3404  0714-casper-with-BOM.mdn\nurd:/home/reagle/tmp> md5sum 0714-casper-without-BOM.mdn\ne76081e8e2f60bf7f2527a23cf224d51  0714-casper-without-BOM.mdn\n```\n. Sorry, trying again.\n. On Thursday, July 14, 2011, adamzap wrote:\n\nI don't see the BOM being rendered in the test file you sent me. Can you explain a little more maybe? Or include a screenshot?\n\nBOM's aren't typically visually rendered by editors -- which makes them so confusing. But will interfere with string tests and parsing. So u'\\ufeff# Heading' on the first line will not be seen as a heading.\n\nAlso, wouldn't codecs.BOM be a better way to do this?\n\nSure, if you don't mind the dependency:\ntext = text.lstrip(unicode(codecs.BOM_UTF8, \"utf8\"))\n. On Saturday, July 16, 2011, adamzap wrote:\n\nI'm still having trouble reproducing this error. I don't see anything in my editor or in the rendered presentation. I diffed a presentation output file with and without your patch that was made with your test.md file, and I got no differences.\n\nBOM stuff is a PITA. If you loaded it in the editor first, it might have automagically removed it. Or, perhaps it got dropped when I encoded the email attachment. (Can you add a BOM with your editor?)\nSo let's start from the start. I've attached a zip file with mdn files with and without a BOM.\nCan you replicate the following?\n```\nurd:/home/reagle/tmp> unzip BOM-tests.zip \nArchive:  BOM-tests.zip\n  inflating: 0714-casper-with-BOM.mdn\n  inflating: 0714-casper-without-BOM.mdn\nurd:/home/reagle/tmp> ls -l\ntotal 32\n-rw-rw-r-- 1 reagle reagle   898 2011-07-16 08:10 0714-casper-with-BOM.mdn\n-rw-rw-r-- 1 reagle reagle   895 2011-07-16 08:11 0714-casper-without-BOM.mdn\n-rw-rw-r-- 1 reagle reagle  1355 2011-07-16 08:13 BOM-tests.zip\nurd:/home/reagle/tmp> md5sum 0714-casper-with-BOM.mdn\nf7d9982f3340bbf6873bffa2798d3404  0714-casper-with-BOM.mdn\nurd:/home/reagle/tmp> md5sum 0714-casper-without-BOM.mdn\ne76081e8e2f60bf7f2527a23cf224d51  0714-casper-without-BOM.mdn\n```\n. Sorry, trying again.\n. ",
    "jondkoon": "Great. I will work on it. When are you planning to do the 1.0 release?\nFor my class I customized the tango theme and added some javascript that allows the code divs to be eval'ed. The code has access to a global \"print()\" function that will dump its output in the div next to the code. Here is an example:\nhttp://jondkoon.com/circus/material/week2/presentation.html#slide11\n. Well I don't think I will have it ready for you by the 1.0 release. I'll let you know.\n. Just sent the pull request. Hopefully I got it in for the 1.0 release.\n. I have been using this to prepare a presentation and just uncovered some bugs. \n- The table of contents doesn't get reset on every run\n- The slide count doesn't get reset on every run\nThis results in really high slide numbers and a repetitive table of contents\nI will look into these, so I don't recommend merging this in quite yet.\n. I have fixed the table of contents and slide numbers bugs.\nDo you have any feedback on this adamzap?\nthanks.\n.  Just simulated a run using a near identical command ./main.py -w ~/Desktop/test.md \nAnd it worked. I am on python 2.7.1 . I would hate for that to be the reason. I'll test with a virtual environment.\n. I think it would be fine to tell them just to install watchdog. \nIt is a nice to have feature rather than a requirement.\nFYI:\nYou'll notice that I set recursive to \"true\" when I schedule the observer in watcher.py. This is because of this issue:\nhttps://github.com/gorakhargosh/pathtools/pull/1\nThat is a little concerning that he hasn't touched that project since February. \nWatchdog itself looks pretty active though:\nhttps://github.com/gorakhargosh/watchdog\n. I use vim too.\n. Just tested on python 2.7.2 and it works fine for me.\n. Great. I will work on it. When are you planning to do the 1.0 release?\nFor my class I customized the tango theme and added some javascript that allows the code divs to be eval'ed. The code has access to a global \"print()\" function that will dump its output in the div next to the code. Here is an example:\nhttp://jondkoon.com/circus/material/week2/presentation.html#slide11\n. Well I don't think I will have it ready for you by the 1.0 release. I'll let you know.\n. Just sent the pull request. Hopefully I got it in for the 1.0 release.\n. I have been using this to prepare a presentation and just uncovered some bugs. \n- The table of contents doesn't get reset on every run\n- The slide count doesn't get reset on every run\nThis results in really high slide numbers and a repetitive table of contents\nI will look into these, so I don't recommend merging this in quite yet.\n. I have fixed the table of contents and slide numbers bugs.\nDo you have any feedback on this adamzap?\nthanks.\n.  Just simulated a run using a near identical command ./main.py -w ~/Desktop/test.md \nAnd it worked. I am on python 2.7.1 . I would hate for that to be the reason. I'll test with a virtual environment.\n. I think it would be fine to tell them just to install watchdog. \nIt is a nice to have feature rather than a requirement.\nFYI:\nYou'll notice that I set recursive to \"true\" when I schedule the observer in watcher.py. This is because of this issue:\nhttps://github.com/gorakhargosh/pathtools/pull/1\nThat is a little concerning that he hasn't touched that project since February. \nWatchdog itself looks pretty active though:\nhttps://github.com/gorakhargosh/watchdog\n. I use vim too.\n. Just tested on python 2.7.2 and it works fine for me.\n. ",
    "charleso": "I think part of the problem is that there are unmatched empty 's at the end of some of the sections. I'll try to dig a little deeper...\n. Thanks Azu - works like a charm.\n. I think part of the problem is that there are unmatched empty 's at the end of some of the sections. I'll try to dig a little deeper...\n. Thanks Azu - works like a charm.\n. ",
    "piezas": "Sorry.  Integrating the python module with google's hosting service that operates, among other things, python.  The idea being: write in markup, return as html as a webservice.\nhttp://code.google.com/appengine/docs/python/overview.html\n. i believe i've worked it out.  it required installing markdown and jinja2 in addition.  and removing subprocess and other filesystem dependencies for operation.  thanks!\n. Sorry.  Integrating the python module with google's hosting service that operates, among other things, python.  The idea being: write in markup, return as html as a webservice.\nhttp://code.google.com/appengine/docs/python/overview.html\n. i believe i've worked it out.  it required installing markdown and jinja2 in addition.  and removing subprocess and other filesystem dependencies for operation.  thanks!\n. ",
    "azu": "I modify slide.js and solved it.\ncase 37: // left arrow\n        case 33: // page up\n            event.preventDefault();// <= add\n            prevSlide();\n            break;\n        case 39: // right arrow\n        case 32: // space\n        case 34: // page down\n            event.preventDefault();// <= add\n            nextSlide();\n            break;\n. :+1: \n. I modify slide.js and solved it.\ncase 37: // left arrow\n        case 33: // page up\n            event.preventDefault();// <= add\n            prevSlide();\n            break;\n        case 39: // right arrow\n        case 32: // space\n        case 34: // page down\n            event.preventDefault();// <= add\n            nextSlide();\n            break;\n. :+1: \n. ",
    "vangale": "@godfat it might be that you are using Markdown? The reason I ask is because Python's reStructedText allows image embed already in headers with like this:\nThis is a header |imagex| with image\n.. |imagex| image:: some_image.png\n. @godfat it might be that you are using Markdown? The reason I ask is because Python's reStructedText allows image embed already in headers with like this:\nThis is a header |imagex| with image\n.. |imagex| image:: some_image.png\n. ",
    "godfat": "Yes, I'm using Markdown. Sorry for being unclear.\n. Yes, I'm using Markdown. Sorry for being unclear.\n. ",
    "3kwa": "Any intentions of including that patch into the landslide release?\n. Cool! Thank you, landslide is awesome.\nOn Mon, Apr 23, 2012 at 10:49 PM, Adam Zapletal\nreply@reply.github.com\nwrote:\n\nI'll do some testing with it today. Thanks!\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/pull/74#issuecomment-5280211\n\n\nEuGeNe -- follow me http://twitter.com/3kwa\n. Any intentions of including that patch into the landslide release?\n. Cool! Thank you, landslide is awesome.\nOn Mon, Apr 23, 2012 at 10:49 PM, Adam Zapletal\nreply@reply.github.com\nwrote:\n\nI'll do some testing with it today. Thanks!\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/adamzap/landslide/pull/74#issuecomment-5280211\n\n\nEuGeNe -- follow me http://twitter.com/3kwa\n. ",
    "maraujop": "Presenter notes are broken\nAfter trying to add presenter notes in a RST file using .note: keyword. I realized depending on many things rst parser generates different contents for the keyword. So I wasn't getting any content in the presenter view notes.\nI wanted to do multiline notes, with HTML support. I've done a fast hack, that you might not like, feel free to add support for this as you prefer, because I need a fix asap.\nNow RST notes are added doing:\n```\nnotes\n\n\nblablabla\nblablabla\n```\n\nand MD notes:\n```\nnotes\n\nblabla\nblabla\n```\n\nI'm taking for granted notes are the last bits of every slide, so I parse from the title <h1>notes</h1> till the end, I know it's not beautiful.\n. I just realized, after looking at the diff, you changed the way presenter notes are done to the same thing I have done, excepting your heading has to say presenter notes. I didn't even look at the regex as I thought it was broken.\nCould you please update the README? I've lost 2 hours playing with this, thanks.\n. You are right, I did it as a fast hack and didn't think about it. \nCheers\n. I lost some time with this in the past. \nYour notes need to be preceded by a heading that says the exact words \"Presenter Notes\". They also need to be at the end of the slide. Example:\n```\nPresenter Notes\nblablabla\n```\nRegards\n. The author is aware the docs are crap on that topic. He told me to open a pull request on that, I haven't had the time.\nI would leave this open...\n. Presenter notes are broken\nAfter trying to add presenter notes in a RST file using .note: keyword. I realized depending on many things rst parser generates different contents for the keyword. So I wasn't getting any content in the presenter view notes.\nI wanted to do multiline notes, with HTML support. I've done a fast hack, that you might not like, feel free to add support for this as you prefer, because I need a fix asap.\nNow RST notes are added doing:\n```\nnotes\n\n\nblablabla\nblablabla\n```\n\nand MD notes:\n```\nnotes\n\nblabla\nblabla\n```\n\nI'm taking for granted notes are the last bits of every slide, so I parse from the title <h1>notes</h1> till the end, I know it's not beautiful.\n. I just realized, after looking at the diff, you changed the way presenter notes are done to the same thing I have done, excepting your heading has to say presenter notes. I didn't even look at the regex as I thought it was broken.\nCould you please update the README? I've lost 2 hours playing with this, thanks.\n. You are right, I did it as a fast hack and didn't think about it. \nCheers\n. I lost some time with this in the past. \nYour notes need to be preceded by a heading that says the exact words \"Presenter Notes\". They also need to be at the end of the slide. Example:\n```\nPresenter Notes\nblablabla\n```\nRegards\n. The author is aware the docs are crap on that topic. He told me to open a pull request on that, I haven't had the time.\nI would leave this open...\n. ",
    "vbauer": ":+1: \n. Yes, ofc:\n- http://graphs.grevian.org/example\n- http://www.graphviz.org/Gallery.php\nI think it could be separate file or part of markdown file.\n. I used pip to install landslide.\nPython version:\ncmd\nC:\\Users\\vbauer>python\nPython 3.4.2 (v3.4.2:ab2c023a9432, Oct  6 2014, 22:16:31) [MSC v.1600 64 bit (AMD64)] on win32\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\nAdditional information:\ncmd\nC:\\Python34\\Lib\\site-packages>ls -la\ntotal 102\ndrwxr-xr-x   23 vbauer   Administ     8192 Nov 26 01:03 .\ndrwxr-xr-x  197 vbauer   Administ    40960 Nov 25 23:49 ..\ndrwxr-xr-x   10 vbauer   Administ     4096 Nov 26 00:23 Jinja2-2.7.3-py3.4.egg-info\ndrwxr-xr-x    7 vbauer   Administ     4096 Nov 26 00:23 Markdown-2.5.2-py3.4.egg-info\ndrwxr-xr-x    8 vbauer   Administ     4096 Nov 26 00:24 MarkupSafe-0.23-py3.4.egg-info\ndrwxr-xr-x    9 vbauer   Administ     4096 Nov 26 00:23 Pygments-2.0.1.dist-info\n-rw-r--r--    1 vbauer   Administ      121 Aug  3  2013 README.txt\ndrwxr-xr-x    4 vbauer   Administ        0 Nov 25 23:49 __pycache__\ndrwxr-xr-x    5 vbauer   Administ        0 Nov 25 23:49 _markerlib\ndrwxr-xr-x   17 vbauer   Administ        0 Nov 26 00:24 docutils\ndrwxr-xr-x    7 vbauer   Administ     4096 Nov 26 00:24 docutils-0.12-py3.4.egg-info\n-rw-r--r--    1 vbauer   Administ      126 Nov 25 23:49 easy_install.py\ndrwxr-xr-x   27 vbauer   Administ     4096 Nov 26 00:23 jinja2\ndrwxr-xr-x   13 vbauer   Administ     4096 Nov 26 00:58 landslide\ndrwxr-xr-x   10 vbauer   Administ     4096 Nov 26 00:23 landslide-1.1.1-py3.4.egg-info\ndrwxr-xr-x   16 vbauer   Administ     4096 Nov 26 00:23 markdown\ndrwxr-xr-x    9 vbauer   Administ     4096 Nov 26 00:24 markupsafe\ndrwxr-xr-x   23 vbauer   Administ     4096 Nov 25 23:49 pip\ndrwxr-xr-x    9 vbauer   Administ     4096 Nov 25 23:49 pip-1.5.6.dist-info\n-rw-r--r--    1 vbauer   Administ    98631 Nov 25 23:49 pkg_resources.py\ndrwxr-xr-x   22 vbauer   Administ     4096 Nov 26 00:23 pygments\ndrwxr-xr-x   31 vbauer   Administ        0 Nov 25 23:49 setuptools\ndrwxr-xr-x   13 vbauer   Administ     4096 Nov 25 23:49 setuptools-2.1.dist-info\n. In my theme I wanted to have only print.css (without screen.css), but got the following error:\n➜  Lecture 18 - Geo git:(master) ✗ landslide lecture.md -i -t theme -d presentation.pdf\nCopying theme theme directory to /Users/vbauer/Documents/workspace/java/internship-lectures/test/Lecture 18 - Geo/theme\nAdding   lecture.md (markdown)\nEmbedded image img/GoogleApiClient.png\nEmbedded image img/geoDialog.png\nEmbedded image img/bubble_simple.png\nEmbedded image img/bubble_custom.png\nNo screen stylesheet provided in current theme\nError: 'dict object' has no attribute 'screen'\n. @adamzap I added a blank screen.css and it helped to resolve this problem. Thank you for information.\n. :+1: \n. Yes, ofc:\n- http://graphs.grevian.org/example\n- http://www.graphviz.org/Gallery.php\nI think it could be separate file or part of markdown file.\n. I used pip to install landslide.\nPython version:\ncmd\nC:\\Users\\vbauer>python\nPython 3.4.2 (v3.4.2:ab2c023a9432, Oct  6 2014, 22:16:31) [MSC v.1600 64 bit (AMD64)] on win32\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\nAdditional information:\ncmd\nC:\\Python34\\Lib\\site-packages>ls -la\ntotal 102\ndrwxr-xr-x   23 vbauer   Administ     8192 Nov 26 01:03 .\ndrwxr-xr-x  197 vbauer   Administ    40960 Nov 25 23:49 ..\ndrwxr-xr-x   10 vbauer   Administ     4096 Nov 26 00:23 Jinja2-2.7.3-py3.4.egg-info\ndrwxr-xr-x    7 vbauer   Administ     4096 Nov 26 00:23 Markdown-2.5.2-py3.4.egg-info\ndrwxr-xr-x    8 vbauer   Administ     4096 Nov 26 00:24 MarkupSafe-0.23-py3.4.egg-info\ndrwxr-xr-x    9 vbauer   Administ     4096 Nov 26 00:23 Pygments-2.0.1.dist-info\n-rw-r--r--    1 vbauer   Administ      121 Aug  3  2013 README.txt\ndrwxr-xr-x    4 vbauer   Administ        0 Nov 25 23:49 __pycache__\ndrwxr-xr-x    5 vbauer   Administ        0 Nov 25 23:49 _markerlib\ndrwxr-xr-x   17 vbauer   Administ        0 Nov 26 00:24 docutils\ndrwxr-xr-x    7 vbauer   Administ     4096 Nov 26 00:24 docutils-0.12-py3.4.egg-info\n-rw-r--r--    1 vbauer   Administ      126 Nov 25 23:49 easy_install.py\ndrwxr-xr-x   27 vbauer   Administ     4096 Nov 26 00:23 jinja2\ndrwxr-xr-x   13 vbauer   Administ     4096 Nov 26 00:58 landslide\ndrwxr-xr-x   10 vbauer   Administ     4096 Nov 26 00:23 landslide-1.1.1-py3.4.egg-info\ndrwxr-xr-x   16 vbauer   Administ     4096 Nov 26 00:23 markdown\ndrwxr-xr-x    9 vbauer   Administ     4096 Nov 26 00:24 markupsafe\ndrwxr-xr-x   23 vbauer   Administ     4096 Nov 25 23:49 pip\ndrwxr-xr-x    9 vbauer   Administ     4096 Nov 25 23:49 pip-1.5.6.dist-info\n-rw-r--r--    1 vbauer   Administ    98631 Nov 25 23:49 pkg_resources.py\ndrwxr-xr-x   22 vbauer   Administ     4096 Nov 26 00:23 pygments\ndrwxr-xr-x   31 vbauer   Administ        0 Nov 25 23:49 setuptools\ndrwxr-xr-x   13 vbauer   Administ     4096 Nov 25 23:49 setuptools-2.1.dist-info\n. In my theme I wanted to have only print.css (without screen.css), but got the following error:\n➜  Lecture 18 - Geo git:(master) ✗ landslide lecture.md -i -t theme -d presentation.pdf\nCopying theme theme directory to /Users/vbauer/Documents/workspace/java/internship-lectures/test/Lecture 18 - Geo/theme\nAdding   lecture.md (markdown)\nEmbedded image img/GoogleApiClient.png\nEmbedded image img/geoDialog.png\nEmbedded image img/bubble_simple.png\nEmbedded image img/bubble_custom.png\nNo screen stylesheet provided in current theme\nError: 'dict object' has no attribute 'screen'\n. @adamzap I added a blank screen.css and it helped to resolve this problem. Thank you for information.\n. ",
    "nashamri": ":+1:\nI think this PR should be merged.\n. :+1:\nI think this PR should be merged.\n. ",
    "mrallen1": "Don't have a strong preference, but I think using a dash is a good idea. It's a little less visually imposing than \"Untitled' but it's not quite as invisible as whitespace.\n. Don't have a strong preference, but I think using a dash is a good idea. It's a little less visually imposing than \"Untitled' but it's not quite as invisible as whitespace.\n. ",
    "regebro": "Aha! And that works in RST as well (I prefer RST). So it's a documentation bug then. I guess this change was done to fix the multiline notes bug I saw elsewhere. :-)\n. Ah, no, \"Notes\" and \"Presenter notes\" are different things. Now I see. \n. Aha! And that works in RST as well (I prefer RST). So it's a documentation bug then. I guess this change was done to fix the multiline notes bug I saw elsewhere. :-)\n. Ah, no, \"Notes\" and \"Presenter notes\" are different things. Now I see. \n. ",
    "eichin": "It's not a feature of markdown itself, it's a feature of the python markdown library; pydoc markdown.extensions gives (for me, on ubuntu precise)\nabbr\nattr_list\ncodehilite\ndef_list\nextra\nfenced_code\nfootnotes\nheaderid\nhtml_tidy\nmeta\nnl2br\nrss\nsmart_strong\ntables\ntoc\nwikilinks\nNote that passing -x rss horribly mangles your output, since it drops some rss in the middle of the html :-) Looks like there's provision for writing new ones just by having mdx_name.py in your PYTHONPATH, but I haven't tried that.\n. (oh, indirectly via issue #42 http://pythonhosted.org/Markdown/extensions/index.html has pointers to documentation for each of them.  A good example might be \"Pass -x toc and put [TOC] on a slide by itself to get a table of contents\" (except that it's not smart enough to split slides or anything...) \n. Since the only connection to URLs is that get_path_url calls it (with a filesystem path), it really looks like this should just be os.path.relpath; looking at the source, it clearly tries harder (splits on os.path.sep among other things) but I don't have Windows to test it on...\n. It's not a feature of markdown itself, it's a feature of the python markdown library; pydoc markdown.extensions gives (for me, on ubuntu precise)\nabbr\nattr_list\ncodehilite\ndef_list\nextra\nfenced_code\nfootnotes\nheaderid\nhtml_tidy\nmeta\nnl2br\nrss\nsmart_strong\ntables\ntoc\nwikilinks\nNote that passing -x rss horribly mangles your output, since it drops some rss in the middle of the html :-) Looks like there's provision for writing new ones just by having mdx_name.py in your PYTHONPATH, but I haven't tried that.\n. (oh, indirectly via issue #42 http://pythonhosted.org/Markdown/extensions/index.html has pointers to documentation for each of them.  A good example might be \"Pass -x toc and put [TOC] on a slide by itself to get a table of contents\" (except that it's not smart enough to split slides or anything...) \n. Since the only connection to URLs is that get_path_url calls it (with a filesystem path), it really looks like this should just be os.path.relpath; looking at the source, it clearly tries harder (splits on os.path.sep among other things) but I don't have Windows to test it on...\n. ",
    "roktas": "There is a man page in the Debian package (python-landslide), which might be used directly, or as a starting point:\nhttps://github.com/00010011/landslide/blob/debian/debian/landslide.1\nAFAIK, setuptools does not provide a way to install manpages; so this might be a bit hairy.  See http://stackoverflow.com/questions/3657209/python-installing-man-pages-in-distutils-based-project\n. There is a man page in the Debian package (python-landslide), which might be used directly, or as a starting point:\nhttps://github.com/00010011/landslide/blob/debian/debian/landslide.1\nAFAIK, setuptools does not provide a way to install manpages; so this might be a bit hairy.  See http://stackoverflow.com/questions/3657209/python-installing-man-pages-in-distutils-based-project\n. ",
    "doherty": "Is setuptools the standard way to install python software? I find it hard to imagine that a mature toolchain wouldn't have a way to generate and install manpages as part of a basic installation process...\n. Is setuptools the standard way to install python software? I find it hard to imagine that a mature toolchain wouldn't have a way to generate and install manpages as part of a basic installation process...\n. ",
    "orsenthil": "can I plus 1 to that above issue?\n. can I plus 1 to that above issue?\n. ",
    "khorn": "+1\n. Would really like to see incremental rendering as well.\n. +1\n. Would really like to see incremental rendering as well.\n. ",
    "edgimar": "I've realized you can use the mouse-wheel, which should work reasonably well with a wireless mouse, so I'm closing this.  Using mouse click events might be more trouble than they're worth when you want to interact with a presentation slide.\n. I've realized you can use the mouse-wheel, which should work reasonably well with a wireless mouse, so I'm closing this.  Using mouse click events might be more trouble than they're worth when you want to interact with a presentation slide.\n. ",
    "littleask": "One suggestion:\ngive a tab space before your second line of code.\n. One suggestion:\ngive a tab space before your second line of code.\n. ",
    "metal3d": "Working here:\n``` rst\n.. code-block:: python\n   :include: test.py\n```\nwithout any problem. I was seeking how to include file in code-block and I found solution reading this issue... wich is finnaly not an issue :)\nEdit, you should not have any white line beetween code-block directive and include line, and use TAB space. Check if this is ok (v0.16 here)\n. Working here:\n``` rst\n.. code-block:: python\n   :include: test.py\n```\nwithout any problem. I was seeking how to include file in code-block and I found solution reading this issue... wich is finnaly not an issue :)\nEdit, you should not have any white line beetween code-block directive and include line, and use TAB space. Check if this is ok (v0.16 here)\n. ",
    "settermjd": "The following works for me:\n```rst\n.. code-block:: php\n:include: path/to/my/file.php\n```. The following works for me:\n```rst\n.. code-block:: php\n:include: path/to/my/file.php\n```. ",
    "stefanor": "That was a messy pull request for a quick talk I gave using this, involving a github demo. I should clean this up...\n. Doh, I was in a hurry and didn't figure that out.\nBetter examples for rst would help\n. That was a messy pull request for a quick talk I gave using this, involving a github demo. I should clean this up...\n. Doh, I was in a hurry and didn't figure that out.\nBetter examples for rst would help\n. ",
    "ackdesha": "Thanks for the feedback. Let me see if I can explain the issue better...\nIf the image isn't found in the following, then encoded_url is False:\nencoded_url = utils.encode_image_from_url(img_url, source)\nUsing False for encoded_url in the following raised an Exception (expecting unicode but got bool) and the rendering failed:\nhtml = html.replace(img_url, encoded_url, 1)\nSo the issue was in dealing with the situation where the theme image could not be found. This was only happening if using a custom theme. The code was looking in the THEMES_DIR instead of looking in the user-specified theme directory:\nsource = os.path.join(THEMES_DIR, self.theme, 'css')\nWith a custom theme, source would point to a non-existing directory and an invalid image file path would be passed to the encoding operation (THEMES_DIR was hard-coded so a custom theme directory would never work).\nSo you should be able to reproduce the issue by copying tango to a user directory and using -i:\nsrc/landslide/main.py -i -t ~/my_tango_copy samples/example1\nThanks\n. Thanks for the feedback. Let me see if I can explain the issue better...\nIf the image isn't found in the following, then encoded_url is False:\nencoded_url = utils.encode_image_from_url(img_url, source)\nUsing False for encoded_url in the following raised an Exception (expecting unicode but got bool) and the rendering failed:\nhtml = html.replace(img_url, encoded_url, 1)\nSo the issue was in dealing with the situation where the theme image could not be found. This was only happening if using a custom theme. The code was looking in the THEMES_DIR instead of looking in the user-specified theme directory:\nsource = os.path.join(THEMES_DIR, self.theme, 'css')\nWith a custom theme, source would point to a non-existing directory and an invalid image file path would be passed to the encoding operation (THEMES_DIR was hard-coded so a custom theme directory would never work).\nSo you should be able to reproduce the issue by copying tango to a user directory and using -i:\nsrc/landslide/main.py -i -t ~/my_tango_copy samples/example1\nThanks\n. ",
    "akrabat": "I've encountered this problem with custom CSS files, so I've provided PR 126 (https://github.com/adamzap/landslide/pull/126) which takes ackdesha's work and builds upon it.. \n. Sorry. I think it was my fault for not branching before sending in my pull request. This appears to confuse git in some way that I don't understand. Thanks for merging!\n. I've encountered this problem with custom CSS files, so I've provided PR 126 (https://github.com/adamzap/landslide/pull/126) which takes ackdesha's work and builds upon it.. \n. Sorry. I think it was my fault for not branching before sending in my pull request. This appears to confuse git in some way that I don't understand. Thanks for merging!\n. ",
    "durden": "There is no way to do this currently with the included themes. However, I am in the process of adding a new theme (adamzap/landslide#129). That theme (I'm just porting it to landslide and simplifying it) does support full-screen images like this (http://pepelsbey.github.com/shower/en.htm?full#Cover).\nHowever, I haven't added support for full-screen images in my fork yet. You could take my html/js and put it in there pretty easily I think. You could also wait for me to finish getting that theme in to the main landslide repo and try playing with it then.\nThe pull request referenced above does work (no full-screen images) so you could see how hard it is to hack in.\n. There is no way to do this currently with the included themes.  However, I am in the process of adding a new theme (https://github.com/adamzap/landslide/pull/129).  That theme (I'm just porting it to landslide and simplifying it) does support full-screen images like this (http://pepelsbey.github.com/shower/en.htm?full#Cover).\nHowever, I haven't added support for full-screen images in my fork yet.  You could take my html/js and put it in there pretty easily I think.  You could also wait for me to finish getting that theme in to the main landslide repo and try playing with it then.\nThe pull request referenced above does work (no full-screen images) so you could see how hard it is to hack in.\n. I don't think watchdog is super reliable but maybe my little command-line is not optimal or there's a better way entirely?\n. That is a good point.  The majority of that size is the included fonts (5M) so maybe using Google Web Fonts or something else would be more appropriate than including them in the theme?  I think that would still make this theme alone a little bit over 100K though.\n``` bash\ndu -h ribbon/\n48K    ./css\n5.0M    ./fonts\n 52K    ./images\n 12K    ./js\n5.1M    .\n```\n. I'm not sure about the scss files.  I have kinda went back and forth about that because I actually did customize them and build 'real' css files myself.  So, I could see someone wanting to modify the theme and could be easier using sass than css to do that.\nOn the other hand, I could also see no need for them...I'm just indifferent on including or not I guess.\n. One downside of using Google Web Fonts is they will not work if you run your presentation offline.  So degrading to something more 'standard' should be ok.  Do you think this is an unreasonable restriction?  I mean it's an HTML presentation tool so maybe assuming Internet access is ok or at the very least understanding that the fonts aren't available and why.\n. Ok cool.  I'll update the PR when I move to the web fonts solution.  It will probably be a few days, got a few presentations to do this weekend ha ha.\n. Ok, removed the fonts and replaced with web fonts.  Pretty simple change actually since the names in Google fonts were exactly the same.  This should make the theme much smaller.\nProbably worth taking one of your presentations and just changing the theme to 'ribbon' and verifying.\n. I have tried to contact the author but no response yet.\n. Ok, I got the 'ok' from the original author via twitter as long as we have the proper copyright notices.  I think we are good to go whenever you want.\n. I don't think the license file is necessary since there is a copyright notice at the top of all the css files which were pretty much copied almost exactly.  However, it doesn't hurt.  I also kept the original russian text in the license file (below the english) just because that was how the original was.\n. There is no way to do this currently with the included themes. However, I am in the process of adding a new theme (adamzap/landslide#129). That theme (I'm just porting it to landslide and simplifying it) does support full-screen images like this (http://pepelsbey.github.com/shower/en.htm?full#Cover).\nHowever, I haven't added support for full-screen images in my fork yet. You could take my html/js and put it in there pretty easily I think. You could also wait for me to finish getting that theme in to the main landslide repo and try playing with it then.\nThe pull request referenced above does work (no full-screen images) so you could see how hard it is to hack in.\n. There is no way to do this currently with the included themes.  However, I am in the process of adding a new theme (https://github.com/adamzap/landslide/pull/129).  That theme (I'm just porting it to landslide and simplifying it) does support full-screen images like this (http://pepelsbey.github.com/shower/en.htm?full#Cover).\nHowever, I haven't added support for full-screen images in my fork yet.  You could take my html/js and put it in there pretty easily I think.  You could also wait for me to finish getting that theme in to the main landslide repo and try playing with it then.\nThe pull request referenced above does work (no full-screen images) so you could see how hard it is to hack in.\n. I don't think watchdog is super reliable but maybe my little command-line is not optimal or there's a better way entirely?\n. That is a good point.  The majority of that size is the included fonts (5M) so maybe using Google Web Fonts or something else would be more appropriate than including them in the theme?  I think that would still make this theme alone a little bit over 100K though.\n``` bash\ndu -h ribbon/\n48K    ./css\n5.0M    ./fonts\n 52K    ./images\n 12K    ./js\n5.1M    .\n```\n. I'm not sure about the scss files.  I have kinda went back and forth about that because I actually did customize them and build 'real' css files myself.  So, I could see someone wanting to modify the theme and could be easier using sass than css to do that.\nOn the other hand, I could also see no need for them...I'm just indifferent on including or not I guess.\n. One downside of using Google Web Fonts is they will not work if you run your presentation offline.  So degrading to something more 'standard' should be ok.  Do you think this is an unreasonable restriction?  I mean it's an HTML presentation tool so maybe assuming Internet access is ok or at the very least understanding that the fonts aren't available and why.\n. Ok cool.  I'll update the PR when I move to the web fonts solution.  It will probably be a few days, got a few presentations to do this weekend ha ha.\n. Ok, removed the fonts and replaced with web fonts.  Pretty simple change actually since the names in Google fonts were exactly the same.  This should make the theme much smaller.\nProbably worth taking one of your presentations and just changing the theme to 'ribbon' and verifying.\n. I have tried to contact the author but no response yet.\n. Ok, I got the 'ok' from the original author via twitter as long as we have the proper copyright notices.  I think we are good to go whenever you want.\n. I don't think the license file is necessary since there is a copyright notice at the top of all the css files which were pretty much copied almost exactly.  However, it doesn't hurt.  I also kept the original russian text in the license file (below the english) just because that was how the original was.\n. ",
    "ramnathv": "Great! Just FYI, I am developing a package in R called slidify that allows conversion of markdown documents into HTML5 slides. I have used quite a few ideas from landslide as well as the css and javascript that comes with it. \nIt is built to be framework agnostic. So, the same markdown document can be rendered using several supported frameworks like html5slides, deck.js, dzslides etc. \n. Great! Just FYI, I am developing a package in R called slidify that allows conversion of markdown documents into HTML5 slides. I have used quite a few ideas from landslide as well as the css and javascript that comes with it. \nIt is built to be framework agnostic. So, the same markdown document can be rendered using several supported frameworks like html5slides, deck.js, dzslides etc. \n. ",
    "nazarov-tech": "so.. It was not implemented yet. -(\n. so.. It was not implemented yet. -(\n. ",
    "fonnesbeck": "I figured out that this can be done by simply adding the MathJax script to the file.\n. I was thinking along the lines of a subtitle or author byline. Could the following not be made to work?\n```\nPresentation Title\n==================\nSubtitle\n\nFirst Slide\nLorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et \ndolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex \nea commodo consequat.\n```\n. This is excellent, thanks.\n. Here is one:\n```\nSimulation\n==========\n\nStochastic Simulation\nWe often want to obtain a simulated result using a model system of interest.\nUsing artificially-generated random numbers, we can generate realizations of data that would be expected under a particular model.\nInput: $\\mathbf{X}_i = (X_{1i}, \\ldots, X_{ki})$\nOutput: $\\mathbf{Y}_i = h(\\mathbf{X}_i)$\nAnalysis: \n$$Pr(h(\\mathbf{X}) \\le b) \\approx \\frac{1}{N} \\sum_{i=1}^N I(h(\\mathbf{X}_i) \\le b)$$\n$$E(h(\\mathbf{X})) \\approx \\frac{1}{N} \\sum_{i=1}^N h(\\mathbf{X}_i)$$\n```\nIf you remove the backslash from the second-last equation, you get the behavior that I observed. Seems like landslide gets to the underscore before MathJax does, and causes it to italicize.\n. I've been using the underscore workaround for a few weeks now, and its been fine. Thanks for the suggestions.\n. I figured out that this can be done by simply adding the MathJax script to the file.\n. I was thinking along the lines of a subtitle or author byline. Could the following not be made to work?\n```\nPresentation Title\n==================\nSubtitle\n\nFirst Slide\nLorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et \ndolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex \nea commodo consequat.\n```\n. This is excellent, thanks.\n. Here is one:\n```\nSimulation\n==========\n\nStochastic Simulation\nWe often want to obtain a simulated result using a model system of interest.\nUsing artificially-generated random numbers, we can generate realizations of data that would be expected under a particular model.\nInput: $\\mathbf{X}_i = (X_{1i}, \\ldots, X_{ki})$\nOutput: $\\mathbf{Y}_i = h(\\mathbf{X}_i)$\nAnalysis: \n$$Pr(h(\\mathbf{X}) \\le b) \\approx \\frac{1}{N} \\sum_{i=1}^N I(h(\\mathbf{X}_i) \\le b)$$\n$$E(h(\\mathbf{X})) \\approx \\frac{1}{N} \\sum_{i=1}^N h(\\mathbf{X}_i)$$\n```\nIf you remove the backslash from the second-last equation, you get the behavior that I observed. Seems like landslide gets to the underscore before MathJax does, and causes it to italicize.\n. I've been using the underscore workaround for a few weeks now, and its been fine. Thanks for the suggestions.\n. ",
    "ICTime": "Does this issue resolved ? \nThe first page looks really not professional. \n. Does this issue resolved ? \nThe first page looks really not professional. \n. ",
    "rodrigoprimo": "Avalanche (https://github.com/akrabat/avalanche) is a theme for landslide with support for additional content in the title slide.\n. Avalanche (https://github.com/akrabat/avalanche) is a theme for landslide with support for additional content in the title slide.\n. ",
    "manfre": "Also, they are generated with backslashes, instead of forward slashes.\n. Also, they are generated with backslashes, instead of forward slashes.\n. ",
    "jseabold": "This PR is very helpful. I kind of liked having the option of just including a default mathjax configuration in the landslide config so I don't have to go look up the CDN, but that's just me.\n. Makes sense. Thanks.\n. This PR is very helpful. I kind of liked having the option of just including a default mathjax configuration in the landslide config so I don't have to go look up the CDN, but that's just me.\n. Makes sense. Thanks.\n. ",
    "fozziethebeat": "No Problem :)\n. No Problem :)\n. ",
    "shreyankg": "html+django was me specific use case :-)\n. html+django was me specific use case :-)\n. ",
    "mpol": "PEBKAC\n. PEBKAC\n. ",
    "roryturnbull": "Seconded. I'm actually getting that error no matter what flags I use.\n. Seconded. I'm actually getting that error no matter what flags I use.\n. ",
    "jpzimmer": "Good morning Adam,\nYou probably right. What do you advise me? Make a new project?\nThank you for your wonderful and very practical project.\nSincerely.\nJean-Philippe Zimmer\nLe 2014-04-26 20:53, Adam Zapletal a écrit :\n\nGreat job on this theme!\nI wonder if it would better for you to keep in it's own repository on\nyour account due to it's size and how different it is from the default\ntheme. I can link to it.\n\nReply to this email directly or view it on GitHub [1].\nLinks:\n[1] https://github.com/adamzap/landslide/pull/136#issuecomment-41477354\n. Good morning Adam,\nYou probably right. What do you advise me? Make a new project?\nThank you for your wonderful and very practical project.\nSincerely.\nJean-Philippe Zimmer\n\nLe 2014-04-26 20:53, Adam Zapletal a écrit :\n\nGreat job on this theme!\nI wonder if it would better for you to keep in it's own repository on\nyour account due to it's size and how different it is from the default\ntheme. I can link to it.\n\nReply to this email directly or view it on GitHub [1].\nLinks:\n[1] https://github.com/adamzap/landslide/pull/136#issuecomment-41477354\n. \n",
    "copelco": "I ran into this issue today as well, but I haven't found a way around it yet. Does anyone know why this happens?\n. After poking around a bit, I think it's related to the latest version of Prince and this print CSS definition. Removing display: table-cell; fixed the issue for me.\n. I ran into this issue today as well, but I haven't found a way around it yet. Does anyone know why this happens?\n. After poking around a bit, I think it's related to the latest version of Prince and this print CSS definition. Removing display: table-cell; fixed the issue for me.\n. ",
    "phiggins": ":+1: @copelco's fix worked for me. This is with the latest landslide in git master and prince freshly installed from their website:\n```\npete@balloon:~/projects/landslide_example$ prince --version\nPrince 8.1 rev 4\nCopyright 2002-2012 YesLogic Pty. Ltd.\nNon-commercial License\n```\n. :+1: @copelco's fix worked for me. This is with the latest landslide in git master and prince freshly installed from their website:\n```\npete@balloon:~/projects/landslide_example$ prince --version\nPrince 8.1 rev 4\nCopyright 2002-2012 YesLogic Pty. Ltd.\nNon-commercial License\n```\n. ",
    "Canx": "I found my problem. I was not having a 4 space indentation in code :)\n. I found my problem. I was not having a 4 space indentation in code :)\n. ",
    "yp": "Ops, I wrote \"external\" but I was referring to \"remote\" files.\nAs far as I can tell, remote files (those starting with \"http\") are not\nretrieved, so they cannot be correctly embedded nor the link is inserted.\nMy commit is a kind of workaround, but, in some cases, it could also be the\n\"correct\" solution. For example, consider the use case where we need a\n\"multi-file\" remote JS library (like MathJax, as in my real case):\nretrieving only the main file would not be the right solution, but managing\nthe dependencies would be too much hard...\nThanks!\n. Ops, I wrote \"external\" but I was referring to \"remote\" files.\nAs far as I can tell, remote files (those starting with \"http\") are not\nretrieved, so they cannot be correctly embedded nor the link is inserted.\nMy commit is a kind of workaround, but, in some cases, it could also be the\n\"correct\" solution. For example, consider the use case where we need a\n\"multi-file\" remote JS library (like MathJax, as in my real case):\nretrieving only the main file would not be the right solution, but managing\nthe dependencies would be too much hard...\nThanks!\n. ",
    "izar": "First of all, thank you so much for your hard work with landslide - it is\nawesome!\nIf it helps any I can make a quick movie of it working, how about that?\nOn Aug 23, 2013 10:25 PM, \"Adam Zapletal\" notifications@github.com wrote:\n\nIs there anyway I can confirm that this works with Leap Motion and should\nbe included in Landslide? I don't own the device.\nThanks!\n—\nReply to this email directly or view it on GitHubhttps://github.com/adamzap/landslide/pull/146#issuecomment-23203323\n.\n. I've shared an item with you:\n\nlandslide_leap.mp4\nhttps://docs.google.com/file/d/0B5zMr-pnKLj3V3RIWTNCbllNUjg/edit?usp=sharing&invite=CO2FsYMF\nIt's not an attachment -- it's stored online. To open this item, just click\nthe link above.\nHere you go - sorry for the low quality. The LeapMotion is the small box in\nfront of the keyboard.\nPlans now include being able to pop an overlay on top of the slide and\nbasic doodling, and more gestures mapping to the functions that already\nexist in Landslide.\ncheers,\n--izar\n. First of all, thank you so much for your hard work with landslide - it is\nawesome!\nIf it helps any I can make a quick movie of it working, how about that?\nOn Aug 23, 2013 10:25 PM, \"Adam Zapletal\" notifications@github.com wrote:\n\nIs there anyway I can confirm that this works with Leap Motion and should\nbe included in Landslide? I don't own the device.\nThanks!\n—\nReply to this email directly or view it on GitHubhttps://github.com/adamzap/landslide/pull/146#issuecomment-23203323\n.\n. I've shared an item with you:\n\nlandslide_leap.mp4\nhttps://docs.google.com/file/d/0B5zMr-pnKLj3V3RIWTNCbllNUjg/edit?usp=sharing&invite=CO2FsYMF\nIt's not an attachment -- it's stored online. To open this item, just click\nthe link above.\nHere you go - sorry for the low quality. The LeapMotion is the small box in\nfront of the keyboard.\nPlans now include being able to pop an overlay on top of the slide and\nbasic doodling, and more gestures mapping to the functions that already\nexist in Landslide.\ncheers,\n--izar\n. ",
    "obestwalter": "Here's a custom Javascript stolen from another landslide presentation\nfunction r(f){/loaded|complete/.test(document.readyState)?f():setTimeout(\"r(\"+f+\")\",9);}\nfunction go() {\n    var body = document.getElementsByTagName('body')[0];\n    var e = document.createElement('p');\n    e.setAttribute('class', 'cop');\n    e.innerHTML =\n    '<strong>Intégration continue d\\'un projet Django</strong> | '\n    + 'Nicolas Perriault — <a href=\"http://www.akei.com/\">Akei</a> | '\n    + '<a href=\"http://rencontres.django-fr.org/\">Rencontres Django Francophones</a>, Marseille, 2011 | '\n    + 'Slides powered by <a href=\"https://github.com/n1k0/landslide\">Landslide</a> (type <code>h</code> fort help)';\n    body.appendChild(e);\n}\nr(go);\nYou only have to use a landslide.cfg and add a js item pointing to the code.\n. Here's a custom Javascript stolen from another landslide presentation\nfunction r(f){/loaded|complete/.test(document.readyState)?f():setTimeout(\"r(\"+f+\")\",9);}\nfunction go() {\n    var body = document.getElementsByTagName('body')[0];\n    var e = document.createElement('p');\n    e.setAttribute('class', 'cop');\n    e.innerHTML =\n    '<strong>Intégration continue d\\'un projet Django</strong> | '\n    + 'Nicolas Perriault — <a href=\"http://www.akei.com/\">Akei</a> | '\n    + '<a href=\"http://rencontres.django-fr.org/\">Rencontres Django Francophones</a>, Marseille, 2011 | '\n    + 'Slides powered by <a href=\"https://github.com/n1k0/landslide\">Landslide</a> (type <code>h</code> fort help)';\n    body.appendChild(e);\n}\nr(go);\nYou only have to use a landslide.cfg and add a js item pointing to the code.\n. ",
    "tjwood100": "I see an alignment issue scrolling the slides with page up/page down in Firefox but not Chromium. It may be the same issue. This can be fixed in the template slides.js by adding\nevent.preventDefault();\nin the case statements in handleBodyKeyDown following prevSlide() and nextSlide().\n. Actually I see event.preventDefault is already present in the latest version. I was using a slides.js from a template based off an older version.\n. I was using Ubuntu 14.04 (default Unity interface) and saw the issue with Firefox 42.\nI will check later if I can reproduce it on Windows. \n(edited to remove erroneous statement that it affected Chromium too)\n. Actually I was mistaken. It only seems to affect Firefox. Using version 42 I can reproduce on both Ubuntu 14.04 and Windows 7.  It seems like the exact effect can vary a little I guess depending on how many times onresize ends up getting called:\nVideos showing the effect:\nhttp://files.tx9.co.uk/landslide-ubuntu.ogv (1.3 MB)\nhttp://files.tx9.co.uk/landslide-windows.ogv (1.1 MB)\n. I see an alignment issue scrolling the slides with page up/page down in Firefox but not Chromium. It may be the same issue. This can be fixed in the template slides.js by adding\nevent.preventDefault();\nin the case statements in handleBodyKeyDown following prevSlide() and nextSlide().\n. Actually I see event.preventDefault is already present in the latest version. I was using a slides.js from a template based off an older version.\n. I was using Ubuntu 14.04 (default Unity interface) and saw the issue with Firefox 42.\nI will check later if I can reproduce it on Windows. \n(edited to remove erroneous statement that it affected Chromium too)\n. Actually I was mistaken. It only seems to affect Firefox. Using version 42 I can reproduce on both Ubuntu 14.04 and Windows 7.  It seems like the exact effect can vary a little I guess depending on how many times onresize ends up getting called:\nVideos showing the effect:\nhttp://files.tx9.co.uk/landslide-ubuntu.ogv (1.3 MB)\nhttp://files.tx9.co.uk/landslide-windows.ogv (1.1 MB)\n. ",
    "laike9m": "@adamzap \n. @adamzap \n. ",
    "glenfant": "Hi, thanks for the reply ! You can close this issue. This works as expected with the latest version of landslide.\n. Hi, thanks for the reply ! You can close this issue. This works as expected with the latest version of landslide.\n. ",
    "amarandon": "@adamzap Well it's looking good now. I've tried to compile a few presentations and the result is fine. I think it's ready to merge.\n. Hi @adamzap \nCan you give more details on how to reproduce the problem and maybe a stackstrace?\nIt's working fine here. First running tests:\n```\n$ mkvirtualenv -p /usr/bin/python2.7 landslide\n$ git clone -b python3 git@github.com:amarandon/landslide.git\n$ cd landslide/\n$ python setup.py develop\n$ pip install tox\n$ tox\nGLOB sdist-make: /home/al/dev/landslide/setup.py\npy27 create: /home/al/dev/landslide/.tox/py27\npy27 inst: /home/al/dev/landslide/.tox/dist/landslide-1.1.1.zip\npy27 runtests: PYTHONHASHSEED='390572466'\npy27 runtests: commands[0] | python src/landslide/tests.py\n....toto.jpg was not found, skipping\n................\n\nRan 20 tests in 0.293s\nOK\npy33 create: /home/al/dev/landslide/.tox/py33\npy33 inst: /home/al/dev/landslide/.tox/dist/landslide-1.1.1.zip\npy33 runtests: PYTHONHASHSEED='390572466'\npy33 runtests: commands[0] | python src/landslide/tests.py\n....toto.jpg was not found, skipping\n................\n\nRan 20 tests in 0.327s\nOK\n__________ summary ___________\n  py27: commands succeeded\n  py33: commands succeeded\n  congratulations :)\n```\nOr without tox:\n```\n$ python --version\nPython 2.7.3\n$ python src/landslide/tests.py \n....toto.jpg was not found, skipping\n................\n\nRan 20 tests in 0.261s\nOK\n```\nThen building a presentation of mine:\n$ python --version\nPython 2.7.3\n$ landslide index.cfg\nConfig   index.cfg\nAdding   index.md (markdown)\nEmbedded image images/rwa-cover.jpg\nGenerated file: ./index.html\n. There you go. I've kept my individual commit messages in the body of that squashed commit message for the records.\n. @adamzap Well it's looking good now. I've tried to compile a few presentations and the result is fine. I think it's ready to merge.\n. Hi @adamzap \nCan you give more details on how to reproduce the problem and maybe a stackstrace?\nIt's working fine here. First running tests:\n```\n$ mkvirtualenv -p /usr/bin/python2.7 landslide\n$ git clone -b python3 git@github.com:amarandon/landslide.git\n$ cd landslide/\n$ python setup.py develop\n$ pip install tox\n$ tox\nGLOB sdist-make: /home/al/dev/landslide/setup.py\npy27 create: /home/al/dev/landslide/.tox/py27\npy27 inst: /home/al/dev/landslide/.tox/dist/landslide-1.1.1.zip\npy27 runtests: PYTHONHASHSEED='390572466'\npy27 runtests: commands[0] | python src/landslide/tests.py\n....toto.jpg was not found, skipping\n................\n\nRan 20 tests in 0.293s\nOK\npy33 create: /home/al/dev/landslide/.tox/py33\npy33 inst: /home/al/dev/landslide/.tox/dist/landslide-1.1.1.zip\npy33 runtests: PYTHONHASHSEED='390572466'\npy33 runtests: commands[0] | python src/landslide/tests.py\n....toto.jpg was not found, skipping\n................\n\nRan 20 tests in 0.327s\nOK\n__________ summary ___________\n  py27: commands succeeded\n  py33: commands succeeded\n  congratulations :)\n```\nOr without tox:\n```\n$ python --version\nPython 2.7.3\n$ python src/landslide/tests.py \n....toto.jpg was not found, skipping\n................\n\nRan 20 tests in 0.261s\nOK\n```\nThen building a presentation of mine:\n$ python --version\nPython 2.7.3\n$ landslide index.cfg\nConfig   index.cfg\nAdding   index.md (markdown)\nEmbedded image images/rwa-cover.jpg\nGenerated file: ./index.html\n. There you go. I've kept my individual commit messages in the body of that squashed commit message for the records.\n. ",
    "martinclaus": "Same problem when rendering markdown using Prince 9.0r5 on Ubuntu 14.04\n. Same problem when rendering markdown using Prince 9.0r5 on Ubuntu 14.04\n. ",
    "frewsxcv": "Out of curiosity, why is there a travis.yml if you don't use Travis?\n. Out of curiosity, why is there a travis.yml if you don't use Travis?\n. ",
    "pauljohn32": "I'm seeing that same error on Ubuntu, with python 3.4 and landslide installed with pip3 on 2015-02-27.  However, I can confirm that downloading landslide from the Git repo and re-building solves the problem. I can compile your example presentation and it looks nice.\n. I'm seeing that same error on Ubuntu, with python 3.4 and landslide installed with pip3 on 2015-02-27.  However, I can confirm that downloading landslide from the Git repo and re-building solves the problem. I can compile your example presentation and it looks nice.\n. ",
    "ztzt": "I have the same problem\nmac os python 2.7\nzhoutaodeMacBook-4:markdown zhoutao$ landslide example.md -i -o > name_you_like.html\nTraceback (most recent call last):\n  File \"/Library/Frameworks/Python.framework/Versions/Current/bin/landslide\", line 5, in <module>\n    from pkg_resources import load_entry_point\n  File \"/Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages/pkg_resources.py\", line 2707, in <module>\n    working_set.require(__requires__)\n  File \"/Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages/pkg_resources.py\", line 686, in require\n    needed = self.resolve(parse_requirements(requirements))\n  File \"/Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages/pkg_resources.py\", line 584, in resolve\n    raise DistributionNotFound(req)\npkg_resources.DistributionNotFound: Pygments\n. through pip\nPygments is already installed.\nzhoutaodeMacBook-4:~ zhoutao$ sudo pip install Pygments\nThe directory '/Users/zhoutao/Library/Caches/pip/http' or its parent directory is not owned by the current user and the cache has been disabled. Please check the permissions and owner of that directory. If executing pip with sudo, you may want sudo's -H flag.\nThe directory '/Users/zhoutao/Library/Caches/pip' or its parent directory is not owned by the current user and caching wheels has been disabled. check the permissions and owner of that directory. If executing pip with sudo, you may want sudo's -H flag.\nRequirement already satisfied (use --upgrade to upgrade): Pygments in /Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages\n－－－－－－\n亿保健康研发中心 周涛\n15658883818\n原始邮件\n发件人:Adam Zapletalnotifications@github.com\n收件人:adamzap/landslidelandslide@noreply.github.com\n抄送:ztzt17180042@qq.com; Mentionmention@noreply.github.com\n发送时间:2016年5月9日(周一) 11:01\n主题:Re: [adamzap/landslide] pkg_resources.DistributionNotFound: Pygments(#176)\n@ztzt How did you install Landslide?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly or view it on GitHub\n. I have the same problem\nmac os python 2.7\nzhoutaodeMacBook-4:markdown zhoutao$ landslide example.md -i -o > name_you_like.html\nTraceback (most recent call last):\n  File \"/Library/Frameworks/Python.framework/Versions/Current/bin/landslide\", line 5, in <module>\n    from pkg_resources import load_entry_point\n  File \"/Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages/pkg_resources.py\", line 2707, in <module>\n    working_set.require(__requires__)\n  File \"/Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages/pkg_resources.py\", line 686, in require\n    needed = self.resolve(parse_requirements(requirements))\n  File \"/Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages/pkg_resources.py\", line 584, in resolve\n    raise DistributionNotFound(req)\npkg_resources.DistributionNotFound: Pygments\n. through pip\nPygments is already installed.\nzhoutaodeMacBook-4:~ zhoutao$ sudo pip install Pygments\nThe directory '/Users/zhoutao/Library/Caches/pip/http' or its parent directory is not owned by the current user and the cache has been disabled. Please check the permissions and owner of that directory. If executing pip with sudo, you may want sudo's -H flag.\nThe directory '/Users/zhoutao/Library/Caches/pip' or its parent directory is not owned by the current user and caching wheels has been disabled. check the permissions and owner of that directory. If executing pip with sudo, you may want sudo's -H flag.\nRequirement already satisfied (use --upgrade to upgrade): Pygments in /Library/Frameworks/Python.framework/Versions/7.2/lib/python2.7/site-packages\n－－－－－－\n亿保健康研发中心 周涛\n15658883818\n原始邮件\n发件人:Adam Zapletalnotifications@github.com\n收件人:adamzap/landslidelandslide@noreply.github.com\n抄送:ztzt17180042@qq.com; Mentionmention@noreply.github.com\n发送时间:2016年5月9日(周一) 11:01\n主题:Re: [adamzap/landslide] pkg_resources.DistributionNotFound: Pygments(#176)\n@ztzt How did you install Landslide?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly or view it on GitHub\n. ",
    "mrkwjc": "Doesn't work. I tried also with with math role:\n:math:\\left( \\sum_{k=1}^n a_k b_k \\right)^2\nbut without success. Can i get any debugging informations from landslide?\n. Doesn't work. I tried also with with math role:\n:math:\\left( \\sum_{k=1}^n a_k b_k \\right)^2\nbut without success. Can i get any debugging informations from landslide?\n. ",
    "ozroc": "It's difficult to explain.\nBasically, when you want to go to the next slide, instead of that the slide was just scrolled a little bit to the left. \nWith my small change it will avoid that scrolling and just change to the next slide.\nI was just trying to look at my generated slides from firefox browser in my smartphone, and the slides are now readable from my smartphone without affecting anything else.\n. It's difficult to explain.\nBasically, when you want to go to the next slide, instead of that the slide was just scrolled a little bit to the left. \nWith my small change it will avoid that scrolling and just change to the next slide.\nI was just trying to look at my generated slides from firefox browser in my smartphone, and the slides are now readable from my smartphone without affecting anything else.\n. ",
    "bermanmaxim": "Yes, I was referring to the master branch.\nA from .generator import Generator statement in __init__.py would work, but then its more logical to call the generator as g = landslide.Generator(source='toto.md'). If you'd rather stick to the instructions of the readme, where the generator is called as g = landslide.generator.Generator(source='toto.md'), I would rather put from . import generator in the __init__.py.\n. Hello, sure, I just tried it, adding the theme folder in the manifest did the trick.\n. Well, it's because I followed these instructions on the Readme.md:\n\nIf you want to stay on the edge:\n$ git clone https://github.com/adamzap/landslide.git\n   $ cd landslide\n   $ python setup.py build\n   $ sudo python setup.py install\n\nSince you close the issue, remember to put from . import generator in your __init__.py, which was the main issue ;)\n. Yes, I was referring to the master branch.\nA from .generator import Generator statement in __init__.py would work, but then its more logical to call the generator as g = landslide.Generator(source='toto.md'). If you'd rather stick to the instructions of the readme, where the generator is called as g = landslide.generator.Generator(source='toto.md'), I would rather put from . import generator in the __init__.py.\n. Hello, sure, I just tried it, adding the theme folder in the manifest did the trick.\n. Well, it's because I followed these instructions on the Readme.md:\n\nIf you want to stay on the edge:\n$ git clone https://github.com/adamzap/landslide.git\n   $ cd landslide\n   $ python setup.py build\n   $ sudo python setup.py install\n\nSince you close the issue, remember to put from . import generator in your __init__.py, which was the main issue ;)\n. ",
    "luwenhegithub": "I have encountered this problem.\nI use the version 1.1.3-2.fc24.\nI'm using Landslide on Fedora.\nThis response was translated using Google Translate.\n. I have encountered this problem.\nI use the version 1.1.3-2.fc24.\nI'm using Landslide on Fedora.\nThis response was translated using Google Translate.\n. ",
    "SebCorbin": "Updated file, thanks for the tip! Here's my config:\n- python 3.5.2\n- landslide 1.1.3\n- watchdog 0.8.3\n- Mac OSX Sierra 10.12.2. Updated file, thanks for the tip! Here's my config:\n- python 3.5.2\n- landslide 1.1.3\n- watchdog 0.8.3\n- Mac OSX Sierra 10.12.2. ",
    "doakey3": "I have updated this fix to include stopping animated GIFs from playing until the parent slide is active. This required use of the  library. There are a couple gotchas with this update:\nAll images whose src ends with .gif, or base64 images whose \"alt\" attribute ends with .gif will be changed by the Gifffer function into a button and a canvas element. This may be confusing for someone making a .css file trying to get GIFs positioned a certain way, but not seeing results (because they've been converted to a different tagname). It may be necessary to edit the default .css file and add a comment to clear this confusion.. I have updated this fix to include stopping animated GIFs from playing until the parent slide is active. This required use of the  library. There are a couple gotchas with this update:\nAll images whose src ends with .gif, or base64 images whose \"alt\" attribute ends with .gif will be changed by the Gifffer function into a button and a canvas element. This may be confusing for someone making a .css file trying to get GIFs positioned a certain way, but not seeing results (because they've been converted to a different tagname). It may be necessary to edit the default .css file and add a comment to clear this confusion.. "
}