{
    "alignedleft": "Thanks!  I’ve gone back and forth on this, as I actually found the indentation style more confusing when I was just getting started.  So for the book (and the sample code here), I abandoned it.  But I see your (and Mike's) point, as once the concept of changing selections along the chain is understood, this indentation is helpful.  I just didn't want to confuse the matter further, and wanted to keep the code as simple as possible to read.\nYou may have just convinced me otherwise, though.  Let me revisit this and see how spacing could be addressed clearly in the book text.\n. Following up on this, as I'm working on the 2nd edition now…\nIn the end, I agree with you about the value of Mike's indentation style. In practice, however, I'm not confident in the publishing platform's ability to maintain spacing accurately across all formats (print, ePub, Kindle, web). Given that, I don't want to risk committing to a more nuanced indentation convention, as it could backfire and actually be less readable (or more confusing) to people if the formatting doesn't come through as intended.\nThank you for this good suggestion, however!. Thanks for this. I'm not approving this pull request immediately because it's important to keep the code samples here in sync with what's in the book. This will be corrected in a new branch of the code, once we start working on the next update to the book. (Thanks for your patience!)\n. Errata may be reported here:  http://oreilly.com/catalog/errata.csp?isbn=0636920026938\n. Thanks again for reporting this! It turns out most of the city coordinates were wrong. Like, really wrong. Oops! I've corrected them for the 2nd ed. of the book.. Thanks for this, Jeff! As you've discovered, I intended to include a mention in that chapter on the importance of verifying your geocoder results… and my results were way off, resulting in misplacement of city-circles.\nWhile this is quite helpful, I won't merge this request yet, because it's more important that the sample code match exactly what is in the current version of the book (even if that is erroneous). We'll be releasing an update to the book that will address this bad geodata, and I will update the code here to sync at that time.\nI'm also looking for suggestions on how to maintain different versions of the code samples.  Right now, I'm thinking of having a different branch for each release of the book.  So the current \"master\" branch would be moved to a new \"first release\" branch.  Then a new \"second release\" branch could have these corrections, and so on.\n. Thanks, @shepazu! You make a good point about including a visible disclaimer or note within the HTML itself. I’m going to look into any potential conflicts this could cause with the print and ebook editions.\n. @jeffweiss thank you again for fixing this data file so comprehensively!\nI've corrected this file for the 2nd edition of the code examples (to accompany the 2nd edition of the book).\nIf you shoot me an email (http://alignedleft.com/contact), I would love to make sure you receive a free copy of the 2nd ed. once it's out.  Thanks again!. Yes, that is confusing, but deliberate.  :-)\nbars.enter() is for entering bars.  When you click the text, one new data value is added, and the enter() selection represents the new, corresponding element.  The new bar is placed just beyond the right edge of the SVG.\nThe subsequent \"update\" portion bars.transition()… updates values for all bars, including the new one, so all bars move into their new positions.  The new bar appears to \"slide in\" from the right side.\nYour're right that there is probably more redundancy in this example than is needed, because only width and x need to change.  But this example is building up to more complex examples later in the chapter.\n. Yes! Good catch. Yet I think this particular example has a max value of 25, so, in reality the yScale doesn't change (but this is more flexible, and would work with larger values, if you allowed them).\n. Yes, this has to do with changes in later versions of D3, which are pickier about the quality of the GeoJSON used.  I'll correct this shortly.  (In the meantime, try this example with the version of D3 included here.)\n. Thanks! An index file isn't generally necessary, though, as your local web server will essentially generate this for you. (Also, this would be one more thing to maintain.) :-). Thanks! Good catch.\nAs mentioned in the README, that data is from here: http://ers.usda.gov/data-products/agricultural-productivity-in-the-us.aspx\nSpecifically, that data is taken from Table 19. I can only assume AK and HI weren't included because this is the continental US only, but I see no clear explanation of that fact on the page above. Let me know if you can figure out why they weren't included!\n. Closing this, as — even if we could find data for Alaska and Hawaii — for the purposes of that example, the missing data serves to illustrate how to handle a \"no data\" scenario, and there is value in that. :-). Thanks for this PR! However, I'm not making any changes to the code examples here yet, because it's important these examples match exactly what is in the book.\nI'm going to leave this open for now.  When I start working on revisions for the 2nd edition, I will revisit this change.  Thanks!\n. Unclear why it would benefit the bar chart to have sub-arrays of 3 values each, and no explanation was given here.. Thanks, @LeonardoGentile! Technically, yes, we should divide by π, but in practice, that just ends up scaling the value, just as dividing by any arbitrary number. That is, it would achieve the same result as not dividing by π, only it would be 3.14… times smaller. So then we'd have really tiny circles, and would need to scale those values back up again, for visual purposes.\nThe important part of the radius-area relationship (for our purposes) is the square (root) relationship. \nIf we cared about calculating the actual size of a specific circle, then π is important, but we care only about the relative areas of our circles, for purposes of graphical honesty.\nThat said, the example I have here on p. 109 in which circles are scaled in relationship to their y value is very confusing, because you would never do that in practice. I'm going to rewrite this one for the 2nd edition of the book.  Thank you for calling it to my attention!\n. @jackparmer so they are! I'll correct this for the 2nd edition of the book. Let me know if you notice any others that are incorrect.\nIn the meantime, note discussion in the book about the importance of manually verifying geocoder results (which I did not do here).  :)\n. @ExtremelySeriousChicken some of the values are a bit off, but it shouldn't be that bad. Can you post a screenshot?\n@jackparmer thank you!\n. Oh, you’re right! This is really bad, and must have been the result of me sorting the place names independently of lat/lon values. I’ll fix this, thanks.\n. Thank you all very much for reporting this (huge) oversight on my part.\nI've corrected the data for the 2nd edition of the book. Thanks!. Wow, great catch, thank you!\nThe master branch is frozen for now, as it reflects exactly what appears in the first edition of the book. However, I'm applying this change to the 2e branch, which will sync with the second edition of the book, in progress now. Thanks!\n. Thank you so much, @sesm. I completely agree. The solution in the first edition of the book is not ideal. I think at the time, I chose not to go into this additional level of complexity, but since you've raised the issue, it probably has caused confusion for others as well.\nI'm going to revisit this language (and example) in chapter 10 in the next few months. I'm leaving this PR open for now, so it stays on my to-do list.\n. Thanks again for this suggestion!\nI've just rewritten that section of the book for the 2nd edition. I'm leaving this example (mostly) as-is, but have added a section on using named transitions, which may be a more appropriate (and D3-like) solution to the common problem of unnamed transitions interrupting each other all the time.. Thanks, but the 2e branch won't be merged into master until the 2nd edition of the book comes out. I can't have the master branch be out of sync with what appears in the current version of the book.\n. Are you using a local web server?  (That is, does the URL in the address bar start with http://localhost…?) What errors do you see in the console? Can you post a screenshot of what you see, with the error console visible?\n. Super. See chapter 4 for an explanation of why a local server is needed. :)\n. Well, yes and no. These elements are necessary for HTML, but if you omit them, your browser will simply insert them for you. (That's how necessary they are.) :-)\n. Thanks, but this branch is set in stone now as I rework all the examples for the 2nd edition.\n. Thank you! I'll leave this open, but I'm not making any changes to the master (1st ed.) branch, as it wouldn't match the books that have already been printed. But I'm making refinements to the 2nd ed. branch, and will keep this in mind. Thanks!. Closing this pull request, but the text of the 2nd edition better addresses this concern about the labels. Thanks!. Wow, you scared me for a minute there! The book just came out in print yesterday — how awful if I'd had a major error in the code!\nYou are right, of course, but this is an edge case I'm not worried about nor trying to address in this example. Also, I don't want to complicate the example by introducing a new sort of syntax.\nThanks for the suggestion, and let me know if you discover anything else!. Thanks, @indepth2. Which specific code example is this referring to?  And if you modified it, could you please post your code?  (See Appendix D.). Ah thanks!  And yes, I believe that was one of the changes I left \"as an exercise to the reader.\"  I got the bars working; it's up to you to get the labels working.  In the process of doing that, you get to learn how it works.  :-)  So that was very much on purpose.\nThat said, you're asking for the \"answer\" here.  One possible solution is as follows.\nNote line 242 of that file:  https://github.com/alignedleft/d3-book/blob/master/chapter_12/01_enter_merge_exit.html#L242\nThis is what will happen when labels \"update\".  Note that only the x attribute is updated!  This explains why you see the labels maintain their vertical positions (incorrectly), even when the yScale is updated (and bar heights update, too).\nSo to fix this, you need to add in a function to update y.  Find the code we've already written on line 233, and just copy and paste it after the x updater, so the conclusion to that chain looks like this:\njavascript\n.attr(\"x\", function(d, i) {\n    return xScale(i) + xScale.bandwidth() / 2;\n})\n.attr(\"y\", function(d) {\n    return h - yScale(d.value) + 14;\n});\nI hope that helps!. A great point, @mutantkeyboard, and thanks for reporting this ES6-related confusion.  Thanks for taking the time to provide an example and reference, too.\nThat said, my intended audience for the book are beginners — while there are lots of additional subjects to be covered, I made the conscious decision to leave topics for intermediate/advanced developers to others, such as Elijah Meeks, who addresses D3 + ES6, among other topics, in his book.. @azdanov Thank you for reporting this! Fortunately, this misspelling wasn't included in the book itself.. Amazing, thank you again, @azdanov!\nI have fixed that misspelling in the code, and published a new release. \nFortunately, that typo does not appear in the text of the book. Unfortunately, it does appear visually in some screenshots in Chapter 16. I have logged this in the errata so it can be fixed in the next update to the book.. Great catch! Though that's definitely an edge case that I don't think this example needs to address. In real life, you'd never be clicking to remove data points… This is intended just to illustrate how you could change the data set, rebind, and update. :-). Ah, thank you! Very good catch, and I expect you're the first person to notice this very small and fast-moving discrepancy. :-)\nI'm going to leave this PR open for now; I'd like to apply this, but not until the code excerpts and explanations in the book can be updated at the same time.. Arrrrrrrrrgggggggghhhh!\nYou are exactly right, of course. Thank you for reporting this! This is the first verified, known typo in the book. You win a… a… well, you win something. Maybe a corrected copy?  I should have a typo bounty program.\nI've fixed this in the source, so it will be corrected in future printings and ebook releases — though that doesn't help for the copies already out there.. @Selbosh hey, great catch. I think it's just a (rare!) stylistic inconsistency. I will accept the fact that you noticed it as evidence that I was highly consistent throughout the book otherwise. See, you were really writing in with a compliment! 😄 \nThanks for catching this. I'm going to leave this open, as I'd like to amend this with the next update to the book (though the code will remain unchanged for now).. I just tested this and am running the example chapter_05/03_csv_loading_example.html, and the results are as expected — Deliciousness is converted from a String to a number value:\n\nWhat version of D3 are you using? Are you running a local web server? Are you using a specific example file?. OK, good catch. The reason this isn't working as you'd expect with D3 v5 is:\n\nD3 now uses Promises instead of asynchronous callbacks to load data. Promises simplify the structure of asynchronous code, especially in modern browsers that support async and await.\n\nhttps://github.com/d3/d3/blob/master/CHANGES.md\nSo the way D3 v5 handles loading external data has changed significantly, and the example code I provided for v4 will not work.\nI've captured this on the errata page for the book, so it can be amended in the next update:\nhttp://www.oreilly.com/catalog/errata.csp?isbn=0636920037316\nThanks for catching this!. Thanks! What browser are you using? Can you post a screenshot? \nThese examples are intended to work only with D3 v4.x. Could you test it using v4.x (or, specifically, v4.5.0, which is the version included in this release of examples)?  Then please also share a screenshot of that, for comparison.\nHere's line 77, for easy reference:\nhttps://github.com/alignedleft/d3-book/blob/master/chapter_13/06_stacked_area.html#L77. Closing because of no response, and I can't reproduce the issue. @happytcj if you can respond to the above, I'm happy to look into it further!. I'm sure that's true! These examples are made with work only with v4.x, and specifically v4.5.0, which is included here in this repo. They won't be kept up to date to work with all future versions of D3 (unless it's time to update for a 3rd edition of the book).  :-). Ah thanks! I will tag this with v5, so I can be sure to revisit for a future edition.. Thanks, @EricMaibach! . @akeyboardlife What version of D3 are you using with example 9 from chapter 8? . Thanks for flagging this. These examples are only intended to work with 4.5.0, to be consistent with what is shown in the 2nd ed. of the book.\nShould I do a 3rd edition in the future, I'll be sure to incorporate this change!. Thanks. This is on hold for now, but I will keep it on file should I ever take on a v5 update. :-). Yes. The CHANGES.md doc here: https://github.com/d3/d3/blob/master/CHANGES.md\n…says:\n\nWith the adoption of promises, D3 now uses the Fetch API instead of XMLHttpRequest: the d3-request module has been replaced by d3-fetch. Fetch supports many powerful new features, such as streaming responses.\n\nSee: https://github.com/d3/d3-fetch. Thanks. This is on hold for now, but I will keep it on file should I ever take on a v5 update. :-). Glad you figured it out! :). Indeed. Thanks for the heads-up!. ",
    "ndarville": "Do you have an errata section where this could go in the interim?\n. ",
    "jeffweiss": "Original Data\n\nUpdated Data\n\n. Corrected coordinates for El Paso, Raleigh, and Arlington after animations from jeffweiss/interactive-data-visualization@8bad51fc76f9d279e7b1f35b5e924b04aea294ec revealed them to be way off\n. ",
    "shepazu": "For what it's worth, I went through this same exercise of correcting the data, and was just about to issue a pull request, before I saw this.\nIt was fun for me to retrieve and munge the data myself, so I don't mind the exercise, but I do think it would be better to have accurate data than to match the book; without correcting the data myself (or looking first on github, doh!), I didn't know if the error was with the dataset or the code, and others might feel a similar lack of confidence. You could even include a disclaimer in the HTML file that the data were updated and don't match the renderings in the book.\nBut it's obviously up to you... and like I said, it was fun to rectify the data myself. :)\n. ",
    "ateucher": "I've since figured out this was wrong... but I'm a bit confused as to why.\n. Thanks very much Scott - I get it now.  After playing with it a bit more, I see that y and height also need to change because the input domain to yScale may change, depending on the value of the new datum (i.e., if it is greater than the previous maximum).\n. ",
    "theroller": "Works fine now. Thanks.\n. ",
    "ShuaiZhao": "create d3 repo\n. ",
    "LeonardoGentile": "Glad I could help :+1: \n. ",
    "ExtremelySeriousChicken": "Hey I noticed that most of the cities in the map has incorrect location (at least when I downloaded the content and tried the examples). For example, Chicago is not in Illinous, San Francisco is in Florida, etc. May I know if this only happens in my case? Thanks! ^u^\n. \n. \n. Here is the full code of the script part of the page...\n```\n        //Width and height\n        var w = 500;\n        var h = 300;\n    //Define map projection\n    var projection = d3.geo.albersUsa()\n                           .translate([w/2, h/2])\n                           .scale([500]);\n\n    //Define path generator\n    var path = d3.geo.path()\n                     .projection(projection);\n\n    //Define quantize scale to sort data values into buckets of color\n    var color = d3.scale.quantize()\n                        .range([\"rgb(237,248,233)\",\"rgb(186,228,179)\",\"rgb(116,196,118)\",\"rgb(49,163,84)\",\"rgb(0,109,44)\"]);\n                        //Colors taken from colorbrewer.js, included in the D3 download\n\n    //Create SVG element\n    var svg = d3.select(\"body\")\n                .append(\"svg\")\n                .attr(\"width\", w)\n                .attr(\"height\", h);\n\n    //Load in agriculture data\n    d3.csv(\"us-ag-productivity-2004.csv\", function(data) {\n\n        //Set input domain for color scale\n        color.domain([\n            d3.min(data, function(d) { return d.value; }), \n            d3.max(data, function(d) { return d.value; })\n        ]);\n\n        //Load in GeoJSON data\n        d3.json(\"us-states.json\", function(json) {\n\n            //Merge the ag. data and GeoJSON\n            //Loop through once for each ag. data value\n            for (var i = 0; i < data.length; i++) {\n\n                var dataState = data[i].state;              //Grab state name\n                var dataValue = parseFloat(data[i].value);  //Grab data value, and convert from string to float\n\n                //Find the corresponding state inside the GeoJSON\n                for (var j = 0; j < json.features.length; j++) {\n\n                    var jsonState = json.features[j].properties.name;\n\n                    if (dataState == jsonState) {\n\n                        //Copy the data value into the JSON\n                        json.features[j].properties.value = dataValue;\n\n                        //Stop looking through the JSON\n                        break;\n\n                    }\n                }       \n            }\n\n            //Bind data and create one path per GeoJSON feature\n            svg.selectAll(\"path\")\n               .data(json.features)\n               .enter()\n               .append(\"path\")\n               .attr(\"d\", path)\n               .style(\"fill\", function(d) {\n                    //Get data value\n                    var value = d.properties.value;\n\n                    if (value) {\n                        //If value exists…\n                        return color(value);\n                    } else {\n                        //If value is undefined…\n                        return \"#ccc\";\n                    }\n               });\n\n            //Load in cities data\n            d3.csv(\"us-cities.csv\", function(data) {\n\n                svg.selectAll(\"circle\")\n                   .data(data)\n                   .enter()\n                   .append(\"circle\")\n                   .attr(\"cx\", function(d) {\n                       return projection([d.lon, d.lat])[0];\n                   })\n                   .attr(\"cy\", function(d) {\n                       return projection([d.lon, d.lat])[1];\n                   })\n                   .attr(\"r\", function(d) {\n                        return Math.sqrt(parseInt(d.population) * 0.00004);\n                   })\n                   .style(\"fill\", \"yellow\")\n                   .style(\"opacity\", 0.75)\n                   .append(\"title\")\n                   .text(function(d){\n                       return d.place + \":\" + d.population;\n                   });\n\n            });\n\n\n        });\n\n    });\n\n```\n. ",
    "jackparmer": "I used this:\nhttps://raw.githubusercontent.com/plotly/datasets/master/2014_us_cities.csv\nFor this map:\nhttps://plot.ly/python/bubble-maps/\nFeel free to use if helpful!\n. ",
    "JaimeStill": "All, I updated the values using geocaching. Just change from .txt to .csv.\n\nus-cities.txt\n. ",
    "lakeyjamie": "Looks like that solves my issue. I wasn't running a local server, I was\njust previewing the HTML files, which causes a permissions issue in Chrome.\nThanks for clarifying!.\nOn Tue, May 31, 2016 at 10:20 PM, Scott Murray notifications@github.com\nwrote:\n\nAre you using a local web server? (That is, does the URL in the address\nbar start with http://localhost…?) What errors do you see in the console?\nCan you post a screenshot of what you see, with the error console visible?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/alignedleft/d3-book/issues/16#issuecomment-222895351,\nor mute the thread\nhttps://github.com/notifications/unsubscribe/AJxgZDlveIuZckdTMN_3-vMtJ7Zsiznoks5qHRaFgaJpZM4IrGvJ\n.\n\n\nJAMIE KENT\nSenior Product Lead | Graphiq https://www.graphiq.com/ | We're Hiring\nThe Wharton School, University of Pennsylvania '14\n. ",
    "abitrolly": "Indeed. DOM model shows that these are inserted.\n. ",
    "wolfgangvonludwigsburg": "Thanks for your reply!\nMe -sure- would'nt have discovered it actually.\nBut while studying your examples concerning \"General Update Pattern\",\nI came across to automate it ...\ne.g.\n```\n    d3.interval( ()=>{\n        let what = Math.round( Math.random() )\n        if (what) {\n            //Add a data value\n            //...\n            var newNumber    = ...\n            var lastKeyValue = ...\n        dataset.push({\n            key     : lastKeyValue + 1,\n            value   : newNumber\n        });\n    } else {\n        //Remove a value\n        dataset.shift();    //Remove one value from dataset\n    }\n\n    update()    //= \"General Update Pattern\" (without transitions) ...\n}, 100)\n\n```\n... and then wondered about the error break.\nYes, I do have some more concerns (not errors, but wishes),\nI'll would prepare and report them later to you ...\n. ",
    "indepth2": "It's the code for 01_enter_merge_exit.html.  It has not been altered.\nIt looks like maybe someone else already reported another version of this issue back in August; and you responded that it was beyond the scope of the chapter. I wasn't able to find the \"closed\" issues until after I submitted this.\nEven if that is the case, if possible, I'd still like to know why this isn't adjusting properly when the chart is redrawn for larger yScale values.  \nAlso, even if it is a conscious decision to leave a flaw in the chart for simplification (and to match the process being taught), you might want to add a solution commented out to the file.  That way new users don't see the examples as flawed or poorly written when they are first learning the concept.  \nI understand the tough choice you have to make in that regard though. \nThx for the response.. ",
    "mutantkeyboard": "@alignedleft thank you for the quick response.\nI will definitely check the Elijah's book. \nCheers . ",
    "azdanov": "@alignedleft Another typo in word \"Feburary\".\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/01_initial_chart.html#L26\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/02_color_by_type.html#L26\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/03_sorted_by_type.html#L26\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/04_types_only.html#L26\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/05_click_transition.html#L26\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/06_update_axis.html#L26\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/07_hide_reveal_vehicles.html#L31\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/08_zoom_to_vehicle.html#L31\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/09_back_button.html#L50\nhttps://github.com/alignedleft/d3-book/blob/cf4d229883b3754bb9c9bd4975cea94eb2d4d13b/chapter_16/10_refine_styling.html#L54. ",
    "Selbosh": "No worries! A corrected copy sounds like a disproportionate reward, which I will grudgingly accept.... Places label between two bars. Places label in centre of new (invisible) bar. ",
    "ravichowdhury88": "I am running the local server and my d3 is v5. Thank you so much. For now I am using v4 so that I am able to complete the book. Have a great day !!!. ",
    "Dekermanjian": "Yes, of course I understand. I am currently going through the book, and thought it would be helpful to let you know what still works and what doesn't so that when you decide to update your book it will be simpler(I hope). . ",
    "EricMaibach": "FYI, I am using version 5 and to get it working I just had to change this line:\nd3.csv(\"time_scale_data.csv\", rowConverter, function(data) {\nto:\nd3.csv(\"time_scale_data.csv\", rowConverter).then(function(data) {\nIt works in firefox fine, but does not work in Chrome.  I have not had any luck getting v5 d3.csv working in Chrome.  I am not sure if it is something I am doing wrong or a issue with d3.js and Chrome (seems most likely that I am doing something wrong).\nBTW, thanks for the great book.. ",
    "akeyboardlife": "I don't know the reason, but the original d3.csv() generate multiple svg elements with x and y axis but no data. I think the function load the csv per line and run the callback function on every line of the csv file. . @alignedleft 5.5.0. ",
    "ornenovino": "This is for all the scripts where you have to import a file, in all this cases from .csv. Thanks! Can you help me with this? https://stackoverflow.com/questions/52523853/issues-with-d3-request-example-of-d3-book. ",
    "asc2683": "Duplicate.. ParseTime is defined in the top.\nvar parseTime = d3.timeParse(\"%Y-%m\");. ",
    "monikarohner": "Just found my own mistake. (As usual {the devil is in the detail });\n;-). "
}