{
    "amoffat": "It's by design.  The idea is that progress represents how many of the steps have been finished.  The best indicator of this is the furthest step that has been reached.  Just because you jump back to the first step to verify some info, shouldn't indicate that your progress has been reset, if that makes sense.\n. Submit a pull request for the option and I'll merge it\n. Good work Zach.  I'll update the docs on Monday to reflect the new option\n. Thanks Jeff, there's an MIT license in the main source file https://github.com/amoffat/bootstrap-application-wizard/blob/master/src/bootstrap-wizard.js.  I'll add a note to the readme\n. The mobile version hasn't been tested at all, so I can't guarantee any support for that currently.  I'll leave this issue open if people want to start submitting bugfixes for mobile browsers.\n. It looks like I had trailing whitespace in the original demo file, and maybe your editor trimmed it off.\n. docs updated\n. Good work, I didn't merge because I was able to shave off 3 more kilobytes using YUI minifier\n. Just a hunch, it might be because you have data-cardname=\"\" in both cards.  The syntax of it is weird...data-cardname shouldn't be in quotes...it's an html attribute, like class is.  Assume that's a typo in this though, and you have it correct in the html, setting data-cardname=\"\" would mean that both cards have a \"card key\" of \"\", so one is overwriting the other.\nThe wizard object keeps an attribute, wizard.cards, which is an object/hashmap of your cards, keyed by either the data-cardname attribute, or by whatever is in the <h3> tag.  When it comes time to submit your cards, the wizard iterates over .cards to aggregate the form inputs.  But because you have 2 cards each with the same key, only one ends up existing in .cards.\nTry making all the data-cardname attributes unique and let me know if that fixes it.\n. Any luck @mntdamania ?\n. Hmm..could you just save the html of the rendered page and upload that somewhere for me to look at?  I could probably debug it from that\n. Good catch, thanks Christopher\n. Apologies for not replying sooner.  I think what you're suggesting makes sense and is a good idea.  I say go for it...here are some thoughts on how you might implement it:\nAdd a \"default_buttons\" attribute to the Wizard class.  This will store information on what the buttons will look like by default... things like color, text/html, etc.\nAdd a \"custom_buttons\" attribute to the WizardCard class.  Find where cards are changed from one to the next and test for that \"custom_buttons\" attribute.  If it exists, have the wizard use those button attributes, if not, use the \"default_buttons\" attribute.\n. Sounds great Bagga, thanks!\n. Yep, you got it.  .wizard() should only be called once per wizard on the page.  show() and hide() can be called multiple times.\n. There is no way to add a new button currently.  What kind of button did you want to add?\n. Take a look at issue #9.  Yedi might be interested in working with someone to design a button API for the wizard.  He's trying to make the buttons more customizable, but I can see adding/removing buttons being in this same category.\n. That will work for you, but not anyone else.  If you want to make them more generic, it will need to use some kind of button api.\n. Thanks Ludo!\n. Hi David,\nThis might be fixed by issue #8.  Go ahead and re-pull the sources down and see if it works for you\n. Hey Matt, I won't be able to merge this as-is, because it's allowing the modal to be created, then pulling away its styling and properties after the fact to make it look like its not a modal.  If you wanted to do it as the wizard is created, submit a pull request with the new code.  Thanks!\n. No worries, thanks Matt\n. @Alex-Sokolov sorry for such a long delay in responding.  There is currently some stub code for scrollbar support that looks nice.  Take a look at this line:\njavascript\n        /*\n         * set up slimScroll for our nav, if slimScroll is installed\n         */\n        if ($.fn.slimScroll && false) {\n            var slimScrollArgs = {\n                position: \"left\",\n                height: \"360px\",\n                size: \"8px\",\n                distance: \"5px\",\n                railVisible: true,\n                disableFadeOut: true,\n            };\n            $.extend(slimScrollArgs, this.args.slimScroll || {});\n            this.el.find(\".wizard-nav-container\").slimScroll(slimScrollArgs);\n        }\nYou would need slimscroll installed, and obviously false removed.  But that should work for you.\n. Hi @Ryuja, I will not be porting the wizard to bootstrap 3.  Are you interested in adding this functionality?\n. @Untit1ed I will merge PRs adding this support.\n. @DBSalvia Reading source code is the only way it will happen.  I have not tried the wizard with bootstrap 3, and from what I understand bootstrap 3 was completely re-architected.\n. There exists now a bootstrap-3 branch for development of bootstrap 3.  Thanks to @GJRTimmer for this.  Those of you interested in seeing this happen on bootstrap 3 could take some time to test out the demo.html of that branch and create issues for any problems you see, or features that are missing.  Tag these issues with b3 tag.\nThe current plan is when bootstrap-3 branch is done, it will be come the new master, and what's on master now will live as a bootstrap-2 branch.\n. This is done and on master now.  The old master lives on bootstrap-2 branch.  The current master has Bootstrap 3 support.  Open new issues for an problems discovered.\n@GJRTimmer deserves a huge thanks from all of us, as he took on the entire Bootstrap 3 migration himself and did an excellent job.  His contributions to this project have been huge :clap: :clap: :clap:\n. Hey @bryancallahan, sorry to leave you hanging on this.  I personally don't have much time these days to review/maintain projects I am not actively using, but I looked over your code and it's solid.  How would you feel if I added you as a collaborator with write perms on this project?\n. Done, feel free to merge :)\n. Bootstrap 3 is currently unsupported, with no current plans for support.  However, I am welcoming contributors for bootstrap 3 porting.\n. @che-burashco I took a look at your code...how would you feel about being added as a collaborator on this project?  This would give you the freedom to merge this commit and any other changes you would like to see made.\n. @che-burashco cool, you've been added.  You and @bryancallahan are both collaborators\n. @binarygeek This is good work.  Could you check with the README.md in the bootstrap-3 branch and see if there's anything missing in there that could be supplemented with your changes?  If there is, let's pull those into that readme and close this issue.\n. Hi @GJRTimmer, do you plan to continue to add commits to this pull request?\n. Feel free to leave it up.  This way people can track the progress being\nmade more easily.  Ill wait for your go-ahead before we merge it\nOn Dec 3, 2013 3:45 AM, \"Gert-Jan Timmer\" notifications@github.com wrote:\n\nYes, certainly, I'm acutely planning on withdrawing this pull request\nbecause I found out that there is still a lot to be done.\n—\nReply to this email directly or view it on GitHubhttps://github.com/amoffat/bootstrap-application-wizard/pull/45#issuecomment-29695821\n.\n. There are no current designs for how a responsive wizard should look, so I don't believe, for the current bootstrap 3 upgrade, that anyone is working on it.  Realistically this will probably be a future enhancement long after the upgrade lands.\n. I think your solution would work well :+1: \n. good work @asafyish \n. Hi @wong2, sorry to leave you hanging.  I will have some time tomorrow to review and merge the fix.  Thanks for taking the time to submit a PR\n. I appreciate you following up on this @Zearin.  I've updated the README to communicate that I am no longer maintaining this project.  This will include reviewing PRs and responding to issues.\n. \n",
    "bluetidepro": "It may be good to have in the options to toggle that, because I personally prefer that a wizard progress bar represents where I am in the steps of the process. Even if I go backwards, I prefer that it follows me.\n. You know, I honestly don't know why Github added those whitespace changes because I didn't even touch that \"demo.html\" file. Sorry about that, not sure what happened with that?\n. Thanks! :+1: :)\n. ",
    "caniszczyk": "Can you just add a LICENSE file at the root? Makes it really easy to find :)\n. ",
    "GJRTimmer": "This will have to be part of a responsive update for the wizard.\n. @pushpinderbagga Can you give an update ?\nWill it work when you include the following within HTML <head>\nhtml\n<!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->\n<!-- WARNING: Respond.js doesn't work if you view the page via file:// -->\n<!--[if lt IE 9]>\n<script src=\"js/html5shiv-3.7.0.js\"></script>\n<script src=\"js/respond-1.3.0.min.js\"></script>\n<![endif]-->\nScript can be found within the bootstrap-3 branch within the demo/js\n. Marked as enhancement for B3 Branch.\n. Pull Request to old, and parameter msg not present any more in B2 (master) Branch.\n. @rbrondi, @pouki06 Could you send some testing code for reproduction of this issue ?\n. Duplicate of #10 \n. @mgufrone Is this request still active ? If so and you are unsatified with the following answer, please re-open.\n@mgufrone can you provide more specifics about what you mean, because you can use Ajax in you validation function. I'm actually using one in combination with a domain lookup, where the server is preforming the lookup. And I call the remote lookup from Ajax.\nWhat I understand from you question is that you simple have to set the async: false on your Ajax call so that your validation function does not return before the Ajax call has been completed.\nHope this helps.\n. We will have a Bootstrap-v3 version ready soon.\n. What would be the reason to have 1 wizard with 3, and only use 1 specific card at the time, why not simply using 3 smaller wizards. That way you also have a separation of concern within you modal view ?\nMarked as won't fix.\nIssue will be reopened based upon the reason why it would be important / handy to have 1 wizard with 3 cards each one acting separate like an independent wizard.\n. wizard.trigger is used to fire an registerd event.\nFor you to reset the wizard, you have to register a reset event, like:\njavascript\nwizard.on(\"reset\", function() {\n    // Functions / commands which reset you controls, like clearing inputs.\n});\nAfter a successful submission the wizard resets and triggers the reset method you registerd. And you are all set.\nLook at the code of the demo in demo.html for an example.\nHope this helps.\n. @shravan116 \nYou could try the following.\nFirst you add the wizard object to the Ajax Object.\njavascript\n$.ajax({\n    url: '/submiturl',\n    type: \"POST\",\n    data: wizard.serialize(),\n    wiz: wizard,\n    success: function(response) {\n        // Use you wizard with this.wiz // wiz.\n        // This way your Ajax call has a correct reference and \n        // you should be able to reset the wizard correctly.\n    }\n});\nHope this helps, If not re-open.\n. Comment placed on stackoverflow, @randytan did not place any reaction to the placed solution of the stackoverflow reaction. \nDemo code is similar to what @randytan is trying to achive. Demo is working.\nIssue Closed.\n. Refactoring of @RWOverdijk is too old, personal Fork of @RWOverdijk is not compliant with current application wizard (bootstrap v2.x)\nno-modal template is completely missing.\nPull Request Not Accepted.\n. bootstrap-3 branch is ready for the switch.\n. The links are build based upon the cards, and the navigation is linked to the cards.\nThe only way currently to achive what you want is to either build your own custom version of the wizard or by injecting your custom link with jQuery.\nI do not know at the moment how the event listeners will react to custom injection when you click a link.\nHope this helps a little.\n. @amoffat Is this something we have to incorporate ?\nDo we want to incorporate this. I have added a comment section of this code to the B3 branch for the disable() function and the enable() to show it.\nWhat do you think ? Hide the navigation by default or do we have let it up to a parameter ?\n. @rajprince \nTo resolve this, first initialize all wizards, and save them in variable.\njavascript\nvar wizard_32 = $(\"#wizard_32\").wizard({\n    show: false\n});\nOn your click event you them only have to do refer to the variable.\njavascript\n$(\".button\").on(\"click\", function() {\n    var id = $(this).data(\"btnid\");\n    switch (id) {\n        case 32:\n            wizard_32.show();\n            break;\n    }\n});\nI hope you understand what I'm trying to show here.\nHope this helps you in the right direction.\n. Tested; this behavior is not present, and unable to be reproduced in the bootstrap-3 branch.\nFixed in B3 Branch, If this still occurs in current b2 (master) branch, please resubmit. \n. Registered as new enhancement for Bootstrap v3 version.\n. Duplicate of #51 \n. Duplicate of #43 \n. This PR has been manually been added to the B3 branch.\nAwaiting merge approval/reject into the B2 Master\n. Yes, certainly, I'm acutely planning on withdrawing this pull request because I found out that there is still a lot to be done.\n. Oke, sounds good, just finished updating the demo v3. Check it out, it will be basic. Also don't know if i;m going to keep the bootstrap v2.x.\nCan you tell me if the wizard-no-modal is a required piece, because currently i've dropped that functionality because I don't need it in my project i'm working on. Maybe it's an idea to re-add it later on ?\n. Rewrote the README.md.\nHope everyone likes my proposal for the new readme for the bootstrap v3 setup.\n. Bases upon the comments of the blog of panopta, I've included the default bootstrap modal option 'backdrop' this allows the wizard not to close when clicking on the backdrop of the modal when the option is set to static\n. Closed due to the creation of a bootstrap v3 branch by @amoffat \nAll changes are directly be made into this branch. Personal Fork Removed.\n. Update the CSS with cross-browser vertical alignment of the modal.\nIssue Closed\n. Just found out that when using with a multiple monitor setup in chrome it's not aligned correctly on all monitors.\n. Issue fixed with javascript\nCompleted\n. I'm Working on it.\n. Functionality Copy Done & Tested.\nClosed.\n. I agree with @amoffat this will be a possible enhancement for the future. Right now we first want to upgrade to bootstrap v3.\n. Closed while awaiting test results.\n. I think you could do the following:\n- implement the jquery file upload plugin\n- implement a seperate step where you transmit the file using ajax to the server.\nIn both cases it's maybe an idea to transfer the file to the server with ajax  have it stored on the server  while transferrring you cannot complete the wizard step  and on submit of the wizard you can processes the file further on which is already on the server.\nThis would be one of the solutions I would personally look into when dealing with files in combination eith the wizard.\nI dont want my wizard to upload a file  only a filename so I have control over the transmit.\nHope this helps you a bit.\nGert\n. Closed\n. Interesting, could you please post which browser you are using. With the latest Chrome, I'm using locally, I don't have this issue. Maybe there is a CSS conflict between Chosen and B3.\n. Within the demo page, the data-onload attribute of the 'Monitoring Location' is indeed empty. The cities are hardcoded into the example for demo purposes. You are correct, this a a possible typo error in the demo html.\nThe attribute 'data-loaded' can be used to fire an event for lazy loading data objects into your card. For example by using a basic jQuery Ajax call.\n. ",
    "icholy": "what's with all the whitespace changes?\n. ",
    "mntdamania": "Sorry for the delay.. Just tried above mentioned solution.. It doesn't submit all fields. Only first card attributes are submitted.. Want me to create a demo Rails app for the same?\n. @htapal it works. Sorry for being late @amoffat . \n. ",
    "htapal": "Move this line\njavascript\n<%= simple_form_for(@user, :html => {:id => \"new_user\"}) do |f| %>\noutside the wizard DIV.  \nThe simple_form_for call being in the first card renders the form tag within that card and as a result when jquery serializes the form fields it picks up whatever is within the form tag within the first card only.\n. ",
    "canesin": "Solved: when using a reactive rendering the wizard creation should be done only in the first rendering of the template  (emulating the jQuery onLoad):\nif(!this._rendered) {\n    this._rendered = true;\n    var newStudyWizard = $(\"#newWizard\").wizard({});\n    $(\".createNewWizardButton\").click(function() {\n      newStudyWizard.show();\n    });\n  };\n. ",
    "domino14": "What prevents .wizard() from being called multiple times? I'd love to create a dynamic wizard (number of pages not known until runtime), and I got it working the first time, but there are problems when I close and re-open the wizard.\n. ",
    "marti1125": "I want to add two buttons because my crud form needs\nI'm trying to modify your plugin.\nI would like to add two buttons like this:\n<input type=\"submit\" class=\"btn btn-primary\" name=\"_saveAndContinue\" value=\"&{'crud.saveAndContinue', type.modelName}\" />\n        <input type=\"submit\" class=\"btn btn-primary\" name=\"_saveAndAddAnother\" value=\"&{'crud.saveAndAddAnother', type.modelName}\" />\nthanks in advance.\n. so..\ni create this example\nhttps://gist.github.com/marti1125/5042649\n. ",
    "WDC": "Perfect! Thanks very much. \nI had thought I searched well enough to see if this was a duplicate question - sorry!\n. ",
    "mj1856": "Yeah, it's a hack.  Not sure when I will have time to do it properly, but I will submit a pull request if I do.  Maybe you will figure it out before then. :)\n. @pradeshc  - Thanks!\n. @Ryuja - If you (or anyone else) are planning a fork for Bootstrap 3, please let us know here.  Thanks.\n. ",
    "pradeshc": "I know this is an old post, but the solution is available in the bootstrap 3 branch\nhttps://github.com/amoffat/bootstrap-application-wizard/tree/bootstrap-3\nThis can be enabled by setting the isModal property to false in the wizard constructor.\nphp\n    var wizard = $('#satellite-wizard').wizard({\n       keyboard : false,\n       contentHeight : 400,\n       contentWidth : 700,\n       isModal:false\n    });\nStrangely, the code to support this is not available in the plugin source delivered with the distribution on the download link. However, the minified version (bootstrap-wizard.min.js) contains the feature.\n<script src=\"../src/bootstrap-wizard.min.js\" type=\"text/javascript\"></script>`\n. ",
    "geekytime": "If you have a release that you could tag as Bootstrap 2.3.x compatible, that would be helpful for some folks, too. :wink:\nI am converting a project to Bower, and it is stuck on BS 2.3, for now...\n. ",
    "bbodenmiller": "+1\n. This also relates to https://github.com/amoffat/bootstrap-application-wizard/issues/16.\n. ",
    "pouki06": "Hey, thanks for the workaround which not working for me... I found another workaround if someone else searching a \"temporary\" solution. \n```\n     errorPopover: function(el, msg) {\n        this.log(\"launching popover on\", el);\n        //resets popover data if a popover has been already instantiated for the element\n        if(el.data('popover') != undefined) {\n            el.data('popover', null);\n        }\n        if (el.next().hasClass(\"error-popover\")) {\n            el.next().remove();\n        }\n    var popover = el.popover({\n        content: msg,\n        trigger: \"manual\"\n    }).popover(\"show\").next(\".popover\");\n\n    popover.addClass(\"error-popover\");\n    return popover;\n},\n\n```\n. ",
    "pdbreen": "Using the code as of 01/21/14, I added the following to the very start of the WizardCard.validate function to better support multiple/different types of validation on the same element or multiple errors during card validation:\nJavaScript\n            /* \n             * Get rid of any current errors\n             */\n            self.wizard.hidePopovers();\n. ",
    "yash-dholakia": "Yes,\nwizard.hidePopovers();\nWorks perfectly.\nThanks @pdbreen !!\n. ",
    "pawel1392": "Both solutions doesn't work properly in my case, so I found out another option : \nThere is enought to add only one line in bootstrap-wizard.js\n```\nsetCard: function(i) {\n            this.log(\"setting card to \" + i);\n            this.hideSubmitCards();\n            var currentCard = this.getActiveCard();\n        if (this._submitting) {\n            this.log(\"we're submitting the wizard already, can't change cards\");\n            return currentCard;\n        }\n\n        var newCard = this._cards[i];\n        if (newCard) {\n            if (newCard.isDisabled()) {\n                this.log(\"new card is currently disabled, returning\");\n                return currentCard;\n            }\n\n            if (currentCard) {\n    this.hidePopovers();  // <---- This line hide every errorPopups before validation\n                /*\n                 * here, we're only validating if we're going forward,\n                 * not if we're going backwards in a step\n                 */\n                if (i > currentCard.index) {\n                    var cardToValidate = currentCard;\n                    var ok = false;\n\n```. ",
    "mgufrone": "well, i'll try it then before i reopen this issue. Thanks for your answer\n. ",
    "adamkearsley": "Ok so... if anyone is interested...\nI managed to add a little code to hide a specific card(s)\ndisableCard: function(card, i) {\n            this.log(\"hiding card \" + i);\n            this._cards[i].disable();\n            this.hideSubmitCards();\n            this.el.find('#'+card+' input').removeAttr(\"data-validate\");\n            // this.find('input').removeAttr(\"data-validate\");\n            return this;\n        },\nnow you can just use\ndisableCard('mycard', 3);\nmycard being the ID of the card, and 3 being the 3rd card.\nI passed the id of the card so tat i can remove the validation and skip the card.\nI havent added this to anything but my own project, might come in handy for others though.\n. ",
    "ilpapabuono": "In my example, I've a 4-step (n-step potentially) wizard generator of a complex article code. There are some cases where some condition at the \"m\" step would cause the process to stop and skip to the end. A such hiding (better disabling) mechanism would be useful...\n. ",
    "engineer": "hello just this wizard.updateProgressBar(0); without underscore \nregrats !!\n. ",
    "Alex-Sokolov": "+1 for adding into plugin\nWhen initialize modal need pass some additional parameters. Now:\njs\nshow: function() {\n            this.log(\"showing\");\n            if (this._firstShow) {\n                this.setCard(0);\n                this._firstShow = false;\n            }\n            this.el.modal();\n            return this;\n        },\nFor disabling close when clicking on background or pressing Esc button must be:\njs\nshow: function() {\n            this.log(\"showing\");\n            if (this._firstShow) {\n                this.setCard(0);\n                this._firstShow = false;\n            }\n            this.el.modal({\n                backdrop: 'static',\n                keyboard: false\n            });\n            return this;\n        },\nFrom Bootstrap options: http://twitter.github.io/bootstrap/javascript.html#modals\n. But maybe if I haven't installed slimscroll add this css-rule to container?\nWithout rule:\n\nWith rule:\n\n. ",
    "bryancallahan": "Problem resolved. Please pass in your modalOptions configuration on show(). https://github.com/amoffat/bootstrap-application-wizard/pull/29\n. This pull request wouldn't merge cleanly but I integrated your change for the modal options (https://github.com/amoffat/bootstrap-application-wizard/commit/f0abf5d0183b6538caf86067b992b40544045b9a). Thanks @burrowsa!\n. Hey Andrew, any news on this merge request? Thanks so much.\n. That would be great @amoffat. Thanks. :)\n. Finishing merging these fixes and tweaks (skipped on the forceNavSequence functionality for now since it needs more testing before merge). Closing issue.\n. Welcome aboard @che-burashco :)\n. ",
    "joekuzma": "I also am having this same issue... When I have a data-validate on a text box on the last card, it ignores the data validation... If I add a blank card after this last one, it does work though....\nWould be nice to figure out how to fix this.\n. ",
    "RWOverdijk": "The big diff is tabs vs spaces.\n. I've actually stopped caring as I've forked this project. Thanks for the quick review though.\n. ",
    "elwadi": "https://github.com/OrcaSystems/bootstrap-application-wizard/commit/a64498b7b19a950490c49b9f04d9841c92893b54\n. ",
    "glynjackson": "@elwadi nice! Thanks\n. ",
    "Untit1ed": "There should definitely be support for bootstrap 3\n. ",
    "absentdream": "to get close button to show I had to add line 582\nif (this.args.showClose) { this.closeButton.show(); }\nmany thanks\ncalvin\n. ",
    "ghost": "@amoffat Do you know specifically what might cause your code to not work with BS3? And if not are there any hints you can share? Trying to use this for a project at work, but I don't want to lose too much time reading source code ;) thanks \n. :+1:\n. ",
    "faeron": "Awesome, waited long for this update! Would be urgent here :)\n. ",
    "che-burashco": "Hope it helps, if there are any problems with updates in commits, just let me know - I will fix it within couple of days \n. @amoffat That sounds great, I'd love to do that\n. @amoffat, @bryancallahan Thanks guys\n. ",
    "korakanchan": "Added hide css this.nav.addClass(\"hide\");in disable method while hiding the card.\ndisable: function(hideCard) {\n            this.log(\"disabling\");\n            this._disabled = true;\n            this.nav.removeClass(\"active already-visited\");\n            if (hideCard) {\n                this.el.hide();\n                this.nav.addClass(\"hide\");\n            }\n            this.trigger(\"disabled\");\n            return this;\n        },\n. ",
    "MaarekElets": "This may actually belong as a separate issue, but it presented itself while I was enabling the code from this issue and is related. Part of the enable code is to add .active to the tab. Depending on where you are toggling the enable, you might not want this behavior (it also causes an issue with items in the card if it is the immediately next card as they will be hidden if you click next). To address this, I added this code to my local version which operates on the same idea of GJRTimmer's change to .disable()....\nenable: function(noactivate) {\n            this.log(\"enabling\");\n```\n        // Issue #38 Hiding navigation link when hide card\n        // Awaiting approval\n        //\n        this.nav.removeClass('hide');\n    //Added activate option to allow for optional immediate activation of the tab\n    if (!noactivate) {\n        this.nav.addClass(\"active\");\n    }\n    this._disabled = false;\n    this.trigger(\"enabled\");\n    return this;\n}\n\n```\n\nI'm new to github, so I'll leave it to others to decide if this needs to be considered for the main code. \n. I'm going to be using this Fork until it hits the main branch. I prefer your way of fixing the validation issue to the hack I applied in my personal code. Thanks!\n. Upon testing and further review of the code, I don't believe it operates correctly or at least it doesn't for what I am doing. Using the existing code, when I click next and a disabled tab is the next tab then it appears that the ending index is increased by 1 as well as the current index, which means that the landing tab is run through the validation (and fails obviously if it has any validation on it). Also it appears that the initial card is not hidden as both the card I left and the target card displayed. I'm putting in a pull request from a fork I made of this repo that does a disabled check on just the point where validation is run (and returns ok if it is disabled) which when I test functions as desired.\n. ",
    "rajprince": "I figured out the problem. The plugin is trying to create a new wizard and show it. But i'm unable to resolve it.\n. @rodrigomaia17  Hi, I'm trying to use this. But The wizard goes to the bottom of the page. It doesn't work properly.\nWhat do you mean by \"pass the arg 'container' with the container for the wizard\"  ?\nThanks.\n. ",
    "SeoRoman": "I'm doing the exact same thing, but again the issue is the re-initilalizing of the wizard component, but it seems illogical to load 100+ wizard forms if you are only going to use 1 or 2 of them on a page...\n* EDIT *\nhere is how I fixed the issue...\n```\n\n    $(function() {</p>\n<pre><code>    var wizards = [];\n    var options = {\n        keyboard : false,\n        contentHeight : 400,\n        contentWidth : 700,\n        backdrop: 'static'\n    };\n\n    $.each($('.wizard'), function(index, value) {\n        wizard = $(value);\n        wizards[wizard.attr('id')] = wizard.wizard(options);\n    });\n\n    $.fn.wizard.logging = true;\n\n    $('a[data-wizard-id]').on('click',function(e) {\n        e.preventDefault();\n\n        var form = $(this).data('wizard-id');\n        wizards[form].show();                \n    });\n\n});\n</code></pre>\n<p>\n```\nThis way, all wizards will be loaded when the page loads (for that page) and pushed into the wizards array... Then, you can reference each wizard by the 'id' which is now the array key index of that initialized wizard.\n. ",
    "binarygeek": "sure I'll take a look when I get some time. kinda busy right now but hope to be free soon.\n-K\n. ",
    "Joyrex": "So I take it by this that the BS3 implementation does NOT support the Wizard in anything other than a Modal?\n. ",
    "RobTrehy": "Hacked method, not the neatest but works:\nbootstrap-wizard.js - \nLINE 377 becomes:\n    '<div class=\"wizard\">', // Remove modal and fade classes\nLINE 420 becomes:\n   backdrop: false, // Or set through options\nFairly sure they were the only two changes I made!\n. ",
    "lgt": "should be something like\nvar option  = {\nisModal: false,\ncontainer: '.my_container',\n}\nvar wizard = jQuery(\"#my-wizard\").wizard(options);\nand you have to use @rodrigomaia17 's commit. However does not work with Bootstrap3\n. thank you for the feedback!! Actually what you suggest to override the default wizzard submit and is good like, however I was trying the following as you suggested\n wizard._defaultSubmit = function(wizard) {\n            jQuery('form').submit(function( event ) {\n                alert( \"test submit\" );\n                event.preventDefault();\n            });\n        };\n\n        wizard.on(\"submit\", wizard._defaultSubmit);\n\nand I expect to get an alert but is not happening. No errors in firebug are reported\n. thanks again for your feedback. The wizzard has a form tag already this one should be changed? Is there a way to upload files via ajax on form submit?\n. okay let me give a try this issue hangs on my neck almost for 1 week and thanks again for your nice feedback\n. I made a switch from jasny to blueimp  and I try now to use it for multiple file uploads with other form elements. \n. ",
    "StitchGit": "Thank you,\nI'm trying to implement the second option.\nI'll let you know.\nStitch\n. ",
    "jogaco": "I liked the wizard but didn't need the modal features, so I used it with a standard submit. One of my steps has a file upload.\nI tweaked the implementation like this. Might not be the best one but worked:\nvar wizard = $('#my-wizard').wizard({ showCancel: true, progressBarCurrent: true });\nwizard._defaultSubmit = function(wizard) {\n  $('form').submit();\n};\nwizard.on(\"submit\", wizard._defaultSubmit);\n. You need to enclose your wizard within form tags with the corresponding url. It should work.\nFor instance, bearing in mind you want to upload files:\n<form method=\"post\" id=\"myform\" enctype=\"multipart/form-data\" action=\"/myaction\">\n   your wizard markup here\n</form>\nLet me know.\n. I did comment out the \n<form>\ntags in the bootstrap-wizard.js template code. Try it. As you need to do file upload your form must include the multipart encoding. As for ajax file upload, that's a different beast. I didn't need it so I opted for a simpler solution.\n. I'd recommend you too to use bootstrap-fileupload.js from https://github.com/jasny/bootstrap/releases/tag/v2.3.0-p4 as it replaces the ugly file upload button with a nice bootstrap styled button, and offer the possibility of image preview in some browsers as well.\n. ",
    "srk23": "Looking at the jquery ajax documentation, if you specify data-type: json (as bootstrap-wizard.js does) then the server has to return valid JSON for success (this can simply be \"{}\" if you need no data returned).\nFor example, I am using a PHP script to process the data sent to the server.  I just return the following code:\n\n<?php\nheader('Content-type: application/json');\necho('{}');\n?>\n\nThis fires the success function correctly.  I can access the posted variables in PHP using \n\n$_POST['variable_name'];\n\nAn alternative would be to modify the js to remove the data-type specification.  It would be worth highlighting that the server response needs to be valid JSON for the default submit method in the documentation.\n. ",
    "bucktower": "EDIT: You can simply use wizard._onNextClick.call(wizard); instead!\n\nI don't think there's a simple command for that. In case you are wanting to do this in order to force the user to do something before they can advance to the next card, an easy work around is to hideButtons() upon load:\n```\n$(function() {\n    var options = {contentHeight: 500,\n                    contentWidth: 750,};\n    wizard = $(\"#apply-wizard\").wizard(options);\n    $.fn.wizard.logging = true;\n// @ first, hide the next button so that user must log in before proceeding past 1st step\nwizard.hideButtons();\n\n$('#open-wizard').click(function(e) {\n                e.preventDefault();\n                wizard.show();\n            });\n\nwizard.on(\"submit\", function() {\n  console.log(wizard.serialize());\n});\n\n});\n```\nOr, if it isn't on the first card, you could use something like this:\n// whenever a user goes to the next card\nwizard.on(\"incrementCard\", function() {\n    // Check and see if it's the card that you want\n   if(wizard.getActiveCard() == YOUR_CARD) {\n      wizard.hideButtons();\n   }\n});\nThen showButtons() at the end of whatever function that will be activated when they complete the action.\n. ",
    "fatmuemoo": "+1 Please add bower support\n. ",
    "ludwigm": "I tried it out with current Chrome stable channel, the alpha channel and the recent Safari. It happens with all. Just downloaded the zip and open the demo.html. No changes to the code.\nBut I think I did find the bug. It is a chosen Css. Look at the following screenshots:\n\n. ",
    "wa7eedem": "the same issue exist in branch : bootstrap-3 (bootstrap-wizard.js) only\n. ",
    "wong2": "@amoffat hi, have you seen this?\n. ",
    "opensourcechris": "This would be a helpful feature.\n. This worked for me also. Is this a workaround or a real fix? If it's a real fix I can send a pull request.\n. ",
    "zhangxin511": "OK, I figured out what is going on:\nIn the demo.html, there is a piece of code that listen to reset event:\njs\n                wizard.on(\"reset\", function() {\n                    wizard.modal.find(':input').val('').removeAttr('disabled');\n                    wizard.modal.find('.form-group').removeClass('has-error').removeClass('has-succes');\n                    wizard.modal.find('#fqdn').data('is-valid', 0).data('lookup', 0);\n                });\nThe line\njavascript\nwizard.modal.find(':input').val('')\nwill remove radio and hidden, because they are attribute of input. While the value of option of select element will survived.\nCould we change the example in demo.html? I believe a lot of people like me know little about js will use the examples in demo.html directly or make changes on these examples while don't know what it exactly it is dong.\n. ",
    "KuenzelIT": "I looked at this issue again and found a solution with the \"shown.bs.modal\" event of a bootstrap modal (http://getbootstrap.com/javascript/#modals-usage).\nJust define an event handler on the wizards underlying modal:\nwiz.modal.on('shown.bs.modal', function(e){\n    $('#name').focus();\n});\n. I'm experiencing the same problem. I assume that if the status doesn't change, the message stays the same? Did you find a solution?\n. This seems to be an underlying problem of the bootstrap popover. There are some ugly workarounds, but I dont' even know where to put them. Seems easier to just use the bootstrap popover directly.\n. Alright, I did just put a destroy at the beginning of my validation function. Easy but not very clean.\nel.popover(\"destroy\");\n. Found it. Seems I was a little bit lazy before looking into the source.\nwiz.cards[\"cardName\"].validate();\n. ",
    "brad-decker": "My functions:\n        function validateRequired(el) {\n            if (el.val() == \"\") {\n                return {status: false, msg: \"Please supply a \" + el.attr(\"placeholder\")}\n            }\n            return {status: true}\n        }\n        function validateUniqueness(endpoint, el) {\n            var unique = $.getJSON(endpoint + el.val() + \"/\");\n```\n        if (unique.success == \"true\") {\n            return {status: false, msg: \"The value you've chosen is not unique\"}\n        }\n    return {status: true}\n}\nfunction validatePortalValue(el) {\n    var endpoint = \"{{ __SERVERSIDECODE__ }}\";\n    var retValue = validateRequired(el);\n    if (retValue.status === true) {\n        retValue = validateUniqueness(endpoint, el);\n    }\n    return retValue;\n}\nfunction validatePortalName(el) {\n    var retValue = validatePortalValue(el);\n    if (retValue.status === true) {\n        if (hasWhiteSpace(el.val())) {\n            retValue.status = false;\n            retValue.msg = \"The Portal Name must have no spaces.\";\n        }\n    }\n    return retValue;\n}\n\n```\n. one final comment, the validatePortalName function is the master function that is called from the data-validate property\n. ",
    "pvegetah": "I have a question what was the class name when using a search box in drop down in Service Selection. I just wonder about the search box inside the drop down.\n. ",
    "jimaek": "The new backend is live. It pulls files directly from npm and github https://github.com/jsdelivr/jsdelivr#usage\nExample https://cdn.jsdelivr.net/npm/jquery@3.1.1\nExample directory listing https://cdn.jsdelivr.net/npm/jquery@3.1.1/. ",
    "sjs": "Also, I moved \"return false\" to the front of the function, and the validation failed, as expected.  Something about the AJAX request and response is causing the validation to be missed.\nAttached is a complete log of what I see, with logging turned on. Sorry, but the log also includes the file that's being run and the line number—I copied and pasted this from Chrome's JS console.\nwizard undefined:  Creating Cards bootstrap-wizard.js:444\nwizard undefined:  setting title to My Cart bootstrap-wizard.js:444\nwizard undefined:  adding listener to event submit bootstrap-wizard.js:444\ncard 'card1':  adding listener to event validate bootstrap-wizard.js:364\nwizard undefined:  showing bootstrap-wizard.js:444\nwizard undefined:  setting card to 0 bootstrap-wizard.js:444\nwizard undefined:  hiding success submit card bootstrap-wizard.js:444\nwizard undefined:  hiding error submit card bootstrap-wizard.js:444\nwizard undefined:  hiding failure submit card bootstrap-wizard.js:444\nwizard undefined:  hiding loading submit card bootstrap-wizard.js:444\nwizard undefined:  getting active card bootstrap-wizard.js:444\nwizard undefined:  couldn't find an active card bootstrap-wizard.js:444\ncard 'card1':  selecting bootstrap-wizard.js:364\ncard 'card1':  looking for listener onloaded bootstrap-wizard.js:364\ncard 'card1':  didn't find listener onloaded bootstrap-wizard.js:364\ncard 'card1':  firing event loaded bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for loaded bootstrap-wizard.js:364\ncard 'card1':  looking for listener onreload bootstrap-wizard.js:364\ncard 'card1':  didn't find listener onreload bootstrap-wizard.js:364\ncard 'card1':  firing event reload bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for reload bootstrap-wizard.js:364\ncard 'card1':  looking for listener onselected bootstrap-wizard.js:364\ncard 'card1':  didn't find listener onselected bootstrap-wizard.js:364\ncard 'card1':  firing event selected bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for selected bootstrap-wizard.js:364\nwizard undefined:  changing next button, text: undefined class: btn-primary bootstrap-wizard.js:444\nwizard undefined:  handling 'next' button click bootstrap-wizard.js:444\nwizard undefined:  getting active card bootstrap-wizard.js:444\nwizard undefined:  found active card WizardCard {wizard: Wizard, index: 0, prev: null, next: WizardCard, el: m.fn.init[1]…} bootstrap-wizard.js:444\nwizard undefined:  incrementing card bootstrap-wizard.js:444\nwizard undefined:  getting active card bootstrap-wizard.js:444\nwizard undefined:  found active card WizardCard {wizard: Wizard, index: 0, prev: null, next: WizardCard, el: m.fn.init[1]…} bootstrap-wizard.js:444\nwizard undefined:  searching for valid next card bootstrap-wizard.js:444\nwizard undefined:  looking at card 1 bootstrap-wizard.js:444\nwizard undefined:  setting card to 1 bootstrap-wizard.js:444\nwizard undefined:  hiding success submit card bootstrap-wizard.js:444\nwizard undefined:  hiding error submit card bootstrap-wizard.js:444\nwizard undefined:  hiding failure submit card bootstrap-wizard.js:444\nwizard undefined:  hiding loading submit card bootstrap-wizard.js:444\nwizard undefined:  getting active card bootstrap-wizard.js:444\nwizard undefined:  found active card WizardCard {wizard: Wizard, index: 0, prev: null, next: WizardCard, el: m.fn.init[1]…} bootstrap-wizard.js:444\ncard 'card1':  after validating inputs, failures is false bootstrap-wizard.js:364\ncard 'card1':  running listener validator bootstrap-wizard.js:364\ncard 'card1':  looking for listener onvalidate bootstrap-wizard.js:364\ncard 'card1':  didn't find listener onvalidate bootstrap-wizard.js:364\ncard 'card1':  firing event validate bootstrap-wizard.js:364\ncard 'card1':  found event handler, calling validate bootstrap-wizard.js:364\nObject {status: \"error\", errors: Object, success: Object} app.js:247\nfailed app.js:250\ncard 'card1':  after running listener validator, failures is false bootstrap-wizard.js:364\ncard 'card1':  validated, calling listeners bootstrap-wizard.js:364\ncard 'card1':  looking for listener onvalidated bootstrap-wizard.js:364\ncard 'card1':  didn't find listener onvalidated bootstrap-wizard.js:364\ncard 'card1':  firing event validated bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for validated bootstrap-wizard.js:364\ncard 'card1':  looking for listener ondeselect bootstrap-wizard.js:364\ncard 'card1':  didn't find listener ondeselect bootstrap-wizard.js:364\ncard 'card1':  firing event deselect bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for deselect bootstrap-wizard.js:364\ncard 'card1':  marking as visited bootstrap-wizard.js:364\ncard 'card1':  looking for listener onmarkvisited bootstrap-wizard.js:364\ncard 'card1':  didn't find listener onmarkvisited bootstrap-wizard.js:364\ncard 'card1':  firing event markVisited bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for markVisited bootstrap-wizard.js:364\ncard 'card1':  looking for listener ondeselect bootstrap-wizard.js:364\ncard 'card1':  didn't find listener ondeselect bootstrap-wizard.js:364\ncard 'card1':  firing event deselect bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for deselect bootstrap-wizard.js:364\ncard 'card1':  marking as visited bootstrap-wizard.js:364\ncard 'card1':  looking for listener onmarkvisited bootstrap-wizard.js:364\ncard 'card1':  didn't find listener onmarkvisited bootstrap-wizard.js:364\ncard 'card1':  firing event markVisited bootstrap-wizard.js:364\ncard 'card1':  couldn't find an event handler for markVisited bootstrap-wizard.js:364\ncard 'card2':  selecting bootstrap-wizard.js:364\ncard 'card2':  looking for listener onloaded bootstrap-wizard.js:364\ncard 'card2':  didn't find listener onloaded bootstrap-wizard.js:364\ncard 'card2':  firing event loaded bootstrap-wizard.js:364\ncard 'card2':  couldn't find an event handler for loaded bootstrap-wizard.js:364\ncard 'card2':  looking for listener onreload bootstrap-wizard.js:364\ncard 'card2':  didn't find listener onreload bootstrap-wizard.js:364\ncard 'card2':  firing event reload bootstrap-wizard.js:364\ncard 'card2':  couldn't find an event handler for reload bootstrap-wizard.js:364\ncard 'card2':  looking for listener onselected bootstrap-wizard.js:364\ncard 'card2':  didn't find listener onselected bootstrap-wizard.js:364\ncard 'card2':  firing event selected bootstrap-wizard.js:364\ncard 'card2':  couldn't find an event handler for selected bootstrap-wizard.js:364\nwizard undefined:  changing next button, text: undefined class: btn-primary bootstrap-wizard.js:444\nwizard undefined:  firing event incrementCard bootstrap-wizard.js:444\nwizard undefined:  couldn't find an event handler for incrementCard\n. And now I feel silly.  The issue was that I was returning a value for the $.ajax function, rather than the main function.  With out a \"return false\" within the main function, that function was returning true.\n. ",
    "rdevries": "that doesnt seem to unlock the cards for me. ",
    "Zearin": "@amoffat ping\n. ",
    "Aayush-Kasurde": "Hi @jamiehall84 you are facing this issue as you have not written validation function mentioned in form element. Code is trying to find that function and is not able to find that function so it is raising \"TypeError...\"\nFor example:\n<input type='text' ... data-validate='functionToValidate'>\nif you don't write function functionToValidate then it will raise error.\nTry it and let me know\n. ",
    "anagio": "@snipiba as a work around to show the wizard when the page loads, you may use the function wizard.show(); after the wizard is initialized, from the demo an example is\n```\n            var wizard = $('#satellite-wizard').wizard({\n                keyboard : false,\n                contentHeight : 400,\n                contentWidth : 700,\n                backdrop: 'static'\n            });\n        wizard.show();\n\n```\n. ",
    "shweta-bb": "I myself solved this issue. \nThis piece of code solved the problem.\nserviceWizard = $('#monitor-wizard').wizard(options);\nif (serviceWizard._cards.length != 0) {\n         wizardReference = serviceWizard;\n } else {\n         serviceWizard = wizardReference;\n }\n. ",
    "xewl": "Indeed, the show option doesn't work correctly.\nI've set it to false, and chained the wizard.show()-function instead.. ",
    "chernandezosma": "Even using wizard.show() fails.\nMy code is like this\n$('#add-new-member').click(function(event) {\n                var wiz = setupWizard('new-member-wizard');\n                wiz.reset();\n                wiz.show();\n            });\nAnd fails the second time that you load the wizard the content is blank\n. ",
    "emulienfou": "Hi, I just upgrade this wizard to Bootstrap 4, if anyone is interested the fork is here: https://github.com/emulienfou/bootstrap-application-wizard. ",
    "dfranco": "same question here .... ",
    "cougit": "And wouldn't you believe I was not using the proper data tag... works fine when you use \"data-validate\" and not \"data-validation\". UGH!!!!. Forgot to close.... "
}