{
    "ArtSabintsev": "Hey Pius,\nI'll take a look at this tonight and merge the pull request after checking it.\nThanks!\n. Haven't forgotten about this - just been bogged down a bit. Will definitely do it tonight.\n. Accepting the pull request. Thanks again, Pous. Will be adding one more change later today as well. \n. Pushed v1.0.1 after the merge. gave you credit in the releases notes at the bottom :)\nI also added more info into the ReadMe that'll help you and others with future app updates.  \nThanks again for your help!\n. Hey joshuatbrown, \nThanks for the submitting this code!  I'll take a look at it and merge it in the next 48 hours.\nBest,\nArthur\n. Hey alexruperez, \nThanks for the submitting this code!  I'll take a look at it and merge it in the next 48 hours.\nBest,\nArthur\n. Hey Alex,\nI decided not to add your changes yet. Instead, in the latest build, I gave the user the ability to customize the UIAlertView strings, which makes internationalization much harder.\nCheck the latest commit to see what I'm talking about.\nWhat do you think?\n. Alright, I looked over the code. I think it'll work even with the changes I made. Will get back to you in 24-48 hours! \n. @alexruperez \nI will be making one more change that involves strings. I will publish it later today. At that point, feel free to localize the code one final time, and I will definitely merge it. \nSame message goes to you @whdvl\n. @alexruperez @whdvl I pushed all my changes. All that's left is a proper way to incorporate I18n. \nStill up to the task? Sorry for asking for a revision.\n. Robust localization is now available in v2.3.0, thanks to @kgn in issue #19. \nThank you @alexruperez for your contributions, as it eventually got into the main project thanks to @kgn.\n. Hey claaslange, \nThanks for the submitting this code!  I'll take a look at it and merge it in the next 48 hours.\nBest,\nArthur\n. Thank you for the code. I've updated the app, so the auto-pull is no longer possible. I will be implementing this feature shortly, but using a slightly different method.\nClosing this issue for now. Stay tuned in the next 6-12 hours for an update.\n. It seems that Apple has dropped support for apps below iOS 4.3 in their latest release of Xcode (4.6). Also, yesterday, an ad-serving company announced that according to their records, iOS 6 has reached 83% penetration. \nTherefore, I have not deemed it worthwhile to add iOS 4.0+ support, since I have a feeling that 4.x it will be completely dropped later from Xcode later this year. \nHowever, I do not wish to alienate the developer base that has software that supports older versions of the OS. Therefore, I can link to your branch in the README, if you'd like. \nI will be adding one more feature into the app later today (ability to say don't remind me again for a specific version). Once that's in place, feel free to merge with master, make your iOS 4.X changes, and publish your branch. Afterwards, I will happily link to your branch within the README.\n. Thanks for the update. I'll go over it this weekend.\n. Closing this issue as issue #19 takes care of this situation.\n. Closing this issue as #19 takes care of this situation and other generalized situations. Thank you for your contribution, kmonoghan! \n. Thanks! I'll get to it as soon as I can! Been a busy couple weeks.\n. I'm looking into this right now. Finally found time :) Looks great thus far!\n. Hey David,\nI went through this in a lot of detail. I loved 99.9% of your changes. I am therefore going to merge your pull request into the Master repo, and then overwrite it with one or two minor changes and an expanded README. \nAll of this should be done in the next 30 mins or so.\n. @alexruperez it was all @kgn incorporating everyone's ideas, plus some of this own. Thank you both for stepping up!\n. Thanks for the changes, Alex. I think I'm going to go with the code in issue #19, as it generalizes the entire i18n procedure. \n. Hey @RuiAAPeres,\nThanks for this localization. I will look at it tomorrow. If all goes well, I'll integrate it onto the master branch.\nThanks!\n. Thanks for the addition @RuiAAPeres! I've merged your changes into master, and I'll update the README in a moment\n. Great, thank you for this request. I'll get to it this evening! \n. @markrickert Merged and tagged. README updated to reflect your contribution!\nThanks!\n. way ahead of you :)\nNo, thank you for getting this done!\n. This is great! Thanks, @ercillagorka!\n. Closing this issue as @trentw had a similar fix, at least to your first commit. \n. Thanks, @trentw!\n. Sorry that it's taken me so long to respond. A tad bit busy right now, but I'll try my best to get to this and the remaining harpy issues in the next week or so!\nQuick answer - no idea what's going on exactly, as I'm still very much new CocoaPods. It's on my To-Do list for this week.\n. I will think about this issue and look into it in detail later this weekend.\n. From looking at the Search API, it looks as if the search is done globally. To select only a specific country, a param is needed to be added. For example, for Canada, the following param must be passed in the lookup route: &country=ca\nCan you give me an example (and country/region )of an app that is only available in a specific country, or an app with which you're having a problem?\n. Ack, this slipped under my radar. Yes, I'd prefer it if the default option was the current implementation, and if an optional value is otherwise set, that country/value is used in stead.\nIf you want to do it, go right ahead! Otherwise, I'll do it in the next couple days. Added it to my to do list.\nThanks!\n. On my to do list late this evening. Thanks for submitting the request.\n. On vacation at the moment. Will look into this at the end of the week.\n. Will do look at your change later today - thanks for being patient!\n. Hey @thomashempel, I merged your pull request, cleaned the code up a bit and added your name to the list of credits in the README page. Thanks for your work!\n. Hey - thanks for submitting the fix. I'm not one to use deprecated code in a public library, so i won't be merging this pull request. Instead of using CocoaPods for this library, it may be better to use it as a submodule, until the issue is sorted out.\n. hah, I hear you there. I contacted a friend of mine who works with one of the cocoapods maintainers. Hopefully, they'll be able to fix this issue.\n. Do I have to do anything on my end? If so, what is it? I still haven't made the move to using Cocoapods. Keep putting it off. Probably should just take the plunge tonight.\n. Got it. Ya, I gathered that was the issue when I looked at the error on travis-ci's end. Thanks, Patrick!\n. Well, if I may ask, what's keeping you on Xcode 4+? Do you need to support iOS 5? If so, I may add a runtime check in the next update for this fix to support both Cocoapods, Xcode 4, and iOS 5.\nBy the way, @plackemacher, I finally started using Cocoapods =p\n. OK got it. Alright, for the moment, fork the repo and make the change. I don't want to hold up your app store submission. \nI'll push the change that you requested along with the UIDevice class extension/category no later than Sunday.\n. Thanks for sharing the code. I'll post a message here once the code has been added in. I've been a bit slow to add the aforementioned change (#35), but will do it shortly. Just slogging through a large load of work. \n. For your knowledge, v2.4.0 was released 2 weeks ago. It has the the changes outlines in #35. Due to these changes, it won't be prudent to use custom-remote-server checking in Harpy. You're welcome to fork the repo and implement it for your own needs.\n. Awesome! This will go into today's update :)\n. Thanks!\n. Thanks for the change. I'll do this soon.\n. Grabbed the file. Adding it manually in the next update.\n. Ah, looks like it changed. ok, I'll make the change in the UIDevice+SupportedDevices repo and remove the code from this app and turn it into a cocoapod dependency.\n. It's live. If you're using Cocoapods, run pod update. If you're using the repo by itself, then you may want to do a 'git pull' on harpy and a git checkout on https://github.com/ArtSabintsev/UIDevice-SupportedDevices/\n. Hey guys,\nI'm currently on vacation, so I can't checkout the code. However, I'll take a look at this addition afterwards.\n. I'm not following the reason for needing to have this addition. I have choice words for your PM. \nWhile I won't merge this request, I do extend my heartfelt sorrow for your predicament. \n. Hah, I'll do the same!\n. Well, for that scenario, there's no real way to check, nor is there any purpose, as the user is forced to update the app every time they open the app.\n. That is an EXTREME edge case. The user would have to:\n- click the forced update button\n- be forced to go to the app store app\n- come back into the main app without updating the app\n@markusekblad The check is always made, UNLESS iTunes' web services goes down, as it uses iTunes to check the latest version of the app to the existing app.\n@markusekblad You're saying you want the callback so you know the check is made. You can assume it's always made based on the fact that iTunes is being pinged.\nWhat would you do with the information once a delegate like that is hit? What's the next step in this hypothetical multiplayer game?\n. I'm with @getaaron on this one. If you guys are building a multiplayer game, then do a quick check yourselves upon logging in to see if the logged-in user's current device is using the latest version of the app. If it isn't being used, then at that point present them with a screen.\nAlso, what I've seen some multiplayer games do is do an internal update on game launch. The internal update is usually for content, and not UI, which allows the game app to go past the app store when needing to add new content.\n. Glad to hear that @markusekblad! Best of luck!\nWhile we're on this topic, is the game you're developing already available on the app store? If so, what's it called?\n. Sounds good! Please do. Tweet it or email it to me :) Good luck!\n. This is how I was thinking about implementing it. I'll test it out today and push it if everything checks out.\nThanks, Rahul!\n. Hey Rahul,\nI'm going to modify the code a bit, as I don't like having default values set for maj/min/patch. That code shouldn't be executed at all, unless it's preset by end users.\nOnce I make the edits, I'll pull your project, then override aspects of it with my code. I'll give you credit in the readme once it's done.\nThanks!\n. Actually, the logic here doesn't really compare the old version to the new version. I'm heavily modifying your logic, so I will reject this pull request, but still give you credit for the idea and basic implementation. \nThanks again, Rahul!\n. Anytime - almost done - just doing some tests\n. Hah, can't believe I missed this issue! Thanks!\n. Hey @jedi4ever: Thanks for the PR.\nI'll take a look at it today in detail when I have a bit more time. \n. Yes. Will look at it tonight. Got hung up with my main project. I need to push an update to Harpy as is, so I'll bundle them together.\n. Sorry - didn't get time this evening. Will do it first thing when I get into the office.\n. So I took a look at the additions. Something in there breaks the lib's functionality - i.e., the alert never pops anymore. If you fix it, I'll take a look at it again. \nClosing the issue now. \nAlso, I will add in HarpyAlertTypeNone and the enableDebug on my own with pulling the request. I'll credit you in the change.\nThanks for those additions.\n. Oh you know, what, nevermind. I think I broke something when I was adding my own change. Reopening it.\n. Pilling this request, but overriding it with some changes that I've made locally. I also removed the forceAlert option, as I didn't really like how it was implemented. I may add something similar down the road.\nYour name was added tot he README and CONTRIBUTIONS list. \nThanks for your help!\n. ok, all done. Everything is now live!\n. Thanks! Not sure how this bug slipped. I'm going to take out device checking all together. Once I do that, I'll take a look at your PR.\n. Thanks for the PR. The bug came from an oversight on my end. I removed the device check completely in the latest version 2.7.1 That should fix the issue.\n. You're the man! Will add this in with the other changes shortly.\n. Thanks!\n. Thanks for the PR. I merged and released it in Harpy 3.1.0. Credit is given in the contributors file.\n. Thanks for the PR! Will take a look at it on Monday.\n. Shalom, Haver! Thanks for the pull request. Merging it now!\n. We already have Turkish support :)\n. Closing PR due to the fact that we already have support for the Turkish language in Harpy and in Siren.\n. Hah - wow! Can't believe I overlooked that mistake. Thank you!\n. I'm going to merge this PR so it gives you credit for your contribution towards the upcoming v3.3.0, but then i'm going to overwrite it with a refactor I jut performed. Your change is preserved within a method, but not within the macro. I removed all macros in favor of static string and methods.\n. Thanks! Good idea!\n. Thanks for the PR. I'll merge it here and in Siren in the next 24 hours. \n. Also, @ipedro, I see you made a lot of spacing/tabbing changes. This may be a pain-in-the-ass, but can you please revert all of your spacing changes by reforking this repo, and then changing/adding only the localization changes?\nThanks.\n. Thanks!\n. Pushed v3.3.3. I changed HarpyLanguagePortugueseBrazilian to HarpyLanguagePortugueseBrazil. Credit was attributed to you in both the README and CONTRIBUTIONS files. Also, I'll be adding this localization to Siren.\nThanks again, @ipedro!\n. Hey @foffux,\nThanks for the PR. Will look into this in detail tonight and accept it once I test it myself.\n. instancetype is only useful if I subclass Harpy. If I there is no inheritance in my architecture, it's better to use the class name to maintain code clarity, which is what I did.\n. Can't merge the PR. Will download it, merge it manually, and give you credit. \n. ok, done. Just pushed v3.3.4. Thanks for the localization!\n. Also, I'm going to add it tot he Swift library as well, Siren\n. Hi @rahuljiresal \nThanks for this solution. I actually have solved this problem in the sister project, Siren. I solved it by adding a delegate method. I haven't gotten around to doing it here just yet, but will try to do it ASAP. I'll ping you once it's done.\nI very much appreciate your time and effort and will use this as fuel to get this done sooner rather than later. I'll close this issue for now (without accepting the PR), but will respond to this issue down the road when I implement the Siren-style delegate method solution.\nThanks!\n. Hi @rahuljiresal,\nAre enterprise plist files based on a common standard? To my knowledge, they do not. If they do, could you link me to an Apple document that defines what one of these plist looks like?\nThanks.\n. Ah, since Xcode 6 no longer supports it out of the box, I'm disinclined to add the feature. I would say the best thing for you to do going forward is to use a fork of Harpy for your own needs. I only say that because parsing a plist file is different than parsing the JSON result from the iTunes API, and adds extra complexity for a solution only a handful of people will make use of.\n. Yes \n. Hi @bestwnh,\nI will be removing support for presentingViewController soon, as I will bringing this library up to speed with the Siren repository, which does the presentation differently.\nAlso, why are you supporting iOS 6. It has less than 1% penetration at this point, and those people are never going to update, because they haven't in two years. \nFor both of the above-mentioned reasons, I will not be supporting iOS 6.\n. Alright, good point on the podspec. I'll change that.\nAs for your boss, he needs to do his research. \nFeel free to use a fork of Harpy for iOS 6 support. The codebase has been stable for a long time now.\n. Hi @permagnus, while I appreciate the sentiment and effort, I don't think this belongs in the master branch. An issue that stems from custom bundles is that they still have to maintain using the same string keys. If they do not (which is the whole point of the custom bundle to begin with - different base strings), they'll need to make even more changes to the codebase than the ones you've made.\nIn the ~3 years this repo has been around, this is the first request for such a feature, so I believe it's an edge-case scenario.\nAgain, thank you for your effort,and I hope you understand.\n. Thanks!\n. Looks good - thanks!\n. This has been implemented in v3.4.2 of Harpy. \nIt now works with A.B and A.B.C.D. systems.\n. Hah :) Well, this was the last piece of the puzzle for this: https://medium.com/@ArtSabintsev/harpy-v3-4-2-siren-v0-6-0-f5a44c1e5da7\n. WOW, you speak a lot of languages! :)\nI'll accept this PR tomorrow morning.\n. Didn't have time this weekend, but I'll have time either tonight or tomorrow night. Thanks!\n. Can you do me a favor and merge all your branches to your master branch? I want to checkout your entire repo on one branch so that I can play with it before accepting the PR.\nThanks!\n. I don't see it merged on the web. Did you push to origin/master?\n. Hmm, odd, when I downloaded that branch, I didn't see the stuff in there. I'll try again when I'm at my computer.\n. Done - thanks!\n. Thanks for your work, but I already have internal work that accomplishes this using the established delegate paradigm. Hopefully, I'll push it out today :)\nIf you want this functionality sooner, please checkout Siren, the Swift version of Harpy.\nhttps://github.com/ArtSabintsev/Siren\n. Just added a delegate method for this in v3.4.0\n. hah, nice catch! Merging! \n. Thanks for the PR. I'll look soon. \nDid you also solve the situation where 3 digit updates to 4? and 4 digits updates to 3?\n. Also, why would a developer ever switch version numbering systems. \nIt seems kind of backwards to not just add the extra 0?\nThen again, I think it's strange when people use 2 or 4 version numbering systems. Everyone should be using sem-ver...\n. Apparently, Apple is enforcing 3-digit versioning:\nhttps://github.com/Carthage/Carthage/issues/859#issuecomment-150114125\nhttps://developer.apple.com/library/prerelease/ios/technotes/tn2420/_index.html#//apple_ref/doc/uid/DTS40016603-CH1-WATCHKIT_APPS_AND_APPS_WITH_SUB_FRAMEWORKS\nTherefore, I am closing this PR.\n. This is a ridiculous request. Your boss is  an idiot and should get fired for wasting your time and the company's resources. 92% of the world uses iOS 8 and 9. \nHarpy is not going to support iOS 5, 6, or 7.\n. I don't see a crash in my sample project when going from 1.0 to 3.1.1.\nAlso, I'm not too keen on this implementation.\nRegardless, thank you for your effort!\n. It may be valid, but Harpy/Siren won't support it. As mentioned in the README, we support Semantic Versioning; 3-number versioning systems. Because of the amount of requests I received, I extended it to 2- and 4-numbered versioned systems. Since doing so, Apple has stated that they will no longer support 4-number versioning systems in favor of 3-numbered systems. Eventually, I will remove 4-number versioning as well.\nI would like to keep the library simple and to what the majority of people use, which is a 3-number system. That is why I do not plan to change the implementation of that part of the code to support anything less-than or greater than a certain set of numbers. It's my way of enforcing that standards are to be followed.\nYou are free to fork the code, as you have, and use your own implementation, which I'm sure you're doing. I fully support and encourage that, but the master repo will remain 2-4 for the time being, with future plans to bring it back to 2-3.\nI hope this makes sense. \n. Harpy/Siren does not work with the build number, only the version number, because the app store cares not for the build number when submitting apps. \nI appreciate the detail and the passion, and I will keep your suggestion in mind for the future.\n. CFBundleShortVersionString is what Siren uses to check against the iTunes API, as said API returns that value under the version key.\n. Thanks - will look into it tonight.\n. Looks good. I did this in Siren, but forgot to do this in Harpy. Thanks!\n. v3.4.8 is now available via all package managers.\n. Ah, this request again :) \nI had this implemented in Harpy a while ago using this library of mine: https://github.com/ArtSabintsev/UIDevice-SupportedDevices\nHowever, Apple decided to stop updating the supportedDevices ket for a while. \nYour solution is partway there. I'll look into re-adding this feature into Harpy soon. I need to bring Harpy up to speed with Siren as well, so it'll get done eventually. Leaving this PR open until then, but my implementation will be a bit different than the one you have here.\n. Can you make this an issue instead as a reminder for me?\nThanks!\n. This PR is empty. Not sure what you're trying to do. Closing it.\n. Please stop opening these PRs. That's 3 in one night with no real purpose.\n. Still working on this issue - just a bit pressed for time. I'll hopefully have it done in the next week or so.\n. Improved logging just now.\n. Fixes #135 \n. Nice solution and thinks for consolidating the duplicate code. I'll review this tonight and then accept the PR after I test it.\n. Confirmed to work! Thank you!\nMerging!\n. Interesting. I didn't realize it wasn't running on the UI thread. I'll do some poking around before accepting the PR. Will get back to you soon. \nThanks!\n. Looks good 👍 \nMerging - it'll be in the next release (later tonight).\n. It's available in Harpy v4.0.4 (via CocoaPods and Carthage)\nIt's also available on http://github.com/ArtSabintsev/Siren\nI gave you credit in both repos in their respective CONTRIBUTORS.md files.\nThanks again!\n. Thanks for the PR. I'll look into this tonight.\n. I looked into this PR. \nThis is the second time someone has requested this feature in four years.\nMy question is Why?\nWhy would you want to know this information?\nThanks!\n. Ah, so the race condition speaks to the bigger issue here.\nWhat I would do is let your app load completely, and only then, would I show the Harpy dialog. \nWould that fix the issue on your end?\n. But your fix wouldn't be necessary if you waited to show Harpy until every loads, right?\nRegardless, closing this PR as I will not adding this feature.\n. Thanks! I'll look at these in the evening.\n. Been a bit busy with life - will try to get to this this week.\n. Will do it tonight. Sorry for the delay!\n. Thanks again!. haha - whoops - thanks for catching that!. Thanks for this as well! Merging!. Thanks! Will test and merge it in the next 24 hours. I'll add it to Siren as well.. The tests failed: https://dashboard.buddybuild.com/apps/58c4d37980c4290100790f8c/build/593c07e2cd3eb300016312fe\nLooks like you forgot to add the localization .strings file to the Harpy.bundle. Closing this PR since there's been no response. . Will do this tonight!. Thanks!. Hey! Thanks for this change. I'll review shortly.. Hmm, my Xcode 9.0 (9A235) doesn't show any warnings at all on Harpy. Are you sure this is the compiler throwing the error, and not a linter?. Closing this issue for now. Feel free to reopen it if you see fit or can faithfully prove this is an Xcode issue with the latest version of Harpy.. Thanks! Can you also update the Tests?. Alright, updated to Xcode 9 in BB for this branch.. This is live - https://github.com/ArtSabintsev/Harpy/releases/tag/4.1.8\nThanks!. no problem! Fix the tests, too! :). Yes you have! Thanks for your contribution!. Added this fix to the Swift version as well: https://github.com/ArtSabintsev/Siren/releases/tag/3.1.7. Nice catch. Will merge this later today and update the version.. Thanks for doing this, however, I have no plans on having Harpy support any third party service. Feel free to use your forked repo for this feature.. Not seeing any retain warning sin Xcode 9.2. Not sure what this is about, so closing the PR due to lack of info.. Will attempt to do this tomorrow afternoon - thanks.. By the way, is it in a Swift or Objc project?. This fixes the warning, but not the actual problem. Need to make sel weak. Will put in a fix shortly.. Fixed. Thanks!\nhttps://github.com/ArtSabintsev/Harpy/releases/tag/4.1.11. As you can tell, I'm not a heavy Carthage user. :) \nHave you confirmed that it worked off this branch?. Thanks!. My pleasure! I try my best! Thanks again for the PR!\nSent with GitHawk. Thanks for the PR! Sorry for taking so long - fell off my radar.. Thanks for the PR. I agree with the sentiment, but not the approach.\nI think an easier approach is to just not call checkVersion in debug mode. \nC-style Pseudo-code to follow:\n```objc\nif !DEBUG\n[[Harpy sharedInstance] checkVersion];\nendif\n```\nClosing the PR. Feel free to follow up with your thoughts, but I don't see myself merging this in. You're welcome to continue using your fork in your app if that is the solution you desire.. Hi - thanks for the PR! Can you give me more context around why you had to reset the skip version status?. Got it - I will follow up on Friday. Would you mind making the same changes on the Siren repository?\nSent with GitHawk. Closing the issue due the comment listed here: https://github.com/ArtSabintsev/Siren/pull/236#issuecomment-429496994\nLet's continue the conversation in the Siren repo.. :+1: agreed\n. This should be HarpyLanguageUkranian. . ",
    "pius": "No problem, thanks for the library!\n. Thanks, no problem! :)\n. ",
    "alexruperez": "Ok, thanks! If you merge it or not, I would like to get your feedback anyway, good or bad.\n. Hey Arthur,\nI think, as you have now the user would get translated strings into their own project to make internationalization, with the way I propose GitHub users can go up the internationalizations of these chains in the project itself and within soon we would have this library available in the i18n.\n. Thanks!\n. Well done! Thanks @ArtSabintsev & @kgn\n. ",
    "mackoj": "Thanks again @alexruperez for complete the spanish translation.\n. ",
    "kgn": "Added localizations for:\n- Chinese (Simplified)\n- Chinese (Traditional)\n- Danish\n- Dutch\n- French\n- German\n- Italian\n- Japanese\n- Russian\n- Spanish\n. ",
    "markrickert": "I'll submit the new version podspec to the specs repos once you merge and tag the changes.\n. Sweet. Can you tag the current head as 2.3.2 so i can push the podspec to the cocoapods/specs repos?\n. LOLnevermind. Looks like you already did it. Thanks!\n. Pull request added to cocoapods/specs - https://github.com/CocoaPods/Specs/pull/2020\n. Heh... I love the sublimetext setting that trims line endings... it's a blessing and a curse.\n. ",
    "msafder": "Looks like \"Cocoapods localizable files missing\" bug is happening again, at least with Xcode 5. It builds just fine when I do either a Debug/Release build but when I try to Archive my app for submission to the App Store I get build errors that look like this:\nHarpy.bundle/zh-Hant.lproj/\nHarpy.bundle/zh-Hant.lproj/HarpyLocalizable.strings\nsent 1245148 bytes  received 1466 bytes  2493228.00 bytes/sec\ntotal size is 1240244  speedup is 0.99\nrsync error: some files could not be transferred (code 23) at /SourceCache/rsync/rsync-42/rsync/main.c(992) [sender=2.6.9]\nCommand /bin/sh failed with exit code 23 \nMy Pod File looks something like this:\nplatform :ios, '7.0'\npod 'Harpy', '~> 2.3.6'\nany ideas?\n. ",
    "jamiely": "Hi @ArtSabintsev, the app with this id is an example of something not in the US. 549148968 available in the Netherlands (NL).\n. Would you rather accept an option that allows someone to specify the country code? I can submit a pull that implements this?\n. I opened pull request #30 for this.\n. Thanks!\n. ",
    "thomashempel": "Don't worry, enjoy your vacation. :-)\n. Thank you for merging it! :-)\n. ",
    "plackemacher": "I understand. I'll see if I can resolve it on their side then... I'm not a fan of submodules. :stuck_out_tongue:\n. Looks like it was just something that was glossed over as being an issue. I talked to them and they suggested resubmitting it. See CocoaPods/Specs#4718\n. Looks like there's nothing you need to do. I think the issue lies with Travis-CI not being updated to the latest version of Xcode yet. Looks like it's running Xcode 4.6.2 and I believe NSCalendarUnitDay was introduced in iOS 7 (Xcode 5)\n. ",
    "amarcadet": "Hi,\nAnd what about using kCFCalendarUnitDay which is the underlying value for both NSCalendarUnitDay and NSDayCalendarUnit? (Just checked in headers).\nUnfortunately I can't move to Xcode 5 at the moment and NSCalendarUnitDay raise a Use of undeclared identifier error.\nIf you don't want to use kCFCalendarUnitDay maybe you should add some sort of runtime verification of the iOS version or add a macro to use the deprecated value if necessary.\nI'm not a big fan of runtime verification but dropping a deprecated attribute only a month after Xcode 5 and iOS 7 is out sounds a little violent to me.\n. Well, it's quite simple, I don't want to build against the latest SDK because I just have a small update to send to the AppStore that include your library, and I don't want to go through the process of fixing every (layout) issues raised by iOS 7 since I'm working on a major release where my app will be 100% rewritten using Xcode 5 and targeting only iOS 7.\n. Thank you for your co-operation.\nI did fork your library for the need of my project, so don't worry about my app store submission, it was just in case some other users were facing the same issue.\n. ",
    "getaaron": "Just FYI, there are some planned upcoming changes outlined in https://github.com/ArtSabintsev/Harpy/issues/35 which wouldn't work with your code. \n. @Elethom Just curious, when would having this delegate method be helpful?\n. @Elethom Let me know if you want me to get on the phone with your PM :) I can try to explain why it's a bad idea \n. The automatic login should proceed while it's checking for new versions. Since there usually won't be updates, it doesn't make sense to block the user while it's checking.\nThere may be exceptions to this, but blocking the user from proceeding during a check is a worse user experience, and I don't think this project should encourage that by supporting it out of the box.\n. I call them \":+1:.:+1:\" and \":+1:.:+1:.:+1:.:+1:\" systems.\n. 👍🏾\n. I like the idea of adding a way for Harpy to coordinate with an external API on forcing an update. In one project I did this by exposing a “minimum supported version” endpoint and checking that response before initializing Harpy. I also had to reset this for the reason you mentioned. I wonder if there’s a more intuitive interface we could use. Otherwise this seems like a a potentially helpful addition. Typo: should be “reset”. ",
    "LordZepto": "Ok, if there is interest, I'll try to make it work when that version comes up. For the time being, I needed a quick and dirty version for myself and thought maybe someone else might have a use for it.\n. ",
    "Elethom": "@getaaron When my crazy product manager thinks it might be somehow important that users can check for updates manually in an iOS 7 only app. =_=\n. Might be useful for games like Clash of Clans. It checks for update on launch and prevents you from playing it at all if you don't have the latest version.\nSo my PR might be useful on some rare occasions after all. lol\n. ",
    "markusekblad": "I might be missing something but if one is using Harpy for forced updates, say in a competitive multiplayer game, would it not make sense to get such a delegate callback to know that the check has been made successfully?\n. @ArtSabintsev\nWell basically the scenario I'm thinking is this:\nUser logs in\nCloses the app\nOpens it up a week later\nWe check for new version\nIf there is none, then automatically log back in and reload games\nIt does more or less work as it is if I use checkVersion in applicationDidBecomeActive, it's just that the automatic log in will go ahead while it's checking for new versions.\n. Fair enough, I do agree there is a strong case for handling strict version requirements with own server-side logic.\n. @ArtSabintsev Thanks, it's not available just yet, hopefully in a couple of weeks. I can let you know then :) \n. ",
    "rahuljiresal": "Thanks @ArtSabintsev ! My logic was a quick fix just to make it work in my project. I would love to see your changes when they’re done. And thanks for the credit.\n. Hey @ArtSabintsev \nI recently had to deploy an app for enterprise distribution. So wanted to check against he enterprise pList file if a new version is available. \nAdded a public method.\n[[Harpy sharedInstance] setPListURL:@\"http://url\"]\nAdded a private method.\n- (void)performEnterpriseVersionCheck\nThe commit is ready to be pulled and merged if you want to.\n. Xcode used to generate plist files with the \"Save for Enterprise\" option while making an IPA. Not anymore since Xcode 6. So, unfortunately, there are no docs. However, some people have copied their older plist files and used those. I am doing that too. Here's a sample - http://stackoverflow.com/a/25916806/1314292\n. Okay, sounds good!\nGood to close this one now?\n. ",
    "jedi4ever": "@ArtSabintsev any update? thanks for your time.\n. ",
    "RayzorDragon": "Thank you kindly, Sir.\nOn Oct 27, 2014, at 2:01 PM, Arthur Ariel Sabintsev notifications@github.com wrote:\n\nThanks! Not sure how this bug slipped. I'm going to take out device checking all together. Once I do that, I'll take a look at your PR.\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "jonandersen": "Sounds good! Great Library!\n. ",
    "ipedro": "didn't change the constants, made a new corrected pull request. ignore this one\n. That's weird... might have been Xcode\nSure, no problem\n\nOn Mar 5, 2015, at 11:51, Arthur Ariel Sabintsev notifications@github.com wrote:\nAlso, @ipedro https://github.com/ipedro, I see you made a lot of spacing/tabbing changes. This may be a pain-in-the-ass, but can you please revert all of your spacing changes by reforking this repo, and then changing/adding only the localization changes?\nThanks.\n—\nReply to this email directly or view it on GitHub https://github.com/ArtSabintsev/Harpy/pull/75#issuecomment-77376533.\n. don't mention it! great lib\n\nEnviado do meu iPhone\n\nEm 08/03/2015, às 03:18, Arthur Ariel Sabintsev notifications@github.com escreveu:\nPushed v3.3.3. I changed HarpyLanguagePortugueseBrazilian to HarpyLanguagePortugueseBrazil. Credit was attributed to you in both the README and CONTRIBUTIONS files. Also, I'll be adding this localization to Siren.\nThanks again, @ipedro!\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "bestwnh": "You got your point. I don't want to support iOS6, but my boss do. But for this framework it won't make any difficult to support it, someone would need it. And if you not support iOS6, just change the podfile config to iOS7 to warn that guy who want to use it in iOS6.\n. ",
    "jaroslavas": "OK, I've merged everything into my master branch.\n. Hmm.. that's strange, I just browsed files on my master branch  and translations are there. Maybe I should make another pull request directly from my master branch?\n. ",
    "waniwang": "I got it, thank you very much!\n. ",
    "asxasxasx": "4 digit to 3 situation also solved. May be some developers don't like zeroes :)\n. ",
    "yangchao0033": "in older system Version, the AlertViews tincolor cant modify.\nthis problem should be solveed...\n. ",
    "acalism": "For example, 42 is a valid short version number, however you make an assumption that it must have 2~4 segments. So, how do you modify your implementation?\n. Thank you very much for your answer and politeness. \nI have the above question, because 42.0.0 may be shortened to 42 unexpectedly by some Continuous-Integration server, which is a good convention in my opinion.\nA reasonable assumption is like this, for example, the CFBundleShortVersionString is 1.2.3, and CFBundleVersion is 452, which means building times. Then, the joined result 1.2.3.452 can be the whole version number.\nIt is just my personal advice and future plan.\nBest Regards.\n. CFBundleShortVersionString and CFBundleVersion have different usages, and the joined result is very useful, for example, 1.2.3(452) appears in a crash report. Otherwise, it will be 1.2.3(1.2.3), which is redundant.\n. As I know, App Store cares only CFBundleVersion, which must exceed the one of the last package submitted to App Store. CFBundleShortVersionString is public to End Users, however, CFBundleVersion is private and just known to the developers and the App Store.\n. ",
    "attilat85": "It's ok until it's working. :)\nClose this PR when your implementation is out, because until then I can't use the lates Harpy version.\n. ",
    "MeGaPk": "I just show example, how i use:\n```\n- (void)sessionCheckMessage:(BOOL)result Answer:(NSDictionary *)answer {\n    if (result) {\n        [self.navigation changeToOrder];\n    } else {\n        [[Harpy sharedInstance] setPresentingViewController:[UIApplication sharedApplication].keyWindow.rootViewController];\n        [[Harpy sharedInstance] setDelegate:self];\n        [[Harpy sharedInstance] setForceLanguageLocalization:[NSBundle getCurrentLanguageCode]];\n        [[Harpy sharedInstance] checkVersionDaily];\n    }\n    [self.socket disableSocket];\n}\n\n\n(void)harpyUserDidLaunchAppStore {\n    [self.navigation changeToFilters];\n}\n\n\n(void)harpyUserDidSkipVersion {\n    [self.navigation changeToFilters];\n}\n\n\n(void)harpyUserDidCancel {\n    [self.navigation changeToFilters];\n}\n\n\n(void)harpyVersionCheckExecutedWithoutResults {\n    [self.navigation changeToFilters];\n}\n\n\n```\nself.navigation changeTo* < just change screen \nif i try show this alert in Main screen, i have race condition\nIf user click \"change screen after 3 second\" and after 1 second i see alert, screen not changed.\n. yes, i solved this problem by my fix. Now i user cannot press any button on during \"checking new version\"\n. ",
    "lucianocn": "I made some corrections to Portuguese (Brazil) locale ;)\nThe first is important because it is a grammatical mistake.\nThe second is an improvement.\n. ",
    "RajChanchal": "HI @ArtSabintsev , sorry I have added the file now. Check my new PR please. . ",
    "dimacheverda": "@ArtSabintsev updated the Tests target but buddybuild CI failing in Xcode 8.3.1 on '@available' operator, which was introduced later.. Fixed mistyped constant.. ",
    "wbison": "First pull request (and what a monumental one) - sorry if I messed up.. hmm - the new commit was automagically added to the existing pr? I have to study this PR stuff.\nHave I just started my career as Open Source Developer?. ",
    "kkostritsynax": "If you add your project as pod in another project, then install pods with cocoapods 1.4.0 you will see these warnings.. ObjC project.. ",
    "iamtomcat": "Yeah I tried it and it works off my fork.\nOn Wed, Mar 21, 2018 at 17:21 Arthur Ariel Sabintsev \nnotifications@github.com wrote:\n\nAs you can tell, I'm not a heavy Carthage user. Did you confirm that it\nworked off this branch?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/ArtSabintsev/Harpy/pull/193#issuecomment-375138321,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AFwQS2PWHq42JNWl0-r-o9K9bOpbB3V1ks5tgu6OgaJpZM4S2O_H\n.\n-- \nThank You,\nTom\n. Hey man, thanks for being so on top of the pull requests.\n. \n",
    "kamrankhan07": "We have an endpoint that we call to see if we need to force user to update the app. However I still wanted to show user when a new version is out, Harpy helps there. However if user already set to skip the version and later on we want to force the user to update to that version then I had to show custom alert and not use harpy. So, that why I had to reset the skip version status, so that I can use the Harpy code without having to repeat the code that is already written there. \nSo I first check if need to force user then I set the alert type to force and reset skip version status and call checkVersion and it works as expected. . Probably parse custom api response to get minimum version to force and pass it to Harpy, which can then automatically check once more if user skipped and if the version is greater than the current version.. I will check check it out later today. I have update the interface, removed the reset method with a new parameter (same like I did in Siren), I will create a new pull request and close this one. . "
}