{
    "blueimp": "Thanks for your contribution, Boris. :)\n. https://www.google.com/search?q=protocol+relative+URL\n. Thanks for your work, Nick.\nI would prefer if there were a CSS only solution, but seems like this might not be possible.\nCould you get any feedback from the Bootstrap developers on the issue?\nI feel like this should rather be solved on their end, since the Image Gallery just makes use of the Bootstrap Modal.\n. OK, thanks for your feedback!\nDo you have experience with jQuery UI, especially with the Dialog component?\nIt seems like it doesn't suffer from the same positioning problems on mobile devices, at least in my last tests.\nThere is also a predecessor for the Image Gallery based on jQuery UI:\nhttps://github.com/blueimp/jQuery-Image-Gallery\nAs far as I know, the jQuery UI dialog doesn't get repositioned on scroll, but I didn't have yet the time to analyze it.\n. ### Why is the protocol (\"http:\") missing from the script references in the HTML source code?\nThis is called a protocol relative url and a perfectly valid way to define a resource, relative to the current URL protocol.\nThis ensures that the referenced scripts are loaded via the same protocol as the current page, which avoids security notifications when loading resources via unencrypted HTTP on a page loaded via HTTPS.\nHowever, it also requires that the current protocol is either \"http:\" or \"https:\" and will not work on a \"file:\" url.\n. Sorry but I fail to see what kind of functionality this should add.\nRelated images (which I understand as being an album) can already be viewed in one gallery.\nSo I'm sorry but I have to reject your merge request.\n. ### Why is the protocol (\"http:\") missing from the script references in the HTML source code?\nThis is called a protocol relative url and a perfectly valid way to define a resource, relative to the current URL protocol.\nThis ensures that the referenced scripts are loaded via the same protocol as the current page, which avoids security notifications when loading resources via unencrypted HTTP on a page loaded via HTTPS.\nHowever, it also requires that the current protocol is either \"http:\" or \"https:\" and will not work on a \"file:\" url.\n. Sorry, at the moment I'll not merge these changes.\n. Sorry, of course I should give you some reasons.\nYour additions are not bad, however at the moment I have to keep the maintenance of my open source plugins low, so time is the most important reason.\nIf I can decide with a quick look that a fork would easily be a meaningful addition, I'll merge the changes.\nAt the moment I don't see the need for a wide mode.\nIn any way, I'm glad people fork my code, especially since I might not maintain my projects forever.\n. This project has been replaced by the blueimp Gallery:\nhttps://github.com/blueimp/Gallery\n. This project has been replaced by the blueimp Gallery:\nhttps://github.com/blueimp/Gallery\n. The Makefile has been updated.\nHowever, please note:\nThis project has been replaced by the blueimp Gallery:\nhttps://github.com/blueimp/Gallery\n. Thanks for your contribution, however this project is discontinued in favour of blueimp Gallery:\nhttps://github.com/blueimp/Gallery\n. Please see my comment here:\nhttps://github.com/blueimp/Gallery/issues/104#issuecomment-31068631\n. Sorry, I saw your pull request after I read and fixed your issue post here:\nhttps://github.com/blueimp/Bootstrap-Image-Gallery/issues/163\n. This is intended.\n. Sorry but this is not a PHP project, so I don't see a reason to add a composer.json file.\n. Thanks for your contribution.\nHowever, since this is simply ignored by bower and might be used in the future, I'll rather keep it in the file.\n. Sorry but I simply don't see a reason to remove the version information since it does work perfectly fine as it is.\nIt would be highly unlikely for the bower maintainers to throw a bug if the version field is present.\n. Thanks @weberhofer\n. ",
    "borisnadion": "you welcome ;-)\n. ",
    "niftylettuce": "@blueimp Very welcome -- thank you for your hard work with all the awesome modules you've come out with.  Seriously good stuff.\nRE your comment: there sadly isn't a CSS only solution due to devices not having position: fixed support.  So either we have to fake fixed scrolling or re-position the element's absolute position on scroll (which is what I did here).\nI'm waiting on feedback (if any) from @markdotto -- and yeah you're right -- this should be integrated or at least optional with Bootstrap Modal (e.g. $('body').fixedModal(true) or something... better...).\n. ",
    "noreiller": "Ok, but is there any reason ? Time, off-topic or anything else ?\n. I understand, thanks for the explaination.\n. ",
    "fergomez": "Excuse me, but... may I ask how do you set the download link? I don't see the option in the documentation. So far it gets the picture URL from the href atribute, but I do not know how to set this manually. Thanks a lot.\n. So easy. Thanks! I think you should add this to the README, so it's clear for future users with the same doubt.\n. ",
    "guilhermecomum": "Is very simply, add \"data-download\" as tag attribute like the example:\nhtml\n<div class=\"gallery-item\" data-href=\"banana.jpg\" data-download=\"download-img.jpg\" title=\"Banana\">Banana</div>\n. ",
    "Oluwafemikorede": "I tried using this on the bootstrap image gallery but its not working, I did this on the link tag\n                        \nAnd how do I  write and place the download button on the modal\n. ",
    "eric-a-johnson": "Hi und1f,\nI tried out the files you committed to fix the window resize problem and it doesn't seem fixed at all. In fact, it's made the modal go halfway off the top of the screen when the browser gets narrow.\nDo you have a working example of this fixed? Thanks.\n. Thanks for the quick response. Seems to be working quite well. Nice fix!\n. ",
    "rundef": "Hey,\nthanks for pointing that out, there was a bug on non-mobile browser.\nsee my latest commit for the fix.\n. ",
    "piotrantosik": ":+1: fix top position for me\n. ",
    "adam-lynch": "K. I definitely had a problem with the arrows/chevrons but after reading that I'm almost certain it comes back to an underlying encoding problem we've had.\n. ",
    "kkirsche": "Considering there are discussions to move bower to NPM anyway so I wouldn't really plan to support it for ever: bower/bower#1520\n. Also their maintainer says they probably won't ever use it: http://stackoverflow.com/questions/24844901/bowers-bower-json-file-version-property\n. "
}