{
    "GrahamCampbell": "Could you make this pull against the develop branch please.\n. Thanks. I'll probs not register the registration routes either like I do when I disable blogging for example.\n. See 04e8a03956e06840b9b66d59a86afa5bf8964da7 and 4e360e3a5267e12d6f4ba9a075249e8afacd4daf.\n. I'm so pleased I could be of help! Thank you for making me aware of that issue. It's made me think of a few other places that issue occurs in too.\nIf you know anyone else that might benefit from this CMS, for production use, or for a learning resource, please let them know. Thanks so much for taking an interest. Feel free to contact me if you have any other issues or questions, whether they are related to my software, or if you need any help with Laravel.\nFinally, the Laravel forums post for my CMS is here if you need it: http://forums.laravel.io/viewtopic.php?id=11910.\n. I'll need to change one or two other things, but otherwise, thanks for this. :+1:\n. I've tagged https://github.com/GrahamCampbell/Bootstrap-CMS/releases/tag/v0.7.2-alpha.\n. @apps4u, Hi there Jason. I'd be really cool if you knew anyone, or you yourself, could help out with #78.\n. What I need is the entire CMS to be translated. So all the button/menu text, and every error/success message, and all the emails. Do you speak any other languages well? Unfortunately, I am only fluent in English, which is why I haven't attempted to implement localisation before. Can I get back to you in July once I've refactored the project with the English language files. Note that Bootstrap CMS strongly depends on https://github.com/GrahamCampbell/Laravel-Credentials and it will need translating too.\n. That's not a solution. The id column is auto-incrementing.\n. Thanks.\n. Looks pretty good. Please make that change that I've commented in-line, then I'll merge this. Thanks. :)\n. Squashed an merged. Thanks. :)\n. Thanks.\n. I didn't realise this was not a free and open source tool. Sorry, I cannot allow it into Bootstrap CMS.\n. Thanks.\n. What's the advantage here?\n. Looks like you haven't setup git correctly.\n. The copyright year shouldn't be dynamic. The year should reflect the age of the software running on the box.\n. Thanks. :)\n. Not a typo. \"enabled\" is correct.\n. Can you standardise it all to UK format please?\n. Thank you. :)\n. Sorry this took me so long to get to. Thank you very much for the contribution.\n. https://github.com/BootstrapCMS/Credentials needs updating too.\n. > CI fails due to outdated composer.lock. Not sure it's worth commiting my dev server's composer.lock as it includes reference to jwilson8767/logviewer#Elixir-Support repo and will therefore need to be replaced before accepting pr anyway.\nPlease revert that change to the composer.json and don't depend on your fork.\n. Thank you. I've reverted some of the changes, and manually merged. I'll now fix the other issues.\n. Why have method and _method?\n. You don;t have to. Just send an ACTUAL patch request instead of a post request with the _method set surely?\n. Instead of spoofing it as the link shows.\n. Meh, well if this works, I might as well merge it. Thanks. :)\n. :heart:\n. Thanks.\n. Can you revert all changes to the file permissions please?\n. All the file permissions are still wrong.\n. Also, I can't merge this without translations on the Credentials component too.\n. You've changed all the file permissions to 755. You must not change them please.\n. Example app/Http/Controllers/CommentController.php 100644 → 100755. That can't happen.\n. Probably because you chmoded everything to get it to work on our websever? Instead, just chown it to the correct user.\n. Could you please send all non-language related changes in a separate PR?\n. Thank you, but I don't have the time or energy to support this and keep it up to date.\n. Thanks. :)\n. It is intentional that emails cannot be reused.\n. You should not run these commands as root. Infact, composer will tell you off for that.\n. Same goes for npm.\n. I'm fine with changing anything that's not inside an exception.\n. Thanks. :)\n. Please use php 5.3 style arrays. Yes, I know we're not supporting php 5.3, but I'm still using that style of array for now, for consistency.\n. Can we keep the defaults the same as they currently are please.\n. I disagree. I like UK readable dates by default.\n. cs\n. i'd rather have stricter dependencies than that since bootstrap doesn't follow semver\n. this change is definetely wrong\n. Actually, why did you even pull this in? I'm confused. It's not even used anywhere?\n. Exceptions must always be in english.\n. Exception messages must not be localized.\n. ?\n. ",
    "rverrips": "Sorry 'bout that - Will submit the pull to development.\n. Most welcome Graham - The Register showing when disabled was a “visual” bug I picked up upon first install - Still need to dig deeper into the code ...  \nI’m new to Laravel and Bootstrap, so your CMS is amazing as a learning resource - Happy to help!   \nThanks SO much Graham for making this available - Hoping I can continue to contribute … \nWith thanks\nRoy\nOn Nov 9, 2013, at 5:12 PM, Graham Campbell notifications@github.com wrote:\n\nThanks. I'll probs not register the registration routes either like I do when I disable blogging for example.\n. \n",
    "coveralls": "\nCoverage remained the same when pulling 596e768c015ee46d69c748590b2c2d7577d3053d on apps4u:master into 6a24407990782699b81d7d47964206d487229ab8 on GrahamCampbell:master.\n. ",
    "apps4u": "Hi if you have specific issue you would like worked on let me know always happy to help.\nJason Kristian | Director | Apps 4 U Pty Ltd.\nph: +61 075699 8109\nmob: +61 0411 389 392\ne: Jason Kristian\nOn 27 May 2014, at 8:03 am, Graham Campbell notifications@github.com wrote:\n\nI've tagged https://github.com/GrahamCampbell/Bootstrap-CMS/releases/tag/v0.7.2-alpha.\n—\nReply to this email directly or view it on GitHub.\n. Ive know of a repo that has all the Laravel language file translated to around 20 languages , https://github.com/caouecs/Laravel4-lang.git so thats a start , Im not sure what you are asking is it the translation or the creation of the string file e.g.: Lang:: \n\nJason Kristian | Director | Apps 4 U Pty Ltd.\nph: +61 075699 8109\nmob: +61 0411 389 392\ne: Jason Kristian\nOn 27 May 2014, at 7:39 pm, Graham Campbell notifications@github.com wrote:\n\n@apps4u, Hi there Jason. I'd be really cool if you knew anyone, or you yourself, could help out with #78.\n—\nReply to this email directly or view it on GitHub.\n. And sure I can help .\n\nJason Kristian | Director | Apps 4 U Pty Ltd.\nph: +61 075699 8109\nmob: +61 0411 389 392\ne: Jason Kristian\nOn 27 May 2014, at 7:43 pm, Jason Kristian jasonk@apps4u.com.au wrote:\n\nIve know of a repo that has all the Laravel language file translated to around 20 languages , https://github.com/caouecs/Laravel4-lang.git so thats a start , Im not sure what you are asking is it the translation or the creation of the string file e.g.: Lang:: \nJason Kristian | Director | Apps 4 U Pty Ltd.\nph: +61 075699 8109\nmob: +61 0411 389 392\ne: Jason Kristian\nOn 27 May 2014, at 7:39 pm, Graham Campbell notifications@github.com wrote:\n\n@apps4u, Hi there Jason. I'd be really cool if you knew anyone, or you yourself, could help out with #78.\n—\nReply to this email directly or view it on GitHub.\n. \n\n",
    "grrnikos": "Nice, thanks :)\n. ",
    "review-ninja": "\n. ",
    "rweas": "Oh sorry. I didn't at first either. :/\n. ",
    "cyberid41": "I failed when using it\n\n. ",
    "aqnouch": "ok, sorry.\n. ",
    "mrrsm": "This should fix #132 \n. I'm not really sure what version of the bootstrap-datetimepicker this is using.  It appears that this method works though for setting the format.\n. I feel like using an ISO standard as the default makes more sense than picking a specific region's date/time format.  It should cause less confusion for someone starting to use the project.  Is there a strong reason to use the current default?\nsidenote: The relevant XKCD\n. ",
    "jwilson8767": "165\n. CI fails due to outdated composer.lock. Not sure it's worth commiting my dev server's composer.lock as it includes reference to jwilson8767/logviewer#Elixir-Support repo and will therefore need to be replaced before accepting pr anyway.\n. ",
    "xcaptain": "@GrahamCampbell According to http://laravel.com/docs/5.1/routing#form-method-spoofing , to perform a  patch request, must use _method=\"PATCH\"\n. I tested this with Chromium 45, when I update a post or a page, I can't see a post request with the inspector and nothing changed. So I think this is a bug.\n. ",
    "miharbi": "Im here, sorry, did I do any? \n. ok, I think now I got it\n. Ok, Yes You are right, let me check all the components. I'm just doing a proposal. I don't understand that about the permissions, could you say me what I need to do?\n. Ok, I did not notice that, no problem, I'll fix that in a while, I don't know why is this happening, let me check \n. hey did you check the commits? ??\n. I think that all of those aren't related with another stuff, look the  Sep 7, 2015 commit\n. I made all the translations, but he wanted the Exceptions in english, can you check the Exceptions, and change those to english or revert my changes on it? \n. He(@GrahamCampbell) have right on this point, no matter what, english is the default language, it is a try of Multiple Languages, the idea is use more than one language in the frontend, ok, but by default all the Exceptions have to be in english. It was my fail, I hope to have time in the next week for work on it, but if you can solve that, it will be great!\n. Well man, sorry, I was very motivated those days and with a lot of free time, but, I'm kinda busy right now. I'm sure that you had been busy and that is why you take all this time to answer. I'll understand if you wanna dismiss my pull requests. \n. ",
    "epileftro85": "hi, how can i help with this? i can make the spanish translation if you want to.\n. i think it would be nice if you can have two translation in exeptions too, well i am just saying\n. ",
    "sh4ka": "I am not talking about the composer command, the npm command. \n. ",
    "tirjok": "Ok, i will update my commit.\n. "
}