{
    "brunogaspar": "Thanks, this is fixed on my dev branch (not published, yet)!\n. Hi, thanks, but im not following your problem, since there is already a auth filter on https://github.com/brunogaspar/laravel4-starter-kit/blob/master/app/filters.php#L35\n. No worries, let me know if it doesn't work for you.\n. Hi, thanks, i'll tidy up the code later, but looks nice!\n. Thanks, i fixed this on the dev branch, but forgot to update it on the master!\n. The current master branch is outdated, im putting work on the develop but thanks for the pr!\nTo answer some of t he questions please have a read this article http://net.tutsplus.com/tutorials/tools-and-tips/git-tips-from-the-pros/ the one you want to ignore the database.php is on the \"Ignore Changes in a Tracked File\" section of that article.\n. Fixed\n. Im ok on doing this, but it should be {{ date('y') }} since we are on a Blade view file.\n. Thanks!\n. The messages are in there, they just need to be renamed from login to signin and from register to signup.\n. Thanks man, this is something that i want to revisit later.\n. Thanks\n. Thanks for the work, but i'm not merging PR nor fixing issues, i'll probably get back to refactor the repository once i have more time.\nBut i really appreciate the effort.\n. Thanks a lot for the effort, but I'm not going to merge this as there is a lot of changes involved and I don't have enough time to test it.\nI have a WIP for Laravel 4.2 locally that I hope to be pushing in May which has some cool stuff.\nBut yet again thanks for the effort =)\n. Thanks for the effort, but as i mentioned here https://github.com/brunogaspar/laravel4-starter-kit/pull/49, i'm not accepting these kind of PR's as they have a lot of changes involved and would need time to review them and time is something i don't have atm.\nThanks for the effort anyway.\n. Yes, it'll be updated, but only in may.\n. Thanks for the PR, but as i stated on the project readme, i'm not accepting any PR's at this time.\n. ",
    "opencubicles": "Sorry mate. It seems I missed that filter. please ignore my pull request.  - Amit\n. ",
    "adis-me": "Thanks man!\n. ",
    "Braunson": "Good point, fixed. Still new to blade.\n. ",
    "ghost": "Hey.. I still have trouble when rolling back my migrations. I get an error on the update users migration since the sentry migrations are not running. Is there a way to run these migration when doing rollback og refresh?\n. ",
    "GrahamCampbell": "It would be better to create a new migration to fix this rather than changing an existing one.\n. ",
    "dolcy": "Indeed. Tnx.\n. ",
    "a9un9hari": "wow, okay no problem ^_^\ni'm waiting some cool stuff :D\n. ",
    "snipe": "(I know it looks like a buttload of changes, but the vast majority are cosmetic.)\n. That's really unfortunate. Are you planning on upgrading this to bootstrap 3 any time soon? If not, I may just keep moving forward with my fork for those that need it. I saw #49, but hoped that since my changes were all cosmetic, it might not be as difficult to test and might make it through. Bootstrap 3 was released 7 months ago.\n. Sorry, this should probably not have been changed - slipped into my commits.\n. ",
    "peersbio": "Hi Bruno, \nAny plan to release the update version of laravel4-starter-kit?\nThanks\nAndy\n. "
}