{
    "cheeaun": "May I know which compressor are you using?\n. Fixed.\n. Fixed :)\n. This is probably because of the cleanup regex... :(\n. I think I found the problem. Firefox is adding those <br ..>s automatically. Even when you type something in the <pre> in wysiwyg mode, Firefox will create <br ..>s as well. So, I guess we'll need regex to clean those up...\n. Implemented in aace8ae8c31953cc68ec08877941e195a8e09396\n. Fixed :)\n. Fixed in commit 6df322\n. There's MooEditable.Selection.selectNode\n. That's right, the focus should go to every single button before the textarea. It should be the same for Firefox and Safari as well.\n. Do you have any example/demo page to test this?\nIn my opinion, Typekit might just not work due to the content inside iframe.\n. Thanks. Fixed in 7ad9e62c4aa5456152af9641e9682bb77821f8e6\n. Fixed in 5ad2c6339473e0775e1d1cf4ffd2783cb9cf6358\n. jaydiablo, I'll need some sample google ad codes and of course, mooshells of the bug and your fix.\n. Fixed in 76006b8f42cfe2f578d7d8d65cdff09fe3c2b5e5 and f92a20701263c87b7f491bd25a2ba41a6c54f294\nI didn't test much on this but it sort of works for simple cases.\n. Fixed in c72bc7e4e5e47a89bab00316eeb2c8f213b3f0d0\n. I think I added this because when you click on an image in Webkit browsers, there's no indicator that the image is selected, until... you drag them. And I can't seem to reproduce this error on Safari 4.0.5 (Windows). Probably I'll need to try it on Safari Mac.\n. Hey Ryan,\nCould you give me a use case where checkStates() is needed to be called after the selectNode?\n. Fixed in 9432b895e2b23da9abad7c819bfe3a58809f6f27\n. Fixed in 3bd1472597fbc2f2dfd9fbd2623666fbc2ce629d\n. Thanks! Fixed in 74e1c276aa938673a257e2c0613915142a5ffa8e\n. Fixed in fd18940c953c480618bc2d329031998eb3da54b5\n. Hey thanks for fixing this. Your commits gave me few ideas on how to fix it correctly, which I've pushed in another commit, so I won't be pulling this one.\n. Fixed in 2d31ec65445e55b40792370d3db8536087b1b428 with a slightly different solution\n. Fixed in bb58ac82972bd93548cdd389eeeea145c11abc4b\nNot closing this issue since the double click feature seems like a good idea. Will be looking into this.\n. Hey thanks for the pull request. I've applied some of your fixes and not pulling this one because the files changed seems kinda weird especially the CSS files.\n. I guess you could try using 'git gui' whenever committing, so that you can see what are the actual changes in it. It's kinda messy (for me) to apply pull requests when the changed files don't make sense :)\n. Oh, if you're using gitx, try out this fork http://github.com/brotherbard/gitx . It has the same functionality like git gui, but with nicer UI :)\n. Fixed in 3912a8ef55b1ffbfa314912aa05509c3e4d34642\n. Hey, thanks for localization and plugins! One thing before I \"pull\" this, could you remove the '.c9settings.xml' file? I don't think this should be part of the repo :) And also, what is \"protocoll\" (I think you mean 'protocol')?\n. How about MooEditable.Table? https://github.com/cheeaun/mooeditable/blob/master/Source/MooEditable/MooEditable.Table.js\n. Can you send a (proper) pull request on this? Thanks.\n. Fixed in 2c81c76335cbf28569a7527cc8a0b60abaca6fcd and d847babde10f7defbb1275a8ac07f004dcc5cdae\n. Added\n. Hmm perhaps I'm confused:\n\n@krues8dr ah nice, not sure if it's really a wysiwyg editor tho' if say, exclude the live editing part.\n- https://twitter.com/cheeaun/status/636409015690391552\n\nJust wondering if engineers can use it without the live-editing server part(?).\n. :+1: added\n. Thanks! Fixed 😄 \n. Hey sorry this project is not longer maintained.. ",
    "shaunfreeman": "php version of the Dean Edwards JavaScript's Packer Packer\n. ",
    "SunboX": "Ups... wrong user. Sorry!\n. Hm, ah ok. Works fine in Firefox but does not in IE. I´ve not much time now, will take a look later. thx\n. *lol Thanks! Cloud9 IDE added this file, i didn´t see it in the online editor, thats bad... btw it´s a beta. :o) And you´re right, i meant \"protocol\" ... stupid german, in germany it´s called \"Protokoll\" :D\nI´ve also fixed a bug with event handling in IE (\"CleanPaste\" mod).\n. ",
    "xrado": "i was experimenting with this already, somehow if iframe and textarea stay visible the whole time while toggling formatting will not get corrupted, strange...\n. no, I had cleanup turned off\n. good idea! :) just did it and tested it and works fine ..cool\nhttp://github.com/xrado/mooeditable/commit/5b10e28e5266f77a378674dc585c1c34c2cef7ed\n. ",
    "assertchris": "Simply snag the style element that the typekit script creates in the parent document and duplicate it in the child iframe...\n. ",
    "jaydiablo": "Quick look at the source and it seems the \"Put quotes around unquoted attributes\" regex in the cleanup method of MooEditable.js (line 774) is the culprit here.  It thinks the comment tags are an html element, and the = signs it sees in the JS code between the comment tags are html attributes so it inserts some quotes where it doesn't see any.  I was aboe to fix my test case here by changing the initial regex from:\n/<[^>]*>/g\nto:\n/<[^!>]*>/g\nWhich won't match comments, though it may not match elements that it should if they contain any exclamation points in the attribute value (which I assume is legal html syntax).\n. sure thing.\nHere's an example of the bug.  Notice in the HTML window I have two instances of that google adsense code, but if you click on the View Source in the mooeditable, you'll see 3 instances of it.\nhttp://jsfiddle.net/HZU5x/\nAnd here's the same shell with my \"hacky\" fixed version.\nhttp://jsfiddle.net/vzNu9/\nThanks.\n. cheeaun, your fix seems to take care of my particular use case.  I'll let you know if I see anything odd.\n. ",
    "orefalo": "I just tried on a Mac Safari, opened http://cheeaun.github.com/mooeditable/ added a image via a URL, then clicked the image and moved it around and all worked as expected.\nI can confirm that it also works fine in Chrome.\n. ",
    "ryanmitchell": "This is very odd. I'll need to have a look on Monday as to whats causing it then. I added a  option to the codebase which might be part of the problem. I'll update this issue once I have tied it down some more.\n. sorry, it stripped my html. Should have read: I added a (base url=\"\") option to the codebase.\n. Yeah - what I'm using it for is editing an img properties - like allowing width/height/alt etc to be changed. So in Safari the image button was never showing as selected, as it would always think the paragraph node was selectedNode using checkStates, but when you use the selectNode after clicking the image you should call checkStates so that anything waiting for an image to be selected gets the right information.\n. That is due to the limitations of the iOS platform - it doesn't support content editable.\nProbably should just fallback to textarea?\n. ",
    "Hdready-graphic": "Change for (need mootools-more measure) :\nvar dimensions = this.options.dimensions || this.textarea.measure(function(){return this.getSize();\n. ",
    "nickolasgregory": "Is Fixed.\nSorry, cannot find that commit that did it.\n. Thanks :)\n. ",
    "Paxa": "Great!!! thank you !!!\nIts appear to be so easy Element.getParents(node) and Object.append(this.win, new Window); :)\nYour code is awesome\n. Thank you.\nThink this is weird end of line in files, I don't know why my mac os and git 1.7 did it\n. Thank you for advise, I'll use it :) git gui is awesome, may be even more then gitx\n. ",
    "marcj": "Yes, this could be a solution - but sadly only 'could'.\nIt's the worst thing ever, when the user gets tons of buttons at once - only to handle tables.\nI'm working on this issue right now.\n. I've added some usability stuff - maybe you can take a look at it and give me some response.\nhttp://marcj.github.com/mooeditable/\n. Well, thanks darkthal for your testings!\nThis feedback looks very good and I believe, I can fix these issues in the next days (also 'cause I need it fast for my other project too).\n. Maybe you can let the ticket open, until it's totally fixed/integrated.\n. Yepp, I checked my fork of mooeditable ('cause the demo from cheeaun is corrupt) few minutes ago with iOS 5 Beta - looks good, but needs some work in the text selection area and image selection (especially resizing).\n. ",
    "cleankod": "\nThe \"undo\" seems not to work correctly when modifying the tables.\nMerge cells, then in the same column add a new one. There will be one more column as a \"bonus\".\nWhen table has many columns, merge cell/row command will merge 3 cells. It would be great to somehow select the cells to merge (like in excel). Then only one command - \"merge\" should do fine.\nAfter merging rows/cells try to select column/row. The selection is not adequate.\n\"Split cell\" would be great.\nIt would be great to edit other table parameters, especially cell padding and cell spacing. I know it can be done with CSS, however sometimes this is easier.\nRow selecting cells should be smaller.\n\nAfter deploying and using the editor in production, I can give more tips. But that is it for now. Hope it helps.\nPS. All in all, as a simple table editor it works great. Great job so far!\n. ",
    "angelsk": "Gah - JS in wrong order.  Ignore me :(\n. This should have been fixed in https://github.com/cheeaun/mooeditable/commit/66de0cca53b081d1f73da9ef57d833bdc1c0f41c :)\n. This should have been fixed in https://github.com/cheeaun/mooeditable/commit/66de0cca53b081d1f73da9ef57d833bdc1c0f41c which was merged from my pull request :)\n. ",
    "davidatfuzzylime": "Yeah I feared that was the case. I guess a fallback would be the best option in the meantime!\n. Upgrading to the current version of MooTools now seems to fix this issue.\n. ",
    "viktors": "On iOS5 it might work fine: http://www.youtube.com/watch?v=I3NQlwBOXpQ\n. ",
    "natebeaty": "FYI, I ended up fixing this issue on my older install of mooeditable by also adding type=\"button\" to the buttons in the HTML created for the dialogs.\n. ",
    "andyfleming": "+1\n. ",
    "fuegas": "This is caused by line 121. Here the table is set to full width, hence you won't be able to get your cursor behind it.\nIn my fork I heavily modified tables (and I'm not done yet), and there this issue is resolved. Well, ok, not when you have that much data in your tables it actually uses the whole width, but you can modify it by the html view if needed.\n. ",
    "nielsvantilborg": "Try this:\nGet the Mootools More 1.4 asset from  http://mootools.net/more/ only select Locale.\nAdd scripts\nsrc=\"../assets/mootools.js\"\nsrc=\"../assets/mootools-more-1.4.0.1.js\"\nsrc=\"../../Source/Locale/Locale.es-ES.MooEditable.js\"\nsrc=\"../../Source/MooEditable/MooEditable.js\"\n. ",
    "IsabelPalomar": ":+1:\n. ",
    "bhaku": "http://cheeaun.github.io/mooeditable/\n. Sorry I'm not a developer this plugin\n. ",
    "soaj1664": "Hi @bhaku \nFirst of all thanks for quick reply. \nThe editor is vulnerable to an XSS. The editor allows users to insert link and if instead of normal link, I input JavaScript URI\njavascript:alert%28location%29\nthen it works. The attacker can execute arbitrary code of his choice. Please fix this issue. Thanks\n. @bhaku Is the issue has been fixed? Thanks!\n. ",
    "vandenoever": "thanks\n. ",
    "JohnMcLear": "Yep engineers can with a little hacking\n. ",
    "krues8dr": ":+1:\n. "
}