{
    "chrisalbon": "Thanks!\n. Thanks hadoopjax!\n. Fixed! Pushing when I get off the plane :)\nmartinnick wrote:\n\nHi Chris - in the data structures section need to do a find/replace on\nTruples -> Tuples\nGreat stuff!\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly or view it on GitHub\nhttps://github.com/chrisalbon/peripheral_brain/issues/2\n. Haha, sorry all. I chose the wrong date, I've fixed it.\n. Awesome! Thanks! Fixed!\n. Thanks Bob!\n\nThat is a way better way. Corrected! \nhttp://chrisalbon.com/python/pandas_list_unique_values_in_column.html\nBob Haffner wrote:\n\nhttp://chrisalbon.com/python/pandas_list_unique_values_in_column.html\nInstead of\n|#List unique values in the df['name'] column\npd.unique(df.name.ravel())\n|\nYou could do\n|#List unique values in the df['name'] column\ndf.name.unique()\n|\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly or view it on GitHub\nhttps://github.com/chrisalbon/peripheral_brain/issues/6\n. Thanks! Fixed!\n. fixed!. fixed. fixed one year later. I am the DMV of github issues. fixed!. @cra Good catch thanks\n\n@brseay distribution of the aircraft?\n. Thanks Adrian!\n. You mean like df['col_1'] + df[col_2']?\n. sixed!. fixed. fixed!. Hey Michael,\nThanks for the kind words!\nMy workflow is = Jupyter Notebook - > export to markdown -> convert to to html using Pelican. Any static site generator will work, I chose Pelican because I use a lot of Python.. Thanks!\n\nOn Nov 23, 2016, at 1:15 PM, Michael Andy notifications@github.com wrote:\nThanks Chris, you're awesome!\n—\nYou are receiving this because you modified the open/close state.\nReply to this email directly, view it on GitHub https://github.com/chrisalbon/Data-Science-For-Political-And-Social-Phenomena/issues/28#issuecomment-262619996, or mute the thread https://github.com/notifications/unsubscribe-auth/ADcek8CQL42XOKkA4QBfs8sqX6hLBgRCks5rBJ7mgaJpZM4K11ha.\n\n\n. fixEd. fixed!. thanks fixed!. fixed. fixed. fixed!. fixed!. fixed. Hey Phume,\nI didn't have any plans for that. However, if you want it offline, just download the zip of the gh-pages repo and then you can view it offline.. fixed thanks!. fixed!. fixed!. fixed thanks!. Thanks!. fixed!. fixed!. Awesome! Great catch.. Good catch! shakes fist at e-09 :)\nFixed. fixed thanks!. fixed!. Fixed!. Thanks! I've made the changes to the ipynb file and the md has been generated. You rock!. I haven’t yet, I will tomorrow.\nAnd yeah, the new workflow (which I am very pleased with myself about) is\nthe only edits need to be made to the ipynb files and then everything else\n(images, md files, menus, etc) are autogenerated.\nOn August 30, 2017 at 3:12:56 PM, maneesha sane (notifications@github.com)\nwrote:\nThanks. Have your changes been pushed? I don't see them live here\nhttps://chrisalbon.com/python/pandas_binning_data.html.\nAlso I have had other PRs I've wanted to contribute. I made the PR on the\n.md file here but if you are generating .md from .ipynb let me know your\nprocess and I'll work from that.\n—\nYou are receiving this because you modified the open/close state.\nReply to this email directly, view it on GitHub\nhttps://github.com/chrisalbon/mlai/pull/73#issuecomment-326134236, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/ADcek2eiF4m8aTs6TTgel09FLaq3beIzks5sdd5ogaJpZM4Nn6zP\n.\n. fixed!. fixed!. fixed. fixed!. fixed!. fixed!. fixed!. fixed. fixed!. fixed. fixed. fixed. fixed. fixed!. fixed!. fixed!. fixed!. fixed!. fixed thanks!. fixed!. fixed!. Fixed!. fixed!. fixed thanks!. fixed thanks!. Finally getting to these! Thanks so much! . Are you using Python 3?. Good tip, adding to my to-do thanks!. fixed thanks!. fixed thx!. fixed!. Good point. Added.. ",
    "ghost": "I was just coming to point out the same thing for http://chrisalbon.com/projects/data_science_reading_list.html - I actually spent a minute questioning what year it was and how old I am.\n. ",
    "bobhaffner": "Good deal.  Thanks for the awesome resource by the way\n. ",
    "tdhopper": "In Python3, they don't give lists, but you can get them with list(dict.keys()), etc.\n. ",
    "vlstrode": "\n. ",
    "cra": "the article features unrealistic setup for 6 rows\n``` python\nAn aircraft with six seats per row\nrows6 = [0,1,1,0,1,0, np.nan, np.nan, np.nan]\n```\nIt feels like the ones should come in pairs for any case\n. ",
    "brseay": "you could just find out what equipment you're on.\nand your probabilities are not weighed by the distribution of aircraft.\n. ",
    "yeshivadan": "Like this\nhttp://stackoverflow.com/questions/19377969/combine-two-columns-of-text-in-dataframe-in-pandas-python\nAlso, loading in excelfile topic, not sure what the code is, it should\npd.read_excel\nYou wrote pd.ExcelFile ()\nOn Sep 13, 2016 10:52 AM, \"Chris Albon\" notifications@github.com wrote:\n\nYou mean like df['col_1'] + df[col_2']?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/chrisalbon/Data-Science-For-Political-And-Social-Phenomena/issues/21#issuecomment-246708134,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AP-TLLwx3nleBbtWoo2j3HLv1t-B_osnks5qpri3gaJpZM4J7GO6\n.\n. \n",
    "eenblam": "@yeshivadan \n\nThe result is column a with both columns in it.\n\nThe example you gave is equivalent to the one Chris provided, with the exception that it was necessary to call .map(str) on the numeric column.\n\nAlso, loading in excelfile topic, not sure what the code is\n\npd.read_excel is a more comprehensive, single-call API for reading Excel workbooks. It immediately returns a dataframe.\npd.ExcelFile() is the constructor for an ExcelFile object, not a dataframe. This is how Chris is able to obtain the names of the sheets in the file (xls_file.sheet_names) and then load a specific one as a dataframe (xls_file.parse('Sheet1')). The sheet_names attribute seems to be the only thing you gain from using this interface, but it could be nice to have that intermediate step when processing a lot of workbooks automatically. See help(pd.ExcelFile).\n. ",
    "MichaelJAndy": "Thanks Chris, you're awesome!. ",
    "sbermancrossville": "I just noticed this too. ",
    "keefellow": "i have it sorted. \nmy problem is due to opening the csv file in excel and having the date formatting all screwed. \nediting from text editor solves the problem.\nthanks.. ",
    "Subhraj07": "Thanks... ",
    "phume": "Thanks, Chris!!. ",
    "nablue": "Additional error:\ndf.iloc[2:] does not select every row after the third row.  Rather, it selects every row beginning with the third row.. ",
    "jss367": "There's a mistake in my comments. Here's a fixed version of it:\ndef binary_search(sorted_list, target):\n\n'''This function inputs a sorted list and a target value to find and returns ....'''\n\n# Create variables for the index of the first and last elements\nstart = 0\nend = len(sorted_list) - 1\n\nwhile end >= start:\n\n    # Create a variable for the index of the middle term\n    middle = start + (end - start) // 2  # // is integer division in Python 3.X\n\n    # If the target value is less than the middle value of the search area\n    if target < sorted_list[middle]:\n        # Cut the list in half by making the new end value the old middle value minus 1\n        # The minus one is because we already ruled the middle value out, so we can ignore it\n        end = middle - 1\n\n    #  Else, if the target value is greater than the middle value of the search area\n    elif target > sorted_list[middle]:\n        # Cut the list in half by making the new start value the old middle value plus 1\n        # The plus one is because we already ruled the middle value out, so we can ignore it\n        start = middle + 1\n\n    # If it's not too high or too low, it must be just right, return the location\n    else:\n        return (\"Found it at index: {}\".format(middle))\n\n# If we've fallen out of the while loop the target value is not in the list\nreturn print(\"Not in list!\"). Closed to fix typo in comments.\n",
    "evanagovino": "I just did this and ran across the same problem. I changed the password temporarily and it worked. I'm not sure if there's an issue copying and pasting a big unicode string?. ",
    "joshjacobson": "@evanagovino How did you change the password temporarily?\n+1 on this issue.. ",
    "maneesha": "I came across the same thing today so I submitted a PR: https://github.com/chrisalbon/notes_on_data_science_machine_learning_and_artificial_intelligence/pull/73. Thanks.  Have your changes been pushed? I don't see them live here.\nAlso I have had other PRs I've wanted to contribute.  I made the PR on the .md file here but if you are generating .md from .ipynb let me know your process and I'll work from that.. ",
    "replacedwings": "Thank you!\nOn Tue, Aug 29, 2017 at 2:26 PM Chris Albon notifications@github.com\nwrote:\n\nfixed thanks!\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/chrisalbon/notes_on_data_science_machine_learning_and_artificial_intelligence/issues/110#issuecomment-325792698,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AEmhlRP4MmvTpEkXtXb63gDpQD-XevYUks5sdHQOgaJpZM4Ohv64\n.\n. \n"
}