{
    "cjohansen": "Sorry about not replying, I though new issues would be sent by email, oops! Will fix soon.\n. Cool, I'll check it out and merge in this week. Thanks!\n. This was closed a while back\n. Sure, you can just skip the minifyer with the -m/--minifyer option:\n juicer merge -m none myfile.js\n(Sorry about the late reply, I though new issues would be sent by email, oops!)\n. Fixed\n. Fixed\n. Fixed in 0.2.6 which should be on gem servers shortly\n. Fixed\n. This is likely a firewall issue. I'm going to change ftp downloads to http. You can get Rhino here: http://www.mozilla.org/rhino/download.html Put it in $JUICER_HOME/lib (on linux this is ~/.juicer/lib). The help command unfortuntely isn't more helpful currently. I'll help you with any issues you have!\n. 0.2.6 will no longer use the ftp protocol\n. Possibly a network issue? Could you try again?\n. Could you try from master? I've replaced Hpricot with Nokogiri, but it shouldn't matter. It works here. Also, try to wget the URL manually, see what you get.\n. Closing this\n. Your expectation is quite correct, however it's hard to tell you exactly why it isn't working without seeing your source files. From the look of it you might have misunderstood the document-root option. It's supposed to tell Juicer which directory on your disk is served as the root resource. If your site lives in /var/www/yoursite/ then perhaps your document root would be /var/www/yoursite/public. It's used by Juicer to resolve URLs like \"/images/logo.png\" to a full file path. From the look of your example, I'd advice you to try --document-root ./public.\nBy the way: you don't need --ignore-problems when you --skip-verification :)\n. Closing\n. Thanks, this is solved now\n. JsLint options can be set inside a comment in JavaScript files. Unfortunately, there's no way (atleast for now) to skip certain files from JsLint when you run \"merge\". You can, however, verify files manually by running juicer verify glob-pattern  where glob-pattern could be something like \"src/*/.js\". Then you can skip the verification with merge with -s\n. juicer merge -s. Also juicer merge -h\n. There's not much. There's --help and http://cjohansen.no/en/ruby/juicer_a_css_and_javascript_packaging_tool\n. Nice going on the wiki. Unfortunately there is no way to set global jslint options with Juicer. Setting options in a file will still be file-local. I guess you could have options in a file, combine it with all the others and then do lint on that...\n. It's the zip gem that fails I think. It's on my list.\n. Thanks. My tests for the upcoming 1.0 release looks like they're all green on 1.9, except for one insignificant test.\n. Closed\n. There already is :) --minifyer none or simply -m \"\"\n. I run the tests with rake test. To fix the problem you're encountering, I have this in my .zshrc file:\nexport RUBYOPT=-rubygems\n. Closing ticket\n. Thanks for this and sorry for the late reply! I'll pull now. I've been using the latest build to try it out, but ironycally I already had the tools installed and never tried the install command...\n. That is very cool, Aaron! I've pulled, run tests and confirmed that this is some good stuff :) It's pushed to my repo now. I think 1.0 release is approaching. Thanks alot! Please don't hesitate if you have other ideas as well.\n. yeraycaballero: No, sorry not at the moment. That would be interesting though.\n. Thanks! Merged in.\n. Thanks, I'll have a look at it!\n. Fixed in 1.0.1 (out now)\n. Thanks, Dallan! I've fixed this now, will release 1.0.3 shortly.\n. Thanks, Dallan! This is actually a feature I could use myself. Your input on solution looks good, but I will take a little more time to think about it to make sure we get all corners covered. If you want to make a patch out of it including test cases I'd be more than happy to merge it in!\n. Hi Dallan! Sorry for the lousy reply-time. I got completely swamped completing my book, and had to cut anything that didn't directly pitch in to that. Sorry.\nIf you want some help on the tests, will looking at the existing test cases help? If you need more specific advice, don't hesitate to ask, and I'll help as best I can. You could shoot me an email on christian@cjohansen.no if you want.\n. Thanks, I'll look into it. In the meantime, try with an older version of the Google Closure Compiler.\n. This issue is now solved. Juicer 1.0.4 is pushed to gem servers, and should be available shortly.\n. This seems to be some kind of Windows path name issue. I don't have a working 1.9/Windows install available, and don't use Windows so any help in resolving this would be appreciated.\n. Thanks, that looks sensible. I don't have access to a Windows machine until monday. Could you try something for me?\nD:\\>java -cp C:\\location\\of\\juicer\\bin -jar yui-compressor.jar\nDoes that help with the \"unable to access jar file\" error? If so, I can patch these two issues up and do a release next week.\n. Hi,\nIn some sort of weird coincidence, I received a pull request containing fixes to the asset hosts implementation today. I've pulled and prepared 1.0.4 which should hit gem servers tomorrow. I'll test and try to help you out with the command tomorrow. Sorry for the inconvenience!\n. I used the following command:\njuicer merge -f --all-hosts-local -h http://host1,http://host2 -b -d . design/css/my.css \nThis works for all URL's already absolute, but it seems a there's a bug here. Any relative URL's are mapped to absolute, but they aren't given host names. I have to look into this and provide a fix.\n. It seems that relative urls don't have asset hosts added. I've added a fix for it, but I need to test it more before I can release. If you want to try it, clone the repo and build juicer:\n\ngit clone git@github.com:cjohansen/juicer.git\ncd juicer\nrake build\ngem install pkg/juicer-1.0.4.gem\n\n. This issue should be fixed with 1.0.5 which was just released\n. This is Nokogiri not working right. Unfortunately I have no idea why this happens. It may be a problem with the Nokogiri binary/Ruby 1.9.2/Win7 combination? Not seeing this locally (Linux).\n. Ah, that sucks. As a temporary fix I bundled the file for now. Pushing 1.0.9 as we speak.\n. This is something I'm interested in myself, so I'll have a look at it. Do you mind sharing why you feel Juicer is a better fit for you than Sprockets?\n. Had a look. Unfortunately, this is not easily achievable without rewriting parts of Juicer. Currently Juicer does the following:\n1) Figure out dependencies\n2) Write all dependencies to output in correct order\nWith interleaved includes the rules for circular requirements change, and a partial rewrite is needed to complete this task. I'm afraid I won't have time for that anytime soon, but I'd love to assist if you want to take a stab at it.\n. --minifyer \"\"\n. Hmm, what would that look like? How about running juicer verify separately and minify with -s (skip minifyer)?\n. Eh, that test case isn't all it could be... Anyway I fixed the error by not hard-coding the Rhino version in install/rhino.rb. Now it detects the newest version and downloads that. 1.0.10 is pushed to rubygems, may be a few minutes before it's readily available.\n. What is the path to the YUI compressor file? Are you by chance on Windows?\n. And you verified that the file was there? YUI has been moving it around lately, maybe your install failed? I just pushed a new version. Try removing ~/.juicer and then gem update juicer and then juicer install yui_compressor.\n. Great!\n. Thanks!\n. Does it work if you specify 1.0.10? Something seems to be broken with my build tool :( try gem install -v 1.0.10 juicer\n. The problem was that the tool I use to generate the gemspec insisted on having Juicer a dependency of itself... I've pushed 1.0.12 now, which does not require any previous version of Juicer. Sorry.\n. It's actually less easy than you think, since Juicer has no cache - thus it knows nothing about which files were changed since last run. Maybe checkout autolint? https://github.com/magnars/autolint\n. I don't see a problem with including it as a voluntary binary. Quite the contrary, would be useful in my opinion.\nstereobooster: What do you want to refactor? I think it looks pretty good, but it's missing two things: a hook into the binary (which does need refactoring...) and some tests :) What do you think?\n. Ah, right. Want to give it a shot? I'd suggest extracting a Juicer::RhinoBinary that includes Juicer::Binary, but removes the duplication between the Rhino binaries. \n. YUI changed the download website. I just pushed 1.0.13 to RubyGems. Install it and try again.\n. Maybe it's because of 1.9.3? Didn't try on that. Works with juicer 1.0.13 on my end.\n. Thanks!\n. Hey, thanks! Actually both of these where fixed earlier today and pushed as 1.0.13 :)\n. Thanks!\n. Hmm, interesting. What version of mocha are you using? The tests are passing locally. Something is probably missing from the automated setup.\n. Figured it out. I used to have rake test:setup that downloaded some binaries for the tests. That doesn't work anymore, and I had not added two required binaries to the index. Please pull again, and tests should run smoothly (just confirmed on a clean clone).\n. The remaining issue is stil 1.9.1? Care to pull request the environment fix you made?\n. Thanks! Inline merging in the browser is pretty damn convenient :)\n. I agree - as an opt-in this makes perfect sense. Thanks for adding this, and including tests - making it no effort to pull.\n. Ah, lovely. Thanks!\n. You mean that /usr/bin is ahead of /usr/share/java on the path and it provides a useless java binary? Juicer uses java unqualified, and so should be using whatever binary is preferred on your path. Seems odd that this should be a useless binary?\n. Juicer finds the YUICompressor jar in  ~/.juicer, which is where juicer install puts them. I don't think Juicer at any point knows anything about /usr/bin/yuicompressor, I don't even know where that came from.\n. Hey, sorry to be difficult but I'm not sure what to do. Juicer shells out to java to run Java stuff. It uses jar files found in ~/.juicer. If you want to use other jar files, symlink them to ~/.juicer. If you want to use another java, alias juicer to something like alias juicy=\"PATH=/use/share/java/bin:$PATH juicer\".\nJuicer does not search for the java binary, only the jar files.\n. No, Juicer doesn't support that. It's just a regular http download - which version of Juicer are you using?\n. Seems strange. Are you able to download manually? http://yuilibrary.com/download/yuicompressor/\n. Well, first of all I'm just trying to figure out what the problem is - if it is a network issue.\n. Goodie, glad you figured it out :)\n. To avoid checking them just pass -s (skip) to juicer merge - i.e. juicer merge -s. To avoid re-minifying them you could use --minifyer none, but then nothing would be minified. The proper solution is to not depend on minified sources (i.e. download developer builds instead).\n. You can skip minification by doing juicer merge -m none. Does that solve your use case?\n. I guess it isn't. heh. Should probably be fixed.\n. This is up to the minifyer.\n. No test - how did you verify this?\n. @oc This is Ruby, and it's encoding handling is horrible :)\n. There's a pull request in for proper UTF-8 support, awaiting some tests.\n. I'm guessing they changed the site markup again? Did the problem persist? Or are you perhaps behind some proxy/firewall?\n. Thanks, fixed and released as 1.0.14\n. I think it would not be very hard to add. However, as you might be aware of, this project is not currently on the top of my list of priorities. I'd suggest using Juicer with -s (i.e. skip lint) and use https://github.com/magnars/autolint for your linting pleasure. It also allows you to put lint configuration in one place, not in all source files.\n. Thanks!\n. I guess Juicer should probably ignore external URLs. Right now, the best approach I can think of is to put that statement in its own file, and use cat to combine it with the one Juicer builds. Not exactly optimal, I know...\n. Seems like your version of JsLint is too old. Try juicer install jslint to update.\n. Looks like the problem is with libxml, which Juicer depends on.\n. AFAICT, it's failing to build the libxml bindings because the development files (the header file listed in the error output) cannot be found. I have no idea how to solve it on a Mac. You can reproduce by simply trying gem install nokogiri\n. That should be suggested as a feature for YUI Compressor, not Juicer. Juicer does not implement actual CSS compression or anything alike it.\n. Fixed. Upgrade Juicer.\n. Seems like it thinks it downloaded YUI compressor, but really didn't. Did you use sudo when install YUI Compressor? (you shouldn't do that)\n. Want to make this into a patch? :)\n. Thanks! Released as 1.0.18\n. I put the quick fix into 1.0.20.\n. Thanks, pushed 1.0.19 now.\n. Thanks, released as 1.0.21\n. So this basically ignores invalid utf-8 characters? Wouldn't it be better to fix them in the source files?\n. Warnings are a good compromise :)\n. 1.0.22 pushed\n. Thanks! Pushed as Juicer 1.1.0\n. Thanks, released as 1.1.1.\n. So... Looks like someone changed something on the YUI side again. PR welcome.\n. Mind rebasing against current master?\n. Sure? It is still unpullable in the GitHub UI, and I see no updates on the commits.\n. Thanks! 1.2.0 is out\n. 1.1.2 is out, thanks!\n. I don't maintain Juicer anymore, I suggest you look for an alternative.\n. Right, fixed :)\n. ",
    "evocateur": "I have a fix for this in my fork, if you like.\n. ",
    "jsahlen": "This has broken again – the path for finding the latest version doesn't work anymore. Changing line 63 to the following will do the trick:\n@latest = (webpage / \"//h3[@id='yuicompressor']/..//a\")[1].text\n. ",
    "jakubpawlowicz": "Had a similar issue and putting Rhino zip file to ~/.juicer/download/rhino/ and then running 'juicer install jslint' did the trick.\n. Yes, you are right. I found a workaround by using http://github.com/febeling/rubyzip\n. 1.0 release? Looking forward to it!\n. ",
    "grimen": "No, same.\n. The master gemspec is invalid - looked for files that don't exist. Everything works fine after re-generating gemspec and build/install the gem. =)\n. ",
    "ozten": "\nUnfortunately, there's no way (atleast for now) to skip certain files\n+1\n. \n",
    "Devric": "can you skip jslint when doing a js merge?\nit keeps bitching about spacings! and undefined $ = jQuery\nwhich is working perfectly fine.\n!note i fix the issue about spacings through using jsbeautifier (i was compiling with coffee at first) but not the undefined issue\n. ",
    "jackhand": "where is the documentation where this and other juicer options are specified?\n. thanks. I created a wiki page on this github so novices like me can quickly learn about juicer. \nIn regards to jslint. Is there a way to disable certain jslint options not just for a page but for the entire jslint experience? Should I create jslint command comments in the very 1st page that juicer checks?\n. I'm also seeing this in Windows 8.\n. I think I may have figured it out.\n1) Change all import statements so they are refer to the root path. Instead of \"bar/Bar.js\" or \"../bar/Bar.js\", it should be written \"/bar/Bar.js\"\n2) Then the Juicer command line should be something the following:\n\"juicer merge App.js -d \"\nThis works for me. Is this the recommended way of achieving this?\n. Correction: The command line should have included an absolute path  after the -d command, like so:\n\"juicer merge App.js -d 'C:\\project\\assets\\js'\"\n. ",
    "monecchi": "Thanks you all guys! juicer merge -s worked like a charm, I've successfully \"juiced\" about 20 mixed js/css files to a minimum size!! \n. Yeah! indeed it solved the issue! Thanks a lot for the input.\n. ",
    "ktheory": "Works like a charm. Thanks!\n-Aaron\n. Just a guess...but do you already have juicer 1.0.0 installed in /opt/local/lib?\nIt's a bit non-standard to have /opt/local/lib in your load path, but it should still work. I suspect the build process is requiring the /opt/local/lib juicer instead of the one in ~/source/juicer.\nIf juicer is installed in /opt/local/lib, try uninstalling it, then building from source. Or muck with your LOAD_PATH to make sure ./lib is before  /opt/local/lib.\nIf that doesn't work, try running rake build install with the -t flag for more verbose output. That will report exactly which task is failing (the build task invokes several other tasks).\n. Ah, I would get the same error when I ran juicer install yui_compressor using the latest master.\nSome Juicer::Install submodules aren't requiring juicer/install/base. I have a patch on my topic branch, fix_install_tasks: http://github.com/ktheory/juicer/tree/fix_install_tasks\n. ",
    "yeraycaballero": "Hi Christian, \nIt's possible use a root directory in @depends?\nI'm trying to avoid paths like @depends ../../../foo.js. I would like write something like\n@depends $root/views/view.js\n@depends $root/control/commands/command.js\n. ",
    "psyho": "This also happens for embeded css images (see the patch I sent to you)\n. ",
    "DallanQ": "It looks like markdown removed the asterisks in my post.  There should be an asterisk after each of the [\\s\"'] expressions in my suggested fix.\n. Well, my solution could break cache-busters because it changes the URLs upstream, before the image filename timestamp is read.  So when copying images from src to dest, you'd have to keep the src timestamps.  But I wasn't sure how to implement a solution that changed src to dest urls after the cachebuster was calculated, so I went with the simple-but-lesser approach.\nSo with that caveat, if you'd still like me to submit a patch with some test cases I'm happy to do that.  However, I haven't done anything like that before so I'd appreciate a couple of sentences on what you're looking for.\n. ",
    "dewski": "I get this as well, just to note.\n. ",
    "Monokai": "Just to let you know I'm having the same issue. Tried on all 1.x versions and they all display this error.\n. ",
    "shiki": "I'm also getting this error -- with Ruby 1.9.1 running on Ubuntu\n. Also, I think maybe this is just for Ruby 1.9.1. I have a VM here with Ruby 1.8.7 and it seems to be working fine.\n. ",
    "ktsashes": "I'll look into it and see what I can come up with, but I'm new to ruby so I'm not sure how much I'll be able to track down for sure... Though shiki says he was having issues in ubuntu to. I'll spin up a ubuntu vm and see if I can't reproduce it there too to see if its windows specific.\n. Okay, the fix for it seems to be pretty simple. I just changed the relative method to resort to the full path if it cannot use the relative one. I'm not sure if that breaks it in other spots though. It allows me to run without error, though I still receive the 'unable to access jar file'.\nHere is the fix I implemented.\nChange:\n          path.relative_path_from(reference_path).to_s\nTo:\n          begin\n            path.relative_path_from(reference_path).to_s\n          rescue ArgumentError\n            path.realpath()\n          end\nAnd the full transcript of a run this time:\n    D:\\Scripts\\Google-Bump>juicer merge main.js -s -f -o %appdata%\\Mozilla\\Firefox\\Profiles\\eyo2kaec.default\\gm_scripts\\google_bump\\google_bump.user.js\n    C:/Ruby19/lib/ruby/gems/1.9.1/gems/juicer-1.0.3/lib/juicer.rb:61: warning: nested repeat operator + and ? was replaced with ''\n    C:/Ruby19/lib/ruby/gems/1.9.1/gems/juicer-1.0.3/lib/juicer.rb:61: warning: nested repeat operator + and ? was replaced with ''\n    C:/Ruby19/lib/ruby/gems/1.9.1/gems/juicer-1.0.3/lib/juicer.rb:61: warning: nested repeat operator + and ? was replaced with ''\n    C:/Ruby19/lib/ruby/gems/1.9.1/gems/juicer-1.0.3/lib/juicer.rb:61: warning: nested repeat operator + and ? was replaced with ''\n    Unable to access jarfile\n    Produced C:/Users/Android/AppData/Roaming/Mozilla/Firefox/Profiles/eyo2kaec.default/gm_scripts/google_bump/google_bump.user.js from\n      header.js\n      image-store.js\n      options-store.js\n      helper-functions.js\n      media-embed.js\n      style-assignment-header.js\n      assign-style-center.js\n      center-styles.css\n      assign-style-classic.js\n      classic-styles.css\n      assign-style-color.js\n      color-picker.css\n      assign-style-column.js\n      column-styles.css\n      assign-style-dock.js\n      dock-styles.css\n      assign-style-gen.js\n      general-styles.css\n      assign-style-media.js\n      media-styles.css\n      assign-style-multi.js\n      multisearch-styles.css\n      stylesheet-store.js\n      style-functions.js\n      update.js\n      color-picker.js\n      dialog-pieces.js\n      dialogs.js\n      dialog-functions.js\n      shortcuts.js\n      multisearch.js\n      text-functions.js\n      visual-functions.js\n      video-extraction.js\n      video-search.js\n      video-functions.js\n      image-search.js\n      image-functions.js\n      wiki-functions.js\n      main.js\n. The unable to access jar seems to have stemmed from my not having install YUI compressor at all. Installing it via juicer fixed my error. Seems to have been unrelated.\n. ",
    "shucke": "Nah, no inconvenience my friend, appreciate your work, very nice tool Did finally figure out that the secret was the relative paths. It seems to block you unless you use relative, is that correct? something like that. I ended up rolling through my css and posting that but now am trying to debug a bunch of jquery add-ons. Interesting how many errors jquery throws when running it through jslint. just goes to show you, everybody's got issues. Keep up the good work and I will grab that update when it hits the shelves. enjoy and thanks\n. gave it a try but your system threw me out like the bum I am...\nThis would be the first time I have used git, and my experience with modern (read linux or osx) compilers and the build process is fairly limited having been pampered with windows and dev studio type situations for most of my 25 year off and on pro and amateur career so please bear with the noobness... This fix is timely however as I have updated all urls of static content to run as relative for the simple reason that I need the same web to run under both standard and ssl connections and therefore the use of //staticsubdomain.domain.com is in order...\nHope I can access soon. thank you\nThe authenticity of host 'github.com (207.97.227.239)' can't be established.\nRSA key fingerprint is 16:27:ac:a5:76:28:2d:36:63:1b:56:4d:eb:df:a6:48.\nAre you sure you want to continue connecting (yes/no)? y\nPlease type 'yes' or 'no': yes\nWarning: Permanently added 'github.com,207.97.227.239' (RSA) to the list of known hosts.\nPermission denied (publickey).\nfatal: The remote end hung up unexpectedly\n. I should be more clear on what I am, and I would imagine lots of others will need to do because I am not sure that your setup to be able to do it yet...\nRegarding absolute vs. relative vs. the third option which I have heard referred to as fixed relative or absolute relative or absolutely ridiculous, there needs to be the third option for those who run sites under both open and ssl connections. When an absolute url of say, http://static.domain.com is connected in ssl we get the browser errors and IE claiming an insecure connection. If we try and use relative paths we have no way to provide best practice urls to force static content to a cookieless domain and/or cdn. So by providing the subdomain without the connection type (ie. http, https) we can allow the flexibility of a dual connected website along with the best practices for speeding up our website. Can you dig it man? I knew you could. \nSo what say you, all in favor of making sure this coolest of tools can do the duo connection raise your right leg, those opposed just keep ya pie holes shut...\nseriously, I am not sure if yours can do it already, and in my case no biggie because I already went through and modified all my links to do the duo, but I hope that it can go this route, would probably be so helpful to so many.\nkeep it real!\n. ",
    "stereobooster": "no problems with nokogiri 1.4.4.1-x86-mingw32\n. Only 4 rules from 16 have something in share with OOCSS. All other is common. For example: Remove empty rules, Use correct properties for a display and so on. You can turn of rules which you don't agree.\n. > stereobooster: What do you want to refactor?\nI begin to add csslint and find myself copy/pasting code, for me it's a sign... Take a look\n. > Ah, right. Want to give it a shot?\nI will try if i have time. But I can’t promise anything.\n. oops, copy paste. I mean juicer.gemspec\n. ",
    "ivanchoff": ":( i need it\n. ",
    "costa": "Thanks for your attention and your work. Unfortunately, I've spent too much time with JS recently, and it's tiring like hell, so I'll try to avoid touching anything JS-related anytime soon.\nI hope a solution for this issue will come up eventually, meanwhile, I'll stick to sprockets.\nRegarding the preference, Juicer looks more powerful than sprockets -- with the latter having a single-JS-per-app config, stupid yamls, overall API deficiency etc (no offence though, it does its job well in simple/most cases) -- but I'd like to make any conclusions when I have a chance to actually use Juicer.\n. ",
    "jamestomasino": "What about an option to not minify?\n. Ahh, excellent! Thank you.\n. ",
    "olleolleolle": "Weeeeell, that is what I ended up doing. Perhaps this is just a tactic that needs to be advertised as soon as possible to the user. So that I don't end up complaining like this.\n. juicer (1.0.9) was the affected version.\n. http://ftp.mozilla.org/pub/mozilla.org/js/rhino1_7R3.zip exists, since May 9, 2011, though.\n. https://gist.github.com/c4463f0c41315170657f is a random change, at least indicating where that string was used. Why are you downloading >1 Rhino?\n. ",
    "mattfordham": "I'm on OSX. The YUI compressor is in ~/.juicer/lib/yui_compressor.\n. That fixed it, thanks!\n. ",
    "alexdesignworks": "Actually, there is another question here: how to deliberately merge and not minify (aka aggregate)? \nUPDATE: Just found an answer in issue #28\nTo disable minification and use combining/aggregation of files use--minifyer \"\"\n. Same issue with Ubuntu. Installing Nokogiri helped.\nhttp://nokogiri.org/tutorials/installing_nokogiri.html\n. Found a reason for this problem: needed to add path to Java executable to PATH variable.\n. ",
    "ende76": "I can confirm the issue in Ubuntu 10.04 LTS.\nChristian's suggestion for a work-around worked for me.\nAfter I had installed juicer v1.0.10, I've run gem update. The upgrade to juicer v.1.0.11 worked without problems.\n. ",
    "justin-c-rounds": "I confirm on Snow Leopard (10.6.7), using ruby 1.8.7 (2009-06-12 patchlevel 174) [universal-darwin10.0] and rubygems 1.8.5. Attempting to install older versions throws the same error.\nNot sure what is going on here — not too long ago I installed it on another machine (also 10.6.7 and ruby 1.8.7, but with rubygems 1.4.2). Just for fun I updated rubygems on that machine to 1.8.5, ran gem update juicer and it updated fine.\n. ",
    "frankpf": "I don't think that should be included as a default. \nCSS Lint is an extremely optionated tool based on principles of OOCSS, which many don't agree.\n. ",
    "sgtpep": "The same for me on Mac OS X / rvm / Ruby 1.9.2. Recent versions fails to install yui_compressor, too.\n. ",
    "gametbt": "I have the same issue with the latest install:\n$ juicer install yui_compressor\n/usr/local/ruby-1.9.3-rc1/lib/ruby/1.9.1/rubygems/custom_require.rb:36:in require': iconv will be deprecated in the future, use String#encode instead.\n/usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/lib/juicer/install/yui_compressor_installer.rb:65:inlatest': undefined method []' for nil:NilClass (NoMethodError)\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/lib/juicer/command/install.rb:57:inversion'\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/lib/juicer/command/install.rb:42:in block in execute'\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/lib/juicer/command/install.rb:39:ineach'\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/lib/juicer/command/install.rb:39:in execute'\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/cmdparse-2.0.3/lib/cmdparse.rb:436:inparse'\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/lib/juicer/cli.rb:27:in parse'\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/lib/juicer/cli.rb:37:inrun'\n    from /usr/local/ruby-1.9.3-rc1/lib/ruby/gems/1.9.1/gems/juicer-1.0.13/bin/juicer:6:in <top (required)>'\n    from /usr/local/ruby/bin/juicer:19:inload'\n    from /usr/local/ruby/bin/juicer:19:in `'\n. ",
    "PatrickTulskie": "Oops I see there is already a fixed version that solves the yui compressor issue.  I fixed it yesterday and didn't get around to sending the pull request until today.\n. ",
    "bcardarella": "Not very helpful without the suite output:\nhttps://gist.github.com/1187204\n. I have version 0.9.12 installed.\n. Awesome, thanks :)\n. I just tried this again with the latest changes and it is still failing.\nWith Ruby 1.9.2-p290 I get 4 failures and 83 errors: https://gist.github.com/1196862\nWith Ruby 1.8.7-p334 I get 5 failing tests: https://gist.github.com/1196852\n. So this seems to be a dependency issue. I've made this change: https://github.com/bcardarella/juicer/commit/54c70d5e5aeadf31d9248bd6cafc25d39d0ce959\nand now only get 1 error with the test suite\nTestCssCacheBuster:\n test: absolute paths should resolve with document root.  (0.01s) \n    ERROR test: cache busters should add mtime to urls.  (0.01s) \n          ArgumentError: assertion message must be String or Proc, but Juicer::Asset::Path was given.\n          /Users/bcardarella/projects/juicer/test/unit/juicer/css_cache_buster_test.rb:83:in `block (3 levels) in <class:TestCssCacheBuster>'\n. Yes, it 1.9.2\n. Just sent the pull request\n. Yeah, it's pretty awesome :)\nOn Tue, Sep 6, 2011 at 4:04 AM, cjohansen\nreply@reply.github.com\nwrote:\n\nThanks! Inline merging in the browser is pretty damn convenient :)\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/cjohansen/juicer/pull/42#issuecomment-2010178\n. This one might be controversial considering the pain it seems you've gone through to deal with embedded images. I believe I made a good case in the description of the pull request but if you disagree I would ask that we debate the issue first before you close.\n. \n",
    "orbisvicis": "Unfortunately I'm not familiar enough with ruby esp instantiation of modules vs classes, but I think some possible solutions are:\n1] extend Juicer::Binary::locate to accept varargs list of additional search paths\n2] modify Juicer::JavaBase::initialize to append all extra search paths to the @path variable\n. No, i'd just like to run \"juicer merge\" without --path\n$  cat /usr/bin/yuicompressor \n!/bin/bash\njava -jar /usr/share/java/yuicompressor-2.4.6.jar \"$@\"\nIt won't even match bin_glob which is how juicer finds the yuicompressor jar. \"/usr/bin/\" is really a useless piece of information.\n\"/usr/share/java/\" is the default path for jar files in linux (but it isnt on $PATH env var) so I thought juicer should look for the jar there by default as well.\n. Anyway, can you add /usr/share/java in addition to ~/.juicer ?\n. ",
    "portlandtransport": "1.0.13\n. I'm sure I can find a way to download the .zip for the compressor. Once I had it, where would I install it for juicer to use it?\nSame question for jslint..\nThanks.\n. I'm all set. Needed to set the http_proxy ENV var. Thanks.\n. ",
    "gleber": "Yes, it does :D Is it documented? If it is, I missed it. If it is not, it would be good to document it. Feel free to close this pull request\n. ",
    "jenshedqvist": "Nevermind, found that the \"!\" prefix worked.\n. ",
    "oc": "Isn't JS supposed to support utf8 by \"default\"? ;)\n. Oh snap; perhaps I should read the code before bile ;)\n. ",
    "luxueyan2008": "is it true?i so hope the juicer will surport utf-8 with chinese charactor\n. ",
    "schack": "Markup hasn't changed, I fixet it with a minor change in the install/Ruby code.\nyui_compressor_installer.rb line 63\nchanged:\nwebpage = Nokogiri::HTML(open(@website))\nto\nwebpage = Nokogiri::HTML(open(@website).read)\nI did the same thing for the other installers.\n. ",
    "markstar": "Thanks for getting back to me. So is this an issue with my version of libxml? Or is it a dependency that's missing? I used the --include-dependencies flag when installing so I would expect them all to be installed as part of the install process. Or is this not the case?\n. ",
    "firstactivemedia": "ok, thanks :)  I will try to get it into that project...\n. ",
    "wei2912": "Same problem too. This is due to the blocking of redirection:\nwei2912@wei2912-server:~/Downloads$ juicer install yui_compressor\n/usr/lib/ruby/1.9.1/open-uri.rb:216:in `open_loop': redirection forbidden: http://yuilibrary.com/download/yuicompressor/ ->    https://github.com/yui/yuicompressor/downloads (RuntimeError)\nfrom /usr/lib/ruby/1.9.1/open-uri.rb:146:in `open_uri'\nfrom /usr/lib/ruby/1.9.1/open-uri.rb:677:in `open'\nfrom /usr/lib/ruby/1.9.1/open-uri.rb:33:in `open'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/lib/juicer/install/yui_compressor_installer.rb:63:in `latest'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/lib/juicer/command/install.rb:57:in `version'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/lib/juicer/command/install.rb:42:in `block in execute'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/lib/juicer/command/install.rb:39:in `each'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/lib/juicer/command/install.rb:39:in `execute'\nfrom /var/lib/gems/1.9.1/gems/cmdparse-2.0.5/lib/cmdparse.rb:464:in `parse'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/lib/juicer/cli.rb:27:in `parse'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/lib/juicer/cli.rb:37:in `run'\nfrom /var/lib/gems/1.9.1/gems/juicer-1.0.16/bin/juicer:6:in `<top (required)>'\nfrom /usr/local/bin/juicer:19:in `load'\nfrom /usr/local/bin/juicer:19:in `<main>'\n. ",
    "artlantis": "Hi,\njuicer doesn't install yui_composer in Ubuntu 12.10 edition. Throwing \"SSL_connect returned=1 errno=0 state=SSLv3 read server certificate B: certificate verify failed (OpenSSL::SSL::SSLError)\" message. To workaround this, I did following changes:\n@latest = nil\nto\n   @latest = \"2.4.7\" // actual edition of yui_composer\n```\n@href = nil\nto\n   @href = \"http://cloud.github.com/downloads/yui/yuicompressor/yuicompressor-2.4.7.zip\"\n```\nfilename = download(@cdn+@href)\nto\n   filename = download(@href)\nafter this changes, yui_composer installed properly!\n. Chris, as you wish! :) \n. ",
    "daniel-lanciana": "For those that don't know the changes artlantis suggested are made to the file yui_compressor_installer.rb, which for me was located at:\n...\\ruby-1.9.3\\lib\\ruby\\gems\\1.9.1\\gems\\juicer-1.0.18\\lib\\juicer\\install\\yui_compressor_installer.rb\n. ",
    "dmce": "Can be achieved using -s option on merge\n. ",
    "xnzhu": "I am also seeing the same on Windows Server 2008 R2, Ruby version: ruby 1.8.7 (2010-12-23 patchlevel 330) [i386-mingw32]. Installed juicer 1.0.18. \nWhen tried to run:juicer install yui_compressor, got the similar error:\nC:/Ruby187/lib/ruby/1.8/net/http.rb:586:in connect': SSL_connect returned=1 errno=0 state=SSLv3 read server certificate B: certificate verify failed (OpenSSL::\nSSL::SSLError)\n        from C:/Ruby187/lib/ruby/1.8/net/http.rb:586:inconnect'\n        from C:/Ruby187/lib/ruby/1.8/net/http.rb:553:in do_start'\n        from C:/Ruby187/lib/ruby/1.8/net/http.rb:542:instart'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:242:in open_http'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:616:inbuffer_open'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:164:in open_loop'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:162:incatch'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:162:in open_loop'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:132:inopen_uri'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:518:in open'\n        from C:/Ruby187/lib/ruby/1.8/open-uri.rb:30:inopen'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/lib/juicer/install/yui_compressor_installer.rb:64:in latest'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/lib/juicer/command/install.rb:57:inversion'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/lib/juicer/command/install.rb:42:in execute'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/lib/juicer/command/install.rb:39:ineach'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/lib/juicer/command/install.rb:39:in execute'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/cmdparse-2.0.3/lib/cmdparse.rb:436:inparse'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/lib/juicer/cli.rb:27:in parse'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/lib/juicer/cli.rb:37:inrun'\n        from C:/Ruby187/lib/ruby/gems/1.8/gems/juicer-1.0.18/bin/juicer:6\n        from C:/Ruby187/bin/juicer:19:in `load'\n        from C:/Ruby187/bin/juicer:19\n. ",
    "sacparker": "I was finally able to get this working\ngem install mechanize\nUpdate yui_compressor_installer.rb\nwebpage = Nokogiri::HTML(open(@website).read)\nTO\nrequire \"mechanize\"\na = Mechanize.new\n  a.agent.http.verify_mode = OpenSSL::SSL::VERIFY_NONE\n  webpage = Nokogiri::HTML(a.get(@website).content)\nthe better way is on the answer below but because i was just needing a quick fix to install, above works\nhttp://stackoverflow.com/questions/8567973/why-does-accessing-a-ssl-site-with-mechanize-on-windows-fail-but-on-mac-work\n. ",
    "jmkacz": "I just received that error when my provisioning scripts ran on launching an EC2 instance. My issue is that there was no HOME variable set, at the time.\nIn general, if the self.home method, in lib/juicer.rb returns nil, you will get the error above. It checks for JUICER_HOME, HOME, APPDATA, HOMEDRIVE and HOMEPATH, USERPROFILE, or Personal environment variables.\nNear as I can tell, it uses self.home as the staging area to download and extract the relevant zip file.\nSince \"Personal\" is not used anywhere else in the library, I've started using to specify a directory under /tmp, and my install is now functioning.\n. ",
    "ce-walalang": "@cjohansen yes we can fix the source files but if we want to juice a lot of js files with too many invalid chars, we have to go through them one by one.\nIs it a good compromise if we just add a warning while juicing a file with invalid chars that those chars will be ignored? That way, juicing problematic files won't error out but it will not just silently juice.\nThoughts?\n. ",
    "sickill": "Same thing on ruby 2.0. Any workarounds?\n. ",
    "danielegozzi": "I do not mind at all. I am currently on holiday. ETA ~ 1-2 weeks. Thanks\nfor your interest.\nIl 03/ago/2014 17:02 \"Christian Johansen\" notifications@github.com ha\nscritto:\n\nMind rebasing against current master?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/cjohansen/juicer/pull/77#issuecomment-50992715.\n. I rebased my commits on your master. Now only 3a705050687421a88135bd7ba8e428655298793a has some significance (it's about the usage of $JAVA_OPTS in the command line of slave java processes). \n. I must have mangled something with my previous push. A couple of new commits should be visible now.\nMy most recent commit overhauls the usage of IO.popen as to avoid executing command shells. This was needed to avoid command injections in the JAVA_OPTS environment variable, but I am mostly sure that command injections were possible even before through other parameters such as input filenames.\n. \n",
    "rolfb": "Fixes #76 \n. ",
    "lucianop": "I'm sorry to hear that. I'm very grateful for Juicer, as it served me well for many years.\nWould you mind recommending an alternative, or a good starting point to look for alternatives? \n. BTW, answering the original question, the problem is that Juicer doesn't seem to play well with cmdparse 3.0.1. To fix it, this worked for me:\n$ gem uninstall cmdparse\n$ gem install cmdparse --version 2.0.6\n. ",
    "rareyman": "@lucianop Thanks for the fix/workaround. :) Also, if anyone has found any alternatives to Juicer, please post here. I primarily use it to merge and minify css files only.\n. ",
    "lkwg82": "@cjohansen maybe you write that in the readme? Would be nice. Thx.\n. ",
    "sys0dm1n": "Thank you @lucianop for the fix. Worked for me.\n. ",
    "quicken": "@lucianop Thank you so much for posting your workaround. . ",
    "variousred": "i'm getting this same thing\n. ",
    "sidoh": "Same here. My stacktrace:\n/usr/local/var/rbenv/versions/2.3.0/lib/ruby/gems/2.3.0/gems/cmdparse-3.0.1/lib/cmdparse.rb:796:in `initialize': wrong number of arguments (given 2, expected 0) (ArgumentError)\n    from /usr/local/var/rbenv/versions/2.3.0/lib/ruby/gems/2.3.0/gems/juicer-1.2.0/lib/juicer/cli.rb:16:in `new'\n    from /usr/local/var/rbenv/versions/2.3.0/lib/ruby/gems/2.3.0/gems/juicer-1.2.0/lib/juicer/cli.rb:16:in `parse'\n    from /usr/local/var/rbenv/versions/2.3.0/lib/ruby/gems/2.3.0/gems/juicer-1.2.0/lib/juicer/cli.rb:37:in `run'\n    from /usr/local/var/rbenv/versions/2.3.0/lib/ruby/gems/2.3.0/gems/juicer-1.2.0/bin/juicer:6:in `<top (required)>'\n    from /usr/local/var/rbenv/versions/2.3.0/bin/juicer:23:in `load'\n    from /usr/local/var/rbenv/versions/2.3.0/bin/juicer:23:in `<main>'\n. ",
    "ghost": "Any resolution to this?\n. ",
    "matthewfedak": "saved my life...hopefully gets merged in soon. thanks Jan\n. "
}