{
    "commonsguy": "The attribute did not strictly \"change\" -- both fill_parent and match_parent are valid. You will see both used throughout the book. Eventually, I may get rid of the fill_parent values, at the point in time when readers are unlikely to encounter them in real life. But for now, it is important that readers see both of those in the book.\nThanks, though!\n. Ah! Yes, I can see where my existing logic might not have handled that scenario properly. I will test your patch tomorrow. Thanks!\n. OK, I integrated part of your change (the if() test). The line where you are setting isLeftShowing to true seems superfluous, as isLeftShowing should already be true in that case. I have pushed my version of the change to the repository, so you can see if what I did addresses your concerns. It seems to work correctly as far as I can tell. Thanks again!\n. This is not needed for this project. PopupAdapter is only used within the package. You can tell this by compiling and running the project as it is published.\nThanks, though!\n. Those were holdovers from a previous version of the sample that used anonymous inner classes. Thanks!\n. With respect to the cw-android repository, please ignore it. I keep it around because of lots of inbound links to it, but if I had a way to add a banner at the top of each of the repo's GitHub pages saying \"this repo is retired\", I would do it.\nWith respect to the bounty program, this was not a bug. While it does incrementally improve the book, the previous code would compile and run just fine. The bounty program is strictly for bugs (code or prose), mostly for scope control on the bounty program itself.\nSo, in terms of what you should do from here, that is up to you. If you wish to provide similar pull requests, that would be wonderful. If you merely wish to note in a comment here the projects needing this sort of cleanup, that will be enough of a kick in my posterior to go in there and fix them. If you'd rather spend your time on other pursuits, that is perfectly reasonable.\nOnce again, thank you for this contribution!\n. Sorry, but I do not accept pull requests on this repo. I'll review your changes and make them manually as appropriate. Thanks!\n. \"Rebuild with latest Gradle version\" -- there is nothing in your pull request that changes the Gradle version.\n\"Reformat code\" -- I would prefer to maintain consistency with the rest of my samples.\n\"Fix build error in AndroidManifest\" -- I fail to see what in this pull request would have this effect.\n. \"I changed android:targetSdkVersion=\"21\", which makes this Lollipop compatible\" -- the AdvServices/ samples are old, replaced by the ones in the Binding/ directory for the purposes of my book. These are left here for historical purposes (e.g., inbound links), with a README that explains this.\n\"Wouldn't it be better to format it like the IDE says instead of free-styling it without adhering to standards?\" -- no, for any number of reasons, not the least of which that this code goes in a book, and books in print and PDF form have line length limitations.\n. Please do not issue pull requests on this repository. This repository is in support of a book. Changes to the code need to be made by the author of the book, so the book stays in sync with the code.\n. No, particularly on this repository, for a long list of reasons.\n. Correct! Many thanks! Due to some other in-flight work, I am electing to make this edit manually on my machine rather than merge in your pull request. I'll be pushing up the repaired version when I release Version 6.9 of my book, before the end of the month.\nThanks again!\n. @IgorGanapolsky As you will note, I did not accept the pull request.\n. This repository is for publishing and browsing source code related to a book. As such, pull requests are not accepted.\n. Please learn how to use git with your own GitHub repo. You can create one via the + button in the nav bar at the top of the page.. Thanks!. D'oh! Thanks for catching that!. OK, I'll take a look at this for the next book update. Thanks!. This fix will be incorporated here (and in other samples with the same issue) in Version 8.12 of the book, due out in a couple of weeks. Thanks again!. OK, I will take a look at this for the next book update -- thanks!. OK, I will look at this for the next book update -- thanks!. This was addressed in v8.13. ",
    "johnner": "Ok, thanks for explanation!\n. ",
    "khalifavi": "Great, Thanks for great repositories!\n. ",
    "idoan": "@commonsguy Thanks for merging it. Same error exists in other sample codes as well, including the previous cw-android repository, shall I make pull requests for them as well? And I don't think I will be eligible for your bounty just by spotting these coding mistakes, will I ?\n. ",
    "orip": "Sure :)\n. ",
    "IgorGanapolsky": "I changed  android:targetSdkVersion=\"21\", which makes this Lollipop compatible.  Furthermore, I added Material theme in the manifest's application tag.  Lastly, I added:\n<uses-sdk\n       android:targetSdkVersion=\"21\"\n       android:minSdkVersion=\"16\"\n        tools:overrideLibrary=\"com.commonsware.android.advservice.binding\" />\nIn order to fix build error with support-v13 conflicts.\n. ~\" I would prefer to maintain consistency with the rest of my samples.\"\nBut your entire code samples are not formatted in Android Studio.  Wouldn't it be better to format it like the IDE says instead of free-styling it without adhering to standards?\n. You don't accept pull requests for your code?\nOn Oct 4, 2015 12:20 PM, \"Mark Murphy\" notifications@github.com wrote:\n\nPlease do not issue pull requests on this repository.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/commonsguy/cw-omnibus/pull/26#issuecomment-145363715.\n. I thought you said you do not accept pull requests on this repo?\nOn Oct 14, 2015 1:06 PM, \"Mark Murphy\" notifications@github.com wrote:\nCorrect! Many thanks! Due to some other in-flight work, I am electing to\nmake this edit manually on my machine rather than merge in your pull\nrequest. I'll be pushing up the repaired version when I release Version 6.9\nof my book, before the end of the month.\nThanks again!\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/commonsguy/cw-omnibus/pull/27#issuecomment-148119961.\n. \n",
    "alex-android-sd": "No problem. That project was very helpful for me to quickly get some tests\ngoing to play with doze, so thank you. I'll be getting a warescription soon.\n- Alex\n  On Oct 14, 2015 10:07 AM, \"Mark Murphy\" notifications@github.com wrote:\n\nCorrect! Many thanks! Due to some other in-flight work, I am electing to\nmake this edit manually on my machine rather than merge in your pull\nrequest. I'll be pushing up the repaired version when I release Version 6.9\nof my book, before the end of the month.\nThanks again!\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/commonsguy/cw-omnibus/pull/27#issuecomment-148119961.\n. \n",
    "kartikchincholikar": "Okay. Sorry for the inconvenience  :p\nOn Tue, Apr 11, 2017 at 3:49 AM, Mark Murphy notifications@github.com\nwrote:\n\nClosed #29 https://github.com/commonsguy/cw-omnibus/pull/29.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/commonsguy/cw-omnibus/pull/29#event-1037329559, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/ATbcqRP3tkmfQTEF48I97DUWE0POSETYks5ruqsOgaJpZM4M5Yzc\n.\n. \n"
}