{
    "cyrilmottier": "The ActionBarActivity was previously an OnActionBarListener. I moved it to an inner listener but forgot to change \"this\". Thank you for this patch.\n. Hi !\nThank you very much for this pull request.\nI'm really sorry but I think I won't merge it at least not entirely ...\nI have already developed a GDMapActivity internally but as I don't have a lot of time to prepare a new GreenDroid release it still need to be pushed ... I'm sure this will be done really soon ;).\nConcerning the maximum amount of items in the ActionBar, I've done this intentionally. Having more than 3 ActionBarItems is something that should be, to my opinion, impossible because it's makes the UI less clear. Google also suggested at the Google I/O 2010, 3 items is a maximum ...\nI'm not completely strict about this but I'll try to think about it.\n. GDMapActivity is now available in GreenDroid\n. Hi Jake !\nI've looked at your pull request and I'd like to thank you.\nI won't merge it as it's in conflict with the future release of GreenDroid ... I've modified the interface so that addActionBarItem() methods returns the newly created ActionBarItem.\nThis release will be available soon!\n. Thank you very much Macarse for fixing that stupid bug ... That's probably a direct consequence of a lack of tests as well as coffee :)\n. LeSuisse, you are right about adding a GDExpandableListActivity to GreenDroid. Personally I hate ExpandableListViews but I think this has to be merged to GreenDroid. I'll take a look at your pull request very soon and I'll make sure the APIs are exactly similar to those provided by ExpandableListActivity. \n. Hi szabolcsberecz,\nThis will be merged very soon. Thank you!\nCyril\n. @leandrob02: The original purpose of a SubtextItem is to display a title with a subtitle displayed on several lines. When originally developing it, I considered this item should be used to give a description of something. As a result, it is intentionally disabled by default. On the contrary, a SubtitleItem is enabled by default.\nPlease also note you can create your own items if you really want to. The process is pretty simple and consists on copying what's GreenDroid is doing internally.\n@nicholas-jordan: Sorry but I don't understand your comment in this leandrob02's pull request. We are not using generics nor abstract classes (which by the way has nothing to do with autoboxing)? Concerning the null checking I don't agree with this as a null is different from an empty string. It is up to the developer to handle both cases.\n. ",
    "cdsap": "Hi Cyril!!!  I´m very interested in GDMapActivity,  great work...\n. ",
    "s690716": "The intentional limit to three items in the action bar is a good solution, but I would also prefer the option to set the limit instead of changing code in the GreenDroid source. A limit of three items is perfect for a portrait orientation on a smartphone. But more contextual items in landscape mode or on a tablet makes an app more user friendly \n. ",
    "zetxek": "Oh! This commit is pretty cool, as I needed this too: I cannot figure out the way to use the ActionBar in my ExpandableListActivity... \n. Please correct me if I'm wrong, but shouldn't GDExpandableListActivity have a method called \"getExpandableListView\"?\npublic ExpandableListView getExpandableListView(){\n    return mList;\n}\nThis way you can access the listView in the GDExpandableListActivity, and make things like the ones I did with the vanilla ExpandableListActivity:\ngetExpandableListView().setGroupIndicator(getResources().getDrawable(R.drawable.expandable_list_icon));\ngetExpandableListView().expandGroup(0); \n. ",
    "LeSuisse": "zetxek, you are right, I forgot getExpandableListView() but I fixed this in my last commit.\ncyrilmottier I am sorry for commit e397c6e419ac64366df94fd0217e638fe51de128, I did not want it to appear in the pull request. I'm a new user of Git and GitHub.\n. ",
    "green-coder": "+1 for Szaboics on this issue, and I remind Cyril that without this, greendroid doesn't compile on recent APIs. Ca serait bien de faire le merge.\n. ",
    "radzio": "So when you will merge this :>?\n. ",
    "JosephPeng": "@cyrilmottier I am(we are) looking for your merging~\n. ",
    "danigonlinea": "It's easy to implement this. Only you have to do is rename all getActionBar you find as getGDActionBar on Greendroid proyect.\n. ",
    "dorinionescu": "4 more errors like\n1. GDActivity is not abstract and does not override abstract method getActionBar() in ActionBarActivity\n2. getActionBar() in Activity cannot implement getActionBar() in ActionBarActivity\nreturn type android.app.ActionBar is not compatible with greendroid.widget.ActionBar\n3. getActionBar() in Activity cannot implement getActionBar() in ActionBarActivity\nreturn type android.app.ActionBar is not compatible with greendroid.widget.ActionBar\n4. GDTabActivity is not abstract and does not override abstract method getActionBar() in ActionBarActivity\n. ",
    "ngohr": "You shouldt merge it. It is a big barrier for your new users.\nI was pleased to test your libary...\n. ",
    "leandrobortoli": "Okay, am I wrong in using Boolean and not boolean, but why you set enabled false in the constructor?\n. ",
    "nicholas-jordan": "// in abstract base class boolean enabled Will be autoboxed as code is written \n   // Consider Boolean Object as that is what we will end up with anyway \n   // Great attention to intended design here now to avoid forced re-factoring after much design \n   // Compiler will do this anyway but without the default ~ which results in enabled being a null\npublic Boolean enabled = Boolean.valueOf( false / true );\nTextItem(String text) {\n        // okay, most do not put call to super() in code\n        // changing the nullary constructor in Item as shown directly above \n        // we do it here so that enabled is non-null\n        // null checking here to handle both cases\n        // really reduces issues later in Exception Chaining \n        this.text = ((text == null)? \"\" : text ); // looks kludgy now but oh, wow later \n    }\n. ",
    "jgriff": "+1\n. ",
    "narko": "Hi Sjardine, \ndo you still have to download the greendroid project or will maven resolve the dependency automatically?\nThanks for your help.\n. "
}