{
    "stsilent": "Thanks Miroslav!\n. Thanks man! \n. Yeah, probably the license not quite clear right now =\\ \nCurrently working on it.\n. Attribution 4.0 International (CC BY 4.0)\nhttp://creativecommons.org/licenses/by/4.0/deed.en_US\ngh-page was updated. Thanks Kaiser.\n. Thanks Kaiser, We'll fix it soon. \n. We'll test it. Thanks!\n. Hi David, We'll release Startup Framework for Bootstrap 3 soon. Now I can't give you more information about release date but we're working hard to make it ASAP. We know how it's important for our clients.\n. Hey Dane,\nNow everything is updated.\n. ",
    "franz-josef-kaiser": "np. Cool that you acted that quick on that.\nI'm by no means a lawyer (not even near that), but from what I can read in the \"CC BY 4.0\", it can get quite problematic:\n\nAttribution — You must give appropriate*) credit, provide a link to the license, and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.\n*) you must provide the name of the creator and attribution parties\n\nThe last part (appears on click on the license page) is somehow odd. From what I can read, everyone using (i.e. building something with) this software would have to mention everyone from your side plus everyone who got an accepted pull request or added something to the base. For example, everybody would now have to mention me as you accepted the PR on the readme file and my name is provided in the GitHub issues. And that's really odd.\nNext problem is that you licensed your \"Flat UI\" under the CC BY 3.0 license. When I look at the related wiki page then I can read the following:\n\nCreative Commons changed the definition of \"compatible license\" to allow for more possibilities, including one-way compatibility. A discussion about criteria and processes for determining other compatible licenses will happen after the launch of 4.0. Additionally, a compatibility mechanism was added to BY-NC-SA. Compatibility was first introduced in version 3.0, although no licenses have yet been declared compatible.\n\nNow \"(...) no licenses have yet been declared compatible.\" is a real problem. That means that even if it is compatible, you can't use those two parts of software together ... yet. And that problem stands for all creative commons licensed things.\nAll above stuff can be avoided by using a license (for both affected parts: \"StartUp\" and \"Flat UI\") that is less restrictive, more compatible and allows to be \"linked with code that uses a different license\". Examples: MIT, PSFL. Please keep in mind that GPL v2 is incompatible with v3, so please avoid that one.\n. ",
    "ivanistheone": "Okay so let me see if I got this right, the general UI framework (the blocks mentioned in the video) will be commercial, but the blocks provided in this repo are CC by 4.0?\nIt would be cool if the whole framework were open source, but either way I like the idea very much. It is an interesting business model --- design+UI as a product ;)   For design-illiterate devs (with an income), this could be an interesting option.\n. ",
    "designmodo": "Fixed!\n. Updated!\n. ",
    "Gayoushie": "This is due to Mozilla’s security policy (local file access). To correctly display icons locally you need to switch security.fileuri.strict_origin_policy parameter to false.  To do that, in your Mozilla browser’s address bar enter about:config, find the parameter security.fileuri.strict_origin_policy and change its status to false.\nhttp://kb.mozillazine.org/Security.fileuri.strict_origin_policy\n. ",
    "frissonlabs": "Thanks for the update, that's all I was wondering.\n. ",
    "danecjensen": "I took this to mean you've updated to bootstrap 3 is this correct?  The last commit to the repo was 21 days ago so that can't be the case.\n. ",
    "gaga1227": "Just got this information from the presentation site:\nIE9+, and latest versions of Firefox, Chrome and Safari.\n. ",
    "jholze": "Yes. Would be great to get an update here.\n. ",
    "julianvk": "@dongepulango Did you find a way to do this using their framework? Just started looking for one today and there seems to be nothing out there.\n. ",
    "MonsterCritic": "Hey marlink!\nFor some browsers I've found this problem caused by animation (transition 0.5s), that was applied to all elements. Columns were unable to resize that quick as browser window does. \n And also margin param was set in pixels when it should be relative. This bug was mentionable in Firefox. Fixed.\nThank you for your participation!\n. ",
    "aaronkantrowitz": "I found a solution and posted it here https://github.com/designmodo/startup-support/issues/43 \n. "
}