{
    "dmytrodanylyk": "Very nice, thanks for contribution. In future please send pull requests to dev branch. I am going copy your code and merge it to dev manually, hope you don't mind.\n. @balysv \n. Gradle ver 0.12.+ cause on my IntelliJ IDEA 13.1 EAP: \nUnsupportedMethodException\n         Unsupported method: Dependencies.getJars().\n         The version of Gradle you connect to does not support that method.\n         To resolve the problem you can change/upgrade the target version of Gradle you connect to.\n         Alternatively, you can ignore this exception and read other information from the model.: Unsupported method: Dependencies.getJars().\n         The version of Gradle you connect to does not support that method.\n         To resolve the problem you can change/upgrade the target version of Gradle you connect to.\n         Alternatively, you can ignore this exception and read other information from the model.\n. Closing till better time :smile: \n. Thanks for contribution, but my idea was to control button with mProgress, not mState value. See commit.\n. Doesn't work with:\njava\ncircularButton1.setProgress(50);\ncircularButton1.setEnabled(false);\n. @niosus please use dev branch, not master\n. @amchang please make pull request to dev branch, not master. Thanks for contribution!\n. Added manually via commit since your push have 9 Commits\n. Added manually https://github.com/dmytrodanylyk/circular-progress-button/commit/d0347289f62cfc89581a167b3b0717a569186ff4\nIn future please send pull request to dev branch. Thanks!\n. @krossovochkin I don't understand how to use About Libraries. Can you explain me how library_circularprogressbutton_strings.xml file will be used?\n. @krossovochkin sounds good.\n. @acappelli thanks for contribution.\n1. Please send all pull requests to dev branch.\n2. Can you tell me what was changed Added a method for change the progress background color. I think we already have this method?\n. ",
    "balysv": "Oh, my bad. Don't worry about it.\n. ",
    "dbachelder": "Oh crud... yeah, I use the new Android Studio which needs 0.12+ I guess this can just sit until Intellij updates to the new Android plugin... \n. ",
    "pt2121": "Awesome. Good job! Thanks.\n. ",
    "niosus": "@dmytrodanylyk oops, sorry, will do.\n. ",
    "amchang": "Sorry about the cleanup! I forgot I had committed it to master .... instead of checking out dev, pushing to my dev fork, then doing the PR, will have to look for that next time.\n. ",
    "krossovochkin": "AboutLibraries provides, at some point of view, simple way for creating in app screen with description of used open-source libraries. I found this useful.\nSo, AboutLibraries provides mechanism of building such a screen.\nIf somebody wants to add such a screen he needs to add AboutLibrary to his project, and there should be file \"library_xxxLibraryNamexxx_string.xml\" in which there is decription of xxxLibraryNamexxx.\nI can create this file in my projects \"values/\" folder for each library used, but more simpler way is to add this file to library itself. This is what I would like to see in your library :)\nTo see how it works, you can add to some project which using CircularProgressButton, AboutLibraries project and show fragment on some activity like it is described here: https://github.com/mikepenz/AboutLibraries/wiki/HOWTO:-Fragment\nNOTE: you should change this line:\nbundle.putStringArray(Libs.BUNDLE_LIBS, new String[]{\"AndroidIconify\", \"ActiveAndroid\", \"FButton\", \"Crouton\", \n\"HoloGraphLibrary\", \"ShowcaseView\", \"NineOldAndroids\", \"AndroidViewpagerIndicator\"});\nso that in this StringArray should be \"circularprogressbutton\" item.\n:)\n. ",
    "acappelli": "Yes but in this way we can change only the color inside the progress bar. \n. ",
    "cyroxis": "Is there a reason this has not been merged?\n. ",
    "diego-gomez-olvera": "The library supports right now custom properties, but they cannot be defined in a theme following this pattern (http://blog.stylingandroid.com/custom-controls-part-3/) due that it ignores  the constructor parameter 'int defStyleAttr'. The commit 7a0725ebabcd4e7d93b3f0df15aa104bf4338064 fixes it.\n. It is normally known if the progress view is going to be determinate or not, so it is handy to have an XML attribute 'cpb_progressIndeterminate' to define it.\n. It is convenient to support the android attribute text as default for 'cpb_textIdle', as well as support CharSequence given the fact that TextView class hierarchy support it.\n. ",
    "hojatdelfan": "thanks\n. ",
    "luxsyp": "Here is a fix in the class CircularProgressButton: \nIn each listener: mErrorStateListener, mIdleStateListener, mCompleteStateListener, mProgressStateListener\nYou need to add this:\nif (mAnimatedDrawable != null) {\n    mAnimatedDrawable.setCallback(null);\n}. ",
    "Yuantao315926693": "I want it. ",
    "ZGuser": "for Gradle 3.0 is not working give me crashes . ",
    "sferra": "what exactly crashes? please post a stack trace.. @naitbrahim did the exception occur with a clean build, based on this pull request? can you please provide a full stack trace?. it is generally recommended to make a clean build after updating the build tools. did this issue occur after a clean build?. ",
    "naitbrahim": "Hi,\nMe too I have crashes, this is the stacktrace that I had :\n\nCaused by: java.lang.UnsupportedOperationException: Can't convert value at index 12 to dimension: type=0x3\nat android.content.res.TypedArray.getDimension(TypedArray.java:621)\nat com.dd.CircularProgressButton.initAttributes(CircularProgressButton.java:196)\nat com.dd.CircularProgressButton.init(CircularProgressButton.java:84)\nat com.dd.CircularProgressButton.(CircularProgressButton.java:73). @sferra May be because I updated to gradle 4.1, I ended up by downloading the zip, importing it as a module in my project, targeting the last sdk and it's seems to work. thanks. \n",
    "AyupovIlgam": "I've the same issue with gradle version 4.4 :(\nIt seems that every gradle update may cause the problem\nCaused by java.lang.UnsupportedOperationException\nCan't convert value at index 12 to dimension: type=0x3\nandroid.content.res.TypedArray.getDimension (TypedArray.java:631)\n  | com.dd.CircularProgressButton.initAttributes (CircularProgressButton.java:196)\n  | com.dd.CircularProgressButton.init (CircularProgressButton.java:84)\n  | com.dd.CircularProgressButton. (CircularProgressButton.java:73)\n  | java.lang.reflect.Constructor.newInstance0 (Constructor.java)\n  | android.view.LayoutInflater.inflate (LayoutInflater.java:374)\n  | com.afollestad.materialdialogs.MaterialDialog$Builder.customView (MaterialDialog.java:1825)\n  | kz.rahmet.app.presenters.activities.loyalty.ActivityPay.onPayClick (ActivityPay.java:160)\n  | kz.rahmet.app.presenters.activities.loyalty.ActivityPay_ViewBinding$2.doClick (ActivityPay_ViewBinding.java:94)\n  | butterknife.internal.DebouncingOnClickListener.onClick (DebouncingOnClickListener.java:22)\n  | android.view.View.performClick (View.java:6891)\n  | com.android.internal.os.ZygoteInit.main (ZygoteInit.java:1374)\n. ",
    "leleliu008": "this is cause by aapt2: https://developer.android.com/studio/build/gradle-plugin-3-0-0.html?hl=en. ",
    "GinRyan": "It doesn't work. I have already update gradle plugin to 3.2.1 and build tools 27.0.3 but this dimension error still happens. Should I set android.enableAapt2 to False？\n__Update______\nAfter settting android.enableAapt2=false , it works fine.\n. "
}