{
    "dz0ny": "Only works with python2 (because twisted is not yet ported to python3 see http://twistedmatrix.com/trac/milestone/Python-3.x)\n. ip must be your network ip address on the same network as your remote(android app etc)\n. It must be the same address as your device(where you intend to run leapcast).\n. yep it starts chrome browser\n. When youtube app starts you should see something like \n/opt/google/chrome/chrome --app=\"https://www.youtube.com/tv?pairingCode=2f22b370-fafa-baba-b9bb-ba66cbe104fe&v=Ej8x2p11NBM&t=0\" --user-agent=\"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) CrKey/30.0.1573.2 Safari/537.36\"\nThe url you are lookig for is https://www.youtube.com/tv?pairingCode=2f22b370-3e28-4c6c-b9bb-ba66cbe104fe&v=Ej8x2p11NBM&t=0 and not http://192.168.7.130:8008/apps/YouTube/run which is part of DIAL protocol. \n. Yep STOMP service in not implemented yet. You don't need that, you can just use youtube app and it will work.\n. See #13 also your are pointing to wrong application. \n. @AaronOgle it would be great if you could post xml file of actual device chromecast device located at http://ip_of_chromecast_device/ssdp/device-desc.xml\n. Hi, still no luck, Can you provide http://ip_of_chromecast_device/apps/GoogleMusic before you start remote activity an after. Thx\n. how about when it's started, it should contain connectionSvcURL?\n. No GoogleMusic should be totally different. Netflix doesn't use any feature of the cast framework (RAMP protocol)\n. OK from what I understand connectionSvcURL is websocket proxy (RAMP). I got RAMP working, but 2nd screen device still doesn't connect to WS url (http://192.168.1.211:8008/connection/GoogleMusic) instead I see constat GET requets to http://192.168.1.211:8008/apps.\nWhen GoogleMusic is running please post data from:\nhttp://192.168.1.211:8008/apps\nhttp://192.168.1.211:8008/connection/GoogleMusic\nthx\n. yep. If you are up to it Wireshark capture of TIcTacToe would also help me a lot. I know I'm pushing it :), otherwise i will pause development for a little bit.\n. @AaronOgle thx, I thinx you copy pasted something wrong\n```\n{\"channel\":0}HTTP/1.1 200 OK\nAccess-Control-Allow-Headers: Content-Type\nAccess-Control-Allow-Methods: POST, OPTIONS\nAccess-Control-Allow-Origin: https://www.google.com\nContent-Type: application/json\nContent-Length: 61\n{\"URL\":\"ws://192.168.1.211:8008/session?28\",\"pingInterval\":5}\n```\nMakes no sense to me\n. @AaronOgle oh I get it. Late hour I guess :)\n. It was fuckin header utf-8 and cast library not recognising it properly. \n. Yep, websocket part is not finished yet.\n. Thats how DIAL protocol excepts that apps work. However you can manipulate code however you wish :) For example if you run with --kiosk --incognito chrome will start in full screen if you change user agent to TV you will get different interface, etc\n. C:\\Users\\DieBagger\\AppData\\Local\\Google\\Chrome\\Application\\chrome.exe is not the way how you write paths in windows to python program. It should be \"C:/Users/DieBagger/AppData/Local/Google/Chrome/Application/chrome.exe\" or \"C://Users//DieBagger//AppData//Local//Google//Chrome//Application//chrome.exe\". Python recognises \\ as escape character and this messes the parsing. Again this is not related to app and windows in not supported at all.\n. :) Np\n. @onionhammer Not true, windows support both ways (historically is because DOS 2.0 used / for end of line). ONLY Start->Run requires paths separated with \\ and most users don't bother to know. Now you know :)\n. Fixed with https://github.com/dz0ny/leapcast/commit/0f20858ce52723d722ca8a6fc4ca4ae4b6c9becb\n. Issues are not for install problems! Install twisted and tornado module and it should work, however windows is not a priority.\n. This is by design, until app is stable it should be only used by developers(you should at least look at code and be able to understand what modules you need). About instructions you are right.\n. fixed with 4402e6006a76c045b1c87a983285010a600c905c\n. Allready fixed in pypi branch https://github.com/dz0ny/leapcast/blob/create-package/leapcast/main.py#L38\n. Please add Windows and python version?\n. Hm, cygwin must be doing something to WIn32 APi here. I'am in process of removing twisted and rewriting ssdp part, hopefully this will also fix you problem \n. looks good, thx\n. See https://github.com/dz0ny/leapcast/issues/13 \n. Make sure that you are on the same lan, restart android app(there is a bug in some versions of cyanogen mod). Boot to live usb linux distribution and try there.\n. Googlecast app is only used for initial setup of device(connecting to wlan, etc), no need for it here. Proper multichannel (more than one device) is being done in https://github.com/dz0ny/leapcast/tree/actor_pattern branch.\n. :) Well you are right, you are mixing two different things. You can just run directly from command prompt, you are instead running python in interactive mode, loading module and treating it's like shell. \n1. Install python\n2. Instal setuptools\n3. pip install https://github.com/dz0ny/leapcast/archive/master.zip\n4. open powershell or cmd and enter leapcast --name Chromecast --chrome \"C:/Program Files (x86)/Google/Chrome/Application/chrome.exe\"\n. Try Youtube or Google Music app, it should work. Browser is run when you actually connect to lepacast with remote\n. Yes, example is here https://github.com/DSteve595/leapcast/blob/master/leapcast/apps/steven.py. Currently you are limited to just one channel also if you limit search or you implemented your own protocol in your app, you must add specific protocol to service definition.\nclass MySoundcloudAPP(LEAP):\n    url = \"http://www.gstatic.com/eureka/sample/tictactoe/tictactoe.html\"\n    supported_protocols = ['com.dz0ny.soundcloud.remote','ramp']\n. No, just example :) Btw I use your app while commuting (mainly because of offline mode). Will you use ramp (https://github.com/dz0ny/leapcast/wiki/RAMP-protocol) or will you develop your own protocol?\n. I would suggest RAMP https://developers.google.com/cast/reference/android/javadoc/reference/com/google/cast/MediaProtocolMessageStream. My idea is to port entire thing to XBMC, and for that case RAMP makes it much easier.\n. Cool, I will be very happy tester :)\n. Can you elaborate?\n. Looking through log i noticed you are using ramp(do you really?) see example above if you don't use ramp. The timeout thing might be just windows related stuff (tornado the underlying web server is not meant to be run under windows), try increasing leapcast process affinity. \n. Can you post log wit leapcast -d \n. @cucko from RAMP/Leapcast perspective, everything looks ok. Remember receiver is not aware of any user specific session, you must handle over all credentials needed for particular url. In case of Soundcloud that means client_key and user Oauth key(for some private streams). If you used chromium you must also install chromium-codecs-ffmpeg-extra package.\norg.freedesktop.DBus.Error.NameHasNoOwner is chrome reporting that it isn't run on chromeos\n. Chromecast API has changed significantly. \nIn order to get it working again we need to:\n- Implement MDNS discovery (DIAL has be deprecated)\n- Implement encryption of packets (mayor pain, because android API and web now check for certificate issuer)\n- RAMP protocol has been extended and most of the old methods are no longer used (ping is the only one remaining)\n. @MrHofa You are informed right, in both counts. :)\n. Sry guys, currently I'am busy with other projects. As soon I find free time i will update Leapcast to new Chromecast API.\n. try twisted from main repo sudo apt-get install python-twisted-web python2.7-dev\n. @grrratt where did you get leapcast-script.py ?\n. https://github.com/dz0ny/leapcast/wiki/RAMP-protocol :)\n. leapcast is just proxy between apps, it could be related to proxy implementation. But to actually debug it i need to create app to really test stuff :)\n. see https://github.com/dz0ny/leapcast/issues/13#issuecomment-21783993\n. @Schibum see  https://github.com/dz0ny/leapcast/issues/8#issuecomment-21690861\n. Can you confirm that running minissdpd after leapcast works? On supported platforms SO_REUSEPORT should allow multiple listening daemons on same port.\nsocket.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEPORT, 1)\n. Why do you need this program? I could make ssdp service optional for users who prefer setting ssdp discovery for themselves. \n. Any browser with websockets(v13), webrtc(data channels), advanced video and audio support and user-agent which contains crKey should work, minus the css quirks :).\n. 1. 2. and 3. you are right. 4. User agent for chrome device is needed because screen api is using it for distinguishing normal chrome browser from  ChromeCast like. There are also hints for cloud mode(remote control of device in different network or isolated one), where webrtc would presumably be used because of its p2p mode.\n. Did you test any of the apps, because in receiver I has fixed declaration to port 8008. Receiver won't work if you change port see https://www.gstatic.com/eureka/js/chromekey_receiver.js\n. Just tested with Google Music and it doesn't work. There are two websocket connections to port 8008 one is channel creation second one is for ChromeCast control (volume, setup). If either of them is disconnected or unavailable app won't work. The only url you can control is channel url (also websocket).\n. which distribution? On rpi the main problem is unoptimized chromium binary.\n. Press win+r and enter this C:\\\\PROGRA~1\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe then click run/ok. What happens?\n. \nWorks fine for me, try updating your installation.\n. Essentially leapcast(or ChromeCast) can be considered as software router. Mobile app(for example youtube) issues command to play, no parsing of any kind is done in router itself. It's pretty genius idea to put everything in the app and browser, this way you can iterate/change session protocol (RAMP,CV, ...), without updating ChromeCast.\nSee https://github.com/dz0ny/leapcast/blob/master/leapcast/services/websocket.py#L173 if you meant passing and parsing was typo.\nYou may also wan't to look at https://github.com/dz0ny/leapcast/wiki/RAMP-protocol\n. Both, the chrome browser and the app :)\n. 1) During POST (create app) or via serviceURL if app is allready running\n2) remotes(list) corresponds to receivers(list) (this represents one channel)\n3) yes, if no data is transmitted in 3 seconds channel is destroyed by both app and browser\n. Depends on chrome/chromium. leapcast is merely a proxy(described in simplest terms).\n. Have a look at http://pythonhosted.org/distribute/setuptools.html#development-mode\n. It's not related to leapcast but chromium project. \n. How would you render video to chrome browser? Currently leapcast is just websocket proxy between mobile app and chrome browser...\n. Install Google Chrome (chromium is fine too) and override path to browser.\n. Chromecast app is only used for first time setup on real device. This has no use in emulated one :)\n. Cool :)\n. @neumino Why are remotes, receivers and control_channel lists in leapcast/services/websocket.py?\nBecause connection to remote (app) drops, same goes for browser app. Apps also have more than one websocket channels (ramp, rb). New apps have at least three connections (control, ramp, rb). App developers could also add their own channels (somewhat advertised in devel docs).\n. @feczo you have Chrome running in background, close it then run Leapcast. (lepcast starts chrome with UA modified )\n. Selenium is a bit of overkill, wire protocol and page.navigate command should suffice https://developers.google.com/chrome-developer-tools/docs/protocol/tot/page\n. Hi,\nwhat about custom json that user can specify at startup. In the same structure as https://clients3.google.com/cast/chromecast/device/config ?\n. @maheshprabhu Just tested Redbull app and it works. You might want to Open Chrome debug console and look for errors with app itself. \n. Thx :)\n. mac and win https://github.com/sabnzbd/sabnzbd/blob/master/sabnzbd/init.py#L770\nlinux https://github.com/ianmartin/Deluge-PreventSuspend-plugin/blob/deluge-1.2.x/preventsuspend/core.py\n. @vapier  https://travis-ci.org/dz0ny/leapcast/builds/16788197#L82 \n. The problem is with two session you are starting(your profile) and Chromecast profile. Close Chrome completely (even background task) then start Leapcast. It should work normally...\n. Raspbian? Try updating packages. Then post chromium version and python version.\n. Yea it won't work on rpi :) \n. Native Chromium audio for RPI is not even implemented, maybe with pulseaudio. Video won't work defiantly. \n. start-leapcast.vbs? I'am not the author and that file is not the part of the project. You might want to contact original author of that script.\n1. I think that graphic drives have ability to set which app is on which screen. Windows itself controls where window would show according to this http://social.technet.microsoft.com/Forums/en-US/ae22fbac-bbf5-43bc-a9fc-7d44b68ea00a/default-screen-for-opening-new-windows-and-default-screen-for-certain-apps?forum=w7itproui\n. This looks like Chrome/OSX error, try Chromium.\n. This app is already included. You can add your own apps via -apps flag and valid json file. Format of file must resemble https://clients3.google.com/cast/chromecast/device/config\n. Netflix is not support because, they use custom app(Chromecast only handles discovery).\n. @aaronogle https://github.com/dz0ny/leapcast/blob/master/README.md#chromecast-api-v2 :)\n. @quantenschaum https://github.com/dz0ny/leapcast/issues/29#issuecomment-37288608\n. See https://github.com/dz0ny/leapcast/issues/29#issuecomment-37288608\n. You are running dev version :). Switch back to master branch.\n2014-05-21 17:59 GMT+02:00 Sean notifications@github.com:\n\n[image: wtf]https://cloud.githubusercontent.com/assets/4911850/3042795/b602c010-e100-11e3-8fd2-b11fda43690e.png\neverything was working fine until a couple of days ago, not I get this\nmessage repeating itself faster than I can see and then leapcast just stops\nrunning, no errors or anything\nany ideas?\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/107\n.\n. pip2 :)\n. Casting as is it rolling right now(announced at Google IO) is not supported. Because Google decide to encrypt data protocol, as they have all right to. \n\nUpdated https://github.com/dz0ny/leapcast/commit/2348fea2fc4d38a02e19e609f53d1d930b88a899 to reflect some info.\n. They dropped old Chrome Cast api, see http://www.androidpolice.com/2014/06/30/google-play-music-updated-to-v5-6-with-tweaked-navigation-menu-android-tv-support-now-limited-to-5-smartphones-and-more-apk-download/. \n. Not supported, see https://github.com/dz0ny/leapcast#chromecast-api-v2-develop-branch\n. See https://github.com/dz0ny/leapcast#chromecast-api-v2-develop-branch\n. On port 8009 is CastChannelService(https://code.google.com/p/chromium/codesearch#chromium/src/extensions/browser/api/cast_channel/cast_channel.proto&q=cast%20channel&sq=package:chromium&l=1) which is basically WebsocketServer that is used to start receiver apps. They use protobuf rather than JSON (https://code.google.com/p/chromium/codesearch#chromium/src/extensions/browser/api/cast_channel/cast_channel.proto&q=cast_channel.proto&sq=package:chromium&type=cs)\nYou may find more info studiying https://code.google.com/p/chromium/codesearch#chromium/src/chromecast/&ct=rc&cd=2&q=cast&sq=package:chromium (stub).\nAnd for {port,address} reuse, leapcast already does that if user runs linux kernel 3.11+.\n. https://github.com/dz0ny/leapcast#chromecast-api-v2-develop-branch\n. @Phaeilo thx for your PR, this project is now archived.\n. @simon-weber thx for this, but project is now archived.\n. true thx :)\n. For that we need captured traffic between such device(that only supports audio) and client. Last time I checked that traffic was encrypted with one-time PKI, so not much hope here :)\n. They use headless chrome (something like phantomjs) for audio only device. About the request header, that can be done with chrome extension https://chrome.google.com/webstore/detail/modheader/idgpnmonknjnojddfkpgkljpfnnfcklj and others...\n. Only the clients can be created, as soon you want to create server you need to create your own authority for entire chromecast stack and even then you won't be able to use all apps (just those that use same drm) also the casting device would need to be rooted. They only way currently is to start from scratch and create new open source / open implementation of casting protocol. But that would not be compatible with current v5/6 of casting protocol.\n. Officially dead :)\n. Removed from pypi\n. I believe this still works https://github.com/aykevl/plaincast :) In theory you could use old YT protocol which used DIAL protocol to make it compatible with Kodi. Parts of this projects can be used for that but you would have to emulate browser in python, the above mentioned plancast does this.. ",
    "pawankalyan": "Right, I used a free IP on the same network as my chrome browser having the cast plugin. still I see the same error. \n. please see http://i.imgur.com/FQrOe51.png\n. Ah, I should have looked at the code. Its working like a charm. Thanks\nI am looking to set this up for writing android/chrome apps until I get my chrome cast. \nOnce I cast the video/media, is there a way to preview the casting?\n. ",
    "rayWilliamJ": "I guess the problem is Mac, My chrome app does not xist in /opt/google/chrome/chrome( like linux). it is installed in /Applications. I tried changing the default path in th app.py as well ( chrome = \"~/chrome.app\") but did not launch chrome.\n. Oh yeah, I  was too much used to $open /Applucations/Google\\ Chrome.app. I will use the binary you specified and I guess the only other change is removing the --app={url} and replace it with just {url} , Thats how it works i beleive. I will test that out.\n. ",
    "rcarmo": "Erm. You're going about that the wrong way. In a Mac app bundle, the executable isn't the \".app\" bit - that's a special folder.\nYou're looking for /Applications/Google\\ Chrome.app/Contents/MacOS/Google\\ Chrome. That's the binary. Not sure about the range of command-line switches it supports, since that's usually somewhat different in Mac OS.\n. ",
    "shantanugoel": "See https://github.com/dz0ny/leapcast/pull/6\nYou need to open app.py and remove \"Cleared\" argument from set_status.\n. ",
    "warrenjmcdonald": "Thanks'\n. ",
    "geekgonecrazy": "I've copied everything from the actual device XML file.\nTrying to use the TicTacToe Android app,  defined a custom appID in the leapcast code.  I see that it grabs the device-desc.xml but it doesn't show up on the Android app.\nNot a huge deal as I will recieve my appID's from google soon, but still would be cool to be able to run one like this.\n. @dz0ny https://gist.github.com/AaronOgle/6099301\nModified the device handler in your code to mimic the chromecast device.  The services aren't listed on the chromecast so I took that out.  \nAlso removed the UDN just in case its device specific.\n. Before:\nXML\n<service xmlns=\"urn:dial-multiscreen-org:schemas:dial\">\n<name>GoogleMusic</name>\n<options allowStop=\"true\"/>\n<state>stopped</state>\n</service>\nAfter:\nXML\n<service xmlns=\"urn:dial-multiscreen-org:schemas:dial\">\n<name>GoogleMusic</name>\n<options allowStop=\"true\"/>\n<state>running</state>\n<link rel=\"run\" href=\"web-1\"/>\n<servicedata xmlns=\"urn:chrome.google.com:cast\">\n<connectionSvcURL>http://192.168.1.211:8008/connection/GoogleMusic</connectionSvcURL>\n<protocols>\n<protocol>ramp</protocol>\n</protocols>\n</servicedata>\n<activity-status xmlns=\"urn:chrome.google.com:cast\">\n<description>Legacy</description>\n<image src=\"https://ssl.gstatic.com/music/fe/d52a0d1566a74f91dffa745a811ff578/favicon.ico\"/>\n</activity-status>\n</service>\n. Sorry didn't realize you said before and after.  Updated to contain after.\n. http://chromecast/apps/Netflix\nXML\n<service xmlns=\"urn:dial-multiscreen-org:schemas:dial\">\n<name>Netflix</name>\n<options allowStop=\"true\"/>\n<state>stopped</state>\n<port>9080</port>\n<capabilities>websocket</capabilities>\n</service>\nIncase you are curious about the websocket bit(which I think the tictactoe / cast-android-sample example may depend on too?)\n. Ok. \nIn case you didn't see it above: \nXML\n<service xmlns=\"urn:dial-multiscreen-org:schemas:dial\">\n<name>GoogleMusic</name>\n<options allowStop=\"true\"/>\n<state>running</state>\n<link rel=\"run\" href=\"web-1\"/>\n<servicedata xmlns=\"urn:chrome.google.com:cast\">\n<connectionSvcURL>http://192.168.1.211:8008/connection/GoogleMusic</connectionSvcURL>\n<protocols>\n<protocol>ramp</protocol>\n</protocols>\n</servicedata>\n<activity-status xmlns=\"urn:chrome.google.com:cast\">\n<description>Legacy</description>\n<image src=\"https://ssl.gstatic.com/music/fe/d52a0d1566a74f91dffa745a811ff578/favicon.ico\"/>\n</activity-status>\n</service>\n. http://192.168.1.211:8008/apps redirects to: http://192.168.1.211:8008/apps/GoogleMusic\nNothing at http://192.168.1.211:8008/connection/GoogleMusic\n. Just a note.. Wouldn't it actually be a url beginning with ws:// instead of http ?\n. Actually where I was headed next.  Looks like a websocket connects to 192.168.1.211:8008/session?27  Not sure what that means, but grabbing a capture now.\n. @dz0ny this looks to be exactly what you are looking for ;-)  Makes perfect sense looking at the flow.  pretty ingenious\nhttp://pastebin.com/H4XPGcqr\nLooks like /connection/GoogleMusic expects it to be a POST containing a channel.  On post it returns a websocket url and ping interval.  \nI'm betting the User-Agent header in the POST comes into play as well\n. @bubbleguuum Nice hack!  I never thought of doing it manually like that.  Very cool.  :)\n. @dz0ny The websocket capture incase it helps: http://pastebin.com/5CNrqBV7\nLooks pretty straight forward.\n. Should be:\n{\"channel\":0}\nHTTP/1.1 200 OK\nAccess-Control-Allow-Headers: Content-Type\nAccess-Control-Allow-Methods: POST, OPTIONS\nAccess-Control-Allow-Origin: https://www.google.com\nContent-Type: application/json\nContent-Length: 61\n{\"URL\":\"ws://192.168.1.211:8008/session?28\",\"pingInterval\":5}\nThat is how wireshark decoded the stream.\n{\"channel\":0} is the POST data.  For the POST to /connection/\nJust tested it and it does send back the json with the websocket connection\naddress.\nOn Jul 28, 2013 4:58 PM, \"dz0ny\" notifications@github.com wrote:\n\n@AaronOgle https://github.com/AaronOgle thx, I thinx you copy pasted\nsomething wrong\n{\"channel\":0}HTTP/1.1 200 OK\nAccess-Control-Allow-Headers: Content-Type\nAccess-Control-Allow-Methods: POST, OPTIONS\nAccess-Control-Allow-Origin: https://www.google.com\nContent-Type: application/json\nContent-Length: 61\n{\"URL\":\"ws://192.168.1.211:8008/session?28\",\"pingInterval\":5}\nMakes no sense to me\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/8#issuecomment-21692023\n.\n. @dz0ny if you need more info let me know.  \n\nI would try doing some of it and doing a pull request, but i'm not very familiar with the libraries that you are using.\n. FYI in the description field where it says legacy that is the name of the track playing.  \nXML\n<activity-status xmlns=\"urn:chrome.google.com:cast\">\n<description>$song</description>\n<image src=\"https://ssl.gstatic.com/music/fe/d52a0d1566a74f91dffa745a811ff578/favicon.ico\"/>\n</activity-status>\nAnd Google Music crashes on my phone with this even running.  As soon as it gets the device info it crashes.  So something didn't work right.\n. Hey at least the info I was able to provide should make it pretty easy.\n. @entertailion Just FYI this is how the actual chromecast device behaves\n. Ah yes I do see what you mean. Not my code, but: @dz0ny \n. This is disappointing... I guess that's what we get for developing clones of a platform that was essentially in beta.  Looks like actual traffic is no longer using websockets as well..\n. @dz0ny that's a lot of work required.  I am curious to the new protocol.  But I don't know if I will be bothered to update my little node.js Cast app.  I think @mauimauer went much further with his.  \nGood to see that at least a public key is transmitted in discovery.  \nI can see it checking the certificate issuer to be a tough challenge.  If not impossible.\nGlad to see security, but a bit disappointed that the protocol we've learned is essentially gone.\n. ",
    "bubbleguuum": "Having TicTacToe or cast-android-sample fully working would be a great achievemement to allow integrating SDK code in own app without the actual Dongle. \nNote that if a CastDevice cannot be yet discovered, you can still create one manually with this hack (here, for cast-android-sample. Replace ip and Uri with correct values ):\n``` java\ntry {\n            mSelectedDevice = new CastDevice((Inet4Address)InetAddress.getByName(\"192.168.0.13\"));\n        mSelectedDevice.setFriendlyName(\"LOL Cast\");\n        mSelectedDevice.setModelName(\"ChromeCast\");\n        mSelectedDevice.setManufacturer(\"LOL company\");\n\n            Field f = CastDevice.class.getDeclaredField(\"f\");\n        if (f != null) {\n                f.setAccessible(true);\n            f.set(mSelectedDevice, Uri.parse(\"http://192.168.0.13:8008/apps\"));\n            logVIfEnabled(TAG, \"Successfully set Application URL\");\n        }\n\n        onDeviceAvailable(mSelectedDevice, \"LOL\", null);\n    } catch (Exception e) {\n        e.printStackTrace();\n    }\n\n```\n. Windows 7, Python 2.7.5, running leapcast in bash under latest cygwin and killing it with CTRL-C.\n. This does not happen when running under standard Windows shell (cmd.exe).\nIt happens that CTRL-C on cygwin is not transmitted to leapcast, which doesn't shutdown properly calling the server.sig_handler\nSo there might be this issue whenever leapcast is not exited cleanly.\n. Looks like I spoke too soon and still get the problem in a cmd.exe shell, with leapcast properly terminated\n. ",
    "dorjsuren": "@bubbleguuum where is your hack for cast-android-sample. in CastSampleActivity?\n. ",
    "entertailion": "Yes, I know. I'm not a Python developer so I might not be reading the code right, but I didn't see that code in your logic.\n. Great!\n. ",
    "DieBagger": "Could you please tell me the reason for closing this? Or give me some directions on how to troubleshoot this any further? I haven't used python in a while but I'd really like to get this to work...\nThanks\n. Thanks for pointing me in the right direction, it's working great now... Should have thought of that myself, sorry for the inconvenience.\n. ",
    "onionhammer": "\\ is the way you write a path on windows; your application should be able to swap out \\'s for /'s if needed.\n. Now you're being pedantic; realistically most users are going to copy/paste their path to chrome and windows will give them \\'s.\nI already knew you could do it both ways because windows is smart enough to translate /'s into \\'s, I'm only asking you make leapcast smart enough to do the same :P\nThe question is, do you want people to get mysterious exceptions for something that should work, or do you want to just fix it?\n. Please use:\nhttp://docs.python.org/2/library/os.html#os.sep\n. ",
    "QuirijnGB": "@onionhammer you could always fix it and make a pull request :)\n. ",
    "eyecatchup": "For those interested, I created a list of steps how to install (and run) leapcast on Windows platform.\nInstructions: https://gist.github.com/eyecatchup/6219118\nDemo: http://www.youtube.com/watch?v=n1wLy1LQV_g\n. ",
    "SpeedyFireCyclone": "I am sorry, but I was not aware of the fact that there were externale modules needed to run LeapCast. It is also not noted in the Readme or \"Install instructions\" and therefor it should be added, along with other possible dependencies.\nEDIT: I got it working now, but I also needed Zope. Please add this in the Readme.\n. I understand that, thank you for your fast response.\n. ",
    "pbasov": "This solved the problem for me in Mac OS X 10.8.4. Thank you.\n. Dz0ny pushed a new version just 4 days ago, ofc it's in development :-(\nOn Sep 10, 2013 7:47 PM, \"diraimondo\" notifications@github.com wrote:\n\nI'm wondering if leapcast is still in development... :\\\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/52#issuecomment-24171534\n.\n. \n",
    "DSteve595": "A Chrome window will only open up when a device connects to it (presses the Cast icon).\nYou might have a firewall issue. Or you might need to run python (leapcast) with admin privileges.\n. Your file separators need to be either \"\\\" or \"/\".\nThis isn't a bug. But it could be made better by using the OS' separator instead of hardcoded forwardslashes.\n. Works fine for me with a single forward slash. (/)\nHave you checked your firewall?\n. Nah, port forwarding won't do anything.\nTry resetting your network adapter. (disable/enable through Windows).\n. You should be good to go now. Check YouTube or Play Music.\n. I've been getting Cast to work in my app too, and keep in mind, some of the issues you'll run into are with leapcast, not the app. I know this because the same issues happen sometimes with Play Music and YouTube. For now, leapcast's perfect for making sure your app can start a connection with a ChromeCast and pass data, but it gets unstable when you try to do more, so don't pull your hair out just yet.\n. Sure, lemme get a trace\n. C:\\Users\\Steven\\Downloads\\leapcast>leapcast -d --name \"Leapcast\" --chrome \"C:/Pr\nogram Files (x86)/Google/Chrome/Application/chrome.exe\"\nDEBUG:Leapcast:Added putiostevenschoen app\nDEBUG:Leapcast:Added YOUR_APP_ID_HERE app\nDEBUG:Leapcast:Added ChromeCast app\nDEBUG:Leapcast:Added YouTube app\nDEBUG:Leapcast:Added PlayMovies app\nDEBUG:Leapcast:Added GoogleMusic app\nDEBUG:Leapcast:Added GoogleCastSampleApp app\nDEBUG:Leapcast:Added GoogleCastPlayer app\nDEBUG:Leapcast:Added TicTacToe app\nDEBUG:Leapcast:Added Fling app\nINFO:tornado.access:200 GET /ssdp/device-desc.xml (192.168.1.9) 2.00ms\nINFO:tornado.access:204 GET /apps (192.168.1.9) 1.00ms\nINFO:tornado.access:201 POST /apps/putiostevenschoen (192.168.1.9) 6.00ms\nINFO:tornado.access:200 GET /apps/putiostevenschoen (192.168.1.9) 1.00ms\nINFO:tornado.access:200 POST /connection/putiostevenschoen (192.168.1.9) 1.00ms\nINFO:root:ApplicationChannel opened /session/putiostevenschoen?0\nINFO:root:Channel for app <leapcast.services.websocket.ServiceChannel object at\n0x03FA78B0> set\nINFO:root:New CHANNELREQUEST for app putio\nINFO:root:ReceiverChannel opened /receiver/putio\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"error\": {\n        \"code\": -1,\n        \"domain\": \"ramp\"\n      },\n      \"event_sequence\": 0\n    },\n    \"type\": \"STATUS\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"event_sequence\": 1,\n      \"state\": 0\n    },\n    \"type\": \"STATUS\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"event_sequence\": 3,\n      \"state\": 0\n    },\n    \"type\": \"STATUS\"\n  }\n]\nINFO:root:ApplicationChannel closed /session/putiostevenschoen?0\nDEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nINFO:root:ReceiverChannel closed /receiver/putio\nWindows 8 x64, Python 2.7.5.\n4 out of 5 app launches, that ReceiverChannel ping will happen and then the receiver will give up listening. But sometimes it'll work right, with the ReceiverChannel giving a ping and the ApplicationChannel instantly giving back a pong.\nAs soon as I get the ReceiverChannel closed... message in the leapcast log, I get this in logcat: onEnded failed to connect channel: network I/O timeout meaning onSessionEnd is being called with a network timeout error.\nThis happens to Play Music too, but it seems Play Music's reconnection logic is a lot better. It will trip it up sometimes though, say, after 15 seconds of not doing anything, pressing play/pause on the app won't do anything on leapcast. At that point, it'll either give up (clicking a track says \"unable to play this track) or it'll reconnect itself silently, depending on how the celestial bodies are aligned.\nThere's another issue I was having a lot yesterday too, but it's way too sporadic to pinpoint.\nNote: I don't mean to diminish what you've done with this project, I think it's beyond fantastic and I wouldn't have been able to even start testing the SDK without it. I'd just like to see it get more stable and closer to the real product!\n. I'm not 100% clear on what RAMP is, but if it's for managing playback, volume, and seek of videos, then yes.\nAnd if it's a Windows issue, maybe it's finally time I switch my dev environment to Linux :P\n. This is probably more of a Chrome thing. Leapcast handles no UI after the\nhandoff of the web page to Chrome.\nOn Thu, Aug 8, 2013 at 8:12 PM, Yazzeh notifications@github.com wrote:\n\nWhen casting to Leapcast, the cursor remains on screen in front of the\nvideo.\nIdeally it would be removed from the screen automatically.\nWin7x64 Python2.7 Chrome 28\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/36\n.\n. This is being worked on in the actor_pattern branch.\n. Tried writing a cryptographic ancient Roman puzzle for it?\nOn Oct 7, 2013 4:28 PM, \"Dan Brown\" notifications@github.com wrote:\nI'm not sure if this is possible, and didn't find any useful information\non the web (so far).\nI am able to get leapcast running properly on an old laptop, but not on\nraspberry pi. When trying to ask the leapcast server to play music, it\ngives an error \"OSError: [Errno 2] No such file or directory\" and the full\ntraceback is below. The same error happens when attempting to play youtube\nvideos.\nThe raspberry pi has no screen attached to it. I tried to specify xvfb-run\nin the leapcast's --chrome option, but I wasn't able to see any difference\nin behavior.\nSuggestions would be most welcome. thanks!\nINFO:tornado.access:200 GET /ssdp/device-desc.xml (192.168.1.21) 23.30ms\nINFO:tornado.access:200 GET /apps/GoogleMusic (192.168.1.21) 38.37ms\nERROR:tornado.application:Uncaught exception POST /apps/GoogleMusic\n(192.168.1.21)\nHTTPRequest(protocol='http', host='192.168.1.17:8008', method='POST',\nuri='/apps/GoogleMusic', version='HTTP/1.1', remote_ip='192.168.1.21',\nheaders\n={'Origin': 'https://www.google.com', 'Content-Length': '22',\n'Content-Type': 'text/url', 'Connection': 'Keep-Alive', 'Host': '\n192.168.1.17:8008', '\nUser-Agent': 'com.google.android.music/5.1.1109K.772337 (Linux; U; Android\n2.3.6; Nexus One Build/GRK39F)'})\nTraceback (most recent call last):\nFile \"/usr/local/lib/python2.7/dist-packages/tornado/web.py\", line 1115,\nin stack_context_handle_exception\nraise_exc_info((type, value, traceback))\nFile \"/usr/local/lib/python2.7/dist-packages/tornado/web.py\", line 1298,\nin wrapper\nresult = method(self, _args, *_kwargs)\nFile\n\"/usr/local/lib/python2.7/dist-packages/leapcast/services/leap_factory.py\",\nline 126, in post\nstatus['browser'] = Browser(appurl)\nFile\n\"/usr/local/lib/python2.7/dist-packages/leapcast/services/leap_factory.py\",\nline 31, in _init\nself.pid = subprocess.Popen(args)\nFile \"/usr/lib/python2.7/subprocess.py\", line 679, in init\nerrread, errwrite)\nFile \"/usr/lib/python2.7/subprocess.py\", line 1259, in _execute_child\nraise child_exception\nOSError: [Errno 2] No such file or directory\nERROR:tornado.access:500 POST /apps/GoogleMusic (192.168.1.21) 93.80ms\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/55\n.\n. \n",
    "Wikiwix": "I had already tried admin privileges. Which ports on which protocoll do I have to forward since my fritzbox doesn't allow to deactivate firewall (pc firewall already deactivated)\n. Tried on another PC and it works...\nThanks for the help.\nPS: Googlecast app, control via different devices at once and play music controls not working. I guess still work in progress?\n. ",
    "justtryinghelp": "run leapcast using powershell x86 so that it doesn't hang on windows 7 x64\n. When you run leapcast on windows 7 x64 I've noticed that it will only run normally and not hang on the last \"fling\" line unless you run it using powershell x86. So everyone using windows 7 x64 like I am should use powershell x86 to run this. Not sure why but this is how I am able to run it.\n. ",
    "Majal": "Question: What port and protocol is leapcast using?\nI'm on Linux and am using ufw firewall. When disabled, the devices detects my computer. I wanted the firewall to be enabled though, and only open (allow) the port and protocol that leapcast uses. So then the question above.\nThanks!\n. After a few minutes it was working...\nAnd the answer is:\nTCP port 8008\nThanks to:\nnetstat -n -A inet | grep 192\\.168\nand\nlsof -i | grep leapcast\n\nAnd the ufw rule should be:\nsudo ufw allow 8008/tcp\n. ",
    "Drat333": "This is what I just tried. It's been like this for about 5-10 minutes now, still no cast button.\n\n. When I first launched the script, Windows asked if I should allow Python\naccess to the network, and I clicked yes. Do I need to port forward?\nOn Sun, Aug 4, 2013 at 11:48 PM, Steven Schoen notifications@github.comwrote:\n\nWorks fine for me with a single forward slash. (/)\nHave you checked your firewall?\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/25#issuecomment-22085828\n.\n. Ooooh, progress. Debug is actually showing things now.\n\n. Aha, fantastic! Thank you, sir.\n. \n",
    "theluke": "Hi! the \"slash\" did the trick for me. Slash AND network reset.\nThank you\n. ",
    "matthew-nm": "Ok, awesome. I managed to get steps 1-3 to work, and I can verify it by typing in leapcast -h and getting the same usage and arguments as on the front page of this repo. But when I do step 4, my cmd window just sort of hangs after outputting the following:\nC:\\Users\\Matthew>leapcast --name ChromeCast --chrome \"C:/Program Files (x86)/Google/Chrome/Application/chrome.exe\"\nINFO:root:Service name is Chromecast\nINFO:root:Chrome path is C:/Program Files (x86)/Google/Chrome/Application/chrome.exe\nI don't even get my input prompt back at the end, so the only thing I can do is close the window. I'm assuming a window is supposed to pop up or something, haha. Is it possible for me to have done the steps wrong, even if the help menu works?\n. Yeah, I tried both of those and there wasn't an icon or anything. I also downloaded the chromecast app and it doesn't find any chromecasts on my network.\nBut I guess if it looks right in the cmd, then it must be some random issue I need to figure out.\n. ",
    "cucko": "thank you so much. keep up the great work.\n. com.dz0ny.soundcloud.remote ? \nyou already started soundcloud remote? :)\ni was with the same idea :)\nhere is my web app: http://mycloudplayers.com \nand android app: https://play.google.com/store/apps/details?id=com.mycloudplayers.mycloudplayer\n. No idea, this is my first step. Probably ramp.\nIf you have any other suggestions, please tell me :)\nFor the android app, i think that Charts, Neighborhoods and Stations are the best thing, still :)\n. Ha, again XBMC :) \nI will give it a try, and see how it will go.\nIf i have some problems or something to present, i'll contact you.\nThank you.\n. nice, receiver started, finally.. chrome was caching the ChromeCast Apps.\n. @dz0ny same here on windows, timeout after some time, connection is lost, and chrome receiver app is restarted. setting up linux leapcast now. i will keep you updated.\n. same thing on linux. \ncast.launch is opening chrome receiver as it should. first loadMedia() call, works fine, than next call reopens the receive page.\nhere is the log:\nINFO:tornado.access:201 POST /apps/MyCloudPlayer (192.168.1.105) 9.30ms\nINFO:tornado.access:302 GET /apps (192.168.1.105) 1.05ms\nINFO:tornado.access:200 GET /apps/MyCloudPlayer (192.168.1.105) 1.95ms\nINFO:tornado.access:200 POST /connection/MyCloudPlayer (192.168.1.105) 1.15ms\nINFO:root:ApplicationChannel opened /session/MyCloudPlayer?0\n[30220:30244:0807/113713:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[30220:30244:0807/113713:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[30220:30220:0807/113713:ERROR:object_proxy.cc(532)] Failed to call method: org.chromium.Mtpd.EnumerateStorages: object_path= /org/chromium/Mtpd: org.freedesktop.DBus.Error.ServiceUnknown: The name org.chromium.Mtpd was not provided by any .service files\nINFO:root:Channel for app  set\nINFO:root:New CHANNELREQUEST for app MyCloudPlayer\nINFO:root:ReceiverChannel opened /receiver/MyCloudPlayer\n[7:8:0807/113718:ERROR:audio_output_device.cc(186)] Not implemented reached in virtual void media::AudioOutputDevice::OnStateChanged(media::AudioOutputIPCDelegate::State)\n[7:8:0807/113728:ERROR:audio_output_device.cc(186)] Not implemented reached in virtual void media::AudioOutputDevice::OnStateChanged(media::AudioOutputIPCDelegate::State)\n[7:8:0807/113734:ERROR:audio_output_device.cc(186)] Not implemented reached in virtual void media::AudioOutputDevice::OnStateChanged(media::AudioOutputIPCDelegate::State)\nINFO:root:ApplicationChannel closed /session/MyCloudPlayer?0\nINFO:tornado.access:200 DELETE /apps/MyCloudPlayer (192.168.1.105) 143.12ms\nINFO:root:ReceiverChannel closed /receiver/MyCloudPlayer\nINFO:tornado.access:201 POST /apps/MyCloudPlayer (192.168.1.105) 7.77ms\nINFO:tornado.access:302 GET /apps (192.168.1.105) 0.65ms\nINFO:tornado.access:200 GET /apps/MyCloudPlayer (192.168.1.105) 1.14ms\nINFO:tornado.access:200 POST /connection/MyCloudPlayer (192.168.1.105) 0.60ms\nINFO:root:ApplicationChannel opened /session/MyCloudPlayer?0\n[30318:30342:0807/113737:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[30318:30342:0807/113737:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[30318:30318:0807/113737:ERROR:object_proxy.cc(532)] Failed to call method: org.chromium.Mtpd.EnumerateStorages: object_path= /org/chromium/Mtpd: org.freedesktop.DBus.Error.ServiceUnknown: The name org.chromium.Mtpd was not provided by any .service files\nINFO:root:Channel for app  set\nINFO:root:New CHANNELREQUEST for app MyCloudPlayer\nINFO:root:ReceiverChannel opened /receiver/MyCloudPlayer\n. here is the log. the problem happens on: [2835:2859:0807/125014:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\nDEBUG:root:ApplicationChannel: [\n  \"ramp\",\n  {\n    \"autoplay\": false,\n    \"cmd_id\": 21690005,\n    \"content_info\": \"http://soundcloud.com/station-noord-dj-contest/station-noord-17-08-kinjo\",\n    \"src\": \"http://api.soundcloud.com/tracks/102402191/stream?consumer_key=redacted\",\n    \"title\": \"Station Noord | 17-08 | Kinjo\",\n    \"type\": \"LOAD\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 21690004,\n    \"status\": {\n      \"error\": {\n        \"code\": -3,\n        \"domain\": \"ramp\"\n      },\n      \"event_sequence\": 5\n    },\n    \"type\": \"RESPONSE\"\n  }\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 21690005,\n    \"status\": {\n      \"content_id\": \"http://api.soundcloud.com/tracks/102402191/stream?consumer_key=redacted\",\n      \"content_info\": \"http://soundcloud.com/station-noord-dj-contest/station-noord-17-08-kinjo\",\n      \"current_time\": 0,\n      \"duration\": 3410.834286,\n      \"event_sequence\": 6,\n      \"muted\": false,\n      \"state\": 1,\n      \"time_progress\": false,\n      \"title\": \"Station Noord | 17-08 | Kinjo\",\n      \"volume\": 1\n    },\n    \"type\": \"RESPONSE\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"content_id\": \"http://api.soundcloud.com/tracks/102402191/stream?consumer_key=redacted\",\n      \"content_info\": \"http://soundcloud.com/station-noord-dj-contest/station-noord-17-08-kinjo\",\n      \"current_time\": 0,\n      \"duration\": 3410.834286,\n      \"event_sequence\": 7,\n      \"muted\": false,\n      \"state\": 1,\n      \"time_progress\": false,\n      \"title\": \"Station Noord | 17-08 | Kinjo\",\n      \"volume\": 1\n    },\n    \"type\": \"STATUS\"\n  }\n]\n[7:8:0807/125000:ERROR:audio_output_device.cc(186)] Not implemented reached in virtual void media::AudioOutputDevice::OnStateChanged(media::AudioOutputIPCDelegate::State)\nDEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"cm\",\n  {\n    \"type\": \"pong\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"cm\",\n  {\n    \"type\": \"pong\"\n  }\n]\n[7:8:0807/125010:ERROR:audio_output_device.cc(186)] Not implemented reached in virtual void media::AudioOutputDevice::OnStateChanged(media::AudioOutputIPCDelegate::State)\nDEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"cm\",\n  {\n    \"type\": \"pong\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"ramp\",\n  {\n    \"autoplay\": false,\n    \"cmd_id\": 21690006,\n    \"content_info\": \"http://soundcloud.com/vimes/upstairs\",\n    \"src\": \"http://api.soundcloud.com/tracks/60196021/stream?consumer_key=redacted\",\n    \"title\": \"UpStairs\",\n    \"type\": \"LOAD\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 21690006,\n    \"status\": {\n      \"content_id\": \"http://api.soundcloud.com/tracks/60196021/stream?consumer_key=redacted\",\n      \"content_info\": \"http://soundcloud.com/vimes/upstairs\",\n      \"current_time\": 0,\n      \"duration\": 271.516735,\n      \"event_sequence\": 8,\n      \"muted\": false,\n      \"state\": 1,\n      \"time_progress\": false,\n      \"title\": \"UpStairs\",\n      \"volume\": 1\n    },\n    \"type\": \"RESPONSE\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"content_id\": \"http://api.soundcloud.com/tracks/60196021/stream?consumer_key=redacted\",\n      \"content_info\": \"http://soundcloud.com/vimes/upstairs\",\n      \"current_time\": 0,\n      \"duration\": 271.516735,\n      \"event_sequence\": 9,\n      \"muted\": false,\n      \"state\": 1,\n      \"time_progress\": false,\n      \"title\": \"UpStairs\",\n      \"volume\": 1\n    },\n    \"type\": \"STATUS\"\n  }\n]\n[7:8:0807/125012:ERROR:audio_output_device.cc(186)] Not implemented reached in virtual void media::AudioOutputDevice::OnStateChanged(media::AudioOutputIPCDelegate::State)\nINFO:root:ApplicationChannel closed /session/MyCloudPlayer?0\nINFO:tornado.access:200 DELETE /apps/MyCloudPlayer (192.168.1.105) 144.50ms\nINFO:root:ReceiverChannel closed /receiver/MyCloudPlayer\nINFO:tornado.access:201 POST /apps/MyCloudPlayer (192.168.1.105) 6.56ms\nINFO:tornado.access:302 GET /apps (192.168.1.105) 0.68ms\nINFO:tornado.access:200 GET /apps/MyCloudPlayer (192.168.1.105) 1.06ms\nINFO:tornado.access:200 POST /connection/MyCloudPlayer (192.168.1.105) 0.80ms\nINFO:root:ApplicationChannel opened /session/MyCloudPlayer?0\nDEBUG:root:ApplicationChannel: [\n  \"cv\",\n  {\n    \"message\": {\n      \"activityId\": \"9aceq7suqi1f\",\n      \"description\": \"My Cloud Player\",\n      \"iconUrl\": null,\n      \"type\": \"update_description\"\n    },\n    \"type\": \"activity\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 1000,\n    \"type\": \"INFO\"\n  }\n]\n[2835:2859:0807/125014:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[2835:2859:0807/125014:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[2835:2835:0807/125014:ERROR:object_proxy.cc(532)] Failed to call method: org.chromium.Mtpd.EnumerateStorages: object_path= /org/chromium/Mtpd: org.freedesktop.DBus.Error.ServiceUnknown: The name org.chromium.Mtpd was not provided by any .service files\nINFO:root:Channel for app <leapcast.services.websocket.ServiceChannel object at 0xa63c84c> set\nINFO:root:New CHANNELREQUEST for app MyCloudPlayer\nINFO:root:ReceiverChannel opened /receiver/MyCloudPlayer\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"event_sequence\": 0,\n      \"state\": 0\n    },\n    \"type\": \"STATUS\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"event_sequence\": 1,\n      \"state\": 0\n    },\n    \"type\": \"STATUS\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"ramp\",\n  {\n    \"cmd_id\": 0,\n    \"status\": {\n      \"event_sequence\": 2,\n      \"state\": 0\n    },\n    \"type\": \"STATUS\"\n  }\n]\n^[[5~^[[5~^[DEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"cm\",\n  {\n    \"type\": \"pong\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"cm\",\n  {\n    \"type\": \"pong\"\n  }\n]\nDEBUG:root:ReceiverChannel: [\n  \"cm\",\n  {\n    \"type\": \"ping\"\n  }\n]\nDEBUG:root:ApplicationChannel: [\n  \"cm\",\n  {\n    \"type\": \"pong\"\n  }\n]\n. im sending everything needed, first time, the tracks are loading ok in  tag, and they can be played. after some time, i get request timeout error on my app, and receiver restarts (for same tracks, so the problem is not stream url)\nreceiver window restarts when i call.loadMedia() (also, same call for all tracks) and in the log i have this:\n[2835:2859:0807/125014:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[2835:2859:0807/125014:ERROR:object_proxy.cc(627)] Failed to get name owner. Got org.freedesktop.DBus.Error.NameHasNoOwner: Could not get owner of name 'org.chromium.Mtpd': no such name\n[2835:2835:0807/125014:ERROR:object_proxy.cc(532)] Failed to call method: org.chromium.Mtpd.EnumerateStorages: object_path= /org/chromium/Mtpd: org.freedesktop.DBus.Error.ServiceUnknown: The name org.chromium.Mtpd was not provided by any .service files\nINFO:root:Channel for app set\nINFO:root:New CHANNELREQUEST for app MyCloudPlayer\ni'll install chromium-codecs-ffmpeg-extra to get rid of these audio errors.\ni'll do some more testing, and send you feedback\n. ",
    "Baconstrips": "now that AllCast and avia are available is their  a way to add it to the supported apps list?\n. ",
    "JohnyGQD": "What URL do I need to put into the default.py file to use the \"Styled Media Receiver\"? If possible, of course :-). So far, I'm trying to get both my own demo and the CastVideos sample working, but the leapcast still does not seem to get discovered.\n. Oh I see! I thought I was doing something wrong. Will bring the real Chromecast to my office tommorow, and I wish you best luck implementing it! Google's latest APIs are huge PITA in general :-(.\n. ",
    "ElD4n1": "Now, am I right informed and leapcast is currently not working due to the new Chromecast API and you are working to get it running again?\nOr did you already successfully switch to the new API?\nJust want to know if I should give it a try or if I better should wait a little.\n. So you successfully switched to the new API but it isn't working yet?^^\n. ",
    "Marlinc": "Any news on this? And does the project have a IRC channel that I can join? I'm very interested in trying Chromecast app development using leapcast.\n. ",
    "benjipott": "+1 for news on this.\n. ",
    "joimagg": "Is it possible to add apps. F.ex. Monopoly Dash ? Really wanted to try this game out, but I don't have Chromecast or a TV for that matter. But managed to get leapcast up and running with youtube and other supported apps.\n. ",
    "ChristopheVersieux": "Perfect, thank a lot!\nWorks like a charm now!\n. ",
    "AMHZR": "sudo apt-get install libevent-dev\n. ",
    "sanketchaudhari": "I am getting the same issue as mentioned above. \n\"error: command 'x86_64-linux-gnu-gcc' failed with exit status 1\"\nI tried using dz0ny's solution. It did not work for me. Am I missing something? And also, I did not understand \"try twisted from the main repo\" part. What does this exactly mean?\n. ",
    "BLMYX01": "Thanks! It works!. ",
    "grrratt": "Not sure why you are running that script?\nAssuming you have followed the instructions in README to install leapcast then the correct command is:\nusage: leapcast [-h] [-d] [--name NAME] [--user_agent USER_AGENT] [--chrome CHROME] [--fullscreen]\ne.g.\nleapcast –name HOME –chrome “C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe” –fullscreen\nTry that.\n. dz0ny, was that meant to be aimed at me? I downloaded everything from the zip. All is working well for me though.\n. ",
    "evdev": "I executing the program in the recommended way and I am getting the same error.\nI am using Python 2.7.5 and Windows 8.1\n. ",
    "TomTasche": "Well, you could use my app for debugging if that helps: https://github.com/TomTasche/OpenDocument.droid/tree/feature/chromecast\nI can't give clear steps to reproduce it, but it mostly happened for me if I loaded a presentation (.odp) with a few slides and quickly switched tabs.\n. Nice to hear this is related to leapcast, because I had the same issue and thought it's my fault: :)\n. ",
    "Schibum": "BTW. Removing the following lines 42-44 from rest.py seems to have solved the issue for me. However I'm not sure if it creates any other problems yet. Maybe someone who is more into the protocol could explain what's the reason for redirecting here:\n# for app, astatus in Environment.global_status.items():\n        #     if astatus[\"state\"] == \"running\":\n        #         self.redirect(\"/apps/%s\" % app)\n. ",
    "aogulla": "Running minissdpd daemon after starting leapcast works perfectly without any errors. Confirmed proper working in debug (-d) mode.\n$ sudo /usr/sbin/minissdpd -i 0.0.0.0\n$ cat /var/run/minissdpd.pid\n   9502\nLeapcast also continues to work with minissdpd daemon running in the background however if fails if stopped then started again, with the same initial error.\n. MiniSSDPd is the default SSDP UPnP daemon that is used by MiniUPnPc on posix systems. It handles all SSDP traffic received on a computer via the multicast group 239.255.255.250:1900. \n. ",
    "saraHuang": "Very Thanks for your prompt reply. What my understanding is as below :\n1. websocket : its necessary requirement\n2. webrtc(data channels, ex : video or audio ?) : if media come from user side. like from \"crhome browse tab\", it use webrtc for media transfer.  And for some app that media come from cloud, webrtc is not necssary, am I right ?\n3. html5  and  support : its necessary requirement\n4. user-agent which contains crKey : is it necessary ? and what does crKey mean ?\nAm I right ? \n. ",
    "turl": "Hm, I somehow managed to completely overlook --fullscreen :) It works fine, sorry for the noise.\n. ",
    "seahawk1986": "I tested the YouTube app using a Nexus 7 after changing the port to 8009 - it worked just fine.\n$ netstat -tulpen\n(Not all processes could be identified, non-owned process info\n will not be shown, you would have to be root to see it all.)\nActive Internet connections (only servers)\nProto Recv-Q Send-Q Local Address           Foreign Address         State       User       Inode      PID/Program name    \ntcp        0      0 0.0.0.0:8009            0.0.0.0:*               LISTEN      1000       12460      737/python2.7       \ntcp6       0      0 :::8009                 :::*                    LISTEN      1000       12459      737/python2.7       \ntcp6       0      0 :::22                   :::*                    LISTEN      0          7163       -                   \nudp        0      0 0.0.0.0:1900            0.0.0.0:*                           1000       12455      737/python2.7       \nudp        0      0 0.0.0.0:47981           0.0.0.0:*                           84         8084       -                   \nudp        0      0 0.0.0.0:5353            0.0.0.0:*                           84         8083       -\n. Are you shure it's a fixed port? This looks more like a simple \"or\" declaration for a:\ncr$.Fa=function(a){a=a||\"ws://localhost:8008/connection\";this.a.info(\"Open connection service websocket: url=\"+a);\n. Ok, thank you for the explanation.\n. ",
    "philenotfound": "Worked fine for me, as in chromium window was opened, eventhough videos didn't play\n. You don't need to use the Chromecast app, it's only for setting up your real Chromecast stick... with leapcast you can just cast from Youtube or Play Music app\n. ",
    "clienthax": "Ok, next plan is to build chromium os with hw acceleration and test leapcast on that, i met hexxeh at a lan party, came in useful ;)\n. ",
    "motwera": "Thanks, now it works.\n. ",
    "stevensyy": "Dear dz0ny:\nthanks for your reply.  \nin the websocket.py L173  write_message, according to the tornado api \nWebSocketHandler.write_message(message, binary=False)[source]\n   Sends the given message to the client of this Web Socket\nI know the leapcast itself is the server of websocket, then what is the client of this websocket ? is it the chrome browser or the mobile device?   \nthanks a lot.\nBest Regards\n                        stevensyy 8 26\n. Dear dz0ny:\n          thanks.\n       1)   there are two websocket connections in leapcast. one is the leapcast to mobile app, the other one is leapcast to chrome browser?  if yes, when does the leapcast and chrome browser establish the connection?\n```\n    2)  how can we know  which one the write_message will push data to it.\n  in ServiceChannel.new_channel reply the url:ws = \"ws://localhost:8008/receiver/%s\" % self.app.info[\"name\"]\n\n is it written to chrome browser ?\n\n3) does the ReceiverChannel.on_message write_message actually write the message to the chrome browser?  \nonce again , thanks for your reply\n```\nBest Regards\n                    stevensyy 8 26\n. Dear dz0ny:\n```\n  1) the \"app\" you mentioned here is refered to youtube and play music ?\n2) the GET ,POST,DELETE http request are used by mobile app and leapcast, which is a websocket connection. When leapserver receives POST , the other connection chrome browser and leapcast is established. Is that correct?\n3) \"yes, if no data is transmitted in 3 seconds channel is destroyed by both app and browser\"\n   a) what is the data you mentioned here? is it the RAMP protocol message?\n   b) do you mean the ReceiverChannel will be destroyed? I am not sure what \"by both app and browser\" means ,is the app here refered to mobile app or not\n\n4)  there are some comments on the leapcast python code.\na)  frome service channel and receiver channel , there are\n       \"ws /receiver/$app From 1st screen app\" . Is 1st screen refered to the PC or laptop running the leapserver?\n\n   b)what does the \"2nd screen\" mean in the application channel comment? does it mean the mobile device's screen or not? And  I add some logs on the applicationchannel class. but I didn't see any of them printed on the PC terminal console. what does the applicationchannel mean.\n\n   thanks a lot.\n\n```\nBest Regards\n                              stevensyy  8 26\n. ",
    "superyounan1": "Oh I see, thanks for explaining. I don't know how to get chrome to do this, so I tweaked the argument building code in leap_factory.py to try to get it to support launching vlc instead of chrome (vlc complains and stops when it gets arguments it doesn't understand). It's crude and only works for the first video, but I was able to play a youtube smoothly. Maybe if i have more time I'll try messing with it some more to see if we can have have the queue and controls working wtih vlc too, should be possible to translate the requests into something the vlc web interface can accept\n. Awesome, thanks inutt for the suggestion and dz0ny for making the enhancement, ignore-gpu-blacklist did actually speed things up. \n. ",
    "inutt": "I've been looking into this on my HTPC recently. On linux, chrome tends to need the \"--ignore-gpu-blacklist\" flag to use hardware video acceleration.\nEven if this is set in the \"chrome://flags\" page for the user that runs leapcast, it won't persist since leapcast launches chrome/chromium using a temporary user data dir, which sets up a new profile with no flags set.\nI'm not familiar with how to do GitHub stuff at the moment, but modifying the command line used to launch chrome/chromium in leap_factory.py to include \"--ignore-gpu-blacklist\" enables full frame rate playback for me. The same goes for pointing leapcast at the already configured user data dir too, although then the window doesn't open fullscreen.\nThe first few seconds of a video are displayed at low quality with a temporary user data dir, which doesn't happen if I launch the browser using the usual user data dir, so I'm not sure if either is really a full solution.\n. ",
    "brimo2k": "I have this exact same issue on Mac OSX 10.6.8 running Python 2.7\n. Yeah.. Keep in mind that this project doesn't make any money for him and works on it in his spare time!\nJust for the record - this issue still exists for me on the most recent update.\n. This is the exact issue I am experiencing as well on OS X ... I commented on that issue also found here: \nhttps://github.com/dz0ny/leapcast/issues/52\n. ",
    "diraimondo": "I'm wondering if leapcast is still in development... :\\\n. I understand the spirit of an open-source project but I was just wondering if you were still interested in developing it. :)\nThanks.\n. Yes, the bug is still there at least with Google Music App.\n. ",
    "rajuashok": "Are you still experiencing this issue?  I still am.  Also I don't think I see this issue for other official apps like Youtube, or Google Music...\n. ",
    "tehsu": "I see this issue when mirroring the browser\n. ",
    "amanbx": "I am still seeing this error after the recent changes.\nFrom what I can tell, it is trying to re-use the control channel after closing the browser. Note the identical ServiceChannel objects before and after the DELETE.\nINFO:root:Channel for app {leapcast.services.websocket.ServiceChannel object at 0x10e595410} is\nINFO:root:CHANNELREQUEST for app GoogleMusic\nINFO:root:NEWCHANNEL for app GoogleMusic\nINFO:root:ReceiverChannel opened /receiver/GoogleMusic\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\nINFO:tornado.access:200 DELETE /apps/GoogleMusic/web-1 (192.168.1.6) 202.88ms\nINFO:tornado.access:201 POST /apps/GoogleMusic (192.168.1.6) 6.49ms\nINFO:tornado.access:200 GET /apps/GoogleMusic (192.168.1.6) 3.33ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (192.168.1.6) 0.55ms\nINFO:root:Channel for app {leapcast.services.websocket.ServiceChannel object at 0x10e595410} is\n. ",
    "jhbruhn": "Any chance that this'll get accepted @dz0ny ?\n. ",
    "pathomas": "I had the same issue try this\n\"DISPLAY=:0 leapcast --user_agent TV --fullscreen --chrome /usr/bin/google-chrome\"\n. ",
    "rharter": "I tried with DISPLAY=:0 and still can't get it to run headless.\nHere's what I see, and the app tells me it can't play my music.  Any news on this front?  I'd really like to find a replacement for my Nexus Q.\n```\nINFO:tornado.access:201 POST /apps/GoogleMusic (192.168.1.3) 51.03ms\nINFO:tornado.access:200 GET /apps/GoogleMusic (192.168.1.3) 92.23ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (192.168.1.3) 8.81ms\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\n[1:1:2828967043:ERROR:nss_util.cc(692)] Failed to load NSS libraries.\n(chromium:10673): Gtk-WARNING **: cannot open display: :0\nINFO:tornado.access:200 GET /apps/GoogleMusic (192.168.1.3) 39.81ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (192.168.1.3) 8.23ms\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\nINFO:tornado.access:200 GET /apps/GoogleMusic (192.168.1.3) 41.16ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (192.168.1.3) 8.32ms\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\nINFO:tornado.access:200 GET /apps/GoogleMusic (192.168.1.3) 48.95ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (192.168.1.3) 8.33ms\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\n```\n. Has this issue been resolved in some way? \n. ",
    "boydkelly": "I've had some success on a headless box doing below:  The only issue is if I disconnect then I have to restart everything again, so not too practical for day to day use at this time.  (Entire log when connecting, playing a few seconds of music, disconnecting, connecting and then attempting to play again is here: http://pastebin.ca/2514948)\ncat ~/.bash_profile\n....\ndbusinfo=( $(dbus-launch) )\nexport DBUS_SESSION_BUS_ADDRESS=${dbusinfo[0]#DBUS_SESSION_BUS_ADDRESS=}\nexport DBUS_SESSION_BUS_PID=${dbusinfo[1]#DBUS_SESSION_BUS_PID=}\npulseaudio --start\nXfvb :2 &\n[mpd@zbox ~]$ DISPLAY=:2 leapcast --chrome which google-chrome\nINFO:root:Starting SSDP server\nINFO:root:Starting LEAP server\nINFO:root:Added ChromeCast app\nINFO:root:Added YouTube app\nINFO:root:Added PlayMovies app\nINFO:root:Added GoogleMusic app\nINFO:root:Added GoogleCastSampleApp app\nINFO:root:Added GoogleCastPlayer app\nINFO:root:Added Fling app\nINFO:root:Added TicTacToe app\nINFO:tornado.access:200 GET /ssdp/device-desc.xml (10.2.2.34) 6.18ms\nINFO:tornado.access:200 GET /apps/GoogleMusic (10.2.2.34) 9.76ms\nINFO:tornado.access:201 POST /apps/GoogleMusic (10.2.2.34) 15.61ms\nINFO:tornado.access:200 GET /apps/GoogleMusic (10.2.2.34) 11.39ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (10.2.2.34) 3.59ms\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\nXlib:  extension \"RANDR\" missing on display \":2\".\nATTENTION: default value of option force_s3tc_enable overridden by environment.\nlibGL error: failed to load driver: swrast\nlibGL error: Try again with LIBGL_DEBUG=verbose for more details.\n[7:7:1219/090302:ERROR:command_buffer_proxy_impl.cc(160)] Could not send GpuCommandBufferMsg_Initialize.\nATTENTION: default value of option force_s3tc_enable overridden by environment.\nlibGL error: failed to load driver: swrast\nlibGL error: Try again with LIBGL_DEBUG=verbose for more details.\n[7:7:1219/090303:ERROR:command_buffer_proxy_impl.cc(160)] Could not send GpuCommandBufferMsg_Initialize.\nINFO:root:Channel for app  set\nATTENTION: default value of option force_s3tc_enable overridden by environment.\nlibGL error: failed to load driver: swrast\nlibGL error: Try again with LIBGL_DEBUG=verbose for more details.\n[7:7:1219/090304:ERROR:command_buffer_proxy_impl.cc(160)] Could not send GpuCommandBufferMsg_Initialize.\nINFO:root:Channel for app  is\nINFO:root:CHANNELREQUEST for app GoogleMusic\nINFO:root:NEWCHANNEL for app GoogleMusic\nINFO:root:ReceiverChannel opened /receiver/GoogleMusic\nINFO:tornado.access:200 GET /apps/GoogleMusic (10.2.2.34) 9.41ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (10.2.2.34) 2.03ms\nINFO:root:Channel for app  is\nINFO:root:Channel for app  is\nINFO:root:CHANNELREQUEST for app GoogleMusic\nINFO:root:NEWCHANNEL for app GoogleMusic\nINFO:root:ReceiverChannel opened /receiver/GoogleMusic\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\n\nPlaying music here just fine.....  But if I disconnect/reconnect/play, see entire log here:\nhttp://pastebin.ca/2514948\n. Awesome!!!  Thanks!\nOn Tue, Nov 12, 2013 at 1:45 AM, Janez Troha notifications@github.comwrote:\n\nInstall Google Chrome (chromium is fine too) and override path to browser.\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/61#issuecomment-28280181\n.\n\n\nBoyd Kelly bkelly@coastsystems.net\nCoast Business Technologies http://www.coastsystems.net\nC: 604.837.0765\nW: http://www.coastsystems.net\n. ",
    "tlau": "I'm still seeing this problem with the latest version pulled from github.\nINFO:root:ApplicationChannel opened /session/ChromeCast?1\nERROR:tornado.application:Uncaught exception in /session/ChromeCast\nTraceback (most recent call last):\n  File \"/usr/local/lib/python2.7/dist-packages/tornado/websocket.py\", line 303, in wrapper\n    return callback(*args, **kwargs)\n  File \"/home/savioke/leapcast/leapcast/services/websocket.py\", line 236, in on_message\n    channel.write_message(message)\n  File \"/usr/local/lib/python2.7/dist-packages/tornado/websocket.py\", line 165, in write_message\n    self.ws_connection.write_message(message, binary=binary)\nAttributeError: 'NoneType' object has no attribute 'write_message'\n[10:10:1127/100525:ERROR:base_feature_provider.cc(122)] manifestTypes: Allowing web_page contexts requires supplying a value for matches.\n[14:14:1127/100525:ERROR:base_feature_provider.cc(122)] manifestTypes: Allowing web_page contexts requires supplying a value for matches.\n[2589:2589:1127/100525:ERROR:base_feature_provider.cc(122)] manifestTypes: Allowing web_page contexts requires supplying a value for matches.\nINFO:root:Channel for app <leapcast.services.websocket.ServiceChannel object at 0x3346390> set\n[21:21:1127/100525:ERROR:base_feature_provider.cc(122)] manifestTypes: Allowing web_page contexts requires supplying a value for matches.\n. ",
    "derflocki": "I'm sorry, somehow I have missed your response from three weeks ago. \nCurrently vlc is used for playback, since VLC is widely supported and has a nice python API. You can check it out here: https://github.com/derflocki/leapcast/tree/upnp\n. ",
    "vickychijwani": "Facing the same issue here (Mac OS X 10.7.5).\n. ",
    "ljmccarthy": "I don't understand, this looked like a bug to me, am I using it wrong?\n. OK thanks, sorry to bother you. It might be an idea to put that in the readme.\n. ",
    "normanr": "So I found the problem, SO_REUSEPORT and SO_REUSEADDR need to be set before bind: eg:\n``` diff\ndiff --git a/leapcast/services/ssdp.py b/leapcast/services/ssdp.py\nindex 4cc1b70..a4bac07 100644\n--- a/leapcast/services/ssdp.py\n+++ b/leapcast/services/ssdp.py\n@@ -31,7 +31,7 @@ class MulticastServer(ControlMixin, ThreadingUDPServer):\n         self.socket.setsockopt(socket.IPPROTO_IP, socket.IP_MULTICAST_LOOP,\n                                mode)\n\ndef handle_membership(self, cmd):\ndef server_bind(self):\n         try:\n             if hasattr(socket, \"SO_REUSEADDR\"):\n                 self.socket.setsockopt(\n@@ -44,7 +44,9 @@ class MulticastServer(ControlMixin, ThreadingUDPServer):\n                     socket.SOL_SOCKET, socket.SO_REUSEPORT, 1)\n         except Exception as e:\n             logging.log(e)\n\nThreadingUDPServer.server_bind(self)\n\n\ndef handle_membership(self, cmd):\n         if self._listen_interfaces is None:\n             mreq = struct.pack(\n                 str(\"4sI\"), socket.inet_aton(self._multicast_address[0]),\n``\n. And actually theallow_reuse_address = Trueactivates python's ownself.socket.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)`, so one of them can/should be removed.\n. You need to install the python 'requests' module, the requirements file is updated recently.  I think 'pip install requests' may be enough, but not sure for windows.\n. Replied to your comment @ https://github.com/normanr/leapcast/commit/f4583707f4b649e0c12fdebc2a1899d3115e1849#leapcast-services-ssdp-py-P18 and updated the change; please take a look.\n. @dz0ny I've rebased to current head, PTAL.\n. ack, that should suffice. selenium uses the same wire protocol, it just adds extra functionality (that leapcast doesn't need)\n. btw, looks like there's an old debug protocol (enabled by --remote-shell-port and used by chrome-remote-shell project), and the newer websockes protocol (enabled by --remote-debugging-port).  tornado looks like it has a websockets client so that shouldn't be a problem :-)\n. Just to confirm, which revision/version are you using? 3838e6aaeb4dfb19ce8b2925de5908adb537acd8 has a fix to force javascript to load when there's mismatched http and https resources.\n. I hacked this up his weekend by making a wrapper for chrome that runs xset and xdg-screensaver, but built-in support would be great.\n. Also make sure you're synced to at least revision 3838e6aaeb4dfb19ce8b2925de5908adb537acd8, as it has a fix for fullscreen not passing the appurl.\n. Yes, I see it too.  I haven't looked to see why.  YouTube seems to work correctly though.  (Music uses the websocket channel, YouTube doesn't - I don't know if this has anything to do with the 'play next item on playlist once song is over' functionality being broken)\n. This adds a new dependency that is not expressed in setup.py not the README.\n. \n\n",
    "MartinSadovy": "pip install requests ;-)\n. ",
    "neumino": "Just took a quick look at it before going to sleep.\nI got Pandora working but my phone get disconnected from the Chromecast after a few seconds.\nI guess that's because I don't ping back. I'll look at it tomorrow.\n. Hum, so I fixed how leapcast is buffering if some channel are not available.\nSo now I can start Pandora on the first try.\nThe Android app still get disconnected after a few seconds. I can however reconnect and switch song/vote.\nI cannot reconnect if I close the windows/disconnect on the Android app. I'll try to spend some time looking at why I can't restart leapcast if I close it once.\n. Ah, I just messed up my timer. Sending a ping every few seconds is enough to keep the connection.\nI'll try to fix the last problem when I close the browser, clean a little my changes and submit a pull request : )\n. So I have something that works:\n- I can start/stop Pandora\n- Skip songs\n- Upvote/downvote\nThe sound control doesn't work though and it's extremely hackish.\n@dz0ny, could you shade some lights on a few things?\nWhy are remotes, receivers and control_channel lists in leapcast/services/websocket.py?\nFrom my understanding, there can be just one ApplicationChannel active, so just one remote and control_channel.\nThere may be multiple receivers like for Youtube?\nPandora doesn't let you have multiple receivers (even with a genuine Chromecast).\nAlso, what should be the behavior if the user closes the browser? I tried to disconnect the client, but I somehow cannot perfectly do. \n. Hum, it still works fine for me.\nI saw this when I was developing, and it was because the query parameter was not properly passed to leapcast. It was fixed here (and is still in master)\nhttps://github.com/neumino/leapcast/blob/master/leapcast/services/leap_factory.py#L126\nSo I don't really know why you get this page.\n. ",
    "feczo": "It just takes me to 'Innovation on the Big Screen Pandora available on Xbox 360 and PlayStation® 3' splash screen when I start to cast\n. ",
    "wischnow": "Shouldn't this be done by opening new windows? After all, the Google documentation says that receivers should use window.close() when they are finished (see https://developers.google.com/cast/developing_your_receiver under \"Notes\", \"Session Lifetime Management\" and \"Close the window\").\n. Hey!\nMakes sense, I've changed it to support the option \"--apps\" which gets a JSON file as argument.\nThe code merges the content of the file with the data from Google. This can later be improved if things like \"configuration\" are used.\n. Hope it's working now ;-)\nThanks for the hint!\n. Ups, forgot the part at the top. Thanks!\n. ",
    "maheshprabhu": "Currently i'm using 0.1.1 version ( Processing dependencies for\nLeapcast==0.1.1)\nOn Mon, Jan 13, 2014 at 2:02 AM, Norman Rasmussen\nnotifications@github.comwrote:\n\nJust to confirm, which revision/version are you using? 3838e6ahttps://github.com/dz0ny/leapcast/commit/3838e6aaeb4dfb19ce8b2925de5908adb537acd8has a fix to force javascript to load when there's mismatched http and\nhttps resources.\n—\nReply to this email directly or view it on GitHubhttps://github.com/dz0ny/leapcast/issues/76#issuecomment-32133049\n.\n. \n",
    "vapier": "thanks, i've fixed that failure now\n. ",
    "kevinxucs": "Tested on latest code with OS X 10.7 and it's having the same problem. Seems like a bug related with Chrome's Kiosk mode though.\nEDIT:\nIt's already on the bug tracker since 2012\nhttps://code.google.com/p/chromium/issues/detail?id=158047&q=kiosk%20os%20x&colspec=ID%20Pri%20M%20Iteration%20ReleaseBlock%20Cr%20Status%20Owner%20Summary%20OS%20Modified\n. ",
    "topy": "i tried this without have chromium installed. After installation, there comes no error message anymore, even not in google play music app.\nBut theres no sound on the audio jack (I can test it tomorrow with hdmi output) and this warning:\n(chromium:19341): Gtk-WARNING **: cannot open display:\nINFO:tornado.access:200 DELETE /apps/GoogleMusic/web-1 (192.168.2.50) 42.99ms\nINFO:tornado.access:201 POST /apps/GoogleMusic (192.168.2.50) 41.01ms\nINFO:tornado.access:200 GET /apps/GoogleMusic (192.168.2.50) 94.28ms\nINFO:tornado.access:200 POST /connection/GoogleMusic (192.168.2.50) 13.95ms\nINFO:root:ApplicationChannel opened /session/GoogleMusic?0\n[1:1:139363230368:ERROR:nss_util.cc(692)] Failed to load NSS libraries.\nChromium 22.0.1229.94 Built on Debian 7.0, running on Debian 7.2\nPython 2.7.3\nRaspbian GNU/Linux 7 \\n \\l\n. With \nln -s /usr/lib/arm-linux-gnueabihf/nss/ /usr/lib/nss\nI got rid of the failed to load nss libraries.. no there is only the Gtk-Warning. Google Play Music app gives sometimes an error, and sometimes not.. but music is never played. :-( \nif I install an x-server, meight there be hope?\n. thx for your quick responses..\n. ",
    "mauimauer": "Google has added a nasty check to the ChromeCast Extension\nIt now checks if the DTLS WebRTC Certificate matches \"cn=Eureka Gen1 ICA,o=Google Inc\"\n(see line 14317, background_script.js)\n. They switched to mDNS (Bonjour, Zeroconf) based service discovery. The actual connection between ChromeCast and the sender App also changed quite a bit...\n. ",
    "mshish": "Ok, that would do it. Strangely, using Chrome's debugger, I cannot get it to break on that function. I guess the check is happening elsewhere too?\n. ",
    "ZoranPavlovic": "@mauimauer Have you guys found a solution to this problem? Is there any way to edit the chromecast extension to not make the check you mention?\n. ",
    "GundamWing": "It looks like the https://clients3.google.com/cast/chromecast/device/config location is no longer the authority for returning a list of enabled services. It still lists all the pre-final-SDK services for backward compatibility, but doesn't contain any new ones.\n. Looks like the new location is https://clients3.google.com/cast/chromecast/device/baseconfig The file still has all the old entries, but now has a generic \"enabled_app_ids\" field that contains a list of approved apps. Seems the old way of doing things is over. There must be a query later that gets the custom launch URL or tells it to use the built in media receiver or the styled version. Chrome is still at the core and the js libraries for the receivers should still be accessible, so leapcast will probably still work once the new discovery mechanism is figured out and coded in.\n. Looks like Google killed the DIAL discovery mechanism in the final SDK too. No broadcast is going to 239.255.255.250 any longer DIAL discovery. I had to resort to packet sniffing after I updated the leap.py code to deal with the new \"enabled_app_ids\" way of getting their information. Leapcast never sees a DIAL request so there's no activity as far as it's concerned. \n. That's it. I was filtering DNS packets so that went under the radar. Thanks.  It does look like quite a bit got changed. I see the cv2 calls in the Chromecast debug log now along with the new mDNS mechanism. \n. ",
    "gaddman": "What version of Chrome are you running? Under both Win8.1 and Linux64bit with Chrome 33.0.1750.146 LeapCast can't be found - see bug 99.\n. ",
    "apoapostolov": "I am having the same issue.\nWindows 8.0\nVersion 35.0.1916.17 dev-m\nERROR:tornado.application:Uncaught exception POST /apps/YouTube (192.168.0.198)\nHTTPRequest(protocol='http', host='192.168.0.111:8008', method='POST', uri='/app\ns/YouTube', version='HTTP/1.1', remote_ip='192.168.0.198', headers={'Origin': 'p\nackage:com.google.android.youtube', 'Content-Length': '55', 'Content-Type': 'tex\nt/plain; charset=\"utf-8\"', 'Connection': 'Keep-Alive', 'Host': '192.168.0.111:80\n08', 'User-Agent': 'com.google.android.youtube/5.5.27(Linux; U; Android 4.4.2; e\nn_GB; GT-I9100 Build/KOT49H)'})\nTraceback (most recent call last):\n  File \"c:\\python27\\lib\\site-packages\\tornado-3.2-py2.7-win-amd64.egg\\tornado\\we\nb.py\", line 1192, in _stack_context_handle_exception\n    raise_exc_info((type, value, traceback))\n  File \"c:\\python27\\lib\\site-packages\\tornado-3.2-py2.7-win-amd64.egg\\tornado\\we\nb.py\", line 1375, in wrapper\n    result = method(self, _args, *_kwargs)\n  File \"d:!media!tools\\leapcast\\leapcast\\services\\leap_factory.py\", line 137,\nin post\n    status['browser'] = Browser(appurl)\n  File \"d:!media!tools\\leapcast\\leapcast\\services\\leap_factory.py\", line 39, i\nn init\n    self.pid = subprocess.Popen(args)\n  File \"c:\\python27\\lib\\subprocess.py\", line 711, in init\n    errread, errwrite)\n  File \"c:\\python27\\lib\\subprocess.py\", line 948, in _execute_child\n    startupinfo)\nWindowsError: [Error 2] The system cannot find the file specified\n. ",
    "quantenschaum": "Same issue here, running Linux 64bit and Chrome 33.0.1750.146.\nDoes Chrome 33.0.1750.146 work with real ChromeCast dongles? I pretty sure it does. If I owned one, I would show you the wireshark traces. So, what is different here? \nleapcast still works with the play music on android.\n. Is this the same thing as #96?\n. Lollipop PlayMusic is working? I doubt that it does, due to protocol change. Is your PlayMusic app up to date?\n. RTFM https://github.com/dz0ny/leapcast\n;)\n. run \nleapcast\nand \nleapcast -h\nto get a list possible options\nTFM is not missing a step, have a look into the last box of code on \nhttps://github.com/dz0ny/leapcast\n. ",
    "montajd": "other apps work fine.  Ive tried with both Chrome and Chromium, and in Chromium , the ads don't even start, a page pops up saying something like, sorry your video is unavailable right now.\n. ",
    "DanielFallon": "if I'm not mistaken, Windows services on win7 and later run in a different session, and won't have access to lots of things on the user session (for example the display) this may be what is causing the issue.\ndiscussed here:\nhttp://www.brianbondy.com/blog/id/100/\n. seems all but abandoned. I have been considering forking this repo and continuing the project, although it might be worthwhile to just start from scratch on it.\n. I would be happy to do work on the development (I do most of my personal projects in python, and am very familiar with the landscape) \nBut, I don not have time to reverse engineer the protocols (documentation on the server is slim to none because they don't expect you to implement one)\nIf you or someone else can do work on documenting the protocol, then I'd be happy to continue dev. (lets hope that google doesn't change the protocol again any time soon)\n. https://github.com/HomerSp/CastTest\nhttps://github.com/thibauts/node-castv2\nrelevant? \nAlso it appears from cursory research that there is a hardware drm chip in the chromecast responsible for provisioning keys that are recreated every 24 hrs. We may have to give up hope for good.\nreference:\nhttps://github.com/thibauts/node-castv2/issues/2\n. I think the point was that the cryptography makes it impossible to\nreplicate functionality. no matter what platform you're doing it on.\nOn Sat, Sep 26, 2015 at 7:21 PM Cody Swartz notifications@github.com\nwrote:\n\nAt this point it's sounding easier to just make an app that has the same\nfunctionality : (\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/dz0ny/leapcast/issues/130#issuecomment-143506738.\n. @GRMrGecko my understanding is that the chromecast uses a a hardware device like a TPM.\nyou don't just Reverse engineer that device.\nGoogle would be able to pretty easily track if we just cloned a single certificate of a TPM (given that you're able to do that, which its job is to literally make sure that can't happen)\nThe other alternative is to break the certificate that was used to sign the certs, which is non-trivial as it likely has sufficient key length to be difficult.\nand even if we did that, google would just issue a new cert and use that for all future devices until it can eventually phase out the old one.\n. duplicate of #130 \nv2 protocol cannot be implemented without certificate\n. duplicate of #130 \nv2 protocol cannot be implemented without certificate\n. \n",
    "hchapman": "Python 3+ has some backwards compatibility issues with Python 2.7. \n. ",
    "AndroidDeveloperLB": "But Python 2.7 doesn't have \"pip\" (at least I can't find it) , as the instructions (here: https://github.com/dz0ny/leapcast#simple )  say:\npip install leapcast\nAlso, now that I've uninstalled 3+, and installed 2.7 (and also changed the \"PATH\" variable to point to the new paths), for some reason it fails to run. It says:\nfailed to create process.\nIsn't there a simple tutorial on installing it and running it?\nOr maybe binaries instead of something to compile ?\n. @dz0ny no. this also wasn't found anywhere in \"C:\\Python27\" .\nBesides, I've done the pip command when I had version 3 of python, so now I'm on the second phase, of running the app.\nOf course, I would love to have a full working step-by-step solution (preferably short and easy too).\n. ",
    "justin8": "1) install python\n2) install pip\n3) pip install leapcast\nIt doesn't exactly need an instruction manual. I have no idea in windows, I haven't used it in a long time. But every linux or mac system you just need to run $packagemanager install python python-pip (or python2 and python2-pip for fedora/arch/etc) and you're done.\n. ",
    "uudashr": "+1\n. ",
    "candrews": "There's a pretty good write up of the v2 protocol at https://github.com/thibauts/node-castv2 - I'm still holding out hope that someday I can use a computer as a ChromeCast :)\n. ",
    "werty1st": "Maybe we could run the modified chromecast.apk from http://forum.xda-developers.com/hardware-hacking/chromecast/app-cast-receiver-app-android-t2900726\ninside chrome:\nhttp://www.omgubuntu.co.uk/2014/09/install-android-apps-ubuntu-archon\ni have installed the apk on my Minix Neo and it works at least with google music.\n. ",
    "ghost": "Figured this out. I was running it from a batch file and was missing a few things that were needed to set up the environment. \nI needed to run it from the \"start-leapcast.vbs\" file which is detailed in the installation guide: https://gist.github.com/eyecatchup/6219118\nClosing the issue.\n. ",
    "simon-weber": "My guess is that the ios app was still using the old protocol.\n. This has to do with the google serverside pairing between the app the the client. If I launch a fresh browser on each connection, each client will connect successfully to their own chrome instance.\nMy guess is that leapcast needs to be advertising the established youtube session so that new clients know to connect to it. I don't have a chromecast to do dynamic analysis on, though, so I probably won't be much help there. I may be able to manually run through the youtube-specific serverside pairing (eg https://www.youtube.com/api/lounge/pairing/register_pairing_code), but that's not a general solution.\n. Yup, a direct call to register_pairing_code allows a second device to connect. I'm just going to hack that into my fork -- I can't imagine you'd want it in master.\n. ",
    "geovanisouza92": "Play Music v5.7.1788Q.1634597 not even recognized\n. ",
    "The-QullzToxic": "I can also confirm that lolipop screan cast does not work\n. ",
    "djdesign": "Samsung Note 4 Lollipop 5.0.1 +  Play Music v5.8.1836R 178745 does not show as well. How can I go about helping with this?\n. ",
    "curiousercreative": "Throwing my support behind this feature. This is a brilliant project with huge potential. \n. ",
    "reedstrm": "TFM is missing a step after 'python setup install' 'leapcast'\n. ",
    "nflshadow": "The step is not missing, but at the first glance, we can think the box of code is for windows only so i didn't read it. Missing a title that clearly indicate that for running.\n. ",
    "grandrew": "Here is what official docs say about it:\n- https://developers.google.com/cast/docs/audio\n- https://developers.google.com/cast/docs/custom_receiver.html#capabilities\nfrom the first doc it seems that it is not possible to stream audio only if the app is video+audio, and/or the app must somehow explicitly support streaming of audio only (I guess that youtube does that?)\nthe second doc seems to point that the only thing that distinguishes audio-only and video+audio devices is the CAST-DEVICE-CAPABILITIES: {\"display_supported\":false} header that should be sent with the request if there is no display support, and the app should take care of the rest. As far as I understand, this means that the chrome should be somehow instructed to attach this header to the request, and according to http://peter.sh/experiments/chromium-command-line-switches/ - there is no way to do this at commandline args.\n. ",
    "DanielSmedegaardBuus": "Wait a minute... You can use phantomjs for setting up a headless receiver? I'd love to be able to stream audio to my Ubuntu server, but installing a desktop onto it is just not something I'm ready to do. Please tell me more :)\n. ",
    "robUx4": "The CAST-DEVICE-CAPABILITIES header is sent by the Chromecast. So it needs to connect to something to provide that information.\n. ",
    "chocol4te": "@DanielSmedegaardBuus I feel the exact same way. Do you know how to setup phantomjs to work on Ubuntu Server with leapcast? I have a vm that I can set to output audio through my onboard audio, while keeping my headphones on my DAC. This would mean that my family could stream youtube music over our speaker system, and I could still work with my headphones.\n. ",
    "an0t8": "Thats really too bad.  I'm not much with python, but I am a software engineer, maybe I could help out as well.  Though time is limited at the moment.  Even if the original contributors don't want to work on it anymore it would be great if they could at least log their findings, or make any documents on API changes and stuff public.  The stuff on the wiki looks like it was all the previous version.\n. How far the \"do no evil\" google has fallen...  Ah well.  would have been nice to have an EASY way to cast content wherever you want.  They really missed the mark on this one...\n. ",
    "ctsstc": "At this point it's sounding easier to just make an app that has the same functionality but doesn't rely on chromecasting, it's all about what you're trying to accomplish, do you just want your mobile device to be a remote, do you want your pc to be a media server, the biggest thing is being able to push apps to your system : (\n. I think the point of leapcast was to use the current chromecast infrastructure to use mobile devices as remotes to control the content on your system. So it seems that people just want remote mobile apps that control the media on their system?\n. ",
    "GRMrGecko": "Note: Cryptography does not make anything impossible. Think DVD/Blu-Ray/AirPlay.\nPeople already got access to the file system of the chromecast and android phones, so all that is needed is to reverse engineer the crypto.\n. ",
    "FastDr1v3r": "I've got the same problem... :( I can't run Leapcast.\n\"ERRORS: Sometimes Windows just plainly suck and you will get this error due to Socket limitations in Windows's kernel\"\n. ",
    "x8BitRain": "I uninstalled python 2.7.5 and installed 2.7.11 and it started working, note that you have to start the service with the path like this  \"C:/Users/DieBagger/AppData/Local/Google/Chrome/Application/chrome.exe\" rather than with backslashes ( \\ ), it's working great.\n. try finding the full path to your Chrome.exe instead of using the PROGRA~2 path.\n. You can't unless you write a specific .json for it and execute it, so there's no easy way around it.\n. ",
    "dobrakmato": "I added these two lines to leapcast's main.py file:\nimport requests\nrequests.packages.urllib3.disable_warnings()\nThat disabled urllib3 warnings about SNI. Then I also added verify=False to services/leap.py:35 to make the library not raise error. \n```\nload json-file\nresp = requests.get(url=app_dict_url, verify=False)\n```\n. ",
    "quochuy": "I created a class in default.py and a json file and load it with --apps file.json but no luck\n. ",
    "trotskylenin": "I've suggested that change in #142 \n. Anyways this proyect is dead and only working with Youtube.\n. ",
    "Sandarr95": "I think the best solution in terms of hours vs. reward is just starting:\nchrome --start-fullscreen --kiosk youtube.com/tv\nwhich can be done from within kodi and made a little cleaner with batch scripting (or shell).\nThanks a lot for now, hopefully Google is still gonna be smart enough to open up the API again.\nIll close it now, so if anyone ever reads this, I think the solution described above is most rewarding.\nIf you need more help with setting that up, feel free to contact me.. ",
    "RealOrangeOne": "You can use pip to install the library directly from github, and then if you run leapcast --help it'll tell you how to use it.\nBut, as said in the README, this project is depricated\nUpdate:\nActually, no you can't. The setup.py was removed. If you rollback back to a commit with the setup.py then follow the steps above, it should work.. ",
    "ernes32": "Add \"--no-default-browser-check\" flag to command_line\nto prevent \"Default Browser Prompt\" in kiosk mode\n. "
}