{
    "equinusocio": "Hi @irazasyed thanks! \n. Hi @Rias500 thanks for the work. I will merge this request in the next day when i've published the package on package control. In the meantime i'm working on a version of the  Sublime Text app icon to be published together.\n. We have edited this in the same time :)\n. lol. Thanks man..\n. Thanks man! some help.. and not 8657 stupid issue.\n. In the last relese the linehighlight was fixed.\n\n. You can fork this theme and made your own version ;) i can't think to fix every \"personal fancy\". Sorry.\n. Please use this more coherent colors:\nhtml\n<key>guide</key>\n<string>#37474F80</string>\n<key>activeGuide</key>\n<string>#80CBC470</string>\n<key>stackGuide</key>\n<string>#37474Fff</string>\n. Thanks. If someone (not you :P ) will open an issue i will check\n. The package control read this repository every 1 hour. If a new release exist the package will be updated\n. So, if i don't draft a new release you don't see the update.\n. Thanks man\n. @kristijanhusak thanks!\n. Thanks @Revod \n. Hi, You tested all the optimized assets?\n. Thanks!\n. Thanks! \n. @Riccardo-Zanutta remember to check and pull changes from my gh-pages branch before start editing. Maybe i've made some change/fix on it.\n. @DrOnJD If you want to customize the theme (based on your personal tastes ) please make your own local mod by following this steps:\nhttps://github.com/equinusocio/material-theme/issues/305#issuecomment-120479395\nIf i allow everyone to add they personal preferences this theme will become a conglomeration of confusional things. Nothing personal, but Open Source doesn't mean \"make what you want on this code\".\nHelp with issues, implementation and fixes are welcome.\n. :+1: \n. @Riccardo-Zanutta  Add Thumbs.db in .gitignore :wink: \n. You have to see the line number only when you need it. There is no reason to make it always visible and distracting. I can change this for a personal preference. Nothing personal.\nYou can make this change on your local copy, by overwriting the theme folder.\n. thanks man. I'm sorry\n. I think #6161640 is enough. Try and i will merge. :+1: \n. Set to #6161640 in the next release\n. Ty :+1: \n. Thanks man \n. Thanks @gmahomarf :+1: \n. You can simple commit the change to your branch. The commits will be displayed here and will see the changes\n. Oh... i'm sorry for this. Thanks.\n. Hi @Yago , can you post a screenshot?\n- Make PR to the develop branch, not master.\n- Revert message (1.8.0) update commit. I will update the message in the next release.\n. Thanks man :+1: \n. @claudiodekker You know that you can override all things in this theme without lose you change when updating? This is a material theme and the oceanic background color doesn't exist in the material palette and i want keep consistency.\n. Thanks for the support.\n. Thanks man :+1: \n. Thanks for the help man :+1: \n. Thanks man, i will update this icon with the correct font Roboto Bold. Check ecea373\n. Yes but a serif font doesn't match with the UI. I want more consistency. \n. @traf Pls add also the\" lighter\" and \"default\" screenshots with this accent :)\n. Hi @leo please add your porting under the @silvestreh one. :+1: \n. You're right. Sorry. :+1:  Thanks for your work :)\n. @pdilyard Add the fix also for darker and lighter scheme :+1: \n. Sorry but this isn't a bug\n. Can you add a screenshot with alla the theme styles (darker,default,lighter)?\n. Thanks man!\n. Sorry but this is a personal customization... You can do it with your local theme installation\n. Or a calibrated monitor! :)\n. @jonsuh i like your support but you don't think that key: \"string value\" should have a different color from key: true/false?\nPS: There is a lot of meat instead of meta. Please fix it :)\n. @jonsuh Better! We need all this meta?\n. Thanks man :+1: \n. Please add here a before/after screenshot\n. You have change the source files, not the compiled one. Check https://github.com/equinusocio/material-theme#contributing\n. Thanks man\n. Thanks!\n. Can you use the official logo? You can try with the rabbit only or the Jade word. \nAre you use Sketch on OS X?\n. With Sketch, please use this source file to make the new icon. Create or duplicate a new artboard with a correct name and use one of the common color style provided with the file (Red, blue, yellow and others..). Then export the icon @1x.png and @2x.png.\nMaterialTheme-File-Icons.zip\n. You can move the rabbit logo of 1 or 2 pixel up? Then just export the icons using Sketch export functionality, update the PR and send me the updated sketch file. :) \n. 👍 Thanks \n. @psullivan6 thanks so much. I will add the pug icon and the .pug (i think?) icon association.\nI opened a new issue here. \nhttps://github.com/equinusocio/material-theme/issues/773\n. @vikjam make sure that the new file extension is .pug, update the icons and the relative file\nhttps://github.com/equinusocio/material-theme/blob/develop/prefs/icon_jade.tmPreferences\nDon't edit this file, just make a new one icon_pug and test both .jade and .pug extension.\nThe icon must be monochromatic, i suggest you the pale yellow color.\n. :(\n. Thanks man 👍 \n. https://github.com/equinusocio/material-theme/commit/55875dff6937664a289882fb3019730aa155c4e4\n. Please:\n- add before/after screenshot\n- make the fix on all material theme scheme (default, darker, lighter)\n. @marcushat Old schemes aren't supported anymore. So just use the new one.\n. I forget to do this. Thanks!\n. So #925 it's caused by this? You are sure?\n. 👍 \n. Thank you!\n. Thanks :)\n. Thanks! :)\n. Thanks man! 👍 \n. 👍 \n. To collaborate you have to edit only the files inside the ./src folder, then run gulp build. I will fix this by myself, thanks!\n. Yes, but schemes/Material-Theme-*.tmTheme was removed. Anyway i fixed this. Thanks!\n. Hi @rouzbeh84, they are allowed bugfixing PR, not personal customization. You can do this customization in your local installation. Sorry for that.\n. You can't make an option to handle scheme colors. You can only set the default comments color for each theme (scheme.comments):\nhttps://github.com/equinusocio/material-theme/tree/develop/sources/settings/specific\nYou can also change the scheme here (this will affect each mt theme):\nhttps://github.com/equinusocio/material-theme/blob/develop/sources/schemes/scheme.YAML-tmTheme#L59\n. So i can also remove .supports-a-file-icon-customization file?. Ok thanks. Nice work 👍 . Please add a before/after screenshot and the reference to the material design color palette.. Thank you @KevinSjoberg. 👍. There is not a \"tomato\" color.. . No :) the table contains the basic color scheme https://github.com/equinusocio/material-theme/tree/develop/sources/settings/specific (scheme.base). Nice work. Thank you.. @zpreston123 Do you want to become a project contributor? I'm not working on this theme (I'm now focused on the Visual Studio Code version) and I will deprecate it if no one will maintain it.. @zpreston123 Just remember that you have work in source files and then build the theme with the gulp tasks:\ngulp build build all\ngulp build:themes build only ui themes\ngulp build:schemes build only syntax schemes\nYou are now a collaborator and you can work directly on this repo. Please just use features/ and fix/ branches and follow semantic commits. Make a features/ or fix/ branch always from develop then when you finish make a PR from the features/ or fix/ into develop. You can also work directly  and push on the develop and master branch.. Hi @zpreston123 The issue #1190 could be caused by High Sierra. Check this comment\nhttps://github.com/equinusocio/material-theme/issues/1190#issuecomment-334298326\nBefore changing the UI we need to be sure that the theme is the problem and not any other things. Yes. Make it activable behind setting but leave the foreground color untouched. Thank you so much. The original material theme foreground (before your changes). @kawasako Thank you for you help. @wbond where is the ST setting to switch native title bar? i can't find it on 3143. Oh ok. I think it is not related because i added that setting (material_theme_accent_titlebar) just 20 days ago and the issue about High CPU (https://github.com/equinusocio/material-theme/commit/2b57e5f47badd5a8cea7ac9c78b70ded99f3987a) was opened 6 months ago after 3131 build. @zpreston123 If you want, you can build and release a new patch. You just have to build the theme by running gulp build and make sure all files exists in /schemes and /themes.\nSometime the builder fails to generate schemes, you have to convert them manually to .tmTheme one by one using the PackageDev package and running the command Packagedev: Convert (YAML, JSON,PList) to...\nWhen the build is complete you have to run gulp bump --patch and gulp changelog to bump the package.jsonand generate the changelog.\nThen you can merge/push to master and make a new github release with the new generated chegelog section (we need to use semantic commit for that)\n. @zpreston123 Nice!. Thank you @zpreston123. Can you try to make the indicators a bit transparent? I think they are distracting right now.. @zpreston123 Wait wait, don't change the colors, just set the rgba opacity :). Can you try with 30% and 50%? Just for a comparison. @zpreston123 I think the 30% is less distracting. What do you think?. Do you think that these icons should be so much visible and so much distracting? I think they add a lot of noise.. :(. We can start with 30% and waiting for issues. Issues are disabled on this repo, if you want to keep support and release fixes of this theme you can reopen them, but i don't have time to support you in complex tasks.. @zpreston123 build the theme before merge :). @zpreston123 Yes sorry.. Do you want to make the release?. Make sure these two files have the same version and try just gulp bump\n- package.json\n- utils/info.py. You can try to update them. :) :P. Build develop and the merge with master. Then make the release from master. Don’t forget the bump and the changelog. Yes :) I will merge it fast. I promise.\n. Now make a github release from master 👍 \n. @zpreston123 When you make a release add the latest changelog updates.. It is just my opinion. . I was a Sublime Text user for years. For years sublime text 2 has not received updates, it was totally abandoned by is author, until wbond and others start working on it. After 3 years of v3 beta and only bugfixing i can consider it an obsolete commercial software. Now v3 is out and there are not new features, out of the bos ST is like a commercial Nodepad++ . Is not hard to think:\n\na 80$ commercial software that is 80% cracked or used in free mode.\nNo modern languages integrations built-in. You have to hope that some developer build an extension.\nNo linters integrations\nNo automplete across files for css, html, js, typescript etc (without some RAM-eater extensions)\nLack of functionalities, like markdown preview, svg preview, tasks, git..\nTheme engine obsolete and very hard to manage.\nClosed community with not support.\nAnd many other issues\n\nVisual studi code, atom or Intellij have a lot of built-in features, and vsc and atom are free, open source with a huge community and monthly USEFUL updates. With vsc or intellij, you need extension to EXTEND the software, not to build it. With ST you install the basic text editor and you have to install a lot of extensions to make it a bit useful,  It is fast, yes, but because it does not have anything.\nVSC:\n- Free\n- Open source and followed community\n- Lot of improvements and features released every month\n- A lot of integrations with modern languages out of the box\n- Fast\n- Git integration\n- Tasks integration\n- Debug integration\n- Many others\nYou think that sublime is a good editor? ok, you can still pay 80$ for it and think what you want, it is not offensive for me.\nI was the only contributor to this project until last days and yes, i'm the only one that can take actions on this project. You want to fix and rewrite this theme for an obsolete text editor? You can do it like @zpreston123 does. Contributing. :)\nI will update the readme wit a more detailed deprecation note.. @zpreston123 Thanks for the ping. I totally missed this PR. Nice work.. Yes sometime this occurs and i don't know why. Just let it as is, don't worry. Just write the update message with the relative updates.. @zpreston123 Ok You can now draft the github release :) Thank you again for your work. Tell if if you are open to a new project, a premium Sublime Text theme. But we need to have time and a python dev.. @zpreston123 You know python? I think that if we want to keep Material Theme a live project, we need to completely rewrite it, but we need a python developer as active contributor. Then we can make a a github org.. Do you mean something like this?\njs\nexport default function pathConfiguration(require, module) {...}\n. Why you removed <kbd>?. Same here, why you removed <kbd>?. You have to change this file\nhttps://github.com/equinusocio/material-theme/blob/develop/sources/settings/specific/Material-Theme-Lighter.json\nand then rebuild the theme, not the files inside schemes/.\nWe also use a blueish gray color from material design Blue Grey palette, i think one of these will be good:\n- #CFD8DC\n- #B0BEC5\n- #90A4AE. Just asking :). ",
    "irazasyed": "Hey @equinusocio No problem!\nKeep up the great work, it's a fantastic theme :+1: \n. ",
    "Rias500": "This is what it looks like: http://i.imgur.com/NnDJPxZ.jpg\n. ",
    "defaltd": ":heart_eyes: \n. ",
    "rands0n": ":smile: \n. ",
    "llaraujo": "sorry, I messed up.\n. ",
    "hanxue": "Before\n\nAfter\n\n. @equinusocio Thanks of the quick reply. In your screenshot, I can barely see the line number. Line highlighting was working, but the contrast between line number and gutter background is still too low. \n. ",
    "arpitjacob": "Thanks looks good, but I feel its a bit too subtle, especially when you are looking at multiple nested code when using a language like Jade. its better than nothing though :) \n. ok done, I added your suggested code you are free to merge it. \n. How long does it take for this code to reflect at packagecontrol.io? I just restarted sublime text and it reset the theme?\n. good to know that. \n. ",
    "simondavies": "not a problem awesome theme\n. ",
    "Revod": "No problem mate @equinusocio \n. wow, love it\n. Good. hope see support for .babelrc too :+1: \n. Amazing! thanks :100: \n. ",
    "Zyber17": "Whoops, wrong button\n. ",
    "riehlemt": "Missing end quote and comma.\n. ",
    "vluzrmos": "Cool.\nhttp://riccardo-zanutta.github.io/material-theme/\n. cool.\nhttp://riccardo-zanutta.github.io/material-theme/\n. Something wrong here.\n0 Files changed.\n@DrOnJD fix that pr.\n. ",
    "timbog80": "dont add the float button. its a ui mistake\n. yea this would be better\n. ",
    "sasindumendis": "+1\n. ",
    "DrOnJD": "sorry, recently on GitHub\n. Thanks for the advice, it solves my problem. Thank you very much for the theme, it is great.\n. ",
    "Riccardo-Zanutta": "@equinusocio Done Sorry :) \n. ",
    "msrafi": "+1\n. ",
    "Lykegenes": "I understand. It was just a suggestion since the darker version has more contrast when it comes to line numbers, but i prefer the blueish background color of the default one. Thanks for the great theme!\n. ",
    "brenolf": "+1 for this\n. ",
    "nsarno": "Indeed, would be nice to have something that ressemble a bit more like the ruby icon. I'll see what I can do. Closing this for the moment. \nThanks for the feedback!\n. Thanks :+1: \n. ",
    "claudiodekker": "Fair enough, but how would I go about doing this, then?\nI've been using PackageResourceViewer's 'Extract Package' function to extract the package to my Sublime Text 3/packages/ folder, but every time the theme gets an update, it gets overwritten.\nI apologize for the stupid (perhaps way too obvious) question, but I though I'd ask since I'm curious now that you mentioned it.\n. Nevermind, figured it out. Should've done a bit of research into this. Thanks.\n. ",
    "vikjam": "Thanks for all your work! This theme is pretty sleek.\n. I could give it a shot! The icon in the screenshot above is the one that already exists in your theme.\nI usually use Illustrator, but I've played around with Sketch.\n. I had a go at the rabbit using the color scheme in the Sketch file. I replaced the existing Jade logo in the Sketch file with the rabbit. Should I send you the updated Sketch file?\n\n\n\n. How about this? I brought it up as high as I could.\n\nI could shrink it if you'd like.\n\n. I updated the pull request and I'm including the updated Sketch file.\nMaterialTheme-File-Icons.zip\n. Eek--I had no idea about their rebranding. Sorry for not knowing about that! If you want, I could put together the pull request for #773. \n. ",
    "ghostrydr": "Mine uses the Java font\n. ",
    "leo": "@equinusocio Look closer, they're both still there :blush:\n. @equinusocio No problem! Thank you too for merging it! :smile_cat: \n. ",
    "pdilyard": "@equinusocio Done.\n. ",
    "manoverda": "Here are screenshots of Material-Darker theme:\n- Before:\n\n- After:\n\n. Here are screenshots of Material-Darker theme:\n- Before:\n\n- After:\n\n. Here are screenshots of Material-Dark theme:\n- Before:\n\n- After: \n\n. When selecting a word that is a lot present in the current file, unselected found words are really visible with a yellow border, but selected word is poorly visible among them. Adding a border to the selected word make it more visible among all other found words.\nHere are screenshots of Material-Darker theme:\n- Before:\n\n- After:\n\n. ",
    "guemidiborhane": "Sorry if i didn't make my self clear it is a bug \n. ",
    "sciascia": "You must have super human eyesight - all good! Cheers.\n. ",
    "zakrid": "Great job!\n. ",
    "jonsuh": "@equinusocio Ahaha, oh my—maybe I was hungry and thinking about “double meat...” meat changed to meta.\nNot a bad idea about differentiating true/false. How about this change? We’ll do JSON true/false as the same color as Booleans foreground and double-quoted string values as Variable foreground.\n\n. @equinusocio There might be another solution, but I’m not sure—I’m no expert and this was the only solution I was able to get to work.\n. @Revod You got it! Pushed a commit to include .babelrc, too :boom: \n. ",
    "heavybeard": "It wors for me, you save my eyes.\nThanks @jpcharrier \n. ",
    "jpcharrier": ":thumb:\n. @ryanmortier good spotting\n. ",
    "ryanmortier": "PR #659 fixed the darker theme. This PR is to fix the normal theme.\n. Old:\n\nNew:\n\n. ",
    "elquimista": "\n\n. ",
    "psullivan6": "Since this was a recent update, I wanted to make sure you all were aware that Jade recently changed to Pug as per some legal issues. Read about it here.\nAlso, for this particular GitHub Issue, the new logo can be found via this Issue thread with the new icon repo here.\nHopefully this helps and doesn't create too much additional work.\n. ",
    "marcobiedermann": "@equinusocio You are very welcome. Thank for this great theme. I absolutely love it :)\n. ",
    "austenc": "I was just replying but you beat me to it! Thanks! (Also thanks for the epic theme!)\n. ",
    "Stormiix": "The new README is great !\n. ",
    "diego1araujo": "I've tested all accent colors in the current version named v3.1.8 on ST3 3114/Windows 10 and it looks like is everything ok.\nCan you say which version of MT, ST and OS you are running?\n. Ohh, now I see. You wrote \"Default theme\" but picture example seems like Darker theme. That confused me hard.\nYes, on default it happens. This might be merged soon. :+1: \n. ",
    "anhuynh": "@diego1araujo That's weird. I first noticed the issue on v3.1.7 on OSX 10.11.6/ST3 3114. I can also see the behaviour on my Windows 10/ST3 3114 too. Did you disable folder animations? Cause that's where the issue happens.\n. Yeah, there's also an issue with the Darker and Lighter themes too. Disabling folder animations on those themes don't do anything. This fixes that as well as the screenshotted issue on the Default theme.\n. I believe that you need to have PackageDev installed in your Sublime in order to generate the .tmTheme files. You should re-build and commit those back into your pr. \n. ",
    "fcaldera": "Thanks @anhuynh. It did work. I've added the missing .thTheme files. \n. Sure @equinusocio, that's what I did. Other files were changed by the build process.\n. ",
    "rouzbeh84": "Would like to eventually make the text color an option of the advanced configuration if this is something you'd be interested in.\n. No problem! I didn't know the guidelines but thought it was a useful addition. If I wanted to make that an option in the config where would I begin to look if you don't mid me asking?\n. ",
    "ihodev": "No, installer is optional, but .supports-a-file-icon-customization is required for theme only.. ",
    "aprescott": "Maybe I'm missing something. There's a tomato color in settings/commons.json, and \"material_theme_accent_tomato\" is a configuration option. Doesn't that mean it should be part of the table?. ",
    "zpreston123": "@equinusocio Sure thanks!  I can only make small changes, since I’m not a designer and have never built a theme from scratch.  Hopefully, this can continue being active with contributions from other members as well.  It's an awesome theme, great job!\n. @equinusocio OK.  So whenever I create a feature/ or fix/ branch to add and commit changes, do I push it to the upstream repo directly and create a pull request for you to merge into develop?  Not sure how the process works lol.\n. OK makes sense.  Thanks again!\n. OK I read the comment, so it's very likely High Sierra is causing the issue.  However, the Adaptive theme title bar seemed to render fine after I switched to one of the dark color schemes:\n\nIf the issue doesn't get resolved in the next OS update or two, then I think this fix would suffice.. @mallowigi I agree, white for the dark themes and black for the light theme wouldn't fit very well.  I think the title bar along with these changes would be better as an option.\n@equinusocio I can add an option to enable the title bar, which many users seem to want (https://github.com/equinusocio/material-theme/issues/1202).\n. @equinusocio OK that works!  You mean the default native foreground color or the same ones in these changes?. @equinusocio Got it thanks!. @equinusocio OK sure.  I changed the blue indicators to pale blue, the red indicators pink, and the purple indicators violet.  Haven't pushed them yet, let me know what you think.\nDefault\n\nDarker\n\nLighter\n\nPalenight\n\n. @equinusocio OK no problem.  Thanks for clarifying.\nHere are the indicators with 70% opacity:\nDefault\n\nDarker\n\nLighter\n\nPalenight\n\n. @equinusocio Here you go:\nDefault - 30% opacity\n\nDefault - 50% opacity\n\nDarker - 30% opacity\n\nDarker - 50% opacity\n\nLighter - 30% opacity\n\nLighter - 50% opacity\n\nPalenight - 30% opacity\n\nPalenight - 50% opacity\n\n. @equinusocio I think 30% is a bit too dim and isn't as clear as the 50%.. @equinusocio I just think they'd be a bit easier to see when viewing them that way, but whatever opacity you think would work best for the user.. @equinusocio OK all set.\n. @equinusocio I ran the build command and everything looked the same, even after converting the scheme files.  If you check out the previous commits, they include the generated scheme and theme files.  Not sure if I'm missing anything.. Sure!  I tried running \"gulp bump --patch\", but got this error:\nevents.js:161\n      throw er; // Unhandled 'error' event\n      ^\nError: Invalid semver\nHas this happened to you before? . I checked both files and they have version 4.1.2.  Same error occurred when I ran the bump command.  Think the Node dependencies are out of date.. I updated the dependencies to their latest version and ran the patch command, but same error occurred.  This could be a bug in the bump.js file.  It updates the version in package.json, but not in utils.py.  Also, when you run \"gulp bump\", \"gulp bump-pkg-version\", or \"gulp bump-env-version\", the version doesn't change either.. Figured it out!  Definitely a bug in bump.js.  Will release a fix in a separate Pull Request, so it can be merged into develop with the new dependencies, and then I can make a release. :thumbsup:. @equinusocio Do I need to push the release to develop and merge it into master or just push from develop to master?. OK, does that mean I need to make another Pull Request before merging develop into master?. Cool thanks!  All set.. All set!  Thanks for the help! =)\n. @equinusocio Will remember that next time.  I think they need to be merged into master, so they're up to date with develop.  Anything else I'm missing?. @equinusocio Great, thank you!  Appreciate it =)\n. @equinusocio When you get a chance, let me know what you think.. @equinusocio No problem, thank you.  I will push the bump, changelog, and messages in a separate PR for the next release.. @equinusocio I tried generating the changelog, but got this as a result:\n\nDid you encounter a similar issue when running the changelog command?\n. @equinusocio OK all set.\n. @equinusocio OK all set.. @equinusocio You're welcome!  Just created the release with the recent changelog messages.  A new Sublime theme project sounds great!  Looking forward to it =)\n. @equinusocio I only know Python at a very basic level.. @simondell Check the Packages folder and see if pymdownx and pyyaml dependencies were installed.  Otherwise, restart Sublime and wait for Package Control to install them automatically;  may require a couple of restarts before it happens.\nIf the problem persists, please leave a comment in issue https://github.com/equinusocio/material-theme/issues/1229.. @equinusocio Thank you!  Just made the GitHub release =). ",
    "mallowigi": "It’s because they use a white title. Some colors like red, cyan, yellow... are rendered just fine, but our shade of gray/purple doesn’t enter in this category. \nA possible fix would be to change back to white, but it wouldn’t fit with the colors, and besides, it doesn’t happen to everyone. Can you do it anyway? I find it very offensive. Just say that you've switched to another editor and basta. It's okay to have your opinion but let the etiquette rule in open source communities. Otherwise you'll just sound like a douchebag and it sucks because you've made great projects and deserve to be treated as such.\nI've used Notepad++ in the past and nowadays it looks pretty pale in comparison to other editors, but I don't denigrate it anyway. It was a good choice in the past and I'm happy to have worked with it, and thanks for the fish. Same goes for Eclipse, Aptana, Visual Studio and Sublime.. The project is still ongoing. A new contributor is taking care of critical requests while the original contributor still manages the work and releases. The project is not dead, it's just that the original contributor moved on and so should you all.. ",
    "wbond": "Does this fix still work if all you comment out is the title bar rule that is triggered by a setting?. In sources/themes/commons/accent.json there is a title_bar rule that has settings. That means the rule will only be applied when a setting is true. I was just curious if the performance issue was somehow related to the rule being filtered by a setting.. ",
    "hanoii": "Just got to this issue.. I just moved to a new computer and while setting my stack up again I was looking to see what was new out there for Sublime. Found this theme ,really liked it and saw the deprecation note. I'll just say this:\nPlease come back :)?\nThings are still happening on their side..\nhttps://www.sublimetext.com/3dev\nI totally understand, and I am just coming from one appreciating your work, nothing else. I actually downloaded VCS only because on your note.. ",
    "simondell": "Is this the place to report that \n1) I never had this problem (not an issue in itself, but stated for context)\n2) now the problem is \"solved\", I have the problem.. ",
    "fiznool": "I believe this needs to be >=3114 as per this comment\n. ",
    "LucaColonnello": "Is this necessary? Can you just use a normal module.exports and require as global keywords or ES6 syntax as well?\n. I kinda like this because it's really explicit. Just wondering if can be more complex than this, cause if you remove the build file from tasks folder, this file shouldn't be aware of that (for a bit of decoupling).\n. No, I mean why you need a pathConfiguration function??\n. ",
    "KevinSjoberg": "I removed the <kbd> tags since they compressed and mangled the keyboard symbols. I can add them back if you'd like.. I removed the <kbd> tags since they compressed and mangled the keyboard symbols. I can add them back if you'd like.. No worries. 😃 . "
}