{
    "ermouth": "This error can be fixed fairly easy, but it won't make $.my work with jQuery 1.9.0 unfortunately. There is serious incompatibility between SugarJS and jQuery 1.9.0 – https://github.com/andrewplummer/Sugar/issues/265\nI think the issue will be fixed by both jQuery and Sugar. I will also fix some compatibility issues (as .msie of deprecated jQuery.browser) in 0.7.3.\nUntil it happens you can use this workaround:\nhtml\n<script src=\"/js/sugar-1.3.8.min.js\"></script>\n<script>delete String.prototype.namespace;</script>\n<!-- Method thay may crash jQuery deleted, now it's safe to load jQuery -->\n<script src=\"/js/jquery-1.9.0.js\"></script>\n<!-- We must load migrate to make $.my 0.7.2 work with $1.9.0 -->\n<script src=\"/js/jquery-migrate-1.0.0.js\"></script>\n. Fixed in 0.7.3\n. Thanks for your question, Camel. I think I need to update reference to accent how this works inside $.my functions.\n$.my apps intended to be more or less self-contained – to build systems were every app is a single json doc without (or with minimal set) of external dependencies. To ensure consistent runtime environment for every manifest fn, each init, bind, check, css, style and manifest function of given manifest receives manifest itself as this object.\nOut-of-syntax user functions, defined at a first level of given manifest tree, also are bound to the manifest via this when app starts.\nSo nearly any fn called inside manifest is bound to manifest itself – you may think about manifest as if it‘s a sort of class definition. \nTo fix you particular case you can write this.validator.checkNotEmpty.bind(this) in the manifest – it binds function to this explicitly. I think it can help.\nThanks again for you deep-level question!\n. For question №1 – there are several approaches to achieve this kind of behavior.\n1. You can explicitly define a set of events $.my listens for the control. For example events:\"blur.my\" set for <textarea> ensures that validator fires after field left focus. It sometimes means that user finished with this field.\n2.  You can do it right in the way you do it now – but keeping allowEmptyField as property of manifest instance. So you check function is able to set/retrieve its value from this.allowEmptyField during runtime.\n3. You can use regexps like /^(|\\d{3,5})$/ – it allows 3-5 digits, but stays dumb if string is empty. In this case you can make additional proxy <div> that watches all your fields (watch:\"#f1,#f2,f3\") and tells user something like ‘You must write something in fields F1, F2, F3’.\n. Good point, thanks.\n. Fixed.\n. > disconnect yourself from this library (maybe use underscore?)\nUndescore is a) more fat, b) less fast in several cases, c) will produce less readable code, d) need retirement or thorough re-testing of all existing code my clients use. \nSo do not think its possible right now.\n. http://jquerymy.com/api.html#CW-runtime-co\n$form.my(\"remove\") \n. Good point although, I must mention form disband in more clear way.\n. Please provide code or better explanation what exactly you are doing and where you think you loose data.\n. Manifests passed as folded JSON never see local scope, only global. So they see window and all its members – but do not see local scopes.\nMain consideration is safety. Since we have $.my.cache() that unfold manifest before caching, we must guarantee, that no code is executed while caching. So $.my does not use eval, it use new Function constructor, that is always executed in global scope (to be precise – without any scope).\nTo add local scope to manifest instance use this pattern:\n- put folded manifest to cache (it must have .id property)\n- when manifest needed, get it from cache – you‘ll receive unfolded clone – and augment/decorate it with functions, that can return all required data from local scope. \nOr you can just mount your data directly to manifest before you start it. \n. http://cloudwall.me/etc/json-editor.html – its recursive.\nIt can open self manifest – see left column list. Then you can go to .$multi branch and see keys of its .ui section members. They look like .ilist:eq(0) – that is valid jquery selector.\nPlease note – this approach implies huge perfomance penalties, this kind of selectors is rather slow, so be cautious. In less general cases #id selectors work quite fine since $obj.find(\"#id\") finds only first child of #id. To find all you must use something like div#id.\nAbout bubbling. $.my binds event listeners to controls (not to form) explicitly when starts. It was made to have acceptable perfomance. Since we have to determine what kind of control emitted event – most of them has different internal getters/setters syntax – we better do it once at start, it‘s quiet consuming task.\n. И да, можно по-русски )\n. > This is a bit un-intuitive and it should be mentioned in docs at some place.\nIt is mentioned – http://jquerymy.com/api.html#CW-repeated-c. Please, use API reference at the project‘s site, not Github version. Github version is not full – it‘s rather hard to maintain all three versions of docs, especially taking in account Github does not allow code snippets. Thats why I specially pointed at the start of Github one, that there exist more detailed API ref.\nBoth what and where are optional. 1e6 is position where to insert, large nums insert at the end of list.\n\nFirst of all thank you for this awesome library. \n\nThank you )\n. To add – you can insert section using jQuery syntax, see http://jquerymy.com/api.html#CW-controls-c\n. Just read Wiki about sparse array – definition is surely bit confusing. Sparse array for JS is an array, where some indexes has no value (undefined). Like:\njavascript\nvar a = []; a[0] = 1; a[100]=2;\nI‘ll improve manual to make it more clear, thanks for pointing it out. Is formulae Each member of an array must be an object, and it‘s a good practice to make each member unique is more clear?\nAlso I gonna describe .where property more precisely.\n\nif you do not specify what to insert, then nothing is inserted\n\nAlso good point. In fact in this case $.my inserts .data section of a default child manifest, if any.\n\nIs there any mailing list or official forum [for cloudwall]?\n\nNo, not yet. It‘s not so popular ) In fact, I do not want to propagate cloudwall widely right now. Reason is default underlying low-level storage (IDB) is full of bugs in Chrome. Moreover, guys from Chrome add new bugs in literally every major release. Yes, they fix old bugs – but add new ones ((( It sometimes cause severe errors and even attachments loss if you are not synced with remote CouchDB.\nSo I just don‘t want to be responsible for Google bugs.\nSurely, guys from PouchDB (lib inside cloudwall that converts IDB to more robust and syncable storage) fight with Chrome IDB bugs more or less successfully. Nevertheless I do not want to propagate software, that can accidentally discard user‘s data after browser update. Hate Chrome and IDB for this, especially taking in account IDB is born inside Google.\nIn fact, cloudwall.me is much more reliable (and sometimes more fast!) in Safari+WebSQL on iPad for example, then in Chrome+IDB.\nSo please, be patient. I see growing pressure on Chrome team from community, so I think they‘ll be more inspective testing IDB before releasing new versions of Chrome.\n\nI'm not native English\n\nI‘m also not.\n. > Yes, it inserts it first time, until you click it again. Then nothing happens.\nBecause you‘re trying to create a full duplicate – $.my can not distinguish duplicates and assume it‘s a single item. If you modify already inserted item somehow and then insert new one – it must appear.\nGood approach is to add something like id property into child section and put Date.now() into it to guarantee you have no dups even if you did not modified item.\n\nAnd is there any mailing list or something similar for jquerymy?\n\nNo, sorry, and I do not plan to. Feel free to raise new issues here, but please label them as question if it‘s a question. \n. In general, modal is a promise. It is:\n- resolved when modal closes normally (some control inside triggers event \"commit\")\n- rejected when modal is escaped (closed by X button, or Esc, or triggering event \"cancel\" from inside, or you clicked screen dimmer if any).\nRoot form does not catch modal close, you must let root know explicitly that it must redraw. It‘s intentional behavior. So in your case, when your modal mutates data object of parent form directly it can be something like this:\njavascript\n$ctrl.modal({\n  /*modal params here*/\n}).then(function(modalData){\n  // Here goes code for normal close\n  $ctrl.my().root.my(\"redraw\");\n}).fail(function(){\n  // Here goes code for escaped close\n  $ctrl.my().root.my(\"redraw\");\n});\nIf you provided modal with cloned data (that is more suitable in most cases), you must apply data, received from the modal, to a caller form – and then redraw entire caller.\n\nI only have to use \"text\" (for example) as identifier inside a repeated section, and it is magically bind to the correct item\n\nDid not understand a question. Show the code excerpt, please.\n. Fixed in https://github.com/ermouth/jQuery.my/releases/tag/v1.1.6\n. Also found bug in _normalize. Fixed in 1.1.7\n. Please, read https://github.com/ermouth/jQuery.my#setup and add all dependencies to your page.\n. You are right, Sugar 2.0 is not supported. \nNumber of never announced changes in new Sugar API is enormous https://github.com/andrewplummer/Sugar/blob/2.0.0/CAUTION.md – and gain all those renames give is actually ridiculously small. Sugar 2.0 is just completely other lib, incompatible with 1.4 branch both in general and in details.\nI don‘t like it and will remove this dependency in future versions.\nSo, right now – please, use Sugar 1.4.1.\n. Surely it‘s possible.\n. You can‘t use HTML data attributes as both DOM selectors and data pointers. Although you can try to generate manifest on the fly after page load.\nInit function can take your div, parse it and dynamically generate child manifest, that will then be bound as a child form.\nTo notice, your approach looks extremely cryptic.\n. > does a child form take a performance hit\nChild forms are highly optimized, so it‘s insignificant, nearly zero.\nBTW, there‘s a proof of concept, what can be done using $.my for extreme content editing, see http://inliner.cloudwall.me/ddlab/_inliner#144184061501ff0vgzjf. Hope it can help in some way.\n. Oh, to add. You can set params:{strict:true} for child manifest you generate using init, to skip unjson traverser. It can give you millisecond or two during child form initialization.\n. First, nice to see you use id function.\nFor the question, there are three different approaches.\n1/ You are in the DOM, so you can, using jQuery syntax, just check if your child form is the last in its parent container. It‘s not “academically” clear, but quiet effective.\n2/ You can have a function inside each child form, that have acces to top levels. This approach is more general.\njavascript\n{\n  data:{  listElts:[ /*elements of a list*/] },\n  ChildFormManifest:{/* here goes child form manifest*/},\n  GetRootList: function(){ return this.data.listElts},\n  ui:{\n    \"#list\":{\n      data:\"listElts\",\n      manifest: function(){\n        return $.extend(true, {}, this.ChildFormManifest, {GetRootList: this.GetRootList});\n      }\n    }\n  }\n}\n3/ Third approach is very similar to second, but you extend child manifest on lis init, that is faster, but less flexible. Kinda static binding.\njavascript\n{\n  data:{  listElts:[ /*elements of a list*/] },\n  ChildFormManifest:{/* here goes child form manifest*/},\n  GetRootList: function(){ return this.data.listElts },\n  ui:{\n    \"#list\":{\n      init: function (){ this.ChildFormManifest.GetRootList = this.GetRootList },\n      data:\"listElts\",\n      manifest: \"this.ChildFormManifest\"\n    }\n  }\n}\nSo for 2 and 3 you have this.GetRootList() function inside each child‘s form, which returns entire array with data. Comapring child form‘s data with this.GetRootList().last() using ===, you detect, if your child form is last in the list.\n. > the items do not get re-rendered\nYou mean rows are not deleted/inserted, or what? If one row has not changed, why should it re-render?\n. Do you use .hash function? It can be useful for your case, I hope.\nIt is used to indicate element has changed. Make it return different values if list length changed – and you will get total list re-render on add/remove, or it can depend on other events, or parent form state, or whatever.\nBy default, when you have not defined it explicitly, built-in hash function only changes when child form contents changed, it does not know anything about outside world. So make it know.\nThis default approach was chosen to avoid total list re-render on every single row changed/removed/added, that is surely ineffective for long lists.\nYou can also skip defining .hash and make .id function do the same – return value, dependent on list length – but this is less effective for several reasons and undesirable, if do not understand clearly, what you‘re doing.\nSee this example http://jquerymy.com/#CW-masterdeta – here you can drag items and see how numbers are changing during drag both in master and detail. It‘s much more tricky, but it‘s the shortset implementation of this kind of functionality I ever seen. So it can help you to go deep into things.\n. Hi!\n$.my have own implementation of modal dlg onboard, and $.my implementation utilizes same namespace. See http://jquerymy.com/ru/api.html#CW-header39 for details.\nTo avoid naming conflict, you can remove modal functionality from jquerymy.js. Modal is a separate plugin inside, it starts from the line 3445. \nDeleting modal plugin from jquerymy.js does not affect $.my itself.\n. Reopen to fix. Gonna a) make $.my detect BT on load, b) if BT present, let jQuery.my .modal() guess if params received are Bootstrap-related and pass request through in this case. \n. > please help\nHelp to do what?\n. Seems to work fine if you create it using conventional SELECT, not a bunch of divs. Can you provide a code to reproduce your case?\n. Well, I see. It‘s indeed a bug. Will fix in 1.2.1 quiet soon, thank for pointing out.\n. As a quick fix you can try to add return $o.val()||[]; right after line 424 with } of jquerymy.js. Hope it fix an issue at least in your particular case.\n. Reopen as a bug to fix into 1.2.1\nInvalid behavior for select[multiple], does not allow to uncheck last elt in the list and make list empty. Takes place due to $('').val() returns null, not []\n. Fixed in 1.2.1\n. Closed in 1.2.1\n. Fixed in 1.2.2.\n. Happens when .check function result does not cast to false and is not String. Takes place not only for SELECT.\n. Fixed in 1.2.3\n. General approach of $.my is \n1. to simplify coding everyday UI cases, \n2. although keeping thing somehow flexible using declarative markup like events:[evtList], \n3. however allowing maximum flexibility using good old fashoined js code.\nSo as for your case – put custom bindings into init function, placed inside appropriate ui section. Like:\njavascript\nui:{\n  '#ctrl':{\n    init: function ($ctrl) {\n      var that = this;\n      $ctrl.on ('somevent.my', function (evt){\n         // Set some filed in data to 1;\n         that.data.doc.otherField = 1;\n         // Trigger recalc on some other control\n         that.my.trigger ('#someOtherCtrl', 'recalc');\n      });\n    },\n    bind:'doc.field'\n  }\n}\nHere your control reacts by default and puts/gets its value into doc.field when default event happens, although on custom event control does something completely different.\nNote, that syntax somevent.my with .my namespace guarantees your handler will be automatically unbound on form destroy.\n. Thanks for proposal. Can you please explain what exactly adding aria-related markup gives? \nAnd seems that you‘re modifying minified js. Why not edit full version?\n. > Very important for forms.\nWell, ARIA codes are just declarations, that are invisible and has no default action for the vast majority of users – so I wouldn‘t say ARIA compliance is important.\nHowever, according to BuiltWith, wai-aria popularity is slowly increasing. Also, surprisingly, adding aria-attributes to DOM elts is enough CPU cheap (it was not so 2 years ago, when I first tested it). \nSo I plan to explore how those attrs interfere with rich ui plugins, and, if no conflict discovered, add some aria-related stuff in 1.3.\nThanks for proposal )\n. @dubrod AFAIK in USA the requirement only applies to gov-related structures. And, to say, even root sites of gov agencies mostly do not comply, even health-related (NIH, HRSA, CDC, FDA).\n@johs I know that Norway a11y legislation is most stringent in the world. Despite this fact only 4 sites from Alexa top-10 for .no domain have more or less acceptable aria codes inside. 3 has superficial imitation and 3 has no aria at all.\nAs for Russia, we also have the quite strict law, that obliges to have special versions of gov-related sites for vision-impaired people. As for me, this approach (special websites) is much more reasonable, since we can apply special high-contrast CSS, simplified layout and cursor/action highlighting. This approach seems more helpful for real people with impaired vision, than aria codes, that are both awfully designed and poorly supported by end-user devices.\n. Will add some ARIA-related features to 1.3, seems that aria codes produce no conflicts for $.my supported rich ui plugins.\nClosing, thanks @dubrod and @johs. \n. Fixed in 1.2.5\n. Takes place in Chrome cause V8 reflector behaves in a strange way, and this behavior seems to vary from version to version:\n(new Function('a','return a')).toString() -->\n\"function anonymous(a\n/**/) {\nreturn a\n}\"\nbut\n(function(a){return a}).toString() -->\n\"function (a){return a}\"\n. Fixed in 1.2.5\n. Well, this support is reasonable in theory, but in practice... how do you see it?\ninput[type=datetime] is not supported by browsers, so how can I test it? Also this type of INPUT controls removed from HTML5 standard.\nAlthough input[type=datetime-local] is supported by Opera and Chrome, and is in HTML 5.1 draft, implementation is awful. \nFor example, go here http://www.w3schools.com/html/tryit.asp?filename=tryhtml_input_datetime-local, set date and time, select control in devtool Elements view, and then check actual value of the control using $0.valueAsNumber.\nYou will be surprised, that control actually does not take in account your locale and sets value in GMT.\nAny suggestions?\n. Good point. Will test approach for 2.x and if everything is ok, put it into 1.2.7.\nThank you.\n. Applied.\n. If I understood correctly, you pass an array as a data source. Root data source must be an object, arrays are only allowed as branches for several reasons.\n. Can you please clarify the question, without using something has X, where X is here?\n. So you need to recalculate a field when other fields change, right?\nPlease read http://jquerymy.com/api.html#CW-dependenci\n. Nice!\nCan you please provide entire resulting config or whatever to help respond future questions of this kind? I have nearly zero experience with webpack, any information is valuable.\nThanks )\n. You made perfect work, thanks!\n\nI still encountered #13 . The only way I found around this was to\n\nI will look into it more deeply.\n. Your bind functions never store received value into data.id. You should write in this way:\njavascript\nfunction(data, value) {\n  if(value != null) data.id = value;\n  return data.id;\n}\n. I run code below at jquerymy.com, replacing Bezier curve demo. All works pretty fine (I hardcoded RATES somehow) in env of jQuery 2.x.\nhttp://jquerymy.com/index2.html has jQuery 3.x, and code also works pretty fine.\nThe only difference I see is that I have jquery migrate.\n`` javascript\n({\n    data : {id: 18},\n    init: function($form) {     $form.html(this.HTML); },\n    ui: {\n        \"#uk\": {\n            init: function ($component) {\n                $component.html(this.RATES\n                .reduce((prev, next) => prev + '<option value=\"' + next.id + '\">' + next.uk + '</option>', ''));\n                $component.select2({\n                    placeholder: \"UK\"\n                });\n            },\n            bind: function(data, value) {\n                if(value != null) data.id = value;\n                return data.id;\n            },\n            recalc: \"#eu, #usa\",\n            recalcDepth: 1\n        },\n        \"#eu\": {\n            init: function ($component) {\n                $component.html(this.RATES\n                .reduce((prev, next) => prev + '<option value=\"' + next.id + '\">' + next.eu + '</option>', ''));\n                $component.select2({\n                    placeholder: \"EU\"\n                });\n            },\n            bind: function(data, value) {\n                if(value != null) data.id = value;\n                return data.id;\n            },\n            recalc: \"#usa, #uk\",\n            recalcDepth: 1\n        },\n        \"#usa\": {\n            init: function ($component) {\n                $component.html(this.RATES\n                .reduce((prev, next) => prev + '<option value=\"' + next.id + '\">' + next.usa + '</option>', ''));\n                $component.select2({\n                    placeholder: \"USA\"\n                });\n            },\n            bind: function(data, value) {\n                if(value != null) data.id = value;\n                return data.id;\n            },\n            recalc: \"#uk, #eu\",\n            recalcDepth: 1\n        }\n    },\n    HTML:[\n\n\n\n\n\n\n\n\n\n`\n        ],\nRATES: [\n    {id:18,eu:11,usa:12,uk:13},\n    {id:70,eu:71,usa:72,uk:73},\n    {id:30,eu:31,usa:32,uk:33}\n]\n\n})\n```\n. Ah, please use latest Select2 of 3.x branch https://github.com/select2/select2/releases/tag/3.5.4. \nBranch 4.x is still bit unstable, so I have not adapt $.my for it yet.\n. $.my does not process Enter or other keyboard events in special way, so it seems that reason is outside $.my.\nYou can easily check it changing input to textarea in the Page Layout example at jquerymy.com – all works perfect.\nSo, please, provide more details or a code sample to look into issue more deeply.\n. Fixed in 1.2.8\n. Sorry, I can‘t read chinese.\n. 1. Please, use latest jquerymy.js, that is 1.2.7\n2. Read http://jquerymy.com/api.html#CW-quick-star and make sure you have Sugar.js 1.4.1 loaded.\nComments in issues https://github.com/ermouth/jQuery.my/issues/13 and https://github.com/ermouth/jQuery.my/issues/31 might be helpful.\n. Fixed in 1.2.10. Can‘t reproduce, works as expected. Can you please provide more info (browser, $.my version, $ version and some testable code)?. Closing as not confirmed. Actually they are read normally. If they are not, you probably changed events list for a control so it does not track input and change events, which are vital for that kind of tracking.\nAlso there exist Chrome plugins, often of malicious nature, that block propagation of those events. Hope it‘s not your case.\nIf you think there is another reason, please provide more detailed info: browser ver, platform, type of controls you feel are failing and so on. Best way is to provide a gist with a code snippet.. > to return the error message on the function itself\nRight. However, good catch. I‘ll rethink check fn behavior for returning non-strings with error present. . I can’t locate anything like regexp from screenshot in jquerymy code, so the root issue is definitely outside jquerymy. \nSince isS definition is clearly inside jquerymy, and it’a a shortcut for Object.isString() from Sugar, I think sugar.js failed to initialize, but Sugar also have nothing like that regexp inside.\nThe regexp is not only invalid, but very strange looking, so I think web server you use sends at least sugar.js with invalid encoding (mb 8859 instead of UTF-8), or invalid mime type (text/plain instead of text/javascript), or both. Please, check it out.\nAlso encoding tricks in regexp may appear due to very special combination of params of some js compressors/transformers, however it‘s much less likely.. @TBRickYoung please, let me know if you was able to solve the issue.. In short, you should make repeated child form list and bind it to an array, see http://jquerymy.com/api.html#CW-repeated-c. If you want some kind of total field, make it watch your entire list and update on list update.\nSmth like:\njavascript\n({\n  init:'<div id=\"rows\"></div><div id=\"total\"></div>',\n  data:{rows:[{value:1}, {value:2}, {value:3}], total:0},\n  ui:{\n    '#rows':{\n      bind:'rows',\n      list:'<div><input type=\"number\" class=\"row\"></div>',\n      manifest:{\n        ui:{\n          '.row':'value'\n        }\n      }\n    },\n    '#total':{\n      bind:function(d){\n        return d.rows.map(function(elt){return +elt.num}).sum();\n      },\n      watch:'#rows'\n    }\n  }\n})\nClosing issue.. Thank you ). Good point, I’ll add both types on weekend.. > listen to changes\nActually you are listening to the change event, which is not fired this case. It is only fired on direct user interactions, according to https://developer.mozilla.org/en-US/docs/Web/Events/change.\nSo to track changes from both fields you better add third field, say, <div id=\"alerter\"></div>, and use it as a collector, which may call external code. Please note it will be activated multiple times.\n{\n  \"#name\": {\n    bind: \"name\", \n    watch: \"#name2\"\n  },\n  \"#name2\": {\n    bind: \"name\", \n    watch: \"#name\"\n  },\n  '#alerter':{\n    bind: function(d,v){\n      if(v==null) console.log('Name is '+d.name)\n    },\n    watch:['#name','#name2']\n  }\n}\nHope it helps.. ",
    "camelaissani": "I had guessed your answer ;-)\nThank you for your help\n. ",
    "tmikaeld": "Darn it, i searched every page for destroy when i should have looked for remove ;-)\nThanks!\n. That would be nice, other than this i love your documentation and samples. \nBefore this i have been avoiding two-way binding, but the way you are explaining it and doing it is very very sexy - and it melts like butter into my current project code!\n. I'm loading the manifest from JSON, it's been encoded with $.my.tojson(manifest) and it works fine, but the var itemID variable that i declare before manifest is invisible to the itemID i have declared in the manifest code. Is the manifest code running in a different namespace?\n```\nvar itemID = \"something\";\nvar manifest = manifestJson;\n// Init $.my\n$('.editForm').my(manifest, person);\n```\n. Ah, child form - that solves it completely!\nI'm basically using jQuery.my to edit page content, maybe that is why it looks cryptic?\n. By the way, does a child form take a performance hit? \nCompared to cloudwall.me manifest, mine are tiny so shouldn't be a problem in any case.\n. Really nice inline editor! I like the idea.\nWhat i initially started with is blocks of custom server-rendered content, each block have a content editing form that uses jQuery.my for the live-editing and loading from JSON database. Works great! \nBut some blocks have really bad performance especially on re-rendering from the server, so the new approach is to edit only smaller parts (like in this case the header) upon clicking on it. This solved the performance and re-rendering-time issue.\nThanks for the tip, will do some tests with this and see how it works.\nBy the way, i see no way to donate to jQuery.my's development?\n. Thanks for the offert to help with specific issues, i will get back to you on that if i get into issues.\nI don't really like to bother maintainers with these questions, but when it's such a specific system there really is no other place to ask.\nI understand what you mean with donating to OSS projects, i often check if the project have a company backing it and if they do - i donate the spare money to the smaller ones without company backing first.\nWhen/if i can afford to hire a full-time developer to work on this \"app\" I'm making, then I'll contribute to the development of jQuery.my by submitting potential new features, fixes, code. I think that's the best way to give back to any OSS project, to contribute to it's development.\n. ",
    "danielo515": "oK, I found the solution.\nYou have to pass the insert method an object, indicating what to insert, and optionally where. To be honest I'm not sure what properties are mandatory and what parts are not. Can I provide just the where property?\nFor those interesthed, this is how the call sholud look like:\n.trigger (\"insert\",{ what:{name:\"Col\"+data.columns.length},where:1e6});\nThis is a bit un-intuitive and it should be mentioned in docs at some place.\nPD: What the hell 1e6 means?\nRegards\n. Hello @ermouth \nI was reading the docs page of jquerymy.com. And I read that section. But there is no clear reference on it about the fact that if you do not specify what to insert, then nothing is inserted. The only thing that makes you think that is this sentence .\n\nSparse arrays are not supported, so {where:1e6} inserts row at the end of the list.\n\nI did not know what sparse arrays are, so I searched it. Sparse arrays are arrays with identical values appearing more than once, so I guess that if you try to insert an empty object and there is already one, then you are not allowed to insert it. Please correct me if I'm wrong. The problem is that, if you don't understand that term (I'm not native English), you will not even think that it is the key of your problem.\nI also want to thank and congratulate you for cloudwall, another awesome piece of software. It reminds me (in some way) to tiddlywiki. Is there any mailing list or official forum? (sorry for hijacking this ticket, but I did not want to open another one just for this)\nThank you.\n. > var a = []; a[0] = 1; a[100]=2;\n\nI‘ll improve manual to make it more clear, thanks for pointing it out. Is formulae Each member of an array must be an object, and it‘s a good practice to make each member unique is more clear?\n\nYes, it is more clear. Thank you very much.\n\nAlso I gonna describe .where property more precisely.\n\nGood idea\n\nif you do not specify what to insert, then nothing is inserted\n\nAlso good point. In fact in this case $.my inserts .data section of a default child manifest, if any.\nYes, it inserts it first time, until you click it again. Then nothing happens.\n\n\nNow I'm feel lucky of using cloudwall in Firefox!!!\nAnd is there any  mailing list or something similar for jquerymy? I'm experiencing some problems with modals and I would love to ask about it.\n. ",
    "ArminVieweg": "This error also occures with sugar.js 2.0. So just 1.4 is supported, yet.\n. ",
    "maxdlx": "Hi,\nthx for your input! \nI have thought about the different ways to solve it. My solution was just like your 2) using GetContent() function on the parent and comparing the index in my 'id' function.\n                id: function(e, i) {\n                    e.idx = i+1;\n                    e.firstChild = i === 0;\n                    e.lastChild = i === this.getContent().length - 1;\n                    return 'c3-q-' + e.idx;\n                },\nIt works, but...\nWhen the \"Add row\" button triggers an 'insert' event on the list, or a row is deleted, the items do not get re-rendered. Same problem with the other approaches. The only solution would be to hack everything into a single callback and recalculate the list items on every insert/removal.\nHow do you solve this issue? Have you come across this in the past?\n. The new items are re-rendered, but the rest of the list does not notice the change. The previous \"lastChild\" still has the \"lastChild\" attribute, and I don't know how to propagate the event to all list items\n. Thanks for the hint to 'hash' function when list length changes, I will try that!\nBest regards\nChris\n. ",
    "tallesdantas": "how can i use the multiple select of semantic ui http://semantic-ui.com/modules/dropdown.html with it?, its like bottstrap ,if i use $ctrl.select2({});  it glitchs the layout\n. i've tyed to use select too , but when i add a value and cancell it it holds the last one , becouse the default \"select multiple(html pure)\" aways holds a value, try add multiple values then cancell eatch one.\n. thanks, btw nice plugin it's mutch better than downloading a whole library like knowcout, makes me easyer  to program, as soon as you fix it please tellme =D\n. Works like a charm , thanks =D\n. ",
    "dubrod": "i wish i could say that was the solution but i didnt really understand it. \nIt was helpful though\nIt did cause me to rethink the manual trigger i put in. \nI had it looking to the parent b/c the parent had a \"manifest ID\" i think you call it. but looking at the init you are placing on #ID i re-triggered the keydown for it. \nso...\n.... if (e.keyCode == 13) {\nvar target = $(this).children(\"#id\");\ntarget.trigger(\"click\");\n}\nand it loads the form just like a click.\n. ARIA elements are essential for accessibility compliant code.\nhttps://www.w3.org/TR/wai-aria/states_and_properties\nVery important for forms. \nJust realized the minified thing lol \n. In USA, if your a company that provides a Public Service it is required also. I spend a lot of time now testing and developing for Section 508 and WCAG - https://www.w3.org/WAI/WCAG20/glance/\n. wrong\n. ",
    "johs": "Hi,\na small comment on ARIA: In Norway accessibility to web sites is now mandatory by law. It basically means ARIA is a standard request.\njohs\n\nOn 29 Mar 2016, at 21:15, ermouth notifications@github.com wrote:\nVery important for forms.\nWell, ARIA codes are just declarations, that are invisible and has no default action for the vast majority of users – so I wouldn‘t say ARIA compliance is important.\nHowever, according to BuiltWith, wai-aria popularity is slowly increasing. Also, surprisingly, adding aria-attributes to DOM elts is enough CPU cheap (it was not so 2 years ago, when I first tested it).\nSo I plan to explore how those attrs interfere with rich ui plugins, and, if no conflict discovered, add some aria-related stuff in 1.3.\nThanks for proposal )\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly or view it on GitHub https://github.com/ermouth/jQuery.my/issues/23#issuecomment-203059267\n. \n",
    "libook": "Sorry for late response.\n\nThe type 'datetime' has been removed from the HTML standard, so never mind it.\nAlthough the type 'datetime-local' is new, it works fine on my browsers, even though on windows.\nSo maybe it is the time for adding it?\n\n\nYou will be surprised, that control actually does not take in account your locale and sets value in GMT.\n\nI didn't understand  this paragraph.\n\n\nThe input element with a type attribute whose value is \"datetime-local\" represents a control for setting the element’s value to a string representing a local date and time (with no timezone information).\n\nSource\nAccording to my understanding, the type 'datetime-local' means 'Nothing to do with time zone'.\nSo the input element with 'datetime-local' type will not do any processing with time zone.\nIn other words, If I input the time which is from my watch, the value of the input will be the same with my inputting.\nFor example,\nif I input '2016/01/02 05:22 pm', the 'valueAsNumber' will be 1451755320000 and the 'value' will be \"2016-01-02T17:22\".\nThe timestamp 1451755320000 is just 2016-01-02 17:22 with no time zone information.\nIf I want to process datetime with time zone, I must do time zone converting between the value of input element and my Date object.\nApologize if I misunderstand your comment.\n. ",
    "majorebola": "Exactly.\nOk. I was thinking I missed smth. \nTY very much \n. ",
    "BCleverly": "In my form i need a progress tracker, I've got the total count sorted. it's the progression I'm struggling with.\nso in data i have two properties called total and progress.\nEvery time someone answers a question I need progress to increment by one, if they delete and answer, it decrements by one. So progress needs to be calculated every time a binding is updated or a property in the dataset is updated. \nHere's a link to some functionality VueJs has VueJs Computed Properties which may explain it better. \nI've just tried added a function to the data property to see if I can do it that way, but I can't seem to get it work dynamically at the moment.\n. That seems to be what I was looking for. \nThanks for pointing in the right direction.\n. ",
    "SijanC147": "I was actually misusing the expose-loader, removing the plugins block from my webpack config and appending, \njavascript\n            {\n                test: require.resolve('jquery'),\n                loaders: ['expose?$', 'expose?jQuery']\n            },\nsolved this issue. \n. yeah for sure man, in full disclosure i'm also just starting out with webpack so while this setup does work, I can't guarantee that it is the best, or recommended, approach. \nThe following is using\n- webpack 2.1.0-beta.21\n- jquery 3.1.0\n- jquerymy 1.2.7 \nas far as the config goes, (and from what I gather this applies to a large portion of jQuery plugins), assuming you have webpack setup in your project directory, you'll need the expose-loader, \njavascript\nnpm i expose-loader -D\nthe rest of the configuration is unimportant, save for the part I mentioned before, as described on the expose-loader github page, you'll need to add the specific loader test (tells webpack when to use the loader) \njavascript\n//webpack.config.js\nmodule.exports = { \n    ....\n    module: {\n        loaders: [ \n            ....\n            {\n                test: require.resolve('jquery'), //use this loader for jquery plugin\n                loaders: ['expose?$', 'expose?jQuery'] //expose this jquery to the global '$' and 'jQuery' vars.\n            },\n            ....\n        ]\n    }\n    ....\n};\nThat took care of all jqeury issues in my case. \nHowever, I will also mention that even though node installed the recommended version of sugar (1.4.1) I still encountered #13 . The only way I found around this was to  \njavascript\nimport 'sugar';  // require('sugar'); if not using ES6\nIn my main entry point, before any of my other imports/requires, this will resolve to the version of sugar installed automatically by npm when installing jquerymy. Webpack usually takes care of this stuff, I might have missed something, but anyways, this worked. \nIf anyone with further insight into webpack has anything to share, please do, and I hope this helps someone in the future. \n. Still getting the same result, values are updated, and the right value is highlighted in the selection box when I click on the selector, but the views of the selection boxes remain the same.\n. Yep, that did the trick! Unfortunately the latest version available through npm is v3.5.1, but seems to work great. \nApologies for not having posted the RATES variable before. \nCheers. \n. ",
    "w1tebear": "Thank you for your prompt response. This is indeed NOT a problem with $.my but a problem with my own bind function. I apologize for having troubled you.\n. ",
    "silentw": "Now, seeing the README on github I understood this function. You are supposed to return the error message on the function itself.\nreturn !/^\\S{3}.*$/i.test(value) ? '3+ chars please' : '';. ",
    "TBRickYoung": "Yes, I was able to. It was document type. I had to down load the js and run it through a couple tools to get it to work. But I do have a question for you. We would like to have a class name that will attach to everything with that class name like .product-qty but we had to set one for each class like .product-qty-0 and .product-qty-1. With the .my handle arrays like jQuery for classes?\nHere is what we did to bind the product qty input to the price-set which then watches for both product-qty-0 and product-qty-1 this works but we have pages where we want to have lots of dynamic product-qty which will goto the price-set function.\n$(\".productPrice\").my({\n    ui:{\n        \".product-qty-0\": {\n            bind: function(data, value, $control){\n            // check to see if the value is a number only\n            var regExp = /^\\d*$/;\n            var productQty = $control.val();\n\n            var maxQty = dataStore.products[0].maximumQuantity;\n            var minQty = 1;\n\n            if(dataStore.page.productType == \"lawn\") {\n                maxQty = 99;\n                // set error message text to 99\n                $(\".max-qty\").text(maxQty);\n            }\n            if (value){\n\n                if (regExp.test(value)) {\n                    if (productQty < minQty) {\n                        productData[0].price.qty = minQty;\n                        $control.val(minQty);\n                    }else if (productQty > maxQty){\n                        productData[0].price.qty = maxQty;\n                        $control.val(maxQty);\n                    }else{\n                        productData[0].price.qty = productQty;\n                        $control.val(productQty);\n                    }\n                }else{\n                    productData[0].price.qty = minQty;\n                    $control.val(minQty);\n                }\n            }\n\n        },\n        events: \"keyup.my\"\n    },\n    \".product-qty-1\": {\n        bind: function(data, value, $control){\n\n            // check to see if the value is a number only\n            var regExp = /^\\d*$/;\n            var productQty = $control.val();\n\n            var maxQty = dataStore.products[1].maximumQuantity;\n            var minQty = 1;\n\n            if(dataStore.page.productType == \"lawn\") {\n                maxQty = 99;\n                // set error message text to 99\n                $(\".max-qty\").text(maxQty);\n            }\n\n            if (value){\n\n                if (regExp.test(value)) {\n                    if (regExp.test(value)) {\n                        if (productQty < minQty) {\n                            productData[1].price.qty = minQty;\n                            $control.val(minQty);\n                        }else if (productQty > maxQty){\n                            productData[1].price.qty = maxQty;\n                            $control.val(maxQty);\n                        }else{\n                            productData[1].price.qty = productQty;\n                            $control.val(productQty);\n                        }\n                    }\n                }else {\n                    productData[1].price.qty = minQty;\n                    $control.val(minQty);\n                }\n            }\n\n        },\n        events: \"keyup.my\"\n    },\n    \".price-set\": {\n        bind: function(data, value, $control) {\n\n            var totalQty = 0;\n            if (pageData.isStaggered) {\n                totalQty = parseInt(productData[0].price.qty) + parseInt(productData[1].price.qty);\n                console.log(\"productData[0].price.qty=\"+productData[0].price.qty+\"  |  productData[1].price.qty=\"+productData[1].price.qty+\"  |  $control.val()=\"+$control.val());\n\n            }else{\n                totalQty = parseInt(productData[0].price.qty);\n                console.log(\"productData[0].price.qty=\"+productData[0].price.qty+\"  |  $control.val()=\"+$control.val());\n\n            }\n\n            //This is where we update the text field with the appropriate total items and pricing for the .price-set element\n            __COMPONENT_UID__.pricingPanel.updateProductPrice();\n\n            // Check qty to disable/enable button\n            __COMPONENT_UID__.pricingPanel.validateQty(totalQty);\n\n            // Check to see if MIR avaiable based on Qty\n            __COMPONENT_UID__.pricingPanel.updateMIR(totalQty);\n\n        },\n        watch: \".product-qty-0, .product-qty-1\"\n    }\n}\n\n}, productData);\nThanks!\nRick\nFrom: ermouth notifications@github.com<mailto:notifications@github.com>\nReply-To: \"ermouth/jQuery.my\" reply@reply.github.com<mailto:reply@reply.github.com>\nDate: Sunday, November 12, 2017 at 1:24 PM\nTo: \"ermouth/jQuery.my\" jQuery.my@noreply.github.com<mailto:jQuery.my@noreply.github.com>\nCc: Richard Young - TireBuyer RYoung@tirebuyer.com<mailto:RYoung@tirebuyer.com>, Mention mention@noreply.github.com<mailto:mention@noreply.github.com>\nSubject: Re: [ermouth/jQuery.my] isS is not a function (#43)\n@TBRickYounghttps://urldefense.proofpoint.com/v2/url?u=https-3A__github.com_tbrickyoung&d=DwMCaQ&c=XWbgA8ttvF3NJsjYBxUdHg&r=50xY7vscJPb5HhilXnWwQHUcndzDsLvjgOMsPsTMWcc&m=U_iMubWEguppFnOX9Yjsm_M3HdyYZhm2MKYxJ0C6CX0&s=sb5RxMhWkeX82iB7A39_fC64vb1shSY6HUx6713Pmzw&e= please, let me know if you was able to solve the issue.\n-\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHubhttps://urldefense.proofpoint.com/v2/url?u=https-3A__github.com_ermouth_jQuery.my_issues_43-23issuecomment-2D343764663&d=DwMCaQ&c=XWbgA8ttvF3NJsjYBxUdHg&r=50xY7vscJPb5HhilXnWwQHUcndzDsLvjgOMsPsTMWcc&m=U_iMubWEguppFnOX9Yjsm_M3HdyYZhm2MKYxJ0C6CX0&s=NOcKi0suWzCejbfiINPhHhSB2YdIVakpkKvjuJZoLDc&e=, or mute the threadhttps://urldefense.proofpoint.com/v2/url?u=https-3A__github.com_notifications_unsubscribe-2Dauth_ALRvAqQIAoiWw2F7IcfID62bL9ud0mcSks5s11QFgaJpZM4QNePb&d=DwMCaQ&c=XWbgA8ttvF3NJsjYBxUdHg&r=50xY7vscJPb5HhilXnWwQHUcndzDsLvjgOMsPsTMWcc&m=U_iMubWEguppFnOX9Yjsm_M3HdyYZhm2MKYxJ0C6CX0&s=5X6yyGubzUUbToEIDzrHn-duVg9zBS-gtbqNCBinJnM&e=.\n. OK, I will try that out. Thanks again for the fast response!\nRick\nFrom: ermouth notifications@github.com<mailto:notifications@github.com>\nReply-To: \"ermouth/jQuery.my\" reply@reply.github.com<mailto:reply@reply.github.com>\nDate: Sunday, November 12, 2017 at 3:33 PM\nTo: \"ermouth/jQuery.my\" jQuery.my@noreply.github.com<mailto:jQuery.my@noreply.github.com>\nCc: Richard Young - TireBuyer RYoung@tirebuyer.com<mailto:RYoung@tirebuyer.com>, Mention mention@noreply.github.com<mailto:mention@noreply.github.com>\nSubject: Re: [ermouth/jQuery.my] isS is not a function (#43)\nIn short, you should make repeated child form list and bind it to an array, see http://jquerymy.com/api.html#CW-repeated-chttps://urldefense.proofpoint.com/v2/url?u=http-3A__jquerymy.com_api.html-23CW-2Drepeated-2Dc&d=DwMFaQ&c=XWbgA8ttvF3NJsjYBxUdHg&r=50xY7vscJPb5HhilXnWwQHUcndzDsLvjgOMsPsTMWcc&m=_7bvCvrr9wXnNZihHsRiEQubTMU7qhTQpfoogB-57FA&s=4L3Uu6mRb0qU-UBHMOTF48Gpg89OnQvUW1j1wgLUMQw&e=. If you want some kind of total field, make it watch your entire list and update on list update.\nSmth like:\n({\n  init:'',\n  data:{rows:[{value:1}, {value:2}, {value:3}], total:0},\n  ui:{\n    '#rows':{\n      bind:'rows',\n      list:'',\n      manifest:{\n        ui:{\n          '.row':'value'\n        }\n      }\n    },\n    '#total':{\n      bind:function(d){\n        return d.rows.map(function(elt){return +elt.num}).sum();\n      },\n      watch:'#rows'\n    }\n  }\n})\nClosing issue.\n-\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHubhttps://urldefense.proofpoint.com/v2/url?u=https-3A__github.com_ermouth_jQuery.my_issues_43-23issuecomment-2D343773925&d=DwMFaQ&c=XWbgA8ttvF3NJsjYBxUdHg&r=50xY7vscJPb5HhilXnWwQHUcndzDsLvjgOMsPsTMWcc&m=_7bvCvrr9wXnNZihHsRiEQubTMU7qhTQpfoogB-57FA&s=DxJ5pF80cOILsYhAjS0M3JqooDbxBiM5yMihgHwl6sQ&e=, or mute the threadhttps://urldefense.proofpoint.com/v2/url?u=https-3A__github.com_notifications_unsubscribe-2Dauth_ALRvAjudCk8deELab7hrJMwKdg-2DyzPvEks5s13IcgaJpZM4QNePb&d=DwMFaQ&c=XWbgA8ttvF3NJsjYBxUdHg&r=50xY7vscJPb5HhilXnWwQHUcndzDsLvjgOMsPsTMWcc&m=_7bvCvrr9wXnNZihHsRiEQubTMU7qhTQpfoogB-57FA&s=fM4dDyOvZ0fGVlvx1w9qYs0ffzpZ4BQiSa6V3gTxgBQ&e=.\n. ",
    "mrmusselman1-andculture": "Thank you! I love this plugin! . ",
    "andreyuv": "Thank you for your quick and helpful reply!. "
}