{
    "fengyuanchen": "You can create an Angular wrapper for Viewer.js as ngCropper.\n. I don't understand what you mean exactly. \n\nViewer can work on a single image as:\nhtml\n<img id=\"image\" src=\"path/to/image.jpg\">\njs\nvar image = document.getElementById('image');\nvar options = {};\nvar viewer = new Viewer(image, options);\n. Show thumbnail is optional!. \nPlease read the description about the url option: https://github.com/fengyuanchen/viewerjs#url\n. Good point. It should exit fullscreen when stop playing.\n. Yes, it is quite easy:\njs\n$().viewer({\n  url: 'src',\n  movable: false,\n  rotatable: false,\n  scalable: false\n});\n. As this issue is under the Viewer.js, I should provide a related example:\nhtml\n<div class=\"pictures\">\n  <img src=\"/path/to/picture-1.jpg\">\n  <img src=\"/path/to/picture-2.jpg\">\n  <img src=\"/path/to/picture-3.jpg\">\n</div>\njs\nvar pictures = docuement.querySelector('.pictures');\nvar viewer = new Viewer(pictures , {\n  movable: false,\n  rotatable: false,\n  scalable: false\n});\n. @searls You are right. Thanks. I will replace them with some photographs taked by myself to avoid license problem.\n. I have replaced all the example images with my own photos. Thanks all of you.\n. Good work. Thanks~\n. Thank you for the PR, but I'd like to use my own photographs to avoid license problem.\n. @stephenhandley Thank you for the PR, but I'd like to use my own photographs to avoid license problem.\n. @tmont Re-implement the Viewer.js by pure CSS?\n. @tmont As this library is built with JavaScript mainly (js: 60KB, css: 8KB), I think it is not possible for me to implement it by pure CSS.\n@stephenhandley I think using photos of landscape are more common than a specific person, and will more easy to be accept by most people.\nThank you both!\n. Thank you. I will consider it I need one later.\n. Thank you for the PR. \nBut I think the best way to fix this is that remove both http and https.\n. With <script src=\"//fengyuanchen.github.io/js/common.js\"></script>:\nIf you access http://fengyuanchen.github.io/viewerjs/, browser will load http://fengyuanchen.github.io/js/common.js.\nIf you access https://fengyuanchen.github.io/viewerjs/, browser will load https://fengyuanchen.github.io/js/common.js\n. OK. I see. Just because sometimes I cannot access github.io with https.\n. Thank you for reporting this!\n. Thank you for the suggestions.\n. I think videos are totally different to images.\n. 1) In order to keep the library small and simple, I cannot provide all the available options, so I'd like to provide the basic options only.\n2) Set the scalable option to false will disable image flipping.\n. @stephenhandley Sorry, I have to say your images are not so beautiful as my original images. Please don't pull any requests about images. Thanks!\n. @stephenhandley I think landscape photographs are more common and acceptable for most of people than a specific person, so I replaced all the pictures of Emma some days ago even though I think she is very very beautiful.\n. You can try to set both the rotatable and scalable options to false.\n. I don't understand what you said. Sorry~\n. Are you sure the other galleries had been initialized?\n. Viewer is a jQuery plugin, but Viewer.js does not require jQuery. So they are different.\n- Viewer: https://github.com/fengyuanchen/viewer\n- Viewer.js: https://github.com/fengyuanchen/viewerjs\n. There is a mistake here. I will fix this soon. Thanks~\n. Support to custom toolbar buttons now (v0.9.0).. Thanks~\n. 一张图片都没有，这确实是极端情况。你可以先试试每次加载完新图片后，先注销，然后重新初始化。\n. Were you talk about the Viewer.js?\n. What did you mean with the \"save\" word (in the title)?\n. Where is the \"save\" button?!\n. Can you provide more detail or an online demo?\n. Sorry, we don't need this feature, but you can folk one and customize it by yourself.\n. I will improve this next. Thanks!\n. Show the image loading progress to let the use know it is loading.\n. This will change the UI of the default toolbar, e.g., the bigger play button. My suggestion it keep your custom toolbar in your own project. Thanks~\n. The viewed.viewer is an event of the jQuery version: https://github.com/fengyuanchen/viewer\n. Thanks~\n. Not support to use it in modal yet.\n. Supports now: https://github.com/fengyuanchen/viewerjs/blob/master/examples/viewer-in-modal.html. The right event is viewed, not need the .viewer suffix.\n. Please read the contributing guidelines first before send a pull request. Thanks.\n. 1. Fork the latest repo.\n2. Don't change the files in the dist directory.\n. Viewer.js does not support IE8, you can try the jQuery version which supports IE8.\n. Fixed on #33, will be released soon.\n. Call the show method after you initialized a viewer.\n. The code is fine, but you put this comment in a wrong place...\n\nThe right place: https://github.com/fengyuanchen/viewer\n. Just an image viewer, not work with other things.\n. Why not just use the hide method.\n. Switch images by swiping will be disabled when it only has one image.\n. https://github.com/fengyuanchen/viewer\n. Supports this by default. But you should put each gallery in different containers and initialize each gallery by Viewer.js.\n. js\nnew Viewer(gallery1);\nnew Viewer(gallery2);\nnew Viewer(gallery3);\n...\nnew Viewer(galleryN);\n. http://codepen.io/cfy/pen/bwqjGQ\n. You may need to limit the number of the images.\n. @NivarnaRen Try the jQuery version please: https://github.com/fengyuanchen/viewer. Call the update method to add those images dynamically!\n. @KevinPan If no image at all, why not just init the viewer after the images loaded?!. As of v0.9.0, the prev and next methods support loop mode.. Here is an example for customizing toolbar with loop prev and next behaviour:\nhttps://github.com/fengyuanchen/viewerjs/blob/master/examples/custom-toolbar.html. Try the latest version please (current: v0.9.0). I enhance the title to support to customize title content.. The viewer is appended to body in modal mode now.. Not support this. Maybe you can add a hidden img for the viewer to read.. e.detail都是很老的浏览器了. What's your mean of the \"navigate to the gallery\"?. Keyboard support only available when you open the viewer window.. More detail?. Try the latest version please.. Are you sure you were using the latest version?. It is the problem of the default dragstart event behaviour.. @kristianjohansson Thanks you very much. You just found the core mistake:\ngetPointer(touch), true) is wrong, it must be getPointer(touch, true)). You can just customize it in your own code. The Viewer.js will not support this. Sorry.. Click the right button of the mouse, and then choose the download button?. You can implement it with HTMLAnchorElement's download attribute, but only works for same-origin URLs.. @jaychapani Not support that~. @jaychapani Checkout this example which has a custom download button, but not support to download rotated images.. You might have to fix it by yourself.. 你可能需要自己解决这个问题了。. Upgrade to the latest version and try again.. 什么浏览器？什么版本？. 无法复现：https://fengyuanchen.github.io/viewerjs/. Why not just use the view(index) method?. Call the show method first, and then call the view method once the modal shown (use the shown event).. Not necessary to add this. Just use the scalable option.. For download button, you can customize it by yourself.. Good work!. Yes. It is designed as this, not an issue.. Not support this. Fork one and implement it by yourself.. Show the thumbnails first and download the full image only when view it in the viewer window, check out the demo for detail.. Try the update method:\n\njs\n// change the list\nthis.$nextTick().then(() => {\n  viewer.update()\n}). @mawenge https://github.com/vuejs/vue/pull/3967. Works fine with base64 images. Just check your own code for the problem.. Try this:\nhtml\n<div>\n  <ul id=\"images\">\n    <li style=\"backgruond-image: url('picture.jpg');\"></li>\n    <li style=\"backgruond-image: url('picture-1.jpg');\"></li>\n    <li style=\"backgruond-image: url('picture-2.jpg');\"></li>\n  </ul>\n</div>\njs\nconst viewer = new Viewer(document.getElementById('images'), {\n  url() {\n    return this.style.backgruondImage.match(/'(.+)'/)[1]\n  },\n});. 支持。\njs\nimport 'viewerjs/dist/viewer.css'\nimport Viewer from 'viewerjs'. 暂时没有考虑做。不过你可以把你们公司的实现的PR上来给需要的人做参考。. What are you mean?. Hide the built-in close button and create a custom button by yourself.. https://github.com/nolimits4web/Swiper. ```js\nvar viewer;\nimage.addEventListener('viewed', function () {\n  viewer.zoomTo(1); // Zoom to 1:1 when each image load completely\n}, false);\nviewer = new Viewer(image);\n. Sorry, I don't understand that.. https://github.com/fengyuanchen/viewerjs#browser-support. Just try it!!!. I think this case is over-designed. But you can fork one and implement it by yourself.. v0.8.0已修复改问题。. - 用键盘上的左右箭头可以切换图片。\n- 手机上左右滑可以切换图片。. Why not use `import Viewer from \"viewerjs\"`?. I think it is not a problem of Viewer.js. Please check your build system to fix it..txt\ndist/\n├── viewer.css\n├── viewer.min.css   (compressed)\n├── viewer.js        (UMD)\n├── viewer.min.js    (UMD, compressed)\n├── viewer.common.js (CommonJS, default)\n└── viewer.esm.js    (ES Module)\n``. Try theresetmethod.. Try thetogglemethod.. Sorry. Not support that.. Will support to customize toolbar layout in next version, see #79.. 什么浏览器？是否是受支持的版本？. 请试试最新版本，我先关闭了。. 为什么不升级版本试试？. Already fixed this in v0.9.0 before this PR.. 默认展示缩略图，再通过[url`](https://github.com/fengyuanchen/viewerjs#url)参数设置原图查看地址。. 请确认能否在这里复现，如果不行，可能要检查你自己的代码了。。. 那个浏览器我就没有办法了。。. 既然是modal模式，当然是不支持的。你不会用inline模式自定义一个弹窗？. https://github.com/fengyuanchen/viewerjs#browser-support. https://github.com/fengyuanchen/viewerjs/blob/master/examples/custom-toolbar.html. The latest version had supported this.. 360不在支持之列。. exit inline mode = destroy the viewer.. Do you really understand the inline mode?. Why not just override the CSS style in your app?\nFor example:\ncss\n.viewer-toolbar {\n  text-align: left; /* or right */\n}. BTW: The toolbar, navbar and  title are all center-aligned, and I think it is not a good idea to change this.\n  . It is not a common feature, so I will not merge this. I am sorry, and thanks for your PR.. Customize the toolbar to bind click event. Check out the toolbar option for more information.. js\nimport Viewer from 'viewerjs/dist/viewer.esm';\nOr\njs\nconst Viewer = require('viewerjs');. 这里的示例就是一个列表：https://fengyuanchen.github.io/viewerjs/\nhtml\n<ul id=\"list\">\n  <li><img src=\"...\"></li>\n  <li><img src=\"...\"></li>\n  <li><img src=\"...\"></li>\n</ul>\njs\nconst list = document.getElementById('list');\nconst viewer = new Viewer(list);. 把整个body作为容器，每次加载一页后，调用update方法. After you change the container size manually, you can trigger a resize event on window to update the viewer, or just call the internal resize method.. I saw you were using CSS Grid Layout in your demo, but IE9 does not support them.. It is hard to do this in inline mode as the viewer is placed over the target element.. The size the of the inline viewer is inherit from its parent element (container), so just change the size of parent element.. You can call the internal resize method instead of trigger a resize event on window.. This has been implemented in 1.0.0-rc.. Try the latest version please.. js\nimport Viewer from 'viewerjs';\nimport 'viewerjs/dist/viewer.css';. 最新文档已补全使用说明：https://github.com/fengyuanchen/viewerjs#usage. You can listen on the native transitionend event as zoomed.. The container here is just used to put the elements of the viewer, and the viewer is still shown in full page after open.. 请更新到最新版本。. Just import the compiled CSS file:\ncss\n@import 'viewerjs/dist/viewer.css';. Are you sure? How to reproduce?. Got it. Thanks.. Please check your own code first.. 在Vue里面使用，需要在mounted钩子函数里面初始化Viewer.js. 你确定？. Just use the view method to show the target image you want. For example, view the the third image:\njs\nviewer.view(2);. You can cache zoom data within the zoomed event and restore it within the viewed event.. 能否详细一些，控制台有没有报错什么的？. Just preload the big images by yourself outside the viewer.. 这个蓝色圆形图标在Viewer.js中是没有的，所以是其他方面的问题吧。。. Just use the filter option: https://github.com/fengyuanchen/viewerjs#filter. Just prevent default in the hide.bs.modal event of Bootstrap Modal when the viewer is shown.. js\n$('#myModal').on('hide.bs.modal', function (e) {\n  if (viewer.isShown) {\n    e.preventDefault();\n  }\n});. https://github.com/fengyuanchen/viewerjs/blob/master/examples/viewer-in-modal.html. https://github.com/fengyuanchen/viewerjs/blob/master/examples/viewer-in-modal.html. 需要手动引入样式：import 'viewerjs/dist/viewer.css'. https://github.com/fengyuanchen/viewerjs#syntax. js\nrequire('viewerjs/dist/viewer.css');. You should add a css loader for webpack first.. 看你这代码，每次点击都创建一个Viewer实例，这样没有问题吗？. 双击事件在大多数手机端浏览器上不被支持。The dblclick event is not supported in most mobile browsers.\n\nhttps://developer.mozilla.org/en-US/docs/Web/Events/dblclick. 你用的哪个版本，哪个浏览器？. 请使用最新版。. It is already exist in bower: \n\nbower install img-viewerjs. https://github.com/fengyuanchen/viewerjs/blob/master/CHANGELOG.md. Not yet.. Check out this PR if you need.. Did you zoom the image at least once?. 为何不先检查你的 Vue 指令是否有正确初始化和注销？. You should use async with await:\njs\nnew Viewer(el, {\n  async url() {\n     return await getimgsrcajax();\n  },\n});. The url option does not support async call.. https://github.com/fengyuanchen/viewerjs/blob/master/.github/CONTRIBUTING.md#question-or-problem. GIF images should be supported already. Can you provide an online demo for checking?. Why not just override the button style in CSS directly?\ncss\n.viewer-button {\n  /* Your custom styles here */\n}. Cannot support that. Sorry!. 八杆子打不着的问题都来这里问？！\n\nhttps://developer.mozilla.org/en-US/docs/Web/Events/dragover. Are you sure this is an issue about Viewer.js itself?. 启用 inline 模式就可以了。\n\njs\nnew Viewer(element, {\n  inline: true,\n});. You should destroy the existing viewer instance before replace images, and then start a new viewer instance.. I guess you don't use it in a right way.. When you load more images, you should destroy the existing viewer insance first.. Set the keyboard option to false and customize it by yourself.. 特大图？内存撑爆了！加大你的内存吧！. js\nconst options = {\n  title: (image, imageData) => `${image.alt} (${imageData.naturalWidth} × ${imageData.naturalHeight})`\n};. 建议你仅删除原始页面上的图片，然后调用 viewer.update() 来更新 Viewer 图片列表，而不是直接删除 Viewer 中的图片。. 请提供demo。. 这个问题应该已经修复了。. 1. When calling the zoom or rotate methods, the zoom / rotate center is the center of the canvas (image wrapper).\n2. When zoom by wheel or touch, the zoom center is the position of the pointer.. It's really strange! I have not idea on this.. Maybe you can try to customize the toolbar totally.\nExample: https://github.com/fengyuanchen/viewerjs/blob/master/examples/custom-toolbar.html. This may be fixed, cannot reproduce now.. Maybe you can try this example:\nhttps://github.com/fengyuanchen/viewerjs/blob/master/examples/dynamic-viewer.html. 能否提供一个在线Demo？. 在第二次 new Viewer 之前需要注销之前的 Viewer 实例：viewer.destroy(). Why not just override the existing background color in your own code?\ncss\n.viewer-backdrop {\n  /* Your custom background color here. */\n  background-color: rgba(0, 0, 0, .5); \n}. @mygu A new option className has been added to Viewer.js (v1.3.0) for your case.. 这个功能不应该由 Viewer 来实现，否则 Viewer 将会越来越臃肿。你可以用一个DIV元素把每5张图片包在一起，然后每次在一个DIV元素上调用 Viewer。. You can customize the toolbar totally and add click event handler for all actions.\nExample: https://github.com/fengyuanchen/viewerjs/blob/master/examples/custom-toolbar.html. Works fine with <img src=\"example.svg\"> after test.. 不清楚，有 demo 吗？. 请参考：https://fengyuanchen.github.io/viewerjs. html\n<!-- src 是默认加载的缩略图，data-original 是点击查看后才加载的原图 -->\n<img src=\"images/thumbnails/tibet-1.jpg\" data-original=\"images/tibet-1.jpg\">. 实在无法理解你这种操作。。你这不是多此一举？！. 你这又绕回来了……你确定你理解了我前两条回复？！. @KevinPan 还需要配置url参数：\njs\nnew Viewer(image, {\n  url: 'data-original',\n});\n或者\njs\nnew Viewer(image, {\n  url(image) {\n    return image.getAttribute('data-original'),\n  },\n});. 为什么不等容器内添加了图片了再初始化？. js\nnew Viewer(image, {\n  filter(image) {\n    return image.getAttribute('data-excluted') === 'true';\n  },\n});. Use the zoom event and call event.preventDefault() when the zoom ratio exceeds your limit value. . 你用的是Webpack？没有配置css-loader？. see #219. see #210. CSS样式覆盖。. Not support that.. Can not reproduce.. Any online demo?. 请根据文档自定义工具栏按钮。. 请描述清楚一点，或者提供可以复现的在线示例。. 这样就可以了。. Thanks, but I tend not to use the loose mode although it can reduce a little of code.\n\nBabel 6: loose mode.. The demo code is writing in ECMAScript 6, you should transform it before using it in the browser.. Just implement it by overriding the styles of the .viewer-canvas class:\n\ncss\n.viewer-canvas {\n  padding-left: 100px; /* Analogous to offsetX */\n  padding-top: 50px; /* Analogous to offsetY */\n}. 点击 => 创建实例\n关闭 => 注销实例\n不需要调用update方法. Any more detail?. 在整张图片屏幕内可见的情况下已默认支持左右滑动切换图片。. Yes.. https://github.com/fengyuanchen/viewerjs/blob/master/examples/dynamic-viewer.html. The src/css/viewer.css file is writing in CSS Next syntax and will be compiled by PostCSS, not by Sass. Please use the dist/viewer.css file for your application.. 无法复现。. This is an image viewer, not PDF.. 试试 Inline 模式。. js\nnew Viewer(singleImage, {\n  navbar: false,\n});. The viewer-open is similar as modal-open of Bootstrap's Modal.. Why the page will scroll to the top after viewer open? Any demo?. 有没有听说过“事件代理”？. Will not support this, sorry.. Not support that. I'm sorry.. You might need an image editor, not this as this is an image viewer.. ",
    "billyma128": "@ishabi \ntypescript\n@Directive({\n  selector: '[seeViewer]',\n})\nexport class SeeViewerDirective {\n  @HostListener('load', ['$event.target'])\n  onLoad(element: HTMLElement) {\n    const el = new Viewer(element);\n  }\n}. @nicooler \ntypescript\nimport Viewer from 'viewerjs/dist/viewer.esm'\nimport 'viewerjs/dist/viewer.min.css'. ",
    "Devaarth": "@KennethMa I am trying to Implement viewer.js in my current Angular 4 CLI based application . The problem is that when i create a fresh Angular 4 project from scratch and try to run viewer.js it is running fine but when I am trying similar things and copying the same code into my application(which has other functionalities as well) I am not able to run viewer.js.\nAlso there no console or build issue showing up so I am not able to debug my problem as well.\nAny help will be appreciated \nThanks. ",
    "marcusforsberg": "I'm kind of late to the party here, but for what it's worth, we've just released a really simply directive you can use to implement Viewer.js in Angular 6+: https://github.com/winteragency/ngx-viewer/ (@Devaarth). ",
    "ishabi": "I like to bring viewer into screen without a thumbnail rendered upfront. Here what I understand is a two step process, (1) load/render image or thumbnail first (2) Select or using viewer.show() bring the viewer image to screen. I like to make it like, bring the viewer to screen without an image pre-rendered.\n. Yes, Thank you @b2bstudio, having a link and bringing the image in the transparent modal would be good. \n. ",
    "b2bstudio": "Basically what ishabi is saying I think is;\nsee bellow\nlightbox.txt\nIs this something you would know how to do?\n. I have figured it out with css;\non first li put style=\"display:block\"\nand add display:none to\n.docs-pictures > li {\n    border: 1px solid transparent;\n    display: none;\n    float: left;\n    height: 33.3%;\n    margin: 0 -1px -1px 0;\n    overflow: hidden;\n    width: 33.3%;\n}\nthen only the first image shows as a thumbnail, click the thumbnail and all the pics show in light-box. \n. also I need to disable certain features, eg rotatable , moveable, thumbnails...  do I need to do this in main.js\n. I have added it in main.js but it doesn't  seam to change, do I need all the js in main.js?\n``` js\n$(function () {\n'use strict';\nvar console = window.console || { log: function () {} };\n  var $images = $('.docs-pictures');\n  var $toggles = $('.docs-toggles');\n  var $buttons = $('.docs-buttons');\n  var options = {\n        // inline: true,\n        url: 'src',\n        movable: false,\n        rotatable: false,\n        scalable: false,\n        build: function (e) {\n          console.log(e.type);\n        },\n        built: function (e) {\n          console.log(e.type);\n        },\n        show: function (e) {\n          console.log(e.type);\n        },\n        shown: function (e) {\n          console.log(e.type);\n        },\n        hide: function (e) {\n          console.log(e.type);\n        },\n        hidden: function (e) {\n          console.log(e.type);\n        },\n        view: function (e) {\n          console.log(e.type);\n        },\n        viewed: function (e) {\n          console.log(e.type);\n        }\n      };\n$images.on({\n    'build.viewer': function (e) {\n      console.log(e.type);\n    },\n    'built.viewer':  function (e) {\n      console.log(e.type);\n    },\n    'show.viewer':  function (e) {\n      console.log(e.type);\n    },\n    'shown.viewer':  function (e) {\n      console.log(e.type);\n    },\n    'hide.viewer':  function (e) {\n      console.log(e.type);\n    },\n    'hidden.viewer': function (e) {\n      console.log(e.type);\n    },\n    'view.viewer':  function (e) {\n      console.log(e.type);\n    },\n    'viewed.viewer': function (e) {\n      console.log(e.type);\n    }\n  }).viewer(options);\ntoggleButtons(options.inline ? 'inline' : 'modal');\n$toggles.on('change', 'input', function () {\n    var $input = $(this);\n    var name = $input.attr('name');\noptions[name] = name === 'inline' ? $input.data('value') : $input.prop('checked');\n$images.viewer('destroy').viewer(options);\ntoggleButtons(options.inline ? 'inline' : 'modal');\n\n});\n$buttons.on('click', 'button', function () {\n    var data = $(this).data();\n    var args = data.arguments || [];\nif (data.method) {\n  if (data.target) {\n    $images.viewer(data.method, $(data.target).val());\n  } else {\n    $images.viewer(data.method, args[0], args[1]);\n  }\n\n  switch (data.method) {\n    case 'scaleX':\n    case 'scaleY':\n      args[0] = -args[0];\n      break;\n\n    case 'destroy':\n      toggleButtons('none');\n      break;\n  }\n}\n\n});\n});\n```\n. ",
    "samdoiron": "+1\n. ",
    "searls": "Awesome, thanks @fengyuanchen!\n. ",
    "tmont": "I'm not sure about this. Why replace sexy images of one celebrity with sexy pictures of another?\nMaybe the sample images should just be different shades of beige so as not to offend anyone of any kind of gender.\nAlthough, certain people might have a beige fetish, so maybe an option to switch the hue might be an easy way to ensure that people who identify as a beige fetishist won't feel like we're singling them out for being weirdos.\nPerhaps the best solution is to not show the demo by default, and start with the question \"which color is the least sexually attractive to you?\" and use that hue for the sample images. However, you'll have to reassure them that you won't be doing anything malicious with such potentially sensitive data.\nMaybe the true solution is to re-implement this whole library in pure CSS with no JavaScript whatsoever. That has the polycephalic advantage of:\n1. Ensuring users that you won't track their huesexual preferences\n2. It'll work offline, so noscript and other JS blockers will still work with this library\nThoughts?\n. ",
    "natxty": "@tmont huesexual \n. ",
    "stephenhandley": "@tmont Thank you, I now better understand what the issue is with the previous imagery. I agree that a pure CSS implementation is probably the most reasonable way forward. Hopefully that will be possible.\n@fengyuanchen Although I do enjoy the striking images of Tibet that you are now using, it's perhaps worth noting that all images of Randy Quaid are currently in the public domain, as per Bridgeman Art Library v. Corel Corp., 36 F. Supp. 2d 191 (S.D.N.Y. 1999). So, should you ever want to reconsider my PR, I am reasonably certain that legally, at least, you will be on solid ground. \n. @fengyuanchen I concur that landscapes are more easily acceptable, but I must say I do think a lot of people find Randy Quaid quite agreeable. So, I submit this for your consideration: https://github.com/stephenhandley/viewerjs/commit/4d68251c405d9b929c194048be6faafcb090b6d7\n. @fengyuanchen I have to disagree as I believe (as do many millions of people) that Randy makes everything more beautiful. but it is ok. I will stop trying to open your eyes to the beauty of Randy. \n. Yes, I agree Emma is very very beautiful, but not as beautiful as Randy. I would say, if I were to rank the options: 1) Randy in Tibet very very very beautiful, 2) Randy very very vry beautiful, 3) Emma very very beautiful, 4) Tibet very beautiful. Anyway, that is just my opinion, I may be wrong. \n. ",
    "OmgImAlexis": "Why? There's no need to even serve the http version. https should be hardcoded.\n. I know what // does, I was asking why you'd rather load it over http when you can force https?\n. ",
    "hecktarzuli": "True, but it really sucks having to find 2 different things to pull it off..  http://fancyapps.com/fancybox/3/ does a decent job but requires jQuery.. ",
    "AlgyTaylor": "Thanks :+1: \n. ",
    "macroramesh6": "@fengyuanchen Thanks a lot. so I will close this issue :)\n. ",
    "frossetto": "I'm having the same issue with ng-repeat. Were you able to found a solution, @kiranbose ?\n. ",
    "kiranbose": "yes i have a solution. Tell me the problem you are facing now.. @frossetto \nOn Fri, Aug 5, 2016 at 3:42 AM, Flávio Diniz Rossetto Júnior \nnotifications@github.com wrote:\n\nI'm having the same issue with ng-repeat. Were you able to found a\nsolution @kiranbose https://github.com/kiranbose\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/fengyuanchen/viewerjs/issues/18#issuecomment-237699288,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AGxd01345LvyGPfCv8zqK_sNT0OJFYpyks5qcmPOgaJpZM4HqlUv\n.\n\n\nKiran Bose\n. ",
    "donggaina": "ajax动态请求加载的图片，图片加载后初始化了viewer,但是图片查看只有第一次有效. 页面加载就初始化了viewer，\najax请求成功后\n if(viewer){\n          viewer.destroy();\n           viewer = new Viewer(document.querySelector('.docs-pictures'));\n    }. ",
    "HinduLotus": "请问这个问题解决了吗？我遇到了相同的问题，求帮助. 非常感谢，问题解决了. ",
    "65style": "@donggaina 为什么我每次请求都是重新生成一个实例啊，没有注销旧的啊 ！. ",
    "zhangnan666": "nice. ",
    "ankurmee": "Yes\nFrom: Fengyuan Chen [mailto:notifications@github.com] \nSent: Wednesday, April 6, 2016 6:53 PM\nTo: fengyuanchen/viewerjs\nCc: ankurmee\nSubject: Re: [fengyuanchen/viewerjs] Image Background turn Black when rotate png image and save. (#23)\nWere you talk about the Viewer.js?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly or view it on GitHub https://github.com/fengyuanchen/viewerjs/issues/23#issuecomment-206369336   https://github.com/notifications/beacon/ARatPAb3V2EGHwU7KiSZW3gOVjD7bxCkks5p07OjgaJpZM4H_GA3.gif \n.  Click on this button.\nFrom: Fengyuan Chen [mailto:notifications@github.com] \nSent: Wednesday, April 6, 2016 7:16 PM\nTo: fengyuanchen/viewerjs\nCc: ankurmee\nSubject: Re: [fengyuanchen/viewerjs] Image Background turn Black when rotate png image and save. (#23)\nWhat did you mean the save?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly or view it on GitHub https://github.com/fengyuanchen/viewerjs/issues/23#issuecomment-206379663 \n. May I know the reason to close this Issue ? \n. Save button is on the zoom window where we have all other options.\nFrom: Fengyuan Chen [mailto:notifications@github.com] \nSent: Thursday, April 7, 2016 5:15 PM\nTo: fengyuanchen/viewerjs\nCc: ankurmee\nSubject: Re: [fengyuanchen/viewerjs] Image Background turn Black when rotate png image and save. (#23)\nWhere is the \"save\" button?!\n—\nYou are receiving this because you authored the thread.\nReply to this email directly or view it on GitHub https://github.com/fengyuanchen/viewerjs/issues/23#issuecomment-206829123 \n. ",
    "disav1": "var options = {\n    viewed: function () {\n        var context = $(this);\n        $('.viewer-canvas').click(function(e){\n            if(e.target.className == 'viewer-canvas') {\n                 context.viewer('hide');\n            }\n        });\n    },\n    url: 'data-original',\n};\n. ",
    "kongyajie": "viewed: function () {\n      var context = this;\n      $('.viewer-canvas').click(function(e){\n        if(e.target.className == 'viewer-canvas') {\n          context.viewer.hide();\n        }\n      });\n    }\nps: Viewer.js v0.5.0\n. ",
    "infeng": "you should try render Viewer component in document.body\n. @rhc912 you should try react-viewer which is a react component and similar to viewerjs, welcome try and feedback.\n. viewerjs的父节点css加入transform试试，这样就能固定在model里面显示\n. ",
    "MrGorki": "Changing $this.after($viewer); with $('body').append($viewer); should solve it.. ",
    "zhangyangGit": "If the bootstrap modal dialog can work. You can change the viewerjs class into  \"var CLASS_OPEN = 'modal-open'\". This works  in my situation.. ",
    "Tammeny": "Thank you all.😊. @Stafox Have you solved the problem?. @fengyuanchen 你好，这个问题我也有遇到，如何处理？. @Stafox Agree.. ",
    "ecool2011": "However,  following codes won't trigger 'viewed' event... I have no idea.. >_<\n$(\"#images\").on({ 'viewed' : onViewed }).viewer(g_viewerOptions);\n. I made mistake, viewer and viewerjs is two different library.... I use viewer, not viewerjs...\n. ",
    "sorskoot": "I'm sorry. I'm not sure what I did wrong. Do you want the dist folder excluded? The changes are made by the build script. \n. Hi, I've undone the changes to the dist folder. \n. ",
    "OPfewnojnolfew": "\nadd this\n. ",
    "Physium": "to add on. the view() method does not seems to be working as well. not even the demo works.\n. ",
    "jasminder": "Hey , Thanks for building the plugin .Its awesome. i have same question . \n<div class=\"thumbnail \">\n<img src=\"thumb.png\" class=\"portrait\" alt=\"Image\" />\n</div>\n<div>\n  <ul class=\"images\">\n    <li><img src=\"picture.jpg\" alt=\"Picture\"></li>\n    <li><img src=\"picture-2.jpg\" alt=\"Picture 2\"></li>\n    <li><img src=\"picture-3.jpg\" alt=\"Picture 3\"></li>\n  </ul>\n</div>\nI want to show the viewer with class .images on clicking class .portrait. I have initialized the viewer. \n$('.images').viewer();\n$('.portrait').click(function(){\n$('.images').viewer('show');\n    });\nPlease tell if i am doing it wrong . \n. ",
    "jony4": "thanks\n. ",
    "KevinPan": "where should I call the hide method to hide the viewer if the mouse clicked outside of the image?. I get an error if I initialize viewer with no image in the target element.\ne.g:\nvar viewer = new Viewer(document.getElementById('imageContainer'), { title: false });\nAnd later, I add images to imageContainer, then I call viewer.update();\nthere is an exception in line 2172: _this.length = _this.images.length;\nthe _this.images is undefined.\nUncaught TypeError: Cannot read property 'length' of undefined\n    at Viewer.update (viewer.js:2172)\n    at :1:8. 试了一下最新的chrome和IE都有这个情况. 试了一下啊data-original 没其起作用，但是首页文档的方法是可以的\n<img src=\"picture.jpg?size=160\">\nnew Viewer(image, {\n  url(image) {\n    return image.src.replace('?size=160', '');\n  },\n});. ",
    "rafaelgrilli92": "Wow, we are in 2017 and this issue is still opened!\nI'm facing the same problem. I need the pictures inside a modal, but when I click on them, the full screen of the viewerjs becomes the modal, so it crops the bottom of the image. ",
    "Thatkookooguy": "thanks!\n. ",
    "SergeyBondarenko91": "How to initialize each gallery by Viewer.js?\n. ",
    "josundin": "It would be a great addition to have multiple galleries. I am sure more people than we two are  interested to have this feature.\nAny ideas or pointers how to implement multiple galleries support? \n. Awesome. Perfectly explained :D Thank you.\n. ",
    "deterenkelt": "Excuse me, I am concerned with the same issue and the example doesn’t seem to work. Nothing happens on click.\n\n . ",
    "NivarnaRen": "Hi Chen,\nThis library you created is so awesome .But I found it is not suported by IE8 ,IE9 .Do you have any plan to update ?. ",
    "glennax": "figured it out :)\n. ",
    "JCarlos12": "I am also needing the same thing. ",
    "guimeisang": "后来我的解决方案就是：在初始化之前将initContainer的源码改了\nvar viewBox=document.getElementById('viewBox')；\nViewer.prototype.initContainer=function(){\n        var _this = this;\n        this.containerData = {\n             width: viewBox.offsetWidth,\n             height: viewBox.offsetHeight\n        };\n};\n. ",
    "docikaci": "附件列表，同样不是img， 有没有直接传URL的方法？. ",
    "ravitejasbl": "can any one reply plz\n. It is not working fine in mobile, if i zoom using fingers it effects the image and not zooming.. Is it have pinch zooming in mobile?. Yes, it is working\nThanks.. ",
    "uggrock": "I can confirm this with Android 6 on Samsung s7.. Same for me. Now it works, thank you!. ",
    "kristianjohansson": "Still not able to pinch zoom or move the images in the new version (6.0.1).\nTried on both phones and tablets.. I debugged your script to see if I could find the problem.\nIt seems like it is some bug with TouchEvents.\nWhen I changed this line:\nif (e.changedTouches) {\n      each(e.changedTouches, function (touch) {\n        extend(pointers[touch.identifier], getPointer(touch), true);\n      });\n    }\nto this: \nif (e.changedTouches) {\n      each(e.changedTouches, function (touch) {\n        extend(pointers[touch.identifier], getPointer(touch, true), true);\n      });\n    }\nit started working for both pinch zoom and moving the images.\n. ",
    "gaona0704": "Can we add a download button to save the image to the local?. ",
    "jaychapani": "Can we download the rotated images ?. @fengyuanchen  Any plans to support that in near future?. ",
    "manikshakya": "the image is being viewed properly but the viewer is not in the proper position. its width is more than the body and padding-right is 102px; i tried to change the padding with the following code.\n$('.viewer-open').css({\n    'paddingRight': '0px'\n});\nThe padding is solved but the problem is that it is loading padding-right: 102px first, then the padding is changed to 0px. My jquery code is running after 102px padding.\nIs there a solution to this? Would be a great help.\nThanks. Okay.. thanks.. ",
    "huangfang2015": "Got it,thanks!. ",
    "mirari": "使用过程中遇到了类似情况，按下ESC后快速在图片缩小过程中点击图片，很容易复现。此时图片以外的组件均没有消失，而且点击右上角的关闭也无效。但是可以滚动鼠标滚轮，会发现图片先被放大到1%然后整个组件都被关闭。. got an error:\nTypeError: Cannot read property 'length' of undefined\n    at e.close (8.08bc08395686e88b434b.js:formatted:3117)\n    at e.destroy (8.08bc08395686e88b434b.js:formatted:3103)\nclose: function() {\n   var e = this.body;\n  p(e, \"viewer-open\"),\n  e.style.paddingRight = this.initialBodyPaddingRight\n  },\nthis.body is undefined. vue组件在挂载和卸载时DOM元素可能会被重建，直接执行update方法有可能会报找不到el.viewer对象的错误，为了稳妥起见，不如选择destroy和重新初始化. ",
    "ruvor": "Because I needed to show modal viewer initially on some not first picture. And the 'view' method does not trigger modal viewer. It works only when it is already shown.. ",
    "erguotou520": "I have the same requirement. I want to trigger the view method when the modal is invisiable.. I directly change index to some value, and call show then.. ",
    "meteor199": "对，我也遇到过这个问题。. 嗯. ",
    "gdh1995": "@mirari PR #120 should fix your issue. You may try it by compiling viewerjs or using my uploaded version:\nviewerjs-a79e3325723c95ea90d7742c5fac7b4c005c7a99.zip\n. 不该启用被动事件监听，因为被动模式下无法“阻止”鼠标滚轮/触摸板滚动事件，滚动事件会从viewerjs的对话框冒泡到document进而造成页面滚动。\n避免这个warning的做法是，主动声明passive: false，比如我这个修改： https://github.com/gdh1995/viewerjs/commit/7287009d9bbce104891f5ec07cf550898cd294af#diff-8901833d3b25d2f3ac53c873df0fdaf5R41\n@fengyuanchen 我想知道能不能像我的修改那样，判断浏览器是否支持wheel事件，支持的话就不监听mousewheel、DOMMouseScroll了，我觉得这么做可以让getEventListener的结果更干净些。\n而且MDN上说了，监听wheel后，就不会产生并派发mousewheel事件了。. 抱歉，貌似这个行为就是这么设计的，那我自己加判重吧。. ",
    "chamerling": "This one looks nice!. ",
    "maxime4000": "Thanks but I don't thinks it will be push in the master branch and I didn't add test due to the fact I wasn't really sure it would be merge.. I would hope to see it in the final build but as a fact, I didn't create unit test like every other components have some. And I did write to the owner of the repo when I was working in the company as a intern but i guess if he has try to reach me, I don't own anymore the email so i never saw it. But if he could reply on why it's not in the final build or if it need fix, it would be interesting to know.. ",
    "dsdemaria": "Any word on this possible making it in the final build?. ",
    "yuluqqvip": "搞定了\nif(document.getElementById('start-cont1').viewer){\n     document.getElementById('start-cont1').viewer.destroy();\n}\n实例化之前得销毁一次. ",
    "WangHao1221": "@ zhujinhu21我在angularJS中集成了，但是少一点缺陷，就是没有上一张下一张，还没配置出来. ",
    "forest-green": "这个是问题是因为我自己没看清楚实例照成的，var options = {}，使用的时候应该是var viewer = new Viewer(document.getElementById('loanImgViewer'), {});这样才对. ",
    "xuqihua": "hohoho  不知道怎么用在vue里面，这个还是jquery时代的，API里应该提供set图片列表的功能. ",
    "mawenge": "@fengyuanchen 这个是什么原理啊，$nextTick().then调用需要引入新的js插件吗？. ",
    "LodoF": "@meteor199 能分享一下你的方法吗？. > 我们公司的项目，普遍都有几百张图片。图片加载速度很慢。我使用了lazyLoad加载图片。\n\nModal Mode 使用 lazyLoad的库https://github.com/verlok/lazyload\nInline Modei 先根据nav bar 宽度和图片宽度计算当前能显示多少图片。然后当监听到view事件时，加载这些图片。\n假如您有计划做的话，我可以使用这种方式提交pull request吗？\n或者其他更好的方法。\n\n@meteor199 按照你的方法可以减少内存消耗，thanks\n@fengyuanchen 建议提供lazyload。. ",
    "denghuimin": "点击播放按钮后，标题会隐藏，我想显示一些说明，但不知如何添加到底部，比如图片的说明. ",
    "philipjmurphy": "Tested and works perfectly - many thanks for the quick turnaround on this one :). ",
    "yuwengCipher": "好厉害  请问是如何实现的 能贴下代码吗？. ",
    "Fazime": "行啊。访问 1mi6.com ，随便点个相册，查看源代码。viewer.js ，扣你想的JS就好了. ",
    "fanxinqi": "从有paly按钮状态【点击play按钮】到全屏播放状态，是一个操作（即paly按钮状态==>全屏播放状态）而键盘【esc按钮】也是一个操作，也是应该从全屏状态到未点击paly按钮状态（即全屏播放状态==>paly按钮状态），而不是两次esc， 是否考虑对称操作。. ",
    "chenddong": "\n. 该功能已经实现，谢谢作者提供平台！. ",
    "nicooler": "I tryed that too, it does not change anything. I saw that lodash is using that import like \n\nimport * as Viewer form \"viewerjs\";\n\nBut that did not help.. ",
    "matteoferigo": "Reset method will reset everything (for example rotation), and I just want to reset zoom\nIs it possible to get the initial zoom value on ready event? It's helpful as well\nThanks. Toggle is switching from full-size of the image to the full-size of the container. I just want to switch to the full-size of the container. Ok, I catched the original ratio during viewed event:\nviewed ({target: {viewer}}) {\n     originalRatio = viewer.initialImageData.ratio\n}\nand then I used viewer.zoomTo(originalRatio) to set the container full-size. ",
    "gwfowlcity": "ok thank you. ",
    "iygnol": "这个有一个处理方法：使用一个占位图替代，然后js控制把要显示的img的src替换过来，再update一下就可以了，我之前也遇到图片太多挂掉的情况。\n我的具体做法：\n1、所有的图片初始化都是占位图；\n2、把展示的大图前后5张小图（共最多11张）加载出来；\n3、每次选中一张新图片，执行2. 对了，我用的是jquery版本的. ",
    "suguoyao": "我自己解决了这个错误，可能是因为IE不支持Array.from方法\n我在js文件里将return Array.from(t); \n改为return Array.prototype.slice.call(t);\n就OK了. ",
    "hyguang": "https://fengyuanchen.github.io/viewerjs/ 直接用手机的浏览器打开您所给的地址(左侧)测试, 可以复现, 得到跟我所描述的一样, 不好意思, 只有QQ浏览器会出现这个情况. ",
    "GaryBikini": "Thanks! I know this way, but what should I do to exit just like the modal mode? The modal mode is more friendly.. ",
    "onpaik": "给 img 添加 onload事件. 我是显示单个图片 \njavascript\nimgOnload() {\n    const viewer = new Viewer(this.refs['preview-img'], this.props.previewOption);\n    viewer.view(0);\n  }\n<img \n          src={url} \n          alt=\"\" \n          onLoad={this.imgOnload.bind(this)}\n          title={imgTitle}\n          style={{ display: 'none' }}\n          {...{ ref: 'preview-img' }}\n        />. 你可以给ul 加 onload事件？. @fengyuanchen   ok, this way can work, add perfix wave line(~)\njavascript\n  @import '~viewerjs/dist/viewer.css'. ",
    "suwu150": "是这样吗？\nimageView = () => {\n    return new Viewer();\n  };\nonload={this.imageView}\nnew Viewer的时候需要传什么参数？. 噢噢，晓得了，谢谢. ",
    "xiabingwu": "感谢作者@fengyuanchen提供的viewerjs，我刚封装了react版本，欢迎使用https://github.com/xiabingwu/react-viewerjs @suwu150 . ",
    "jbbn": "Sorry for not providing images of my desirable result.\ntext-align does not solve this. (It's a vertical solution)\n\n. Ok, no problem. Say that it's not a common feature to my design haha.\nWell, it really makes sense to me, so I'll maintain this on my fork.\nThanks for your attention. :smiley: . ",
    "lzfxp": "已经找到方法了\nviewer.images[viewer.index].dataset.download. ",
    "Stafox": "@fengyuanchen Could you confirm that issue exists?. @fengyuanchen Looks like it didn't help. Sliding stops to work after first image.\nMaybe you can tell, which part of code is responsible for handling touch-swipes?\nI'll take a look and try to fix the issue.. The problem somewhere here:\n```\nif (e.changedTouches) {\n      each(e.changedTouches, (touch) => {\n        pointers[touch.identifier] = getPointer(touch);\n      });\n    } else {\n      pointers[e.pointerId || 0] = getPointer(e);\n    }\nlet action = options.movable ? ACTION_MOVE : false;\n\nif (Object.keys(pointers).length > 1) {\n  action = ACTION_ZOOM;\n} else if ((e.pointerType === 'touch' || e.type === 'touchstart') && this.isSwitchable()) {\n  action = ACTION_SWITCH;\n}\n\n```\nFor some reason pointer was added to pointers twice. And condition Object.keys(pointers).length > 1 always return true. So action defines as ZOOM.. I tried to add condition\nif (Object.keys(pointers).length > 1 && options.zoomable) {\nBut it doesn't help. Starting from second slide functionality stopped to work. It's a little bit hard to debug, because I'm not able to reporduce it using Chrome on PC.. @Tammeny not yet. I'll spent one or two hours more. If there is no sucess I'll search for another viewer lib.. @fengyuanchen I think better to reopen this issue.. ",
    "heke2929": "@Stafox Agree 2.. ",
    "Ucer": "好的，可能我没描述清楚。以上这个情况是可以实现。但是我现在是一个页面上要有多个相册，像这样:\n<ul id=\"user-1-photo\">\n  <li><img src=\"...\"></li>\n  <li><img src=\"...\"></li>\n  <li><img src=\"...\"></li>\n</ul>\n<ul id=\"user-2-photo\">\n  <li><img src=\"...\"></li>\n  <li><img src=\"...\"></li>\n  <li><img src=\"...\"></li>\n</ul>\n....\n因为这是个列表，所以会有很条数据，我不能根据 id 来写很多个方法：\n```\nconst list = document.getElementById('user-1-photo');\nconst viewer = new Viewer(list);\nconst list2 = document.getElementById('user-2-photo');\nconst viewer = new Viewer(list2);\n...\n```. ",
    "brunoais": "@fengyuanchen Please do mention that in the documentation.\nAlso, why does the size of the container have to be set explicitely?. @fengyuanchen Is it working like that inherently caused by the grid display?. I've noticed that that is not what happens.\nIf I resize the container of viewerjs (inline), it doesn't react to the resize unless I dispatch a resize (DOM) event or .update() and the width+height stay set with the previous values.\nI'm not using v.1.0.0 so I'll test again with that version and then I'll report back. Unfortunately, that doesn't cut it for code that is meant to be more general and not specialized.\nRegardless, it is still unpleasant not being able to tell viewerjs to just be as large as the space around it without using an !important CSS rule, how I did (which I dislike). ",
    "keshrath": ".viewer-container {\n  width: 100% ! important;\n  height: 100% ! important;\n}. ",
    "leefreeF": "现在在vue中引用  看不懂githab里面的英文  使用起来  会报错  又不知道怎么解决. html：\n\n\n\n\n\n\n\nscript：\nimport Viewer  from 'v-viewer'\nimport Vue from 'vue'\nVue.use(Viewer ,{ name: 'vuer' })\n已经在main.js里面引入了. ",
    "Rlcolli4": "+1 we are trying something similar using the viewers (we have a viewer that displays a transparent image of what a user draws over another viewer) and we need the viewer with the users drawing to scale and move appropriately when the child viewer is zoomed in or out, moved, etc. This could be done in this event as well. I tried transitionend the same way I set up viewed and that did not fire for us on pan or zoom.. ",
    "KSSLR": "You can see it in the type definitions:\njs\ndeclare class Viewer {\n  constructor(element: Element, options?: Viewer.Options);\n  destroy(): Viewer;\n  exit(): Viewer;\n  full(): Viewer;\n  hide(immediate: boolean): Viewer;\n  move(offsetX: number, offsetY?: number): Viewer;\n  moveTo(x: number, y?: number): Viewer;\n  next(loop?: boolean): Viewer;\n  play(fullscreen?: boolean): Viewer;\n  prev(loop?: boolean): Viewer;\n  reset(): Viewer;\n  rotate(degree: number): Viewer;\n  rotateTo(degree: number): Viewer;\n  scale(scaleX: number, scaleY?: number): Viewer;\n  scaleX(scaleX: number): Viewer;\n  scaleY(scaleY: number): Viewer;\n  **show(immediate: boolean): Viewer;**\n  stop(): Viewer;\n  toggle(): Viewer;\n  tooltip(): Viewer;\n  update(): Viewer;\n  view(index?: number): Viewer;\n  zoom(ratio: number, hasTooltip?: boolean): Viewer;\n  zoomTo(ratio: number, hasTooltip?: boolean): Viewer;\n}\nThe documentation says it's optional, so it should be show(immediate?: boolean): Viewer. Thanks for the super-fast response!\nWill there be a release with the fix?. ",
    "stogefei": "methods: {\n            imgOnload() {\n                console.log(this.$refs.image)\n                const viewer = new Viewer(this.$refs.image, {\n                    inline: true,\n                    container: '#test'\n                })\n                viewer.view(0);\n                console.log(viewer)\n            }\n        }\n绑定点击事件即可，thank you. \n. ",
    "hduhdc": "我写了demo确实可以多次new，但是如果img的src是动态渲染的时候就会报错。\nncaught TypeError: Cannot read property 'length' of undefined\n    at addClass (webpack-internal:///./node_modules/viewerjs/dist/viewer.esm.js:352)\n    at Viewer.open (webpack-internal:///./node_modules/viewerjs/dist/viewer.esm.js:2473)\n    at Viewer.show (webpack-internal:///./node_modules/viewerjs/dist/viewer.esm.js:1527)\n    at Viewer.show (webpack-internal:///./node_modules/viewerjs/dist/viewer.esm.js:1506)\n    at Viewer.view (webpack-internal:///./node_modules/viewerjs/dist/viewer.esm.js:1652)\n我的代码是这样写的。\nnew Promise((resolve, reject) => {\n        this.getArrayListActive(resolve);\n      }).then(() => {\n        this.$nextTick(() => {\n          this.caculatePicture();\n           // this.getViewEditRemark()\n        })\n      })\n  getViewEditRemark() {\n  let that = this;\n  that.picturesManageModule.viewerObjCard = new Viewer(document.getElementById('imagesContainer'), {\n    // inline: true,\n    viewed: function() {\n      // viewer.zoomTo(1);\n    },\n    url: \"data-original\",\n    toolbar: {\n      zoomIn: 4,\n      zoomOut: 4,\n      oneToOne: 4,\n      reset: 4,\n\n。。。。。。\n. @ @fengyuanchen \nnew Viewer(this.$refs.imagesContainer, {\n        viewed: function() {\n\n        },\n        url: \"data-original\",\n        toolbar: {\n          zoomIn: 4,。。。。。\n\nthis.$refs.imagesContainer我能拿到dom，我看到imagesContainer里面的图片dom结构没有层级关系吧。\n \n\n\n\n\n. <ul id=\"imagesContainer\" ref=\"imagesContainer\" class=\"docs-pictures pic-list clearfix\">\n        <li v-for=\"(item,index) in picturesManageModule.arrayList\" @click.stop=\"preview(item)\">\n          <div v-if=\"item.fileType==1\">\n            <div class=\"pic-box\">\n              <a class=\"img-choose\" @click.stop=\"select($event,item)\"></a>\n              <img :src=\"item.smallPhotoUrl\" :data-original=\"item.bigPhotoUrl\" width=\"100%\" height=\"100%\">\n这是容器 @fengyuanchen . ",
    "johnzhu12": "小图标有，预览console没有错误，但是点击放大按钮，会出现imageData那个变量未定义，感觉就是没有获取到对应的值。算了，我们已经打算放弃IE，IE10也不考虑了，没事啦。😊. ",
    "thoughtAddict": "Not sure how I missed that, but thanks (much) for pointing it out.\nJon. ",
    "VenkateshBaddepuri": "@fengyuanchen ,  I am using viewerJS and How can I add filter method to exclude certain class's of image attribute?. ",
    "jpic": "Thanks, but this fails for me, i think because of url(data ...):\n```\nERROR in ./node_modules/viewerjs/dist/viewer.css 11:0\nModule parse failed: Unexpected token (11:0)\nYou may need an appropriate loader to handle this file type.\n|  */\n| \n\n.viewer-zoom-in::before,\n| .viewer-zoom-out::before,\n| .viewer-one-to-one::before,\n @ ./index.js 19:0-35\n @ multi babel-polyfill whatwg-fetch ./node_modules/formdata-polyfill/formdata.min.js ./index.js\n\n```\nKeep up the great work, love your package.. Yes, but how to add support for url(data ...) to css loader ?\nMy include works when i remove url(data ...). ",
    "xiaojun515688": "因为照片存在不同的div中啊，我这里相当于是有分组的tab选项卡. 照片和装照片的div都是动态生成的. 如果初始化创建一个viewer，我要换不同的galley 应该怎么弄. ",
    "xiyuan-fengyu": "在  var viewer = new Viewer(...);\n之后调用 viewer.show(); 就可以在第一次点击后就可以显示\n如果不需要在多次点击中共享 viewer，需要在隐藏 viewer时销毁掉. ",
    "lintiansheng": "类似微信朋友圈那种图片预览方式不是很常见吗\n在 2018-07-08 15:32:07，\"Fengyuan Chen\" notifications@github.com 写道：\n双击事件在大多数手机端浏览器上不被支持。The dblclick event is not supported in most mobile browsers.\nhttps://developer.mozilla.org/en-US/docs/Web/Events/dblclick\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub, or mute the thread.. 使用的是这个版本：/!\n * Viewer.js v0.10.0\n * https://github.com/fengyuanchen/viewerjs\n \n * Copyright (c) 2015-2017 Chen Fengyuan\n * Released under the MIT license\n \n * Date: 2017-11-05T04:38:31.466Z\n /\n我是使用在移动端的。之前是没有这个问题的。可以左向左或向右滑动下一张图片，突然就不可以了，出现了这个问题:ios左滑或右滑是放大图片的，andoird是正常的。使用的微信开发页面的. ",
    "jewelcai": "Any update on this issue? Or is there some existing way to handle this ? . ",
    "xdanif": "Ok, I can control this, but what is the correct behavior?\n\nDo not allow image to leave anything off the screen?\nDo not allow the image to exit more than 50% of the screen?. \n",
    "gvillo": "Ok I made the bower.json, could you please take a look at my PR (https://github.com/fengyuanchen/viewerjs/pull/177) please? Would be awesome to have this library in bower. ",
    "Succy": "you can try video.js. ",
    "liyuyuyu": "知道了，设置img的alt属性.... ",
    "exnihilo-creatio": "@fengyuanchen await is not needed if the function returns a function that itself returns a promise. Either way it does not work, because the code itself does not presume that promises can be returned, especially how the code foreaches over the images found in the list. . ",
    "hejunMeki": "Look forward to your reply!Thanks!. ",
    "faimaklg": "可以看看https://github.com/faimaklg/vue-viewerjs. ",
    "awplige": "Can you please tell us the structure for the load more.\nWe really need help.\nThanks. ",
    "CongAn": "@fengyuanchen 重新尝试了代码，发现了更具体的BUG表现，当我打开 Viewer ，直接删除最后一张图片时调用viewer.update()必定会出现错误Cannot read property 'length' of undefined。\n删除非最后一张时，第一次删除时正常的，会自动切换下一张图片的大图，但是连续删除第二张时并不会切换。这也是我采用viewer.update() && viewer.view(index)调用方式的原因。\n如果有疑问，请留言，我会尽快复现一个demo。. ",
    "djiest": "Same goes for the '1:1' button:\nwhen zoomed in on a specific part of the image (say the left top corner) and pressing the '1:1' button, the images disappears from the screen. Pressing the 'reset' button re-positions the image.\nIMHO this is a bug, not an enhancement.\n. But it should be possible the center the image on screen when pressing the '1:1' button. . ",
    "giscafer": "the same issue use in angular template. @yakimko i change the viewerjs import in the index.html file and work fine. \nif use the npm modules import in angular.json，Viewer has this issue，to fix this in angular app you can import the static file in the index.html .. ",
    "yakimko": "@fengyuanchen It depends on how viewerjs compressing. Because angular's builder compress your library in another way than uglify-js\nIn angular 5 it was working without problems in prod only version\nIn angular 6 we have the problem with showing in prod only version\nI checked all viewerjs versions and can say that problem in angular 6 builder. > @yakimko But I was using Vue 2.\n@giscafer and I has the same problem in angular. ",
    "jasonlam-swatow": "@yakimko But I was using Vue 2.. ",
    "bulkathos": "\n效果图：\n\niframe中的代码：\n```\nvar vd = new viewer(document.getElementById(pId),\n                                            {\n                                                url: 'layer-src',//原图路径\n                                                container: $(\"body\", top.window.document)[0],\n                                                loop: true,//循环\n                                                scalable: false,//反转\n                                                toolbar: {\n                                                    zoomIn: 1,\n                                                    zoomOut: 1,\n                                                    oneToOne: 0,\n                                                    reset: 0,\n                                                    prev: 1,\n                                                    play: {\n                                                        show: 1,\n                                                        size: 'large',\n                                                    },\n                                                    next: 1,\n                                                    rotateLeft: 1,\n                                                    rotateRight: 1,\n                                                    flipHorizontal: 1,\n                                                    flipVertical: 1,\n                                                },\n                                                hidden: function () {\n                                                    vd.destroy()\n                                                }\n                                            });\n```\n请问该如何解决这问题？\n\n不好意思，请教一下如何在iframe中调用，我的所有图片在iframe中，js也是在iframe中加载的，点击图片的时候我想全屏显示，请问你截图中是如何做到的，谢谢了. ",
    "specYyt": "\n. ",
    "mygu": "\nWhy not just override the existing background color in your own code?\ncss\n.viewer-backdrop {\n  /* Your custom background color here. */\n  background-color: rgba(0, 0, 0, .5); \n}\n\nI tried it, but it changes the overall background color. What I need is some pages, some of which have a black background and some white background.. @fengyuanchen Thanks a lot :). ",
    "Zefeng666": "我也遇到了，请问你解决了吗？. ",
    "mysea": "恕我愚钝，这个网站我看过了，没有提到update方法，也没发现有什么帮助的信息. > ```\n\n src 是默认加载的缩略图，data-original 是点击查看后才加载的原图 \n\n```\n\n是这样的，一开始在页面上加载时，显示的是缩略图，缩略图的数据放在src属性里，设置data-original为“”，然后点击缩略图的时候请求原图数据，设置原图的数据为data-original属性的值，然后调用update方法. > 实在无法理解你这种操作。。你这不是多此一举？！\n因为有些图片比较大，列表显示缩略图，点击具体某张图片才请求原图显示，然后update方法没有效果，所以才来请教您的. ",
    "ccfto": "哦哦,也对哦!短路了可能... 老是想着页面打开就要初始化...可以在图片加载后或者用户选择一张图片后在初始化  . ",
    "xiangxingliyan": "安卓微信内置浏览器、qq浏览器点击背景也不能关闭. ",
    "sdhhqb": "have met similar situation, touch backdrop on the phone can't close dialog \nthanks a lot for fix it so quick.. ",
    "LongYue9608": "\n请描述清楚一点，或者提供可以复现的在线示例。\n\n周末我去仔细看下，然后回复你。. emmm,应该是因为viewer不会动态刷新里面的图片个数~我添加图片后调用了upload方法导致的。 @fengyuanchen . 初始化 viewer = new Viewer($(this).parent().parent().parent().get(0), {\n                    filter(image) {\n                        return $($(image).attr(\"inx\") == \"true\").get(0);\n                    },\n                });. 我确定我点击B类型的图片传的this的指向已经变了,但是update()后viewer中的图片还是还是A类型的. ",
    "codecov-io": "Codecov Report\n\nMerging #235 into master will not change coverage.\nThe diff coverage is n/a.\n\n\n```diff\n@@           Coverage Diff           @@\nmaster     #235   +/-\n=======================================\n  Coverage   74.57%   74.57%         \n=======================================\n  Files           8        8         \n  Lines        1239     1239         \n=======================================\n  Hits          924      924         \n  Misses        315      315\n```\n\nContinue to review full report at Codecov.\n\nLegend - Click here to learn more\nΔ = absolute <relative> (impact), ø = not affected, ? = missing data\nPowered by Codecov. Last update c71fc85...179a3b4. Read the comment docs.\n. # Codecov Report\nMerging #256 into master will not change coverage.\nThe diff coverage is n/a.\n\n\n```diff\n@@           Coverage Diff           @@\nmaster     #256   +/-\n=======================================\n  Coverage   74.59%   74.59%         \n=======================================\n  Files           8        8         \n  Lines        1240     1240         \n=======================================\n  Hits          925      925         \n  Misses        315      315\n```\n\nContinue to review full report at Codecov.\n\nLegend - Click here to learn more\nΔ = absolute <relative> (impact), ø = not affected, ? = missing data\nPowered by Codecov. Last update 400fd83...11cb91d. Read the comment docs.\n. \n",
    "kshin-DOD17": "May I ask how?. ",
    "xiaoyan-hou": "官网demo 快速点击几下，也会卡死， 报错与上面说的一致. > 无法复现。\n我这边虽然不是固定的，但是很容易复现，方便的话我可以录给视频给您。 另外，我看代码发现报错 是因为 快速点击过程中  先调用 hide,  hidden, resetImage等方法，其中resetimage方法中  this.image = null,  此时不知道哪个触发的异步函数，addListener 的时候， element 为this.image 为null， 所以 报错了. ",
    "MartDSam": "I discovered the source of the problem. My body tag was set to height: 100% and that made the page scroll to the top when I opened the gallery.\nI just leave the body with height: auto; that everything is normal.\nNow I do not know if this is a library or browser problem. I use the latest version of chrome.. ",
    "carlshe": "Could viewerjs support print current image?. ",
    "DerNoirProQrent": "The error only occurs if you include it twice on the page.. "
}