{
    "flavienlaurent": "backward compatibility to 2.3+ (https://github.com/biboune/datetimepicker/commit/29f9972c492065cdfe21fb93c886ce314ef25c24)\nFor compatibility < 9, there is more work to do on date format.\n. Thanks for your contribution.\nI would have preferred to keep the existing code for 2.3+ and use the compatible code for < 2.3\nWhat I mean is to test the SDK version in order choose the right code. \n. There is no point in supporting < 2.1 (look at the repartition http://developer.android.com/about/dashboards/index.html)\n. It's a good idea to have themes. Feel free to pull a request ;)\nIt doesn't look like it's a issue.\n. fixed by bounding the min and max year (1902 -> 2037, regarding to https://code.google.com/p/android/issues/detail?id=13050)\nhttps://github.com/biboune/datetimepicker/commit/a2b22cca2239aa826051aa3a78cf651ea06e610b\n. 7f650588c5ce6b3a7e4137ae3cdaeaef82bc8056\n. 089fbd0b006a034f8d533073e5e73d1bf72b035c\n. You can change the first day of week with\njava\ndatePickerDialog.setFirstDayOfWeek(int weekStart); // 1 < weekStart < 7\nFor monday weekStart = 2\n. You can turn off vibration using\njava\nsetVibrate(vibrate)\nnewInstance(listener,year,month,day,vibrate)\n3b7481c5357e5134875c9daf7f3807bf9488e553\n. d0eb5c4d23023e199ea43963cd21ae6553a682f6\n. MariuszGSL is right. There is a specific layout in landscape mode. Works like a charm on my gnex so your issue must be specific on your device.\n. @ericcarboni can you please post a screenshot ?\n. Do you still have an issue on this?\n. @DineshAnandan please take a look on the example. There is a good way to do it.\n@marcusforsberg I'm sorry but I can't reproduce your problem... what's the app?\n@MariuszGSL can you try with the latest version?\n. @marcusforsberg it looks like you have the landscape layout in portrait mode and the portrait layout in landscape mode ...\n@MariuszGSL can you please try with the latest version?\n. @MariuszGSL \n- support v4 library is needed because we want to backport the picker on 2.1+\n- date_picker_selected_date.xml is the same as https://android.googlesource.com/platform/frameworks/opt/datetimepicker/+/master/res/layout/date_picker_selected_date.xml\nWhat are the compilation issues?\n. Unfortunatly, no time to work on ... I hope starting in a couple of days. \n. Good idea. I'm going to focus on this asap\n. Try this https://github.com/flavienlaurent/datetimepicker/raw/master/datetimepicker-library.aar\n. Do you know TimePicker is open source? \n. I didn't start anything on TimePicker. It may be interesting to backport to 2.1+ and to make it more customizable\n. Be more explicit\n. yes go-ahead\n. Thanks ! I check your pull request this day.\n. If others ask for it, I will think again about it.\n. If you have some stacktrace. That d be great\n. Do you have some custom testing situation?\n. Rooted device, ROM custom? Language?\n. What's red toggles details?\n. Not Resource Found on what? It must be on a specific attribute.\nFor your second issue, you have more details in Eclipse logs.\n. great, thanks!\n. great thanks!\n. @edisonw is right. See http://android-developers.blogspot.fr/2012/05/using-dialogfragments.html\nI re add empty constructors 2bb5113a8d09cff29253141f520c02d0c8530f40\n. @KrasimirVasilev if you have this problem again, give use more informations. Thanks\n. What is the problem ?\n. I don't understand well what you want to do.\nAnyway, the TimePicker must be a time picker not a duration picker if it is what you want to do.\n. It's on maven central.\nwith gradle\ncompile 'com.github.flavienlaurent.datetimepicker:library:0.0.1@aar'\n. maybe, we have to wait a little bit, but it's here https://oss.sonatype.org/content/repositories/releases/com/github/flavienlaurent/datetimepicker/library/\n. Yep, just wait\nOn Jan 17, 2014 6:16 PM, \"Benoit Billington\" notifications@github.com\nwrote:\n\nDid you do the last steps on sonatype Nexus by selecting release?\nOn 17 Jan 2014 16:52, \"Flavien Laurent\" notifications@github.com wrote:\n\nmaybe, we have to wait a little bit, but it's here\nhttps://oss.sonatype.org/content/repositories/releases/com/github/flavienlaurent/datetimepicker/library/\n—\nReply to this email directly or view it on GitHub<\nhttps://github.com/flavienlaurent/datetimepicker/issues/27#issuecomment-32617124>\n.\n\n—\nReply to this email directly or view it on GitHubhttps://github.com/flavienlaurent/datetimepicker/issues/27#issuecomment-32624827\n.\n. done\n. It's certainly a great feature but there are lots of changes ;)\n. Double check your import statements.\nIt uses NineOldAndroids https://github.com/flavienlaurent/datetimepicker/blob/master/datetimepicker-library/src/com/fourmob/datetimepicker/date/DatePickerDialog.java?source=c#L19\n. Please double check your import statements before opening issues!\n. Im pretty sure its a problem on your side. Try out the sample.apk. \n\nHow do you use the library? Gradle, source?\n. Obviously the library must be imported like a library ...\n. Please come back with a real bug (clear and detailed). The issue tracker is not forum.\nIf there is a real problem, I will be pleased to fix it.\n. Please check this (ee27402ab8a559c6c3687e4559d537604685f388) out. Tell me if this is what you expected ;)\n. This is a little bit to short as a bug description. Please provide some screenshot, app name etc\n. It's not a small screen, it's a watch :smile: \n. why do you change time_label_size unit from sp to dip ?\n. Yep thanks :)\n. 949b84859966c6aba110fe0fc8731aeab3036dc4\nsome regression... thanks!\n. It's fixed\n. Just fork the library and replace getSupportFragmentManager by getFragmentManager\n. In code there is a check about that\n//NineOldDroids does not work in this case due to denepency recursion. \nanimate = animate && Build.VERSION.SDK_INT >= 14;\nMaybe, @edisonw could throw some light on what's going on. \n. seriously ?\nhttp://docs.oracle.com/javase/7/docs/api/java/util/Calendar.html#MONTH\n. Just read this http://docs.oracle.com/javase/7/docs/api/java/util/Calendar.html#MONTH\n. It's not the original goal of this library but DatePickerDialog extends DialogFragment and a DialogFragment is Fragment so... Try it :)\n. It crashes every time ?\n. You have to use 0.0.2 version\n. You changed import statements.\nhttps://github.com/flavienlaurent/datetimepicker/blob/master/datetimepicker-library/src/com/fourmob/datetimepicker/Utils.java#L8\n. Can you give some details ?\n. date format: http://docs.oracle.com/javase/tutorial/i18n/format/dateintro.html\nmonth in different language?\n. HTC One? Does it work on other devices?\n. It's not a jar file.\nhttp://mvnrepository.com/artifact/com.github.flavienlaurent.datetimepicker/library/0.0.2\n. There isn't anything to be call on dismiss. You can add it using https://developer.android.com/reference/android/app/DialogFragment.html#onDismiss(android.content.DialogInterface) and then just pull a request ;)\n. No you have to do it manually. \n. No it's not possible for now\n. ??\n. No, you can do it yourself easily ;)\n. Don't use Eclipse, use Android Studio\n. Yep the demo apk must be outdated. Thanks!\n. https://github.com/flavienlaurent/datetimepicker/issues/50\n. Be more specific.\n. Instead of fixing the thing on your side, it could be great that you fix it for everyone. Feel free to PR ;)\n. ",
    "anoopch": "Supporting from 2.0 or even 1.5 would be great. \n. Isn't it easy to change the color values and the theme property from the XML files? \n. ",
    "MiguelCatalan": "Yes, but if you want to use it in more than one project, themes are necessary\n. How about a pull request?\n. ",
    "spacecowboy": "My use case is a single app that supports several themes. It's easy to change the existing XML for a single theme, but to support several, a lot of changes become necessary. \n. ",
    "gabrielittner": "The first day of week is determined by your locale. Set it to something like English (UK) or German and you will have Monday as first day of week.\n. Just remove the code that is in the tryVibrate method in the DatePickerDialog. Isn't too hard to find, there are only 8 classes in this library.\n. Yes I did it this way.\nThe color thing worked out of box for me.\n. On my Nexus 4 it works fine.\n. The official datetimepicker is now opensource. Probably will save you some work: https://plus.google.com/u/0/106956142297978494072/posts/gUNMeZ1eFZW\n. ",
    "MariuszGSL": "My phone (Samsung Galaxy Note 2) was already set to the correct locale (English New Zealand). I have also tried English (Australia) with the same effect: the calendar week still starts on Sunday.\nI then downloaded the app \"Locale Select\" and changed it to English (Belgium) and got it working !\nI wonder why the English NZ and Australia locales do not work ?  We certainly use our calendars here with Monday as the first day of the week (unlike in the US).\nIs there another way to force this calendar date picker to permanently show the weeks starting on Monday ?\nFor example, the Samsung S Planner app has an internal setup switch to change the First day of the week setting for its calendar. Most likely all local (NZ/Australia) users will have the same problem with the default locale.\nP.S. Thank you Gabriel for this reply. I was inspired by your beautiful and clean Timetable app and chose this particular date picker for my application.\nBy the way: Your Timetable application date picker has the same locale problem.  \n. Thank you. The new feature/switch works perfectly well.\n. Thanks. I have actually done exactly that, before I sent my original query.\nBut I thought there might be another more \"elegant\" way to disable Vibrate.\nNo doubt, you have done the same in your Timetable app ?\nBy the way: how did you mange to get the colours for the selected month+date to always show in blue in your application DUE-DATE selector ?\n. Thank you. The new switch works very well.\n. Thank you. The fix works very well.\n. On my phone, Samsung Galaxy Note 2, the date picker adjusts itself perfectly in landscape mode, with the two sections placed correctly side by side. The Done button is visible, no problems.\nHowever, I have not tested it on any other devices or different screen sizes.\nYou need to be specific about the device you are using, when reporting these types of issues. \n. I also use Sony Xperia Z tablet with Android 4.2.2 and cannot replicate the problems with switching the DateTimePicker from landscape to portrait and vice versa. Works perfectly in my application and in other applications that use this component.  \nKeep in mind that I have not updated to the latest DateTimePicker code since 7 July 2013, when some critical code changes have been made.\n. @flavienlaurent  I have tried to replace my old datepicker library (from July 2013) in Eclipse with the new one without success. I am getting compilation errors and cannot get it working. \nI had to reverse back to the earlier library from July after several hours of struggle. \nI needed to do the following changes in the original (July) datepicker library code before compiling:\n1. in DatePickerDialog.java   replaced import android.support.v4.app.DialogFragment with\nimport android.app.DialogFragment\n\n2. in layout date_picker_selected_date.xml  changed the order of day and month (swapped them around to have the date appear above the month).\nAlso made the same (#1) change in the new module TimePickerDialog.java\nPlease suggest the best, simplest, full proof method to replace the library code with the new one, in order to test it for you.\n. @raymondlam  Yes, I have copied both libraries from the old Datetimepicker project and tried to compile it without success.\nI don't actually need the support v4 library, as I do not want to use it in my main project. I need to have the \nimport android.support.v4.app.DialogFragment removed from the DatePickerDialog.java code and replaced with android.app.DialogFragment.\nI will explore the gradle and see if this will make a difference.\nThe July version of datetimepicker works perfectly well in my main project on all devices I have tested it and I have no need for the timepicker module.  I also don't want to waste several more hours trying to fight the compilation of the updated library code.\n. ",
    "ericcarboni": "Right, sorry about that. I'm on a Nexus 4, not using any custom DPI settings or anything and the Google Calendar picker rotates correctly.\n. Yeah sure, here it is on my N4 within my app. I'm on stock 4.3 now, but it was still like this on CyanogenMod 4.2.2\n\n. ",
    "DineshAnandan": "Hi here is one serious issue in your sample app.\nIt is easily reproducible from ur sample app.\n1.Click the button. The date picker dialog appears.\n2. Change the orientation.\n3.Tap any date and \"done\".\nWhen all the above three steps over, you cannot see the date as be set.\nplease guide me to handle this issue soon..\n. ",
    "marcusforsberg": "Hello!\nI also have a problem with landscape mode on my Sony Xperia Z running Android 4.2.2.\nIt displays just fine in portrait, and if I open the dialog in landscape mode. However, if I open it in portrait mode and then switch to landscape, this is what it looks like:\n\nAnd the other way around if I open it in landscape, then switch to portrait:\n\n. ",
    "raymondlam": "@MariuszGSL Did you include the android-support v4 library to the datetimepicker library? (Also the nineoldandroids library as well)? That is likely why you didn't have a reference to the support Dialog Fragment. The libraries used to be included in the github but now they have been removed. If you aren't using gradle, you'll need to add them back manually.\n. I've created a pull request #30 with the ability to set the date range.\n. @flavienlaurent I've never had problems with having no constructors. The android docs do not include the constructor, http://developer.android.com/reference/android/app/DialogFragment.html.\nI thought that the empty constructor used in the example was just a reminder to people incase they overload the constructor. By default, if there are no constructors, the default constructor should provide the same effect as an empty constructor. If there is an overloaded constructor, no default constructor will be created so they need to explicitly include a no-parameter constructor so that it can be re-created by the system.\nI was just curious if there were any specific cases where having no constructors would cause an error.\nBut that point aside, we can leave the constructors as in as there is no harm.\n. ",
    "sumedhulhe": "Simple solution for date picker is herehttps://stackoverflow.com/a/52422586/7513281 smart fix for this small issue.. ",
    "chrisonline": "Perfekt, thanks for the update.\n. Ist this also for 2.1+?\n2014/1/21 Benoit Billington notifications@github.com\n\nThe beerware is a valid license ;)\nanyway the license apache 2 was already in the pom I now have put it also\nin the readme\n—\nReply to this email directly or view it on GitHubhttps://github.com/flavienlaurent/datetimepicker/issues/28#issuecomment-32831819\n.\n\n\nMit freundlichen Grüssen\nChristian Grasser\nCOL-ChrisOnLine\nProf. Hans Hömberg Strasse 11, A-6300 Wörgl\nweb: www.chrisonline.at\nmail: info@chrisonline.at\nmsn: info@chrisonline.at\ntwitter: chrisonline1205 http://www.twitter.com/chrisonline1205\nskype: chrisonline1205\nicq: 6730748\n. That's not right! \nYou can compile it with the latest API and it is always compatible with older version as long as you don't use API calls they don't exists on older versions. \n. Yes of course. Download it and add it as project into your Eclipse. \nIn your project add it as library. \n. You can fix it by yourself in the meantime with this workaround.\nAdd following \"items\" to your local apps ids.xml:\n<item name=\"animator\" type=\"id\" />\n    <item name=\"cancel_button\" type=\"id\"/>\n    <item name=\"date_picker_month_and_day\" type=\"id\"/>\n    <item name=\"date_picker_year\" type=\"id\"/>\n    <item name=\"day_picker_back\" type=\"id\"/>\n    <item name=\"day_picker_forward\" type=\"id\"/>\n    <item name=\"day_picker_pager\" type=\"id\"/>\n    <item name=\"day_picker_selected_date_layout\" type=\"id\"/>\n    <item name=\"done_button\" type=\"id\"/>\n    <item name=\"month_text_view\" type=\"id\"/>\nAfterwards it will compile again because it overrides the library ones.. Also you can use now my version:\nhttps://github.com/chrisonline/datetimepicker\nChanges:\n Updated to API28\n Updated BuildTools to newest version\n Fixed problem with API28 and canvas.save(int) mehtod (was removed in API28)\n Fixed AAPT2 resource reference issue (see issue here flavienlaurent#135)\nimplement 'com.colapps:datetimepicker-library:0.0.7'. ",
    "jjpe": "Yes, I was merely hoping some work on that was already underway, yet unmerged (something that is invisible from github).\nTBH I merely wanted to send a private message but I've found no way to do that on github yet. \n. I have other motivations: I'd like to use it in my own project.\nI'll take a look at how much work/code the DatePicker was to create estimate from that the work the TimePicker will take. And if I think I can do it quickly enough (so as to not distract too much from my own project), then I'll pick it up and let you know in a future post on this \"bug\".\n. Cool stuff, thanks!\n. ",
    "edisonw": "I have added TimePicker on my fork: https://github.com/edisonw/datetimepicker, feel free to fork it. \n. @flavienlaurent thanks for finding the reference, I just remember they are used from long time ago, was not able to find the reference to support my claim earlier. :) \n. @raymondlam to be honest I am not sure where they are used as well, it's there in the source code though: https://android.googlesource.com/platform/frameworks/opt/datetimepicker/+/master/src/com/android/datetimepicker/date/DatePickerDialog.java\n. Have you modified the code? It can't crash on line 194...\nmMinutePickerDescription = res.getString(R.string.minute_picker_description);\nBecause 193 ensures that res/R.string are both not null. \nref: https://github.com/flavienlaurent/datetimepicker/blob/master/datetimepicker-library/src/com/sleepbot/datetimepicker/time/TimePickerDialog.java\n. @brejoc it should work via the device setting. (see SleepBot in the play store that uses this)\n. Can you provide a legit license at bottom just for the sake of it? :) \n. um..interesting. yea @flavienlaurent is right that the animation should not happen in 13, in 14 NineOldDroids should have fell back to the SDK implementation of the animation and not throw that tho..\n. ",
    "huteri": "Sorry, I had bad internet connection before I did not realize my issue has been posted, but your library needs api level 11 for style=\"?android:attr/buttonBarStyle\" and   style=\"?android:attr/buttonBarButtonStyle\"\n. ",
    "DrGasmo": "You can solve that by following along with this post: http://stackoverflow.com/questions/14297309/android-button-bar-in-holo\n. ",
    "sureshkumarece": "modified myself. thanks\n. ",
    "Marcellsantoso": "@sureshkumarece mind sharing the modified code? thanks!\n. @raymondlam thanks man! :D\n. ",
    "bytebeats": "Yes, it shows NotFoundedException like this:\n\n. Ah? What does that mean? I didn't do that. Whether did I uninstall some\nsystem services? I had rooted my device...\nPeter Pan\nAndroid App Development Engineer @ Slanissue Technology Ltd.\n_Graduation From International School of Software, _Wuhan University in\nJune,2013.\nSoftware Engineering Major.\nMobile:+86 18501223902\n-------------------------------------------\nInner peace matters.\n2013/12/2 Flavien Laurent notifications@github.com\n\nDo you have some custom testing situation?\n—\nReply to this email directly or view it on GitHubhttps://github.com/flavienlaurent/datetimepicker/issues/20#issuecomment-29605075\n.\n. [image: 内嵌图片 1]ROM is not custom. And Language is English.\n\nPeter Pan\nAndroid App Development Engineer @ Slanissue Technology Ltd.\n_Graduation From International School of Software, _Wuhan University in\nJune,2013.\nSoftware Engineering Major.\nMobile:+86 18501223902\n-------------------------------------------\nInner peace matters.\n2013/12/2 Flavien Laurent notifications@github.com\n\nRooted device, ROM custom? Language?\n—\nReply to this email directly or view it on GitHubhttps://github.com/flavienlaurent/datetimepicker/issues/20#issuecomment-29610526\n.\n. The sample is installed on my device now. But there is an other question. When I imported the master into my Eclipse, the both projects show red toggles. It only can be resolved by setting minSdkVersion and targetSdkVersion of both projects 19. But 19 is higher than the version level of my device. So it a trouble for me. So could you please help me handle this??\n. for these three:\n, it shows Not Resource Found...\n\n.  \n        <!-- API 14 theme customizations can go here. -->\n    \nand android:importantForAccessibility=\"no\" \nAnd thanks for your patience.\n. \n",
    "karabox": "timePickerDialog.setThemeDark(true);\n. ",
    "supermarcos": "Hi Brejoc!\nIt should work perfectly on 24 hours mode. It pretty much depends on the configuration your device has. If your device is configured as 12 hours it will work as AM/PM way, but if your device is configured as 24 hours mode (in Spain we use this as well) it should be shown as that. It displays two wheels, one inside another. Very convenient and creative.\nBye!\n. ",
    "brejoc": "Hi supermarcos,\nand thanks for your reply. I tried this in the demo app and there the picker only shows am/pm-mode - even on my Nexus 4 with German language settings and German time zone, aso. I will take a look at this.\nBye\nJochen\n. @edisonw in SleepBot its working flawlessly. Thanks. Seems like the demo app has a glitch: http://img59.imageshack.us/img59/5282/u75y.png\n. ",
    "JavierSegoviaCordoba": "Hello, I am using this picker but always works in am/pm mode. My phone is on 24 hour mode (the alarm picker and calendar picker for example show the picker with 24 hour mode). Where is the problem?\n. ",
    "Shusshu": "Strange, I can't find it:\nhttp://search.maven.org/#search%7Cga%7C1%7Ccom.github.flavienlaurent.datetimepicker\n. Did you do the last steps on sonatype Nexus by selecting release?\nOn 17 Jan 2014 16:52, \"Flavien Laurent\" notifications@github.com wrote:\n\nmaybe, we have to wait a little bit, but it's here\nhttps://oss.sonatype.org/content/repositories/releases/com/github/flavienlaurent/datetimepicker/library/\n—\nReply to this email directly or view it on GitHubhttps://github.com/flavienlaurent/datetimepicker/issues/27#issuecomment-32617124\n.\n. The beerware is a valid license ;)\nanyway the license apache 2 was already in the pom I now have put it also in the readme\n. Not yet now it's only 4+ but work could be done to support 2.1+ or 2.2+ or 2.3+\n. \n",
    "intrications": "@Shusshu I agree with @edisonw \nEspecially since most (all?) of the code is already Apache 2 licensed and stated as such in the actual source code, it would make sense to use that.\n. ",
    "csbenz": "I found a hack to solve my problem...\n. ",
    "jdegroot": "I'm looking for this functionallity as well, could this be merged?\n. Can you give some examples of these error's?\n. This library can't be packaged as a JAR since it contains Android resources. You should build an apklib or aar, but I would suggest you move from ADT to Android Studio with Gradle, much easier!\n. ",
    "ipcjs": "Why are not merged?\n. Sorry, I did not carefully look at the code when modify this part of the code. \nI just re-read the next code and found no need to change that much.\nI re-submitted the code：https://github.com/flavienlaurent/datetimepicker/pull/75\n. ",
    "artem-sh": "It's a great feature. @flavienlaurent , are you going to merge it in the main project?\n. @flavienlaurent , I'm ready to be a beta tester!\n. I confirm, demo app on LG Optimus (320×480 px, 3 inch) has an issue: the OK button is not visible. This is related only to DatePicker, TimePicker fits into the screen.\n. @flavienlaurent , I created and tested the example you provide with DateTimePicker on LG Optimus - and the OK button was right where it should be! I suppose, the demo apk is juast a bit outdated. It really looks like there is no issue in the current latest (0.0.2) release.\n. ",
    "Yasmik": "Hello,\nThis is very nice library. And i would like to use this more and more projects. Please help me to solve following problem.\nI have used this date picker library to show date selection in  my project. I have to show two date picker dialog. in first dialog,suppose today is 4th Nov and  i select 12th November and in second dialog date start from 12th November of selected year. I did all the things. But in second dialog i face the focus of current date selection. I want to remove focus from current date and move to focus on 12th Nov,. How can i do this? Please help me.\n. ",
    "parin9097": "date.setDateRange(YEAR, MONTH, DAY, YEAR + 1, MONTH, DAY);\non this line i am getting this error, \"The method setDateRange(int, int, int, int, int, int) is undefined for the type DatePickerDialog\" What is a problem? please help me to solve this\n. ",
    "maryemealaoui": "Hello,\nI like this library, and i would like to know if it's possible to disable a specific dates (futur dates) with this library? I'm working on a reservation application, and i want to disable a specific dates giving only the DayOfWeek. I found this limitation in the default android DatePicker/TimePicker. we can only set the max/min dates.\nI will be so thankfull if you give me some suggestions of libraries to implement my solution.\n. ",
    "srodenberg": "Any chance of having a min/max time for time picker to go along with the intervals?\n. ",
    "OmkarAmberkar": "Hey,\nHow can I access the the selected date and time fields from onDateSet() and onTimeSet() methods in my onCreate() method of MainActivity?\n. ",
    "benoffi7": "In Utils this method  \"getPulseAnimator\" also gives \"Call requires API level 11\"\n. In the sample also occurs\n02-08 14:49:34.332: I/dalvikvm(20497): Failed resolving Lcom/fourmob/datetimepicker/sample/MainActivity; interface 718 'Lcom/fourmob/datetimepicker/date/DatePickerDialog$OnDateSetListener;'\n02-08 14:49:34.332: W/dalvikvm(20497): Link of class 'Lcom/fourmob/datetimepicker/sample/MainActivity;' failed\n02-08 14:49:34.342: E/AndroidRuntime(20497): FATAL EXCEPTION: main\n02-08 14:49:34.342: E/AndroidRuntime(20497): java.lang.RuntimeException: Unable to instantiate activity ComponentInfo{com.fourmob.datetimepicker.sample/com.fourmob.datetimepicker.sample.MainActivity}: java.lang.ClassNotFoundException: com.fourmob.datetimepicker.sample.MainActivity\n02-08 14:49:34.342: E/AndroidRuntime(20497): Caused by: java.lang.ClassNotFoundException: com.fourmob.datetimepicker.sample.MainActivity\n. The apk is fine but the source code, not. I downloaded again and the problem still occurs. \nI dont use Gradle. In code time there is no errors and the classes looks fine in both proyect (sample and mine)\n. The library must say \"is Library\" in eclipse?\n. When I mark \"is Library\" and add in the same proyect\n[2014-02-08 16:36:28 - MainActivity] C:\\Users\\gonzalo\\Documents\\GitHub\\datetimepicker\\datetimepicker-library\\res\\values-v16\\styles.xml:28: error: Error: No resource found that matches the given name: attr 'android:fontFamily'.\n[2014-02-08 16:36:28 - MainActivity] C:\\Users\\gonzalo\\Documents\\GitHub\\datetimepicker\\datetimepicker-library\\res\\values-v16\\styles.xml:20: error: Error: No resource found that matches the given name: attr 'android:fontFamily'.\n[2014-02-08 16:36:28 - MainActivity] C:\\Users\\gonzalo\\Documents\\GitHub\\datetimepicker\\datetimepicker-library\\res\\values-v16\\styles.xml:24: error: Error: No resource found that matches the given name: attr 'android:fontFamily'.\n[2014-02-08 16:36:28 - MainActivity] C:\\Users\\gonzalo\\Documents\\GitHub\\datetimepicker\\datetimepicker-library\\res\\values-v16\\styles.xml:28: error: Error: No resource found that matches the given name: attr 'android:fontFamily'.\n[2014-02-08 16:36:28 - MainActivity] C:\\Users\\gonzalo\\Documents\\GitHub\\datetimepicker\\datetimepicker-library\\res\\values-v16\\styles.xml:20: error: Error: No resource found that matches the given name: attr 'android:fontFamily'.\n[2014-02-08 16:36:28 - MainActivity] C:\\Users\\gonzalo\\Documents\\GitHub\\datetimepicker\\datetimepicker-library\\res\\values-v16\\styles.xml:24: error: Error: No resource found that matches the given name: attr 'android:fontFamily'.\n. I have the support library and 9old\n. This http://stackoverflow.com/questions/14650732/no-resource-identifier-found-for-attribute-fontfamily-in-package-android says that change API to <16 but when I do, other errors appear\n. ",
    "Angelmmiguel": "Sorry Flavien :)\nI'm using your library in my project: Arpil Medicines ( https://play.google.com/store/apps/details?id=org.arpil.arpil&hl=es ). When the user click on the button \"add hour\" in the activity \"Add Medicine\", your time selector is launched.\nAn user told me \"I can't select the hour in your application in my telephone ( http://www.lg.com/uk/mobile-phones/lg-E400-optimus-l3 )!\". This telephone has an small screen, so I start an emulator with that resolution. When your time selector is launched I can't see the button \"done\", because the screen is too small.\nFirstly, I forked your library to adapt the time selector on small devices, but later, I thought that the better solution is to change to the classical time selector when the device has a small screen.\nI hope this help. \nThanks and sorry for my bad english ;).\n. That's true jajajaj. Thanks for responses ;).\n. ",
    "mdaisuke": "sorry mistakenly requested pull request\n. ",
    "paulblessing": "\nwhy do you change time_label_size unit from sp to dip ?\n\nTo keep the text at a fixed size even if the device's Font Size is set to Huge. Currently if the Font Size is set to Huge and a two-digit hour is chosen in the time picker, the hour text disappears completely. I'm fine with trying to fix this a different way.\n. I'm having trouble coming up with another way of keeping the text from resizing besides changing the units from sp to dip. There's even precedent in this project for doing so (in the default values.xml file, the date_picker_header_text_size is 14dip, year_label_text_size is 22dip, etc.)\n. ",
    "Jawnnypoo": "I had created an issue based on the bug Paul describes where the 2 digit hour does not show when the system wide font is changed. I would highly suggest approving his commit or finding something else that will work. It occurs on both tablets and phones if their font is set to anything above \"normal\" I pulled in the fixes he made with the dip instead of sp and it fixed the problem for me. \n. ",
    "ismaeltoe": "I don't understand. Did you fix the issue? or you decide to not support 2.2\nand older versions?\n2014-04-01 13:11 GMT+00:00 Flavien Laurent notifications@github.com:\n\n949b848https://github.com/flavienlaurent/datetimepicker/commit/949b84859966c6aba110fe0fc8731aeab3036dc4\nsome regression... thanks!\n\nReply to this email directly or view it on GitHubhttps://github.com/flavienlaurent/datetimepicker/issues/41#issuecomment-39202939\n.\n. \n",
    "3mph4515": "@r4jjin Any ideas or workarounds?\n. @kmlkrk But what if i need to set range for weeks or days, not years?\n. @chiiiky14 No, i didn't.\n. ",
    "kmlkrk": "I implemented this great picker yesterday without issues. I used that for date range:\ndatePickerDialog.setYearRange(1985, 2028);\nIn my case I only wanted current year and the next 15 years so I did something like:\ndatePickerDialog.setYearRange(calendar.get(Calendar.YEAR), calendar.get(Calendar.YEAR) + 15);\nBeware that when I tried setting date range to 30 years in the future it crashed. 20 years was fine. I settled for 15.\n. Vibrate works for me on HTC One M7 but it is very short, almost unnoticeable vibration, which I actually like. Thank you so very much for putting this all together!\n. According to documentation:\npublic static com.sleepbot.datetimepicker.time.TimePickerDialog newInstance(com.sleepbot.datetimepicker.time.TimePickerDialog.OnTimeSetListener callback, int hourOfDay, int minute, boolean is24HourMode, boolean vibrate) { /* compiled code */ }\nFor AM/PM use:\nfinal TimePickerDialog timePickerDialog = TimePickerDialog.newInstance(this, calendar.get(Calendar.HOUR_OF_DAY) ,calendar.get(Calendar.MINUTE), false, false); \nFor 24 hour clock:\nfinal TimePickerDialog timePickerDialog = TimePickerDialog.newInstance(this, calendar.get(Calendar.HOUR_OF_DAY) ,calendar.get(Calendar.MINUTE), true, false);\nThis worked for me!\n. If timeIs24h && hourInt > 12 then hourInt -= 12\nI can  elaborate when I'm back at my computer. I'm writing from phone \n. Here is a function that I wrote about year and a half ago when I had very little Android development experience. Notice that it relies on some variables that are set in my class such as this.hourInt, this.isTime24Hours etc. But it should give you an idea how to format a string manually. Another option is utilizing class SimpleDateFormat but to make it work you may need to use timestamp.\nHere is manual conversion:\n```\n    public String getTimeString() {\n    String timeString, ampm;\n    int tempHourInt = this.hourInt; //create a copy so that I don't change the original hour stored in object\n\n    //create time\n    if (this.isTime24Hours) {\n        timeString = (tempHourInt < 10 ? \"0\" + tempHourInt : tempHourInt) + \":\" + (this.minuteInt < 10 ? \"0\" + this.minuteInt : this.minuteInt);\n    }\n    else {\n        //check if 12 or greater\n        if (tempHourInt >= 12) {\n            //if greater than 12 then subtract 12 (will not subtract of hour is something like 12:34 PM)\n            if (tempHourInt > 12) {\n                tempHourInt -= 12;\n            }\n            ampm = \"PM\";\n        }\n        else {\n            if (tempHourInt == 0) {\n                tempHourInt = 12;\n            }\n            ampm = \"AM\";\n        }\n\n        timeString = (tempHourInt < 10 ? \"0\" + tempHourInt : tempHourInt) + \":\" + (this.minuteInt < 10 ? \"0\" + this.minuteInt : this.minuteInt) + \" \" + ampm;\n    }\n\n    return timeString;\n}\n\n```\nHERE IS BETTER CONVERSION that uses timestamp\n```\n    public String getTimeString() {\n        Date d = new Date();\n        SimpleDateFormat timeFormatter;\n        Calendar c = Calendar.getInstance();\n        c.setTimeInMillis(timestamp);\n    if (this.isTime24Hours) {\n        timeFormatter = new SimpleDateFormat(\"HH:mm\", Locale.getDefault());     //23:24\n    }\n    else {\n        timeFormatter = new SimpleDateFormat(\"h:mm a\", Locale.getDefault());    //11:23 AM\n    }\n\n    c.set(Calendar.HOUR_OF_DAY, this.hourInt);\n    c.set(Calendar.MINUTE, this.minuteInt);\n\n    long newTimestamp = c.getTimeInMillis();\n\n    d.setTime(newTimestamp);\n\n    String timeString = timeFormatter.format(d);\n    return timeString;\n}\n\n```\nPS. I just gave away something that took me weeks to figure out and optimize. All I am asking for in return is that you help someone else once you learn more about programming!\n. @chrisonline is right. I am currently using this library in a project that is backwards compatible to Android 2.3 without any issues. Pickers work and look beautiful even in Gingerbread.\n. I searched for the same thing few months ago and it didn't look easy or\npossible. I switched to android studio and love it. Give it a shot. It is\npretty easy to convert your project. Also adt plugin for Eclipse is no\nlonger supported so you will need to switch sooner rather than later\nanyhow. Good luck\nOn Feb 10, 2015 6:06 AM, \"Shifar Shifz\" notifications@github.com wrote:\n\nI want to implement this datetimepicker in my project, which am building\nin ECLIPSE.\nIs it possible to import this library in Eclipse ?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/flavienlaurent/datetimepicker/issues/91.\n. Something along the lines of: file ->  import and then choose non android\nstudio project.\nDo not use export as gradle project in eclipse. Use the method I mentioned\ninstead.\nOn Feb 10, 2015 8:46 AM, \"Shifar Shifz\" notifications@github.com wrote:\nSo how to migrate to Android Studio ?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/flavienlaurent/datetimepicker/issues/91#issuecomment-73700990\n.\n. It has been out of beta for few months. It is very stable and polished in\nmy opinion\nOn Feb 10, 2015 1:22 PM, \"Shifar Shifz\" notifications@github.com wrote:\npeople says that Android Studio is it's \"early access\" right now, so it's\nbuggy.\nSo should i migrate ?? CONFUSED.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/flavienlaurent/datetimepicker/issues/91#issuecomment-73753223\n.\n. \n",
    "r4jjin": "@kmlkrk  updated MAX_YEAR = 2115 in DatePickerDialog library class.\nJust modified DatePickerDialog, everything works,like charm.\n. ",
    "sohayb": "@3mph4515 :+1:\n. @alexzaitsev :+1: these setters are needed :/\n. ",
    "delajose90": "@3mph4515 Hi, you find a solution for this?, to set range for weeks and days?.\n. You can try this for the range of the year:\ndatePickerDialog.setYearRange(Calendar.getInstance().get(Calendar.YEAR), 2028);\nbut I cannot set the range for the month... I'm still searching for the solution. Any idea?\n. ",
    "MarKco": "I have the same issue. My app supports Android 4+, I don't need SupportFragmentManager but I must have it in order to use this library :-/\n. Am I maybe getting it wrong?\n. ",
    "sunnystatue": "sample apk also have the same problem\n. but only in API level 14 this happens and under 14 for example in 13 does not happen .\nit is big question to me why this happening ,\nplease check it with emulator on API level 14 and 13.\nthanks for reply.\n. ",
    "Hyperion777": "As I wrote here, I found a fix for that.\nyou had to add this check in the setCurrentItemShowing function of RadialPickerLayout:\nif(anims[0]!=null&&anims[1]!=null&&anims[2]!=null&&anims[3]!=null)\nhere is the code:\nif(anims[0]!=null&&anims[1]!=null&&anims[2]!=null&&anims[3]!=null) {\n    if (mTransition != null && mTransition.isRunning()) {\n        mTransition.end();\n    }\n    mTransition = new AnimatorSet();\n    mTransition.playTogether(anims);\n    mTransition.start();\n}else{\n    int hourAlpha = (index == HOUR_INDEX) ? 1 : 0;\n    int minuteAlpha = (index == MINUTE_INDEX) ? 1 : 0;\n    mHourRadialTextsView.setAlpha(hourAlpha);\n    mHourRadialSelectorView.setAlpha(hourAlpha);\n    mMinuteRadialTextsView.setAlpha(minuteAlpha);\n    mMinuteRadialSelectorView.setAlpha(minuteAlpha);\n}\nit looks like in some device (Android 3.x and 4.0),mMinuteRadialTextsView and mMinuteRadialSelectorView are drawn only after getReappearAnimator() is called.\nWith this check, I fixed it\n. ",
    "nikhilesh20": "In the sample application when you are toasting the value of the month it shows june as 5.\n. Ok it is nothing but you don't show june as 5 in the application when you are printing it out as year - month - day right? Sorry about that anyway. \n. ",
    "naz013": "Yes, every time when call to show.\n. ",
    "manpreetpatil": "Please help me I'm also getting same issue. I have fixed the #51 but no luck . Please help me .\n. I have found the issue ...it was at my end.. My xml tag id was conflicting  with lib xml ids.\n. ",
    "matthewrice345": "This issue still exists in 0.0.2\n. ",
    "yiyanghu": "Awesome, I will try then!\nDo you mind updating the last version to be 0.0.2 on the readme page so other people can know as well? Thanks!\n. ",
    "xarlotie": "Yes, I figured. Thanks for the quick response anyways.\n. ",
    "arminbashizade": "figured out number of days in months myself\n. almost done :smile: \n. month names are used in these places:\nDatePickerDialog.java, line 176\nSimpleMonthView.java, line 148\n. ",
    "sgkhode": "how did you customize month names? Can you please share?\n. ",
    "airk000": "Hey, guy. This issue has gone in version 0.0.2.\n. ",
    "writtmeyer": "BTW: TimePickerdialog doesn't check values. I set the current minute of the day (not of the hour) by accident and it accepted that. One check too rigorous, one to loose :-)\nProbably will provide a pull request for that one tomorrow.\n. Updates the gradle files so that a clone works right away.\n. ",
    "Presleyzheng": "this line is error\nit should be \nreturn (year%4==0&&year%100!=0||year%400==0)?29:28;. ",
    "theblang": "@faustocarva Did you ever figure anything about regarding this issue?  We are experiencing the same problem.\n. ",
    "Lesilva": "@flavienlaurent Do you know why this happens? Any idea how to fix this?\n. ",
    "Gaudon": "I've written a hack to work around this by simply setting a local tag within the fragment for the last timepickerdialog that was actively shown on the screen given that only one can be present at a time. This isn't a clean or correct solution, but it will work until a fix is issued.\n. ",
    "prettyvoid": "@Gaudon \nFaced same issue today, the tag that goes in timePickerDialog.show() is not the tag for the RadialPickerLayout thats gets passed to the callback. It's the tag for the listener which can't be accessed.\nI've also implemented a solution similar to what you described, until it's fixed. \n. I created a pull request. I tried to approach it in the most non-intrusive way, as to avoid modifying a whole lot of stuff.\nhttps://github.com/flavienlaurent/datetimepicker/pull/78\nThanks flav\n. ",
    "toddmo": "I emulated Nexus S with API 21 and time picker crashed when I clicked on anything in the dialog. Setting vibrate = false fixed it. I can't debug your issue, just sharing what happened in my case.\n. ",
    "EugeneHoran": "Just change the color values in the datetimepicker library.\n. ",
    "dirkvranckaert": "Same issue here. A solution coming any time soon?\n. ",
    "grupper": "Would be really interested in this as well.\n. ",
    "martin-ohlin": "For those looking for a solution until this library gets an update. setMinDate and setMaxDate is present in the upstream code. It is quite easy to download the code and build yourself a local library.\n. This library is based on code from Google which you can download from, e.g., https://android.googlesource.com/platform/frameworks/opt/datetimepicker/+/master\nThat code has gotten several updates since this library was built an published.\n. ",
    "alexzaitsev": "Could you explain me what are you mean? What is \"upstream code\"? I need this feature but can't find the way to do it with library abilities. \n. ",
    "niket-sminq": "@alexzaitsev Is this fixed now in this?\n. ",
    "prashantwosti": "is this fixed now? any updates? or do we have to modify it by ourselves?\n. whats the status of this? merged?\n. ",
    "kkl260": "I can get the timePicker to show in AM/PM mode, my issue is how do I get the results to show it in that mode? \nFor example, using the sample code, the timePicker shows in AM/PM mode, but the results (in the toast dialog, and if I put in a setText for the button) come back in 24 hour mode. So if I select 7:00 PM in the dialog, the results will still show 19:00\n. Please elaborate when you have the time, I'm really new to programing. Really Appreciate your help!\n. Really appreciate your help. I'm not sure if this was the right approach but I ended up using a bunch of if/else statements to give me what I was looking for. \nFor example something like this:\nif (!DateFormat.is24HourFormat(getActivity())){\n            if (hourOfDay> 12){\n                if (minute<= 9){\n                    TimeButton.setText(hourOfDay-12 + \":\" + \"0\" + minute + \" pm\");\n                }\n                else {\n                    TimeButton.setText(hourOfDay-12 + \":\" + minute + \" pm\");\n                }\n            } etc.....\nI'm not sure if I'll regret doing it this way later on in development because I'm going to need to save the results in a backend.\n. ",
    "JiajunWong": "never mind, I find it.\n. ",
    "vanniktech": "Same here. Have you found a solution @nishant-lb ?\n. Seems like it is not. Since they are other libraries who are still maintained I'm gonna close this one. Thanks anyway\n. ",
    "nishant-git": "yup. \nI changed, datetimepicker->library-> src( java files), all v4 fragment imports to \nimport android.app.Fragment;.\n. ",
    "theapache64": "Ohhky!\n. So how to migrate to Android Studio ?\n. people says that Android Studio is it's  \"early access\" right now, so it's buggy.\nSo should i migrate ?? CONFUSED.\n. Ohky\n. I Imported the project As Existing Android Code into Workspace, and marked it as library. and added v4-support and nineoldandroids. even though it shows some errors in different classes.\n. ",
    "ugonna": "@mareebsiddiqui, if you're interested in this, you could take a look at PR https://github.com/flavienlaurent/datetimepicker/pull/81, where what you described has been implemented to meet the guidelines. The branch is here: https://github.com/Ugonna/datetimepicker/tree/ui-material.\nUntil the PR is accepted or the features otherwise implemented, I think that might be a good alternative for what you need.\n. ",
    "falcon4ever": "Just want to report that it happens on a Nexus 4 running Android 5.0.1 as well.\nLooks fine on the Nexus 7 (2013) running Android 5.0.2\nPossibly fixed at: https://github.com/alexanderbliznyuk/datetimepicker/commit/ac35e34cb9a216c1fe5627f10aad721919120b7c\n. ",
    "lybing": "Hi manpreetsinghsodhi,\nYou can press the blank place to select you time.\n\n. ",
    "moopat": "The months are in the range 0-11 for compatibility with Calendar. See also http://developer.android.com/reference/android/app/DatePickerDialog.OnDateSetListener.html\n. ",
    "kiralaw": ":v ty \n. ",
    "marcochin": "You CAN change it! Just download and import the project as a NEW PROJECT into android studio. It might throw some errors like \"cannot find android-19\", but just click \"download and sync\". Then play around with the colors.xml file in the datetimepicker-library folder. I dunno how to change it programmatically though. I just know you can change some values in the library and it will work.\nafter you're done messing around with the library. you can import into your original project following these directions: \nhttp://stackoverflow.com/questions/16588064/how-do-i-add-a-library-project-to-the-android-studio\n. ",
    "andacaydin": "found some bugs and fixed them. \nalso added the fix for cut off \"current-day-indicator\"\n. ",
    "anshadn": "Anyone can  idea,about this  issue.This will be great library if you have set min and max date range.\n. ",
    "abhi9wagadre": "Sorry the issue. I dint mention the version number in the compile gradle file. Hence closing the issue.\n. ",
    "bruceyu1994": "How can I solve the problem?\n. I have solved it. The \"VERSION\" should be modified bo the specific version,the last version is 0.0.2\n. ",
    "cbruegg": "Flavien, there are many open PRs for this project that don't have any response. Are you still maintaining this project? If not, it would be great if you could add a warning that this project isn't maintained anymore. I'd be willing to take over maintainance, so feel free to link to my repo if you're adding a warning.\n. It looks like these forks differ quite a lot from the original one here, so it would probably be the best option to switch to one of them. I'd bet that my PR here wouldn't even be mergeable into jaydeep17's or lachnam's forks.\nI'll open issues on my fork anyway, but I won't actively try to integrate jaydeep17's changes. If you'd like to do that, please open a PR and I'll have a look.\n. ",
    "SimplicityApks": "It's really a problem that this isn't maintained any more. I've used jaydeep17's fork so far, but he hasn't been active for a couple of months as well. You'd need to activate issues for me to switch to your fork with ReminderDatePicker and I'd need jaydeep's changes as well. Also a release to jcenter would be convenient. However, I just found another fork that looks promising, but haven't got a chance to test it.\n. I'll see what I can do when I get the time... Yeah there are really a ton of changes but important ones as well to keep up with Material design for instance \n. ",
    "darylvimal": "First image is correct when i used this in one app, while second i have used in another app but there the done button alignment gets different from first image.\n@raymondlam @edisonw @nosyjoe @writtmeyer . ",
    "starkej2": "Looks like #136 will resolve these issues. @flavienlaurent any chance of getting this PR looked at soon? Thanks!. ",
    "khaledkhj": "@flavienlaurent Any update on this?. ",
    "tadfisher": "This is a bad habit.\n. Why not keep with the style of the project and use the m prefix, as in mMinDateCalendar?\n. This breaks the API for existing users.\n. This block seems unrelated to the min/max date feature.\n. Why not avoid this painful logic and remove the minYear and maxYear features? They are redundant now.\n. Formatting is off.\n. Formatting is off.\n. More formatting issues.\n. This block is using 2-space indentation when the project uses 4-spaces.\n. More formatting issues.\n. 2-space indents should be 4.\n. ",
    "DenBond7": "Hello. I now. This is IDEA code optimizer. Sorry.\n. "
}