{
    "fzaninotto": "overall: awesome patch! :star2:\n. Thanks!\n. Does phantomjs work as standalone on your config? Can you execute a test phantomjs script?\n. what's your node.js version , and the version of the installed package (npm list output)?\n. bump, since I can't reproduce your issue you'll have to give me more details.\n. what's the node.js version? what's the phantomjs version?\n. not with this service, but phantomjs itself probably does the job.\n. yes the app is not yet tested with node 0.8. \n. Precision: I will provide a Node 0.8 version once Mongoose and ExpressJS release their v3.0.\n. I believe you're looking at the right place - your manipulations should occur before line 84. If it doesn't work, this is a phantomjs problem.\n. It is normal that you don't see the logs - the phantomjs process is spawned\nfrom the main process. In order to debug, you should start the\nrasterizer.js script manually using the phantomjs command.\n2012/7/23 Max <\nreply@reply.github.com\n\nYes, Francois. This is the first place that i tried, but it doesn't work.\nEven when I made a few 'console.log(...)' and add some 'response.write(..)'\ninside 'service = server.listen...' I did not see any messages in console\nor response.\nMy next move: I comment whole file rasterizer.js, reboot nodejs and\nphantomjs — the app works as usual, makes screenshots as usual. But when I\nmade empty file rasterizer.js — phantomjs shows error, when I left in file\nonly one line of code — console.log('rasterizer text') — nodejs shows me\nthis message and makes the screenshot.\nI also tried node-inspector to debug the app. But I never rich inside\n'service = server.listen...' of rasterizer.js\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/fzaninotto/screenshot-as-a-service/issues/6#issuecomment-7173289\n. It does support utf-8 in the HTML (tested with French websites), however this character is added in CSS using a rule that Chrome itself finds strange:\n\n``` css\nmenu_videos-more a::after {\ncontent: ' ▼25bc';\n}\n```\nThe CSS default_all.css has no charset header either. \nAnyway, this is really a phantomjs question, so I encourage you to open the issue there.\n. Adding a delay is the max we can do, as otherwise it' putting the foot into an endless list of possibilities. For screenshots of complex websites involving interactions, use phantomjs directly.\n. Fixed by #14\n. I use the service to grab screenshots of competitive websites at regular intervals. Your caching strategy defeats this purpose, because cache is infinite in time. \nInstead of enabling/disabling cache, just create a cache lifetime setting, with a setTimeout() to remove the cached file using this ttl. Setting the cache lifetime to 0 would just disable the cache.\n. about folders, maybe I don't make myself clear. I think that you don't need a specific cache setting because the user already has the ability to change the tmp dir. Also, each image get deleted one by one using its name after being sent and usin a setTimeout, so you don't need to parse the directory at all.\nIf it's not clear, I'll make another PR to show you.\n. If that worries you, add the files to remove to an array stored in the application, and upon quitting the application, remove those that were not removed before. \n. Why, in your solution, would the process be able to cleanup the cached files more easily? Because you prefix them? Not safe either. \n. Here is my take on cache: #10. Works with and without callback, cleans up cached files automatically except upon kill -9 (but I'm willing to accept that), minimum configuration and readable code.\n. I want caching to be unobstrusive. It's not the purpose of this service to provide a full-featured caching layer, together with various strategies. In fact, I think that the ideal way to use caching here would be to obey http 1.1 headers from the response. \nSo I'll go for my solution (#10). Thanks anyway for your contribution and our discussion. I hope that doesn't discourage you from contributing again :smile:\n. You apparently have a networking issue. phantomjs doesn't seem to be installed properly, too. Not much I can do to troubleshoot this...\nDoes phantomjs run when called as standalone?\n. For that purpose, I should simply add support for plugins, by providing various extension points (events), as in uptime (https://github.com/fzaninotto/uptime#using-plugins).\n. No, the service waits for the screenshot to be written to disk to close the response. But it is possible that the phantomjs browser times out with your slow internet connection. If that's the case, even the cached screenshot should be incorrect.\nWhat's your node.js and phantomjs version?\n. Yes it could. Please try upgrading and report if the problem is still there.\n. I can reproduce the problem, maybe due to a newer version of one of the dependencies. Will be investigating further.\n. Confirmed: upgrading to Node >= 0.6.15 (as stated in the package.json) fixes the issue. I consider this issue as duplicate of #2.\n. I suggest using nvm to install several Node versions simultaneously.\n. Good to go!\n. Duplicate of #13 - except it's with a new version of node this time...\n. Nope.\nThe main culprit is the phantomjs process, which can only communicate with the node.js process using http (on a custom port) and the filesystem (for images). The filesystem is also required for the caching feature. There is an alternative: reimplementing Node.js inside the phantomjs process (that's what phantomjs-node does and it's not pretty). This won't be used in Screenshot-as-a-service.\nYou should report problems 1 and 3 on the phantomjs issue tracker.\nOtherwise, try another cloud provider - a IaaS rather than a PaaS.\n. in npm\nhttps://npmjs.org/package/screenshot-as-a-service\n. Thanks!\n. One single way to do it is enough.\n. It is not - and it is not the purpose of this library. Use another module to do it with GD for instance.\n. Thanks!\n. What are the symptoms of the problem exactly? And shouldn't this be solved on the server side, rather than using JS on the client side ?\n. no, it shouldn't send javascriptEnabled=false, but the server side should know that if the parameter is not sent, it means disabled. \n. Weird. What's your Node version ?\n. IMHO that's a phantomjs issue.\n. Thanks!\n. The height is the one of the viewport, but pages longer than that go beyond the viewport, and the screenshot takes entire pages. In other words, the height parameter is more like a min-height. To limit the height of a tall webpage, you should use clipRect.\n. Thanks!\n. Thanks!\n. Thanks!\n. Thanks!\n. Could you add a line about this dockerfile in the README?\n. Thanks!\n. Thanks!\n. @Metaboll @jayvi I don't see the relation with this issue. Please open a new issue on the right repository.\n. @slarson can you make a PR?. typo: instanciate\n. ??\n. I'd move the log after the actual kill (just like what you did on startService)\n. You should document the expected config\n. I'd prefer if you named the file 'rasterizerService.js', it seems the convention for all node files (including classes) is to start with a lowercase letter - at least that's what is used in this package.\n. Ok. Never seen that before, that's why I asked. I don't think this declaration is necessary, but it does lighten the class structure.\n. -1. KISS.\n. This line should come after the next if() block\n. no no no no. Don't swallow exceptions, at least log them.\n. I don't think it works, the header is already set at that time. Did you test it?\n. Incorrect HTML here, missing a closing \n. Why use floor here? I think it's useless.\n. I've experienced problems with phantomjs if the response is not written immediately. Can you confirm you tested this and it works?\n. would you mind leaving the spacing intact in this commit?\n. why delete the .git?\n. Please find a better name than app, because the /app/app below doesn't make sense. Why nor screenshot-as-a-service?\n. Are all those links necessary for screenshot-as-a-service to run? One should be enough I suppose.\n. I know it's a good practice to leave a MAINTAINER in Dockerfiles, but unless you publish it in a standalone repository you won, this will be maintained by the entire dev community, so please remove this line.\n. ",
    "ghost": "yes the phantomjs rasterize.js script runs extremely fast. takes less than 5~8 seconds for any given page.\n. ",
    "joke2k": "├─┬ config @0.4.11 \n│ ├── coffee-script @1.3.3 \n│ ├─┬ vows @0.5.13 \n│ │ └── eyes @0.1.7 \n│ └── yaml @0.2.3 \n├─┬ express @2.5.8 \n│ ├─┬ connect @1.9.2 \n│ │ └── formidable @1.0.11 \n│ ├── mime @1.2.4 \n│ ├── mkdirp @0.3.0 \n│ └── qs @0.4.2 \n└── request @2.9.153 \n$ node app\nPhantomjs internal server listening on port 3001\nExpress server listening on port 3000\ncurl http://localhost:3000/?url=www.google.com > out.png\nscreenshot - rasterizing http://www.google.com\nscreenshot - sending response\n... generates an empty file\n. $ node --version\nv0.6.10\n$ phantomjs --version\n1.6.1\non Macos\n11.4.0 Darwin Kernel Version 11.4.0\n. ",
    "bgrins": "If you update the node version it will work.  I had the same problem.\n. \"Why use a different path for cached files? It complexifies configuration.\"  I was afraid to just start deleting stuff in the /tmp/ directory.  That's why I put it in a separate directory.  Maybe we could automatically make a folder to work in inside of the /tmp/ directory?\n. setting a timeout for removing a file is not a very good solution IMO.  What if the process is ended?  All those files would never get removed, as the timeouts would be lost.  We could easily modify the cacheCleanup function to use a maxAge strategy instead of maxItems.\n. If I understand you correctly, I don't think be a good idea to run a task like this on the process end event.  If there were a lot of files it may not be able to delete them all before the OS kills the process.\nThe filesystem already has all the data we need to implement your use case - I think it would be great to have the maxAge option to make it work that way - I'll add it in and see if that clears it up a bit. I'll also name the images with a prefix like 'saas_' or something and only delete files if they start with that to prevent accidentally removing others.\n. The reason it could clean files more easily is that it uses the filesystem to read metadata rather than keeping that data in memory.  Imagine this situation: Screenshots 1, 2, and 3 are taken and are meant to be removed from cache in 1 minute.  The server process is killed before their timeout expires.  So you restart the server - those files will exist forever (and they will continue to be served from cache).\nBy allowing it to lean on the filesystem for the storage, when you restart the process it will find files that are due to be removed and remove them outside of the context of the original request.  Does this make sense?\n. I really like some of the stuff you did there, like breaking the fileCleanerServiceout into a separate file and the general refactoring you did on the main route - it is much cleaner there.\nI still think that having the fileCleanerService do a cleanup based on the filesystem and cache rules is a more reliable and flexible way to do it.  The main reasons are that it works across app restarts, would be able share a cache across multiple web processes, and it is more flexible and easier to add different cache cleanup strategies.  To the last point: what if you want to specify a max number of files or a max amount of storage allowed in the cache directory?\nI feel like there is some space to take concepts from both pull requests (simpler configuration, refactored code, and have cleanup run as a background service rather than being directly tied into the rasterization process).  If you still don't agree with this, then feel free to close this PR.\n. I don't think the status code has already been set set here.  I have tested it and it seemed to work fine (showed the 'Error getting screenshot' message)\n. This should be resolved now\n. ",
    "MaximOrlovsky": "Actually yes. I made it on phantomjs, after ask a question. Thanks for\nquick reply. Appreciate it.\n. Yes, Francois. This is the first place that i tried, but it doesn't work. Even when I made a few 'console.log(...)' and add some 'response.write(..)' inside 'service = server.listen...' I did not see any messages in console or response.\nMy next move: I comment whole file rasterizer.js, reboot nodejs and phantomjs — the app works as usual, makes screenshots as usual. But when I made empty file rasterizer.js — phantomjs shows error, when I left in file only one line of code — console.log('rasterizer text') — nodejs shows me this message and makes the screenshot.\nI also tried node-inspector to debug the app. But I never rich inside 'service = server.listen...' of rasterizer.js\nI understand all of this sounds strange, but I tried to find the solution a couple of days and did not found the reason. I really looking for your help.\n\nSystem Centos\nNodeJs 0.6.18\nPhantomJs 1.6.1\n. Yes, its spawned, but I see messages ( console.log(...) ) before 'service = server.listen...' in the console.\n. Everything is ok, it was my fault. Now messages are showing even from 'service = server.listen...'\nThanks for your help. Sometimes we need to write problem to understand it.\n. ",
    "dougalcampbell": "Stange how the Chrome webdev tools renders that -- hadn't noticed it. In the source, it's ' \\25bc', which is valid syntax. However, I suppose the root cause is the CSS file not declaring utf8 in the HTTP headers. Which it turn is probably a side-effect of it being served from a CDN. I'll mention it in the phantomjs issues, as an edge case to consider.\nThanks.\n. ",
    "drewda": "Sounds great. I'd be glad to try figuring out how to add in my desired functionality as a plugin.\n. ",
    "talktough": "If it helps at all I have quite a slow internet connection because I'm in the UK and I'm wondering if its looking for the snapshot file before its finished rendering and writing to the file - could that be the case ?\nA further piece of information - if I refresh the browser it works saying that it found it found the image in the cache.\nThanks\nChris\n. Hi Francois\nThanks very much for replying.\nI have node version 0.6.7 and PhantomJS version 1.6.1\nI just noticed you have a node minimum version of 0.6.15 - sorry about\nthat if I wasted your time - could it be that that is causing the\nproblem ?\nThanks\nChris\nOn 3 Sep 2012, at 16:43, Francois Zaninotto wrote:\n\nNo, the service waits for the screenshot to be written to disk to\nclose the response. But it is possible that the phantomjs browser\ntimes out with your slow internet connection. If that's the case,\neven the cached screenshot should be incorrect.\nWhat's your node.js and phantomjs version?\n—\nReply to this email directly or view it on GitHub.\n. Thanks and sorry again if I have wasted your time.\n\nOn 4 Sep 2012, at 08:53, Francois Zaninotto wrote:\n\nYes it could. Please try upgrading and report if the problem is\nstill there.\n—\nReply to this email directly or view it on GitHub.\n. Thanks\n. Thanks I will definitely give it a try in a bit - I'm just having to stick with my current version for the moment while I finish something.\n. \n",
    "tneogi": "Hi, \nI tried following the steps mentioned here to troubleshoot this problem. I upgraded from an older version of node to 0.6.15 and my phantomjs version is 1.7. \nHowever, I am still facing the same problem and getting this error message 500 Error: ENOENT, stat '/var/www/files/screenshot_cbdb7325fae079dee92f77d4fcc16f58.png'.\nAny pointers or help will be greatly appreciated. \nThanks\nTitash\n. ",
    "avikshee": "Hello I am still getting the same issue.\nThe following are some details regarding the versions I use on my production servers:\nnode -v\nv0.8.12\nphantomjs --version\n1.7.0\nIt would be really helpful if you can tell me a way to fix this issue.\nLooking forward to your reply.\nThanks\n. ",
    "chrift": "I'm also having this problem. I have the error:\n404 Error: ENOENT, stat 'C:\\tmp\\screenshot_cbdb7325fae079dee92f77d4fcc16f58.png'\nPlease someone help!?\nnode -v\nv0.8.22\nphantomjs --version\n1.9.0\n. ",
    "ne0c0de": "I'm also have same problem,\nIt works my first request and then it gives same 404 ENOENT error on every request\nnode -v : v0.10.21\nphantomjs --version : 1.9.0\n. Finally i bypassed this error with installing phantomjs on my mac :)\nMy new error is on my server (Ubuntu 12.04) When i try to run app it gives that error:\nPhantomjs internal server listening on port 3001\nExpress server listening on port 3000\nphantomjs error: 2013-10-28T12:35:58 [WARNING] phantomjs: cannot connect to X server \nphantomjs failed; restarting\n[uncaughtException] [TypeError: Object # has no method 'startService']\nStopping Phantomjs internal server\nOf course there's no X Server on my server so what can i do for this error?\n. I installed the latest version of phantomjs and the latest problem is resolved on my first server.\nNow i try to install it on a fresh server (with x86-64 CPU), i installed all nodejs phantomjs and other components with same commands (sure to compatible with new CPU) but when i try to execute node app it fails and returun empty result (no error or any message)\nWhat is the problem can be there?\n. I noticed that node app was completely f*cked up. I corrected it.\nNow i get on my every request:\nExpress\n404 Error: ENOENT, stat '/tmp/screenshot_c5ed435cf6361229c3a00a89eef131e4.png'\ni changed the tmp directory to another directory and give 777 with chmod command but i got same error again :/\n. ",
    "iplanwebsites": "Same here, interesting thing is that it works when pulled from cache (the second time around)\n. The problem really seem to be with the IO time required to write the file. I tried to add some delay in to the response, but I have troubles figuring out more on this issue...\nNode v0.6.12\nPhantom binary 1.5.0 (osx)\n. ",
    "k3no": "I got it working , or rather Francois set me on the right path with:\nhttp://yourip:3000/?url=www.yahoo.com\nThanks !\n. ",
    "dblooman": "Im also having this issue\n. ",
    "sferoze": "Yah I am having this issue. So many issues this library does not work out of the box\n. I am having this issue. Installing phantomjs binary using brew install phantomjs solved it. But it still doesnt work, anytime I make a request like in the example I just get: \nStopping Phantomjs internal server\nPhantomjs internal server listening on port 3001\n. ",
    "thanpolas": "Pull req on #24 \n. ",
    "waarissyb": "It's possible, I used some code from https://gist.github.com/FiloSottile/2667199\nThe following code \"does the trick\"\njavascript\ndocument.body.style.webkitTransform = \"scale(2)\";\ndocument.body.style.webkitTransformOrigin = \"0% 0%\";\ndocument.body.style.width = \"50%\";\nNext to that, you'll need to set the viewport width at twice as much\n. ",
    "ravz": "we're also hoping to obtain the PDF functionality which PhantomJS via this wrapper - would be great!\n. ",
    "ronthijssen": "When you uncheck the \"Javascript Enabled\" checkbox, it should send \"javascriptEnabled=false\". However, due to the nature of html checkboxes, unchecked checkboxes are not send to the server.\n. I've tested it both on v0.8.16 and 0.10.1\n. ",
    "tcoulter": "I've seen this error when phantomjs wasn't in the PATH. I fixed this by specifying the full path to phantomjs within the configuration file.\n. ",
    "slorber": "hi\nPassing phantomJS options has been implemented in https://github.com/fzaninotto/screenshot-as-a-service/pull/67\n. Seems to have the same problem here: we noticed phantomJS took 2 different screenshots of the same website (and it looks like the difference is font)\n. I have the same problem here.\nIt seems it happens mostly for bad URLs, but also for HTTPS protocol (not always however).\nFor exemple I have some cases where only the HTTPS version fails:\n```\nOK: http://localhost:3000/?url=http://en.wikipedia.org/wiki/User_agent\nKO: http://localhost:3000/?url=https://en.wikipedia.org/wiki/User_agent\nOK: http://localhost:3000/?url=http://leverich.github.io/swiftislikescala/\nKO: http://localhost:3000/?url=https://leverich.github.io/swiftislikescala/\n```\nYes according to what I see, PhantomJS returns a status code 200 with body Error: Url returned status fail\\n\nAny solution?\n. @vbauer thanks, glad to know. I may switch to your service if I can't solve my problems with actual server.\nFor into those having problems with HTTPS I think this is because of this PhantomJS problem:\nhttp://stackoverflow.com/questions/12021578/phantomjs-failing-to-open-https-site\n. Note the pull request solves your TODO Allow to configure phantomjs options through YAML config\n. @mspoodle the current code does not permit to pass options imho, this is why I made a fork/PR\nWith my fork, the option is automatically included by default and is not part of the command attribute but a new option attribute.\nSee \nhttps://github.com/slorber/screenshot-as-a-service/blob/master/config/default.yaml\nSee also the related diff:\nhttps://github.com/slorber/screenshot-as-a-service/commit/eb5aa5460601129b2e38a5cbca0aae2a47501d5b\nWhen passing options to phantomJS, I discovered that these options must be passed at the beginning.\nI mean  phantomjs options xxx.js works, but not phantomjs xxx.js options (as far as I remember).\nThe original code before my PR is\nspawn(this.config.command, ['scripts/rasterizer.js', this.config.path, this.config.port, this.config.viewport]);\nI have also tried to use the command: 'phantomjs ----ssl-protocol=any' but it did not work, \nIt seems you can't call: spawn(\"phantomjs option1 option2\", ['scripts/rasterizer.js', ...])\nBut instead you can call: spawn(\"phantomjs\", ['option1\",\"option2\",\"scripts/rasterizer.js', ...])\nI'm a node beginner and never used spawn before but this is what I noticed, and this is what my fork fixes\nMaybe @fzaninotto will merge it soon\n. @fzaninotto notice I added a PR for this\nI don't really know the original reasons why you did write the statusCode=200 directly because PhantomJS drop the connections. I don't know that behavior but tried to fix as best as I can so that it is easier to debug.\nI've delayed a bit this \"direct writing\" with a useful comment:\n// This has been delayed a bit on purpose because once you write the http status code, \n  // you can't change it in case of error :(\n  // So we only start writing after 500ms so that the page.open has a time window \n  // to eventually trigger an error with the appropriate status code\n  window.setTimeout(function () {\n    // must start the response now, or phantom closes the connection\n    if ( pageOpenCallbackFired ) {\n      response.statusCode = 200;\n      response.write('');\n    }\n  },500);\n. ",
    "lahdekorpi": "Maybe this bug should be cut into two;\n- Orphan phantomjs processes when service dies\n- Crashing if file isn't there anymore\nI'm guessing some request already had the same url at the same time, so one of them removed it before the other.\nSo just wrapping the unlink function into try-catch should work?\n. Any ideas how to improve?\nAs for the processes, I got them with tens of thousands of requests in a couple of minutes...\n. ```\nphantomjs -v\n1.9.0\nnode -v\nv0.10.3\n```\nYeah, I might just change the naming and see how it goes, thanks, but that doesn't solve problems that might be caused by disk errors, etc.\nIt's common to use NFS in this kind of situations and I'm assuming a short network hiccup would crash the whole service.\n. Weird thing is, I cant reproduce it with just phantomjs even when trying to load multiple urls with one process...\nMaybe my testing is flawed.\n. ",
    "curana": "This commit fixes the crash but the response remains empty. I think the caching mechanism needs some improvement.\nThough I could not reproduce the big amount of phantomjs processes.\n. What version of phantomJS are you running?\n- Sorry, I didn't see 1.9 in the screenshot. I did not run it on Linux, I used my Mac. You have this problem with pure PhantomJS as well?\nAbout the crash: The filename is based on a md5 hash of the options. If you switch on caching the time to elapse until you have this error should increase. If you do not use caching at all you can just add e.g. the timestamp to the filename creation.\nFor me the main problem seems to be that this script tries to read the screenshot, fails but does not have a fallback. I dont know if the following process would improve the situation:\n- Read the cache\n- File not found\n- Take screenshot and try again\nI did not completely think about a \"final solution\". Maybe there are other drawbacks to handle in this case.\n. If you apply the patch the service will not crash but return an empty response. I dont know if you could live with that.\nYou could implement a fallback if the file is not found to retry taking a screenshot, maybe with exclusive naming so nobody can delete this one special file which was created for this one request.\nIf I find a great solution I will let yo know.\n. ",
    "HaNdTriX": "I am having a similar Issue.\nThe service works for about 3000 Screenshots. But when it tries to restart itself. The this.rasterizer.kill(); does not work properly.\nIt fails to stop the server somehow.\nPhantomjs process is sleeping. Restarting.\nStopping Phantomjs internal server\nPhantomjs internal server listening on port 3001\nphantomjs failed; restarting\nThis will go on unit I have up to 40 phantomjs servers running.\nI used the latest version of screenshot-as-a-service and:\n```\nnode --version\nv0.11.3-pre\nphantomjs --version\n1.9.0\n```\nDoes anyone know a Solution?\n. Thanks @nkouevda !\nI just tested your pull request. \nUnfortunately it results in stopping the phantomjs process and not starting a new one. \nI believe, that the rasterizer.on('exit', ...) event never get's called in this case.\nRemoving the second startService will result in the same problem.\n. @nkouevda thanks! Works for me!\n. ",
    "ebuildy": "I have same issue, phantomjs process are staying as phantom process ^^\nMaybe a kind of cron task or with supervisord to kill these process ?\n. ",
    "Tapha": "I am too getting this issue.\n. ",
    "nkouevda": "@HaNdTriX How did you test this? I can't reproduce the behavior you've detailed.\n. @HaNdTriX I still haven't been able to reproduce what you said, but I've changed my fix anyway. Instead of removing startService from restartService, killService removes the exit handler before killing the rasterizer. This way, killService actually kills the rasterizer (in the past, it would've restarted itself), and in the case that it fails to do so, restartService will still start a new rasterizer.\n. ",
    "daviddumon": "Hello,\nIt seems there are still some issues with the restartService. Here is my log :+1: \n\nRequest for http://www.mongohq.com/home - Rasterizing it\nSending image in response\nphantomjs error: PhantomJS has crashed. Please read the crash reporting guide at https://github.com/ariya/phantomjs/wiki/Crash-Reporting and file a bug report at https://github.com/ariya/phantomjs/issues/new with the crash dump file attached: /tmp/1f5b12b4-4aaf-bdca-5429b03e-06acd95d.dmp\nphantomjs failed; restarting\n[uncaughtException] [TypeError: Object # has no method 'startService']\n\nThank you for this very useful project !\nDavid.\n. ",
    "PedroGabriel": "Same error in here, using Ubuntu VM at Koding\n[uncaughtException] { [Error: spawn ENOENT] code: 'ENOENT', errno: 'ENOENT', syscall: 'spawn' }\n. ",
    "ryangurn": "This means that you do not have the phantomjs executable in your bin of your system or in the path variable... I had the same issue and thats how i fixed it.\n. ",
    "bergkampho": "Yes, im using  Win7 64-bit. it can be solved by installed phantomjs and located the path.\nHowever, i get the same errors as ne0c0de on every request.\nExpress\n404 Error: ENOENT, stat '/tmp/screenshot_c5ed435cf6361229c3a00a89eef131e4.png'\n. ",
    "ming-relax": "Same error, has any one following this issue? Has any one solved this issue?\n. ",
    "zhangwei217245": "try this :　https://github.com/zhangwei217245/webshot-rest-amqp-service\n. ",
    "glaudiston": "I did solve it by installing bzip2 and tar\nRUN yum install -y tar bzip2\n. ",
    "hquadrat": "Can confirm the solution by @ryangurn . Added a symlink to phantomjs in /bin.\n. You have to escape on your bash\n$ curl http://localhost:3000/?url=www.google.com\\&width=800\\&height=600 > google.png\nNote the \\ before the &\n. ",
    "danigonza": "Yeah I had the same problem! This solution solved Thanks!\n. ",
    "gcrumb": "This will cause exit/restart loops. Better to leave the onExit handler unchanged in startService and then in rasterizerExitHandler:\n-  this.startService();\n-  self.startService();\n. Got bitten by the same problem. Here's what I've found:\nThe problem originates in the phantomjs renderer, I think. If you manually call the render service with an URL that results in this error, you'll see:\ncurl -H \"url: https://bogus.url\" -H \"filename: file.png\" http://localhost:3001/\nError: Url returned status fail\nBut in spite of sending a failure message, the server doesn't return an error status (e.g. 500), so route/index.js doesn't trap this, and goes ahead and adds the filename to the collection. But when it tries to send the non-existent file, you see the above exception.\nHere's a patch that will at least properly trap the error:\n\ndiff --git a/routes/index.js b/routes/index.js\nindex 4cc6d59..c992dd2 100644\n--- a/routes/index.js\n+++ b/routes/index.js\n@@ -11,7 +11,7 @@ module.exports = function(app, useCors) {\n   // routes\n   app.get('/', function(req, res, next) {\n     if (!req.param('url', false)) {\n-      return res.redirect('/usage.html');\n+      return res.redirect('usage.html');\n     }\n\n     var url = utils.url(req.param('url'));\n@@ -75,7 +75,11 @@ module.exports = function(app, useCors) {\n   }\n\n   var callRasterizer = function(rasterizerOptions, callback) {\n     request.get(rasterizerOptions, function(error, response, body) {\n+                       if (body.match(/Error:/)){\n+                               return callback(new Error(body));\n+                       }\n       if (error || response.statusCode != 200) {\n         console.log('Error while requesting the rasterizer: %s', error.message);\n         rasterizerService.restartService();\n@@ -107,10 +111,14 @@ module.exports = function(app, useCors) {\n       res.setHeader(\"Access-Control-Allow-Origin\", \"*\");\n       res.setHeader(\"Access-Control-Expose-Headers\", \"Content-Type\");\n     }\n+               if (!fs.existsSync(imagePath)){\n+                               console.log(\"File does not exist! \", imagePath);\n+                               return;\n+               }\n     res.sendfile(imagePath, function(err) {\n       fileCleanerService.addFile(imagePath);\n       callback(err);\n     });\n   }\n \nThe proper thing to do, of course is to get the rendering service to return an appropriate HTTP response status.\n. ",
    "paulmars": "Thank you for this work!\n. ",
    "jaydiablo": "It looks like that site is responding with its mobile version to the phantom renderer, as you can see from the header of the page (even if the userAgent is forced to match my desktop Chrome browser):\n\nI thought it might be the size of the viewport, but the background is present in 1024x768 on my desktop browser:\n\nOn my ipad, it renders similar to how phantom renders it (no seasonal background, mobile menu at the top).\n\nI'm not certain if this is phantom's fault (not rendering the bg), or this site's fault (not serving the same html/css to phantom).\nRegardless, I don't think this is really the screenshot service's responsibility, since phantomjs is primarily responsible for the rendering (assuming it's not the site's fault).\n. Sounds like you didn't install the dependencies.  Make sure you run npm install after downloading/unzipping the project.\nYou'll need to have NPM installed obviously, I'm not familiar with Windows + Node/NPM but I'm sure there are plenty of resources out there.\n. ",
    "PhilAndrew": "Hi Jay, so I turned off Javascript and it renders OK with Javascript turned off, so I guess its something in the javascript of this page which auto-detects (wrongly) that we are a mobile browser.\nhttps://gist.github.com/PhilAndrew/8220147\n. It still bothers me, why it thinks its a mobile browser (wrongly), I wonder if its Modernizr library?\n. I'm a little bit obsessed as to why.\nIn the QupZilla browser it also shows in mobile format (incorrectly). http://www.qupzilla.com/\nClearly its not a bug of either PhantomJS or your code but I really wonder why.\n. ",
    "lkobashigawa": "Created the pull request from master instead of the pdf support branch, closing this one and opening a new one.\n. ",
    "vbauer": ":+1: \n. Nope, I'm still waiting any news about it from author..\n. To solve this problem, I built my own lunar lander, with blackjack and hookers: https://github.com/vbauer/manet\n. ",
    "deepak1556": "Need to run it with quotes otherwise the shell considers & as end of command. So the right way is\ncurl \"http://localhost:3000/?url=www.google.com&width=800&height=600\" > google.png\n. ",
    "thomastraum": "I am having the exact same problem, any pointers?\n. ",
    "candu": "This was fixed for me by upgrading to phantomjs 2.1.1 - haven't investigated enough to know why.  (I was previously on phantomjs 1.9.8; ran both times under node v6.7.0.). ",
    "camsjams": "I second this, though I know PhantomJS itself has its own list of feature requests for cache options.\n. ",
    "fritx": "Oops maybe each time phantom starts takes a long time..\nThus disposable CLI usage would be unrealistic..?\n. ",
    "charford": "@fzaninotto thanks for reviewing my pull request. I went ahead and made the requested changes, as well as added some docker info to readme. \nA note about the .git directory:\nThe reason I remove it during the build process(Dockerfile), is because that directory is inside the docker image. It's not necessary to keep it inside of the docker image because those files will never be modified directly. Instead, you would make changes to the files in your regular git repo outside of the docker image(your local file system), and then rebuild the docker image.\n. ",
    "mikej165": "I generate about 20,000 screenshots a day and was having a problem with some of the sites that were using https-hosted images. Applying the --ssl-protocol=any option completely resolved it.\n. Have you tried using the full path to the binary. i.e. /usr/bin/phantomjs?\n. ",
    "PS-HaejinChoi": "mikej165,\nPer your comment above, I created the file called development.yaml under the config folder, and\nwrote as follow:\nrasterizer:\n   command: 'phantomjs ----ssl-protocol=any'\nBut it fails to run with the following error message:\n[uncaughtException] { [Error: spawn ENOENT] code: 'ENOENT', errno: 'ENOENT', syscall: 'spawn' }\nIt would be greatly appreciated if you could share where and how you've added the Phantom options above.\n. Thank you @slorber and @mikej165 for the suggestions.\nI will try them and see how that works.\n. @slorber Your solution worked like a charm. Thank you so much.\n. ",
    "mrteera": "+1\n. ",
    "mpochron": "+1\n. ",
    "giray": "+1\n. ",
    "wayrex": "+1\n. ",
    "Metaboll": "Hi,\nI Start to work with your Codeflower and Event-drops. My oppinion about this two codes are incredible.\nI'm a civil engeneering, and I have a programing hobby. I start to play with codeflower for construction butget visualizations and eventdrops for technical planification use.\nIn the case of event-drops I want to put one more child property data ----> duration task. I change the circle shape to rectangular shape but it was imposible for me to get the data duration information and in this case put the width property scalable to duration task property.\nMy problem is with /sc/evenDrop.js code file.\nvar o=function(e){\n                                    e.each(function(){\n                                        d3.select(this).selectAll.....................................\nvar e=d3.select(this).selectAll(\"rect\")\n                                    .data(function(e){return r(e.dates,t.xScale)});\ne.enter()\n                                //.append(\"circle\")\n                                .append(\"rect\")\n                                //.attr(\"cx\",function(e){return t.xScale(e)})\n                                .attr(\"x\",function(e){return t.xScale(e)})\n                                .attr(\"y\",-5)\n                                //.attr(\"cy\",-5)\n                                //.attr(\"r\",10);\n                                .attr(\"height\",10)//\n                                .attr(\"width\",function(e){return e.duration})\n                                //console.log(e.duration);\nI am not capable to put e.duration information from json data inside the attr properties. Could you help me? Thanks, Fernando.\nIt is amazing to see economics construction site butgets in your graphics...... \n. ",
    "jayvi": "Hi,\nI am working on a project where its need to have a url to screenshot feature and test your screenshot-as-a-service but my problem is the flash websites. My question is do you know how to fix it or is that functionality will be included soon? \nCheers\n. ",
    "jnovack": "Its 2015, the problem is Flash, not phantomjs.\n. ",
    "slarson": "There is a fix\n. ",
    "fabiodr": "@slarson Fix worked for me, thanks :)\n@fzaninotto this fix can be very helpful, maybe a merge?\n. ",
    "lukesnowden": "npm install?\n. ",
    "Priyalc": "Hi, \nI am also getting the same error. I have installed npm though..\n\nany solution?\n. ",
    "fadewaif": "same problem. ",
    "bobey": "@fzaninotto if this PR is going to be merged, maybe you should push the associated image to your hub and update README to ease one step further the process.\n. ",
    "phpgeekfr": "Thank for this update. I forked this project into https://github.com/phpgeekfr/screenshot-as-a-service with your pull request. ",
    "varunsharma27": "Same Here :- \n```\nExpress server listening on 127.0.0.1:3000\nphantomjs output: TypeError: undefined is not an object (evaluating 'phantom.args[0]')\nphantomjs output:   phantomjs://code/rasterizer.js:9 in global code\nRequest for http://www.google.com - Rasterizing it\nError while requesting the rasterizer: connect ECONNREFUSED 127.0.0.1:3001\nStopping Phantomjs internal server\nPhantomjs internal server listening on port 3001\nError\n    at Request._callback (/home/vsharma/Desktop/Learning/PhantomJs/screenshot-as-a-service/routes/index.js:82:25)\n    at Request.self.callback (/home/vsharma/Desktop/Learning/PhantomJs/screenshot-as-a-service/node_modules/request/main.js:119:22)\n    at Request. (/home/vsharma/Desktop/Learning/PhantomJs/screenshot-as-a-service/node_modules/request/main.js:212:58)\n    at emitOne (events.js:96:13)\n    at Request.emit (events.js:188:7)\n    at ClientRequest.self.clientErrorHandler (/home/vsharma/Desktop/Learning/PhantomJs/screenshot-as-a-service/node_modules/request/main.js:209:10)\n    at emitOne (events.js:96:13)\n    at ClientRequest.emit (events.js:188:7)\n    at Socket.socketErrorListener (_http_client.js:309:9)\n    at emitOne (events.js:96:13)\nphantomjs output: TypeError: undefined is not an object (evaluating 'phantom.args[0]')\nphantomjs output:   phantomjs://code/rasterizer.js:9 in global code\nPhantomjs process is sleeping. Restarting.\nStopping Phantomjs internal server\nPhantomjs internal server listening on port 3001\nphantomjs output: TypeError: undefined is not an object (evaluating 'phantom.args[0]')\n```. This is happening because we are using PhantomJs 2+. To fix this issue, go to ./screenshot-as-a-service/scripts/rasterizer.js\nAnd add these LOC at the top :- \nvar system = require('system');\nif (typeof(phantom.args) === 'undefined') {\n phantom.args = system.args.slice(1);\n}. ",
    "makehavoc": "@varundbest Thank you.  Your code added to the top of ./screenshot-as-a-service/scripts/rasterizer.js made it work.. ",
    "jgobillot": "I put this line to \"declare\" the use of this variable.\n. ",
    "thulio": "You are right. My bad!\n. I've tested with the url given in the issue description and it produced the expected result (Twitter's search page with lots of results about 'screenshot')\n. Of course not\n. "
}