{
    "gimenete": "Thanks A LOT. I wrote the text very quickly and I didn't check the spelling nor the grammar. Your fixes are online now :) Thanks again!\n. It happened when compiling for iOS device and not for the simulator. It is fixed now. Thank you!\n. It is fixed in the latest commit. Thanks for reporting!\n. Thanks a lot! It is fixed now.\n. I prefer simplicity. For me it's ok a BaseViewController providing some useful methods for \"controlling\" things. I don't think it breaks the MVC pattern.\nYour idea is great. It remembers me the philosophy of Spring Framework. However I just prefer less code. And nevertheless IOS Boilerplate is not intended to be a framework, but a code base to be modified and extended to fit your needs and preferences.\n. BTW thanks for commenting and making suggestions! :)\n. Thank you very much Javi. I would appreciate any contribution :)\n. That source file belongs to ASIHTTPRequest. So you should make your suggestion to them:\nhttp://allseeing-i.com/ASIHTTPRequest/\niOS Boilerplate includes this library. But I haven't worked its source code.\n. I haven't worked with ARC yet. I will study your idea. However somebody has already converted it to ARC:\nhttps://github.com/pmilanez/iOS-boilerplate/commit/228b85e4a59630a35b37a8c9ec3cbb4e9f899926\n. Hey, thanks!\nThinking about the iPad support I was planning a more complex UI. I am thinking about something like this as a default:\nhttps://github.com/raweng/StackScrollView\nWhat do you think?\n. I will take a look to that. Thanks!\n. I have seen it. I'm planning to replace ASIHTTPRequest with AFNetworking. Not only because the original developer has stopped to work in the code, but also because AFNetworking seems faster and with great potential. What do you think?\nThanks for the comments!\n. Hi, I have replaced ASIHTTPRequest by AFNetworking. This is a major change. See the source and the web site for mor infromation\nhttp://iosboilerplate.com/\nThanks for the suggestion!\n. This is because ImageManager notifies all viewcontrollers that the image was loaded. But it supposes that you are using navigationcontroller only. You need to change the code a little to make it working with a tabbarcontroller.\nNevertheless. I have replaced ASIHTTPRequest by AFNetworking and with this changes ImageManager no longer iterates over all viewcontrollers, so this problem has disappeared. This is a major change. Let me know if you have problems migrating the code or you want to keep using ASIHTTPRequest and don't know what to change to make it work.\nhttp://iosboilerplate.com/\n. Hi,\nYour .php script should return an http header ContentType = text/json\nNevertheless, if you cannot change the php script you can do this:\noperation.acceptableContentTypes = [NSSet setWithObjects:@\"application/json\", @\"text/json\", @\"text/javascript\", @\"text/html\", nil];\nbefore calling [operation start]\nHope this helps!\n. Thanks a lot to both of you. I've been on vacances so I couldn't fix it before :)\nNevertheless this dependency is due to ASIHTTPRequest and I'm going to remove it in benefit of AFNetworking. Anyway, thanks a lot!\n. This is great. Thanks a lot. I've already pulled it, and I'm going to try to update the documentation today.\n. I have just updated the web site. Tell me if everything about BrowserViewController is fine\nhttp://iosboilerplate.com/\nThanks!\n. Thanks A LOT for your help, mattt.\nI was keeping BaseViewController just for some short-hand methods and for keeping a shared NSOperationQueue for all requests in a ViewController. And I was keeping ImageManager because I thought it was necessary to verify AFImageCache before doing the request. But as I can see this is not necessary.\nNevertheless I have fixed a few things. See this commit:\nhttps://github.com/gimenete/iOS-boilerplate/commit/d742b82cce5b9bad6e6fe81edde873b50ae18095\nBasically two things.\n- There were missing calls in the DirectionsExample. A [operation start] and a [operation release]\n- Two examples stopped working because the Google Maps API returns \"text/javascript\" for some requests. Maybe you could add this content-type to the default set of accepted content-types for JSON responses?\nThanks again. I will update the web site ASAP with these new changes.\n. ",
    "AquaGeek": "What version of the iOS SDK are you using?\n. ",
    "cullepm3": "4.2\n. ",
    "MdBee": "Adding \"NSDictionary* info;\" to SwipeableCell.h like this solved the problem for me:\n@interface SwipeableCell : FastCell {\n```\nBOOL swipe;\nNSDictionary* info;\n```\n}\n. Adding \"NSDictionary* info;\" to SwipeableCell.h like this solved the problem for me:\n@interface SwipeableCell : FastCell {\nBOOL swipe;\nNSDictionary* info;\n}\n. ",
    "hanonno": "I have the same issue, but for me it's not working in the simulator either\n. ",
    "JaviSoto": "BTW! If you agree on this, I would love to fork the project and do these changes myself ;)\nTell me what you think :D\nOh, and forgive me that I wrote that in English. There are some international developers following the project and wanted everyone to understand :)\n. I agree with you. My idea is basically dependency injection, it's nothing so fancy xD And it would only make sense if you're actually thinking about testing your application mocking the access to the network, which probably someone who uses that class for simplicity, will not be thinking about...\nAnyway I'll keep looking at the Boilerplate progress and will try to help in any way I can :) I hope I can put some of my spare time in adding some cool stuff I have been finding since I started iOS'ing ;)\nGood job and good luck!\n. ",
    "mrgrauel": "I like the idea, but it will be difficult, cause all frameworks like ASIHTTPRequest need to support it or would u like to change the frameworks manually after each update? \n. ",
    "dodyrw": "I'm thinking of adding '-fno-obj-arc'. \nCreate new arc project, add the libs, then set ''-fno-obj-arc''.\n. ",
    "ahmet": "Hi Alberto,\nIt would be great to have these kind of pieces in this project.\n. @boctor's SideSwipeTableView code seems pretty good to me, maybe you can replace current with that?\nAlso @lukeredpath's LRSlidingTableViewCell has some good features like customizable swipe direction.\n. Hi Julian,\nSince this is not a rails project your organization seems a total mess to me.\n. I've applied your patch and made a pull request :)\ngimenete/iOS-boilerplate#15\nThanks for pointing it out.\n. ",
    "markrickert": "Just because the original developer has stopped working on it doesn't mean that all hope is lost. That's the beauty of open source software!\n. I'll take a look at AFNetworking... I've never used it and use ASI very heavily in a lot of my projects. If it can handle POSTs, file downloads to the filesystem, and block callbacks, I may look at porting over some of my projects.\n. ",
    "iamsmug": "Thanks Aberto\nI will give it a go and let you know how I got on.\nCheers\nAnthony\nSent from my iPhone\nOn 31 Oct 2011, at 12:45, Alberto Gimeno reply@reply.github.com wrote:\n\nThis is because ImageManager notifies all viewcontrollers that the image was loaded. But it supposes that you are using navigationcontroller only. You need to change the code a little to make it working with a tabbarcontroller.\nNevertheless. I have replaced ASIHTTPRequest by AFNetworking and with this changes ImageManager no longer iterates over all viewcontrollers, so this problem has disappeared. This is a major change. Let me know if you have problems migrating the code or you want to keep using ASIHTTPRequest and don't know what to change to make it work.\nhttp://iosboilerplate.com/\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/gimenete/iOS-boilerplate/issues/12#issuecomment-2576422\n. Hi Alberto\n\nI have been trying the new iOSBiolerplate using the AFNetworks implementation but have got into some trouble with my JSON that was working on the other release. My JSON is here:\nhttp://www.zombiedesign.co.uk/zing/index.php?searchby=city&city=blackpool\nThe AFNetworks JSON request fails with this result:\ngot text/html\nAny ideas, I have checked my JSON and it is valid?\nCheers\nAnthony\nOn 31 Oct 2011, at 12:45, Alberto Gimeno wrote:\n\nThis is because ImageManager notifies all viewcontrollers that the image was loaded. But it supposes that you are using navigationcontroller only. You need to change the code a little to make it working with a tabbarcontroller.\nNevertheless. I have replaced ASIHTTPRequest by AFNetworking and with this changes ImageManager no longer iterates over all viewcontrollers, so this problem has disappeared. This is a major change. Let me know if you have problems migrating the code or you want to keep using ASIHTTPRequest and don't know what to change to make it work.\nhttp://iosboilerplate.com/\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/gimenete/iOS-boilerplate/issues/12#issuecomment-2576422\n. \n",
    "nbuggia": "Everything looks great, thanks!\n. ",
    "syntaxTerr0r": "I reproduce this too.\n. IMO the issue come from the cell reusing, but even if I clear the graphics context in the prepareForReuse method, the problem still persist. The best way to reproduce this issue is by disabling the WiFi/3G network of the device. I reproduce this each time i'm using a low bandwidth connection (like Edge).\nAny help around here?\nThanks!\n. ",
    "sourcebits-tariq": "Dev,\nHow we can avoid this flickering issue ? It's very annoying.\nI have more than 1000 friend list in a UITableView. So if I scroll down its flickering with previous image almost 20+ times.\n. ",
    "lmay": "Is anyone else having this issue?\n. "
}