{
    "pquentin": "+1\n. ",
    "BSanchez": "+1\n. same here, you are an evil person @hgarc014\n. ",
    "medains": "Read the README.md more carefully\n. ",
    "mbubb": "I muddled my way through this one until I found legibility...\nHow shoudl I know which commits to diff?\n. ",
    "mriehl": "@mbubb the idea is to diff a file and not a specific commit. I think it's even stated in the hint.\n. Yeah I actually had to redo the whole thing because I didn't notice the file in one of the earlier branches. Diffing the file with the other branch's file worked fine though.\n. Well I'm not writing the solution here but it's one you have to check out at some point (it's the one with the data structure related to maps IIRC)\n. ",
    "jplatte": "The README.md said something about a different branch we were on already that also has the file we want to diff, I thought I should make a diff of two branches. I'll just try to diff the file with various older commits after reading this though... I don't really get it but the game has been fun up to this point already :)\n. What? This file does exist in another branch? :D\nWhich one??\n. Haha, found it right before reading your comment. It's the very first one you check out though, not the thing having to do with data structure stuff.\n. ",
    "binnyva": "Ahh. Finally figured it out. You might want to change the text of the README file, I guess...\n\"between this file and the file from before\"\nI thought that was the previous version of the file - rather than when I saw it prevously. \n. ",
    "hgarc014": "closing since this has been resolved...\n. haha, well, I'm glad people are taking a liking to this.\n. glad everyone has enjoyed it =)\n. Yeah, I can attempt to write something. I didn't do all of this by myself @drami025 helped greatly. \nExtending the game will most likely come in the future. We would have to think of more ideas and collaborate further. \n. thanks\n. Thanks, this will prevent finding the solution.\n. Yes, windows doesn't use bash. \nCurrently, I don't think you would be able to run the bash files in the game unless you install Cygwin as suggested here: http://stackoverflow.com/a/6413405/3926051\nIf the above suggestion works or doesn't work, please let me know. I'll think about a more universal solution.\n. @samfishman I believe I just fixed that issue.\n@InPermutation i'll add the additional information to the README for windows users.\n. done\n. added OS detection suggested by @issue-reporter  in #12 \nLet me know if you have any other issues, thanks\n. as @riqpe  stated your above code breaks GNU/Linux. However, if the code @riqpe works on OSX i'd be happy to add it.\n. leaving awk '{print $1}' on Linux causes the answer to always be given, unless it is set to \nawk '{print $2}'\n. @issue-reporter \nI think your idea is valid. I just don't which commands would be needed for each version.\n@conroywhitney\ngrep is grabbing more than just the string needed to validate the string. \n. @conroywhitney  Well, you're code given for OSX doesn't work for linux. I assume a solution as stated by @issue-reporter  might be the direction to go\n. I have added some links to help people that are not familiar with git\n. this has been implemented, please visit the end of the game \n. @rhoit Yes, you can skip some things. The game is completed. However, I may have not removed some of the older branches that are not useful anymore.\n. see #18 \n. see #18 \n. thanks!\n. I'll check this out tomorrow\n. thanks\n. You shouldn't be on the keyboard branch.\nOn Jan 13, 2015 7:49 AM, \"Elkan Wang\" notifications@github.com wrote:\n\nGot to the step where I need to update origin/keyboard, but it seems that\nhttps://github.com/hgarc014/git-game-remote.git no longer exists.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/hgarc014/git-game/issues/20.\n. It is completely up to you. You could put the link showing you completed it, maybe a picture of the site that you completed it. It's completely your choice.\n. Yes, you are correct, but for most cases without solving the hints you wouldn't know which branch to go to. Although, there is the possibility of jumping ahead.\n. Sorry, I don't speak that language, but google translate appears to say \"Admission guide for MEM lesson\", which I do not understand.\n\n对不起，我不会说那种语言，但谷歌翻译出现说“入学指南MEM课” ，我不明白。\n. i see, thanks\n. If you sent an email it will be sent out later today. \n. unfortunately, I never got around to automating this. So, I do it whenever i remember. If you followed the instructions at the end of the game, you should have received the badge right now. \n. I'll take a look at this\n. ah yes, i'll fix that\n. That's an interesting idea, but I feel that git is fairly simple. Something easier than what it is now would kinda be more like a tutorial, and there is a lot of tutorials online.. I understand, but I think part of the fun of the game is figuring out what you need to do on your own. Often times people are going to present you with a problem, and you have to figure out the solution. \nI agree that a list of training resources would be nice, but it also gives away solutions without effort. For instance a few quick searches lead to:\ngit history\nhttps://git-scm.com/book/en/v2/Git-Basics-Viewing-the-Commit-History\ngit merging\nhttps://git-scm.com/docs/git-merge\nexamine and roll back commits and other historical events\nhttps://github.com/blog/2019-how-to-undo-almost-anything-with-git\nWhich provide some useful information that help  with levels. \n. I completely understand, but I'm busy right now. I'll definitely consider it in the future though. ",
    "kamalbanga": "@basicallydan I think this game is rather good for work, especially since it's just 30 minutes and it rather boosts enthusiasm.\n. ",
    "qaisermazhar": "When it comes to issues on projects, I could live with this ;) nice work hgarc014!\n. ",
    "djouuuuh": "Had a lot of fun here too. Thanks for this moment @hgarc014 ;)\n. ",
    "Dalker": "Thanks for this game, @hgarc014 , that helped me get back to git (after a long break on mercurial...)\n. ",
    "FireAlkazar": "Great job! So much fun:)\n. ",
    "lks": "I agree, with my team, we test your game on the lunch time and it was a very great moment.\nThanks @hgarc014!\n. ",
    "2c2c": "this was a 'do something to help the world' assignment for a class with pretty short deadline\nI dropped by seeing this now had 600 stars. wowie. you probably have free manpower to get this extended to cover just about any feature you want. good luck\n. ",
    "InPermutation": "Yes; calling over to bash works with this syntax:\nC:\\code\\git-game> bash -c 'cd /c/code/git-game ; ./outputclue.sh FILE'\nSo does opening a bash prompt and executing it there:\nC:\\code\\git-game>bash\nbash-3.1$ cd /c/code/git-game\nbash-3.1$ ./outputclue.sh FILE\nI think this issue and issue #2 can both be solved with a similar solution.\n. Yeah; git bash is actually what was on my %PATH%, so I can confirm it works perfectly for this question.\n. ",
    "thantos": "If you grab the text, put it in a new file, then use certutil to decode it, it works :).\nI made it through the game with windows and notepad (lazy).\n. ",
    "riqpe": "Maybe add text on master README telling people on windows to use Cygwin.\n. Calling md5 breaks GNU/Linux compatibility. Use openssl md5 instead. Note that where md5sum prints md5 hash first and the source second, openssl md5 prints source first, md5 hash second and so you also need to change awk to print the second word piped to it.\ndiff\ndiff --git a/outputclue.sh b/outputclue.sh\nindex c0a3939..52266c4 100755\n--- a/outputclue.sh\n+++ b/outputclue.sh\n@@ -13,7 +13,7 @@ if [ \"$file\" = \"nextclue_input.cpp\" ];then\n   if [ ${merges} ]; then \n     while read p; do \n       for w in $p;do \n-        if [ `echo $w | md5 | awk '{print $1}'` = $bug ];then \n+        if [ `echo $w | openssl md5 | awk '{print $2}'` = $bug ];then \n           echo -e $mesg; \n           exit; \n         fi;\n. Suggest using sed \"s/^.*= *//\" instead of awk to support both.\n. Using grep makes absolutely no sense. The purpose of awk is to select the hash from command output, where as grep returns the full line if the regular expression matches.\nSolution proposed by @issue-reporter sounds good as it avoids using openssl.\n. ",
    "russell-miller": "If you're using the Windows Git, I'd suggest using the \"Git Bash\" program that it ships with. It behaves pretty much exactly like bash and has several linux utilities included.\n. ",
    "samfishman": "Also most Macs have md5 instead of md5sum, which causes a separate issue with outputclue.sh.\n. ",
    "conroywhitney": "Same issue here. I created pull request #10 to fix this on OSX.\n. Thanks @hgarc014 and @riqpe. I ceated pull #11 to address these suggestions.\nOn OSX, I needed to keep awk '{print $1}' instead of your suggestion of awk '{print $2}'. However, I am unable to test this on GNU Linux.\n. Closing this pull request in favor of #12 which uses grep instead of awk.\n@riqpe Would you please test #12 on Linux? I think this might be the fix we are looking for. Thanks!\n. @issue-reporter Would you test to see if Win32OpenSSL implements the openssl md5 and openssl base64 -d syntax from this pull request?\n@hgarc014 Is grep performing as expected on Linux? (before/after the code4life merge?)\n. @hgarc014 Thanks again for this great game/tutorial.\n. ",
    "joshkehn": "Also absolutely trivial to bypass the need to create a merge commit by examining outputclue.sh\n. ",
    "x-ji": "It still didn't work on my OS X 10.10... even with the detection code in place. It seemed to totally fail to detect my OS. I had to manually modify the script (change to md5sum and -D) to proceed. I'll try to see what happened in a while.\n. ",
    "issue-reporter": "Can't we do some version-specific editing to the shell script instead?\nWindows isn't here but some users are also experiencing a lack of the base64 executable.  This also avoids the whole issue with openssl, sed, etc.  @conroywhitney  @hgarc014 \nif [[ \"$OSTYPE\" == \"linux-gnu\" ]]; then\n  csum=\"md5sum\"\n  b64=\"base64 -d\"\nelif [[ \"$OSTYPE\" == \"darwin\"* ]]; then\n  csum=\"md5\"\n  b64=\"base64 -D\"\nfi\n. ",
    "marado": "You need to READ the README :-)\n. ",
    "segmentationfaulter": "thank marado, it would be great if you add clues to your questions, like some stuff to read, thus the game will not only be playable for the folks who already know how git works.\n. ",
    "mallowigi": "I agree. If I didn't know about git blame and git tag I would have already left the game\n. ",
    "edusantana": "How about update the github README adding that info?\n. ",
    "rhoit": "@hgarc014  just curious i never entered so many branches.. are you still developing it?\nbranch keyboard ( guessing i missed this one ) is this in current game play?\n. man git branch\n. ",
    "dsernst": "Likewise. :+1:  Manually changing the conditional to test against \"darwin14\" seems to have fixed this.\n. ",
    "StefanScherer": "I have the same problem. I fixed it this way:\nbash\nif [[ \"$OSTYPE\" =~ ^darwin* ]];then\n. ",
    "webglider": "Read the commit messages in the log and then checkout to the required commit\nThis may be of help: https://www.atlassian.com/git/tutorials/viewing-old-commits\n. ",
    "hashay": "Commit\n. ",
    "daniellebron": "Thanks!\n. ",
    "robertwhitebit": "@Ulca \nNo, you aren't doing something wrong and you are right, there is no branch Level 1.\nLets take a look at the Readme again :wink: \n\n...\nYour first task is to checkout the commit whose commit message is the answer to this question:\n\nWhen a programmer is born, what is the first thing he/she learns to say?\n\n\nSee you on level 2! :smirk_cat:\n. ",
    "Ulca": "ooook :) I simply didn't get the clue - don't know the joke or smth. Thanks for the answer - and for the game :)\n. ",
    "wizicer": "Let me explain, he roughly want this game to be a Mandatory Lesson of Master of Engineering Management, however, I don't think it's proper for this repository to be targeted to such specific mission.\nI just suggest to close this issue.\n. ",
    "stre4m": "What i need to write in email or empty mail only with subject will be enough?\n. ",
    "KellyWay": "I was doing it wrong\n. ",
    "ParaplegicRacehorse": "True but, honestly, I wasn't able to get past the first mission; even with the help of a cheatsheet. I'm new to git. I can clone, commit, push, pull, branch, checkout, and sometimes I even can remember how to merge branches. Examining commit histories is beyond me and is NOT an introductory skill.\nSo a tutorial on the basics - clone, push, pull, branch, checkout - okay, not necessary because there are plenty of very good ones, some of which are interactive. Getting into merging and commit histories, though, I haven't found any good training material out there. I have been looking, but not very hard.\nPerhaps it would be enough to link to intro tuts and other training sources from the README? Something like\n[source,asciidoc]\n== Git Beginners\nThis is game not yet for you. To play, you will need to know the following:\n.Needed Skills\n Basics - clone, commit, push, pull\n Moderate - diff and merge\n* Moderate-Advanced - examine and roll back commits and other historical events\nIf you can't already do these things, there are good training materials for this.\n.Training Resources\n http://someplace[someplace]\n http://someotherplace[someotherplace]\n http://placethree[placethree]\n etc...\n----. Oh, how many times I have tried to understand whatever jargon git-scm is written in; and failed; miserably. That book is written by a programmer, for programmers. Pro Git is better, but still not good. Someone should write \"Git for Laymen\". I'm a non-technical writer who uses git to handily keep versioned backups of my writing. I thought git-game could make an interesting distraction, periodically, when I need one; and teach me something new at the same time.\nI was wrong. What I need is https://vim-adventures.com[vim-adventures] for git.\nI consider the issue closed.. ",
    "chinesedfan": "Type git commands as README.md says. And you will find hits of the next level.. ",
    "wwpstl": "thanks , i have knew. "
}