{
    "gmetais": "22d6a28\n. Much better, i'll add a link to the full grunt-phantomas index.html report\n. 3db4703\nClosed\n. Done.\nLet's change version number to v0.2.0\n. Fixed\n. 4cdd31e\nFixed\n. I'm wrong, the size is not always the un-gzipped one. Sometimes the size is correct, it depends on the server-side configuration.\nLinked to this bug in Phantomas https://github.com/macbre/phantomas/issues/137\nThis problem is in PhantomJS and cannot be resolved yet.\nI'm gonna change the wording in the results and the title of this issue.\n. Closed by f1753756\n. Done 9b18e61 !\n. Thank you @rupl !\n. Thanx a lot @mrmrs, but @rupl was first #12 !\n. You're right!\nBut i'd like some default limits for phones and tablets already built-in, just like desktop.\n. I cannot reproduce the problem.\nDo you have an HTTP proxy?\nCan you try with phantomas directly and tell me if it works?\nInstall phantomas globally:\nnpm install -g phantomas\nThen test google.pl:\nphantomas https://www.google.pl --verbose > phantomas-results.txt\n. Hi @damianbl !\nI upgraded phantomas in v0.2.9. Do you still have this issue?\n. Hi @dlecan !\nYou are right, this is not possible for the moment. But it wouln't be difficult to implement. I'll have a look.\n. @dlecan I just released version 0.2.7 with a new phantomasOptions option.\nCan you try it and tell me if it fits your needs ?\n. Closed by v0.2.9\n. Closed by v0.2.9\n. Hi @Zolmeister!\nNot sure it is possible for the moment, as grunt-devperf is working over grunt-phantomas.\nBut i know grunt-phantomas creator Stefan Judis has plans to remove the grunt dependency on his project, and then i'll probably do it with grunt-devperf too.\n. Hi @lucalanca!\nI didn't have in mind long urls when creating the tool!\nI don't have much time to work on grunt-devperf so let's just enlarge the max number of characters. I'll push a new version to NPM.\nThanks a lot for reporting the bug.\n. Good point! I'll release the fix. \nThank you!\n. Hi @gfdickinson,\nSorry there is no plan to support such feature...\n. Hi Jake,\nI'm sorry but I can't maintain this tool anymore. You might want to take a look at https://github.com/gmetais/YellowLabTools or https://github.com/gmetais/grunt-yellowlabtools.. Hi Daniel,\nWhat do you mean?. RIP, my first large OS project 😢 . ",
    "suevalov": "@gmetais, this will work: \njavascript\nphantomasOptions: {\n    tablet: true\n}\nor \njavascript\nphantomasOptions: {\n    phone: true\n}\nAt least, it emulates viewport and captures correct screenshots. Create separate grunt task with this configuration and tweak limits like you want.\n. ",
    "damianbl": "No, I haven't any proxy. I will give phatnomas a try and let you know.\n. ",
    "dlecan": "It works perfectly, thank you!\n. ",
    "stefanjudis": ":+1: \n. ",
    "lucalanca": "@gmetais this is a good option. I tend to over-engineer a lot. Big thanks for the update.\n. ",
    "rsnickell": "@gmetais Glad to help!\n. ",
    "DanielRuf": "As the project is not actively maintained anymore it should be archived in the repository settings and get a proper warning when installing with npm.\nAlso probably https://docs.npmjs.com/cli/deprecate. "
}