{
    "mathiasbynens": "Thanks @nimbupani for pulling this in! Closing this request.\n. Just added some more notes regarding the media query approach mentioned above: http://mathiasbynens.be/notes/touch-icons#comment-2 I couldn’t get it to work correctly on iOS 4.2. Can anyone verify this using the test case at http://mathiasbynens.be/demo/touch-icon-media-queries?\n. Thanks for confirming, Alex. Seems like the @sizes approach is the way to go (if we wanna use HTML). It’s also shorter and simpler than using media queries.\n. > look at what HTC Desire (sense UI) has done to the icon :( https://picasaweb.google.com/shichuanr/Web#5580314561398569618\nLooks like it doesn’t recognize the touch icon and uses the favicon instead, no? Some older Android versions do that too (1.6, for example).\n. We should really specify line endings and stuff in a .gitattributes file. I’ll be glad to add this if you want.\n. Okay, before I add the .gitattributes I gotta merge this. Hope that’s okay.\n. Mobile is not just about iOS though. Did you test any other devices?\n. > I think this issue is dependent on an old release of the YUI compressor. Its MQ parsing used to be rocky and it’s potentially resolved now.\nI still see this issue in YUI Compressor 2.4.7, so I guess it’s a new bug.\n. FWIW, I filed a bug with YUI Compressor for this, in case they would like to fix it on their end: http://yuilibrary.com/projects/yuicompressor/ticket/2528146\nThe * hack is used to target IE7 and IE6. Did you try the _ hack for IE6? Does it have the same issue?\n. /cc @necolas \n. ",
    "umbrae": "A little cleaner:\n<script type=\"text/javascript\"> \n(function () {\n  var filename = navigator.platform === 'iPad' ? 'splash-big.png' : 'splash.png';\n  document.write('<link rel=\"apple-touch-startup-image\" href=\"/media/images/mobile/' + filename + '\" />' );\n})();\n</script>\n. ",
    "shichuan": "hi umbrae, nice idea.\nI think the javascript way does not only add the ipad support, it also makes the html head looks cleaner.\n. closing the ticket\n. beside the point mentioned by alexgibson, another reason is because if you use \"device-width\" and then rotate the screen to landscape, browser will re-size the viewport to use the new dimensions. This is useful because you can use onResize or media query to measuring the new width.\nBut if you hard-code a number like 640px, your browser will not be able to pick up the orientation change.\n. @brianblakely, if you read the section 'Dynamic viewport sizing' of this blog here: http://blogs.msdn.com/b/iemobile/archive/2011/01/21/managing-the-browser-viewport-in-windows-phone-7.aspx\nisn't this the most ideal scenario? compare to the other options mentioned in the blog :)\n. @brianblakely, btw, I have added user-scalable=no, think it's a good idea, thanks :)\n. initial-scale=1.0 is used to prevent iphone from zooming the page when viewed in landscape mode\n. nice idea :) just not sure if it's too early to use this for now though (cos it's mentioned in the doc that only iOS 4.2 starts to support sizes), i have just created a gist: https://gist.github.com/849231 (similar to brianblakely's git at https://gist.github.com/581868), and added as a comment to the index.html\n. wow, this is an awesome article, think we can rewrite based on this. thanks for the link!\n. look at what HTC Desire (sense UI) has done to the icon :( https://picasaweb.google.com/shichuanr/Web#5580314561398569618\n. @mathiasbynens: don't think they are using favicon, more like they just scale the touch icon\n. thanks for pointing it out, yea, it should be removed.\n. a quick update:\n- adopted Mathias' home icon boilerplate \n- site.. currently at http://www.lab.highub.com/mobile-h5bp/ (moved to https://github.com/nimbupani/html5boilerplate-site)\n- need video\n- docs on viewport/devicedpi (https://github.com/shichuan/mobile-html5-boilerplate/wiki/Mobile-Viewport)\n. additional stuff:\n- sync some updates with main boilerplate on 17th\n- some final update on wiki\n. updated list:\nupdate doc/site abt mbp/a new disqus (state changes, yet anther 'fucking chart' for supported devices, and again resig style)  (26th)\na demo page for mbp (27th)\ntag it (27th)\n. hi, thanks. this is fixed now :)\n. hey johnnycadelco, this is a nice idea.\nIt is now changed at: cdc7f3a8b27b382754f639ca4500d7682843aa17\nalthough we won't merge mobile w desktop version, but i think it's good to add this, cos it makes the stylesheet more mobile specific, leave space for people who are into mobile first idea. \nthanks!\n. thanks for the tip! it's added.\n. Hi stereobooster, at the start of the mobile version, I took out the 'events' portion of the jQuery mobile and used it here, but now that has been removed (due to the reason that maintenance might be a problem). \nCurrently what is in by default is only the normal jQuery.\nHowever we have a simple helper: https://github.com/shichuan/mobile-html5-boilerplate/blob/master/js/mylibs/helper.js\nI have tried a few frameworks, think we are still lack of a 'killer' framework for mobile js. xui is worth considering. \nwe will release mobile boilerplate soon, think can leave this issue open for a while. get more feedback on this.\n. @stereobooster: if you'd like to add, feel free to start a page under _Beyond the Boilerplate_ section :)\n. @bellerus: i have also been trying out, so far I feel Zepto is the best to use if you are not 'faking' any native experience.\n. I have been thinking of adding in normalized events to our MBP helper: https://github.com/shichuan/mobile-html5-boilerplate/blob/master/js/mylibs/helper.js\n1. this includes touch/click virtual events: touch events, gestures, orientation\n2. normalized virtual events that bind to both mouse and touch events and keep whatever bubbles up first (so it works for both browsers with native support and those don't)\n3. the events are independent from any framework\nand maybe also custom scrolling events\n. @andreasbovens: i believe this (http://dev.opera.com/articles/view/an-introduction-to-meta-viewport-and-viewport/) and other articles are written by you, thanks for the tips, really worth considering.\n. @andreasbovens: the reasons to have noscale are:\n1. to disable the scaling is not to disable scaling all together, one can always use gesture events to do the scaling. \n2. to disable it is only let developer to decide what they want to zoom (image, text). for a gmail app as an example, there is no point to zoom the entire app if all you want is the font-size to be bigger.\n3. if you don't zoom a native app, I don't know why would want to zoom a web app/site.\n4. i know common practice doesn't mean best practice, but i can't find a simple example of web app that actually allows scaling, (facebook, gmail, google reader, twitter all have default scaling disabled, they don't seem to have any issue)\njust my thoughts :)\n. @paulirish: there IS specific difference between userscalable=no and minimum-scale=1.0, maximum-scale=1.0\nminimum-scale=1.0, maximum-scale=1.0 are used to prevent auto-scale when your screen orientation change on iPhone.\nhttp://www.blog.highub.com/mobile-2/why-we-have-user-scalableno-in-mbp/\n. @paulirish: to quote the ticket under main boilerplate https://github.com/paulirish/html5-boilerplate/issues/37\nat the first point, about this 'Matt Henry, a front-end dev mobile expert, recently from Yahoo!, now at Viget...'\nI have just surfed both Yahoo! and Viget on my iPhone, it seems this 'expert' is not practicing what he is preaching :) \n. just to reopen and put some update to this issue with all the fixes:\n1. first Jeremy and I had long discussion at http://www.blog.highub.com/mobile-2/a-fix-for-iphone-viewport-scale-bug/, we kinda worked out a version with compromise on both sides\n2. Mathias has the updated version of the fix with some comments to the issues: https://gist.github.com/901295\n3. Paul and I have updated the fix to include this in mbp: 2a012db0dc62a2ae9e275d6a538ae43192903f3a 04cc4480ab1701c063729cb2bcd6db01605ade3b \n. @paulirish: i am thinking if indeed we can't find a case that device- is needed, we can change this in both main bp and mbp\n. just blogged something about this: http://www.blog.highub.com/mobile-2/firefox-4-for-android-and-mobile-boilerplate/ :)\n. @toddanglin: MBP is meant to be used for mobile specific or at least mobile-led/mobile-first web app/site.\nyour point is valid if you want to build a 'one web' version of a site renders differently on not only diff sizes but also diff platform (desktop/mobile), but that is beyond what MBP is doing or trying to do.\n. add in more different views, here is joemarini's view: http://twitter.com/#!/joemarini/status/52783296035303424\n. @scottjehl: thanks for the info, Joe has updated his view: http://twitter.com/joemarini/statuses/52817670625689601\n. this was fixed with v1.1 release 05b541c1345a696d4a30a4d2f5beddd5289048b8\n. just combined both ideas, in case in future we remove 'device-' 323d9813d306b6247f32747c3ec11835d2c20308\n. this is added to \nhttps://github.com/shichuan/mobile-html5-boilerplate/wiki/Server-side-redirection-script\nand \na5c3c3d2e0d054bd8d31cc426566c73780107feb\n. this whole issue is worth debating, and i expected people to bring this up, thanks for sharing your view. :)\nfor your first point, iphone 3 has 163dpi , iphone 4 has 326dpi, in order to make sure cross-browser consistency, both rendered as 163dpi by default. same as Windows phone. So when you say 'what will happen when we force 160dpi on retina screens', the answer is nothing will happen, because it's already 163dpi by default, and it doesn't cause any problem. so when we do target-densitydpi=160dpi Android, it helps to align with ios3/4 and windows mobile.\nfor your second point, we can use CSS media query, exactly for this reason, we need a base line, and 160dpi is the baseline.\na few additional points: the biggest reason we need a baseline is because the difference in dpi on mobile is HUGE, and a screen is really SMALL. these two factors are the reason for a ''''baseline''''''. :)\n. i may still need better way to explain this idea.\n. @andreasbovens:\n1. Android version 2.2 and below by default uses 160dpi, so on my HTC desire HD (480x800), it used to read 320x533\n2. A recent update to Android 2.2.1 causes this changed to a medium dpi\n   The problem is with this medium dpi, it's hard to find a relative reference baseline\n   Now on my HTC, it reads 369x615 (of course I agree when you when rotate the screen, this will be vice versa) \n3. if i set target-densitydpi=160dpi on Android 2.2.1, it read 320x533 again\n4. all other devices: iphone3/4, windows mobile 7 and other devices, all uses 320 as a baseline.\nyou can read Bryan's idea at his post below, he mentioned about Android using 160 as baseline for everything else to relate to 320. i believe at the time of his writing, it was still android 2.2:\nhttp://mobiforge.com/designing/story/effective-design-multiple-screen-sizes\n(search for the keyword: 160 ppi screen density)\n. @andreasbovens: i reopened this issue. yea, just to clarify the reason we removed it is at here: http://html5boilerplate.com/mobile/#thankunote\nTo use 160dpi doesn't have a big impact to the viewport (not as much as device-dpi), but we decide to leave that for the user to decide. Mainly because if a design is fluid, there is no need to make the portrait width 320 cross-browser.\nWe also fixed a lot other issues also stated in on the site, thanks for highlighting the issue in demo, i am gonna change that now :)\n. @Takazudo it's already been removed in 1.1 release :)\n. added -o-min-device-pixel-ratio to the mq bp, thanks to andreasbovens! closed by 956274b671648207df1e8808b0ffb48261b2c654\n. done :)\n. thank you for pointing this out, i think this is valid concern, especially for people who just copy and paste part of boilerplate without going into knowing more about the features.\n. this is no-longer in the comment, so closing this issue.\n. hi micah, this should be fixed by now.\n. Because I an testing this on windows with Cygwin now, i am just saying based on my past experience with unix: isn't chmod an expected command to tell the system how much access it should permit to a file? So i feel it's the expected behavior. Do correct me if i am wrong. \n. Hi micah, I have just confirmed with a couple of unix expert users. i don't know why the first time you don't need to chmod, but the short answer is: it depends on your system permission, nothing we can do to set the permission when distributing. :) so it's not an issue.\n. thanks for pointing this out, it's changed 4820b5948348a292be66936e6dafd531ca0222f7\n. @necolas: initially the reason to put in index.html is to get some attention, so people are aware of the fact that these things are executed by default. \n. @crozynski: thanks for notifying us this, indeed, we launched v1.1 before Andy Clarke's 320 and Up. I will notify Paul and Divya on this.\n. @crozynski: It was just some misunderstanding, you could use either one, they are both mobile first :)\n. do you mean for example:\nbody {max-width:640px;}\n@media only screen and (min-width: 800px) {\n  body {max-width:2400px;}\n}\n. cool :) it will be great if you could send over a pull request :) I will test it out separately as well!\n. thnx a lot for this, I also read the discussion you had on respond.js, Modernizr, will test this out :)\n. I think the respond.js fix is great, for the max-width one, i think we might need some further discussion. \nthe number 640 i used in the discussion came from Bryan Rieger's yiibu.com. I asked Bryan about the 640, and he mentioned the number had some issues with certain devices. and we came to the conclusion that it's fine to be used for personal projects, but as a general baseline rule, maybe at the moment, it's the best to stay away from imposing any specific value.\nso how about we do the respond.js fix first, and leave the second one for more discussion?\n. @necolas the mq fix was cherry picked (b28e0ff31a8f167a4096b1344d1ad3cab2d7abd0) and respond.js was updated (6bb189037fa37f07b2bdfc10d8545957c44af17b).\nagain, thanx alot!\n. hmm, make sense, maybe we can use something like:\n\n// Hide URL Bar for iOS\n// http://remysharp.com/2010/08/05/doing-it-right-skipping-the-iphone-url-bar/\nMBP.hideUrlBar = function () {\n     /iPhone/.test(MBP.ua) && !location.hash && setTimeout(function () {\n          if (!pageYOffset) {window.scrollTo(0, 1);}\n     }, 1000);\n};\n\n. it's updated here: 41606f0648690b6271a284e38ba4665575bf7fc1\nthanks bro, for raising this issue :)\n. sorry, I didn't catch the part when you said using both is redundant, appcache is mainly for offline viewing, it's not exactly the same as server conf caching. could you further elaborate a bit?\n. @pyrsmk: at least in some browsers, it seems to be the behavior.\n. there is an issue I encounter during development lately, by default, the file that includes the appcache file will be cached even if it's not stated in appcache file, one problem is that when I make a change in the html, i can't see the change with refresh, I encounter this in Firefox and Chrome. I am still trying to figure out the best way to cache/cache bust with appcache. \n. Steve Souders listed down many flaws of the current app cache approach: http://www.stevesouders.com/blog/2011/10/03/improving-app-cache/\n. sure, i think this is pretty cool, can go into the helper file :)\n. since we are discussing the possibilities of dropping any non-default media queries support, so I am gonna this ticket. \n. other things that will be considered/not considered to add on to helper.js:\nwill be considered:\n1. Device Access (quite unique to mobile, maybe we can add geolocation polyfill to helper.js in future?)\n2. Offline and Storage (i am still trying to find some time to learn more about https://github.com/wycats/jquery-offline)\n3. Performance and integration (using web workers to speed up mobile web app: http://www.ibm.com/developerworks/xml/library/x-html5mobile4/index.html)\n4. Web Sockets (maybe too early?)\nwill not be considered:\n1. Multimedia (will not be considered)\n2. CSS3 (will not be considered, reduce image/graphic files, smaller overall file size)\n3. Canvas/WebGL/SVG (will not be considered, not so unique to mobile, same as desktop)\n4. Semantics (already taken care of by modernizr, nothing unique about mobile, same as desktop)\n. arh, actually that's a good idea, thank I am gonna change to minified version. :)\n. it's only ok if we don't consider any desktop IEs :) \non IE9 with debugger, we can see the class on html tag is gone because it seems to ignore the condition: \n\n. additional info, even if we disable the modernizr, the class=\"no-js\" is gone \n. @SimonEast: thanks for the suggestion, we changed this in a recent commit: 41606f0648690b6271a284e38ba4665575bf7fc1\n. @ianstormtaylor i guess this is more of a matter of personal preference? :) is it mentioned somewhere as a better coding convention? \n. ok, changed to single quote, it's more consistent now. thanks :) \n. cool, good idea to compress and move closer to the app portion, thanks!\n. @Mdinf: thanks for sharing your research info! we only want the hiding address bar to happen on page the content exceeds the window height.\nThe reason we only target iOS is because even if the page height exceeds the window area, the page won't hide top bar, but on Android, it will automatically hide when the height exceeds.\n. yeah :)\n. I think once h5bp v1.1 is out, we can start to merge most part (or all) into mbp too.\n. this has already be merged with the the current release. closing this issue.\n. @davidcalhoun: I have checked with Scott, he explained why both 0 and 1 are used :) https://gist.github.com/1183357#gistcomment-50003\n. cool, it's much better this way :)\n. it's merged into the style.css, thanx! \n. +1 yes, looks a lot nicer \n. the only interesting bit I found is their touche.js, which does some very basic touch event normalization. the rest are either existing things we have or things not needed as a default in my opinion.\n. Hi Simensen\n1. In version 2.0, we no longer have the default.appcache anymore, as you mentioned, it should only be used by developer during build process.\n2. We would like someone to help with the wiki and site! For one thing, we try to add more information to Mobile HTML5 features support table at: https://github.com/shichuan/mobile-html5-boilerplate/wiki/HTML5-Mobile-Support\n. @mieky: thanks for the fixes :)\n. @terryteo: yea, a test case would be preferred, when would this issue occur?\n. @terryteo, thanks, it must be unsupported DOM 2 event listeners in IE, I will rewrite parts of the code. \n. merge this issue with #63, and closing this\n. I have committed some change: 5a9d6080459d6cf5b4b520f99a1518821757bba9\n@ryanseddon: since I don't have a BBOS6, would you mind helping to test this? :)\n. @ryanseddon yes, and i did put your link in as reference. \n. I have tested on older IEs. It's working. I am closing this ticket for now. Please re-open if there is any issue.\n. I am on Android 2.3.3 at the moment, it seems that this hack doesn't work on the webkit browser. I am thinking we can mention this method in the wiki instead of adding to the js. would be better? :)\n. ah, my Android is not rooted, think I will run some more test first to see\n. added it as an optional method in helper.js :)\n. MQs is definitely better than JS hack. wondering the market share of iOS5 at the moment and the adaptation rate.\ndidn't know iPad required two splash images :) \n. Same issue commented here: https://github.com/h5bp/html5-boilerplate/issues/824\n. two changes have been made:\n1. the scale fix function is excluded from the default index.html but the method is still in helper.js\n2. @alexgibson you are right, MBP focuses on mobile apps, so initial-scale=1.0 is removed \nhere is commit 7d0b0e1f28be6bbb860e097f05f2c34a2acae03d :)\n. yea. i agree. wspl and GA for mobile has just been removed.\n. @necolas: Do you mean when we say mobile, we should mean devices that could fit into the pocket? Initially, I thought tablet could be grouped together with mobile phones, but the reality is that for any complex applications, the UX/layout are so different, media queries are not so ideal in solving the problem. If this is what you think as well, then maybe we could consider dropping it.\n. thank you for reporting this, this is an issue with the compressor. I have submitted a ticket to them at: http://yuilibrary.com/projects/yuicompressor/ticket/2528134\n. thanks bro!\n. @caillou thanks :) this has been updated with the latest hide url bar script\n. @jakearchibald: thanks for the highlight, I think this is a valid point to revert back to the version without the preventDefault()\n. @jakearchibald thanks for the pull request, I have tested on Android 2.3.3, can't see the same issue, I have created two test pages: test-a.html has a fastButton and location.window, and test-b.html has a click event listener, test-b.html doesn't get the click event triggered. \nIs this what you meant? or otherwise, could you provide a test case of yours? \nhttp://www.highub.com/t/test-a.html\nhttp://www.highub.com/t/test-b.html\n. thanks for the test cases and video :) I ran the same test on 2.3.3, can't really replicate the issue. But from the video, it shows the bug surely happens on 2.3.4. \n.  I will tweet about this and ask more people to help test it.\n. Help needed to test a possible bug in Mobile Boilerplate on Android 2.3.3 and above. \nTest case:\n1. go to page http://www.highub.com/t/1.html\n2. click on the link in the page\n3. let us know where the page goes: a. a page with link to Google, b. directly goes to Google\nPlease help to let us know the result by commenting below, thanks :)\n. I think it's pretty clear that this bug happens on more than one version of Android. I will proceed to merge the pull request. Thanks all :)\n. thanks for pointing this out, it was now fixed on the site :)\n. Because we have moved the repo from individual account to a h5bp account, which causes the linking issue, i will fix the shortened URLs.\nAbout the scale bug, I replied the question on stackoverflow, if the post does not appear clear, let me know. We can figure out better way to present it.\n. hmm, I can't seem to replicate the issue. which command did you run? ant build ?\n. @jitendravyas thanx for the pull request :)  merging.. \n. @RCanine thanks for raising the issue, the links are now fixed.\n. thanx for pointing this out, updating... :)\n. thanks for the information, I am just wondering if this should fall under wiki or it shall be included in the css by default\n@necolas do you think this is considered normalization? \n. I agree with Necolas on this, there is no way to support older IEs if the goal is to move web forward, however, I added a note in the style wiki page about this issue: https://github.com/h5bp/mobile-boilerplate/wiki/The-Style. closing this ticket\n. we could add this to the road map to make the helper functions more jQuery like, with selectors. For now, the functions are pretty much standalone.\n. hey, we did some update to the function based on scott's new script, but this looks great, so is it possible to have a new pull request? :)\n. Cheers :)\n. @CWSites \nThe code snippet is mainly used to collect the list of devices in RewriteCond\nWe can't provide each rewrite scenario here, but you can customize RewriteRule to anything you want. \n. The fix isn't a perfect solution, Scott is doing some research on an alternative approach but also not a perfect solution. Now we are executing it on index.html, we can think about disabling it by default. \n. here is the link of Scott's approach: https://github.com/scottjehl/iOS-Orientationchange-Fix\n. @pavelloz thanx for the request :) \n. @bistory Alex Gibson has done some research and testing on this, it seems status bar is 20px high on iPad, which is where the number came from. \nReferences:\nissue #66\nhttp://miniapps.co.uk/blog/post/ios-startup-images-using-css-media-queries/\n. @alexgibson in this case, i will do the following:\n1. use the above method in the index.html\n2. minified and commented out by default\n3. link to this issue for more info\n. @benjaminma i will check on this, anyway we are going to release a new version soon this week. \n. I have checked the release it's working fine. closing this ticket. if you continue to experience the issue, feel free to upload a test case and we will check again :)\n. @enridp these are some very good points, MBP.viewportMeta = $('meta[name=\"viewport\"]'); has jQuery dependency, so either we shall check that or instead use MBP.viewportmeta = document.querySelector && document.querySelector('meta[name=\"viewport\"]');\nthere should only be one of the two in the code\n. @necolas @sergiolopes the app maybe a news app or a map that someone wants to print, so personally, i think we should move this declaration outside the @media print block. +1 ?\n. @necolas The chance we need them + running on Windows Mobile 7 is quite low. shall we just remove the rules with star hack?\n. @oiva thanks for raising the issue, this is now fixed :) \n. that's a better idea and i think this should be discussed in the ant-build-script project. Since the build script is now a separate project in the Boilerplate repo, I will open up a ticket there and see what we can do.\nUpdated issue location:\nhttps://github.com/h5bp/ant-build-script/issues/38\n. @maaalex @alexgibson yes, the block of code contains event.preventDefault(); was added to address issue #78. This script is specifically made for the <button> elements, so it is not for <a> links :)\n. I visited CSS3menus.com and the site doesn't exist. It will be better if you can put a test case somewhere :)\n. gonna merge it first and will add a comment later\n. ",
    "alexgibson": "If you use width=device-width and initial-scale=1.0 then iOS, WP7 and Android should scale the viewport to a 320 pixel width by default, regardless of their actual resolution.\nAlso using a set width such as 640px will produce most probably unwanted results on larger displays (think tablets, iPad etc.)\nI think really, width=device-width is the ideal for cross platform results.\nBut I do agree that fluid design should be thought about right from the start.\n. Using \"device-width\" plays no real relation to whether your design is fixed width or fluid. It simply sets a default scale for the mobile viewport. It can apply to both and work quite happily with either technique. \nI use device-width on a daily basis with fluid layouts, so I don't know why you think there is a problem here?\n. @brianblakely sorry think I misunderstood you. My bad  :)\nStill, keeping in mind this is a mobile boilerplate - i think we should be actively encouraging fluid layouts here, so I still think device-width is the most sensible default.\nEven if you have a fixed-width layout in portrait (320px), you can still use a quick CSS media query to handle a landscape orientation (480px) at the same time as using device-width.\n. Mathias has posted a great up to date piece on apple touch icons here: http://mths.be/avz\n. I can confirm that it does not appear to work correctly on iOS 4.2. On my iPhone 4 I still get served a 52x52px icon using the media query method.\n. Perhaps now that Zepto supports FF / Opera and is soon to go 1.0 we could reconsider this using a fallback to jQuery for IE?\n<script>\ndocument.write('<script src=' +\n('__proto__' in {} ? 'zepto' : 'jquery') +\n'.js><\\/script>')\n</script>\n. I'm +1 for using Zepto by default - but perhaps also include jQuery so dev's can have a choice if IE mobile is a target for their web app?\n. Ok, lets do this\n. I'm running Android 2.3.5 here and it does work, but is slightly less responsive than iOS (probably about 300ms delay before active styles show on touch)\nIf you decide to include this, anywhere you see fit is fine with me :)\n. Yeah status bar is 20px high on iPad, so you need to adjust the startup image height accordingly for each orientation :)\n. To add a note: I make this recommendation above in the light that mobile boilerplate's primary purpose is to create mobile websites (not strictly web apps). If I'm not correct in this assumption, then maybe consider removing this property from the main H5BP instead?\n. Seeing as the initial-scale bug is soon to be fixed in iOS6 and there was no test page provided to detail this issue, I'm going to close this.\n. Have you tested using the latest script in boilerplate? The example in this issue is out of date. If there is a problem with the latest version, please open a new issue. Many thanks\n. I think something like the FT web app would benefit from a nice print stylesheet, so +1 for keeping something in there as a placeholder for print media. But I think placing the declaration outside of the @ media print block is a bit confusing, especially considering the obscurity of the bug? Maybe we could look to simplify the default print media block and remove the @ page part?\n. Closing this as the issue will be addressed in an update to normalize.css\n. Going to merge this as there have been no objections and this issue has been open for quite some time\n. Actually, given that MBP has now been split into normalize.css and main.css I'm not too sure what is best here. Maybe this should more be an issue for normalize, given that the majority of star hacks are contained there?\n. Nice approach, although reading your GitHub readme I think this could cause undesirable effects to the way people commonly use media queries in their sites, due to it using width=device-height? I'm sure you can work around it ok, but having to do so for a single bug on one platform kinda seems overkill in the grand scheme of things? I'm also not sure about the possible effect of applying CSS transforms to very large pages on some sites… would need more testing.\n. I'd like to see how older versions of iOS handle this, as well as the iPad. But even if performance was ok, I think the other side effects are perhaps just as significant as the limitations of other solutions mentioned here.\n. Going to close this issue as I think there are better existing solutions.\n. Thanks for this Ben, you are right will see to updating the current method. This will also likely need changing further if the iPad 3 goes retina.\n. This still needs updating with retina assets for the new iPad (need to test the new file sizes work on iOS5.1), but i propose something like this. Anyone got further tweaks/suggestions?\n<script>(function(){\nvar p, l;\nif (navigator.platform === \"iPad\") {\n    p = \"img/startup-tablet-portrait.png\";\n    l = \"img/startup-tablet-landscape.png\";\n    document.write('<link rel=\"apple-touch-startup-image\" href=\"'+l+'\" media=\"(min-device-width: 768px) and (orientation: landscape)\"/><link rel=\"apple-touch-startup-image\" href=\"'+p+'\" media=\"(min-device-width: 768px) and (orientation: portrait)\"/>');\n} else {\n    p = window.devicePixelRatio === 2 ? \"img/startup-retina.png\": \"img/startup.png\"; \n    document.write('<link rel=\"apple-touch-startup-image\" href=\"'+p+'\"/>');\n}\n})()</script>\n. Perhaps doing multiple document.write is more costly than a few bytes saved? (esp considering we are talking about serving potentially huge assets here)\n<script>(function(){\nvar p, l, r = window.devicePixelRatio;\nif (navigator.platform === \"iPad\") {\n    p = r === 2 ? \"img/startup-tablet-portrait-retina.png\" : \"img/startup-tablet-portrait.png\";\n    l = r === 2 ? \"img/startup-tablet-landscape-retina.png\" : \"img/startup-tablet-landscape.png\";\n    document.write('<link rel=\"apple-touch-startup-image\" href=\"'+l+'\" media=\"screen and (orientation: landscape)\"/><link rel=\"apple-touch-startup-image\" href=\"'+p+'\" media=\"screen and (orientation: portrait)\"/>');\n} else {\n    p = r === 2 ? \"img/startup-retina.png\": \"img/startup.png\"; \n    document.write('<link rel=\"apple-touch-startup-image\" href=\"'+p+'\"/>');\n}\n})()</script>\n. Have put together a quick test URL with the above code which we can check once the new iPad is available:\nhttp://miniapps.co.uk/code/splashjs/\nEdit: - this seems to be working ok on the iOS simulator using retina iPad mode\n. The inclusion of this property has been discussed at length in the past for h5bp. Here's a link as reference: \nhttps://github.com/h5bp/html5-boilerplate/issues/276\n. Closing this pull request as no further reasons for consideration have come forward, and user-scalable=no prevents pinch/zoom on iOS.\n. I do not see any reason to not apply the issue.\nDid you read the thread I linked to as reference? There are several reasons discussed in that thread that I still see as valid for not including this property as a default in the boilerplate, unless you can convince otherwise? :)\nWhile the usefulness of the target-densityDpi property is not disputed, we have to take into account that people are using boilerplate to build cross-platform, consistent UI's. It is not easy to understand the implications of including such a property by default, and is also difficult for most people to test easily when writing dpi-specific CSS. Many people using boilerplate may not even have an Android device to test it with. \nIt is still an edge-case property imo, at least as far as using device-dpi as the default.\n. Thanks for this\n. @Trott - please feel free to leave this open. Sorry no one commented yet, but it does not mean this has gone un-noticed and will not be looked into :)\n. Thanks will take a look at this - there's no reason why MBP.fastButton should really interfere with VoiceOver. It should be fixable. I know other tap plugins work fine…\n. Edited response:\nMBP.fastButton works fine here with VoiceOver using <button> elements or <div role=\"button\"> for example - Maybe you can explain your problem a bit further? \nAt first I thought you might be using the fastButton helper on standard href links, but this causes a problem that affects both VoiceOver and standard mode. Can you provide an example perhaps?\n. This problem (reproduced with the code you provide above) appears to not be related to VoiceOver. Links refuse to open using MBP.fastButton regardless to it being turned on or not when I test here (iOS 5.1). The CSS / markup above also seems unrelated - the problem seems to happen with any link.\nI would question as to whether MBP.fastButton is really appropriate to use on links - the 300ms saved is pretty much lost in the time it takes to make a server request? But if you really want to use it this way, the following line in MBP.ghostClickHandler seems to be the culprit:\nLine 179: event.preventDefault();\nRemoving this line allows links to open ok. But I am unsure about how / why this part was written by Google - it appears to be some kind of edge-case for Android 2.3 looking at the comments. Could it be removed maybe? (ping @shichuan) \n. Thanks will see to updating - I'm actually thinking about taking this out of the index file altogether, and to rewrite it as a method in helper.js. Would keep thinks neater and no need for document.write etc…\n. I've moved the startup image script out of index.html into a helper.js method called MBP.startupImage();\nhttps://github.com/h5bp/mobile-boilerplate/commit/b54217ca708f75aa1298c3f5f01fc926969b1fb3\nClosing this issue now :)\n. This is an old version of the script - please use the up to date version\nsee issues #96 and #105 for reference\n. I believe this is to prevent breaking the default browser behaviour - because the script scrolls to the top of the page, it would break deep linking using a hash identifier. \nPlease see here: http://24ways.org/2011/raising-the-bar-on-mobile\n. Thanks for this Jake - could you give some detail about what the problem is using the current MBP fastclick with iOS Voiceover? I did a quick test a few weeks back and it seemed to work ok (see issue #112), but perhaps I'm missing something.\n. Haven't got any more info on this from Jake yet. I'm a bit wary when it comes to the UA sniff. If it's required to fix a bug caused by another bug fix for an OS specific edge-case - it maybe starts to get a bit messy?\n. Thanks very much for the reply, Jake. I've put together a very quick test page using the latest MBP fast button code:\n[link since removed]\nThis appears to work ok with VoiceOver on iOS? If I select the target and then double tap to activate the button - the tap fires and active state shows as expected. Is there another use case where it fails? As far as I'm aware VoiceOver should work with touch events? (either using a regular double tap to activate, or a triple tap/hold for a gesture).\nI guess some of these problems in the current MBP 'tap' event implementation are born from dealing with both regular click and touch events. Other solutions out there are perhaps a bit simpler in terms of the events they dispatch - but I guess there are always risks of devices out there giving out false-positives on touch event detection. It might be good to review at some stage though, so thanks for your feedback :)\n. Just wondering we could perhaps use a combination of properties like 'ontouchstart' in window && 'createTouch' in document as a slightly more robust touch detect? I don't have a BlackBerry to hand that exhibits this issue so can't test - but if so this could avoid the UA sniff?\n. Actually, never mind the previous suggestion. I'm forgetting the pointer scenario mentioned above. I guess there is no alternative but to include the Android UA Sniff? Unless anyone has any other ideas or suggestions?\n. I just tested the jsfiddle on an iPad here and could not see any difference between toggling MBP.scaleFix() on or off. The CSS menu in the example seems pretty busted to begin with?\nAm I missing something, or can you supply a reduced test case? Maybe it would help if you described what the expected behaviour is supposed to be?\nEdit - maybe it is likely due to jsfiddle why this test case does not seem to work. Will see if I can reproduce it standalone.\n. Ok I've tested this locally on the iOS simulator and I don't see any difference in how the menu in the example provided behaves differently, regardless as to whether MBP.scaleFix() has been called or not. \nI'm going to close this issue as cannot reproduce with the test case provided.\n. This sounds good to me\n. Shouldn't the orientationchange event listener actually be on the window object in this example? Also the scale setting seems a little off when performing a gesture in landscape when I try the changes.\n. I wonder when iOS6 launches with the fix for initial-scale, we should consider moving to Scott's solution which could be applied for iOS5 and below?\n. I've done some testing and the scale setting being incorrect when performing a gesture in landscape is still present before this change. \nIt does make sense to re-apply the scale fix after an orientation change, however the scaling 'glitch' in landscape becomes much more frequent as a result. Before, you would only see it if you loaded the page in landscape and performed a gesture event for the first time. This change would also mean the first gesture event would never fire every time you changed orientation.\nPing @shichuan - any thought on this one?\n. Ok, I'm going to close this pull request - I'm not convinced the change a really improves the user experience that much, and this bug will soon likely be fixed in iOS 6 anyhow.\n. Maybe this can be refined further? Reading here can the -moz and -o variants be dropped also?\nhttp://girliemac.com/blog/2012/08/03/resolution-in-media-queries/\nWould be good to mirror what is being done in the main h5bp here also…\n. For reference this is also being discussed over in the main h5bp project:\nhttps://github.com/h5bp/html5-boilerplate/issues/1127\n. No need to apologise at all, your suggestion is perfectly valid and thank you for submitting the pull request - i just want to factor in other discussions so we end up with the best possible update to this query :)\n. Given that the main h5bp project now uses a mobile-first approach, I think a lot of the key issues in developing a mobile compatible website or app can be covered there. This project does contain a lot of good collective info on mobile-specific functionality however, particularly in the helper methods, plugins, docs etc - it would be a shame to lose that.\nIf the project did die, i think it would be good to retain the mobile-specific parts so they can still be used / collaborated on somehow.\n. I think the line can be quite blurred between what defines a mobile 'website' and an 'app' at times - but I think this project is more along the lines of a robust starting template, rather than resembling a mobile framework. I devote as much free time to chiming in and contributing here as I can, but more development from the community is always a welcome thing. \nStill happy to help out where I can :)\n. Initial draft of bundled documentation is now in the repo - there's still a lot more to do, but any suggestions and/or contributions are welcome.\n. I'd be happy for it to go with 4.0.0 as it is - there are still a few things to tidy up maybe, but nothing to warrant holding off.\nCheers\n. Thanks :)\n. You need to call MBP.hideUrlBarOnLoad - looking at the code in helper.js this is not immediately obvious. I'll update the docs to reflect this.\nThanks\n. Working here - make sure your web app content is at least equal to the viewport height of the safari window, else there is nothing to scroll.\n. Sure, app cache has problems - but is it broken beyond being useful? I'd say no - it still has real use despite it's quirks. And there are no current alternative implementations.\n. The article referenced is a great insight into the quirks of the current spec - but it also states that app cache should not necessarily be avoided. Under certain use cases it is still extremely useful, and can enable functionality in web apps that no other current spec can provide.\nBut I do understand your concerns - I guess the difficult part is getting people to understand just how it works, and what pitfalls need to be avoided :/\n. Yeah I'm not advocating having it in by default at all, just either:\n- including an app cache 'template' manifest, but not linking it to the html index file by default. Then giving more detail in the docs on how to use it (plus links to articles like the one above)\n- or simply giving app cache a mention in the docs.\n. Closing this due to lack of interest / feedback.\nWill try and find some time to add some info about app cache in the docs.\n. Sounds good - assuming support for the input event is decent on mobile browsers? Anyone know of any info on this?\n. I've given this a quick test and the above change works well when pasting via a mobile browser (tested on iOS simulator), as a typical touch-based copy/paste context menu works in a similar way.\nThis could be a good user experience improvement i think, but I'll need to test on more mobile devices. \n. Found time for some Android device tests - autogrow triggered on paste works on both 2.3 and 4.x using this technique. I'll see to adding this change shortly, unless anyone else can find a problem?\n. Thanks :)\n. I'm seeing this empty link behaviour even without using the script (iOS6)? Seems to be default behaviour in iOS web app mode, rather than an issue with the MBP helper?\n. Ok, am going to close this issue unless any more info comes to light. As far as I can see this behaviour is related to web app mode on iOS, rather than anything in MBP itself.\n. Disregard my previous comment - I understand strict mode is meant to be backwards compatible. What I am unclear on though, is whether there are any issues with using strict mode given current mobile browser implementations.\nStill, it is good to write code that is consistent with good practise.\n. Thanks - will update this to point toward the new bundled docs\n. Link to an online demo would be useful here?\n. Thanks for the link - could have some use cases for certain apps, but I don't think this really fits as a general use case for the majority of web apps. The splash images in iOS web apps display until the DOMContentLoaded event fires, and help to give web apps a more iOS 'native' familiarity that is suitable for the platform. \nI don't think this same behaviour really belongs in the browser, it feels a bit like an advertisement to me? But if you can get your code into a format suitable so it can be used as a JS plugin, we could include a link to it in the wiki?\n. Closing this due to lack of feedback - although personally I think reinstating initial-scale is a good idea now that iOS6 has good adoption rates.\n. Ok, adding this back in - thanks for the feedback all :)\n. Some interesting info here with regard to Windows Phone 8 behaviour when using width=device-width. This post makes the case that using width=320 might be a better default.\nhttp://mattstow.com/responsive-design-in-ie10-on-windows-phone-8.html\n. There are some handy visuals in this post showing the effects of using @-ms-viewport {width=device-width} on WP8 devices:\nhttp://nostrongbeliefs.com/why-i-think-we-shouldnt-use-css-viewport-in-ie10-for-now/\nAt this time, I don't think it is a good move to include it in MBP.\n. Many thanks :)\n. My bad, will amend cheers\n. Thanks for this\n. Thanks, but we already have a helper method for this called MBP.hideUrlBarOnLoad\n. Thanks\n. iPad mini resolution is the same as original ipad, so no change required.\nThe iphone 5 is a bit of a different matter. To get a web app to use the larger height, you need to provide a hack on the meta viewport as detailed here:\nhttp://www.mobilexweb.com/blog/iphone-5-ios-6-html5-developers\nThis to me sounds like a bug on Apple's part. I don't understand why you should need to do this, so I'm hoping apple might fix it.\n. Thanks - yes we should do a check. Will look to use a fix that does not depend on jQuery however\n. These don't exist in html5 boilerplate. To be clear, I am talking about the web app startup images in:\nhttps://github.com/h5bp/mobile-boilerplate/tree/master/img/startup\n. Agreed - they need to be correctly styled / sized. Simple is good. Currently they are a bit of a mess however, particularly the differences between standard and retina sizing.\n. Thanks for this - will give it a test :)\n. Agreed :)\n. Thanks :)\n. My view is that helper.js in its current state is a bit of a mess. I would like to see it restructured in some way, so it can be maintained in a more modular way perhaps. This would also make it more suitable for a test suite, which I think is a good idea - more so for our benefit (and for anyone who wants to contribute). You're right that most people would not have a use for it, but for something like helper.js I think it still warrants consideration.\n. I quite like the idea of consuming other open source projects for these features - there are numerous alternatives to fastButton, scaleFix etc… that arguably do it better? Maybe we could compile a list of alternatives and see.\n. Some alternative repos / plugins for some of the more commonly used MBP methods:\nhide url bar - \nhttps://github.com/scottjehl/Hide-Address-Bar\norientation fix - \nhttps://github.com/scottjehl/iOS-Orientationchange-Fix\ntap plugins - \nhttps://github.com/borismus/pointer.js\nhttps://github.com/alexgibson/tap.js\nhttps://github.com/cheeaun/tappable\n. Opened a new issue for this to discuss :)\n. Agreed - once we decide on #164 we should revisit this, and see if we can write tests for any methods that remain.\n. Thanks again :)\n. Thanks\n. Thanks :)\n. thanks\n. The FastButton code handles both touch and mouse click events, and does not assume one or the other based on feature detection - it adds listeners for both, then cancels the click if touch fires first. \nAre you reporting a definite problem in Chrome on win8 etc, or are you supposing there will be a problem? :)\nI can try and take a look if so, but I don't have a real device to test on (have to rely on force enabling touch in chrome).\nP.S - correct link is: https://plus.google.com/115788095648461403871/posts/6RqRCEVbqpC\n. If you could find time to download the latest version of MBP and quickly test fastButton locally it would be greatly appreciated - it is probably quicker than me trying to publish a temporary URL somewhere. I don't think there is a problem with it, but a first hand check would help us out a lot.\nMBP is really intended for mobile web apps and things like fastButton are not really intended for desktop, but ensuring compatibility everywhere possible is a good thing.\n. Ok, I'm going to close this issue for now as I'm not convinced there actually is an issue yet. If someone can verify a bug with the current version of fastButton then we can re-open the issue.\n. Thanks\n. Hmm, while the changes to the clear fix CSS are only related to IE desktop, I don't know if it really might be overkill to remove them. It is only a very small amount of code, and something modular that is employed on many sites/projects. I think it might make more sense to actually leave it unaltered...\n. Ok, then sounds good to me\n. Just given this a test and looks good - thanks :)\n. The link seems fine here?\n. Thanks for the update :)\n. Thanks!\n. Great to see 2.0 :)\n. It made it, thanks for the PR :)\n. Thanks - this is already included in MBP as part of the apple mobile web app meta tags (they're commented out by default).\n. Thanks\n. Thank you!\n. Thanks @drublic \n. Merged this in 5af6411932e613cff8d6ed7fd0f5ddd39f28ed6a\n. This idea sounds good to me - I'm not opposed to including both compressed and uncompressed versions of jQuery.\n. Thanks for this, could you please also update the issue number in CHANGELOG.md for this change?\n. Yes, that sounds perfect. Thanks\n. Thanks :)\n. Could you please also update CHANGELOG.md to reference this PR?\nThanks\n. Thanks!\n. Could you also update CHANGELOG.md to reflect this change? Thanks!\n. +1 for limiting this to iOS only.\nHow about we use navigator.platform to test against though, so no need for extra checks like Opera Mini? (not sure where that came from originally).\nAlso, could you please update CHANGELOG.md to reference this PR.\nThanks!\n. Sorry for being late in replying here, looks like this one can't be merged cleanly and needs a rebase. \nAfter that,we should be good here I think.\n. Merged and closed this one, thanks!\n. Thanks, @drublic!\n. Thanks @romamatusevich!\n. Good catch on the size attribute, updated.\n. Merging!\n.  I think it would be great if MBP could provide full-screen web app support for iOS, Chrome, Firefox and Firefox OS (hence this PR). I'm not sure on the best approach here, but I would like to try and avoid relegating it to just a note in the docs, as I think many would miss out on using it. \nAlso, not sure why it wouldn't apply as a use case to anyone starting out making a mobile web app, since it enables installing directly from the web? (i.e not restricted to Marketplace) There's some more info on hosted apps over on MDN here: https://developer.mozilla.org/Marketplace/Publishing/Publish_options\n. Thanks for the PR :+1: \n. Thanks for reporting the issue!\nYes unless anyone comes forward with some valid reasons not to switch to FT FastClick, I plan to merge #194 sometime soon.\n. Thanks again, @romamatusevich \n. LGTM, thanks @alrra!\n. I've requested MBP to be removed from the Bower registry.\nhttps://github.com/bower/bower/issues/120#issuecomment-34693816\n. Sounds reasonable to include this I think, but it would be good to include the link you provide here in docs also. That way people could find out a bit more information about it?\nhttps://github.com/h5bp/mobile-boilerplate/blob/master/doc/html.md\n. Thanks for your contribution, @abhinayrathore :rocket: \n. Other than the link here I've not found much info on the traffic comparison, but given how long WP8 has been out now I think we should be good to remove it.\n. +1 to this, there are other more up-to-date plugins people can use for this if they wish.\n. Ok, I'm going to remove this and add some links to the various plugins that offer this functionality in the docs.\n. Thanks for the contribution!\n. Thanks for the info. It would be good to find a better way to generate/support all these icon variations in the project.\n. Thanks\n. Looks like this needs a rebase,\nCould you also please update the reference to Modernizr in usage.md? Thanks!\n. Thanks @romamatusevich - looks like you still have a merge conflict (probably just the changelog).\nIf you fetch the latest master, you should be able to rebase your branch on top of it and resolve the conflict. If not, don't worry I can take a look later.\n. Many thanks for the PR! \nCould you please also update CHANGELOG.md to reflect this change?\n. The change should go at the top of the list in head, and if you reference the PR number (#214) we can track the change here. Many thanks :)\n. P.S - if you just add another commit to this branch and push to it, the GitHub should just pick up the change here.\n. Looks like you still need to push the commit to this branch, changes aren't showing up here?\n. Sounds great, thanks @arthurvr!\n. Hi @arthurvr! If you would like to do a new release, by all means feel free to do so :)\n. Thanks @arthurvr - I'm pretty tied up in work related projects atm, so your help here is much appreciated \n. This is also implemented in Firefox OS 2.1 https://bugzilla.mozilla.org/show_bug.cgi?id=1013913\nI don't think there's an MDN doc quite yet though\n. Note there is a MBP JS helper for iOS splash images. It may need updating / improving on for the latest iOS screen sizes.\n. ",
    "brianblakely": "It feels like the responses are to the concept of a fixed-width design, which I'm already onboard in saying that's a bad idea.\nBut if you consider that you are handed one, it would be good to have a tool to handle it.  Using device-width won't get you there.\nshichuan, to your point, in a fixed-width scenario, you don't want the viewport to resize in the first place, and browsers will rescale when you set a pixel width.  So when you flip to landscape, you see the same thing, only bigger. :)\n. @alexgibson: I'll use an example to explain why it's a bad experience when you use device-width with a fixed-width layout:\nIf your layout is 320px wide, and your device-width is 480px, you will have 160px of empty space on the right-hand side.  If it is 640px for the same device, there will be h-scroll.  By setting the width explicitly, your design will always be scaled perfectly to the edges of the device (or you can create margins by setting the width a little higher than your layout). \n@shichuan: I love that post, and yeah it's totally the best way to go for fluid design.\n. Not saying this is right for everyone, but here is what my viewport looks like (you opt into the one you need):\n<!-- FIXED WIDTH\n    <meta name=\"viewport\" content=\"width=ENTER_WIDTH_HERE_EXAMPLE_640\" />\n-->\n<!-- FLUID WIDTH\n    <meta name=\"viewport\" content=\"width=device-width\" />\n-->\n<!-- FLUID WIDTH; DISABLE ZOOM\n    <meta name=\"viewport\" content=\"width=device-width, user-scalable=no\" />\n-->\nThere are other options to indulge, but these all work as expected on the broadest range of platforms and layouts.\n. Yeah, I'm conflicted to even suggest it as an option.  At the same time, developers in the trenches (esp. those who don't have input in the process related to the products they are making) will be bombarded with this kind of thing.\n. ",
    "paulirish": "Philip had a very good exploration of the issue over here: http://tech.bluesmoon.info/2011/01/device-width-and-how-not-to-hate-your.html\n. \\o/\n. zepto is opera and ff compatible these days now, fwiw.\n. I'm +1 on zepto for MBP now. it's got good non-webkit support. \n. Aye. I'd say Zepto for now and move to jQuery 2.0 when thats out.\n. Thanks Andreas. Appreciated.  \nBtw- do you know if there is any specific difference between userscalable=no and minimum-scale=1.0, maximum-scale=1.0 ?\n. Relatedly, this ticket also has implications to our use of hardboiled MQs and also mq.js instead of respond.js\n. Relatedly....\nhttps://github.com/paulirish/html5-boilerplate/issues#issue/406\nI think this is pointing to our need for a new set of \"hardboiled\" MQs that is robust and we can all (mostly) agree one.\n. +1\n. try running it from within the build folder?\ns'how i've always done it..\n. nom nom nom.\n. we already changed in h5bp to use minified by default.\ni'm committing a fix now for mbp.\n. 4444e182c00d7a3c2d08fad25088a36762de71ed\n. +1\n. Commits like this are always hard to accept due to the fact that they own your entire blame command..  :)\nbut...\nthis looks good and there are def a few errors before this helps to correct.   :)\nthe mix of tabs and spaces... normalized to spaces, ya?\n. cool cool.\ni'll let shi make the call but i'm +1 on this\nside note.. i've found that the git gui blame file.ext viewer is best for blame as you can step behind a given commit.\n. mathias, lets. go for it.\n. hmmmmm\nthe type attribute in the markup should have absolutely nothing to do with the gzip encoding used by your server.\nif there is a correlation there then its definitely a yslow bug. :/\n. we might add some linebreaks to this after pulling it in.. but otherwise this lgtm to far.\n. heres the line in MBP https://github.com/shichuan/mobile-html5-boilerplate/blob/master/build/config/default.properties#L77\nsimilar place in h5bp\nthat should helppp...\n. LGTM.\n. huh!\nwell handleEvent is super cool. :/ maybe we should feature detect where this breaks and bypass this.\ndo you know any other browsers that fail besides bb6?\n. also .. pretty much the only relevant link: http://ajaxian.com/archives/an-alternative-way-to-addeventlistener\n. in android browser 2.3 i dont get colors either.\n. I think this issue is dependent on an old release of the YUI compressor.\nit's MQ parsing used to be rocky and its potentially resolved now.\nBut yes, it's an upstream bug.\n. pinging @sdesai https://github.com/sdesai in case he can take a look\n. Thanks very much for the update!\n. v4.0.3. it goes directly go google.com\n. thx for the report @RCanine .. we've fixed a bunch. we'll fix the rest and then update the file on the site.\n. :+1:\n. thank you\n. I don't know of other projects doing this better. \nIf the project dies, there is a lot of good knowledge in the docs and source, so I'd hope we retain those for a mobile app audience. \n. ",
    "Takazudo": "Hello, I think if you use\nwidth=device-width, initial-scale=1.0\nas viewport meta, initial-scale=1.0 is not necessary.\nbecause initial-scale must be 1 if width equals device-width.\nHow do you think?\n. @shichuan Wow, now I tested that and I found that you are right. Thanks!\n. Hello, 1 vote to remove 'target-densitydpi' from viewport meta.\nI found the browser setting to change the densitydpi manually.\nLaunch the browser and push 'menu' then...\nMore->Settings->DefaultZoom\nYou can select Far / Medium / Close there.\nThis seems to specify densitydpi to high / medium / low.\nWhen I put 'target-densitydpi=medium-dpi' to viewport meta, this browser setting was ignored, it was forced to be medium even if I changed the defaultZoom to \"Far\".\nSo I think target-densitydpi should not be in viewport meta when you make fluid layout.\n. ",
    "xjamundx": "It looks like a neat project!\n. ",
    "nimbupani": "DONE.\n. Yes you are right, it should go within media queries and not on the body element itself.\n. Opera does not do decimals: http://dev.opera.com/articles/view/an-introduction-to-meta-viewport-and-viewport/ \nProbably should file it upstream?\n. What errors do you get? Can you show us a testcase?\n. Fixed by 8f16ec05e30d5f9a1f0bb4d21c3808eab55be4cb\n. @voidfiles yes a testpage would be great! @shichuan have you come across this?\n. ",
    "kisPocok": "your welcome :)\n. ",
    "johnnycadelco": "niceee, thanks!\n. ",
    "stereobooster": "Maybe we need to add wiki page which will list all alternatives, pros and cons of all frameworks (size, supported devices, jQuery compatibility, etc)?\n- XUI\n- Zepto\n- jQTouch\n- Jo\n- Sencha Touch\n- jQuery Mobile\n. @bellerus how about Emile? Also check http://microjs.com/#animation\n. new framework https://github.com/mythz/jquip/ worth considering\n. one more https://github.com/appMobi/jQ.Mobi\n. ",
    "bellerus": "I'm working on creating boilerplates for each of the above frameworks starting with  jQuery Mobile. Thinking Zepto might be next.\n. @shichuan Agree about Zepto for the most part. Just thinking about what other library to combine with Zepto if you need a little more animation baked in.\n. ",
    "necolas": "What's the latest thinking about this and the most useful/appropriate tool for this project?\n. @shichuan: that was what I suspected, and it sounds like a sensible reason...it certainly made me aware of it. do you think it would be worth including a comment in the source, recommending that those things are moved into an external file along with anything else they want executed by default?\n. yeah something like that. i've been using it in my 'branch' of the HTML5 Boilerplate projects...just as bulletproofing/fallback.\n. @shichuan That sounds like a good idea. You may also want to get an updated copy of the respond.js code. Thanks :)\n. This issue is over a year old. Closing.\n. This is intentional, check out Paul Irish's article - http://paulirish.com/2010/the-protocol-relative-url/\n. the build script switches it to the minified version.\nbut h5bp is going to switch to .min by default (IIRC) since a lot of people don't use the build script. a good idea IMO.\n. doh! good point, forgot about desktop IE's needing the <html> too :)\nedit: yeah it's because desktop IE gets no <html> tag and has to create its own\n. FWIW, the pattern ian describes is what is now in H5BP\n. Right, but the mobile boilerplate isn't only for mobile. There will be some projects that use the mobile boilerplate but expect to provide some form of experience on OS that live primarily on the desktop.\n. Ok, since this project probably only is for mobile web app development, we could drop this CSS if no devices make use of it.\n. Thanks Boris!\n. Thanks!\n. Thanks.\n. Ok, will catch in a later tidy up.\n. If they are built from the narrow-viewport dimensions first (and/or fluid), then it won't be a problem on devices with wider screens. We can probably also assume MQ and JS support since the demands of a \"mobile web app\" pretty much require it.\n. Closing. This is an issue that is outside the scope of this project.\n. This is only a problem if you use YUI compressor, but since it can be avoided while also reducing the amount of code, we should do it:\nFYI: https://github.com/h5bp/html5-boilerplate/issues/1127#issuecomment-7502062\n. The dreaded mid-week hangover\n. This is an issue to bring up against the h5bp/ant-build-script repo. Thanks.\n. I think those could just be done like this:\nhtml {font-size: 16px;}\n. The repo is for mobile web apps...there is not old IE in that world.\n. Closing this for now. This is being fixed at the OS level soon. In the mean time, there are existing solutions that have been more tested than this approach. Thanks.\n. Since MBP is meant for mobile web apps, we probably don't need any of those print rules anyway.\nIs there a way that you could report these bugs to Nokia?\n. Do we need these hacks for mobile web apps?\nDoes the IE7-ish mobile browser still need them?\n. If you're happy that there is a low % of people using a mobile browser with IE7-like behaviour...then IMO it sounds like sensible solution. Individual devs could always make using the HTML classnames if they have a specific need to have those browsers catered for.\n. Yes, this PR isn't appropriate. The issue will be fixed when I make normalize 2.0.0 public. Thanks\n. Any progress on this?\n. @shichuan Any further thoughts on this?\n. \"Viewport does not work\" - you'll need to provide more details on what \"does not work\" means and why you think this reversion (we used to include initial-scale) is an improvement.\nRelated: h5bp/html5-boilerplate#1099\n. Closing due to lack of follow up\n. ping @shichuan \n. Thanks! Has this Android bug been reported? Author CSS should have no effect (certainly not this one) on shadow DOM element styles.\nPlease could you let me know the result of an additional test? Use this selector instead: html input[type=\"button\"]\n. Thanks. This is an old webkit bug that was fixed in normalize.css, and unfortunately Android releases seem to be way behind in the versions of webkit they use. Will have to add this fix back in.\n. Should be fixed by a recent commit that pulls in the latest version of normalize.css\n. > I don't know of other projects doing this better.\nDivya felt that there were but I wasn't sure which ones.\n\nGiven that the main h5bp project now uses a mobile-first approach, I think a lot of the key issues in developing a mobile compatible website or app can be covered there. \n\nHTML5 Boilerplate doesn't really impose any approach. This project was meant to become a framework for created web-tech-based apps for mobile, rather than just for making mobile-first websites. However, there hasn't been enough dev work in this direction, despite efforts to bring in other developers or encourage more development from people with commit access.\nJust to clarify: if the project was \"retired\", this repo wouldn't be deleted.\n. I've made a bunch of updates to the repo to bring plenty of old code up to date. Hopefully a few people can help ensure it doesn't slip so far behind in the future. Thanks.\n. Hey Alex, do you think the docs are good enough for the 4.0.0 release? They look pretty good to me. Thanks for all the work you put into porting and updating the relevant stuff.\n. Great, done in b61b380100a076155970a1819bf870ee41206ccb\nJust waiting for the new version of mobileboilerplate.com before publicising the new release.\n. Thanks, please see #73 for the existing issue and discussion about this.\n. Fixed by 2f0d182056cbef703c23a6b6e915930e58a133a9\n. The problem with appcache is that it's basically a big mess of insane in its current form, and looks set to be revised - http://www.alistapart.com/articles/application-cache-is-a-douchebag/\n…so I'd vote \"no\".\n. I dunno, sounds like it has pretty serious problems that require quite specific solutions. It's bad enough that no browser has implemented it properly and they're looking to rework the spec/model.\n. Yeah, it's not something I would be comfortable about having included by default as it is anything but trivial. But there's no harm in linking off to articles about it.\n. Can't do this as we want the docs to stay relative to the tree you are browsing. You'll need to view the README file directly.\n. > I know this is mobile boilerplate but I am building a responsive site so it's important to have everything work on keyboards & touchscreens.\nFYI: This project is specifically a template for building mobile web apps. If you're building a responsive web site, then something like HTML5 Boilerplate is going to be a better starting point. And you'd probably want to use a dedicated plugin for this effect, e.g., https://github.com/alexbardas/jQuery.fn.autoResize\n. That sounds like the standard behaviour for href=\"#\". If you're using that value for JS, and want to prevent the default behaviour, then you need to use preventDefault().\n. Hey Alex, I think this could be worth reopening since iOS6 has changed things. Just need to ping some of the people involved in the discussions in some of the old the @h5bp/html5-boilerplate issues (e.g. h5bp/html5-boilerplate#1099). Hopefully it will spur some feedback and opinions.\ncc @wilto @jonathantneal @scottjehl @fatbat\n. It seems that it's particularly relevant for mobile web apps too.\n. Alex, the commit changing the 4 space indentation shouldn't have been accepted, for the sake of consistent code style.\n. Alex, if you haven't already done so, you can add the DS_Store pattern to your machine's global gitignore :)\n. These should be updated to match those in html5 boilerplate.\n. My mistake. But they (and the touch icons) should use the updated color palette of the logos in HTML5 Boilerplate. There are some assets in the footer of http://h5bp.github.com/\nKeeping them as simple placeholders makes it more likely that people will replace them IMO\n. Thanks a lot! Corrected a small typo - \"Moible\" - and then merged in 21c0b6f19689d8d736f29c7a42dc78607a675684\n. Thanks, but no need to optimise the images until #149 is addressed. Given the way git handles binaries, this would just add to the size of the repo when the optimisation can just be done at the same time as the other image fixes.\n. Thanks, merged in 15acdd1788c796839697ec8215ba93a424274be0\n. Thanks, merged in d510192a3bf76e836e4842287c4db0afec423254\n. Hmmm, it's never been there, even when it was called script.js…weird!\n. Problem with tests is that this is a starter template, most people don't use tests, most people don't want us imposing a test framework on them, etc. The reasons for removal still stand.\nIn some ways helper.js needs to be rethought entirely to move away from a monolithic file that existing within this repo.\n. cc @alexgibson - thoughts on this?\n. What if we broke it out into a separate repo or simply consumed other projects that already address those features.\n. FWIW, I think Hans is right. If there is anything that could do with testing in this repo (for our purposes rather than \"he's a test framework you should use\"), we should consider it doing so. This repo doesn't necessarily have to be tied to the same constraints that we have with the HTML5 Boilerplate.\n. FWIW, we're soon to drop IE 6/7 from HTML5 Boilerplate too. If this project is still looking to be a starting point for mobile app development then catering about IE 6/7 is probably not necessary. Is that right?\n. Please can you configure your editor not to strip newlines at the end of files. Then it will be easy to update the PR to avoid stripping it. Thanks\n. I don't think there is much benefit to custom builds of these monolithic libs. Pretty indifferent about encouraging it in our docs.\n. These aren't duplicates. One is 114, the other 144.\n. I think you're got the wrong repo.\n. Probably best to combine the assignment with the declaration.\n. ",
    "andreasbovens": "Yes, let's remove userscalable=no, as well as minimum-scale=1.0, maximum-scale=1.0, as they basically do the same thing. It's only in rare situations you want to turn off zooming (e.g. in a game), but in most cases, it just hampers accessibility and usability.\n. As far as I can tell, there is no difference, Paul.\n. @shichuan: that's right. Anytime :-)\n. Afaict, using max/min-width/height without device- aspect is preferable, one of the advantages being that these media queries also work nicely on desktop browsers when resized.\n. I think the iPhone 4 works fine because it cheats a bit and multiplies all values with a factor of 2 (thereby bypassing the need for supporting target-densitydpi). So, what I meant is actually 'what will happen when we force 160dpi on Android devices with retina screens running browsers with target-densitydpi support'  ;-)\n. It appears target-densitydpi=160dpi is now gone from the boilerplate template as per https://github.com/shichuan/mobile-html5-boilerplate/commit/7d5355f59975134c3a36db41f049588f4dc549de#index.html (neat!), but demo/index.html still uses width=device-width, target-densitydpi=160dpi, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no. This should probably be corrected.\n. ",
    "adajw": "++ @shichuan - I don't like device- queries, as any browser window on a desktop that is really quite small should get the ui for mobiles, so as the site doesn't need to be maximised to be useful.\n. This is a very good point - device queries often misbehave - android 2.2 & 2.3 sometimes ignores them the first time the page is loaded, and I can't find a fix. Switching away from device- fixed things.\n. ",
    "ryck": "I'm using HBP with the media querys without -device and all just work great, and in addition the content on desktop browsers can be resizeable...\n. ",
    "toddanglin": "To play the devil's advocate role in this thread, the advantage of the device specific queries is their ability to easily \"segment\" intentionally mobile styles from desktop clients. Even in small desktop windows, I don't think we want sites to \"suddenly\" jump to differentiated mobile styling if a browser window is resized. This behavior would likely be startling and confusing to many users.\nIt seems there is a theoretical advantage to being able to target styles at small desktop browser windows AND small mobile device screens.\n. @shichuan: Fair enough. Though I expect there are a number of developers that will evaluate MBP with the idea of creating a extended mobile experience for \"full\" desktop sites. I suppose they should just stick with the original HTML5 BP...\n. ",
    "scottjehl": "Thanks Paul. \nYeah, at least in my experience (so far) with building  responsive designs, min-and-max width querying has suited our needs exactly. That's why I didn't write polyfills for any other media queries into Respond.js... though I'd certainly be open to doing so when the use-case arises. Just trying to keep things as lightweight as possible for mobile delivery!\nWe do use device/screen resolution in JS for other reasons, like for deciding appropriate image sizes to load, but at least so far, we've found people appreciate a layout optimized to their window (no horizontal scroll, etc). \nI wonder what Joe means by the print media use case.... In our work, we declare print media types alongside many of our min-width queries to equate the printed styles to roughly equivalent to the desktop view (width certain additional print-focused enhancements as well of course). Works great for us, but maybe he's found something we haven't considered?\n-Scott\n. +1\n. :)\n. ",
    "makenosound": "+2\n. ",
    "adambom": "Shoulda read the readme\n. ",
    "micahtaylor": "Works great!  But FYI i had to chmod the createproject.sh to build a new project and hadn't had to do that before.  But once I did that it built a new project and ant worked fine in the new project.  Should I create a new issue for the createproject.sh permission?\n. Great question.  Not sure I know the answer.  I do know that when I've downloaded the distro in the past I haven't had to change permissions.\n. Come to think of it, it was only when I forked did I need to chmod.  Not when I downloaded from the mobile-html5-boilerplate site.  Thanks for the heads up and help.\n. ",
    "mordendk": "Looks right to me.\nAnd btw, thanks for all the work you've put into this.\n. ",
    "pyrsmk": "I think I just misunderstood the appcache concept. Of course, server caching is not for offline navigation, but can appcache be used for file caching too, even in online mode?\n. So... The real problem is : which directive will override the other?\nWhat affected browser did you see?\n. As today, I've planned to use this snippet : \nhtml\n{# Coast by Opera #}\n<link rel=\"icon\" sizes=\"228x228\" href=\"228x228.png\">\n{# Chrome 31+ for Android #}\n<link rel=\"icon\" sizes=\"196x196\" href=\"196x196.png\">\n{# iPad with high-resolution Retina display running iOS ≥ 7 #}\n<link rel=\"apple-touch-icon-precomposed\" sizes=\"152x152\" href=\"152x152.png\">\n{# iPad with high-resolution Retina display running iOS ≤ 6 #}\n<link rel=\"apple-touch-icon-precomposed\" sizes=\"144x144\" href=\"144x144.png\">\n{# iPhone with high-resolution Retina display running iOS ≥ 7 #}\n<link rel=\"apple-touch-icon-precomposed\" sizes=\"120x120\" href=\"120x120.png\">\n{# iPhone with high-resolution Retina display running iOS ≤ 6 #}\n<link rel=\"apple-touch-icon-precomposed\" sizes=\"114x114\" href=\"114x114.png\">\n{# iPad mini and first/second generation iPad on iOS ≥ 7 #}\n<link rel=\"apple-touch-icon-precomposed\" sizes=\"76x76\" href=\"76x76.png\">\n{# iPad mini and first/second generation iPad on iOS ≤ 6 #}\n<link rel=\"apple-touch-icon-precomposed\" sizes=\"72x72\" href=\"72x72.png\">\n{# non-Retina iPhone, iPod Touch, and Android 2.1+ devices #}\n<link rel=\"apple-touch-icon-precomposed\" href=\"57x57.png\">\n{# Windows 8 applications #}\n<meta name=\"application-name\" content=\"----> application name <---\">\n<meta name=\"msapplication-TileImage\" content=\"144x144.png\">\n<meta name=\"msapplication-TileColor\" content=\"#222222\">\nI'm currently not sure if it's the safer way to have touch icons, but it seems to.\nFor some infos on Coast : http://my.opera.com/ODIN/blog/introducing-coast-by-opera\nPS : and sorry for the {# #} twig comment syntax.\n. :+1: \n. ",
    "jonathantneal": "Also http://sandbox.thewikies.com/normalize.css/demo.nine.test.html\n. Agreed, with little to add :)\n. ",
    "4aficiona2": "Didn't know this shorthand for http/https handling. Thx\n. but wouldn't it be more adequate if we reference the minimized version of jQuery on Google's cdn? Like this //ajax.googleapis.com/ajax/libs/jquery/1.5.1/jquery.min.js instead of //ajax.googleapis.com/ajax/libs/jquery/1.5.1/jquery.js (or even the most actual one) ?\n. I actually use the build script but just thought it might be more consistent to use the minimized cdn version as well. thx so far.\n. ",
    "FabianBeiner": "I'm not sad if you can't/won't accept it, actually, I get it. ;)\nYes, I've used spaces everywhere, because it looked like the tabs where the minority there.\n. ",
    "hicksy": "You're quite right - I've omitted the type attributes again and YSlow is now correctly reporting an A grade for gzip content. \nPerhaps I encountered a bug in YSlow? Or some other oddity - can't replicate it now. Cheers.\n. This is happening for me also - I too run ant build\nAll of the JS files in the /libs folder get minified correctly (including correct build.number within filename). However HTML within the publish folder isn't modified to use these minified files. \nI've been using MBP for a while now on numerous projects and not experienced this problem before. I'll investigate further to ascertain whether it's an environment change my end or whether there is a replaceable issue.\nOS X 10.7.2\n. ",
    "irae": "This script is useless without apple-mobile-web-app-capable so I moved it inside the existing comment.\nCode looks nicer also =)\n. ",
    "Benjaminsson": "Yeah, that helpppd. feeling a bit stupid. I was literally \"ctrl effing\" in that file :(.\nSolved it by downloading the latest build folder from github instead. \n. ",
    "Mdinf": "Oh, I see what you mean. \nThat's even quite obvious, but I'm so used to my designers asking for 100% height mobile websites without the adress bar (to achieve the so-called \"native app feel\") that I always forgot it hides automatically when the height exceeds.\n. ",
    "dottodot": "Sorry didn't realise it only worked when content goes off the bottom of the page.\n. ",
    "davidcalhoun": "Hmm, looks like there might be good reason to keep it like it is.  See https://gist.github.com/1183357\n. As far as I know, you can't detect VoiceOver with JavaScript.\nWhen you use VoiceOver, you swipe through links on the page and can double-tap anywhere on the screen to activate the currently focused link.  Is the problem with double-tapping directly over the element?  The user can double-tap in another region of the screen and should be able to activate the link.\n. ",
    "tanel": "OK, I'll do that! Thanks :)\nOn Tue, Sep 6, 2011 at 6:17 PM, nimbupani\nreply@reply.github.com\nwrote:\n\nOpera does not do decimals: http://dev.opera.com/articles/view/an-introduction-to-meta-viewport-and-viewport/\nProbably should file it upstream?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/shichuan/mobile-html5-boilerplate/pull/57#issuecomment-2016802\n. \n",
    "terryteo": "This is the error message from IE8. I realise that maybe you arent supporting that browser anyway with the mobile boilerplate, but i have been using MBP to begine my mobile outwards responsive designs, as it comes with a bunch of useful js fixes etc.\n++++++++++++++++++++++++++++++++++++\nWebpage error details\nUser Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)\nTimestamp: Wed, 16 Nov 2011 23:00:13 UTC\nMessage: Object doesn't support this property or method\nLine: 23\nChar: 1119\nCode: 0\nURI: http://html5boilerplate.com/mobile/js/plugins.min.js?v=2\n. ",
    "alexmingoia": "As far as I know, BB6 is the only browser that throws this error. Haven't tested BB7 though.\n. ",
    "ryanseddon": "I can confirm this is fixed in BBOS7, I have a polyfill to add support for <IE8 and BBOS6 will post it later tonight. Just confirming a few more tests.\n. I don't have access to any devices anymore, but that is very similar code to what I wrote in my article to get around BBOS6 not supporting it and it worked when I had access to a blackberry device then.\n. ",
    "jitendravyas": "Text selection doesn't work on Mobile Phone so we should remove it\n. @paulirish - Thanks for checking in Android.\n@mathiasbynens - I know iOS is not only mobile browser but I thought this selector is new not very old. So other older browser on other devices will not have support for it.\nIt's also not available in W3C CSS Mobile (http://www.w3.org/TR/css-mobile/) though i know it doesn't matter, Internet Explorer Mobile Windows Mobile 6.5 and even in Nokia's latest MeeGo Browser 8.5\nhttp://www.developer.nokia.com/Resources/Library/Web/nokia-browsers/nokia-browser-85-for-meego-12-harmattan/level-3-css-support/selectors.html\nAlso test Drive website for Windows Phone Mango IE9 Browser doesn't have any info about it http://ie.microsoft.com/testdrive/mobile/\nif we want to keep it for Links and form elements on  iOS then we can use input, select, textarea, button, a {-webkit-tap-highlight-color:#fe57a1} but we can't change text color.\nI'm not sure about all mobile browsers though.\n-Jitendra\nSorry, I mistakenly close the request but opened again . I'm new to github.\n. Change the numbering too in comments . I forgot to change.\n. Hardware - Google Nexus One\nOS - Android 2.3.6 \nBrowser - Default\nWhen i open http://www.highub.com/t/1.html i see the page written  \"This is a link to page 2\"\n. @RogerPodacter - I added my answer to your question on stackoverflow.\n. Thanks if my answer helped you. You can select as an answer.\n. -button::-moz-focus-inner is require on Firefox Mobile but input::-moz-focus-inner not I checked on My Google Nexus one with latest updated Firefox. I checked with this example http://jsfiddle.net/jitendravyas/NcDHx/3/show/\n. ",
    "borismus": "thx paul :D\n. ",
    "mieky": "I had the exactly same reaction the first time I downloaded MBP: \"do I really need all of this? Where do I begin?\"\nAlso, the build script is so complex that customizing it is very difficult.\n. ",
    "addyosmani": "+1 (though I should note with respect to the above that there are a number of businesses that target releasing \"mobile web apps\" and have to consider mobile browsers using Safari 2/WK at that time as the core rendering engine on the device. MQ support isn't always there :)\n. ",
    "thomie": "For anyone wondering, the line was added here: https://github.com/h5bp/mobile-boilerplate/issues/17\n. This is a real problem that should be fixed in this project. How about changing:\n@media only screen and (-webkit-min-device-pixel-ratio: 1.5),\n   only screen and (-o-min-device-pixel-ratio: 3/2),\n   only screen and (min--moz-device-pixel-ratio: 1.5),\n   only screen and (min-device-pixel-ratio: 1.5) {\n   /* Style adjustments for viewports that meet the condition */\n}\nby\n@media only screen and (-webkit-min-device-pixel-ratio: 1.5),\n   only screen and (min-resolution: 144dpi) {\n   /* Style adjustments for viewports that meet the condition */\n}\nSee:\nhttp://www.w3.org/blog/CSS/2012/06/14/unprefix-webkit-device-pixel-ratio/\nhttp://www.broken-links.com/2012/07/13/using-media-queries-to-test-device-resolution/\n. ",
    "sdesai": "Hey guys, apologize for the late response on the above mentioned bug for this issue, but we're not actively working on YUI Compressor at the moment, in order to focus efforts on core library work. We'll update the currently open bugs to make this clear. As for this issue, we can look at merging in a pull request if there's a fix and tests ready (the unit testing part of it is the real time consumer).\n. ",
    "jakearchibald": "Note: I haven't tested this on blackberry, only window mobile & android 2.2.\n. That commit message is awful, apologies. I have a hangover.\n. Sorry for not making a proper test case before now, I've added one to https://github.com/jakearchibald/mobile-boilerplate/tree/double-tap-bug - the bug exists on that branch, and goes away if you merge in my pull request.\nI've made a quick video showing the bug on a Samsung Galaxy SII running Android 2.3.4 - http://www.youtube.com/watch?v=I7AlwsveqjE\n. It's possible that that particular mobile is... diseased or something, don't have any other 2.3.4 devices to test on. \n. I get redirected to Google on Android 2.2 sometimes too (htc desire), sometimes works as expected \n. I wonder if this fix will break mobile devices with both touch screen and virtual mouse via keys, as some blackberries do. That way you could get a click event without a touchstart on a device that supports touch events.\n. Sorry, been a bit time-crunched recently so haven't had time to build a better test case. The problem with the current hack is it's based on the idea that a device has either a touch or click input, but that's not always the case. Some phones have both a pointer and a touchscreen (some Blackberry's) and Voiceover doesn't fire touch events.\nCurrently we're saying \"If you got a click without a touch on a touch device, ignore it\", but we can't really do that. The ua sniffing targets Android specifically rather than assuming all clicks before touch events are wrong.\n. ",
    "ShaneShipston": "It goes to a. page with link to Google after alerting \"hi\" (Android 2.3.6)\n. ",
    "randyjensen": "2.3.7\nGoes directly to Google for me in both Dolphin browser and stock browser\n. ",
    "mbijon": "On 2.3.6:\n1.) On first-load I see the link \"This is a link to page 2\".\n2.) Click...\n3.) The link-text changes to \"This is a link to google\"\n4.) Without doing anything else, I'm redirected to www.google.com\n. ",
    "hugomrdias": "on 1.html link to 2.html \non 2 link to google click an loads google\nAndroid 4.01\n. ",
    "myersjustinc": "2.3.7, CyanogenMod 7 nightly (Nov. 16, Captivate):\nTakes me to a link to Google, no additional redirect or alert.\n. ",
    "niftylettuce": "2.3.7, CyanogenMod 7 HTC Vision\nTakes me to the Goog on link click from 1.html\n. @arthurvr I'm not sure what those variables are in reference to, my JSHint configuration is a bit different and I don't get those errors; if you'd like to patch then?  Thanks\n. @arthurvr Okay, looks like there are a few more places too where addEvt can be added.  However I'm not certain of if it is necessary.  For instance, here it checks if addEventListener is defined, however the comment is misleading, since it says \"if it is undefined\" and the check is seeing if it exists on the window object... https://github.com/h5bp/mobile-boilerplate/blob/master/js/helper.js#L67.  Any insight here?\n. ",
    "CristinaSolana": "2.3.4\nTakes me to a \"This is a link to page 2\", click link, next page shows \"this is a link to Google\", then redirects to Google.\n. ",
    "ghost": "Nexus One, CyanogenMod 2.3.7, stock browser\nb. directly goes to Google\n. Android 2.3.3, Galaxy S2\nOn first load I see \"This is a link to page 2\".\nOn click I see link \"This is a link to Google\".\nOnly when I click it takes me to Google, without any message or alert.\n. ( : accommodate\n. +1\n. when is this going to get merged\n. maybe @alexgibson can tell me more or maybe @alrra or @arthurvr\n. ",
    "shello": "Samsung Galaxy S II, Android 2.3.3, original ROM, stock browser\nTakes me to google.com.\nEDIT: I just noticed jakearchibald's post and the behaviour I saw in my phone is the same as he shows in the video.\n. ",
    "burnleew": "Nice to see this fixed.  I ran across it 6 months ago & commented in the old MBP page comments (should've put it on here, sorry).  Ended up doing a caveman-ish fix to get by, but this is much better.\n. ",
    "RogerPodacter": "i don't think you got them all  e.g.:\nhttp://dl.dropbox.com/u/2792776/screenshots/2011-12-04_2030.png\non a different note, do you have any thoughts on my SO question:\nhttp://stackoverflow.com/questions/8380051/what-is-the-iphone-viewport-scale-bug?\n(i think part of the MBP is pretty confusing..)\nOn Sun, Dec 4, 2011 at 7:25 PM, Shi Chuan <\nreply@reply.github.com\n\nwrote:\nthanks for pointing this out, it is now fixed on the site :)\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/h5bp/mobile-boilerplate/issues/79#issuecomment-3010058\n. That's much clearer. Thanks\n. \n",
    "metallemon": "Yip, used ant build\nI got a fresh copy of mobile boilerplate this morning, ran ant build from the build dir, looked at index,html in the publish dir and the path to helper.js is still to mylibs, not to minified and concatenated js.\nI an building on a windows 7 64bit machine, it that means anything.\n. ",
    "benbabics": "The same thing is happening for me too. With one additional thing...\nintermediate/index.html now references new js (e.g. js/5cad722.js)\npublish/index.html references previous js (e.g. js/script.js & js/plugin.js)\nintermediate/js contains \"script-concat.min.js\" and previous scripts\npublish/js only contains \"5cad722.js\"\nseems like intermediate/index.html and publish/index.html should be swapped.\n. ant minify does the trick too. :)\nSent from my iPhone. Please excuse misspellings or shortness of my reply. \nOn Mar 7, 2012, at 12:13 PM, cloverfishreply@reply.github.com wrote:\n\nAnd more...\nAfter more poking around I have found that running \"ant build\" from the command line does not work, but running \"ant buildkit\" does.  This is encouraging, but it would be more encouraging if the default build would work.\nThe build.xml shows that that ant build uses -htmlclean while ant buildkit use -htmlcompressor.  The difference between these two is that -htmlclean references tool.htmlcompressor.opts from config/default.properties, but -htmlcompressor calls the compressor options individually while.  \nI'm no true developer, but it would seem to me that the chosen options of tool.htmlcompressor.opts never get included.  For now I guess I'll have to use buildkit and forget about any custom options.\nIncidentally, I never noticed that this thread was regarding mobile-boilerplate.  But does it really matter in this case?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/h5bp/mobile-boilerplate/issues/80#issuecomment-4372506\n. \n",
    "cloverfish": "Me too.  My version of H5BP is about a month old.  My version of H5BP Ant Build Script is from yesterday, March 6, at 5PM.  \nThe script runs successfully, but with htmlClean errors like this - [apply] ERROR Output must be a directory and end with a slash. For each file referenced by file.pages.default.include in the config/default.properties this error is repeated.\nThe Intermediate folder receives the correctly modified PHP files, but the Publish folder does not.  Meanwhile the Publish folder is receiving all the newly minified JS and so naturally the site is broken.  Have spent hours trying to find the origin/source of the build error, but with no luck.\nI am using Windows7 and using XAMPP.  Also I am running this through the Command Line, not the .bat file as the .bat file closes before I get a chance to read the errors.\n. More...\nOnly minutes ago, as an additional test I used the Customize tool for HTML5 Boilerplate and included the Ant Build Script in the download.  I ran the build script and checked the Publish directory to see if the index.html was updated with the new CSS and JS file names. \nSadly, the file names were not changed in Publish directory.  \nHowever, as before, they were changed in Intermediate directory. So I guess the files just aren't getting pushed properly.  But I'm just guessing.\n. And more...\nAfter more poking around I have found that running \"ant build\" from the command line does not work, but running \"ant buildkit\" does.  This is encouraging, but it would be more encouraging if the default build would work.\nThe build.xml shows that that ant build uses -htmlclean while ant buildkit use -htmlcompressor.  The difference between these two is that -htmlclean references tool.htmlcompressor.opts from config/default.properties, but -htmlcompressor calls the compressor options individually while.  \nI'm no true developer, but it would seem to me that the chosen options of tool.htmlcompressor.opts never get included.  For now I guess I'll have to use buildkit and forget about any custom options.\nIncidentally, I never noticed that this thread was regarding mobile-boilerplate.  But does it really matter in this case?\n. True.  I forgot to mention that.  Thanks.\nI'm alright with using ant buildkit but wouldn't it be nice to use the default function which worked like a gem in Mr. Irish's video demo?\n. ",
    "adamjgrant": "This is happening for me too, is there a fix or a workaround for this?\n. Perhaps this is related: https://github.com/h5bp/ant-build-script/commit/a0a4a2a01f23e2ade26378c765e5642b1731f5b3#commitcomment-1051093\nAlthough those changes are already implemented in my ABS...\nUpdate I was able to get it to skip past that by changing\n\nto \n\nNot sure if that's a good idea or not, though.\n. ",
    "vasilisvg": "That depends on whether you consider em-based layouts and em-based font-sizes to be the default. Some people don't, but I think people should, especially when working on responsive websites.\n. That's true, but by using html instead of :root you disable zooming on IE. Old IE's don't understand :root.\n. In that case I would still use :root, you never know who visits your mobile web app/site.\n. ",
    "pvnbg": "I propose the following changes:\nMBP.fastButton = function (element, handler) {\n```\nthis.handler = handler;\nif(element.length && element.length > 1) {\n    for(var singleElIdx in element) {\n        if(element[singleElIdx].addEventListener) {\n            this.addClickEvent(element[singleElIdx]);\n        }\n    }\n} else if (element.addEventListener) {\n  this.addClickEvent(element)\n}\n```\n};\n..........................\nMBP.fastButton.prototype.onTouchStart = function(event) {\n    event.stopPropagation();\n    var element = event.srcElement;\nelement.addEventListener('touchend', this, false);\ndocument.body.addEventListener('touchmove', this, false);\nthis.startX = event.touches[0].clientX;\nthis.startY = event.touches[0].clientY;\nelement.style.backgroundColor = \"rgba(0,0,0,.7)\";\n};\nMBP.fastButton.prototype.onTouchMove = function(event) {\nvar element = event.srcElement;\nif(Math.abs(event.touches[0].clientX - this.startX) > 10 || \n   Math.abs(event.touches[0].clientY - this.startY) > 10    ) {\n    this.reset(element);\n}\n};\nMBP.fastButton.prototype.onClick = function(event) {\n```\nevent.stopPropagation();\nvar element = event.srcElement;\nthis.reset(element);\nthis.handler.apply(event.currentTarget, [event]);\nif(event.type == 'touchend') {\n    MBP.preventGhostClick(this.startX, this.startY);\n}\nelement.style.backgroundColor = \"\";\n```\n};\nMBP.fastButton.prototype.reset = function(srcElement) {\n    srcElement.removeEventListener('touchend', this, false);\n    document.body.removeEventListener('touchmove', this, false);\n    srcElement.style.backgroundColor = \"\";\n};\n/*\n- Add events to the selected item\n  /\n  MBP.fastButton.prototype.addClickEvent = function(element) {\nelement.addEventListener('touchstart', this, false);\n  element.addEventListener('click', this, false);\n  };\nBy these changes we can:\n- Select an array of elements;\n- Each callback is being executed in event.currentTarget scope, not in MBP object scope.\nAnd another propose that i have not done yet - put the backgroundColor change at the beginning of the function. 10x\n. ",
    "suprMax": "Oh, hai. Since you include jQuery (or Zepto in the future), and I did a plugin just like that, I propose this: https://github.com/suprMax/Zepto-onPress \n. btw this thing breaks android. well it doesn't break it, just the screen goes all flashy on blur and focus. MB you should write about that in a comment or smth.\n. ",
    "voidfiles": "Sure.\n. So, I am having trouble building a simple test page. I was definitely having trouble with a product website, and when I disabled the scaleFix everything was okay. I might have been a bad interaction between some css, and JS.\n. ",
    "frequent": "maybe you could add a hint in the instructions, that you only put splash images in child directories or the respective pages directory. A link like   will not work.\n. Here is a quick demo using the boilerplate template index.html. \nI have put all the code on the page (extra css-rule|script to add css-rule|remove initHandler class). Timeout is set to 3000ms. Tried on HTC Android 2.3, iPad1, Firefox PC. \nPlease note: \nThe insertRule will only work from IE9+, so to be really cross-platform it would require some fiddling with addRule/insertRule.\n. sounds good. will do. give me some time though. \n. ",
    "nikmd23": "This script does not seem to work on an iPad 1. I suspect that it doesn't work with any non-retina display iPads.\nI can confirm that it does work with both retina and non-retina iPhones\n. Yes, I'm using the version from the latest boilerplate, I will open an new issue.\n. Oh perfect! Great work @alexgibson \nLooking forward to having the Boilerplate download updated with this new script\n. ",
    "sergiolopes": "The underscore hack works fine. It can be the last one or not, everything works.\n. I sent a pull request with the proposed changes and GitHub created another issue - #101\n. The media querie issue is the only big caveat. Maybe the script should provide a solution to automatically convert media queries to the new version.\nDuring my research, I found a solution using width=device-width normally. But in this case I have to scale down the page on landscape (the device-height solution scales up on portrait). Scaling down has some issues on older iOS versions but works fine. \nI got a pure CSS solution (no JS) based on this idea: https://gist.github.com/1935528\nAnd do you have some big page example so I can test performance? I tested using famous sites from mediaqueri.es, including BostonGlobe.com that is huge, and everything seems pretty fast even on my old 2nd gen iPod Touch.\n\nAnother cool solution MBP could use is @scottjehl's one:\n  https://github.com/scottjehl/iOS-Orientationchange-Fix\nAs all solutions (including mine), it also has some limitations, but it seems better than the currently solution MBP adopts.\n. ",
    "benjoffe": "I haven't tested this yet but this should take care of retina ipad and also avoid repeated html strings:\n<script>(function(){\nvar\n  i,\n  r = window.devicePixelRatio == 2 ? '-retina',\n  p = navigator.platform == \"iPad\" ?\n    [\n      'img/startup-tablet'+r+'-portrait.png\" media=\"screen and (orientation: portrait)',\n      'img/startup-tablet'+r+'-landscape.png\" media=\"screen and (orientation: landscape)'\n    ] :\n    [\n      'img/startup'+r+'.png'\n    ];\n  for (i=0; i<p.length; i++) {\n    document.write('<link rel=\"apple-touch-startup-image\" href=\"'+p[i]+'\" />');\n  }\n})()</script>\n. ",
    "oiva": "Looking at your commit, it seems to hardcode support for the h, l and m-folders?\nIs there a way to support arbitary subfolders under images? Say I want to create images/icons/application-icons.png and make the manifest include that file without editing the build.xml. \nI don't have much experience with Ant build scripts so I don't know if that's possible to achieve, but the current solution might create problems later on if it's not documented anywhere that you should use those exact folders.\n. ",
    "laukstein": "I do not see any reason to not apply the issue.\nYou can improve it with target-densityDpi:high-dpi fallowing http://dev.w3.org/csswg/css-device-adapt/#target-densitydpi0 and add @viewport properties in CSS http://dev.opera.com/articles/view/an-introduction-to-meta-viewport-and-viewport/\nW3C has mentioned on editor's draft 23 Jan 2012:\n\nAt risk since ‘resolution’ is at risk.\nThis property differ from the others since it is from the WebKit implementation used in the Android browser and not supported in Safari\n\nAs I have mentioned <meta name=\"viewport\" content=\"width=device-width\"> does not applies on Android.\n. ",
    "Trott": "Hmm...is this just validation-for-validation's-sake and I should close this pull request?\n. Sheesh, nobody's even going to comment? Harumph!  OK, well, since I'm not even sure this makes sense to do, I'm just going to quietly close this pull request.\n. Thanks!  I'm not so sure it was a good idea anyway, especially coming across a persuasive Paul Irish comment or three in a forum somewhere about the limits of the value of validation.  And it was a one-liner pull-request anyway.\n. ",
    "barraponto": "I got here from a Drupal issue since H5BP is somewhat of a reference for proper HTML5 implementation. I believe it should strive for validation, since everyone is learning from this project.\n. I guess @JohnAlbin means http://drupal.org/node/1717090, which is a spin off of the mentioned issue and is specific to what we're dealing here. There is a claim that the Netherlands require W3C validation for governmental projects (see http://drupal.org/node/1717090#comment-6366038) and that IE10 will drop conditional comments (see http://blogs.msdn.com/b/ie/archive/2011/07/06/html5-parsing-in-ie10.aspx).\n. ",
    "JohnAlbin": "I'm also coming from a Drupal issue. :-) http://drupal.org/node/1468582 But have the opposite opinion. Validation for validation's sake, as Paul Irish says, is silly. We know that this tag is ignored by browsers that don't understand it. And we know that it is validly written for IE. Adding extra code weight of a conditional comment is superfluous.\n. ",
    "Shoplifter": "I don't think, it's just validation-for-validation's-sake. Validation errors give a hint that you are wasting unnecessary bytes for standard compliant browsers. Admittedly not many, but I've seen optimizations less 'micro'. So my first try would be to handle that issue same way as hbp5 did with the X-UA-Compatible meta tag (move it to .htaccess or whatever server config file else is used). Unfortunately I don't have a win phone available to test this, anybody help me out?\n<IfModule mod_headers.c>\n    Header set X-UA-Compatible \"IE=Edge,chrome=1\"\n    Header set cleartype \"on\"\n  <FilesMatch \"\\.(appcache|crx|css|eot|gif|htc|ico|jpe?g|js|m4a|m4v|manifest|mp4|oex|oga|ogg|ogv|otf|pdf|png|safariextz|svg|svgz|ttf|vcf|webm|webp|woff|xml|xpi)$\">\n    Header unset X-UA-Compatible\n    Header unset cleartype\n  </FilesMatch>\n</IfModule>\nMy second-best option - if that dousn't work out - would be to drop that cleartype thing totally. Users can turn it on/off on their device deliberately, so why overrule them? If they dont, tey're obviously happy with their defaults anyway.\n. ",
    "maaalex": "Thanks for the responses so far. \nThe problem is reproducible with the following markup and yeah, it's a normal href link.\nhtml\n<nav>\n    <ul>\n        <li>\n            <a class=\"linkInherit\" href=\"content.html\">content link</a>\n        </li>\n    </ul>\n</nav>\ncss\n.page a.linkInherit {\n    display: block;\n    overflow: hidden;\n    text-overflow: ellipsis;\n    white-space: nowrap;\n}\n@davidcalhoun \nThe link isn't triggered on double-tapping directly over the element, neither with a double-tap elsewhere with focus on the href.\n. ",
    "gabrielizalo": "Cool.. I'll stay tuned\n; )\n. ",
    "kitsguru": "Duh... s/b css3menu.com - but I have created a test case on jsfiddle.net\nhttp://jsfiddle.net/kitsguru/WYHcx\ncomment out the JS call to MBP.scaleFix(); and the menu behaves as expected on the iPad/iPod - don't have iPhone to test it on.\n. ",
    "aronwoost": "+1\n. ",
    "buberdds": "yep, still buggy after gesture event. maybe implementing approach with devicemotion would be better?(https://github.com/scottjehl/iOS-Orientationchange-Fix/blob/master/ios-orientationchange-fix.js)\n. The problem will probably be of minor importance after iOS update. However, if you want to maintain this helper for older versions, you could refactor this part of code in the future using Scott's solution (or another one), but that's another story.\nI think that pull request is good, but it's not the answer for all issues with scale bug :)\n. Ops, sorry for duplicate this issue.\nbtw, according to: \nhttps://developer.mozilla.org/en-US/docs/CSS/Media_queries \nand \nhttp://www.w3.org/blog/CSS/2012/06/14/unprefix-webkit-device-pixel-ratio/\nmin-res with dppx is future proof, while min-res dpi might be not (\"early implementations\").\nAnyway, glad you already working on this issue. Good luck!\n. ",
    "roryf": "Reported it here: https://code.google.com/p/android/issues/detail?id=34301\nYes, adding html to the selector fixes the issue.\n. ",
    "chillfinn": "Hmm, I think I tried that too, but will revisit later..thanks!\n. ",
    "PeteSchuster": "sent pull request\n. ",
    "MarkDijkstra": "All links that have a an empty value in my plugins do have an preventDefault, so this isn't an solution, as the links work perfect in the browsers on and device(mobile to desktop). The script used to prevent from using safari seems to be the issue. So the script should skip empty anchors.\n. The same issue occurs if i use a tabs plugin, with anchors like #tabs1, #tab2 etc. The script should skip these kind of anchors.\n. ",
    "englishextra": "Right\n. ",
    "grayghostvisuals": "Not that I use the mobile boilerplate, but I like having my sites display at the actual size and not a scaled up version that occurs without initial-scale It's also good to note that the orientation bug was fixed in iOS6.\n:+1: for reinstating initial-scale=1\n. Welcome back initial-scale=1 Make us proud! :fireworks:\n. ",
    "maxw3st": "Since initial-scale=1 allows a developer the ability to have content initially displayed at intended scale I see it as a good thing. Further, it doesn't restrict the use of scale by the viewer/user, only sets a baseline from which the user can scale content as they like. That freedom to choose should also be a goal for developers, as well as a plus for users. Isn't that what we're all after?\n:+1: for reinstating initial-scale=1\n. I'm definitely behind the idea of having the site display at initial-scale=1. It gives the developer a definite baseline to count on when designing layout.\n:+1: \n. ",
    "AllThingsSmitty": "Tim Kadlec's recent post discusses the need for this as well with some general guidance.\nhttp://timkadlec.com/2012/10/ie10-snap-mode-and-responsive-design/\n. ",
    "drublic": "Totally :+1:\n. True. Thanks for the feedback.\nWill hopefully fix that with h5bp/h5bp.github.com#3 some time soon!\n. :beers: \n. Updated PR.\n. So… Here comes the updated commit. This is now tested properly and works fine on iOS.\n. Yes, I like the idea. Could it be something we should track in another bug for the next major release? Seems to work pretty good for HTML5 BP.\n. There are some mobile frameworks out there like Ratchet that provide some of the functionality that is needed for mobile development. Question is where we draw the line to call it a \"boilerplate\".\nIs it necessary to scroll to the top of a page in 95% of mobile web-pages? If yes, it should be part of the boilerplate. And if it's in, it should be tested.\nHTML5BP is clearly set to provide the minimum. I think the target for the Mobile Boilerplate project still needs to be defined.\n:)\n. Actually I'd go for documenting what is out there and where the methods in helpers.js are taken from. I'd love to see this in the docs-folder. Some part of the documentation does not depend on #159 so adding these repos is just an addition which is needed anyway. Removing the helper's functionality is IMO another.\n. Updating to normalize.css v2.1.1 sounds good to me.\nIncluding the mobile meta tags in 404.html should be discussed in another PR I think.\n. This looks good to me.\n. Just added a line in the changelog. Hope that made it in :)\nThanks for merging!\n. I wouldn't go for a custom build here because a lot of users may not understand that we are not using full jQuery.\nBut we should update the docs here and encourage users to do a custom build.\n. I'm with @jdalton on this. Why not save some bytes you're sending down the wire if it comes with nearly no effort?\nIt's easy to include a grunt task for your builds.\nWhat speaks against encouraging devs to do so?\n. Sounds good to me. Can you please update the note in CHANGELOG.md please?\n. Since we want to encourage people to use a build step for their scripts before deploying to a production environment, I don't think we need to add a CDN reference. Please also see the discussion in h5bp/html5-boilerplate#1327.\n. Sure :)\n. Sounds good to me to go with it. Cross-Reference h5bp/html5-boilerplate#1441.\n. I think it is a great idea but would rather see this in some kind of extension. Like for example just as an edit to the documentation since the use case does not apply to everyone using Mobile Boilerplate as their starting point.\n. Sounds good to me to include it here, since the target of mobile boilerplate is probably more in the apps field.\n. Mobile Boilerplate isn't a library and would therefore not be useful to download as a component with Bower or any other package management tool.\n. Any more input on this? I'd close this issue otherwise.\n. Yes, removing this seems legit. If we want to we could add it to the docs but this doesn't seem to add a lot of value since there are so many devices and OSs that need special handling that WP7 is just a small portion of.\n. Thanks. Merged in e28142a9fdfedbfd4fa4afc17e942f5f0fb3fdc2.\n. Thanks @arthurvr! Squashed this into one commit.\n. Merged in 8d2fc00091fdc95f80bdb64b3fe9f5d0cff918e2. Thanks.\n. Thank you, Arthur.\n. Sounds like a good idea :)\n. Can you please squash those into one commit please?\n. Wasn't sure if this working with the current coding style but totally +1. Update coming.\n. ",
    "oscar-broman": "There's more work needed to be done.\n. ",
    "sindresorhus": ":+1: \n. ",
    "romamatusevich": "Nice solution.\n. PR updated.\n. Thanks for the comment. Done.\n. CHANGELOG.md updated.\n. Sounds good, but maybe we can add Google CDN reference to jQuery also?\n. Now clear,  thanks for the explanation. \n. Yes. But maybe better to make string \"Replace Zepto with jQuery 2.0.0 (#152)\" and add string \"Update to jQuery 2.0.3 (#185)\". So it will be more clear. What thoughts about this?\n. PR is ready.\n. usage.md updated.\n. ",
    "arthurvr": "Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. > Yes unless anyone comes forward with some valid reasons not to switch to FT FastClick, I plan to merge #194 sometime soon.\nIt's merged. Let's close down this issue.\n. All the needed touch icons are included since https://github.com/h5bp/mobile-boilerplate/commit/38e1a6e73c2b68db0bc0c77e1b6ce3facfd9fef5, so I think I can close this issue? Is there something more you guys want to address? \n. Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. > You are now on the team, congrats! :tada:\nThanks guys! :+1: :+1: :+1: \n@alrra You added me already? Cause it seems like I can't do anything more at the moment... \n. >  but you need to accept the invitation. Check your email.\nIndeed! Thanks!\n. Thanks for the PR, @frontenddeveloping! \n. :+1: Thanks for the PR!\n. :+1:\n. Merged! Thanks @slavanga!\n. Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. :+1: Thanks for the PR! \n. Thanks for the PR! \nI do not really like the all the comments in the code, and would like to replace this with the docs. Thoughts?\n. Merged! Thanks @frontenddeveloping\n. ping @h5bp/mobile-boilerplate \nI don't know about anything planned, but maybe we should set up a milestone?\n. @alexgibson Did you have anything planned regarding a new release? Want to close this issue.\n. @alexgibson Not yet. Just asking because I couldn't figure out if something was planned.\n. Perfect. Thanks for the addition. Going to update the docs ASAP. \n. Thanks for the PR, @niftylettuce!\nSome other stuff JSHint is throwing:\n\nMaybe it's a better idea to take them all in one commit? Can you update your commit? If not, I can handle it if you want me to.\n. Merged in https://github.com/h5bp/mobile-boilerplate/commit/986875a733617ce7e4b239ac204729afc58ae5c7. Thanks @niftylettuce!\n. Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. @niftylettuce Thanks for the PR! Can you do the one on line 22 too?\n. Hey there. Thanks! We appreciate it :) I'm going to close this as this project is deprecated.\n. Hey there. Thanks! We appreciate it :) I'm going to close this as this project is deprecated.\n. Hey there. Thanks for reporting this. We appreciate it :) I'm going to close this as this project is deprecated.\n. Hey there. Thanks! We appreciate it :) I'm going to close this as this project is deprecated.\n. Hey there. Thanks! We appreciate it :) I'm going to close this as this project is deprecated.\n. For us, this line needs to stay in.\n. missing newline\n. ",
    "RByers": "Thanks for the response!  I'm glad to hear this isn't the typical pattern I posted about (I didn't dig in detail - seen this pattern too many times).\nI noticed the issue by trying (and failing) to click on links on this site on my Chromebook pixel: http://craigerrington.com/blog/arm-chromebook-chromeos-and-xfceubuntu-at-the-same-time/\nDebugging into the code, this chunk is getting hit cancelling the click event:\nMBP.ghostClickHandler = function (event) {\n  if (!MBP.hadTouchEvent && 'ontouchstart' in window) {\n    // This is a bit of fun for Android 2.3...\n    // If you change window.location via fastButton, a click event will fire\n    // on the new page, as if the events are continuing from the previous page.\n    // We pick that event up here, but MBP.coords is empty, because it's a new page,\n    // so we don't prevent it. Here's we're assuming that click events on touch devices\n    // that occur without a preceding touchStart are to be ignored.\n    event.stopPropagation();\n    event.preventDefault();\n    return;\n  }\nI see this code has changed in the current version to have a UA check for Android, so presumably it's fixed now.  If you point me at an example site using this version of the code I can double-check.\nBy the way, ideally you'd just disable the fastclick support on Chrome desktop entirely - we don't (and never will) delay click events on desktop.  We're also reducing the scenarios where we delay clicks on Chrome for Android too.\n. ",
    "anthonybruno": "Might have been my error.\n. ",
    "jdalton": "You could also use a custom build of jQuery here:\nhttps://twitter.com/jeresig/status/326755733565759489\n. \\o/\n. @necolas Customizing a build to suite their needs (using the qsa wrapper selector engine, or excluding parts they don't need) is a good thing.\n. ",
    "BenjaminRH": "@necolas surely the monolithic libs are where custom builds are the most important?\n. ",
    "danielgrippi": "\n. ",
    "dryabov": "It's better to check for && navigator.userAgent.match(/\\bOS 6_/). Unlikely they will change it in iOS 7.1 or 8.0.\n. 1. sizes=\"196x196\".\n2. Note that this feature has been disabled in Chrome 31: https://twitter.com/ChromiumDev/status/402821347442561024, but it works in Chrome 32 beta that was released a week ago: http://googlechromereleases.blogspot.ru/2013/11/chrome-beta-for-android-update_20.html.\n. ",
    "gonzalocasas": "Yup, you're right, thx\n. Done!\n. ",
    "quarklemotion": "Alex, I have made the changes you requested.  Let me know if you have any other concerns.\n. ",
    "mysegfault": "Oh i was saw that you switched to FT FastClick ! So this is useless now...\n. ",
    "timgluz": "OK, good to know; It was registered on bower.io and it'll be nice that every bower project has proper bower.json file. Specially, when 3rd party is going to use library then this file helps to manage information about licenses and dependencies.\n. If you want to remove your library, then you should check out this documentation here: http://bower.io/#registering-packages\n. ",
    "rwjblue": "@alexgibson - It has been removed.\n. ",
    "abhinayrathore": "Sounds good @alexgibson ! Please let me know if the docs look alright now.\n. ",
    "maxxiimo": "Hi Paul,\nThis appendix in a book I'm writing has some of the information you're looking for...\nhttps://github.com/maxxiimo/coding-design/blob/master/appendices.md#appendix-10\nHope it's useful.\n. ",
    "alebelcor": "My pleasure! anytime.\n. ",
    "zackphilipps": "The entire what I call \"mobile meta\" section needs a little updating. It doesn't include code for startup images, and as you've already discussed, the touch images have new size standards.\nHere's the entire mobile meta section I'd like to see used in the boilerplate: \n```\n        \n\n\n\n\n    <!--<link rel=\"apple-touch-icon-precomposed\" sizes=\"152x152\" href=\"img/touch/apple-touch-icon-152x152-precomposed.png\">\n    <link rel=\"apple-touch-icon-precomposed\" sizes=\"120x120\" href=\"img/touch/apple-touch-icon-120x120-precomposed.png\">\n    <link rel=\"apple-touch-icon-precomposed\" sizes=\"72x72\" href=\"img/touch/apple-touch-icon-72x72-precomposed.png\">\n    <link rel=\"apple-touch-icon-precomposed\" href=\"img/touch/apple-touch-icon-57x57-precomposed.png\">\n    <link rel=\"shortcut icon\" sizes=\"196x196\" href=\"img/touch/touch-icon-196x196.png\">-->\n    <link rel=\"shortcut icon\" href=\"img/touch/apple-touch-icon.png\">\n\n    <!-- Tile icon for Win8 (144x144 + tile color) -->\n    <!--<meta name=\"msapplication-TileImage\" content=\"img/touch/apple-touch-icon-144x144-precomposed.png\">\n    <meta name=\"msapplication-TileColor\" content=\"#222222\">-->\n\n    <!--[if IE]>\n        <link rel=\"shortcut icon\" href=\"favicon.ico\">\n    <![endif]-->\n\n    <!-- Startup images -->\n\n    <!-- iOS 6 & 7 iPad (retina, portrait) -->\n    <!--<link href=\"img/startup/startup-tablet-portrait-retina.png\"\n        media=\"(device-width: 768px) and (device-height: 1024px)\n           and (orientation: portrait)\n           and (-webkit-device-pixel-ratio: 2)\"\n        rel=\"apple-touch-startup-image\">-->\n\n    <!-- iOS 6 & 7 iPad (retina, landscape) -->\n    <!--<link href=\"img/startup/startup-tablet-landscape-retina.png\"\n        media=\"(device-width: 768px) and (device-height: 1024px)\n           and (orientation: landscape)\n           and (-webkit-device-pixel-ratio: 2)\"\n        rel=\"apple-touch-startup-image\">-->\n\n    <!-- iOS 6 iPad (portrait) -->\n    <!--<link href=\"img/startup/startup-tablet-portrait.png\"\n        media=\"(device-width: 768px) and (device-height: 1024px)\n           and (orientation: portrait)\n           and (-webkit-device-pixel-ratio: 1)\"\n        rel=\"apple-touch-startup-image\">-->\n\n    <!-- iOS 6 iPad (landscape) -->\n    <!--<link href=\"img/startup/startup-tablet-landscape.png\"\n        media=\"(device-width: 768px) and (device-height: 1024px)\n           and (orientation: landscape)\n           and (-webkit-device-pixel-ratio: 1)\"\n        rel=\"apple-touch-startup-image\">-->\n\n    <!-- iOS 6 & 7 iPhone 5 -->\n    <!--<link href=\"img/startup/startup-retina-4in.png\"\n        media=\"(device-width: 320px) and (device-height: 568px)\n           and (-webkit-device-pixel-ratio: 2)\"\n        rel=\"apple-touch-startup-image\">-->\n\n    <!-- iOS 6 & 7 iPhone (retina) -->\n    <!--<link href=\"img/startup/startup-retina.png\"\n        media=\"(device-width: 320px) and (device-height: 480px)\n           and (-webkit-device-pixel-ratio: 2)\"\n        rel=\"apple-touch-startup-image\">-->\n\n    <!-- iOS 6 iPhone -->\n    <!--<link href=\"img/startup/startup.png\"\n        media=\"(device-width: 320px) and (device-height: 480px)\n           and (-webkit-device-pixel-ratio: 1)\"\n        rel=\"apple-touch-startup-image\">-->\n\n    <!-- SEO: If mobile URL is different from desktop URL, add a canonical link to the desktop page -->\n    <!--\n    <link rel=\"canonical\" href=\"http://www.example.com/\" >\n    -->\n\n    <!-- Disable phone number detection. -->\n    <!--<meta name=\"format-detection\" content=\"telephone=no\">-->\n\n    <!-- Add to homescreen for Chrome on Android -->\n    <!--\n    <meta name=\"mobile-web-app-capable\" content=\"yes\">\n    -->\n\n    <!-- For iOS web apps. Delete if not needed. https://github.com/h5bp/mobile-boilerplate/issues/94 -->\n    <!--\n    <meta name=\"apple-mobile-web-app-capable\" content=\"yes\">\n    <meta name=\"apple-mobile-web-app-status-bar-style\" content=\"black\">\n    <meta name=\"apple-mobile-web-app-title\" content=\"\">\n\n    <!-- This script prevents links from opening in Mobile Safari. https://gist.github.com/1042026 -->\n\n    <!-- The bottom part resumes the web app where the user left off -->\n\n    <!--<script>(function(a,b,c){if(c in b&&b[c]){var d,e=a.location,f=/^(a|html)$/i;a.addEventListener(\"click\",function(a){d=a.target;while(!f.test(d.nodeName))d=d.parentNode;\"href\"in d&&(d.href.indexOf(\"http\")||~d.href.indexOf(e.host))&&(a.preventDefault(),e.href=d.href)},!1)}})(document,window.navigator,\"standalone\")\n\n    if (window.navigator.standalone) {\n      var setLastUrl = function() {\n        localStorage['lastUrl'] = window.location;\n      }\n      if (sessionStorage['init']) {\n        setLastUrl();\n      } else {\n        sessionStorage['init'] = true;\n        if (localStorage['lastUrl']) {\n          if (localStorage['lastUrl'] != window.location) {\n            document.location.href = localStorage['lastUrl'];\n          } else {\n            setLastUrl();\n          }\n        } else {\n          setLastUrl();\n        }\n      }\n    }\n\n    </script>-->\n\n```\nI've a repository with the updated index.html as well as updated touch images. I simply expanded the canvas size of the 144x144 and 114x114 images to 152x152 and 120x120. You can view it here.\nI've also added a means of disabling mobile phone number detection and more to the script that prevents links from opening in Mobile Safari. The bit I've added isn't minified, so that's the only thing I would change!\n. I grabbed the startup images code from here.\nI would've submitted a pull request, but I've already forked MBP once. :)\n. ",
    "alrra": "Thanks @romamatusevich!\n. @emiluzelac Merged in https://github.com/h5bp/mobile-boilerplate/commit/10b8d3d8f46ae06219d2cde005d821d0f145d617. Thanks!\n. > Sorry for being such a noob.\nNo problem! Thanks again for the PR!\n(btw, if you have time, I highly recommend Pro Git).\n\nshould I delete the branch?\n\nYes.\n. > If you want me to do a PR, let me know.\n@arthurvr feel free to open a PR! :)\n. Thanks @arthurvr!\n. Thanks @arthurvr!\n. Thanks again @arthurvr!\n. Thanks @arthurvr!\n. Thank you for being so awesome @arthurvr! :purple_heart: \n. @alexgibson @drublic What do you guys think about including @arthurvr to the mobile-boilerplate team? He's been quite helpful recently!\n. @arthurvr You are now on the team, congrats! :tada:\nFeel free to commit non-trivial changes like this one without opening a PR! :)\n. > You added me already? Cause it seems like I can't do anything more at the moment... \n@arthurvr Yes, but you need to accept the invitation. Check your email.\n. LGTM. @arthurvr feel free to merge this! :)\n. See also: \n- https://github.com/necolas/normalize.css/commit/0c31dada5189a577f16fc61cbd8680e7f35bcca3\n- https://github.com/necolas/normalize.css/issues/411\n\n@dieseltravis This should come with the new version update, but let's change it anyway. :)\n. 192×192\n. @frontenddeveloping  In practice, iPhone 6 and 6 Plus don't use the 180×180 icon,  see: https://github.com/h5bp/html5-boilerplate/pull/1599.\n. ",
    "emiluzelac": "Most definitely: https://github.com/emiluzelac/mobile-boilerplate/compare/h5bp:master...patch-2?quick_pull=1\n. All set :)\n. That is odd. Allow me to check when I arrive home :)\nOn Friday, June 27, 2014, Alex Gibson notifications@github.com wrote:\n\nLooks like you still need to push the commit to this branch, changes\naren't showing up here?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/h5bp/mobile-boilerplate/pull/214#issuecomment-47394235\n.\n. Thanks @alrra!\n. Sorry for being such a noob, should I delete the branch?\n. Awesome and will check Pro Git as well, thanks!\n. \n",
    "frontenddeveloping": "Just create a pull-request https://github.com/h5bp/mobile-boilerplate/pull/232 with more touch-icons\n. I think it will be better to left comments in code, who reads docs? :)\nNot all know all about this icons. It will be easy to understand which icons I must remove if I male iOS standalone app for iOS7+.\n. +1, mobile is everywhere\n. fixed\n. fixed\n. ",
    "slavanga": "Here's the new PR https://github.com/h5bp/mobile-boilerplate/pull/229\n. ",
    "filipelinhares": "+1\n. ",
    "hzlmn": "@arthurvr ok, e5a1ebb085f8c1d9c2a419241230b08c43799028\n. oh, fixed it\n. "
}