{
    "egtann": "Great eye. Thanks for fixing this!\n. Hey Wayne:\nYou're absolutely right that this is the correct flow for contributions. Those are some pretty big bugfixes, so it's much appreciated.\nAs it turns out, another developer sent me a cmd/setup.sh (outside of Github) that fixed the bugs you mentioned and many more. It's really my fault for not getting it up here sooner.\nI'll run some tests and have the fixed cmd/setup.sh integrated shortly. Apologies for any trouble, and thanks again. Let me know if there's anything else you need to get started.\nEvan\n. Hey Paul. Rather than switch DBs, which is a massive task, have you considered registering to listen for events in your plugins? It's a new feature that I have yet to add to the guides, but you can see the API documentation here: https://godoc.org/github.com/itsabot/abot/shared/datatypes#PluginEvents\nTo use these EventListeners, add something like the following to your plugin after you create it:\ngo\np, err = plugin.New(\"github.com/itsabot/plugin_weather\", trigger, fns)\nif err != nil {\n    log.Fatal(err)\n}\np.Events.PostReceive = func(cmd *string) {\n    p.Log.Info(\"received\", *cmd)\n}\nUsing these listeners, you'll be notified of key events as they occur in Abot's core, like when any message is received, processed, and sent. Notice that you also have access to a pointer to the underlying data, so you can actually modify the command before it's routed to the appropriate plugin.\nDoes that achieve the functionality you're looking to add?\n. Glad to hear it, Paul.  The weather plugin is a good first start and the guides should help.  I'm going to close this issue, and if you need any additional feedback or help, we're happy to answer through the mailing list.\n. FYI, I've now added a Plugin Events section to the Building a Plugin guide. https://github.com/itsabot/abot/wiki/Building-a-Plugin#plugin-events\n. Glad the problem is sorted out!\n. Good eye.  Thank you.\nEvan\n. I'm taking a look now. There are some more issues here with the auto reload.\nWe just recently moved from Echo to httprouter. That change introduced this regression.\n. Pulling in #12 to fix this. I wanted to keep the /_/cmd/ws URL format, since this is only loaded in a development environment.\n. Good catch! Merging\n. Thanks guys. We should definitely be using json.Decode here.  Diving in now.\n. This should be fixed by the new pull request #14. If you still get errors, please create a new issue, and we'll debug them there.\nBest,\nEvan\n. Hi Cory.\nTo identify the issue, could you provide more details?  I'll need three pieces of information to solve this:\n1. What did you do? Which endpoint did you hit?\n2. What happened? What response was returned?\n3. What were you expecting to happen? What's the desired behavior?\n. Commands that follow also ensure that you're running on one machine, i.e. not containers. For instance the next check ensures that psql is in your $PATH.\nI'd recommend making an option available to users when they run cmd/setup.sh that asks them if they're using containers (Y/n) and then runs different commands based on that response.\nCould you put together a pull request for that?\n. This is connected to issue #22. We're going to switch how we handle Postgres in development to match how we handle production, i.e. use a DATABASE_URL environment variable.  Hold off on any pull requests until we get that sorted out in the next few days.\n. #39 should provide a solution for you. You'll want to run cmd/setup.sh on your Abot container and cmd/dbsetup.sh inside your Postgres container.\nLet me know how it goes!\n. In my testing, the split setup seems to work. I'm closing this issue. @inaiat @kaminskypavel if you're still having issues with Abot in Docker, we can discuss them here or in a new issue.\n. Interesting.  It seems your $GOBIN isn't configured. Can you share the output of echo $GOBIN?\nAFAIK a default installation of Go should point it toward /usr/local/go/bin\n. The glock installation step is handled automatically in cmd/setup.sh, but it looks like it was a GOBIN problem.  Go is a little tricky to install. Glad to hear it's sorted out!\nIf you wanted to submit a PR for checking that your $GOBIN is configured in cmd/setup.sh, I'd be happy to accept it.\n. Edit: Misread your above post. :) \nIt should definitely prevent you from registering using the same email twice. I'll take a look.\n. Perfect.  Thank you! \n. Hi Davide. You'll need to upgrade to Postgres 9.5+ as per the readme.\nThe US number limitation is due to my lack of experience with international numbers and services. If you'd like to add support, I'd be happy to accept a PR.\nIn the meantime, I'm going to close this issue. If you have any additional questions, we're happy to answer them over the mailing list!\nBest,\nEvan \n. Hey Dale. It'd be great to have you on board.\nIf you're looking for tasks, I'd encourage you to check out our How to Contribute guide, which has ideas for things to build. Right now the biggest impact changes are going to be building plugins that everyone can use. There are some ideas for plugins in the How to Contribute guide as well.\nThe Getting Started and Building a Plugin guides should help you get up and running.\nIf you have any additional questions, we're happy to answer them over the mailing list.\nBest,\nEvan\n. Great. Let me know if you have any additional questions! Happy to help.\n. Have you created a Postgres user named \"postgres\"?  After that, did you run cmd/setup.sh?\n. And cmd/setup.sh ran successfully without any errors?\n. What does your pg_hba.conf look like?  Mine's at /etc/postgresql/9.5/main/pg_hba.conf but your location may be different.\nThe key line in the pg_hba.conf should look like this to enable password-less login:\nlocal   all             postgres                                trust\nor \nlocal   all             all                                     trust\n. It's the md5 after local all postgres md5 that's causing the issues. We'll add support for password-based logins on the DB in development soon, but in the meantime you should be able to get it to work by changing\nlocal all postgres md5\nto\nlocal all postgres trust\nIt's an interim solution, but a solution nonetheless. Be sure to restart Postgres as well after editing pg_hba.conf.\nLet me know if that works for you!\n. Interesting. What happens when you run abot plugin install by itself?\nWe'll have a better fix for allowing password-based Postgres logins in development environments in the next few days.\n. @Jambo-Dunia that's going to be a separate issue. It has to do with your $GOPATH/bin not being added to your $PATH. There's a thread here with a solution: https://groups.google.com/forum/#!topic/abot-discussion/XRCaEnRZxl4\n. @urupvog there appears to be an issue with your codebase from a modification. I would clone a clean version from GitHub and try again.\n. Glad to hear it. Closing this issue.\nFor others referencing arriving on this thread, the solution was to modify pg_hba.conf from local all postgres md5 to local all postgres trust as a temporary measure. Soon we'll allow database use through a DATABASE_URL via an upcoming pull request.\n. Marking this as a duplicate of #22. Let's debug it in there.\n. Hey guys. Thanks for reporting the issue.\nIt's probably unrelated to locationid and authorizationid (which is only used for authorizing purchases over SMS). I'll dive into this and create a pull request to fix.\n. I'm unable to replicate the issue except by manually deleting cookies from my browser after sign-in. Tested on multiple browsers including Safari on a Mac.\nAre you using any browser extensions which prevent cookies from being created or stored? It seems the cookies created on login aren't being sent back to the server in your HTTP requests. If that's the case, erroring out is the correct response.\nThat said, I'm changing the error code from 500 (Internal Server Error) to 401 (Unauthorized) in the auth code, since it's the client's responsibility to send the appropriate cookies.\n. > After pulling the latest changes it's still a 500 error, by the way.\nAha. The problem must be somewhere else in the handler. All those cookie values look good.  I'll dive in and take a look.\n@calliander the 500 error occurs on which networking request? Is it missing the cookie on GET .../profile.json?\n. I think I know the issue if it's a problem with secure cookies. Are you browsing Abot via some web address that doesn't include the string \"localhost\" in it?\nIf so, that's the issue, and I can have a fix out soon.\n. Just merged a fix: #41. Give it a shot now, and let me know if that fixes it for you!\n. Hi @chajas. I haven't tested any of this outside of Linux/OSX, so I can't really comment. I would try running the command manually and check the output:\n$ glock install github.com/itsabot/abot --verbose\nLet us know what you find.\nAt the end of the day, that line just adds githooks to keep your dependencies up-to-date. It's not critical. You could remove that line from cmd/setup.sh and re-run, keeping your dependencies in sync manually by running the following after every git pull:\n$ glock sync github.com/itsabot/abot\n. Without Glock managing dependencies you'll need to pull in the dependencies via Go manually:\n$ go get ./...\nLet me know how it goes.\n. @chajas are you on Windows?\n. I'd recommend running Abot on Linux or OSX.\nWindows support is \"nice-to-have\" for us (I'll accept pull requests) but for now will probably be pretty buggy.\n. I'm closing this issue. We can discuss #32 in that thread.\n. This issue is closed. If you'd like help, please find it in robfig/glock#32.\n. Yeah, that's the right approach.\n. I'd like to keep the licensing clean and clear: MIT. If that means a small refactor, no big deal.\n. That's an old plugin using an outdated API. Sorry bout that. Part of this v0.2 release (ETA June 1, 2016) is to get many of these plugins into working form. Right now the only one expected to work is weather (but pull requests on any of them would be welcome!).\nAre you running abot plugin install each time after changing plugins.json? That should delete plugins.go and recreate it, preventing you from downloading the plugins again.  If not, let me know as that would be a bug. In that case, delete plugins.go manually and re-run abot plugin install after that as a temporary fix.\n. I'm not able to replicate the issue. I add a plugin to plugins.json, run abot p install, and it downloads it to my $GOPATH. I delete that line from my plugins.json, delete the plugin directory from my $GOPATH, and re-run abot p install, but the plugin isn't downloaded again (i.e. it's behaving as expected).\n. I'm closing this issue for now, since I can't reproduce it. @bwcall if you still experience problems with plugin installs, we can discuss them here, but for now, it appears everything is working as expected on Linux and OSX.\n. What version of Postgres?\n. You have to use Postgres 9.5+ (see the README). Closing the issue for now. After upgrading if it's still causing trouble, feel free to create a new issue.\n. Looks like you don't have a Linux/BSD compatible ps. Try removing the trouble line from setup.sh and re-running.\n. Try the latest cmd/setup.sh from #39 to see if anything's changed. You can now pass in your specific Postgres details as a command line arg while running that. See the README for the added functionality.\n. For now, I'd recommend running Abot on Linux or OSX. While it may work on Windows, you may continue to experience weird bugs. It's much easier to boot up a VM.\nI'll be adding a Linux/OSX requirement to the README and closing Windows-related issues, marking them as wont-fix. That said I am open to accepting PRs for Windows fixes as long as it doesn't impact the other platforms.\n. Just to be clear, you're exposing any ports out of Vagrant you'll need, right? You should be able to connect on localhost:4200.\nYou'll have to create a user to send Abot messages in the console--that's the error you're seeing.\n. From within your abot directory, what does pwd | sed \"s|$GOPATH/src/||\" output?\nAlso what does echo $GOPATH output?\n. Great to hear. Closing this issue. @exetwezz if you're still experiencing problems after implementing the fix above, let me know here.\n. The ON keyword was added in Postgres 9.5, so it seems that you're running a Postgres instance that isn't 9.5+. Closing this issue. If you're still experiencing problems and are sure you have no other running Postgres processes < 9.5, we can re-open this issue.\n. You can see how we communicate over HTTP via the Abot console command (inside abot.go). The console is a much nicer interface for testing over HTTP. You're right though, curl instructions should be added to the guides. I'll reopen this issue and plan to add those shortly.\n. Added curl and custom endpoint instructions for abot console to the Getting Started guide. https://github.com/itsabot/abot/wiki/Getting-Started#communicating-with-abot\n. I had never seen that done before, so I looked it up. From the Go wiki here, under Tips and Tricks: Use a Single GOPATH:\n\nEven though the GOPATH may be a list of directories, it is generally correct and sufficient to use a single GOPATH for all Go code on your machine. Since all packages retrieved with \"go get\" have a unique URL (and thus a unique path on disk), having more than one GOPATH is almost never necessary when building with the Go tool.\n\nBut it is technically valid, so we should still support it. I'll mark this as a good first bug for contributors. We can default to using the first directory in the list and then iterate through the remaining directories in the list.\n. Yes, absolutely. That can be done from within the driver's handler, e.g. at the endpoint /slack.\nTake a look at the itsabot/twilio driver for an example. func handlerTwilio could easily extract binary data from an MMS, process it as it sees fit (e.g. through a Google Vision API), and return a response based on that binary data. You could do the same thing with Slack based on the format of the request that Slack uses to notify your endpoint.\nI'm going to close this issue for now, since we do have a means of handling incoming binary data, but let me know if you need any additional direction. I'd also love to feature your Slack or vision drivers on itsabot.org if that's OK with you!\n. Hey Nathan, thanks for making this. I would like to have a single installer via sh, though, so I can't merge this in.\nInstalling Go and Postgres 9.5 seem to be big sticking points for new Abot developers, so the purpose of this install script will be to automate the process with defaults.\n. That's precisely what we'll do. The script is open-source and available for everyone to read before running. I'm taking inspiration Heroku's cli tool install process, which does the same thing.\n. Ubuntu and OSX to start.  I assume most people running Arch and Fedora will be able to install the dependencies themselves, whereas Ubuntu seems to be the \"starter\" distro.\n. Heroku uses an actual installer for OSX. I'm not sure of the pros/cons with that approach on the platform, so it's worth some research. We probably should not assume that another dependency, eg Homebrew, is installed.\n. That's a great question. We could either prompt the user with a sensible default (~/go) or place it there if and only if the directory doesn't exist. It's easy enough for the user to change after-the-fact, too.\n. @njaremko are you sure the .sh was committed? I only see an empty commit.\n. This is a good start. A few notes:\n- Is there any way we can eliminate setting a password for Postgres altogether? If we eliminate the password I believe you can just call cmd/setup.sh without any args, since everything will use the default settings.\n- The script doesn't need to run go get ...glock. That happens in cmd/setup.sh.\n- I'm still weighing whether we should be installing homebrew on Mac.\n. That's absolutely a reasonable approach for Mac, especially since the Ruby VM is installed by default in OSX. I'll test out the script, and if all's good, we'll get this merged! Thanks again!\n. Yup. This'll be the final piece I handle with the v0.2 release. We're quickly approaching it, though!\nIn the end it'll have to be available via itsabot.org/install.sh, so you might want to move the PR over to the itsabot.org repo. Along with it, it'd be helpful to create a handler that serves the static file at that URL.\n. Cool.  Will review!\n. A couple comments:\n- There's a number of areas where $GOPATH is used throughout the codebase, and whatever fix we apply should address all of those areas.\n- We should handle the $GOPATH just like bash handles $PATH, so if the files aren't in the first directory we check, then it should check the next directory in the list, and so on. This loop should be run each time we access anything in the $GOPATH.\n. > So I'm thinking we implement that quickly to fix the bug, and open a separate issue for enhanced functionality?\nI'm definitely OK with that approach!\n. Actually just discovered that there's an os.PathSeparator constant, so we don't need to define our own constant for that.\nhttps://golang.org/pkg/os/#pkg-constants\n. Ah, we've changed how we handle plugins, but apparently not in the Heroku Buildpack. I'll get a fix out shortly.\n. Issue should be fixed with https://github.com/itsabot/heroku-buildpack-go/commit/2ba44f7cac112059ed35479f2a754c9275944254. If there are any other problems, feel free to open a new issue.\nThanks!\nEvan\n. @njaremko We should be handling all currency as int64. Using float introduces significant but subtle problems (rounding errors). Further, as we look toward internationalization, not all currencies have a concept of fractional units, e.g. Yen. Stripe and others use integers for currencies; it's battle tested, and it makes sense to follow suit.\nThat said, we should be returning the same exported error type, e.g. ErrNotFound, across all Extract functions, so plugin developers can easily check if that's the returned error, similar to sql.ErrNoRows.\n. I'd really prefer to deploy an API that works across all currencies (i.e. currencies like Yen without decimals) and is consistent with popular payment services dealing with money (Stripe). In addition, int64 is much simpler and more familiar to developers than big.Float, straightforward to store in a database, and only 8 bytes. It also handles USD values up to $9e+16, which is sufficient for really any case where Abot will be used, and is guaranteed to be precise without giving any thought to rounding precision.\n. For this PR to merge, could you refactor and force-push into a single commit?  It should also use int64 on the ExtractCurrency API\n. Commit titles should also use the imperative tense, Improve the Extract API, and the commit bodies should generally be written in complete sentences to make what the commit does more clear. There's no need to keep the work history in the commit body, e.g. \"Forgot to fix return types\", \"Have to return pointer to big.Float\", or \"Accidentally included some files\" for the final pull request.\n. FYI, I've added a Contributor License Agreement, which is going to enable me to eventually re-assign Copyright from myself to an organization dedicated to Abot. It uses the Harmony Agreement as a base (same as Canonical/Ubuntu) which is a really nicely done and fair CLA to both parties. Let me know if that works!\n. Cool!  I like this grid idea!  Interested in exploring this further \n. Hey @mikeumus, any updates on this? Any way I can help?\n. Sorry to hear that!  Ok, just checking in. Best of luck!\n. FYI, Mike I'm starting to do a bunch of work on the interface now via #68. I'd hold off on any changes for the moment \n. Some notes: the comments use Golang's documentation, so they're visible on godoc.org and using Golang's doc generation tools. They have to follow a specific format; they must start with the function name.\n. This looks ready to merge as well. Let's just rebase and force-push into a single commit.\n. Merged, thanks!\n. Nope, no issue on your end. For now you can ignore those warnings. I'm working on a fix at the moment.\n. Should be fixed with #64!\n. I'm assuming he means AI algorithms, but since this isn't an issue with Abot, please move discussion to the Mailing List. You can find a link to the mailing list in the README. Closing\n. Yup, we have an IRC room on freenode, #abot-dev. I'm in there now. We can also do email, and I try to be pretty quick in responding (evan / at / itsabot.org)\n. Yup, the correct answer is to store the city in memory using dt.SetMemory. That can be done from within a keyword handler or within the StateMachine's OnInput. You can then use SkipIfComplete to skip past the \"What city do you want the weather for?\" question if there's a city in memory.\n. I'd say build a keyword handler for the case where the user provides all information (in this example triggering on \"Buy\" and \"ketchup.\") If all the necessary information is parsed and saved to memory in that function, you could return a response, e.g. \"Ok, it's on its way.\" But you'll want to check the length of the response from the keyword handler to determine if it's necessary to enter your state machine (no response -> there's still unfinished steps). Once in the state machine, if the SkipIfCompletes are set up correctly (and that bug fixed ;)) it should jump right to the appropriate next question, in this example:\n\"Buy Heinz ketchup tomorrow.\"  -> \"How much should I buy?\"  ->  \"2 gallons\"\n\"Buy two gallons of ketchup\"  ->  \"When should I buy it?\"  ->  \"tomorrow\"\nIf you have ideas about alternative APIs, I'm all ears.\n. @eviltoylet I'm not sure I agree. A state machine by definition must ensure that its states are both \"mutually exclusive\" and \"all inclusive.\" In other words, given a set of inputs, there can only be one logical state to run, and all combinations of inputs must result in entering a state. The state machine in its current design (discounting bugs) fulfills that definition. It's also domain specific, but that doesn't disqualify it as a finite state machine.\nI believe with proper SkipIfComplete's, you can achieve the goals you laid out above.\n. The design goal of the state machine is specifically to avoid having to reference prior messages, as that greatly complicates plugin development. From experience, we should do everything in our power to avoid having to do that! :)\nI believe what you've implemented above can be done entirely within the current state machine design, and the end result should be pretty easy to reason about.\nWhat about this structure?\nStates:\n1. Get movie name. OnInput also parses and saves memories using some shared functions with the states below, e.g. ExtractTime, ExtractTheater\n2. Get theater, skipifcomplete HasMemory \"favorite_theater\"\n3. Get time, skipifcomplete HasMemory \"time\"\nOnReset DeleteMemory \"time\" (we don't want a memory of time to persist to the next \"session\" or conversation with this user)\nIf you want to allow overriding the theater, set a keyword handler to trigger on theater names, e.g. AMC and ensure those are in the data/nouns file. Soon we'll have the training interface, so that step won't be necessary, but in the interim that should enable a user to explicitly say, \"I want to see it at the AMC in Seattle,\" but otherwise it would assume your preferred theater is the same as last time (which I think is a sensible default).\nLet me know!\n. @eviltoylet is this issue solved? From our discussion in IRC, I believe you can use a combination of a KeywordHandler (to parse everything and save it into memory) with a State Machine (like the one described above) to handle this case.\n. @eviltoylet Just to follow up, I've been thinking a lot about this and the plugin API. I think you're right, and we can dramatically simplify the API. Basically Reset() and keyword handling -> state machine could be automated, and we don't lose any flexibility if we do that. You also shouldn't have to build a state machine--that can be handled for you.\nSo expect some changes in the next few weeks to the plugin API that should make things much easier!\n. @eviltoylet here's a new look at the plugin API I'm thinking about. It's not implemented in Abot itself yet, but it will be soon.  https://github.com/egtann/plugin_weather/blob/master/weather.go\nYou can see that as a plugin developer you won't have to call Run or FollowUp, build a state machine, check if len(resp) == 0, or manage state machine resets. In the vast majority of cases you just set VocabHandlers and States. Everything else is handled for you automatically.\nThis change gives us a very nice perk for v0.3 as well. Since VocabHandlers and States are nice little independent logic blocks and all the logic of plugins outside of that has been extracted to Abot's core, we can pretty easily build a visual plugin editor. Ideally you shouldn't need to code to build plugins (although that will always be an option)--you should be able to drag and drop pre-made/tested blocks, like a \"getCity\" block which would extract a city to be passed onto the next block, and that can also generate real plugin code that could be further edited/tuned.\nAnyway, just wanted to update you on this front!\n. Great catch. Happy to accept a PR\n. All the following are equal to zero, though, so it seems HasMemory's implementation will work (all it does is check if len > 0). Is there some reason you need to delete the row?\ngo\nfmt.Println(len([]byte{})) // 0\nfmt.Println(len(\"\")) // 0\n. Great catch. Will accept a pull request, most likely to extend the API to add a Remove or DeleteMemory function.\n. If we were to do that solution, we should also check for \"null\" (as a string) in case memory was set to nil. It gets a little messy, and people shouldn't be setting memory to \"\" or nil anymore.  I think we should just allow the breaking change and encourage people to delete memories (as this PR does).\nE\nOn Tue, Apr 12, 2016 at 7:09 AM -0700, \"Nathan Jaremko\" notifications@github.com<mailto:notifications@github.com> wrote:\nTo fix this issue, should probably also include a check for an empty string in HasMemory()\n\nYou are receiving this because you commented.\nReply to this email directly or view it on GitHubhttps://github.com/itsabot/abot/issues/58#issuecomment-208924419\n. That's much more complex than just using DeleteMemory, which is what they should be doing\n. > One issue this brings up is that everything under public/* is under .gitignore, so the main.js file isn't quite up-to-date unless you run the asset compilation step yourself.\nThat's a great point. In development, should we recompile the assets on each page load? Page loads shouldn't be that frequent, since it's a single-page app.\nI'd prefer to keep asset build code in separate .sh files, rather than writing it as Go. But it's fine to call e.g. compile_assets.sh from Go itself.\n. re: this PR. Looks great! Before merging, could we rebase this into 1 commit? (You can --force push to your fork/branch and that'll modify this PR directly.)   Your first commit message is perfect: Switch cookie library, update to match new API.\nre: compile assets. Looking at the code, right now we do run a CompileAssets function in the Index handler (outside of production), so we should be set. For reference, CompileAssets is defined in core/boot.go, and it's called in both core/boot.go (on server boot, even in production) and core/handlers.go (on page reload outside of production)\n. CompileAssets isn't a recent change, so it's entirely possible it isn't working! :)\nMerging now. Thank you!\n. @eviltoylet would love to merge this. Can you review the Contributor License Agreement, and sign it when you have an opportunity? It's based on the same CLA that Ubuntu/Canonical uses (called Harmony). Thanks!\n. https://www.clahub.com/agreements/itsabot/abot\n. Cool, no worries about the missing test. For what it's worth, we're using a real abot_test Postgres database, instead of a mock. It's easy to do and, because of that, makes it worthwhile to more closely mimic the production environment in our tests.\n. You don't have plugin_hello in your plugins.json. I suspect that you need to re-run abot p install\n. @chajas I'm afraid I'm not able to reproduce the problem with the information given. Briefly looking through the installPlugins function (which runs on abot p install), I can't see anything that would attempt to open a plugin.json file causing an error like this.\nI would try a clean install, removing any itsabot/* directories from your $GOPATH and re-running the install instructions in the README.\n. Closing this issue, since I can't reproduce it.\n. To clarify, this would just be for the Memory storage in Postgres, correct?\n. I'm OK with that change! As we've seen already JSON has some odd quirks!\n. @njaremko I've spent some time looking into Protocol Buffers with Go. I don't know that this is the right approach. It seems to me asking people to install another dependency (which involves installing a compiler via C++) and learn the schemas is more than a small ask and quite a bit more difficult than the current JSON system. Am I correct that people writing plugins would need to learn this in order to use the Memory API?\n. Ok! Closing\n. As another point of view, this allows for more natural conversations.\nSometimes you just stop mid-conversation, then a day later you can just start talking about something else, like the weather. You don't have to tell your friend \"end conversation. What's the weather like?\" for him to understand. :)\nSimilarly I should be able to get half-way through purchasing tickets to see a movie, then say, \"set my alarm to 5pm.\" and have Abot understand exactly what I meant.\nIn practice I haven't found this approach to be problematic, and the benefit is pretty neat! What use case are you experiencing where a user's response might match another plugin's triggers? Remember it has to match both a Command and Object.\n. In a contrived example, sure. But in practice, among realistic plugins, I'm not yet convinced that it's worth giving up this feature.\nIn my opinion this feature allows Abot to use and understand language more naturally than most bots today, such as, Amazon's Alexa which uses the approach you're describing. To me, Abot's behavior is much more in line with my expectations as a user because it more closely mimics speaking to a human assistant, helper, or friend.\nIf this becomes a problem among a larger number of developers or in building plugins that would be a shame to miss, we can revisit it. I will be adding documentation explaining the feature, though, in the meantime.\n. It's definitely possible to switch back and forth between plugins and not lose your place. It's all determined by when you decide to call sm.Reset and the data you choose to wipe in defining the Reset function.\nIf you want to maintain a session across conversations with multiple plugins, you'd just Reset state when sm.State() >= len(sm.Handlers) rather than on Run()\n. Perhaps if Reset were called automatically by Abot's core on a plugin's first Run(), then automatically again when you've completed all states? You'd lose some flexibility but it would be easier.\n. If we do automatically call Reset, perhaps we should change the plugin API to have a single function call? That is we'd replace Run/FollowUp with just Run(). Right now that split is necessary to allow you to manually call Reset on Run, but if we handle that automatically, then we can simplify the API.\n. Yes, we should switch this to TEXT\n. Yup! We'd need a new pair of up/down migrations to modify that column.\nTo get the timestamp like the other migrations have, try running this in your terminal: $ date +%s\n. Yes, that's an error in trying to connect to your DB. Did you run cmd/setup.sh? Did it skip DB setup or run through everything there? Do you have Postgres running?\nThere's no tool to make migrations. Just create the files and write the SQL--should be one line. You can see examples in existing migrations.\n. Yup, that means it all passed! When you create a pull request TravisCI will automatically run all the tests as well.\n. > Training seems to suggest that when an algorithm is presented with new data, it is somehow able to infer meaning or suggest a solution\n@martyhimself That's exactly what this does. You teach it the types of sentences that relate to intents, then it can infer (on sentences it hasn't yet seen) what the intent should be. The intent is an alternative trigger to Command/Object.  That is, I could have Abot route the user's command to my alarm plugin when it determines intent set_alarm, then trigger the specific setAlarm function on that same intent.\n. Very interesting linked article on double intent. This design actually lays the groundwork to support that (and with simple naive bayes too!).  A sentence can have one intent from one plugin and a separate intent from another plugin. We don't currently have a way to route to two plugins at once and manage the conversation across both of them simultaneously, but I can imagine adding support for that in v.3 (ETA August 1st, 2016) at the same time that we start supporting multiple independent commands per incoming user request (e.g. set my alarm to 5pm and remind me to pick up groceries then).\n. \nFirst pics of my work on the new admin panel/training interface. Starting to come together!\nI'm having to take a different approach in storing training data than described above. It'll now all be available via a central service, defaulting to itsabot.org for simplicity in getting started (it should \"just work,\" but you could self-host too). This change will allow you to deploy on Heroku and any sort of clustered deployment where you need to share the same info--synced--across multiple instances.\nAlso instead of saving new training data into the plugin via Git and a locally-deployed Abot like what was described in the original post, this method enables Abot to be trained very easily by any admin with the \"trainer\" scope (which will be set in the Manage Team page I've yet to build). This will enable you (if you choose) to have a team of people replying to user requests and training plugins for better efficiency.\n. Changes are now merged! There's a new admin interface, which includes working training functionality around intent.\n. Brilliant! I'll give it a test.\n. It's actually never been used, so I'd guess no. :)  Diving in now.\n. @DaleWebb I think it is working, but you have to switch the FlexIDType to 1. The mailgun route handler you made can set that automatically before processing the incoming message.\n. Great catch. Just merged a fix for that. #71 Abot will now create FlexIDs for email and phones when you register.\n. Looks ready for merge. Could you rebase it into a single commit with the following message (in the imperative tense)? Add email interface to send and receive emails\nThe description below that commit title can go into more detail if you'd like. Then we'll merge it in!\n. Perfect, merged. Many thanks!\n. Fixed\n. This has been solved for a while now by introducing the ABOT_PATH environment variable.\n. You'll need to run cmd/migrateup.sh. Ignore any errors, then retry communicating with Abot via the console.\n. Yes, try running cmd/setup.sh\n. @samuel-pt has this been fixed?\n. @samuel-pt I'm going to close this issue for now. If you run into additional problems with the new install, just open a new issue.\n. Yes, it should be possible. I'll look into this.\n. We run go get ./... beneath the covers when you do abot p install. It's unable to go get your repo because you try to import \"github.com/itsabot/shared/plugin\" from your own plugin, but that doesn't exist. It should be \"github.com/itsabot/abot/shared/plugin\"\nI'll work on making this cryptic error message clearer, though, so we can make it easier to debug this kind of issue. Also I highly recommend using a Go plugin for whatever editor you use (I use Vim, so I recommend vim-go), which can usually handle the import statements and formatting for you automatically on save.\nEdit: Fixed with #76 \n. Looks good to me! Thank you! Merging now.\n. Hey, thanks for handling this!   I think we can make the same change more efficiently, though, if we aim to just modify existing variables.\nWhat if we modified this line 191 as follows? (Haven't tested this. Might not work)\ngo\nwords := strings.Fields(strings.Title(tmp))\nThat way we only have to call the strings.Title function once, and we'd eliminate runtime reflection, the additional loop and memory allocation too!\n. Good point! But I'm pretty sure even a human would have trouble parsing, \"how's the weather in la?\"  What's \"lah?\"\nSpeaking of capitals, can we capitalize the first letter of the commit? :)\n. Looks great. Thanks! Merging\n. Right. Confirming that the maintainer's email matches in plugin.json is a way to connect the account that's independent of any provider. If it can fetched via go get, then you can confirm your ownership over it.\nGoing a more traditional route to verify account ownership via OAuth would be provider-specific, and self-hosting code would effectively not even be an option (you'd need to build and run/maintain your own OAuth provider service).\nDepending on the Maintainer in plugin.json skirts around all those problems. Simple to reason about, easy to build, and very secure.\n. All changes are in place except for the Maintainer requirement on publish. I'll get that in soon.\n. I don't see GPG adding much security. You already have to log in to itsabot.org, and verify ownership over both your email and the plugin. Plugins can't be modified except by:\n1. Hacking your GPG keys (to upload to Github).\n2. Forking the plugin and publishing a new one under a different name.\n. @DaleWebb for v0.3, but ASAP 👍🏻\n. Use webhooks. An HTTPS requirement is fine\nE\nOn Sun, Jun 5, 2016 at 10:49 AM -0700, \"Ankit Bansal\" notifications@github.com wrote:\nOr i can run the long polling update loop on a separate go routine. What do you guys suggest?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub, or mute the thread.\n. Great point. We'll actually need both! It does no good to understand speech but not be able to respond in kind.\n. Ignore the removal of the help wanted label. Help is still wanted :)\n. Desktop and mobile in the case of an app. Think Siri more than Facebook M\n. It's probably due to outdated dependencies. You need Go 1.6+ and Postgres 9.5+. If that doesn't fix it, let me know!\n. You need to add $GOPATH/bin to your PATH.\n. Done with #103 \n. Try deleting plugins.go and re-running abot server. This should be fixed in an upcoming patch.\n. Should be fixed by #105. Give it a shot and let me know!\n. Hey @awwalker, thanks for your help! The PR looks mostly good, but I left a few comments on it where I think we can improve.\nOne of the things that I'm trying to do with this project is maintain a really clean and consistent git log. Along those lines, could we change your commit message to follow the same formatting as the examples here? https://github.com/itsabot/abot/commits/master\nThanks!\n. Hey @awwalker. Is this all set for review?\n. This is a great start. Thank you so much for the contribution! Merging...\n. @njaremko, @hhsnopek, @DaleWebb I wanted to give you guys a heads-up about this incoming change, since it breaks the plugin API (for the better!). You can see an updated way to build plugins with this example: https://github.com/egtann/plugin_weather/blob/master/weather.go.\nNotice that you just define keywords and states now. There's no more Run/FollowUp. In fact, you don't have to worry about program execution at all--it's all handled automatically. The API isn't finalized (I'm going to simplify it a bit more), but it's close. And with a ton of bugfixes, the state machine works perfectly now with every message I throw at it.\nI'm working on the docs for this big update now. Along with everything else, there's a new admin panel, a working training interface, and a new logo.\n. What's the output of the following 3 commands?\n1. ps aux | grep -i postgres\n2. which psql\n3. psql --version\nAlso, what operating system?\nIt's almost certainly a Postgres version issue. You might think you're running Postgres 9.5, but I bet there's an older version running.\n. > postgres 802 0.0 0.1 295220 1780 ? S 17:49 0:00 /usr/lib/postgresql/9.4/bin/postgres -D\nPostgres 9.4. Remove all your versions of Postgres from your system then install Postgres 9.5. Some instructions from our .travis.yml might be helpful in doing that:\nsudo apt-get remove --purge postgresql*\nsudo apt-get autoremove\n. Hey @samuel-pt, this was my fault. As a quick fix for the compiling problem, rm -rf the github.com/itsabot/plugin_weather directory and re-run abot p install. There's still a few other problems preventing the plugin from working as intended, though, but I'll try to get those fixes out today.\n. Should be fixed with #110. After you pull the update, you'll need to run a new migration, too. Something like this:\npsql -U postgres -d abot -a -f db/migrations/up/1463070851_drop_states_userid_not_null.sql\nEverything should work now, but let me know!\n. Definitely a bug on my end. Just pushed a large update yesterday, and that must've broken this. I'll look into that this AM and get a fix out! Sorry about that.\n. Also should be fixed with #110.  Be sure to pull the latest changes from Abot, then also fetch the latest changes from plugin_hello.\n. I believe you'll need to change peer to \"md5\" in your pg_hba.conf then restart Postgres to use a password option.\n. Try passing 127.0.0.1 instead of localhost\n. Since plugins call New() on init, I'm pretty sure there's still a race condition. A better approach might be to call LoadEnvVars from the plugin within New(). You'd want to keep track of when LoadEnvVars has been run, so it doesn't need to run again with, e.g., an EnvLoaded bool set in core.\n. Just one more correction. LoadEnvVars opens a file and reads its contents. We don't need to run that for every plugin -- we just want it to run once. At the top of LoadEnvVars you should check if the env vars have already been loaded with an envLoaded bool in shared, and return if they have been. LoadEnvVars should set envLoaded = true\n. Hey @ankitbansal82, this looks good. Could you squash the commits into a single, well-formatted commit message consistent with the style of our existing commits? Then I'll be able to merge.\n. Much better! Let's just switch it to use an imperative tense verb. Fix psql connection error on plugin init\n. It's just an imperative tense verb followed by a brief description.\n. That's a great idea. I'll create a commit template and add it to the wiki.\nAlso merged! Thanks!\n. FYI, added the commit template to the How to Contribute page here: https://github.com/itsabot/abot/wiki/How-to-Contribute\n. Can you include your plugins.json? I'll try to reproduce the problem\n. Found the problem. Plugins.go had to be included in source control for Heroku, but it was in .gitignore. I've removed that file from .gitignore.\nTo fix this problem:\n1. Pull the latest changes from Abot\n2. Add and commit your plugins.go to git (if you don't have one, then run abot p install)\n3. Re-push to Heroku and all should work!\nClosing the issue now as it should be resolved. If you still have issues, let me know!\n. Heroku is an odd beast. I've changed the build script to fix that. Try\nre-deploying to Heroku now.\nE\nOn Thu, May 19, 2016 at 10:06 PM, samuel-pt notifications@github.com\nwrote:\n\nThanks for looking into this issue.\nNow heroku is expecting the plugin packages to be present. Here is the\nerror\nremote: -----> Running: go install -tags heroku github.com/itsabot/abot\nremote: plugins.go:5:2: cannot find package \"\ngithub.com/itsabot/plugin_hello\" in any of:\nremote: /app/tmp/cache/go1.6/go/src/github.com/itsabot/plugin_hello (from\n$GOROOT)\nremote: /app/go/src/github.com/itsabot/plugin_hello (from $GOPATH)\nremote: plugins.go:6:2: cannot find package \"\ngithub.com/itsabot/plugin_weather\" in any of:\nremote: /app/tmp/cache/go1.6/go/src/github.com/itsabot/plugin_weather\n(from $GOROOT)\nremote: /app/go/src/github.com/itsabot/plugin_weather (from $GOPATH)\nremote:\nremote: ! Push rejected, failed to compile Go app\nremote:\nremote: Verifying deploy...\nremote:\nremote: ! Push rejected to abot-springml.\nremote:\nTo https://git.heroku.com/abot-springml.git\n! [remote rejected] master -> master (pre-receive hook declined)\n—\nYou are receiving this because you modified the open/close state.\nReply to this email directly or view it on GitHub\nhttps://github.com/itsabot/abot/issues/116#issuecomment-220518170\n. Email and web interface integration coming soon, as well as notifications via email, SMS, and in the admin panel.\n. @lmaw looks cool. I like the footer in the bottom left.\n\n@mwthayer \n- The dashboard is responsive, so sometimes it's in the left spot. Sometimes it isn't. These things move :)\n- Data dump like exporting your current data to CSV? I could definitely add that.\n- Will change, thanks!\n. #119 Merged with this. Closing\n. Among all the big changes, there's an extremely tiny breaking API change in this build. I believe @DaleWebb's plugin is affected but no one else's.\nProcessText() now has 2 return values, rather than 3. The third was from a very old build and wasn't useful in any way. Basically this means that you can delete the middle return value, so:\ngo\nret, _, err := ProcessText()\nbecomes\ngo\nret, err := ProcessText()\n. That'll actually be removed soon. There's need for it, since I'm setting it as an env variable\n. It's an issue with the documentation. We've switched to using the ABOT_PATH env variable, but I hadn't tried deploying to Heroku since the change.\nHeroku has a weird GOPATH configuration that's different than any user system, so when we set it to the default $GOPATH/src/github.com/itsabot/abot, Heroku can't find the directory.\nTry setting the ABOT_PATH env variable on Heroku to /app. That should be the correct directory, but let me know!\n. You should build a plugin that registers to listen to incoming messages and translates them into English via some API. Save the original language choice with Memory if there's multiple possible languages you're answering. Then in that same plugin, register to listen to outgoing messages and translate them back into the original language. Perhaps this answer can help: https://groups.google.com/forum/#!searchin/abot-discussion/google/abot-discussion/tE35Te-rEa0/TXXwBFkJCAAJ\nYou can find info about this in the Building a Plugin guide in the wiki (on Github).\n. Looks like a cool project. From what I can tell, AIVA's creator took the more classic approach (using Python NLP tools), whereas I've added additional layers of abstraction.\nWith our different approaches, architectures, and even programming languages, I'm not sure how to begin collaborating between the projects. Do you have some ideas on how we might combine our efforts?\n. It's a cool project, but their patents requirement (https://github.com/wit-ai/duckling/blob/master/PATENTS) is incompatible with Abot. It also seemed needlessly complex and introduced another language dependency. That's why I independently built time parsing functionality into Abot using Go. See /shared/helpers/timeparse.go\nThere's still some minor bugs, but it works well for most cases at this point. See the test file for examples.\n. Good catch! Will fix.\nFor now, add this to your ~/.bashrc or ~/.bash_profile: export ITSABOT_URL=\"https://www.itsabot.org\" and run source ~/.bashrc to fix it.\n. In any event, #152 should fix this. Pull the latest changes, re-run and let me know!\n. That's a timeout, most likely caused by a slow or unavailable internet connection. Does this keep happening for you?  What's your network speed?\n. Closing while waiting for a reply. Feel free to reply here, and we can reopen.\n. You can increase it from 10 seconds to more. grep for \"Timeout\" in the code and increase them from 10*time.Second to time.Minute.\n. Added via #162. If you experience any bugs (this is an enormous change, so there will probably be bugs), please file new issues!\n. Simply replace with https://raw.githubusercontent.com/itsabot/abot/master/plugins.json. Happy to accept a PR for this as well.\n. Try postgres@localhost:5433. It's probably the extra : in postgres: that's throwing it off. The : is only needed if including a password.\n. Sounds like $GOPATH/bin isn't in your $PATH\n. grep for \"failed to retrieve version number\" to find the trouble line.\nClosing (duplicate of #171)\n. Well, it's not an important bit of code. I'd recommend commenting it out for now.\n. This should be written in a complete sentence following the style of the other comments.\n. First word of the comment should be Restaurants\n. For consistency, we should be checking if err != nil. Since that returns, there's no need for an else block.\n. The check should always be err != nil.\nWhen there's two variables returned, we don't do inline if _, _ = ; err != nil in one line.  We move the if statement to the next line.\n. No need for this change. len is stored internally by Go in its representation of a string, so it doesn't actually need to calculate length. For consistency we'll use len(s) == 0\n. No need for an else block when the if block returns. But it should be err != nil. Also, since ParseInt returns two variables, we move the if statement to the next line.\n. See below. We'll maintain len(s) == 0\n. We should remove this extra line. With this and the other line note change, it's ready to merge! Looking good!\n. I really like this conditional compilation approach. const_windows is perfect, since that's unique to just the one platform. This file, though, should work across Linux, OSX, BSD and probably others as the default. We should then rename it to const.go and use a build tag at the top: // +build !windows, which will instruct it not to build this file only on Windows.\nWe should also include package level documentation at the top of the file briefly describing what constants does in the same format as the other packages within Abot. This'll be visible on godoc.org. PATH_SEPARATOR following Go conventions should be named PathSeparator and should also include a comment.\n. Can return the error here. Again just check that len(path) == 0\n. After we've confirmed that GOPATH is set in LoadEnvVars, we shouldn't need subsequent if checks in other functions.\n. Needs a comment since it's exported. Error text should be lowercase, since it's an internal error (i.e. never presented to an end-user).\n. Spacing here was deliberate\n. Small typo :)   Cookiess\n. Should we be setting them to null here or expiring them like above?\n. ?\n. len(path) == 0\n. Wrong commit?\n. no length check\n. len(s)\nDon't need to check for length more than once. The only length check should be in LoadEnvVars.  Every other time should assume that it's there.\n. Getenv outside the loop. No length check\n. :) spacing is still off.\n. Fatal should only be called from abot.go\n. This is the only place where we need a length check.\n. To be consistent with the other Memory functions, we should be checking the value here and logging errors. See https://github.com/eviltoylet/abot/blob/master/shared/datatypes/state_machine.go#L260\nAlso a simple _test.go to ensure at least this function continues to work would be very welcome! :)  We should try to be adding tests as we go.\n. According to the Go spec here about go statements:\nIf the function has any return values, they are discarded when the function completes.\nSo we won't actually get to use your return value.\nTo get around this, we can use channels like this example: http://www.atatus.com/blog/goroutines-error-handling. We can send the errors as messages, which can then each be handled as they come into the channel.\n. We'd want to delete the plugins.go file that we created in installPlugins in this err block. We should also check the value returned from os.Remove(\"plugins.go\") to ensure we ignore err == os.ErrNotExist, as that's fine (it simply means we errored out before the file was created).\n. ",
    "benmathes": "happy to help\n. ",
    "paulscliu": "Cool. Thanks for the suggestion. I will go take a look at plugin\n. ",
    "jpjp": "go 1.5. ah. oops.\n. The next problem was that $GOPATH was not in my $PATH\n. ",
    "maddymaster": "this works.. thank you\n. ",
    "damtsnkff": "@maddymaster I deleted my comment because I thought this was the reason of another issue I'm facing (same as #40 )\n. I was right, I added a / at the end.\nSo basically to add the $GOPATH in the $PATH my .bash_profile looks like :\nexport GOPATH=/Users/damientsenkoff/abotest (I previously added a / after abotest)\nexport PATH=$GOPATH/bin:$PATH\n. I'm facing the exact same issue. \nAlso, here is my outputs : \nFor echo $GOPATH it returns :  /Users/#NAME#/abotest/\nand for pwd | sed \"s|$GOPATH/src/||\" : /Users/#NAME#/abotest/src/github.com/itsabot/abot \n. @exetwezz  Found out!\nI ran echo $PATH, and it returned me something like :/Users/damientsenkoff/abotest//bin:\nI just removed / at the end of export GOPATH=/Users/damientsenkoff/abotest inside my .bash_profile.\n. ",
    "waynegerard": "As an aside, because it's moot if this gets patched to decode JSON instead: I think r.FormValue() will also read from query params, which is probably not ideal. Should probably be r.PostFormValue() instead.\n. It definitely does - there's a unique constraint on the EMAIL column in the users table.\nBut, it doesn't notify you that registration failed (so it just takes you to the sign-in screen). Probably didn't make two different users with the same email though.\nIt looks like it does, however, give you a valid auth token so you're logged in without actually being a valid user.\n. Might I suggest just using an alternative instead? https://github.com/ScottHamper/Cookies \nNot that I think anyone in their right mind at Mozilla(?) would care, but might be safer to just swap libraries and avoid a whole nasty discussion about whether something is considered \"derivative work.\"\n. One issue this brings up is that everything under public/* is under .gitignore, so the main.js file isn't quite up-to-date unless you run the asset compilation step yourself.\n(as well as a small issue with the asset compilation script itself, which is the purview of another PR I suppose).\n. Recompiling assets on each page load seems ideal in dev, since you'd want to see JS changes immediately.\nI feel like it's maybe outside the purview of this PR, but I can certainly draft something together for that.\n. Rebased! \nAnd that's good to hear about CompileAssets. Is that a recent change? It didn't seem to be quite working when I looked at this a week or so back.\nCould be just a weird one-off thing.\n. Heh whoops! Fixed.\n. That's fair. I would also learn towards expiring them, since that seems the safest.\n. ",
    "ralphking": "Having the same issue and came here for a look - I think you're right. r.ParseForm can't parse JSON. \n. I will test it with JSON decode instead when I get a chance and see if that sticks\nLog output: \nfailed strconv.ParseInt: parsing \"undefined\": invalid syntax\n. ",
    "dombarnes": "I think I'm having a similar issue. If you log in with invalid credentials, you get redirected /profile with blank details even though its failed. Chrome outputs:\nObject {Msg: \"Invalid username/password combination\"}\nmain.js:2112 GET http://localhost:4200/api/user/profile.json 500 (Internal Server Error)\nmain.js:2782 Object {Msg: \"strconv.ParseInt: parsing 'undefined': invalid syntax\"}\nmain.js:2112 PUT http://localhost:4200/api/user/profile.json 500 (Internal Server Error)\nmain.js:2793 hit\n. ",
    "Jamalish": "Hey,\nSorry about this, made the issue on the wrong repo.\n. ",
    "kaminskypavel": "@inaiat  were you able to work this around, if so please share the Dockerfile? we can try installing pgsql into the image before running setup.sh\n. ",
    "inaiat": "Ok. I will create a pull request!\nThanks in advanced\nOn Fri, Apr 1, 2016 at 4:00 PM, kaminskypavel notifications@github.com\nwrote:\n\n@inaiat https://github.com/inaiat were you able to work this around, if\nso please share the Dockerfile? we can try installing pgsql into the image\nbefore running setup.sh\n—\nYou are receiving this because you were mentioned.\nReply to this email directly or view it on GitHub\nhttps://github.com/itsabot/abot/issues/16#issuecomment-204524070\n. \n",
    "DenisSergeevitch": "@inaiat hi, could you share a docker image for abot please?\n. ",
    "ghost": "Hi, thanks for the reply.\nI didn't have my GOBIN set. I did set it in my .bashrc. but before I did I installed glock manually using go get github.com/robfig/glock and now it works.\nI don't know if the glock installation step was necessary or not. so I don't know if this is just a matter of $GOBIN or a missing dependency.\nIf there is anything I can do to help figure this out, please let me know. (I'm a noob in go so I wouldn't know on my own).\n. Thank you! :)\n. I tried a new user with a different number and now it did work.\nI believe the reason might be because I registered two users using different numbers but same email? It didn't provide any feedback telling me that it's wrong when I was registering though.\n. Thanks for the fix.\n. ",
    "brokenseal": "Hi, thanks for your help and I'm sorry for the mistake.\nCheers.\n. ",
    "DaleWebb": "Thanks!\nI already had a look at the roadmap and the contribution guide, but I wanted to know if there was a priority on any of those (on the roadmap) and how to initialise work on one of those.\nSounds like plugins would be the best place to start, so I'll take a look at that.\nI've just been accepted onto the mailing list :+1: \n. Is the email flex ID supported?  I had some trouble with that\n. Yeah I switched it to 1 earlier but I expected that the user account I signed up with would have a flex id created for the email address, but it wasn't there.  So I set it to 2 for now and put in a random number so that core.ProcessText() would work.\n. Squashed commits\n. Which release would this feature be aimed for?\n. Any particular reason for Telegram over other platforms?\n. I agree with the webhooks.\nIt would be good to get the interface going, so that anyone can do the other platforms too!  I would imagine that they all communicate in a similar fashion with third-party tools.\n. I'm planning to pick up this task.  For the first plugin, I thought smooch.io would be good, as it can already communicate with other messaging services.\nWhat do you think? :)\n. IBM Watson also has an API for speech-to-text and text-to-speech http://www.ibm.com/smarterplanet/us/en/ibmwatson/developercloud/speech-to-text.html \n. Yep, adding the ABOT_PATH fixed it!\n. ",
    "urupvog": "yes, I have a postgres user. \\du on psql gives me this output:\n                            List of roles\n Role name |                   Attributes                   | Member of \n-----------+------------------------------------------------+-----------\n postgres  | Superuser, Create role, Create DB, Replication | {}\n. Until the last step. here is the output. It asked postgres user a lot many times\ncmd/setup.sh\nusage: mktemp [-d] [-q] [-t prefix] [-u] template ...\n       mktemp [-d] [-q] [-u] -t prefix \n    [ok] checking for go binary\n    [ok] checking GOPATH\n    [ok] installing dependency manager\n    [ok] syncing dependencies\n    [ok] installing glock hook\n    [ok] installing abot\n    [ok] checking for postgres\n    [ok] checking for psql binary\n     [?] checking for postgres userPassword for user postgres: \n    [ok] checking for postgres user\n     [?] checking for abot databasePassword for user postgres: \n    [--] checking for abot database\n         abot database missing. creating it\n     [?] creating abot databasePassword: \n    [ok] creating abot database\n     [?] checking for abot_test databasePassword for user postgres: \n    [--] checking for abot_test database\n         abot_test database missing. creating it\n     [?] creating abot_test databasePassword: \n    [ok] creating abot_test database\n     [?] running abot migrationsPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \n    [ok] running abot migrations\n     [?] running abot_test migrationsPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \nPassword for user postgres: \n    [ok] running abot_test migrations\nPassword for user postgres: \n     [?] checking if abot database is seededPassword for user postgres: \n    [ok] checking if abot database is seeded\nPassword for user postgres: \n     [?] checking if abot_test database is seededPassword for user postgres: \n    [ok] checking if abot_test database is seeded\n    [ok] generating environment file\n   [err] installing abot plugins\nfailed cmd:\n         abot plugin install\n. Mine was - local all all md5. \nI changed that to - local all all trust.\nand restarted the server.\nStill the error.\nHere is the updated snapshot of my conf file \nlocal    all     all     trust\nhost    all             all             127.0.0.1/32            md5\nhost    all             all             ::1/128                 md5\n. I commented other lines as well(Except local all all trust) and atleast it doesnt now ask me password 20 times. But the original problem still persists. I get an error failed cmd: abot plugin install during the setup. Putting the output below:\ncmd/setup.sh\nusage: mktemp [-d] [-q] [-t prefix] [-u] template ...\n       mktemp [-d] [-q] [-u] -t prefix \n    [ok] checking for go binary\n    [ok] checking GOPATH\n    [ok] installing dependency manager\n    [ok] syncing dependencies\n    [ok] installing glock hook\n    [ok] installing abot\n    [ok] checking for postgres\n    [ok] checking for psql binary\n    [ok] checking for postgres user\n    [ok] checking for abot database\n    [ok] checking for abot_test database\n  [warn] running abot migrations\ndatabase migrations failed\nif the database has already been migrated, you can ignore this message\n[warn] running abot_test migrations\ndatabase migrations failed\nif the database has already been migrated, you can ignore this message\n[ok] checking if abot database is seeded\n[ok] checking if abot_test database is seeded\n[ok] generating environment file\n[err] installing abot plugins\nfailed cmd:\n         abot plugin install\n. It gives me this error:\n2016/04/02 00:18:50 buildingpq: no pg_hba.conf entry for host \"::1\", user \"postgres\", database \"abot\", SSL off\nUPDATE:\nI updated the pg_hba.conf file and removed comments I added few mins back. I modified md5 to trust in all of these statements. It now gives me a new error:\n```\nabot plugin install\nFetching 1 plugins...\ngithub.com/itsabot/abot/cmd\nruntime.main: call to external function main.main\nruntime.main: main.main: not defined\nruntime.main: undefined: main.main\nexit status 2\n```\n. Thanks. A clean clone resolved the issue.\n. ",
    "Jambo-Dunia": "This is mine:\nDatabase administrative login by Unix domain socket\nlocal   all             postgres                                md5 (changing this to trust still gives the same bug)\nTYPE  DATABASE        USER            ADDRESS                 METHOD\n\"local\" is for Unix domain socket connections only\nlocal   all             all                                     trust\nIPv4 local connections:\nhost    all             all             127.0.0.1/32            md5\nIPv6 local connections:\nhost    all             all             ::1/128                 md5\n. Changing to trust fixed my past error, Now im having troubles fetching plugins as well.\nFetching 1 plugins...\nWARN: 500 - 500 Internal Server Error\nInstalling plugins...\n/bin/sh: 1: glock: not found\nexit status 127\n. @NassarX you have to go through the source and replace \"/bin/sh\" with \"sh\" if you are on windows I believe.\n. ",
    "hernanc": "You can install Glock from: https://github.com/robfig/glock\n. ",
    "NassarX": "For windows users , Local refers to Unix sockets. Windows does not have them\nSo it maybe get you in trouble  , I used  host    all             all             127.0.0.1/32            trust and works\n. @aburgd  yes postgresql service is running , on windows 10\n. @egtann now it's holding here [?] checking for postgres user\n. ok it's work now but that's the next error\nFetching 1 plugins...\nexec: \"/bin/sh\": file does not exist\n. ",
    "michaelvcolianna": "This is happening for me but I don't yet know enough Golang to work it out. For the project authors, the AJAX call to authenticate isn't working. I don't know if it's the HAPIProfile or HAPIProfileView portion or something entirely different. Here's the AJAX error:\nmain.js:2112 GET http://localhost:4200/api/user/profile.json 500 (Internal Server Error)\nIn the DB, my account has a locationid of 0, and a null authorizationid.\nI'm still learning Go so I may figure this out.\n. @egtann I made sure to use Chrome (49.0.2623.110 on 10.11.4) since it doesn't have anything installed to block cookies. However, I noticed my settings for content were a little more clamped down than default so I'm going to create another user on my machine so I can try with Chrome's default settings. I'll also check if it happens in other browsers with that user.\nServer environment information is probably helpful, though.\n- Centos 7.2.1511\n- Golang 1.6 linux/amd64\n- Postgres 9.5.2\n@Dyldog What about your server/client environments?\n. @egtann No luck with the new user. After clearing all associated cookies, restarting the abot server, etc. I made sure I had none lingering then signed up. After signup I had 6:\n- authToken (with a value)\n- csrfToken (with a value)\n- email (my urlencoded address)\n- id (the corresponding user id from the db)\n- issuedAt (the unix timestamp)\n- scopes (empty value)\nAfter pulling the latest changes it's still a 500 error, by the way.\n. @egtann It looks like it tries to set/get a cookie after signup, which the server reports the named cookie error on, along with any attempt to log in. And yeah, .../user/profile.json\nI was going to fiddle with the JS so it prevents the form from submitting and see what it's erroring on after signup. I'll see what I can come up with.\n. @egtann JS can't read the secure cookies. On a regular flow Chrome reports secure as yes (but, httponly as no - I thought they were the same) and in the console, document.cookie is empty. If I set one manually, JS can read that cookie. Chrome reports the cookie as not secure.\nIn assets/vendor/js/cookie.js, right after setItem is defined and before anything else, I added:\nbSecure = false;\nAnd now everything works.\n@Dyldog This is not a \"fix\" but give it a shot and see if that lets you log in.\n. Yeah - even telling my hosts file that \"localhost\" is the IP of the VM doesn't work. Oddly, the cookies accurately reflect what the server is loaded on: Whether it's localhost or the IP. So strange!\nAnyway, I look forward to the changes as they'll help in my quest to learn Go.\n. ",
    "Dyldog": "Tried Safari with no extensions, Chrome, and Firefox... No dice :(\nHere's my env:\ngo version go1.6 darwin/amd64\npostgres (PostgreSQL) 9.5.1\nAbot version 0.2.0-alpha\n. Fixed, cheers!\n. ",
    "RYOHOI": "I removed these 2 lines, and still getting error, any ideas?\n\n\n. Alright, I uncomment those two lines and get glock. It says command not found. I think I have difficulty installing glock.\n\n. Still waiting for solution……\n. Should I reinstall or what?\n. ",
    "chajas": "For me \n$ glock install github.com/itsabot/abot --verbose\ngets stuck endlessly as well.\nHowever, when I remove the glock installation from the cmd/setup.sh it proceeds further but gets stuck at the below error.\nI have postgres installed and running on my system. The postgres user is also present. I have also adjusted the server configuration to trust.\nNot sure why this occurs. Any idea why ps ax -o would not be known?\n``\n$ cmd/setup.sh\n    [ok] checking for go binary\n    [ok] checking GOPATH\n    [ok] installing dependency manager\n    [ok] syncing dependencies\n    [ok] installing abot\n     [?] checking for postgresps: unknown option -- o\nTryps --help' for more information.\n   [err] checking for postgres\nfailed cmd:\n         ps ax -o comm | grep -q '^postgres'\nplease start postgres to continue\n``\n. yes trying to install abot on windows\n. Hi,\nI don't have the plugin_hello folder in my path only the plugin_onboard directory but nor do I have it in my plugin.json. \nAlso running the commandabot p install` gives the same error.\n. ",
    "lipsumar": "@RYOHOI you're not the only one https://github.com/robfig/glock/issues/32\nI have the same issue. I'm on Mac OSX 10.9.5 and just installed Go.\nI believe the Go users know what to do... Anyone ?\n. ",
    "njaremko": "We probably don't have to change the license (Which should be LGPL if anything)...\nOur source is freely available and if anyone takes our code tries to sell it, as long as they host the software on their own servers and sell the software itself then they're fine under the GPL. (That's why AGPL was created :stuck_out_tongue:)\nI'm trying to contact the author to change the license...\n. Can you provide more info? What step are you on? What are you trying to do? Is there an error, or are you just confused while reading the script? \nIf you're getting an error, you should open an issue instead of posting on closed pull requests.\npsql is the command line manager for posturesql databases\n. No worries, writing  a bash script is just more of a pain in the butt. Anyway, how did you want to handle setting up postgres? You would need to require sudo to run apt-get/yum/pacman, and to enable the systemd job.\nBut no one in their right mind would pipe into sh with root privileges hahaha \n. Ahh, okay then. So what distros did you want to focus on? ubuntu, arch, fedora?\n. Are we assuming they have homebrew installed on OSX?\n. Okay I have a script for ubuntu done. Only question is, if we're installing golang for them where do we put their GOPATH?\n. Here's the install script for Ubuntu.\nThe workflow for installing would be:\n wget <url>\nsource ./install.sh\nYou need to use source because otherwise you can't export the environment variables. I have a version that supports mac as well. It installs homebrew, then goes from there...but Github is throttling my pushes for some reason...so it's not showing up on github yet.\n. face palm \nIt looks like I forgot to track it in my first commit...\nAnyway, here it is :smile: \n. - I set a password in postgres for security reasons, but if you think people will only use this script for local stuff then I guess we could remove it. But I would suggest thinking about this decision carefully before we make it...\n- I got an error earlier saying it wasn't installed, so I added it to the script...I'll see if I can find out why.\n  EDIT I couldn't find a reason, so I'm assuming early on in the script I was doing something wrong to cause the error.\n- Yeah, but it's the only way to have an install script on mac, otherwise we'll have to look into an actual installer. I mean, we could keep it with the homebrew install method for now (because only powerusers are likely to use abot at the moment), and add a graphical installer in the future once we're more stable/complete.\n. Need to set a postgres password or it won't connect. So I've added it back in.\n. @egtann is that gpg key that is causing builds to fail yours?\nBecause if it is, you should submit it to: https://pgp.mit.edu/ to fix this.\n. Any status updates?\n. With regard to issue #45 the only change in functionality required is to accept the first path as the GOPATH for Abot. So I'm thinking we implement that quickly to fix the bug, and open a separate issue for enhanced functionality?\nI did a quick find | grep for GOPATH:\n./abot.go:                              p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\",\n./abot.go:              Command(\"/bin/sh\", \"-c\", pwd | sed \"s|$GOPATH/src/||\").\n./cmd/setup.sh:run \"checking GOPATH\" \"[ -n '$GOPATH' ]\" \"GOPATH is not set\"\n./core/boot.go:         p = filepath.Join(os.Getenv(\"GOPATH\"), \"src\", conf.ImportPath)\n./core/boot.go: p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\", \"github.com\", \"itsabot\",\n./core/boot.go: p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\", ipath, \"plugins.json\")\n./core/boot.go: p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\", ipath, \"abot.env\")\n./core/handlers.go:             p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\", \"github.com\",\n./core/handlers.go:             p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\", url,\n./core/nlp.go:  p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\", \"github.com\", \"itsabot\",\n./core/nlp.go:  p := filepath.Join(os.Getenv(\"GOPATH\"), \"src\", \"github.com\", \"itsabot\",\n./README.md:$ cd $GOPATH/src/github.com/itsabot/abot\n./shared/plugin/plugin.go:      if path := os.Getenv(\"GOPATH\"); path != \"\" {\n. Finally got the SQL indent right...might want to go through and standardize the spacing on SQL query indents....\n. ...How did I miss that....anyway, I'll push an update later today.\n. You're right about the float64 being incorrect, I forgot to change it, but wrong about using int64. math/big.Float is the correct type for money (and other precision-dependent fractions).\nI added an ErrNotFound type and made all Abot specific errors in Extract return it.\n. There's no reason that a big float can't be used for non-decimal currencies. Admittedly it's more difficult (barely) to use than int64, but it handles division and multiplication while maintaining arbitrary precision, which int64 can't. It can handle arbitrary amount of money, has a Marshalling function for database storage than maintains precision, can easily be converted to a regular int/float for final use with other APIs\n. After thinking about it, perhaps we could have two currency representations. One that is the general case and uses int64, and one that uses big.Rat for people that need to perform mult/div on their currency representation.\n. Sorry about the change of len(s) == 0 I know go stores it with the string, I've just always hated it when people do that hahaha.\nI was in a rush for lunch when I rebased :smile: \n. Fine by me :+1: \n. Just FYI, the build failed because of a gpg error, not because somethings wrong with the file.\n. Don't merge this yet, I had so many wonderful types of alcohol in Alcohol().... :( On the wrong computer I guess...\n. Okay, I'm satisfied. :+1: \n. The only type of algorithms that I know by \"IA Algorithms\" are immune\nalgorithms...and to the best of my knowledge Abot doesn't use them. Almost\nnobody uses them.\nCould you elaborate?\n. Side Note: Publishing plugins through itsabot.org causes a strconv.ParseInt error...\n@egtann Do we have a slack group, gitter, etc? Because communication for the project could be improved (Don't really have a means of contacting you :stuck_out_tongue_closed_eyes:) Are we using #abot-dev on freenode now?\n. Have you read the wiki? (https://github.com/itsabot/abot/wiki/Building-a-Plugin)\nSkipIfComplete and dt.Memory should allow you to only ask the city once. You can set your triggers so that if the user asks for a specific city you return the weather for that new city and remember.\nIdeally, we should have a task for requesting the city...I'll make one later tonight and open a pull request. (Unless you want to do it)\n. You should be asking your question to the user OnEntry. Doing your parsing, work, and memorizing in OnInput. Then checking if it's stored in memory, and returning the value in Complete.\nIn general it helps to know the problem you're actually facing, so we don't give answers specific to a made up situation. :smile: \n. - I'm okay with this, but not sure we should remove the current state_machine...maybe rename the current implementation to workflow.go, and implement the new FSM as state_machine.go? Maybe by the time the state_machine is complete the old workflow will seem redundant and we can depreciate it, but for now I think its a useful abstraction for new programmers writing a plugin.\n- I'm okay with us re-implementing state_machine to be a true FSM, but I think we should stick to labels for indicating which state to transition to. Remembering integers in a large state machine will get tedious.\n- Not sure a channel is necessary for additional communication. Assuming each complete state prints to the user, you should be able to handle this in the state machine.\n. @eviltoylet Are you going to make a pull request? Otherwise I'll fix this.\n. HasMemory works as intended...it queries the DB and returns the JSON response if there are no errors. If there's an error (it doesn't exist in the DB), then it sets Val = json.RawMessage{} which is an empty []byte.\n. Disclaimer I haven't actually used the Memory datatype\nAn empty string is nil when marshaling, so it's unmarshaled as an empty []byte. However, if someone stores a custom marshaled struct, then it probably will break...\nThe entry in the db is overwritten if a new value is passed to SetMemory()\n. We can force devs to implement an IsEmpty interface on a struct they make. Then force them to store in DB using that struct, and when we retrieve from the DB and unmarshal we can just call the IsEmpty method.\n. To fix #58 , we should probably also include a check for an empty string in HasMemory()\n. Are you looking at the correct plugins.json? It's looking in $GOPATH/src/github.com/itsabot/abot\nDo you have a folder /home/xxx/go/src/github.com/itsabot/plugin_hello/?\n. Yes, yes it would\n. Yeah, which is why I haven't done a lot with the Idea\nOn Thu, Apr 21, 2016 at 10:34 PM Evan Tann notifications@github.com wrote:\n\n@njaremko https://github.com/njaremko I've spent some time looking into\nProtocol Buffers with Go. I don't know that this is the right approach. It\nseems to me asking people to install another dependency (which involves\ninstalling a compiler via C++) and learn the schemas is more than a small\nask and quite a bit more difficult than the current JSON system. Am I\ncorrect that people writing plugins would need to learn this in order to\nuse the Memory API?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly or view it on GitHub\nhttps://github.com/itsabot/abot/issues/63#issuecomment-213214472\n. Hahaha\nOn Thu, Apr 21, 2016 at 10:40 PM Nathan Jaremko njaremko@gmail.com wrote:\nYeah, which is why I haven't done a lot with the Idea\nOn Thu, Apr 21, 2016 at 10:34 PM Evan Tann notifications@github.com\nwrote:\n\n@njaremko https://github.com/njaremko I've spent some time looking\ninto Protocol Buffers with Go. I don't know that this is the right\napproach. It seems to me asking people to install another dependency (which\ninvolves installing a compiler via C++) and learn the schemas is more than\na small ask and quite a bit more difficult than the current JSON system. Am\nI correct that people writing plugins would need to learn this in order to\nuse the Memory API?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly or view it on GitHub\nhttps://github.com/itsabot/abot/issues/63#issuecomment-213214472\n. Perhaps we could have a boolean that determines whether a plugin is interpretable?\n\n\nIf not, then I'll have to side with Evan, but only marginally because of that specific example. If abot is asking for an arbitrary string, and you provide one, it probably shouldn't jump to another plugin.\nOverall, I think that having the ability to stop a current conversation and say \"Set my alarm for 5pm\", and have it work is a better choice.\n. I think it's training input -> function called because in most cases people are going to use \"the\" plugin for each task they want to accomplish, so the popular plugins will amass a large body of training input. At least for the open source part anyway....for the closed source complex machine learning mega awesome trained models, I assume they'll be able to parse input and check command-object combinations for similar intent/synonyms.\n. Google's speech API isn't public yet, so we'll have to wait on that. \nSide note: is this feature specific to desktop clients? Because most mobile interaction would be through text, which would use iOS/Android voice support.\n. Sorry, gofmt did it :confused: \n. Whoops, managing so many branches right now hahaha\n. See previous comment, so many branches :stuck_out_tongue: \nI have a branch with every canadian city added to the csv\n. What do you want to do then? Just log the error? If GOPATH can't be found, abot will break...\n. ",
    "bwcall": "Also I notice that since I filled my plugins.json up with 5/6 plugins , now they are re-downloaded everytime it seems even when i reduce them back down to the bare minimum onboard plugin , is there a context being stored to the db and the json is being ignored , its quite strange.\nEven though stripe was the only plugin using this pkg package it still remembers that it has ever been referenced after the json changes.\n. Hi ,\nYes I figured it was just outdated thats fine , the plugin install is a bit strange though even deleting the plugins.go and re-running the install seems to still bring in the original full set of plugins that I referenced originally.\nYou should be able to reproduce if you run install with plugins.json with extra entries and then delete the lines except for onboard/weather and delete the unlying the directories for stripe / sendgrid etc. so there is no references ( I know that isn't the ideal approach!)\nAnother way is to do as above and not do the delete of directories referring to the plugins that you no longer reference in the plugins.json , seems to still try to build them even after reference is removed in json.\n. ",
    "chamoda": "@egtann psql (PostgreSQL) 9.3.11\n. ",
    "aburgd": "Have you tried to start postgres? And what platform are you on?\n. The thought hadn't even crossed my mind - with other stuff I've used, like the gotour, it just worked out of the gate. I guess I'll have to go back and look.\n. Alright, after opening the ports and reloading my box it worked! Thanks for the reminder. \n. ",
    "joe-alphavirtual": "What does psql binary mean in this case? I am stuck in this step.\n. ",
    "duncanleo": "I think that a previous Postgres installation may have borked things, trying it out on another Ubuntu instance worked. Thanks! :+1: \n. ",
    "swennemans": "Found it. I will added my answer for reference. \nI found the test in the weather plugin. Unfortunately building his test fails, but the URL needed seems to be indicated here: \nreq := \"what's the weather in LA?\"\n    u := fmt.Sprintf(\"http://localhost:%s?flexidtype=2&flexid=%s&cmd=%s\",\n        os.Getenv(\"PORT\"), url.QueryEscape(phone), url.QueryEscape(req))\nThen: \ncurl -H \"Content-Type: application/json\" -d '{\"flexidtype\":2,\"flexid\":\"+13105555555\", \"cmd\" : \"hi\"}' http://localhost:4200/\nIsn't this something that should be in the documentation? Or is it left out on purpose? :)\n. ",
    "hashworks": "For me GOPATH shares enough with the PATH variable, so it just seemed naturally for me to set multiple directories. go get will always store stuff in the first directory, but when I store my own code in another directory and import it elsewhere Go will find it just fine. Works just as I would expect it.\n. ",
    "mikeumus": "Pardon just been busy with freelancing trying to get things out and make rent. Have a customer who doesn't want to pay even half their bill. Times are a little hard right now. \n. ",
    "JoeMacz": "Thanks mate!\n. ",
    "eviltoylet": "If there isn't a city in memory yet, where should the logic to extract out the city and store it live? I want it to live in a State, but there doesn't seem to be a \"good\" place for it. That is, in OnEntry(), a message will be returned. It looks like the assumption was this message would always be returned back to the user, which isn't true in this case. I want to basically check the message to see if there's a city, we're done and if not, ask for it.\nI understand that there are some structures built around city specifically, but for now, let's pretend there isn't. My problem domain isn't with cities, I just chose it because I thought it'd facilitate an easier discussion.\n. I want to be able to have the option to not ask a question OnEntry() in the case that the user has provided all the necessary data. How do I do that? I think if you tried to implement it, you'll run into the same issue.\nSay I'm running a plugin for purchasing items. I have states that gathers information about the item, the brand, the quantity, and when to buy it. I can:\n- ask all the information in a piece meal fashion through all the steps (i.e. buy ketchup)\n- or, not ask if all that information is provided. (i.e. Buy two gallons of Heinz ketchup tomorrow)\n. The implementation in state_machine.go is a linear workflow engine and it isn't as flexible as a true state machine. There are also still some bugs in the current implementation.\nI would recommend the following modifications:\n- Remove onEntry, onInput, and Complete and replace with one method called process(in *dt.Msg, iteration int) int. iteration indicates the number of iterations we've been in this state. The initial iteration is 0.\n- process will return an integer to indicate the next state to transition to. If no transition can happen, then the integer of the current state would be returned. There should be a special value like -1 for the terminal state.\n- A channel should be provided which can be used to solicit further input from the user.\n. @egtann you're correct. What is currently there is indeed a state machine, it just doesn't have as much flexibility as I would like. The domain which it addresses is extremely narrow and it won't work for any cases beyond the following:\n- prompt user for information (onEntry)\n- process the provided information (onInput)\n- if the right information was given, go to the next state (Complete)\nI would like to keep processing of information in onInput instead of performing it external to the state machine. Currently, if SkipIfComplete is set OnInput isn't called prior to Complete. I don't know if such a change would cause issues with existing plugins. (https://github.com/eviltoylet/abot/commit/c5a7a9b3f5608461a57b8450657a7f4981cc7dd7)\nHere are some of the things that I find myself implementing that I wish were provided:\n- Clearer semantics for Complete. Returns a message, but is only used when it's false.\n- keeping track of all Msgs that have been provided so they can be referenced from other states. It'll make for more natural conversations.\n  - you: Show me movie times for Star Wars, tonight\n  - me: For which theater?\n  - you: AMC in Seattle\n  - me: For what time?\n  - you: ...\nYou've already given the temporal reference of tonight earlier, but I don't have that information at this point.\nDoes this make sense?\n. I've jumped into the IRC channel. It'll be faster to talk through the issue there and then post back to this thread with a summary.\n. :thumbsup:\n. There's a disconnect here then. In the example here: https://github.com/itsabot/abot/wiki/Building-a-Plugin, SetMemory() is called with an empty string which is not going to result in the DB not having that row. There needs to be a way to remove a value.\n. This is similar to the code used in SetMemory().\n```\npackage main\nimport (\n    \"fmt\"\n    \"encoding/json\"\n)\nfunc main() {\n    b,_ := json.Marshal(\"\")\n    fmt.Println(b)\n}\n```\noutput:\n[34 34]\n. @egtann would love to sign the CLA, but I can't find it. Where's it located?\n. @egtann signed. thanks!\n. Say you have a favorite phrase plugin:\nbot: \"What's your favorite phrase?\"\nme: \"Set my alarm to 5 pm.\"\nWhat happens? If this is the design you're going for, then you should document that this is going to happen. But, I think this would be a huge mistake to go this route. \nEven in natural conversations, if you switch topics abruptly you're going to cause frustration. I understand that this might be the par for drawn out text conversations... but then the more appropriate model is probably a timeout with a message from Abot indicating this is happening.\n. Switching back to a plugin requires you to type the trigger words for that plugin. Then you're slapped into a state where you probably don't remember the context as a user.\nAbot really needs to be more opinionated on what's permissible and what's not, and then create scaffolding to support those principles. As of now, it's passing a lot of this burden onto the plugin developer.\n. I've added in the extra check. I'm not going to add the test in this checkin for the following reasons:\n- I'm really new to go and have no idea what the idiomatic way to test is.\n- there doesn't seem to be any existing infrastructure for a DeleteMemory. test to leverage. It's missing a sql mock driver.\n. ",
    "martyhimself": "Having only just started with Abot (and I must say I am very impressed!) I was wondering about this as well. \nI have no strong opinion one way or the other- but would it be easy to switch back to the previous conversation and would the state of the conversation be held in memory or persisted some way? (or is this something that is on the cards for implementation?). \nMy gut feeling would be that it could be harmful to interrupt a conversation such as purchasing process, unless maybe you have Abot take initiative (push notifications?) to complete the state machine (e.g. 'Hey, would you still like to purchase those movie tickets?'). Now that would be cool :).\nEDIT: it looks like LoadState in state_machine.go does exactly that (resume the conversation). It just needs the user to bring the conversation back on track.\n. This looks great! A first question I have would be, what does it train? Does it effectively create the command-object combinations creators of plugins would usually have to supply 'manually' to create triggers? In the third example in your picture, does it 'train' the plug in to recognise 'turn off' as effectively an alias for 'disable', within the context of this plug in? Training seems to suggest that when an algorithm is presented with new data, it is somehow able to infer meaning or suggest a solution- that doesn't seem to be happening here? (sorry I may be completely wrong here- hope I'm not diluting the dicussion).\n. ",
    "sharang-d": "Hey guys, is the column in question named 'sentence' in the 'messages' table?\n. Are you creating the migrations by hand or is there some package/library helping you with it? Another follow up question: as a general rule/guideline what command/s do I run to check if I haven't broken anything(tests!)? I can't find that in the contributing guide or elsewhere. Thanks in advance. 😄 \n. Is this output normal?\n➜  abot git:(master) go test ./...\nok      github.com/itsabot/abot 7.197s\nok      github.com/itsabot/abot/core    0.177s\n?       github.com/itsabot/abot/core/log    [no test files]\n?       github.com/itsabot/abot/core/template   [no test files]\n?       github.com/itsabot/abot/core/websocket  [no test files]\n?       github.com/itsabot/abot/data/ner    [no test files]\n?       github.com/itsabot/abot/shared/datatypes    [no test files]\n?       github.com/itsabot/abot/shared/helpers/address  [no test files]\n?       github.com/itsabot/abot/shared/helpers/timeparse    [no test files]\n?       github.com/itsabot/abot/shared/interface/cal    [no test files]\n?       github.com/itsabot/abot/shared/interface/cal/driver [no test files]\n?       github.com/itsabot/abot/shared/interface/email  [no test files]\n?       github.com/itsabot/abot/shared/interface/email/driver   [no test files]\n?       github.com/itsabot/abot/shared/interface/emailsender    [no test files]\n?       github.com/itsabot/abot/shared/interface/emailsender/driver [no test files]\n?       github.com/itsabot/abot/shared/interface/payment    [no test files]\n?       github.com/itsabot/abot/shared/interface/payment/driver [no test files]\n?       github.com/itsabot/abot/shared/interface/sms    [no test files]\n?       github.com/itsabot/abot/shared/interface/sms/driver [no test files]\n?       github.com/itsabot/abot/shared/knowledge    [no test files]\nok      github.com/itsabot/abot/shared/language 0.047s\n?       github.com/itsabot/abot/shared/nlp  [no test files]\n?       github.com/itsabot/abot/shared/plugin   [no test files]\n?       github.com/itsabot/abot/shared/task [no test files]\nSorry I deleted my earlier post before you replied.. my db wasn't running. 😛 \n. Thanks, I'll get to work and send in some code soon hopefully!\n. @eviltoylet @egtann Please let me know if this is ok. Thanks in advance. 😄 \n. ",
    "itsbalamurali": "Intent Extraction Toolkit\ndouble_intent.pdf\n. @egtann do you mean speech to text or text to speech?\n. I guess entity recognition can be added into plugin.json file\n. ",
    "samuel-pt": "I got this message in \"abot server\" console\n```\n\n:~/work/go_workspace/src/github.com/itsabot/abot (master)$ abot server\n2016/04/21 18:00:30 started Abot\n2016/04/21 18:00:40 failed to process text pq: column \"flexid\" of relation \"messages\" does not exist\n2016/04/21 18:00:40 failed to process text pq: column \"flexid\" of relation \"messages\" does not exist\n\n```\n. I don't see cmd/migrateup.sh. Do you mean dbsetup.sh or setup.sh?\n. No, not yet I facing some other issues. Today I will do a new clone and check this out.\n. Thanks a lot. \nIt is working fine with the latest changes\n. Now my plugin is called by abot\n. I've just installed https://github.com/itsabot/plugin_weather and https://github.com/itsabot/plugin_hello in my aBot instance\n. Thanks for looking into this issue.\nNow heroku is expecting the plugin packages to be present. Here is the error\nremote: -----> Running: go install -tags heroku github.com/itsabot/abot\nremote: plugins.go:5:2: cannot find package \"github.com/itsabot/plugin_hello\" in any of:\nremote:     /app/tmp/cache/go1.6/go/src/github.com/itsabot/plugin_hello (from $GOROOT)\nremote:     /app/go/src/github.com/itsabot/plugin_hello (from $GOPATH)\nremote: plugins.go:6:2: cannot find package \"github.com/itsabot/plugin_weather\" in any of:\nremote:     /app/tmp/cache/go1.6/go/src/github.com/itsabot/plugin_weather (from $GOROOT)\nremote:     /app/go/src/github.com/itsabot/plugin_weather (from $GOPATH)\nremote: \nremote:  !     Push rejected, failed to compile Go app\nremote: \nremote: Verifying deploy...\nremote: \nremote: !   Push rejected to abot-springml.\nremote: \nTo https://git.heroku.com/abot-springml.git\n ! [remote rejected] master -> master (pre-receive hook declined)\n. Redeploying solved the problem. Thanks a lot\n. ",
    "hhsnopek": "Good call, lemme just make sure everything is still working :) \n. 👍 updated - note this does not help acronyms like LA: la -> La\n. Whoa where did all those commits come from! Thought I squashed it ha - one sec\n. done 😄 \n. My thoughts on this are that if someone where to publish their plugin thru a service like github, gitlab, svn, etc - maintainers are able to track who can publish/commit what. Abot isn't consuming the code and hosting, or at least I'd hope not - but I would say that the user must verify their affiliation to their account the X service. This way only that user can publish their own work, like connection github so I can publish github.com/hhsnopek/emoji-weather, they'd both know that my user is connected to that account name.\n. ",
    "GenaBitu": "What about gpg signatures on the plugins?\n. ",
    "ankitbansal82": "I will soon start working on integrating it with telegram.\n. @DaleWebb - I have worked with Telegram before and I need it for the project I have in mind anyways.\n@egtann  / @all - \nTelegram provides two means of fetching updates. \ngetting-updates Long polling and webhooks.\nlong-polling Long polling doesn't fits in well with Abot design because it's a blocking call. And more so it will not come via the httprouter routes.\nwebhooks Webhooks seems like the better approach to use and is very similar to SMS driver model\nBut Telegram only allows HTTPS. \nSo can we change Abot http server to accept both http and https connections? \n. Or i can run the long polling update loop on a separate go routine. What do you guys suggest?\n. you mean the bash shell? I use a console emulator http://cmder.net/\nI hope abot can run on windows machine? DO I need to use some sort of hosting wrapper?\n. ok let me try cygwin.\n. So abot specifically requires shell instead of bash?\n. Before i try set this up, just wanted to check if abot can be setup on windows?\n. I think you can remove the dependency on shell by changing abot.go\nChange this \n Command(\"/bin/sh\", \"-c\", \"go get ./...\").\nto \nCommand(\"go\",\"get\",\"./...\").\nIts exactly the same outcome without dependency on the shell. \n. i have managed to get past the setup.sh. Now onto abot server. Will let you know all steps I had to do to get it running. Once I am through.\nbash-3.1$ cmd/setup.sh\n- [starting] ***********\n[ok] checking for go binary\n  [ok] checking GOPATH\n  [ok] installing dependency manager\n  [ok] syncing dependencies\n  [ok] installing glock hook\n  [ok] installing abot\n  [ok] checking for psql binary\n  [ok] checking postgres connection\n  [ok] checking for abot database\n  [ok] checking for abot_test database\n  [warn] running abot migrations\n         database migrations failed\n         if the database has already been migrated, you can ignore this message\n  [warn] running abot_test migrations\n         database migrations failed\n         if the database has already been migrated, you can ignore this message\n    [ok] checking if abot database is seeded\n    [ok] checking if abot_test database is seeded\n    [ok] installing abot plugins (this may take a minute)\n- [finished] ***********\nto boot abot:\n    1. run 'abot server'\n    2. open a web browser to http://localhost:4200\nyou'll want to sign up to create a user account next\nbash-3.1$ abot server\n2016/05/08 18:02:24 failed loading plugins.go invalid character ']' looking for beginning of value\ncould not start server\ninvalid character ']' looking for beginning of value\n. It was due to a trailing comma when starting server with no plugins. I did went past it. But i keep hitting other nagging issues on windows platform. \nI am giving it a shot on ubuntu now, if it works for me then i can look to make the code compatible on windows.\n. Just for your reference, next issue i hit is in the compiledassets.sh.\nOn windows i havent managed to get the ln command working.\n. Tried two options - not sure where to go from here.\nOption 1: change auth_method to md5\nSame result as before\n\nankit@ubuntu:~/working/src/github.com/itsabot/abot$ cmd/setup.sh postgres:Postgres1234@localhost \n\nankit@ubuntu:~/working/src/github.com/itsabot/abot$ cmd/setup.sh postgres:Postgres1234@localhost\n- [starting] ***********\n[ok] checking for go binary\n  [ok] checking GOPATH\n  [ok] installing dependency manager\n  [ok] syncing dependencies\n  [ok] installing glock hook\n  [ok] installing abot\n  [ok] checking for psql binary\n  [ok] checking postgres connection\n  [ok] checking for abot database\n  [ok] checking for abot_test database\n  [warn] running abot migrations\n         database migrations failed\n         if the database has already been migrated, you can ignore this message\n  [warn] running abot_test migrations\n         database migrations failed\n         if the database has already been migrated, you can ignore this message\n    [ok] checking if abot database is seeded\n    [ok] checking if abot_test database is seeded\n  [err] installing abot plugins (this may take a minute)\n[cmd] abot plugin install\n2016/05/14 21:45:21 pq: password authentication failed for user \"postgres\"\nOption 2: Go back to blank password\nby logging to psql using \n\nsudo -u postgres psql postgres\nand then use \\Password\nto set blank password\n\nBut then script starts breaking at point of checking postgres connection\nankit@ubuntu:~/working/src/github.com/itsabot/abot$cmd/setup.sh postgres@localhost\n   [starting] ***********\n[ok] checking for go binary\n    [ok] checking GOPATH\n    [ok] installing dependency manager\n    [ok] syncing dependencies\n    [ok] installing glock hook\n    [ok] installing abot\n    [ok] checking for psql binary\n   [err] checking postgres connection\n         unable to connect to postgres\n         please check your connection parameters...\n         (host: localhost, port 5432, user: postgres, pass: )\n         ... and make sure postgres is running\n   [cmd] psql -w -h 'localhost' -p '5432' -U 'postgres' -v ON_ERROR_STOP=1 -c '\\q'\npsql: fe_sendauth: no password supplied\n. Didn't help. Same results as before.\nAny clue why importing lib/pq is attempting to connect to postgres.\n\n_ \"github.com/lib/pq\" // Postgres driver\n. Found the root cause.\n\nIt's the call to create a new plugin from within the init function of weather plugin\np, err = plugin.New(\"github.com/itsabot/plugin_weather\")\nThis New() method is trying to connectDB() but upto this point the main() func in abot.go has not been executed and env parameters for DB url are not set, and thus it fails.\nSo env variables need to be loaded before anyone else can connectDB.\n. Ok. In that case i will move LoadEnvVars to shared so both core and plugins can use it. \n. Done and tested. Please merge back if it looks OK.\n. Ok. Will fix\n. Done\n. @egtann hope this meets the project style template.\n. You got a commit template somewhere? So i can get it first time right?\n. here you go. I think it will be useful to have a commit template checked in that contributors can use in their git config.\ne.g. https://gist.github.com/adeekshith/cd4c95a064977cdc6c50#file-git-commit-template-txt\n. I will test this out today. There is still a reference to itsabot/abot directory in plugins.json, does that needs to be handled as well?\n. ",
    "jonathanpeterwu": "IBM Watson speech-to-text accuracy is so so. \nBing Speech API is surprisingly a lot more accurate and fast - \nhttps://www.microsoft.com/cognitive-services/en-us/speech-api\n. ",
    "mpathy": "The Google Speech API is now also available and quite good:\nhttps://cloud.google.com/speech/\nBesides that, there are some other very interesting APIs, like the Natural Speech API for analyzing the text:\nhttps://cloud.google.com/natural-language/\nI would use those. ",
    "St0ner1995": "What are you using to run it on Windows?\n. cmder does not have shell (sh). It has the Bourne again shell (bash). I think Cygwin has the shell interpreter\n. The problem your having is your Linux environment does not have the shell prompt, that's all the error is\n. The plugin install script does, yes\n. Honestly, i have not tried it\n. ",
    "lmaw": "Hey ankitbansal82, I have the exact same problem.. You should know that there are alot of bugs with Abot on Windows. Please let me know if you found a fix and how you did it, Thanks in adnvanced :) \n/Fred\n. Looks Cool, Clean and simple! So I also made a Admin dashboard inspired by your design and I changed it a little bit. I had nothing to do on school so thats the main reason why I made this. but, I cant no scope/trickshot like a real designer. I hope you like it!\n\n. ",
    "awwalker": "Thanks for the review @egtann I'll try and get this PR fixed over the next couple of days. \n. Yes @egtann if you could give this another look over that'd be great. I think I have the channel working the way you envisioned for the goroutines. Let me know what you think\n. ",
    "arashahmadi": "ps aux | grep -i postgres\npostgres    802  0.0  0.1 295220  1780 ?        S    17:49   0:00 /usr/lib/postgresql/9.4/bin/postgres -D /var/lib/postgresql/9.4/main -c config_file=/etc/postgresql/9.4/main/postgresql.conf\npostgres    840  0.0  0.0 295220   240 ?        Ss   17:49   0:00 postgres: checkpointer process\npostgres    841  0.0  0.0 295220   100 ?        Ss   17:49   0:00 postgres: writer process\npostgres    842  0.0  0.0 295220     0 ?        Ss   17:49   0:00 postgres: wal writer process\npostgres    843  0.0  0.2 295620  2480 ?        Ss   17:49   0:00 postgres: autovacuum launcher process\npostgres    844  0.0  0.1 150364  1316 ?        Ss   17:49   0:00 postgres: stats collector process\narash      4238  0.0  0.2  13696  2060 pts/4    S+   18:31   0:00 grep --color=auto -i postgres\nwhich psql\n/usr/bin/psql\npsql (PostgreSQL) 9.5.2\nOS : Ubuntu 15.04\nThank you\n. ",
    "mwthayer": "A few UX thoughts in no particular order\n- Move plug-in dashboard to the left (in addition to or in replacement of its current position)\n- Allow for data dumps (If currently allowed, add a dashboard button for it)\n- Specify \"Train your bot\" (Avoids confusion with end-user training)\n. 1) It's fine if it moves but I think that as a major function, it should stay on the left as well.\n2) Yes. Maybe give them a list of data points which would be the columns for them to select and then they can download. \n. ",
    "raisudeen": "Sorry for my delayed reply. I tried it in both 12Mbps and 24Mbps network. This occurs often now. What is the timeout configuration for this? Is it possible to increase it more?\n. ",
    "joeblew99": "The visual plugin builder sounds very interesting.\nI am curious on the architecture proposed for this.\nI have built similar things using polymer web components.\nIf you have any example code / specs let me know.\nI could help.\n. ",
    "darrindickey": "That was it. Didn't realize I needed to add PATH to my bash_profile. Thanks.\n. @egtann, I think I did that already. The only place I found that URL was in src/github.com/itsabot/abot/core/analytics.go. I changed the URL there to https://raw.githubusercontent.com/itsabot/abot/master/plugins.json, but I continue to get this error.\n. "
}