{
    "lgp171188": "Is it a good idea to complete the whole update to Django 1.4.1 in a branch and merge it, or is it okay to do it in small parts like I have done now?\n. Also the python version and compatibility details need to be updated. I understand that Django 1.4 supports Python 2.5 to 2.7. Not sure about GIS framework. \n. Hi Jacob, I have incorporated the changes you suggested. Also made some changes for the Python version compatibility and Git instead of subversion for installing the \"development\" version. I am not sure if \"master\" branch needs to be used for the development version.\n. Once this book is updated to the latest and greatest Django version, will the old versions be still available on djangobook.com? If so, it'd be better to link to them. If not, we could link to the official Django documentation at least.\n. My bad. I copied the description from the official Django documentation and forgot to link 'How to deploy with WSGI' . I will make the changes and update the pull request.\n. ",
    "mpdaugherty": "@jacobian Do we have a style guideline for the .rst files?  I automatically removed whitespace at the end of the lines and wrapped paragraphs at 80 characters, but I'm afraid that this may make the diffs hard to read.  Let me know if it's appropriate or not.  Thanks!\n. Great; will do\n. Ah, I wasn't sure and didn't find a good source while googling.  Will update.\n. I agree that this note is a distraction from the point of the chapter.\nOn the other hand, I do think our examples should use raw strings, because that's what startproject puts into urls.py by default.  Therefore, I feel that the question would naturally occur to new users if they look at our examples vs. their urlconf and think \"Why do these strings start with 'r' and the ones in the book don't?\"\nWhat do you think about using raw strings, but leaving out the explanation?  Or, we could change this inline explanation to be something short like \"The r indicates a raw string instead of a normal string.  To find out why you would use one instead of the other, read the note at the end of this chapter.\" and then put the longer explanation at the end of the chapter.\n. Thanks; I updated the note.\n. ",
    "jacobian": "@mpdaugherty generally, I do exactly what you said - reformat and re-wrap as needed. It does make diffs slightly harder to read, but it makes the source easier to read so that's a tradeoff I'm OK with.\nThanks for the changes, I'll try to review and merge or let you know if there's anything that needs fixing.\n. Awesome, thanks!\n. Thanks! Looks great, I left a few TODOs.\n. See my comment on #18.\n. Yup, those look fine.\n. Probably can't just drop this in here without a brief note about it. Is this the first place csrf_token is used? If so we should add a note about the fact that's required for all forms and pointing readers to the security chapter (20?) for more details.\n. Fixed in #17.\n. This should have been fixed now.\n. It should just be books.models. It's possible there's other things wrong that lead to that not working, but those should be fixed, not this.\n. The book should cover the newest (1.5), and not mention the older layout. Can you update this please?\n. This is wrong; it should just be from books import ...\n. This doesn't actually seem to work.\n. This no longer applies; could you re-merge from master please?\n. I find \"You'll want to switch to the newer Django version.\" rather glib -- perhaps they don't want to switch (or can't). Perhaps instead replace this with a pointer to older documentation? Something like \"This book covers Django 1.4 and above, so if you're using an older version you probably want to consult Django's official documentation: [link to 1.3], [link to 1.2], etc.\"\n. Is this section in the book? If so this should be a link to the book. Otherwise, it should be a link to the docs.\n. Please fix the underline - should be the same length as the header.\n. This actually doesn't match the our current thinking about Django's release policy any more -- the plan is to always be backwards-compatible, at least as much as possible. So let's nix this whole paragraph.\n. \"at the earliest\" is actually wrong - we made it happen, and 1.5 will support 3.2 and above. This should reflect that.\n. This should probably use the exact snippet from the generated config file (i.e. with comments, etc.) instead of something similar.\n. This backend's been deprecated in favor of the psycopg2 one; we shouldn't mention it.\n. It's actually more complicated than that: see https://docs.djangoproject.com/en/dev/faq/install/#what-python-version-can-i-use-with-django.\n. This note is a distraction; it's not needed here.\n. In fact, I'd probably just not use raw strings at all. Backslashes rarely appear in URLs (and certainly not in well-formed ones) and so the distinction's just extra noise and confusion for new users. \n. This should probably be request.GET.get('q', '')\n. This should just be chapter02.html (no trailing slash); could you fix that please?\n. ",
    "Lapin-Blanc": "Sorry, I didn't see it... I'll have a look at what you ask... Are the additional imports valid ?\n. ",
    "lfolco": "hi-\nwhen i've been going through it, using mysite.books.models resulted in an error. my directory structure is as follows. i followed the instructions pretty clearly. i'm using version django version 1.4\nmysite\n    - books\n       - __init__.py\n       - admin.py\n       - models.py\n       - tests.py\n       - views.py\n    - mysite\n       - __init__.py\n       - settings.py\n       - urls.py\n       - views.py\n       - wsgi.py\n    - templates\n       - books\n           - search_form.html\n           - search_results.html\n       - base.html\n       - current_datetime.html\n       - display_meta.html\n       - hours_ahead.html\n    - manage.py\nis that how you have your directory setup? i'm not sure if i'm doing this wrong :)\n. ",
    "alvinkatojr": "Hello Laura:\nThanks for your query. Please post the error you are getting so that we can\nget debug it.\nAlso your directory structures seems cluttered,\nmysite\nmysite\n- init.py\n- settings.py\n- urls.py\n- wsgi.py\n- templates\n  books\n  - init.py\n  - admin.py\n  - models.py\n  - tests.py\n  - views.py\n    templates\n  - search_form.html\n  - search_results.html\n  - base.html\n  - current_datetime.html\n  - display_meta.html\n  - hours_ahead.html\n    manage.py\n'mysite.books.models' is referencing a directory structure with mysite at\nthe top tier(representing the project), books second line(the books app)\nand the models file next. It could be that the model file is inaccessible\ngive the structure you have, so I advise you restructure your files to\nmatch what I have showed you up here.\nHope that clears you up, let me know how it goes.\nAl\nOn Thursday, February 14, 2013, Laura Folco wrote:\n\nhi-\nwhen i've been going through it, using mysite.books.models resulted in an\nerror. my directory structure is as follows. i followed the instructions\npretty clearly. i'm using version django version 1.4\nmysite\n- books\n- init.py\n- admin.py\n- models.py\n- tests.py\n- views.py\n- mysite\n- init.py\n- settings.py\n- urls.py\n- views.py\n- wsgi.py\n- templates\n- books\n- search_form.html\n- search_results.html\n- base.html\n- current_datetime.html\n- display_meta.html\n- hours_ahead.html\n- manage.py\nis that how you have your directory setup? i'm not sure if i'm doing this\nwrong :)\n—\nReply to this email directly or view it on GitHubhttps://github.com/jacobian/djangobook.com/pull/23#issuecomment-13570786.\n. Sorry here is a better arrangement.  Check if your structure aligns.\n\nmysite\nmysite\n- init.py\n- settings.py\n- urls.py\n- wsgi.py\n- templates\n  books\n  - init.py\n  - admin.py\n  - models.py\n  - tests.py\n  - views.py\n    templates\n  - search_form.html\n  - search_results.html\n  - base.html\n  - current_datetime.html\n  - display_meta.html\n  - hours_ahead.html\n    manage.py\nOn Friday, February 15, 2013, Alvin Kato wrote:\n\nHello Laura:\nThanks for your query. Please post the error you are getting so that we\ncan get debug it.\nAlso your directory structures seems cluttered,\nmysite\nmysite\n- init.py\n- settings.py\n- urls.py\n- wsgi.py\n- templates\n  books\n  - init.py\n  - admin.py\n  - models.py\n  - tests.py\n  - views.py\n    templates\n  - search_form.html\n  - search_results.html\n  - base.html\n  - current_datetime.html\n  - display_meta.html\n  - hours_ahead.html\n    manage.py\n'mysite.books.models' is referencing a directory structure with mysite at\nthe top tier(representing the project), books second line(the books app)\nand the models file next. It could be that the model file is inaccessible\ngive the structure you have, so I advise you restructure your files to\nmatch what I have showed you up here.\nHope that clears you up, let me know how it goes.\nAl\nOn Thursday, February 14, 2013, Laura Folco wrote:\n\nhi-\nwhen i've been going through it, using mysite.books.models resulted in an\nerror. my directory structure is as follows. i followed the instructions\npretty clearly. i'm using version django version 1.4\nmysite\n- books\n- init.py\n- admin.py\n- models.py\n- tests.py\n- views.py\n- mysite\n- init.py\n- settings.py\n- urls.py\n- views.py\n- wsgi.py\n- templates\n- books\n- search_form.html\n- search_results.html\n- base.html\n- current_datetime.html\n- display_meta.html\n- hours_ahead.html\n- manage.py\nis that how you have your directory setup? i'm not sure if i'm doing this\nwrong :)\n—\nReply to this email directly or view it on GitHubhttps://github.com/jacobian/djangobook.com/pull/23#issuecomment-13570786.\n. \n\n",
    "mitar": "Hm, could comments be returned to the book? They were really useful feature!\n. ",
    "noobiept": "Yea that seems like a better way.\n. ",
    "suhailvs": "def search(request):\n    query=request.GET.get('q', '')\n    if query:\n        message = 'You searched for: %r' % query\n    else:\n        message = 'You submitted an empty form.'\n    return HttpResponse(message)\n. i have update it in my repo. see commit\n. @whoshuu please see #96 \n. i have updated in my repo\n. @CiniCraft  thanks for the pull request. I have updated these changes in my repo. feel free to send me pull requests.\n. @ayeletdn  thanks i have updated those in my repo https://github.com/suhailvs/djangobook.com. feel free to send me the pull request.\n. @ASEDS  thanks for your pull request. i have update mysite.books.models to books.models in my repository https://github.com/suhailvs/djangobook.com/. \nabout django.contrib.staticfiles, it is better to sever the static files in some other way(apache or nginx) in production, so i didn't updated those. \nI am planning to maintain the repo, because this book is wonderful. feel free to fork it and send me pull requests.\n. @brendantcd wellcome to github. thanks for your contribution. i hope to merged these pull requests to my repository https://github.com/suhailvs/djangobook.com.\n. @nqobile yes they were using these files to generate the content of djangobook.com. it is by sphinx. please see my fork https://github.com/suhailvs/djangobook.com. you can see its sphinx generated pages at http://suhailvs.github.io/djangobook.com/. I am planning to maintain the book, since it is a great book and helped me alot.. so feel free to fork mine and send me pull requests.\n. you must correct the import statement too:\nie from from mysite.books import views to from books.views import search_form\n. There is nothing wrong with this line. \nurl definitions are calling the view functions.\n. ",
    "guelo": "The change from 'mysite.books' to  'books' broke this section for me, I'm going through the book using django 1.4.  If this change is some new syntax in 1.5 then maybe it should be explained? Though Chapter 1 says the book is for 1.4.\nAlso, the paragraph at line 578 still mentions 'mysite.books' and contradicts the 'books' usage since it says you need the full python path:\n`'mysite.books' refers to the books app we're working on. Each app in\nINSTALLED_APPS is represented by its full Python path -- that is, the path\nof packages, separated by dots, leading to the app package.`\n. ",
    "pydanny": "Please change \"import *\" to explicit imports and resubmit.\n. Django supports several versions of Python 2 as well as Python 3. Until Python 2 support is removed from Django (distant future), examples should include both str and unicode.\n. ",
    "vially": "@pydanny Added new commits to address this.\n. Closing this because this book is no longer maintained.\n. ",
    "brwr": "Closing as duplicate of #51.\n. I think that's a good idea. I suppose when the book was originally written there was no easy_install or pip install for Django and that's why the book doesn't mention it.\n. ",
    "MortalCatalyst": "Should we be including the more common methods of using pip easy_install and vitrualenv ?\n. ",
    "brianclements": "I agree with this. I ran into the same issue and was looking around for 20 minutes trying to figure out how to get the example to work until I just read the very next paragraph. I think with manuals like this, we are trained to master the exact line we are one before we even glance over at the next instruction, so I feel this would be a common problem to many.\n. ",
    "earthquakesan": "True, it should be added to chapter04.rst, line 142:\nLaunch shell for your django project with \"python manage.py shell\"\nAlso, here is a link to answer and explanation on the StackOverflow: http://stackoverflow.com/questions/15556499/django-db-settings-improperly-configured-error\nCitation: \"You can't just fire up python and check things, django doesn't know what project you want to work on. You have to do one of these things: ...\"\nUpd:\nThere is an explanation already. So, there just should be just a note \"The following code will not run in the normal python shell, because django doesn't know what project you want to work on. You will see how to run the python shell within your project scope in the next paragraph.\"\n. ",
    "treyhunner": "Hey @nqobile!\nDisclaimer: I am not one of the maintainers of this project.  If @jacobian or one of the other maintainers wants to step in and correct or verify my interpretation, please do so.\nFrom my understanding pull requests #77 through #96 cannot be accepted by this project.  This is because the djangobook.com project files are used to generate the website http://www.djangobook.com/ and are primarily meant to be read from the djangoproject.com website and not from Github.  Your changes seem to introduce a book on that website.\nHere's the process I used to verify that your changes won't work out for the djangoproject.com website:\n1. I cloned your repository and checked out one of your pull requests to try to build the project locally:\ngit clone git@github.com:nqobile/djangobook.com.git\n   cd djangobook.com\n   git checkout patch-6\n2. I built the project locally:\nsudo pip install Sphinx  # I didn't have Sphinx installed\n   make html\n3. I opened the file _build/html/chapter06.html in Chrome and clicked on the Chapter 7 link at the bottom of the page.  The link took me to chapter07.rst (which gave me a 404 error) instead of chapter07.html.\nThanks for trying your hand at contributing.  I'm sorry no one said anything a few hours ago while you were in the process of making your contributions.  I was away from my computer at the time.\n. ",
    "nqobile": "@treyhunner \nThat makes sense. I was using djangobook.com trying to understand Django 1.6, but their disclaimer on the page led me to think that they were now pointing people to this repository for newer versions of Django. Since their disclaimer is still on the website I didn't think that they were using these files to generate the content for the book.\n. ",
    "Funkmyster": "Changed relative link to the format used at the end of Chapter04.\n. Adapter not needed as of Python 2.5 (minimum version of Django 1.4).\n. ",
    "miclovich": "\n. it attempts to access an html file that is not compiled to the _build folder; all html gets compiled to the _build/html folder.\n. ",
    "belgianguy": "Should be gone now :)\n2013/4/22 Jacob Kaplan-Moss notifications@github.com\n\nIn chapter01.rst:\n\n\\ No newline at end of file\n+.. _Chapter 2: chapter02.html/\n\nThis should just be chapter02.html (no trailing slash); could you fix\nthat please?\n—\nReply to this email directly or view it on GitHubhttps://github.com/jacobian/djangobook.com/pull/35/files#r3902901\n.\n. \n"
}