{
    "jasonlong": "This should be fixed with v0.8.1. Google says it could take up to 60 minutes to appear.\n/cc @nosir\n. I use AdBlock Plus, but I just installed AdBlock and it seems to work fine out of the box. Do you have it set up with some custom rules? Anything that would block <canvas> elements?\n. Roger that. FWIW, I had various issues while working on this were the graph wouldn't render. I think they were mostly timing issues w/ waiting for the 2D chart to render, but I think I fixed most of those. That said, there could still be oddball problems around this.\nI'll close this for now, but feel free to reopen.\n. My original plan was to make it a Safari extension as well since the structure is very similar, but I don't currently have any plans to add Firefox. If you or anyone else would like to submit a PR for Firefox support, that would be :metal:.\n. Closing this for now as I don't have any current plans for a FF version.\n. Thanks @bahlo. I'm not opposed to using Coffeescript. I'll pull this down and play with it in a couple of days and will follow up.\n. Sorry for the delay here @bahlo. I finally had a chance to pull this down and try it out. It seems to work exactly the same and the code is more readable – esp. the embedded HTML pieces. \nThanks for the contribution. :metal:\n. There's not really a way of doing this with obelisk.js. I fully realize that this visualization is less useful in many (most?) ways than the standard 2D view – e.g. many bars are hidden behind taller ones, you can't mouseover a bar to see the day and count, etc. This is why I choose to allow people to see both graphs at the same time.\n. Ah, I hadn't even noticed that. I'll try to think about this a little bit.\n. Fixed w/ #10.\n. Fixes #9\n. Thanks @bahlo. That seemed to do the trick.\n. Thx @muan!\n. The manifest file currently specifies that it only runs for URLs matching https://github.com/*. I'll need to look into it, but I think I'd need to change that to <all_urls> so that it could run on GHE installations as well.\n. :sparkles: Awesome. I'll merge this and then update the Chrome store version w/ version 0.8.7.\n. Ugh, this is apparently from #15 which introduced a less restrictive URL match so that the extension can be run on GitHub Enterprise installations as well.\nIf anyone has any ideas for how to better handle this, please let me know. Otherwise, I think this is going to have to be as-is.\n. Closing this for now. If someone finds a better way to handle this, please reopen.\n. Thanks @muan. I'm seeing that here too.\n. Thanks @sinan, I'm seeing this as well. We (GitHub) may have changed some markup around this and I didn't notice. I'll definitely take a look shortly.\n. This should be fixed up w/ the 0.8.9 release. Chrome should auto update your extension once it is published.\n. Not just you. It worked fine for a while and then got flakey again. I'll check it out :soon:\n. @muan I just published 0.8.11. Once you're updated, can you confirm it is working again for you?\n. :rage1: Uuuggggghhhh!\nI don't know what keeps changing that makes it break. I'll check into it though, thanks!\n. Hey @bryceglass – I've been seeing quirky things lately, mostly caused from recent DOM and CSS changes on the GitHub side, but I haven't seen this one. Have you tried a Shift+Reload to see if it reappears?\n. Still seeing this @bryceglass? \n. @bryceglass Yep, it should show up on everyone's profile page. I was about to say you're crazy, but I just noticed the same thing here. Investigating...\n. @bryceglass This should be fixed when your browser updates to version 1.0.6 of the extension. Thanks for the report!\n. Hmm, trying to figure out how to handle this. I think this situation only happens once in a while when there are 1 or 2 blocks at the beginning and end of the timeline. \nUnfortunately, I think the only real solution is to make the blocks smaller. They are currently set to 12px and you can't use 11px because the iso library won't handle odd numbers, so you have to go to 10px which looks really small.\n\n. Yeah, this doesn't happen very often so I'm inclined to close it as well. :confused: \n. UUUGGGHHHH! \nI'll take a peek. If it's easy enough to update, I'll do it. Otherwise, I guess it'll fix itself tomorrow.\n. Boom.\n\nThis will update with 1.0.4. I should probably make this smarter about just using whatever colors the graph is using, but for now I've hardcoded these Halloween colors.\n. Yeah, this happens once in a while (see #27) and there's no good solution from what I can tell apart from making the graph much smaller.\n. Unfortunately the current permissions are needed so that the extension can be used on Enterprise installations. See #16.\n. This is needed for GitHub Enterprise support. See #16, #17, and #32.\n. The graphics here powered by the Obelisk.js library which doesn't include any HiDPI options (afaik). It probably doesn't make sense for it either since it is a pixel art library.\n. Thanks @montogeek. This is a known issue unfortunately. I looked into it a while back and wasn't able to make the extension re-initialize in this scenario due to how those tabs load via pjax calls.\nI'm going to close this for now, but would love to learn that this is actually possible.\n. Thanks @IgorAntun. I'm pretty happy with the existing README (especially the blank lines under the headings), but I think removing the $ from the command and adding the alt text to the image are good ideas. If you want to update this PR w/ just those things, that would be cool. Otherwise I can tackle those separately.\n. Derp, you're right @rileyjshaw – I scanned the diff incorrectly. I definitely think the $ should be omitted.\n. Since the alt text is the only thing ending up being changed here, I went ahead and made that update separately. I'm going to go ahead and close this, but thanks for the :eyes: @IgorAntun. \n. Thanks @asdofindia. Would you mind updating the README with instructions on how to install the Firefox extension?\n. I'm thinking it would be easiest for users if there was a separate top level firefox directory. I already have that pattern in place for Chrome and Safari. It's not ideal that there's a good bit of duplication, but I'm ok with it as long as there aren't a ton of browsers.\nIf we go that route, I'm thinking we revert the changes here and apply them only to the Firefox directory. I'm not very familiar with Firefox extensions, but the xpi file sounds like a good idea.\n. Other than that one typo, this looks great @asdofindia. Thanks for putting this together!\n. Wow, that's a heck of a streak! Thanks for the update. :sparkles:\n. Version 1.0.7 is now in the Chrome web store with this fix.\n. Nope, but feel free to fork this to try it out.\n. This has come up several times, but in order to allow the extension to work on GitHub Enterprise (which can be installed on any domain), this can't be done.\n. Oh nice, thanks for those links @doublerebel. ✨\n. I'd rather not add the extra option and complexity of rendering different size blocks. I haven't heard of anyone wanting them to be smaller.\nThe other changes seem solid though. 👍\n. I just noticed that this uses the same iso.coffee for all three browsers, but IIRC each has some different code in place for local storage. Were you able to coming up with something that works across the board?\n. :thumbsup:\n. Nice!\n. Ooof, sorry about that @joshcoales. I made a recent round of changes that must have broken FF. I'll take a look shortly.\n. Working on this in #49.\n. The new .xpi file should fix this problem.\n. Thanks, I'll take a look.\n. This is fixed in 1.0.10.\n. Awesome, thx @asdofindia!\n. I think this should be fixed with the latest version I posted yesterday (1.0.10). This is what I see on your profile:\n\nI'm going to close this for now, but feel free to reopen if you're still seeing the problem.\n. Yeah, unfortunately the extension only has access to the data in the chart going back a year.\n. There is some work going on with the contribution chart at GitHub, so I'm going to wait until things settle down before debugging much here.\n. I'm seeing 115 days for both of your streaks. If you're not seeing this, could you confirm that you have version 1.0.10 of the extension?\n\n. Very strange. I now see 116 for both streaks. The only difference I can see visually is that you have a green square for the current day on both screenshots and I've only seen your profile w/o a contribution for the current day. I'll keep an eye on your profile and try to see if the problem happens if/when the current day goes green.\n. Thanks for the extra info. I'm sort of at a loss for now, but let's keep an eye on it and see if any new clues emerge. Will leave this open for now.\n. Thanks @maasencioh, I was finally able to :eyes: this bug in action. \n. @cheshire137 Yeah, as we talked IRL, this was needed for supporting Enterprise. :(\n. This is intentionally not implemented because it would be impractical with so many columns being hidden behind others. \n. The chart isn't a true 3D model (it uses obelisk.js) and therefore can't be rotated.\nFrom the README:\n\nThis isn't meant to completely replace the standard 2D graph though, because in most ways it is actually less useful. For example, there are no axis labels, shorter bars can be hidden behind taller ones, you can't hover over a bar to see the day and count, etc.\n. Yeah sorry about that. I was hoping to have the extension updated and ready to go before we shipped the profile updates. I'll get to this soon.\n. This is mostly fixed (chart doesn't yet update on switching years) by @nallwhy in #56. 🎉 \n. Thanks for jumping on this @nallwhy. It looks good to me. The only other thing that needs fixed is having the isometric chart (and button options) stay when you select a different year. That could be done in a separate PR though.\n. Closed with #59.\n. The Chrome version will be in the store :soon:.\n. Nice! This seems to work really well. :heart:\n. Fixed in #86. The colors are meant to align with the standard contribution chart greens. What other colors were you thinking?\n. Yeah, I think it's best to stick with the standard green palette to avoid confusion.\n\nOn a related note, did you notice that we have our Halloween colors enabled today? 🎃 👻 \n\n. Apologies for this confusion. The current Safari version of the extension is very much out-of-date because you now need a paid Apple Developer account to build extensions. Since this is the only thing I'd use it for, I've decided not to spend the $99. I'll update the README with an explanation about this.\n. You can install the extension with Extension Builder (Safari > Develop > Extension Builder), but I think it'll only stay loaded for that Safari session. AFAIK, you still need the paid Apple Developer account to build the package so if you have one, you certainly can do so.\n. Thanks for the report!\n. To allow GitHub Enterprise users to use this plugin, I'm not able to restrict the domains that the plugin runs on (since it can be installed on any domain).\nI would, however, like to remove the jquery dependency. That's on my list, so I'm going to close this for now. Feel free to reopen if you like.. Wow, I'm not sure how I broke that! I imagine it's an easy fix though. I'll take a look shortly, but if you beat me to it, that's cool too.. I figured it out. It has to do with when we changed the size of the contribution squares a while back. I'll get a PR put together later today.\nThanks for reporting this!. The 3d chart will always show exactly the same data as the 2d chart. This extension doesn't have access to any data other than what is shown on GitHub's chart. Those year links along the side are from the GitHub side and don't have anything to do with this extension. . Thanks for this info @electron0zero. I'm not very familiar with Firefox's extensions and didn't realize the progress they'd made since last I looked.\nI've gone ahead and started the process of uploading the extension to addons.mozilla.org (ran into an error that I emailed them about) and, if I understand right, they will sign the .xpi on their end. If so, I assume I don't need to bother with the steps you listed here. Is that correct?. Ok, finally got the problem worked out and got the add-on submitted for review.. Looks like Mozilla is getting through about 7 add-ons per day in their reviewing. At this rate, they should get to mine in about a month and a half. 😒. Ok, 2 months later and I'm about 60% of the way through the approval queue. Pretty absurd.. I gave up on their process. By the time they got around to reviewing, the extension was several versions behind and no longer worked with GitHub's DOM structure. If things improve on their end at some point, I may try again but I'm too frustrated right now.. Sorry about this. I'll get the extension updated today. . I want to keep it fairly lightweight so no plans on making it interactive at this time. Since taller bars hide shorter ones behind them, it would probably be a frustrating experience anyhow.. I was going to suggest just scraping that element from the DOM, but since it's generated from an extension that won't work. I can't think of anything automated that would work, but if anything comes to mind I'll post it here.. Closing this for now, but will reopen if any ideas come to mind.. I tried submitting to AMO a while back (see #73), but it was incredibly frustrating. I don't have any plans at this time to try again.. :ghost: Gah, I dropped the ball on this again this year.\n@shadoath Could you make this change to src/iso.coffee? The file you changed is one of the generated files from that source file.\nThis reminds me, I need to port that file from coffeescript one of these days.. @shadoath Yeah, go ahead and commit those generated files too. I built them locally and it looks good! Thanks for the update!. The new version has been uploaded to the Chrome Web Store and should be available shortly.. @Pl4gue I'm not opposed to the idea, but I just want to make sure the amount of stats displayed doesn't get overwhelming.\nI'd rather not add another full-sized stat block like the others. Maybe something more subtle like this?\n\n. Sure, give it a try!\nOn Tue, Feb 20, 2018 at 5:23 PM David Wu notifications@github.com wrote:\n\nYeah I absolutely agree with you @jasonlong https://github.com/jasonlong\n😄\nYour idea sounds good 👍 So shall I try implementing it?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/jasonlong/isometric-contributions/issues/81#issuecomment-367141563,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AAAX2Mmig8DlcNzrOxsBnLXeedIQCtAlks5tW0XKgaJpZM4SJTzT\n.\n. Yeah just took a screenshot and played with it in Sketch.\n\nOn Fri, Feb 23, 2018 at 5:00 PM David Wu notifications@github.com wrote:\n\nSmall question: How did you do this quick small visual mockup in your\nfirst comment? Just plain photo editing?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/jasonlong/isometric-contributions/issues/81#issuecomment-368150948,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AAAX2LD9NGujjCJ3l1R-zzEjdkCttviKks5tXzUPgaJpZM4SJTzT\n.\n. Ahh good point. This looks good to me. I'll get a new release built after merging shortly. :thumbsup:\n\nThanks for the contribution. 😸 . Wow very cool, thanks @HelloWorld017! I will give this a try soon and I'll be happy to merge it if it works ok.. @HelloWorld017 I verified that the userscript works great on Chrome w/ Tampermonkey, but I'm having trouble with Safari and Firefox.\nI'm using Safari w/ Tampermonkey and it shows as enabled, but the chart doesn't render.\n\nIn Firefox, I tried Greasemonkey and it's not working either. (Ignore the \"Unnamed Script\" naming).\n\nI haven't used userscripts very much in the past, so these problems could definitely be user error. 😜\n. Sorry for the delay @HelloWorld017. I confirmed that Firefox/Greasemonkey now works great.\nI still don't see it working in Safari/Tampermonkey for some reason. Any ideas?\n\n. I attempted some more debugging today and ended up more confused. \nThere are no console errors, but digging further, I realized that the script isn't even running in Safari. I started a brand new minimal script that targets github.com and it doesn't run. I changed the same script to target cnn.com and it does run.\nSo something seems to be unique to github.com, but that doesn't make much sense either because I'm using Tampermonkey in Chrome as well and it works fine there.\nI'm going to be out of town this week, so I won't have any more time to look into this, but will take a look when I get back. Unless someone else beats me to it! 😄 . Closing this for now, but feel free to reopen.. Yeah I wish I could get the full streak, but if it’s longer than a year the extension can’t see it. I only have access to the contributions on the page. . It’s possible by paginating through previous years with additional requests. I’m not interested in this tbh and have considered removing streaks from the extension altogether. . Basically for the same reasons we removed streaks on github.com. We don't want to encourage people to string together endless days of work as it's not a healthy behavior. Besides, it's an easy metric to game and ultimately doesn't mean much.. Hey this is great, thanks @rijn!. This looks great. Thanks for the fix @ttop5!. Thanks for the report. I'll get this fixed up soon.. Fixed with #87 . Thanks for the report @schwartzadev. I'll take a look at this shortly.. As mentioned in #94, I'd like to keep the semi-bold for now.. Thanks for the PR, but I'm going to keep the semi-bold at this time.. Yikes, thanks for that report. I hadn't even noticed that.. Nice! Thanks for the contribution @brandon1024. I'm going to merge this and then will follow up with the compiled versions and new release.. Hey @brandon1024, I appreciate the contribution but I’d prefer to keep the color palette consistent with the GitHub UI at this point. \nIf you prefer the additional color options, you could always continue to use your own version locally though!. Thanks for the report @samjudge. I'll check this out soon.. Sorry, I haven't had a chance to dig into this yet. I believe FF has improved their add-on system recently so I'll try to revisit this soon.\nPRs welcome if anyone else wants to check into it :). Small typo - should be jasonlong.me 😄 \n. Let's kill the color rule here and have the default GitHub body color come through (#24292e). \nRelated: this is a great tip.. ",
    "nosir": "awesome!\n. ",
    "andrew": "It's already updated and working for me, thanks @jasonlong!\n. ",
    "tarebyte": "I don't have any rules, so I cleared out my Chrome's cache and it seems to work ok. I'll let you know if I run into anything else.\n. ",
    "ioana-chiorean": ":( \n. :tada:\n. ",
    "asdofindia": "@jasonlong, Firefox is adding web-extensions support. \nBut as of now, storage.local is not supported in content scripts.\nI can make this working in Firefox 44 with only very few modifications (removing chrome.storage.local is the modification. And that removes the memory of the extension :( )\nCheckout d1a41ad25ad6228a1437e3b23992e871fae14f34\n. @jasonlong yes, I can add instructions. But need some info.\nShould I add an xpi file and save people the trouble of packaging it themselves? \nIf yes, how to organize the folder?\n. I've put everything in a folder inside firefox folder and then put the xpi file inside the firefox folder. I've also added some instructions in readme. (Unfortunately, addons.mozilla.org is not accepting web extensions at the moment and therefore we can't submit it there yet) \nIf you're even slightly less than happy, let me know what to fix :)\n. Ah, sorry for that. :P Updated the branch.\n. Hey, everything is fine except a small problem in the build script. Firefox expects the xpi to have the files directly and not inside a top level directory.\nCheckout bfec0b230cd3f70820cdfef370055662ca52fa3f\n. ",
    "rileyjshaw": "Wow @asdofindia this is fantastic!!!!!\n:tada: :tada: :tada:\n. It looks to me like a $ was added here. This seems like an antipattern; people often copy the  $ along with the rest of the command by accident. I've found that a clearer pattern is:\n\nIn your terminal, type:\ncoffee -cb iso.coffee\n. \n",
    "bahlo": "That's great, no hurry. :beers:\n. 🎉. Hey @jasonlong, I can not reproduce this, but the only thing I could imagine is that this is not correctly assigned.\nMaybe try to replace -> with => in the MutationObserver and the forEach callback respectively in CoffeeScript. This binds the functions to the Iso class (more info here).\n. ",
    "MasseGuillaume": "you can rotate :-)\n. ",
    "esbanarango": ":+1: \n. ",
    "bsdlp": "\nwoohoo! :+1: @jasonlong \n. ",
    "troyswanson": "Roger that. Thanks for the reply.\n. ",
    "ericduran": "Hmm, I just found https://github.com/jasonlong/isometric-contributions/commit/7a99f6a26d3c6b9ff8d4e61c3a6f9c6b47ed31aa,\n:-/\nI'm going to leave this issue open incase anyone else see this.\n. ",
    "muan": ":heart:\n. It doesn't seem to be working for me in 0.8.10. :cry: Is it just me?\n\n. It works!!! <3 Thank you.\n. Not sure what happened :cry: stopped working again.\n\n\n. :sparkles:\n. I took a look, seems like it happens when the graph is displaying 54 weeks instead of the usual 53 weeks. I can't find a good fix either. :pensive: feel free to just close this. :turtle:\n. :sparkles: :boom: yay\n. ",
    "bryceglass": "@jasonlong is that control supposed to show on everyone's profile, or only mine? I'm only seeing it on mine. It doesn't appear on anyone else's even after a hard refresh. (But now I'm thinking that maybe that's by design?)\n. ",
    "wbolster": "okay, that explains. would be nice if there was a better way. anyway, thanks for the explanation.\n. ",
    "montogeek": "Thanks @jasonlong I will take a look how we can do this!\n. ",
    "igorantun": "No problem :)\n. ",
    "KimDarren": "Thx to merge my request :+1: \n. My commits are generated by git-faker :smile: \n. ",
    "doublerebel": "OK I can use another solution.  For anyone else looking, there is an open issue for Chromium to restrict individual extensions (go star it!) and until then there is an extension to enable/disable extensions.\n. ",
    "deltaidea": "Agreed, no problem, I'll tidy up this PR and leave the block size setting in my fork. :+1: \n. I used a modified version of what Firefox has now. It uses chrome.storage when available with a fallback to localStorage.\nSince this is the only difference (I diffed all three versions), I think it's a good idea to have a single common iso.coffee.\n. ",
    "EricFreeman": "It doesn't go back further than a year like the old GitHub streaks would, but I guess this will scratch the itch for now.  ;)\n. ",
    "dgw": "I just installed the extension today, and I am seeing \"0 days\", \"null – null\" for my longest streak as well. Is this the same or a new issue?\nMy entire calendar is full, as my streak started last July (2015).\nChrome 52 (currently bothering me to auto-update to 53), OS X 10.10.5\n. Update: Worked after midnight until I added a contribution for the new day, then went back to displaying \"null\"s.\n. ",
    "Crossroadsman": "Hi Jason,\nThanks for the response. I can confirm that according to the Chrome extensions menu, I am running 1.0.10. Please see attached.\n\n\n\n. Sounds good. Let me know if there's anything I can test on my end.\n. Now I'm wondering if the weirdness is on Github's end rather than the extension. I'm looking at yesterday's activity and this is what I see (zero contributions per the graph, but 1 contribution in the text immediately below):\n\nI see the same thing on Chrome and Safari with your extension, and Safari Technology Preview without the extension. Weird.\n. Sounds good.\nThanks\n. ",
    "mkermani144": "I have the same issue with Chrome version 49 on Ubuntu.\n. :+1: \n. ",
    "maasencioh": "Hello, for the user targos you can see also this issue, I'm currently using the version 1.0.12\n\n. ",
    "prabhakar267": "So I think user should be given an option to rotate the whole graph so that he could see all the contributions!\nOr the tooltip should be shown based on the location of the base of the column because if he wants to see the count to get an idea to relate the height of column to number of contributions, he has to change the view and then see the actual count.\n. ",
    "xwartz": "+1\n. ",
    "nallwhy": "@jasonlong I created pull request for this problem.\n. @jasonlong I'm so happy to contribute to this awesome product!\n. ",
    "Sinequanonh": "Thank you, good job!\n. ",
    "hereisnaman": "Yeah it will be really good to have that feature. Need to configure it with cookies.. ",
    "Graystripe17": "Maybe purple or yellow. I realize that's not the standard Github theme, so this idea does not have to be implemented.\n. Actually you can close this issue it won't hurt my feelings. I'm new at contributing to other repositories.\n. ",
    "TennyZhuang": "Can I build it for myself using the source code ?\nOn Mon, 31 Oct 2016 at 21:20 Jason Long notifications@github.com wrote:\n\nApologies for this confusion. The current Safari version of the extension\nis very much out-of-date because you now need a paid Apple Developer\naccount to build extensions. Since this is the only thing I'd use it for,\nI've decided not to spend the $99. I'll update the README with an\nexplanation about this.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/jasonlong/isometric-contributions/issues/64#issuecomment-257291384,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AIvK3gYeqr3WC2y2eSAQ0ghxrWh_QJwzks5q5esHgaJpZM4Kkap8\n.\n. \n",
    "orn688": "I'd be happy to look into this, though I haven't contributed to this project before and have very little prior experience with Chrome extensions, so I can't promise I'll be able to fix anything in a timely manner.. No problem, thanks for fixing it!. ",
    "electron0zero": "@jasonlong I realised that during the process of signing it got uploaded to my account and it has a UUID of isometric-contributions@jasonlong.me so I deleted it now.\nI think that error was due to that. \ncan you please retry with above-listed steps and check your email that you have used in firefox account that you used in generating keys for signing this add-on. you will have an email from amo-editors@mozilla.org about this add-on.\n. @jasonlong please update us with the link when gets approved.\nThanks for taking the time to look into it.\n. ",
    "marsjaninzmarsa": "Any update?. ",
    "huozhi": "Seems that github's revision cause the problem.\ncoffee\nCOLORS = [\n    new obelisk.CubeColor().getByHorizontalColor(0xeeeeee),\n    new obelisk.CubeColor().getByHorizontalColor(0xd6e685),\n    new obelisk.CubeColor().getByHorizontalColor(0x8cc665),\n    new obelisk.CubeColor().getByHorizontalColor(0x44a340),\n    new obelisk.CubeColor().getByHorizontalColor(0x1e6823)\n  ]\nThe code above should be updated now.. @jasonlong fast responding! awesome. 👏. ",
    "mrdulin": "@huozhi Thanks. I guess the reason is github modify its theme.. ",
    "shadoath": "@jasonlong the src/iso.coffee is now updated. \nDo you want a compiled updates to be added as well? I have coffee 2.0.2 installed but I see you have coffee 1.10.0 used for the last build.. \nHalloween Magic!. ",
    "strikemike2k": "Yes! I woke up this morning and was disappointed to see a non-colored isometric contributions display. I'm glad to see this being updated to support the awesome Halloween colors!. ",
    "flxwu": "Yeah I absolutely agree with you @jasonlong 😄 \nYour idea sounds good 👍 So shall I try implementing it?. Alright 😃 Will be starting by the new week :). Side question: How did you do this quick small visual mockup in your first comment? Just plain photo editing?. Just applied the change, but I cannot kill the color rule as it would inherit the #777777 from .ic-stats-label. Hey @jasonlong , thanks a lot for sharing this article, it was really interesting to read :slightly_smiling_face: . ",
    "HelloWorld017": "Thanks!\n~~Also, before merge, adding update link to the userscript would be good!~~\nUpdated:\nThe documentation says\n\nIt is unusual to specify this value. Most scripts should omit it.. I've installed firefox and just removed run-at document-body statement, which is only available in Tampermonkey and not available in Greasemonkey. :D\n\nThank you for finding out the issue!. Sorry for late answer T_T\nI really want to check that issue, but I have no mac to test on Safari.\nWould you check if there are errors on browser console?. ",
    "ljharb": "Then how can the other chrome extension see it? It’s clearly possible.. Gotcha. That’s unfortunate, why?. i think that’s an incredibly paternalistic and patronizing attitude - open source may be work for some, but it’s a daily hobby/joy/meditation/practice for others like myself.\nWhat it means is subjective, and it’s ease to game is exactly why it can be a personal point of pride to not do so. It’d be fine if a user wanted to hide the streak, or if t was hidden by default, but it should also be fine for a user to show it if they want to.\nI’d certainly suggest removing streak data from the extension if you’re not going to display it accurately, thanks for the discussion.. ",
    "rijn": "\n. ",
    "shroudedcode": "Same here, the feature also kind of breaks the layout and the Hide normal chart button no longer does anything.. ",
    "hzb": "@jasonlong Welcome :). ",
    "beta": "In my situation the Sunday row is gone, and the bars are lower than other rows.\nChrome version: 69.0.3497.100 (Official Build) (64-bit)\nSystem version: macOS High Sierra 10.13.1\nIsometric Contributions version: 1.0.24\n\n. ",
    "JideGuru": "Same happens to me. any fix?. ",
    "brandon1024": "Just realized this might create an invalid color code if COLORS[this.colors][2] needs to be padded. I will address this asap.. "
}