{
    "jaunesarmiento": "Fixed on branch wip-1.0.0\n. Hi @Wolfr, yes I've already included this in the current WIP version. You can check it out by pulling the wip-1.0.1 branch then just view the examples bundled with it. :)\n. Yes I guess I'll do that then. Thanks!\nNotes: Implemented on version 1.0.1. Use <i class=\"icon-up-button\"></i> to render the up/back chevron.\n. Hi @Mtillmann, does gfx perform well on the mobile browser? The only problem with it is its dependency to jQuery which I'm trying to stay away from. \nI'll read gfx's source to check how they do their animations and maybe port it over to Fries.\nThanks!\n. I'm a bit confused here. You're saying that we should use CSS transitions when in fact the animations in Fries are all done via CSS. The only time I use JS with the animations is when I need to add/remove a class that does the animations.\n. Closing this for now due to lack of information.\n. Yes, this is part of the plan for Fries. I'm still thinking which CSS preprocessor to use. But I'm going to lean towards the more widely used preprocessor.\n. Okay, I've started working on the \"Holo Dark\" theme using SASS. This will be included in version 1.0.1 of Fries.\n. I'd love to hear what others think. Compass seems to be more popular, yes?\n. Already implemented on wip-1.0.1 branch.\n. You're welcome. :)\n. Hi @aymanfarhat, I think you are using the documentation version of action-bars.js. The debug variable was only added to the global scope (in docs.js) and checked in action-bars.js to force the checking of action overflows in the documentation demo.\nI suggest that you download the latest version of Fries (https://github.com/jaunesarmiento/fries/tree/1.0.0) and use the JS files in the /lib folder.\nI hope that answers your question. Cheers!\n. That's good to hear. Have fun coding! :)\n. Hi @aymanfarhat, the JavaScript library of Fries uses touch events that's why it doesn't work on your desktop browser. I'm still working on catching clicks and converting them to touch events.\nIn the meantime, kindly use a library that converts click events to touch events. Or a more hacky solution is to edit Fries' JavaScript files and replace touchstart or touchend to click.\nHope that helps!\n. Alright cheers! :)\n. Oh, right. I completely forgot about that. Yes, that's the least hacky way to do it.\n. You may add the data attribute data-ignore=\"true\" to your links so stack.js ignores them. :)\n. Really? That's odd. I'm pretty sure I only call preventDefault() after it has checked the data-ignore data attribute. I'll take a look at the code later today when I get the time.\n. Thanks @aymanfarhat!\n. Hi @OZZlE, I'm aware of the layout issues on Firefox. I didn't really optimize Fries on Firefox because Android devices don't ship with it. And it would be pointless to optimize on Firefox since Fries was meant to be used as a prototyping tool on Android and Android uses WebKit as its rendering engine. I'd suggest using Chrome or Safari when viewing the examples or testing your prototypes.\nAnd for point number 2: as stated above, this is a non-issue when testing on Chrome/Safari.\nI'm really sorry but I won't be optimizing for Firefox. You can however fork the repo and maybe do the optimization yourself.\nCheers!\n. Oops, forgot to replace that when I removed the wip-1.0.0 branch. Good eye @Wolfr. Cheers!\n. Done implementing radio buttons and on/off switches on wip-1.0.1 branch. Check it out. :)\n. Oops, I forgot to merge the branch with wip-1.0.1. I did a merge just now. Just pull the changes then check out /examples/new-contact.html to see the radio buttons.\n. The switches needs testing on an Android device. I still don't have one so I can't test these right now. Will only close this issue once these have been tested on an Android device.\n. Great! Thanks @Wolfr. :)\n. Just pull the latest wip-1.0.1 branch and check out /examples/new-contact.html for the markup. :)\n. The weird flash above the switch is probably caused by the :active state highlight. Just need to position it correctly.\nAs for the swiping of on/off switch, I haven't done that yet. Will need a js component for that.\nI think I'll have to change the markup a bit and the styles. Damn, I overlooked that one. It's really hard to see everything without a device lol.\n\nOff topic: the video was captured using Screencast app. You can download it from Google Play.\n. Here's the link: https://play.google.com/store/apps/details?id=com.ms.screencastfree\nI'm just using the demo version.\n. Oh right, I forgot about that. Sorry. >.<\n. Cool, thanks @teusinkorg!\n. Dude, your jpHolo is smashing! :) Great job on it.\nI'm kinda confused with this:\n- Tablet: 48,76 px\nCan you elaborate that? Is that 48 and 76/100 pixels on landscaped tablet?\nAlso, this might be useful for us both: http://petrnohejl.github.io/Android-Cheatsheet-For-Graphic-Designers/#action-bar-height\n. Right, centimeter. :)\nIf you read the guidelines on that link real quick, you'll see that the heights on different orientation and devices matches the ones I posted here. I'll probably just stick to that. :)\nSame thing for me. I am a bit of a perfectionist as well. That is also why I hated other mobile UI frameworks cough KendoUI cough out there.\nCool, thanks! Will definitely check out how you did the navigation drawers and maybe port it over to Fries. :+1: \n. I believe index.html works fine on Firefox. It's just that Fries is not optimized for it thus having layout issues. \nAlso, I won't be accepting pull requests to version 1.0.0 from here on. Please checkout wip-1.0.1 branch and do your changes there.\n. Hi @MiguelBel, can you provide a test case where this happens? Maybe post the markup where the text overflows. Also please fix your commit message before doing a pull request. Cheers! :)\n. Ahh I see. This merits to be in version 1.0.0 then. Thanks @MiguelBel! :) Will include this in version 1.0.1 as well.\n. I'm not really sure how the logout icon for Android looks like. Mind posting a screenshot or a link to the icon? Also I found this: http://www.spiderflyapps.com/downloads/android-developer-icons-the-font/. Tell me if it has the logout icon so we can extend the current font icon with this one.\n. I'll have a look at it. Thanks bud!\n. Hi @jadjoubran, I noticed two things on your implementation of Toast notifications:\n- Toast notifications are always centered unless otherwise stated in the code via the Gravity and x and y offset, which your implementation is having a problem with. When you resize the browser, the position of the notification gets broken.\n- Almost every box UI element in Android has a border-radius of 2px. Yours has 3px which makes the Toast look a bit awkward.\nA few things you might want to consider:\n- Convert your codebase into a class so we can call it as var toast = new Toast();\n- Add options where one can set the content, position, and the duration of the Toast notification. \nNonetheless, great suggestion. I wasn't really thinking of adding Toast notifications since you can just use the PhoneGap plugin which is implemented natively.\n. - I'm pretty sure I saw a JavaScript library that centers just about anything. I'll post it here when I find it. I think this will be the optimal solution to this centering problem since you'll be using JS anyway.\n- Toasts can be positioned at the top of the screen if I remember correctly.\n- Oh, I wasn't aware that it can't be used if you're building through PhoneGap Build.\nThen I guess this can be added to the next release. :)\n. Looks great! :)\n. Yes, I'll be including this on version 1.0.1. :)\nThere are a few things I want changed before I include this as a component though:\n1. I'd like this to follow the CamelCase coding style in JavaScript. So Android_Toast should be converted to AndroidToast and methods like set_duration should be setDuration. I want this implemented to provide coding style consistency.\n2. In Fries, CSS classes and ids that have more than one word are separated by a dash -.\n3. And further testing on other devices. :)\n. Or the following:\n``` javascript\n// If we're using fries namespace, do:\n// var fries = window.fries || {};\n(function () {\n  var Toast = function (options) {\n    this.init(options);\n  }\nToast.prototype = {\n    _defaults: {\n      // default options here\n    },\n    init: function (options) {\n      // merge user options with defaults\n      // show the Toast\n      // then hide Toast after a while\n      this.destroy(); // then destroy it\n    },\n    destroy: function () {\n      // destroy Toast here\n    }\n  };\n// Then expose it in window or Fries namespace\n  window.Toast = Toast;\n  // or fries.Toast = Toast;\n}());\n```\n. Hi @captn3m0, are you referring to Android Dialogs (http://developer.android.com/design/building-blocks/dialogs.html)?\n. Yes I'm planning to add this along with modals. :) This will probably be included in the next next release (v1.0.2) of Fries. Cheers!\n. Closing this and referencing it to #48.\n. That's really great @aymanfarhat! +1 to this. I was planning to add this feature to tabs.js a while back.\nYes, I'd love to see what people are doing with Fries. I'll send you an email. Cheers!\n. Hi @aymanfarhat, I'm aware of this issue and has fixed it in the current wip version. The fix was adding event.preventDefault() to tabs.js. Please have a look at this commit: https://github.com/jaunesarmiento/fries/commit/03bf6a3de062618f0378288a307c1ecddbf01508\n. The issue was caused by tabs.js appending the #href to the address bar, causing stack.js to pop these first.\n. Won't event.stopPropagation() work? Maybe call it after calling event.preventDefault()?\n. That is really odd. I really can't work on it at the moment due to the lack of an Android phone. I will however be able to buy one within the week. You can try to find a solution to this if it's not too much to ask from you.\n. Great, thanks @aymanfarhat! :)\n. Oops, forgot to close this issue. This is already fixed in the wip-1.0.1 branch.\n. Actually, Fries fires a push event whenever you push a new page to the DOM. What you can do for now is to catch this event and attach your event handlers from there.\nI really like your second suggestion but I still don't see the need of jQuery style selector module. Let's discuss this further. :)\n. Not doing this anytime soon. Focusing on other features.\n. Hi @mohitjain, as of now there are no plans to add a pull-to-refresh functionality to fries as it can be done using other libraries. And implementing such feature requires a bit more time than the rest of the features. Maybe you can check out cubiq iScroll4 with pull to refresh (http://cubiq.org/iscroll-4) and restyle it in an Android-y way.\nAs for the refresh icon, yes I'll be adding more icons to the current ones cause I've noticed that it's incomplete.\n. Will consider this. :)\n. Alright then. Will include it in the next version. I'll be registering this to bower. Cheers!\n. You're welcome. :)\n. Registered to Bower. Do bower install fries to install.\n. Referencing this in issue #17 \n. Hi @aymanfarhat, as of now there is no such pattern to achieve this. You can however save these parameters in a global variable, catch the push event that stack.js fires, and then using the parameters from there. This may not be the best solution to this.\nI'm open to suggestions on how to implement this or if we even should implement it at all. I also think this could be a great addition to Fries since I'm not just aiming to make Fries a prototyping tool.\n. I believe this is related to #26.\n. Hi @joelstahre, I'm sorry for the late response. Either the browser of the phone you're using does not support CSS flexbox layout or we'd have to work on the CSS styles of the tab bar. Please give more details about your test environment like OS version, model of the phone, etc.\nCheers!\n. @aboudard Great thanks! :)\nAbout handling gestures, off-topic but yes. I'm planning to add that feature. Actually, @aymanfarhat (https://github.com/aymanfarhat) has already done a prototype of that. Although there are still some quirks that are needed to be done like the dragging behavior.\n. Wow. I'm guessing this is a rendering issue on Galaxy S4 but I'm not 100% sure. If anybody else can replicate this issue on their S4, then I guess it'll be safe to say that it's a rendering issue. I'll check if the Samsung changed something in the browser for S4 phones, maybe that'll clear a few things out.\nBecause I have been testing Fries on Google Nexus S which is a relatively old phone and I haven't encountered an issue such as this.\nThanks for reporting this. :)\n. After a dozen of searches regarding any change to the stock browser of Samsung Galaxy S4, I found out that it's using Chrome 18 as its stock browser based on this post. Whether this true or not, somebody has to test it.\nOn another note, I can try to mix the old and new syntax of flexbox layout for the tabs. The current implementation of this on Fries uses the old syntax display: box and display: -webkit-box. So I think adding in the new syntax might solve this but I really can't test it on an S4. Maybe someone else can test it. \n. On second thought, it may not be the flexbox layout that's the problem. Hmm..\n. I'm labeling this as a device-related issue on the Galaxy S4. I definitely want to understand more of this problem but sadly, I don't have an S4. I haven't had any issues with the layout before S4 came out.\n. Hi @gregavola, are you using a GS4? As I said in my previous comment, I don't have an S4 where I can test this issue on. But from the looks of it, the problem seemed to have occurred because of translate3d. But since other Android devices don't have any problems with rendering, the culprit must be the default browser that S4s use to render a webview.\n. Thanks for the note @andywhite37. \n. Hi @BR41N1, yes this is an issue and I'm still thinking of an elegant solution for it. I suggest testing your pages using Google Chrome with emulated touch events for now by following these steps:\n1. Open Developer Console\n2. Click the gear icon on the lower right corner\n3. Click Overrides\n4. Then check Emulate touch events\nI'll be closing this and will be opening an issue with more details about this.\nThanks!\n. Wow @jadjoubran, this is great! Also I think you'll be needing to add the touchmove events as well. :)\n. Sorry to hear that. I'm really working hard to get these issues off the list.\n. I'll be looking forward to it :)\n. I pushed a branch that solves this issue. Please check out https://github.com/jaunesarmiento/fries/tree/fix-for-issue33 for this.\nThe only problem that I encountered with this is that the default behaviour of labels do not work, which is an issue for form elements. Anybody want to try fixing this issue on that branch? :)\n. Workaround: Use fingerblast.js.\n. Hi @KyleMorgan49, I can't seem to find what the \"menu\" icon looks like on Android. Do you mind providing a screenshot of the icon?\nThe current iconset includes the following icons from the original repo: http://turbo87.github.io/Android-Action-Bar-Icon-Pack-Font/ Please note that the class names may differ from this list.\n. Also, I'm having issues regarding the licensing of the Android official icons and @turbo87 's Action Bar Icon Pack Font. I'm thinking of redoing the icon font myself and licensing it using MIT so Fries users don't need to attribute them to the original author.\nThe Android official icons are (I believe) licensed under Creative Commons 2.5. Which is annoying cause you have to attribute it to the Android Open Source Project.\nAny thoughts about this?\n. Oops, sorry. I misread your post. I didn't see the \"three horizontal lines\". Got it.\n. I meant redoing the font iconset from SVG and converting them into a font and release it under MIT. So Fries users can just attribute their works to the Android Open Source Project instead of having to put so many licensing stuff on their work. I'm not sure if that's possible though.\n. @Turbo87, yes I'm having the same issues as you are right now. I don't have the time (yet) to research on the matter but I'd be more than willing to be less restrictive on this matter as well. But as far as Fries is concerned, I think I already made the changes I need to do to both the website (documentation) and the README to properly attribute the icons to the Android Open Source Project and to you. If this however does not suffice your requirements for attribution, please by all means, tell me so I can make the changes.\n. Alright man, cool. :) Thanks for clarifying this. Cheers!\n. Couldn't find a more complete icon set. Closing this for now.\n. Hi there @aboudard, no I believe this is not \"normal\". What version of Fries are you using?\n. Alright. Can you try doing a console.log() inside the code where you try to catch the back button? I'm very willing to help you with your problem. :)\n. But will the app still exit if you press the back button on index.html?\nEdit: I currently don't have an Android phone right now that's why I'm asking. xD\n. Hmm. That's odd. Is there any particular reason why you're catching the back button functionality? Cause when I tested this, I never had to catch the back button and still it works fine.\nBy the way, the style on other pages does not load if stack.js fails to load properly in index.html.\n. Thanks @aymanfarhat. I couldn't test the problem.\n@aboudard you could also try to build and install https://github.com/jaunesarmiento/HelloFries on your device. That project was made using ./create <project_folder_path> <package_name> <project_name> command from the Cordova Android distribution.\n. Back button seems to be working fine on v2.0.0\n. Oops, sorry about that. Thanks @BR41N1! :)\n. It is here. :) It's on the gh-pages branch.\n. Needs testing on an Android device.\n. Hi @aymanfarhat, I've been thinking of the same workflow when I stumbled upon https://build.phonegap.com again recently. Although to have this kind of workflow, we'll have to move a lot of things around which may cause a little confusion for the existing user base.\n. Testing on the browser is fine for now.\n. Don't mind the large number of deletions. I accidentally committed the styles for a themed version of Fries. :)\n. Hi @shuaishuai, nope I won't be adding RequireJS to handle modularization in Fries. The framework is already too deep into the development of version 1.0.1. I can however reconsider this for the later versions of Fries.\n. @shuaishuai I'd rather use RequireJS. It's a much more elegant solution rather than having Fries components in the window variable.\n@Wolfr, I think the best approach would be to use BEM method which, correct me if I'm wrong, being used by those mentioned frameworks. Actually, I've been thinking about redoing Fries from scratch yet again due to these kinds of concerns. I honestly wasn't able to think this through in a long-term context. But I really love having these kinds of conversations. Fries is still young, I think, so a lot can still change.\n. Will add it to the next version. :)\n. Hi @florindumitru, yes Fries does not execute any scripts from the loaded page. You must add your scripts to index.html and listen for events there.\n. Here's a little something on how to do this, you must catch the push event that stack.js fires whenever a page gets pushed onto the screen.\nSo given that you have an inner page like this:\n<div id=\"page2\" class=\"page\">\n  <!-- some content here -->\n</div>\nYou just need to do the following in your index.html:\n<script type=\"text/javascript\">\nwindow.addEventListener('push', function () {\n  if (document.getElementById('page2')) {\n    console.log('We are on page 2');\n    // do what you want here\n  }\n});\n</script>\nThis may not be the best solution but I think this will work for now. @aymanfarhat and I have already had a few discussions on how to hook code when loading a new page. I think this is something that should really be included in Fries.\nAnd no, I actually haven't tested Fries on iOS. And I believe it won't work on Android 2.2 due to its stock browser being outdated.\n. Wrong pull request\n. I didn't notice this when I was testing on Samsung Galaxy S2. Can anybody else confirm this?\n. I'll be getting an Android phone next week. Will test this as soon as I get one. As of now, I really don't have anything to test it on.\n. Hi @jadjoubran, I've tested this on a Nexus 4. And I'm not experiencing the issue you're stating.\n. Seem to be working fine on mine. Closing this.\n. TODO: add an example of the dialog on index.html\n. I still haven't decided on which to use LOL. Now that you've mentioned it, I'll see which available mixins are viable. :)\n. Hi @teusinkorg. Yes I've been meaning to add this feature a while back. I already have a candidate library to port over to Fries. You may want to check Snap.js as it implements this fairly simple, it's widely used in Ratchet prototypes and the development is active. :)\n. Yes I know. :) What I meant is that the core functionality of the navigation drawer is implemented in Snap.js. I think you can expect this feature on the version 1.0.1.\nCheers!\n. Hi @grobmeier, sorry if it was a misleading for you. But Tobias didn't ask for attribution for his work. His repository (https://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font) does not even have a license.txt file or any licensing of some sort. He did mention that parts of his work contain modifications of the original Android icons. Thus the only attribution I need to make was to the Android Open Source Project.\nIf you asked Tobias directly for his permission to use the fonts then by all means please let me know.\n. @grobmeier yes I've read it. Until Tobias states how he should be attributed to the work, I won't make any changes to the attribution part of my README because I am still in compliance to it. Google only asks that I should add \"Portions of this page are modifications based on work created and shared by Google and used according to terms described in the Creative Commons 3.0 Attribution License.\" so yeah.\n. Was talking about Google's license. I didn't notice that they updated to CC 3.0.\nAnyway, I'll be updating the README and the website shortly.\nThanks!\n. Fixed.\n. Related to issue #31.\n. Hi @soomtong, thanks for the contribution. :) I was planning to add this but I forgot to do so.\n. I'll also update the docs with this. Thanks again!\n. Hi @xpose2000, I've been aware of the issue since I got a hold of a phone lately but I haven't got the chance to find a work around for it. \nI'll look into it tomorrow ;-) I'll try your suggestion as well. Cheers! \n. This issue is related to these:\n- http://stackoverflow.com/questions/13219017/ghostclicks-in-mobile-apps\n- http://stackoverflow.com/questions/13064418/mobile-fast-click-prevent-ghost-focus\n. Although it seems that this doesn't happen on version 2.0.0. Can anyone else test this? Here's a sample Phonegap app using Fries: https://github.com/jaunesarmiento/fries-phonegap\n. Hi @vishnu123. Unfortunately Fries has only been tested on devices that I got a hold of. And all of them are on Android 4.0 and above.\nSo yes, Fries only supports 4.0 and above (for now, I guess). I'm still thinking of bringing support to lower versions of Android but I doubt that everything will work though.\nAs for the changes required, since I don't have a device with Android 2+, I'm not sure how it can be tweaked to make it work. I'm really sorry about this.\n. Apparently, this issue is valid. I've received an email asking how this can be fixed. A discussion going on here seemed to have fixed this issue. Just need someone to try and test if it works.\n. Hi @hackersysCG, cool thanks! Yes, I'd love that. Will work on a fix for now based on the links posted above. I'll give you a nudge when it's done. :)\n. Hi @hackersysCG, can you confirm if http://filamentgroup.github.io/Overthrow/ scrolls on your mobile browser?\n. I think that might be a little hard to do as those Android versions' browsers only have partial support for the flexbox layout. And that should be discussed in a different thread. :)\n. I'll create a separate thread for those issues first.\n. Oops\n. Hi @hell03610, is there any reason you need the current url in your prototype? Because unless you do, I think this bug is harmless to your prototype but yes, this is considered a bug and I'll try to fix it. Thanks!\n. That's odd. I'll check the difference between master and wip branch again. Thanks for reporting Emma. \n. It appears that this happens on Ratchet as well. So I'm going to close this for now as it doesn't seem like a real problem to us.\n. Related to #26.\n. Will be fixed on next push. :) Thanks!\n. Wow @bernatfortet, I never thought of that. Thanks for this. This can be used to make testing easier as well.\n. Hi @EltonZhang13, what version of Fries are you using? Because I'm pretty sure that this was fixed on wip-1.0.1 branch.\n. Sure thing. The problem was that in the master branch, the action overflows aren't re-initialized when the push event is called. If you check action-bars.js in wip-1.0.1 branch, you'll see the following line:\njavascript\nwindow.addEventListener('push', checkActionOverflow, false);\nThat line handles the reinitialization of the action overflows when a page is pushed onto the history stack. :)\nHope that clears things up for you.\n. No problem bud. :) Glad to help.\n. Fixed\n. Hi @markusthoemmes, thanks for reminding me. I was planning to add this to the documentation but since the next version is not up for release yet, I didn't include it yet. Will add on the next version.\nCheers!\n. Included in version 2.0.0 docs.\n. Hi @jituiitm, on what platform are you testing? Desktop Chrome or on your mobile device? Would help if you'd post how you're doing the radios and toggles.\n. That's odd. Hmm. On what device and Android version are you testing the Phonegap app on? Can't do skype/hangout right now unfortunately. I'll check this on my end. Will keep you posted.\n. I can confirm that the on/off switches and radio buttons does not work on desktop. But I've tried them on https://github.com/jaunesarmiento/fries-phonegap and they work fine. Can you try running this example on your device? It's a Phonegap app btw.\n. Alright cool, thanks @jituiitm!\n. For tabs, the first step that should be done is to find out which syntax of the flexbox layout is supported in Android versions lower than 4.0, then we can try and fix that. @hackersysCG, if you can play around with the examples and change the flexbox layout syntax for the tabs component, that'd be awesome.\n. Related to #68. Thanks for bringing this up. Will work on this along with issue #68. I'm looking for a few ways to implement this. I'm thinking of adding a data-attribute to the .page that tells stack.js that the page is at root level and should clear the history when it's encountered. What do you think?\n. It's not yet a solution, @berthojoris. I'm just throwing in ideas on how to tackle this problem. Are you sure it's the device's back button and not the \"up\" button?\n. Hi @soomtong, I've been really busy lately. I can't even work on the issues. Will try to work on this when I get the time. Cheers!\n. Hi @chiragnarula, you might want to look at two things:\n1. First check if you have an onClick attribute in your <body> tag. You'll want to remove that.\n2. Then make sure you have data-ignore=\"true\" attribute in your links and buttons.\n. Are you sure about this? I just checked the examples and they work fine.\n. On second thought, let's do this in a develop branch.\n. Issue noted. :) Will fix this in the next updates.\n. Nope not yet. Still working on it. :)\nOn Nov 27, 2013 7:32 PM, \"vishnu123\" notifications@github.com wrote:\n\nIs this fixed in Fries v2.0.3?\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/80#issuecomment-29377710\n.\n. Are you trying to achieve a full page reload?\n. I believe there's a better solution for this. Removing overflow property\nwill remove the scroll from the content. Will look into this while working\non a better scroll functionality when I get the time.\nOn Dec 14, 2013 12:31 PM, \"Fernando\" notifications@github.com wrote:\nif i comment the lines in 62 63 content.css\n.content {\n...\n/*\noverflow: auto ;\noverflow-x: hidden;\n*/\n..\n}\nand i change the action-bars.css adding position: fixed to\n.action-bar.fixed-top to made it fixed to the top again\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/84#issuecomment-30560129\n.\n. Hi @ale110, yeah I agree that creating checkboxes is really hard to do right now. I'll be rewriting the form elements soon when I get the time.\n. Hi @Busk07, thanks for pointing this out. I can't believe I missed that. Thanks! :)\n. Ah, thanks!\n. Let's put this on development branch first. I'll set develop as the default branch so we can merge these without affecting the latest stable release. Also, I'll be creating a branch for version 2.1 with a list of features. I'm planning to add both holo dark and light themes to that as well.\n. Closing this for now.\n. > Well, that's actually what tags are for, isn't it? Even though current master can be considered stable (and shouldn't be default for adding new commits (except for urgent fixes) anyway), I thought the lastest stable is 2.0.3? ;-)\n\nOh, right. Haha. Good to have someone who points out my mistakes. :)\n\n(BTW, I noticed that you link to the https://github.com/jaunesarmiento/fries/archive/master.zip in the readme file rather than to https://github.com/jaunesarmiento/fries/archive/2.0.3.zip (=latest stable). Is that on purpose?)\n\nYes, I noticed that. It's my fault. It's supposed to be pointed to 2.0.3. :P\n. > Would you merge my changes from PR #91 into the new develop branch? If so, I can send you a new PR now. In case you don't, note it contains some JS fixes too. You may still want to merge these changes, even though you don't want to merge themes atm.\nSend a PR to wip/v2.1.0. I'll merge it right away.\n. As mentioned in #90, I'm closing this for now.\n. I'm currently working on all of the fixes. All new features haven't been touched yet. :) As for ETA, two weeks from now would be nice. I'm pretty busy during the day but I can work on them when I'm at home.\n. Yeah, sure thing. :)\n. Ahh this is gonna be tough. Do you mind merging on your branch?\n. The conflicts I mean. With 54 files changed, I think the number of conflicts would be tough to merge.\n. Can you check if the dialogs and toast notifications work on the documentation and examples?\n. I think the latest fingerblast.js may have caused the dialogs and toasts to break.\n. I've just confirmed that the latest fingerblast.js and fixes done to example.js and documentation.js broke the dialogs and toast notifications. Can you have a look at this on your end?\n. Awesome! Thanks!\n. Yes, develop is pretty much useless right now. I think deleting that branch\nis fine.\nJust send your pull requests to wip/v2.1.0.\nOn Mar 13, 2014 4:55 AM, \"Stephan Schmitz\" notifications@github.com wrote:\n\nGlad that's solved. [image: :+1:]\nOkay your wip/v2.1.0 branch is the clean now and includes all recent\nupdates as well as both themes. It is right now 11 commits ahead and 2\ncommits behind your new develop branch.\nSo, should I keep sending send new PRs to wip/v2.1.0 or, as previously\nsaid, to the new develop branch? Because actually develop branch is useless\nright now, isn't it?\n\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/pull/94#issuecomment-37463787\n.\n. Hi @eyecatchup, I forgot to make a note that I'm no longer maintaining the project. Primary reason is due to Material Design. Anyway, thanks for bringing this up.\n. Already contacted GitHub regarding the removal of the CNAME. Someone has already squatted over jaunesarmiento.me as well, so I can't remove it manually.\n\nAs for merging projects, I can't give the project up that easily just cause I'm not maintaining it anymore. And I'd like to keep it for historical purposes. I hope you understand. You can, however, work on a fork. I'd be more than happy to provide a link to your fork in the README.\n. @seanhussey nice catch there! Thanks!\n. Thanks @kkirsche!\n. Fixed on branch wip-1.0.0\n. Hi @Wolfr, yes I've already included this in the current WIP version. You can check it out by pulling the wip-1.0.1 branch then just view the examples bundled with it. :)\n. Yes I guess I'll do that then. Thanks!\nNotes: Implemented on version 1.0.1. Use <i class=\"icon-up-button\"></i> to render the up/back chevron.\n. Hi @Mtillmann, does gfx perform well on the mobile browser? The only problem with it is its dependency to jQuery which I'm trying to stay away from. \nI'll read gfx's source to check how they do their animations and maybe port it over to Fries.\nThanks!\n. I'm a bit confused here. You're saying that we should use CSS transitions when in fact the animations in Fries are all done via CSS. The only time I use JS with the animations is when I need to add/remove a class that does the animations.\n. Closing this for now due to lack of information.\n. Yes, this is part of the plan for Fries. I'm still thinking which CSS preprocessor to use. But I'm going to lean towards the more widely used preprocessor.\n. Okay, I've started working on the \"Holo Dark\" theme using SASS. This will be included in version 1.0.1 of Fries.\n. I'd love to hear what others think. Compass seems to be more popular, yes?\n. Already implemented on wip-1.0.1 branch.\n. You're welcome. :)\n. Hi @aymanfarhat, I think you are using the documentation version of action-bars.js. The debug variable was only added to the global scope (in docs.js) and checked in action-bars.js to force the checking of action overflows in the documentation demo.\nI suggest that you download the latest version of Fries (https://github.com/jaunesarmiento/fries/tree/1.0.0) and use the JS files in the /lib folder.\nI hope that answers your question. Cheers!\n. That's good to hear. Have fun coding! :)\n. Hi @aymanfarhat, the JavaScript library of Fries uses touch events that's why it doesn't work on your desktop browser. I'm still working on catching clicks and converting them to touch events.\nIn the meantime, kindly use a library that converts click events to touch events. Or a more hacky solution is to edit Fries' JavaScript files and replace touchstart or touchend to click.\nHope that helps!\n. Alright cheers! :)\n. Oh, right. I completely forgot about that. Yes, that's the least hacky way to do it.\n. You may add the data attribute data-ignore=\"true\" to your links so stack.js ignores them. :)\n. Really? That's odd. I'm pretty sure I only call preventDefault() after it has checked the data-ignore data attribute. I'll take a look at the code later today when I get the time.\n. Thanks @aymanfarhat!\n. Hi @OZZlE, I'm aware of the layout issues on Firefox. I didn't really optimize Fries on Firefox because Android devices don't ship with it. And it would be pointless to optimize on Firefox since Fries was meant to be used as a prototyping tool on Android and Android uses WebKit as its rendering engine. I'd suggest using Chrome or Safari when viewing the examples or testing your prototypes.\nAnd for point number 2: as stated above, this is a non-issue when testing on Chrome/Safari.\nI'm really sorry but I won't be optimizing for Firefox. You can however fork the repo and maybe do the optimization yourself.\nCheers!\n. Oops, forgot to replace that when I removed the wip-1.0.0 branch. Good eye @Wolfr. Cheers!\n. Done implementing radio buttons and on/off switches on wip-1.0.1 branch. Check it out. :)\n. Oops, I forgot to merge the branch with wip-1.0.1. I did a merge just now. Just pull the changes then check out /examples/new-contact.html to see the radio buttons.\n. The switches needs testing on an Android device. I still don't have one so I can't test these right now. Will only close this issue once these have been tested on an Android device.\n. Great! Thanks @Wolfr. :)\n. Just pull the latest wip-1.0.1 branch and check out /examples/new-contact.html for the markup. :)\n. The weird flash above the switch is probably caused by the :active state highlight. Just need to position it correctly.\nAs for the swiping of on/off switch, I haven't done that yet. Will need a js component for that.\nI think I'll have to change the markup a bit and the styles. Damn, I overlooked that one. It's really hard to see everything without a device lol.\n\nOff topic: the video was captured using Screencast app. You can download it from Google Play.\n. Here's the link: https://play.google.com/store/apps/details?id=com.ms.screencastfree\nI'm just using the demo version.\n. Oh right, I forgot about that. Sorry. >.<\n. Cool, thanks @teusinkorg!\n. Dude, your jpHolo is smashing! :) Great job on it.\nI'm kinda confused with this:\n- Tablet: 48,76 px\nCan you elaborate that? Is that 48 and 76/100 pixels on landscaped tablet?\nAlso, this might be useful for us both: http://petrnohejl.github.io/Android-Cheatsheet-For-Graphic-Designers/#action-bar-height\n. Right, centimeter. :)\nIf you read the guidelines on that link real quick, you'll see that the heights on different orientation and devices matches the ones I posted here. I'll probably just stick to that. :)\nSame thing for me. I am a bit of a perfectionist as well. That is also why I hated other mobile UI frameworks cough KendoUI cough out there.\nCool, thanks! Will definitely check out how you did the navigation drawers and maybe port it over to Fries. :+1: \n. I believe index.html works fine on Firefox. It's just that Fries is not optimized for it thus having layout issues. \nAlso, I won't be accepting pull requests to version 1.0.0 from here on. Please checkout wip-1.0.1 branch and do your changes there.\n. Hi @MiguelBel, can you provide a test case where this happens? Maybe post the markup where the text overflows. Also please fix your commit message before doing a pull request. Cheers! :)\n. Ahh I see. This merits to be in version 1.0.0 then. Thanks @MiguelBel! :) Will include this in version 1.0.1 as well.\n. I'm not really sure how the logout icon for Android looks like. Mind posting a screenshot or a link to the icon? Also I found this: http://www.spiderflyapps.com/downloads/android-developer-icons-the-font/. Tell me if it has the logout icon so we can extend the current font icon with this one.\n. I'll have a look at it. Thanks bud!\n. Hi @jadjoubran, I noticed two things on your implementation of Toast notifications:\n- Toast notifications are always centered unless otherwise stated in the code via the Gravity and x and y offset, which your implementation is having a problem with. When you resize the browser, the position of the notification gets broken.\n- Almost every box UI element in Android has a border-radius of 2px. Yours has 3px which makes the Toast look a bit awkward.\nA few things you might want to consider:\n- Convert your codebase into a class so we can call it as var toast = new Toast();\n- Add options where one can set the content, position, and the duration of the Toast notification. \nNonetheless, great suggestion. I wasn't really thinking of adding Toast notifications since you can just use the PhoneGap plugin which is implemented natively.\n. - I'm pretty sure I saw a JavaScript library that centers just about anything. I'll post it here when I find it. I think this will be the optimal solution to this centering problem since you'll be using JS anyway.\n- Toasts can be positioned at the top of the screen if I remember correctly.\n- Oh, I wasn't aware that it can't be used if you're building through PhoneGap Build.\nThen I guess this can be added to the next release. :)\n. Looks great! :)\n. Yes, I'll be including this on version 1.0.1. :)\nThere are a few things I want changed before I include this as a component though:\n1. I'd like this to follow the CamelCase coding style in JavaScript. So Android_Toast should be converted to AndroidToast and methods like set_duration should be setDuration. I want this implemented to provide coding style consistency.\n2. In Fries, CSS classes and ids that have more than one word are separated by a dash -.\n3. And further testing on other devices. :)\n. Or the following:\n``` javascript\n// If we're using fries namespace, do:\n// var fries = window.fries || {};\n(function () {\n  var Toast = function (options) {\n    this.init(options);\n  }\nToast.prototype = {\n    _defaults: {\n      // default options here\n    },\n    init: function (options) {\n      // merge user options with defaults\n      // show the Toast\n      // then hide Toast after a while\n      this.destroy(); // then destroy it\n    },\n    destroy: function () {\n      // destroy Toast here\n    }\n  };\n// Then expose it in window or Fries namespace\n  window.Toast = Toast;\n  // or fries.Toast = Toast;\n}());\n```\n. Hi @captn3m0, are you referring to Android Dialogs (http://developer.android.com/design/building-blocks/dialogs.html)?\n. Yes I'm planning to add this along with modals. :) This will probably be included in the next next release (v1.0.2) of Fries. Cheers!\n. Closing this and referencing it to #48.\n. That's really great @aymanfarhat! +1 to this. I was planning to add this feature to tabs.js a while back.\nYes, I'd love to see what people are doing with Fries. I'll send you an email. Cheers!\n. Hi @aymanfarhat, I'm aware of this issue and has fixed it in the current wip version. The fix was adding event.preventDefault() to tabs.js. Please have a look at this commit: https://github.com/jaunesarmiento/fries/commit/03bf6a3de062618f0378288a307c1ecddbf01508\n. The issue was caused by tabs.js appending the #href to the address bar, causing stack.js to pop these first.\n. Won't event.stopPropagation() work? Maybe call it after calling event.preventDefault()?\n. That is really odd. I really can't work on it at the moment due to the lack of an Android phone. I will however be able to buy one within the week. You can try to find a solution to this if it's not too much to ask from you.\n. Great, thanks @aymanfarhat! :)\n. Oops, forgot to close this issue. This is already fixed in the wip-1.0.1 branch.\n. Actually, Fries fires a push event whenever you push a new page to the DOM. What you can do for now is to catch this event and attach your event handlers from there.\nI really like your second suggestion but I still don't see the need of jQuery style selector module. Let's discuss this further. :)\n. Not doing this anytime soon. Focusing on other features.\n. Hi @mohitjain, as of now there are no plans to add a pull-to-refresh functionality to fries as it can be done using other libraries. And implementing such feature requires a bit more time than the rest of the features. Maybe you can check out cubiq iScroll4 with pull to refresh (http://cubiq.org/iscroll-4) and restyle it in an Android-y way.\nAs for the refresh icon, yes I'll be adding more icons to the current ones cause I've noticed that it's incomplete.\n. Will consider this. :)\n. Alright then. Will include it in the next version. I'll be registering this to bower. Cheers!\n. You're welcome. :)\n. Registered to Bower. Do bower install fries to install.\n. Referencing this in issue #17 \n. Hi @aymanfarhat, as of now there is no such pattern to achieve this. You can however save these parameters in a global variable, catch the push event that stack.js fires, and then using the parameters from there. This may not be the best solution to this.\nI'm open to suggestions on how to implement this or if we even should implement it at all. I also think this could be a great addition to Fries since I'm not just aiming to make Fries a prototyping tool.\n. I believe this is related to #26.\n. Hi @joelstahre, I'm sorry for the late response. Either the browser of the phone you're using does not support CSS flexbox layout or we'd have to work on the CSS styles of the tab bar. Please give more details about your test environment like OS version, model of the phone, etc.\nCheers!\n. @aboudard Great thanks! :)\nAbout handling gestures, off-topic but yes. I'm planning to add that feature. Actually, @aymanfarhat (https://github.com/aymanfarhat) has already done a prototype of that. Although there are still some quirks that are needed to be done like the dragging behavior.\n. Wow. I'm guessing this is a rendering issue on Galaxy S4 but I'm not 100% sure. If anybody else can replicate this issue on their S4, then I guess it'll be safe to say that it's a rendering issue. I'll check if the Samsung changed something in the browser for S4 phones, maybe that'll clear a few things out.\nBecause I have been testing Fries on Google Nexus S which is a relatively old phone and I haven't encountered an issue such as this.\nThanks for reporting this. :)\n. After a dozen of searches regarding any change to the stock browser of Samsung Galaxy S4, I found out that it's using Chrome 18 as its stock browser based on this post. Whether this true or not, somebody has to test it.\nOn another note, I can try to mix the old and new syntax of flexbox layout for the tabs. The current implementation of this on Fries uses the old syntax display: box and display: -webkit-box. So I think adding in the new syntax might solve this but I really can't test it on an S4. Maybe someone else can test it. \n. On second thought, it may not be the flexbox layout that's the problem. Hmm..\n. I'm labeling this as a device-related issue on the Galaxy S4. I definitely want to understand more of this problem but sadly, I don't have an S4. I haven't had any issues with the layout before S4 came out.\n. Hi @gregavola, are you using a GS4? As I said in my previous comment, I don't have an S4 where I can test this issue on. But from the looks of it, the problem seemed to have occurred because of translate3d. But since other Android devices don't have any problems with rendering, the culprit must be the default browser that S4s use to render a webview.\n. Thanks for the note @andywhite37. \n. Hi @BR41N1, yes this is an issue and I'm still thinking of an elegant solution for it. I suggest testing your pages using Google Chrome with emulated touch events for now by following these steps:\n1. Open Developer Console\n2. Click the gear icon on the lower right corner\n3. Click Overrides\n4. Then check Emulate touch events\nI'll be closing this and will be opening an issue with more details about this.\nThanks!\n. Wow @jadjoubran, this is great! Also I think you'll be needing to add the touchmove events as well. :)\n. Sorry to hear that. I'm really working hard to get these issues off the list.\n. I'll be looking forward to it :)\n. I pushed a branch that solves this issue. Please check out https://github.com/jaunesarmiento/fries/tree/fix-for-issue33 for this.\nThe only problem that I encountered with this is that the default behaviour of labels do not work, which is an issue for form elements. Anybody want to try fixing this issue on that branch? :)\n. Workaround: Use fingerblast.js.\n. Hi @KyleMorgan49, I can't seem to find what the \"menu\" icon looks like on Android. Do you mind providing a screenshot of the icon?\nThe current iconset includes the following icons from the original repo: http://turbo87.github.io/Android-Action-Bar-Icon-Pack-Font/ Please note that the class names may differ from this list.\n. Also, I'm having issues regarding the licensing of the Android official icons and @turbo87 's Action Bar Icon Pack Font. I'm thinking of redoing the icon font myself and licensing it using MIT so Fries users don't need to attribute them to the original author.\nThe Android official icons are (I believe) licensed under Creative Commons 2.5. Which is annoying cause you have to attribute it to the Android Open Source Project.\nAny thoughts about this?\n. Oops, sorry. I misread your post. I didn't see the \"three horizontal lines\". Got it.\n. I meant redoing the font iconset from SVG and converting them into a font and release it under MIT. So Fries users can just attribute their works to the Android Open Source Project instead of having to put so many licensing stuff on their work. I'm not sure if that's possible though.\n. @Turbo87, yes I'm having the same issues as you are right now. I don't have the time (yet) to research on the matter but I'd be more than willing to be less restrictive on this matter as well. But as far as Fries is concerned, I think I already made the changes I need to do to both the website (documentation) and the README to properly attribute the icons to the Android Open Source Project and to you. If this however does not suffice your requirements for attribution, please by all means, tell me so I can make the changes.\n. Alright man, cool. :) Thanks for clarifying this. Cheers!\n. Couldn't find a more complete icon set. Closing this for now.\n. Hi there @aboudard, no I believe this is not \"normal\". What version of Fries are you using?\n. Alright. Can you try doing a console.log() inside the code where you try to catch the back button? I'm very willing to help you with your problem. :)\n. But will the app still exit if you press the back button on index.html?\nEdit: I currently don't have an Android phone right now that's why I'm asking. xD\n. Hmm. That's odd. Is there any particular reason why you're catching the back button functionality? Cause when I tested this, I never had to catch the back button and still it works fine.\nBy the way, the style on other pages does not load if stack.js fails to load properly in index.html.\n. Thanks @aymanfarhat. I couldn't test the problem.\n@aboudard you could also try to build and install https://github.com/jaunesarmiento/HelloFries on your device. That project was made using ./create <project_folder_path> <package_name> <project_name> command from the Cordova Android distribution.\n. Back button seems to be working fine on v2.0.0\n. Oops, sorry about that. Thanks @BR41N1! :)\n. It is here. :) It's on the gh-pages branch.\n. Needs testing on an Android device.\n. Hi @aymanfarhat, I've been thinking of the same workflow when I stumbled upon https://build.phonegap.com again recently. Although to have this kind of workflow, we'll have to move a lot of things around which may cause a little confusion for the existing user base.\n. Testing on the browser is fine for now.\n. Don't mind the large number of deletions. I accidentally committed the styles for a themed version of Fries. :)\n. Hi @shuaishuai, nope I won't be adding RequireJS to handle modularization in Fries. The framework is already too deep into the development of version 1.0.1. I can however reconsider this for the later versions of Fries.\n. @shuaishuai I'd rather use RequireJS. It's a much more elegant solution rather than having Fries components in the window variable.\n@Wolfr, I think the best approach would be to use BEM method which, correct me if I'm wrong, being used by those mentioned frameworks. Actually, I've been thinking about redoing Fries from scratch yet again due to these kinds of concerns. I honestly wasn't able to think this through in a long-term context. But I really love having these kinds of conversations. Fries is still young, I think, so a lot can still change.\n. Will add it to the next version. :)\n. Hi @florindumitru, yes Fries does not execute any scripts from the loaded page. You must add your scripts to index.html and listen for events there.\n. Here's a little something on how to do this, you must catch the push event that stack.js fires whenever a page gets pushed onto the screen.\nSo given that you have an inner page like this:\n<div id=\"page2\" class=\"page\">\n  <!-- some content here -->\n</div>\nYou just need to do the following in your index.html:\n<script type=\"text/javascript\">\nwindow.addEventListener('push', function () {\n  if (document.getElementById('page2')) {\n    console.log('We are on page 2');\n    // do what you want here\n  }\n});\n</script>\nThis may not be the best solution but I think this will work for now. @aymanfarhat and I have already had a few discussions on how to hook code when loading a new page. I think this is something that should really be included in Fries.\nAnd no, I actually haven't tested Fries on iOS. And I believe it won't work on Android 2.2 due to its stock browser being outdated.\n. Wrong pull request\n. I didn't notice this when I was testing on Samsung Galaxy S2. Can anybody else confirm this?\n. I'll be getting an Android phone next week. Will test this as soon as I get one. As of now, I really don't have anything to test it on.\n. Hi @jadjoubran, I've tested this on a Nexus 4. And I'm not experiencing the issue you're stating.\n. Seem to be working fine on mine. Closing this.\n. TODO: add an example of the dialog on index.html\n. I still haven't decided on which to use LOL. Now that you've mentioned it, I'll see which available mixins are viable. :)\n. Hi @teusinkorg. Yes I've been meaning to add this feature a while back. I already have a candidate library to port over to Fries. You may want to check Snap.js as it implements this fairly simple, it's widely used in Ratchet prototypes and the development is active. :)\n. Yes I know. :) What I meant is that the core functionality of the navigation drawer is implemented in Snap.js. I think you can expect this feature on the version 1.0.1.\nCheers!\n. Hi @grobmeier, sorry if it was a misleading for you. But Tobias didn't ask for attribution for his work. His repository (https://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font) does not even have a license.txt file or any licensing of some sort. He did mention that parts of his work contain modifications of the original Android icons. Thus the only attribution I need to make was to the Android Open Source Project.\nIf you asked Tobias directly for his permission to use the fonts then by all means please let me know.\n. @grobmeier yes I've read it. Until Tobias states how he should be attributed to the work, I won't make any changes to the attribution part of my README because I am still in compliance to it. Google only asks that I should add \"Portions of this page are modifications based on work created and shared by Google and used according to terms described in the Creative Commons 3.0 Attribution License.\" so yeah.\n. Was talking about Google's license. I didn't notice that they updated to CC 3.0.\nAnyway, I'll be updating the README and the website shortly.\nThanks!\n. Fixed.\n. Related to issue #31.\n. Hi @soomtong, thanks for the contribution. :) I was planning to add this but I forgot to do so.\n. I'll also update the docs with this. Thanks again!\n. Hi @xpose2000, I've been aware of the issue since I got a hold of a phone lately but I haven't got the chance to find a work around for it. \nI'll look into it tomorrow ;-) I'll try your suggestion as well. Cheers! \n. This issue is related to these:\n- http://stackoverflow.com/questions/13219017/ghostclicks-in-mobile-apps\n- http://stackoverflow.com/questions/13064418/mobile-fast-click-prevent-ghost-focus\n. Although it seems that this doesn't happen on version 2.0.0. Can anyone else test this? Here's a sample Phonegap app using Fries: https://github.com/jaunesarmiento/fries-phonegap\n. Hi @vishnu123. Unfortunately Fries has only been tested on devices that I got a hold of. And all of them are on Android 4.0 and above.\nSo yes, Fries only supports 4.0 and above (for now, I guess). I'm still thinking of bringing support to lower versions of Android but I doubt that everything will work though.\nAs for the changes required, since I don't have a device with Android 2+, I'm not sure how it can be tweaked to make it work. I'm really sorry about this.\n. Apparently, this issue is valid. I've received an email asking how this can be fixed. A discussion going on here seemed to have fixed this issue. Just need someone to try and test if it works.\n. Hi @hackersysCG, cool thanks! Yes, I'd love that. Will work on a fix for now based on the links posted above. I'll give you a nudge when it's done. :)\n. Hi @hackersysCG, can you confirm if http://filamentgroup.github.io/Overthrow/ scrolls on your mobile browser?\n. I think that might be a little hard to do as those Android versions' browsers only have partial support for the flexbox layout. And that should be discussed in a different thread. :)\n. I'll create a separate thread for those issues first.\n. Oops\n. Hi @hell03610, is there any reason you need the current url in your prototype? Because unless you do, I think this bug is harmless to your prototype but yes, this is considered a bug and I'll try to fix it. Thanks!\n. That's odd. I'll check the difference between master and wip branch again. Thanks for reporting Emma. \n. It appears that this happens on Ratchet as well. So I'm going to close this for now as it doesn't seem like a real problem to us.\n. Related to #26.\n. Will be fixed on next push. :) Thanks!\n. Wow @bernatfortet, I never thought of that. Thanks for this. This can be used to make testing easier as well.\n. Hi @EltonZhang13, what version of Fries are you using? Because I'm pretty sure that this was fixed on wip-1.0.1 branch.\n. Sure thing. The problem was that in the master branch, the action overflows aren't re-initialized when the push event is called. If you check action-bars.js in wip-1.0.1 branch, you'll see the following line:\njavascript\nwindow.addEventListener('push', checkActionOverflow, false);\nThat line handles the reinitialization of the action overflows when a page is pushed onto the history stack. :)\nHope that clears things up for you.\n. No problem bud. :) Glad to help.\n. Fixed\n. Hi @markusthoemmes, thanks for reminding me. I was planning to add this to the documentation but since the next version is not up for release yet, I didn't include it yet. Will add on the next version.\nCheers!\n. Included in version 2.0.0 docs.\n. Hi @jituiitm, on what platform are you testing? Desktop Chrome or on your mobile device? Would help if you'd post how you're doing the radios and toggles.\n. That's odd. Hmm. On what device and Android version are you testing the Phonegap app on? Can't do skype/hangout right now unfortunately. I'll check this on my end. Will keep you posted.\n. I can confirm that the on/off switches and radio buttons does not work on desktop. But I've tried them on https://github.com/jaunesarmiento/fries-phonegap and they work fine. Can you try running this example on your device? It's a Phonegap app btw.\n. Alright cool, thanks @jituiitm!\n. For tabs, the first step that should be done is to find out which syntax of the flexbox layout is supported in Android versions lower than 4.0, then we can try and fix that. @hackersysCG, if you can play around with the examples and change the flexbox layout syntax for the tabs component, that'd be awesome.\n. Related to #68. Thanks for bringing this up. Will work on this along with issue #68. I'm looking for a few ways to implement this. I'm thinking of adding a data-attribute to the .page that tells stack.js that the page is at root level and should clear the history when it's encountered. What do you think?\n. It's not yet a solution, @berthojoris. I'm just throwing in ideas on how to tackle this problem. Are you sure it's the device's back button and not the \"up\" button?\n. Hi @soomtong, I've been really busy lately. I can't even work on the issues. Will try to work on this when I get the time. Cheers!\n. Hi @chiragnarula, you might want to look at two things:\n1. First check if you have an onClick attribute in your <body> tag. You'll want to remove that.\n2. Then make sure you have data-ignore=\"true\" attribute in your links and buttons.\n. Are you sure about this? I just checked the examples and they work fine.\n. On second thought, let's do this in a develop branch.\n. Issue noted. :) Will fix this in the next updates.\n. Nope not yet. Still working on it. :)\nOn Nov 27, 2013 7:32 PM, \"vishnu123\" notifications@github.com wrote:\n\nIs this fixed in Fries v2.0.3?\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/80#issuecomment-29377710\n.\n. Are you trying to achieve a full page reload?\n. I believe there's a better solution for this. Removing overflow property\nwill remove the scroll from the content. Will look into this while working\non a better scroll functionality when I get the time.\nOn Dec 14, 2013 12:31 PM, \"Fernando\" notifications@github.com wrote:\nif i comment the lines in 62 63 content.css\n.content {\n...\n/*\noverflow: auto ;\noverflow-x: hidden;\n*/\n..\n}\nand i change the action-bars.css adding position: fixed to\n.action-bar.fixed-top to made it fixed to the top again\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/84#issuecomment-30560129\n.\n. Hi @ale110, yeah I agree that creating checkboxes is really hard to do right now. I'll be rewriting the form elements soon when I get the time.\n. Hi @Busk07, thanks for pointing this out. I can't believe I missed that. Thanks! :)\n. Ah, thanks!\n. Let's put this on development branch first. I'll set develop as the default branch so we can merge these without affecting the latest stable release. Also, I'll be creating a branch for version 2.1 with a list of features. I'm planning to add both holo dark and light themes to that as well.\n. Closing this for now.\n. > Well, that's actually what tags are for, isn't it? Even though current master can be considered stable (and shouldn't be default for adding new commits (except for urgent fixes) anyway), I thought the lastest stable is 2.0.3? ;-)\n\nOh, right. Haha. Good to have someone who points out my mistakes. :)\n\n(BTW, I noticed that you link to the https://github.com/jaunesarmiento/fries/archive/master.zip in the readme file rather than to https://github.com/jaunesarmiento/fries/archive/2.0.3.zip (=latest stable). Is that on purpose?)\n\nYes, I noticed that. It's my fault. It's supposed to be pointed to 2.0.3. :P\n. > Would you merge my changes from PR #91 into the new develop branch? If so, I can send you a new PR now. In case you don't, note it contains some JS fixes too. You may still want to merge these changes, even though you don't want to merge themes atm.\nSend a PR to wip/v2.1.0. I'll merge it right away.\n. As mentioned in #90, I'm closing this for now.\n. I'm currently working on all of the fixes. All new features haven't been touched yet. :) As for ETA, two weeks from now would be nice. I'm pretty busy during the day but I can work on them when I'm at home.\n. Yeah, sure thing. :)\n. Ahh this is gonna be tough. Do you mind merging on your branch?\n. The conflicts I mean. With 54 files changed, I think the number of conflicts would be tough to merge.\n. Can you check if the dialogs and toast notifications work on the documentation and examples?\n. I think the latest fingerblast.js may have caused the dialogs and toasts to break.\n. I've just confirmed that the latest fingerblast.js and fixes done to example.js and documentation.js broke the dialogs and toast notifications. Can you have a look at this on your end?\n. Awesome! Thanks!\n. Yes, develop is pretty much useless right now. I think deleting that branch\nis fine.\nJust send your pull requests to wip/v2.1.0.\nOn Mar 13, 2014 4:55 AM, \"Stephan Schmitz\" notifications@github.com wrote:\n\nGlad that's solved. [image: :+1:]\nOkay your wip/v2.1.0 branch is the clean now and includes all recent\nupdates as well as both themes. It is right now 11 commits ahead and 2\ncommits behind your new develop branch.\nSo, should I keep sending send new PRs to wip/v2.1.0 or, as previously\nsaid, to the new develop branch? Because actually develop branch is useless\nright now, isn't it?\n\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/pull/94#issuecomment-37463787\n.\n. Hi @eyecatchup, I forgot to make a note that I'm no longer maintaining the project. Primary reason is due to Material Design. Anyway, thanks for bringing this up.\n. Already contacted GitHub regarding the removal of the CNAME. Someone has already squatted over jaunesarmiento.me as well, so I can't remove it manually.\n\nAs for merging projects, I can't give the project up that easily just cause I'm not maintaining it anymore. And I'd like to keep it for historical purposes. I hope you understand. You can, however, work on a fork. I'd be more than happy to provide a link to your fork in the README.\n. @seanhussey nice catch there! Thanks!\n. Thanks @kkirsche!\n. ",
    "Wolfr": "Here's an SVG of the \"official\" Android back chevron\nhttp://cl.ly/341J3I2G0f0B\n. Yes I see, maybe close this issue then ;)\n. +1 for SCSS.\n. Also +1 for using a mixin framework like Compass (http://compass-style.org/) or Bourbon (http://bourbon.io/):\nSo statements like\nbox-sizing: border-box;\nCould be\n@include box-sizing(\"border-box\");\nWhich will render CSS with better compatibility.\n. I would vote Compass - the conversion is relatively easy, this will also provide a good mixin for multiple drop shadows.\n. I'll test it, I have a Nexus 4 and Nexus 7.\nOn Fri, Jun 21, 2013 at 9:33 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nThe switches needs testing on an Android device. I still don't have one so\nI can't test these right now. Will only close this issue once these have\nbeen tested on an Android device.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19802125\n.\n. I tested it and tried to film it need to find a way to make it better\nquality because this is pretty crappy:\nhttps://www.youtube.com/watch?v=bUQ2ujSa62A\n\ntapping on/off switch works. But there is a weird \"flash\" above the switch\nwhen you do it.\nswiping the on/off switch doesn't work. This works in Ratchet. I used\nfingerblast.js from Ratchet before to make the swiping work on desktop too\nwithout the use of chrome touch events (they use this in their demos)\ntarget areas on radio/check are too small, the label around radio/checkbox\nshould be 44px by 44px at least for a good hit area (I had trouble hitting\nthem on actual device)\nOn Fri, Jun 21, 2013 at 9:53 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nJust pull the latest wip-1.0.1 branch and check out\n/examples/new-contact.html for the markup. :)\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19802750\n.\n. How did you make this? https://www.youtube.com/watch?v=BpcLDI6c9Cc\n\nOn Fri, Jun 21, 2013 at 10:12 AM, Johan Ronsse johan.ronsse@gmail.comwrote:\n\nI tested it and tried to film it need to find a way to make it better\nquality because this is pretty crappy:\nhttps://www.youtube.com/watch?v=bUQ2ujSa62A\ntapping on/off switch works. But there is a weird \"flash\" above the switch\nwhen you do it.\nswiping the on/off switch doesn't work. This works in Ratchet. I used\nfingerblast.js from Ratchet before to make the swiping work on desktop too\nwithout the use of chrome touch events (they use this in their demos)\ntarget areas on radio/check are too small, the label around radio/checkbox\nshould be 44px by 44px at least for a good hit area (I had trouble hitting\nthem on actual device)\nOn Fri, Jun 21, 2013 at 9:53 AM, Jaune Sarmiento <notifications@github.com\n\nwrote:\nJust pull the latest wip-1.0.1 branch and check out\n/examples/new-contact.html for the markup. :)\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19802750\n.\n. OK I'll probably use that in the future because filming it with a camera\nand then exporting etc just gets in the way\n\n\nOn Fri, Jun 21, 2013 at 10:18 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nThe weird flash above the switch is probably caused by the :active state\nhighlight. Just need to position it correctly.\nAs for the swiping of on/off switch, I haven't done that yet. Will need a\njs component for that.\nI think I'll have to change the markup a bit and the styles. Damn, I\noverlooked that one. It's really hard to see everything without a device\nlol.\nOff topic: the video was captured using Screencast app. You can download\nit from Google Play.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19803509\n.\n. What's the exact app name? Finding a lot of ****\nIs it paid?\n\nOn Fri, Jun 21, 2013 at 10:31 AM, Johan Ronsse johan.ronsse@gmail.comwrote:\n\nOK I'll probably use that in the future because filming it with a camera\nand then exporting etc just gets in the way\nOn Fri, Jun 21, 2013 at 10:18 AM, Jaune Sarmiento \nnotifications@github.com wrote:\n\nThe weird flash above the switch is probably caused by the :active state\nhighlight. Just need to position it correctly.\nAs for the swiping of on/off switch, I haven't done that yet. Will need a\njs component for that.\nI think I'll have to change the markup a bit and the styles. Damn, I\noverlooked that one. It's really hard to see everything without a device\nlol.\nOff topic: the video was captured using Screencast app. You can download\nit from Google Play.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19803509\n.\n. Unfortunately you need a rooted device.\n\n\nI don't want to spend my time on XDA so a no-go :(\nOn Fri, Jun 21, 2013 at 10:38 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nHere's the link:\nhttps://play.google.com/store/apps/details?id=com.ms.screencastfree\nI'm just using the demo version.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19804279\n.\n. Relatively easy to do\n. The problem with the syntaxes is that they are hard to mix.\n\nYou could do modernizr detection and code based on .flexbox and .flexbox-legacy.but this introduces a new depedency.\n. Would probably be a good idea to add another radio button so you can test the toggling between the two\n```\n\n\n\n\n\n\n\n<div class=\"input-radio-wrapper\">\n  <input type=\"radio\" name=\"test\" class=\"input-radio\" id=\"test-radio2\" checked>\n  <label for=\"test-radio2\" class=\"input-radio-label\">\n    <div class=\"input-radio-button\"></div>\n  </label>\n</div>\n\n<div class=\"input-radio-wrapper\">\n  <input type=\"radio\" name=\"test\" class=\"input-radio\" id=\"test-radio3\">\n  <label for=\"test-radio3\" class=\"input-radio-label\">\n    <div class=\"input-radio-button\"></div>\n  </label>\n</div>\n\n\n```\n. I think it would be best to use a bootstrap/ratchet approach where every\ncomponent is pick and choose and can work separate from the others (some\ncomponents can inherit others e.g. tooltip and popover in bootstrap work\ntogether)\nOn Fri, Jun 21, 2013 at 12:07 PM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nHi @shuaishuai https://github.com/shuaishuai, nope I won't be adding\nRequireJS to handle modularization in Fries. The framework is already too\ndeep into the development of version 1.0.1. I can however reconsider this\nfor the later versions of Fries.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/42#issuecomment-19807791\n.\n. Here's an SVG of the \"official\" Android back chevron\nhttp://cl.ly/341J3I2G0f0B\n. Yes I see, maybe close this issue then ;)\n. +1 for SCSS.\n. Also +1 for using a mixin framework like Compass (http://compass-style.org/) or Bourbon (http://bourbon.io/):\n\nSo statements like\nbox-sizing: border-box;\nCould be\n@include box-sizing(\"border-box\");\nWhich will render CSS with better compatibility.\n. I would vote Compass - the conversion is relatively easy, this will also provide a good mixin for multiple drop shadows.\n. I'll test it, I have a Nexus 4 and Nexus 7.\nOn Fri, Jun 21, 2013 at 9:33 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nThe switches needs testing on an Android device. I still don't have one so\nI can't test these right now. Will only close this issue once these have\nbeen tested on an Android device.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19802125\n.\n. I tested it and tried to film it need to find a way to make it better\nquality because this is pretty crappy:\nhttps://www.youtube.com/watch?v=bUQ2ujSa62A\n\ntapping on/off switch works. But there is a weird \"flash\" above the switch\nwhen you do it.\nswiping the on/off switch doesn't work. This works in Ratchet. I used\nfingerblast.js from Ratchet before to make the swiping work on desktop too\nwithout the use of chrome touch events (they use this in their demos)\ntarget areas on radio/check are too small, the label around radio/checkbox\nshould be 44px by 44px at least for a good hit area (I had trouble hitting\nthem on actual device)\nOn Fri, Jun 21, 2013 at 9:53 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nJust pull the latest wip-1.0.1 branch and check out\n/examples/new-contact.html for the markup. :)\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19802750\n.\n. How did you make this? https://www.youtube.com/watch?v=BpcLDI6c9Cc\n\nOn Fri, Jun 21, 2013 at 10:12 AM, Johan Ronsse johan.ronsse@gmail.comwrote:\n\nI tested it and tried to film it need to find a way to make it better\nquality because this is pretty crappy:\nhttps://www.youtube.com/watch?v=bUQ2ujSa62A\ntapping on/off switch works. But there is a weird \"flash\" above the switch\nwhen you do it.\nswiping the on/off switch doesn't work. This works in Ratchet. I used\nfingerblast.js from Ratchet before to make the swiping work on desktop too\nwithout the use of chrome touch events (they use this in their demos)\ntarget areas on radio/check are too small, the label around radio/checkbox\nshould be 44px by 44px at least for a good hit area (I had trouble hitting\nthem on actual device)\nOn Fri, Jun 21, 2013 at 9:53 AM, Jaune Sarmiento <notifications@github.com\n\nwrote:\nJust pull the latest wip-1.0.1 branch and check out\n/examples/new-contact.html for the markup. :)\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19802750\n.\n. OK I'll probably use that in the future because filming it with a camera\nand then exporting etc just gets in the way\n\n\nOn Fri, Jun 21, 2013 at 10:18 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nThe weird flash above the switch is probably caused by the :active state\nhighlight. Just need to position it correctly.\nAs for the swiping of on/off switch, I haven't done that yet. Will need a\njs component for that.\nI think I'll have to change the markup a bit and the styles. Damn, I\noverlooked that one. It's really hard to see everything without a device\nlol.\nOff topic: the video was captured using Screencast app. You can download\nit from Google Play.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19803509\n.\n. What's the exact app name? Finding a lot of ****\nIs it paid?\n\nOn Fri, Jun 21, 2013 at 10:31 AM, Johan Ronsse johan.ronsse@gmail.comwrote:\n\nOK I'll probably use that in the future because filming it with a camera\nand then exporting etc just gets in the way\nOn Fri, Jun 21, 2013 at 10:18 AM, Jaune Sarmiento \nnotifications@github.com wrote:\n\nThe weird flash above the switch is probably caused by the :active state\nhighlight. Just need to position it correctly.\nAs for the swiping of on/off switch, I haven't done that yet. Will need a\njs component for that.\nI think I'll have to change the markup a bit and the styles. Damn, I\noverlooked that one. It's really hard to see everything without a device\nlol.\nOff topic: the video was captured using Screencast app. You can download\nit from Google Play.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19803509\n.\n. Unfortunately you need a rooted device.\n\n\nI don't want to spend my time on XDA so a no-go :(\nOn Fri, Jun 21, 2013 at 10:38 AM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nHere's the link:\nhttps://play.google.com/store/apps/details?id=com.ms.screencastfree\nI'm just using the demo version.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/17#issuecomment-19804279\n.\n. Relatively easy to do\n. The problem with the syntaxes is that they are hard to mix.\n\nYou could do modernizr detection and code based on .flexbox and .flexbox-legacy.but this introduces a new depedency.\n. Would probably be a good idea to add another radio button so you can test the toggling between the two\n```\n\n\n\n\n\n\n\n<div class=\"input-radio-wrapper\">\n  <input type=\"radio\" name=\"test\" class=\"input-radio\" id=\"test-radio2\" checked>\n  <label for=\"test-radio2\" class=\"input-radio-label\">\n    <div class=\"input-radio-button\"></div>\n  </label>\n</div>\n\n<div class=\"input-radio-wrapper\">\n  <input type=\"radio\" name=\"test\" class=\"input-radio\" id=\"test-radio3\">\n  <label for=\"test-radio3\" class=\"input-radio-label\">\n    <div class=\"input-radio-button\"></div>\n  </label>\n</div>\n\n\n```\n. I think it would be best to use a bootstrap/ratchet approach where every\ncomponent is pick and choose and can work separate from the others (some\ncomponents can inherit others e.g. tooltip and popover in bootstrap work\ntogether)\nOn Fri, Jun 21, 2013 at 12:07 PM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nHi @shuaishuai https://github.com/shuaishuai, nope I won't be adding\nRequireJS to handle modularization in Fries. The framework is already too\ndeep into the development of version 1.0.1. I can however reconsider this\nfor the later versions of Fries.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/42#issuecomment-19807791\n.\n. \n",
    "Digi59404": "CSS is rendered via the GPU on Mobile phones usually. So it will run smoother. The issue is it's not as straight forward as JS.\n. CSS is rendered via the GPU on Mobile phones usually. So it will run smoother. The issue is it's not as straight forward as JS.\n. ",
    "jadjoubran": "All animations are done using CSS3 in fries\n. Hey\nwhere can we see the radio buttons?\nThanks!\n. Hi @jaunesarmiento , thanks for taking a look at Android-Toast!\n- Toast notifications are always centered in Android Devices, and you can't give it a fixed width because you want to support all device sizes. And if you give it a % width, you cannot center it with css. Hence the position gets broken on resize.\n- I'll fix the border-radius, thanks!\n- I'll convert it into a class\n- Why would you want to set the position? it should always appear at the same position. The content and duration are good options.\n- You cannot use Toast plugin using PhoneGap Build, only if you have a local setup for phoneGap\n. Hey @jaunesarmiento \nI updated the repository, kindly check it and let me know what you think!\n. @aboudard Does the padding make it look awkward?\nI tested in Samsung Galaxy S2, S3 & S4 and Nexus 4\nLet me know if you have any comments\n. @aboudard okay great, let me know.\nWe can fix it using CSS3 media queries to cater for small devices\n. Hey @jaunesarmiento are you going to include this in your next release?\nLet me know if I can help in that!\n. Hey!\nThank you for your feedback.\nHowever can you please post this as an issue on the project itself?\nJust decide which one is better and I'll implement it as soon as possible\n. Hey @jaunesarmiento \nI updated the code and wrapped the JS into an IIFE.\nRegarding the coding style, shall I do a new branch to provide you the designed coding style?\nPlease advise since it's currently my first contribution to an open source project.\nThanks!\n. Hey\ncan you please provide the name of the Phone you're using to test on?\nThanks\n. That's what I'm currently doing to support All mobile devices and all desktop devices (including desktop devices with touch screens)\nif ( 'ontouchend' in document.documentElement ){\n   var FRIES_EVENT_TYPE = 'touchend';  //touch device\n}else if ( 'ontouchleave' in document.documentElement ){\n   var FRIES_EVENT_TYPE = 'touchleave';  //touch device\n}else if ( 'ontouchstart' in document.documentElement ){\n   var FRIES_EVENT_TYPE = 'touchstart';  //touch device\n}else{\n   var FRIES_EVENT_TYPE = 'click'; //desktop\n}\nand then instead of:\ndocument.addEventListener( 'touchstart', function (e) {\nI use\ndocument.addEventListener( FRIES_EVENT_TYPE, function (e) {\n. Well I honestly disabled the stack.js file\nI only use the spinner.js and the tabs.js whenever needed\n. There are no issues with stack.js but I found it would be better not to include it\neverything works fine without it\nI really hope that soon I can contribute all my changes to fries!\n. I guess you didn't notice that because the examples don't have any page that scrolls.. if you can try it on any phone you can see it clearly\n. All animations are done using CSS3 in fries\n. Hey\nwhere can we see the radio buttons?\nThanks!\n. Hi @jaunesarmiento , thanks for taking a look at Android-Toast!\n- Toast notifications are always centered in Android Devices, and you can't give it a fixed width because you want to support all device sizes. And if you give it a % width, you cannot center it with css. Hence the position gets broken on resize.\n- I'll fix the border-radius, thanks!\n- I'll convert it into a class\n- Why would you want to set the position? it should always appear at the same position. The content and duration are good options.\n- You cannot use Toast plugin using PhoneGap Build, only if you have a local setup for phoneGap\n. Hey @jaunesarmiento \nI updated the repository, kindly check it and let me know what you think!\n. @aboudard Does the padding make it look awkward?\nI tested in Samsung Galaxy S2, S3 & S4 and Nexus 4\nLet me know if you have any comments\n. @aboudard okay great, let me know.\nWe can fix it using CSS3 media queries to cater for small devices\n. Hey @jaunesarmiento are you going to include this in your next release?\nLet me know if I can help in that!\n. Hey!\nThank you for your feedback.\nHowever can you please post this as an issue on the project itself?\nJust decide which one is better and I'll implement it as soon as possible\n. Hey @jaunesarmiento \nI updated the code and wrapped the JS into an IIFE.\nRegarding the coding style, shall I do a new branch to provide you the designed coding style?\nPlease advise since it's currently my first contribution to an open source project.\nThanks!\n. Hey\ncan you please provide the name of the Phone you're using to test on?\nThanks\n. That's what I'm currently doing to support All mobile devices and all desktop devices (including desktop devices with touch screens)\nif ( 'ontouchend' in document.documentElement ){\n   var FRIES_EVENT_TYPE = 'touchend';  //touch device\n}else if ( 'ontouchleave' in document.documentElement ){\n   var FRIES_EVENT_TYPE = 'touchleave';  //touch device\n}else if ( 'ontouchstart' in document.documentElement ){\n   var FRIES_EVENT_TYPE = 'touchstart';  //touch device\n}else{\n   var FRIES_EVENT_TYPE = 'click'; //desktop\n}\nand then instead of:\ndocument.addEventListener( 'touchstart', function (e) {\nI use\ndocument.addEventListener( FRIES_EVENT_TYPE, function (e) {\n. Well I honestly disabled the stack.js file\nI only use the spinner.js and the tabs.js whenever needed\n. There are no issues with stack.js but I found it would be better not to include it\neverything works fine without it\nI really hope that soon I can contribute all my changes to fries!\n. I guess you didn't notice that because the examples don't have any page that scrolls.. if you can try it on any phone you can see it clearly\n. ",
    "Mtillmann": "I'm sorry that my message was confusing. What I was refering to was this:\njavascript\nsliderItems[s].style.webkitTransform = 'translateX('+ ((targetIndex == 0) ? 0 : '-' + (targetIndex * 100)) +'%)';\nin tabs.js. I must admit that I haven't looked into it in great detail but my initial suspicion was that the sometimes choppy animation was caused by updating css properties inside a js loop/timeout. The gfx plugin for jquery handles this very well but I was not aware you avoiding jquery\n. I'm sorry that my message was confusing. What I was refering to was this:\njavascript\nsliderItems[s].style.webkitTransform = 'translateX('+ ((targetIndex == 0) ? 0 : '-' + (targetIndex * 100)) +'%)';\nin tabs.js. I must admit that I haven't looked into it in great detail but my initial suspicion was that the sometimes choppy animation was caused by updating css properties inside a js loop/timeout. The gfx plugin for jquery handles this very well but I was not aware you avoiding jquery\n. ",
    "Jehu": "Love to hear that. I think SASS is a good decision!\n. thank you!\n. Love to hear that. I think SASS is a good decision!\n. thank you!\n. ",
    "mohitjain": "Holo Dark theme.. Awesome :+1: \n. +1\n. @jaunesarmiento  Even I am not sure but something like shutdown icon makes more sense. Take a look here. http://icons.iconarchive.com/icons/chromatix/pulse-pack/256/shutdown-icon.png\n\n. Waiting for this one :+1: \n. Thanks a lot for the such a quick response ;)\n. Holo Dark theme.. Awesome :+1: \n. +1\n. @jaunesarmiento  Even I am not sure but something like shutdown icon makes more sense. Take a look here. http://icons.iconarchive.com/icons/chromatix/pulse-pack/256/shutdown-icon.png\n\n. Waiting for this one :+1: \n. Thanks a lot for the such a quick response ;)\n. ",
    "aymanfarhat": "Yes you're totally right my bad, thanks for the swift reply. I am currently evaluating Fries for a project with Phonegap build, will keep you posted if I run into anything. Have a good day :)\n. Oh I see we'll find a way around it then, thanks for the reply and keep up the good work :)\n. By the way turns out the least hackish way is to just enable emulating touch event via Chrome developer tools for debugging the app within the browser https://developers.google.com/chrome-developer-tools/docs/mobile-emulation#emulate-touch-events \n. Actually data-ignore doesn't seem to work, the only time when a tel in a hyperlink is working is when I totally remove stack.js from the page...\n. Issue fixed https://github.com/jaunesarmiento/fries/pull/14\n. Your welcome, you can close my last issue now :)\n. What I find weird is that the fix works fine when testing on the browser yet doesn't work in Phonegap\nEDIT:\nIt still didn't work on Phonegap so I ended up with a workaround(temporary) where for each hyperlink of a tab I added onClick=\"retun false\" in order to prevent propagation and the pushing of the hashbang page into history. preventDefault for the touchend on the window didn't cut it, although it does on chrome which is baffling.\n. I can confirm that calling e.stopPropagation() before or after preventDefault() isnt really making any difference.\n. Yes definitely I'll look again into it when I have time and report back.\n. @aboudard I just tested your code for the back button issue on a phonegap project with Fries, the problem is non existent. In addition to that I highly doubt that the problem is stemming from stack.js , I suggest trying on the side a new Phonegap project without Fries and implement dynamic page loading (which is similar to how Stack.js does) and test the app on the same device.\n. Yes you're totally right my bad, thanks for the swift reply. I am currently evaluating Fries for a project with Phonegap build, will keep you posted if I run into anything. Have a good day :)\n. Oh I see we'll find a way around it then, thanks for the reply and keep up the good work :)\n. By the way turns out the least hackish way is to just enable emulating touch event via Chrome developer tools for debugging the app within the browser https://developers.google.com/chrome-developer-tools/docs/mobile-emulation#emulate-touch-events \n. Actually data-ignore doesn't seem to work, the only time when a tel in a hyperlink is working is when I totally remove stack.js from the page...\n. Issue fixed https://github.com/jaunesarmiento/fries/pull/14\n. Your welcome, you can close my last issue now :)\n. What I find weird is that the fix works fine when testing on the browser yet doesn't work in Phonegap\nEDIT:\nIt still didn't work on Phonegap so I ended up with a workaround(temporary) where for each hyperlink of a tab I added onClick=\"retun false\" in order to prevent propagation and the pushing of the hashbang page into history. preventDefault for the touchend on the window didn't cut it, although it does on chrome which is baffling.\n. I can confirm that calling e.stopPropagation() before or after preventDefault() isnt really making any difference.\n. Yes definitely I'll look again into it when I have time and report back.\n. @aboudard I just tested your code for the back button issue on a phonegap project with Fries, the problem is non existent. In addition to that I highly doubt that the problem is stemming from stack.js , I suggest trying on the side a new Phonegap project without Fries and implement dynamic page loading (which is similar to how Stack.js does) and test the app on the same device.\n. ",
    "teusink": "I cannot confirm the pixels, but I do see indeed differences yes, like you mention. I will lookin to it this week.\n. It is not pixel perfect, but it is nearing stock.\nI base my font-size to 16px and work with percentages and em from there. But when I calculate the sizes back I have different end sizes.\nRoughly:\n- Smartphone portrait: 42,4 px\n- Smartphone landscape: 38,16 px\n- Tablet: 48,76 px\nOptical those values are almost the same as normal stock. But probably due to some other css values in my code I cannot replicatie the values you have (40,48 and 56).\nBut I can confirm that the above 3 situations do apply, concerning resizing.\nSee my css files on github (application.css, application.smartphone.css, application.tablet.css)\nGithub: https://github.com/teusinkorg/jpHolo/tree/master/assets/www/themes\n. Thanks! And thanks for the link. I will check it coming week.\nI measered it with a centimeter (not sure how it is called in English) the action bar. On my devices the heights are (in cm) almost the same between jpHolo and native.\nBut it is still possible that your pixel values are still correct and that some css-thingy in my template is mixxing up things and gives a different value in pixels, but the same in centimeters (due to scaling).\nOn the other hand, 56px on a Nexus 10 looks quite different then on a Galaxy Note 10.1. As it scales the user interface, to give the same look on all screens.\nSo the trick will be, I think, to find a baseline pixels that exactly matches (again, jpHolo is not pixel perfect in that matter :). and scale from there.\nAs I can be a perfectionist with these kind of things, I will continue the search for perfection :).\nI am guesing above and will read the url. Seems very interesting.\nLet's keep in touch (and feel free to use code from jpHolo).\n. Hi, updated my GitHub project: https://github.com/teusinkorg/jpHolo (saw you forked it, so wanted to let you know). Changed the images and layout more to native.\nI will get back to you concerning the url you mentioned. I am very curious how the pixels are calculated and scaled on Android.\n. I checked your supplied URL. I think my dimensions is bit different do to that jQuery Mobile scales and that I overwrite that (partly) with my dimensions.\nAs of now jpHolo is almost perfect (I fiddled with ms paint (go figure) long enough until it matches 99%).\nI think you should stick to the mentioned sizes on the cheat sheet for Fries. You can control the sizes absolute.\nBut consider the fact that the mentioned sizes are NOT pixels, but dp. Dp is density depended and it may vary depending on the physical screen.\nUnit    Units / physical inch   Density independent Same physical size on every screen\ndp  ~160                yes             no\nI am curious about your results with this!\n. I have not read the entire discussion (on holiday :), but the original Android menu icon (3 horizontal stripes) can be found in the sdk (ic_drawer.png) or in jpHolo on GitHub (assets/www/images/icons).\nSorry in advance if I misinterperted the comments :).\n. Nice to see and thanks for your response. One comment is that Snap.js does not follow the Google Design Guidelines presented at Google IO 2013 concerning the nsvigation drawer. Thats why I added the url in the previous post :).\n. Nuf said then :). Have a nice day! :+1: \n. Or spend 25 dollars: http://www.androidicons.com\n. I cannot confirm the pixels, but I do see indeed differences yes, like you mention. I will lookin to it this week.\n. It is not pixel perfect, but it is nearing stock.\nI base my font-size to 16px and work with percentages and em from there. But when I calculate the sizes back I have different end sizes.\nRoughly:\n- Smartphone portrait: 42,4 px\n- Smartphone landscape: 38,16 px\n- Tablet: 48,76 px\nOptical those values are almost the same as normal stock. But probably due to some other css values in my code I cannot replicatie the values you have (40,48 and 56).\nBut I can confirm that the above 3 situations do apply, concerning resizing.\nSee my css files on github (application.css, application.smartphone.css, application.tablet.css)\nGithub: https://github.com/teusinkorg/jpHolo/tree/master/assets/www/themes\n. Thanks! And thanks for the link. I will check it coming week.\nI measered it with a centimeter (not sure how it is called in English) the action bar. On my devices the heights are (in cm) almost the same between jpHolo and native.\nBut it is still possible that your pixel values are still correct and that some css-thingy in my template is mixxing up things and gives a different value in pixels, but the same in centimeters (due to scaling).\nOn the other hand, 56px on a Nexus 10 looks quite different then on a Galaxy Note 10.1. As it scales the user interface, to give the same look on all screens.\nSo the trick will be, I think, to find a baseline pixels that exactly matches (again, jpHolo is not pixel perfect in that matter :). and scale from there.\nAs I can be a perfectionist with these kind of things, I will continue the search for perfection :).\nI am guesing above and will read the url. Seems very interesting.\nLet's keep in touch (and feel free to use code from jpHolo).\n. Hi, updated my GitHub project: https://github.com/teusinkorg/jpHolo (saw you forked it, so wanted to let you know). Changed the images and layout more to native.\nI will get back to you concerning the url you mentioned. I am very curious how the pixels are calculated and scaled on Android.\n. I checked your supplied URL. I think my dimensions is bit different do to that jQuery Mobile scales and that I overwrite that (partly) with my dimensions.\nAs of now jpHolo is almost perfect (I fiddled with ms paint (go figure) long enough until it matches 99%).\nI think you should stick to the mentioned sizes on the cheat sheet for Fries. You can control the sizes absolute.\nBut consider the fact that the mentioned sizes are NOT pixels, but dp. Dp is density depended and it may vary depending on the physical screen.\nUnit    Units / physical inch   Density independent Same physical size on every screen\ndp  ~160                yes             no\nI am curious about your results with this!\n. I have not read the entire discussion (on holiday :), but the original Android menu icon (3 horizontal stripes) can be found in the sdk (ic_drawer.png) or in jpHolo on GitHub (assets/www/images/icons).\nSorry in advance if I misinterperted the comments :).\n. Nice to see and thanks for your response. One comment is that Snap.js does not follow the Google Design Guidelines presented at Google IO 2013 concerning the nsvigation drawer. Thats why I added the url in the previous post :).\n. Nuf said then :). Have a nice day! :+1: \n. Or spend 25 dollars: http://www.androidicons.com\n. ",
    "MiguelBel": "Yep, this solve this:\n\nTo this:\n\nMaybe is the HTML\n<li class=\"loadedSMS list-item-multi-line\">\n  <h3>From: '+ from +'</h3>\n  <p class=\"toWrap\">'+ message +'</p>\n  <p><strong>'+ time +'</strong></p>\n</li>\n. Yep, this solve this:\n\nTo this:\n\nMaybe is the HTML\n<li class=\"loadedSMS list-item-multi-line\">\n  <h3>From: '+ from +'</h3>\n  <p class=\"toWrap\">'+ message +'</p>\n  <p><strong>'+ time +'</strong></p>\n</li>\n. ",
    "aboudard": "@jadjoubran :\nLooks nice, fading effect quite close to the original Toast.\nI see the 5px padding in the box, did you test on different resolutions ?\n:+1: \n. @jadjoubran oh no it looks great, I just wonder if the render is not too different on small resolutions and big ones, I'm testing right now :)\n. @jadjoubran \nAbout the Toast code, I would recommend the use of literal object as parameters, easy to implement and much easer to code with.\nin the Class you would find something like that :\nfunction Android_Toast(){\nthis.timeout_id = null;\nthis.duration = 3000;\nthis.content = '';\nthis.position = 'bottom';\nfor (var n in arguments[0]) { \n    this[n] = arguments[0][n];\n    console.log(arguments[0][n]); // please remove me ;)\n}\n}\nthe call would look like that :\nvar toast = new Android_Toast({content: 'Hello Fries', duration: 5000});\nwhat do you think ?\n. Even better with the prototype !\nI didn't mean to refactor the whole Toast :)\n. @jadjoubran : it's done !\n. For information, for me : Tabs work fine on Eclipse Emulator, just about to test on device.\n\nBy the way, do you plan to handle gestures ?\nI thinks about the tabs especially, where people expect viewpager behavior.\nAwesome work anyway, totally kicks some *** !\n. truly off topic, sorry :)\nthanks again !\n. I use 1.0.0 according to the readme, I juste downloded the master.\nI tried just now to catch the backbutton with phonegap, but with no success, I try harder :D\n. I am right now :)\nI can't load any console at all on new-contact.html ...\nAdded this in the bottom of the page (works perfect in index.html)\n```\n\n\n    window.addEventListener('load', init, false);\n    function ready(e){\n        console.log(\"Loaded\");\n        document.addEventListener(\"backbutton\", onBackKeyDown, false);\n    }\n\n    function onBackKeyDown() {\n        window.history.go(-1);\n        console.log(\"Back\");\n    }\n\n    function onError(error) {\n        console.error(JSON.stringify(error));\n    }\n\n    function init(e){\n        document.addEventListener('deviceready', ready, false);\n        console.log(\"Init Loaded\");\n    }\n\n```\n. Well, it seem like there is really a problem with the back button, when I have activated multiple tabs, it looks like application is freezing, and sometimes I see the pages with no style at all ... pretty bad ... I try to see if this behavior is caused by the webview component, I'll install Fries on a http server to be sure.\n. Yes, that's very strange. here is what I did :\n- I see that pressing back button on the device makes me go out of application even when I am on new-contact.html for example.\n- I think \"hey let's see what phonegap says in the backbutton event\"\n- I plug phonegap.js, set the listener (in new-contact.html)\n- no luck, absolutely no javascript is loaded, native or phonegap event ... none\n- I plug phonegap.js and listeners in index.html > events work just fine\n  ...\n  I keep on :)\n. Well there is no \"code of mine\" to test, my simple test was to install both on a device and an emulator a simple Android / Phonegap app with fries demo pages.\nI will try to work on a brand new project like you say, thanks for the advice.\n. Ok, I made a new Phonegap app with phonegap build, starting from both sample project from Fries and Phonegap-start, and the problem doesn't happen !\nMy first phonegap project (with the bug) was built with the Android dedicated ant command line \"create\" ... I will try to reproduce, that might be a good advice ... not using this build ... :| \nthat would be more relevant than saying \"non existent\" ;)\n. Will test that !\nOh I have a question,\nSince you use scss, why do you implement transitions and other css3 features \"by hand\" ?\nDon't you want to use compass mixins ?\nJust a question, I'm no expert on that really.\n. That's a good point :)\n. @jadjoubran :\nLooks nice, fading effect quite close to the original Toast.\nI see the 5px padding in the box, did you test on different resolutions ?\n:+1: \n. @jadjoubran oh no it looks great, I just wonder if the render is not too different on small resolutions and big ones, I'm testing right now :)\n. @jadjoubran \nAbout the Toast code, I would recommend the use of literal object as parameters, easy to implement and much easer to code with.\nin the Class you would find something like that :\nfunction Android_Toast(){\nthis.timeout_id = null;\nthis.duration = 3000;\nthis.content = '';\nthis.position = 'bottom';\nfor (var n in arguments[0]) { \n    this[n] = arguments[0][n];\n    console.log(arguments[0][n]); // please remove me ;)\n}\n}\nthe call would look like that :\nvar toast = new Android_Toast({content: 'Hello Fries', duration: 5000});\nwhat do you think ?\n. Even better with the prototype !\nI didn't mean to refactor the whole Toast :)\n. @jadjoubran : it's done !\n. For information, for me : Tabs work fine on Eclipse Emulator, just about to test on device.\n\nBy the way, do you plan to handle gestures ?\nI thinks about the tabs especially, where people expect viewpager behavior.\nAwesome work anyway, totally kicks some *** !\n. truly off topic, sorry :)\nthanks again !\n. I use 1.0.0 according to the readme, I juste downloded the master.\nI tried just now to catch the backbutton with phonegap, but with no success, I try harder :D\n. I am right now :)\nI can't load any console at all on new-contact.html ...\nAdded this in the bottom of the page (works perfect in index.html)\n```\n\n\n    window.addEventListener('load', init, false);\n    function ready(e){\n        console.log(\"Loaded\");\n        document.addEventListener(\"backbutton\", onBackKeyDown, false);\n    }\n\n    function onBackKeyDown() {\n        window.history.go(-1);\n        console.log(\"Back\");\n    }\n\n    function onError(error) {\n        console.error(JSON.stringify(error));\n    }\n\n    function init(e){\n        document.addEventListener('deviceready', ready, false);\n        console.log(\"Init Loaded\");\n    }\n\n```\n. Well, it seem like there is really a problem with the back button, when I have activated multiple tabs, it looks like application is freezing, and sometimes I see the pages with no style at all ... pretty bad ... I try to see if this behavior is caused by the webview component, I'll install Fries on a http server to be sure.\n. Yes, that's very strange. here is what I did :\n- I see that pressing back button on the device makes me go out of application even when I am on new-contact.html for example.\n- I think \"hey let's see what phonegap says in the backbutton event\"\n- I plug phonegap.js, set the listener (in new-contact.html)\n- no luck, absolutely no javascript is loaded, native or phonegap event ... none\n- I plug phonegap.js and listeners in index.html > events work just fine\n  ...\n  I keep on :)\n. Well there is no \"code of mine\" to test, my simple test was to install both on a device and an emulator a simple Android / Phonegap app with fries demo pages.\nI will try to work on a brand new project like you say, thanks for the advice.\n. Ok, I made a new Phonegap app with phonegap build, starting from both sample project from Fries and Phonegap-start, and the problem doesn't happen !\nMy first phonegap project (with the bug) was built with the Android dedicated ant command line \"create\" ... I will try to reproduce, that might be a good advice ... not using this build ... :| \nthat would be more relevant than saying \"non existent\" ;)\n. Will test that !\nOh I have a question,\nSince you use scss, why do you implement transitions and other css3 features \"by hand\" ?\nDon't you want to use compass mixins ?\nJust a question, I'm no expert on that really.\n. That's a good point :)\n. ",
    "captn3m0": "Yes, I think so. I don't have ~~much~~ any experience with android development, but a quick look at that page tells me that this is what I want.\n. Yes, I think so. I don't have ~~much~~ any experience with android development, but a quick look at that page tells me that this is what I want.\n. ",
    "webnull": "I'm also waiting for this feature, i want to include that window in my application.\n. I'm also waiting for this feature, i want to include that window in my application.\n. ",
    "mwarzynski": "It could be very helpful... I'm waiting too!\n. It could be very helpful... I'm waiting too!\n. ",
    "hell03610": "Hi, I'm trying to emulate a page rendered with data from server, thinking in a phonegap app, so i need to know which page is just loaded in dom. I'm attached to push event, but i cannot ask for the page-id as the page is the container and it is not replaced, just its innerhtml. Yes, i could ask for something within, but there is not root tag inside page, page is the perfect candidate...so i chaged a little stack.js so when it trows the event, it has the id of the page that was just pushed. (or maybe stack.js should change the id of the page?, i think jqm does that...)\nBack button was not working in that example, so i had to move inside doXHR the cachePush before doing the call, as onSuccess was winning the race and inserting the new id in the cacheBack stack instead of the old one.\nAnyone has played to try to have fries pages locally and remote data served by jsons?\nYou can see an example here: https://github.com/hell03610/fries/tree/serverside\nIn files master.html and detail.html\nFingerBlast is disabled, as I could not managed the up button in details to work properly. I use the \"Emulate touch events\" from Chrome Dev instead.\n. I wrote too quickly, with the min version it does not happen, i'm going to build the branch with grunt, and i'll get back to you :)\n. yes, i double checked it, it's happening in wip branch but works fine in master :(\n. Hi, I'm trying to emulate a page rendered with data from server, thinking in a phonegap app, so i need to know which page is just loaded in dom. I'm attached to push event, but i cannot ask for the page-id as the page is the container and it is not replaced, just its innerhtml. Yes, i could ask for something within, but there is not root tag inside page, page is the perfect candidate...so i chaged a little stack.js so when it trows the event, it has the id of the page that was just pushed. (or maybe stack.js should change the id of the page?, i think jqm does that...)\nBack button was not working in that example, so i had to move inside doXHR the cachePush before doing the call, as onSuccess was winning the race and inserting the new id in the cacheBack stack instead of the old one.\nAnyone has played to try to have fries pages locally and remote data served by jsons?\nYou can see an example here: https://github.com/hell03610/fries/tree/serverside\nIn files master.html and detail.html\nFingerBlast is disabled, as I could not managed the up button in details to work properly. I use the \"Emulate touch events\" from Chrome Dev instead.\n. I wrote too quickly, with the min version it does not happen, i'm going to build the branch with grunt, and i'll get back to you :)\n. yes, i double checked it, it's happening in wip branch but works fine in master :(\n. ",
    "camagu": "Nice! Thanks.\n. Nice! Thanks.\n. ",
    "joelstahre": "@jaunesarmiento no worrys.\nim testing on my Samsung Galaxy S4 \nModel: GT-I9505\nAndroid-version : 4.2.2\nthere is no problem when I run it on different emulators, but when I test on my device i sometimes get problems with the layout.\nI post some more pictures below .\n//Thanks \n\n\n\n. I tested the application on the htc one, and I experienced no problems.\nso I guess it could be a problem just on the galaxy s4.\n.  @jaunesarmiento no worrys.\nim testing on my Samsung Galaxy S4 \nModel: GT-I9505\nAndroid-version : 4.2.2\nthere is no problem when I run it on different emulators, but when I test on my device i sometimes get problems with the layout.\nI post some more pictures below .\n//Thanks \n\n\n\n. I tested the application on the htc one, and I experienced no problems.\nso I guess it could be a problem just on the galaxy s4.\n. ",
    "YEYE77": "I have a phonegap app that use flexbox (with the -webkit prefix) and the layout is completly broken. I think it's an issue with the latest update on the S4 but havent found any workaround right now.\n. look like the problem comes from \"-webkit-transform: translate3d()\" replacing this by  \"-webkit-transform: translate()\" fixed all the issues in my app.\n. I have a phonegap app that use flexbox (with the -webkit prefix) and the layout is completly broken. I think it's an issue with the latest update on the S4 but havent found any workaround right now.\n. look like the problem comes from \"-webkit-transform: translate3d()\" replacing this by  \"-webkit-transform: translate()\" fixed all the issues in my app.\n. ",
    "kaansoral": "The S4 android issue existed before, the UI was being messed up non deterministically, however the latest update made the problem \"always on\"\nIf you download/test some other phonegap apps they all have UI issues, so the best thing to do is wait for it to be fixed (I wonder if Android has an issue tracker for outsiders)\n. I've just tested cordova 3.1.0 - compared to older versions, while my app glitches right away on older versions, it is solid using 3.1.0 - even if the issue re-occurs in future - at least I can safely say that there is a solid improvement - wondering what it could be\nagain not related to fries, but this issue has became a go-to place for S4 issues :)\n. The S4 android issue existed before, the UI was being messed up non deterministically, however the latest update made the problem \"always on\"\nIf you download/test some other phonegap apps they all have UI issues, so the best thing to do is wait for it to be fixed (I wonder if Android has an issue tracker for outsiders)\n. I've just tested cordova 3.1.0 - compared to older versions, while my app glitches right away on older versions, it is solid using 3.1.0 - even if the issue re-occurs in future - at least I can safely say that there is a solid improvement - wondering what it could be\nagain not related to fries, but this issue has became a go-to place for S4 issues :)\n. ",
    "neonxp": "Same problem at Galaxy S3 with leaked android 4.2.2\n. Same problem at Galaxy S3 with leaked android 4.2.2\n. ",
    "cherimo": "I had this issue for weeks now and I posted it about it, but it never got approved --!\nAlso an Android Device 4.2.2 with phonegap 2.9.0\n. Is there any solution to this issue ??\n. I had this issue for weeks now and I posted it about it, but it never got approved --!\nAlso an Android Device 4.2.2 with phonegap 2.9.0\n. Is there any solution to this issue ??\n. ",
    "trullock": "I have exactly the same issue with my PhoneGap app on the GS4. \nI am not using flexbox, but I am using translate3d, I shall investigate and see if replacing this with translate has any positive effect. fwiw turning HW acceleration on/off doesnt help.\nIt doesnt occur on a Nexus 7 running 4.2.2 or 4.3, or a GS2 running CM10 (4.2.2)\n. The GS4 gpu is crapola. I never 'solved' this beyond trying random\nworkarounds described here.\nAnnoying\nOn 9 Jul 2014 22:54, \"KailoonZeng\" notifications@github.com wrote:\n\nhi,is there any solution for this issue? i have the same problem with\nSamsung galaxy S4 , but it dose n't occur on other several models of\nSamsung phones. by the way,the follow line can make things a little\nbetter,but just a little better:\ntext-transform: translateZ(0);\ntransform:translateZ(0);\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/jaunesarmiento/fries/issues/31#issuecomment-48525772.\n. I have exactly the same issue with my PhoneGap app on the GS4. \nI am not using flexbox, but I am using translate3d, I shall investigate and see if replacing this with translate has any positive effect. fwiw turning HW acceleration on/off doesnt help.\n\nIt doesnt occur on a Nexus 7 running 4.2.2 or 4.3, or a GS2 running CM10 (4.2.2)\n. The GS4 gpu is crapola. I never 'solved' this beyond trying random\nworkarounds described here.\nAnnoying\nOn 9 Jul 2014 22:54, \"KailoonZeng\" notifications@github.com wrote:\n\nhi,is there any solution for this issue? i have the same problem with\nSamsung galaxy S4 , but it dose n't occur on other several models of\nSamsung phones. by the way,the follow line can make things a little\nbetter,but just a little better:\ntext-transform: translateZ(0);\ntransform:translateZ(0);\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/jaunesarmiento/fries/issues/31#issuecomment-48525772.\n. \n",
    "gregavola": "Has anyone fixed this issue? Seeing it across the app - not using translate3d, but HW acceleration is on.\nGreg\n. I'm not using an S4 - I've been deploying using PhoneGap and have seen\nproblem seen problems with S4 - so I assumed this might be a solution.\nGreg\nOn Tue, Aug 13, 2013 at 10:13 PM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nHi @gregavola https://github.com/gregavola, are you using a GS4? As I\nsaid in my previous comment, I don't have an S4 where I can test this issue\non. But from the looks of it, the problem seemed to have occurred because\nof translate3d. But since other Android devices don't have any problems\nwith rendering, the culprit must be the default browser that S4s use to\nrender a webview.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/31#issuecomment-22611116\n.\n\n\nGreg Avola\nhttp://gregavola.me\n(c) 508.596.8811\n. Has anyone fixed this issue? Seeing it across the app - not using translate3d, but HW acceleration is on.\nGreg\n. I'm not using an S4 - I've been deploying using PhoneGap and have seen\nproblem seen problems with S4 - so I assumed this might be a solution.\nGreg\nOn Tue, Aug 13, 2013 at 10:13 PM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nHi @gregavola https://github.com/gregavola, are you using a GS4? As I\nsaid in my previous comment, I don't have an S4 where I can test this issue\non. But from the looks of it, the problem seemed to have occurred because\nof translate3d. But since other Android devices don't have any problems\nwith rendering, the culprit must be the default browser that S4s use to\nrender a webview.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/31#issuecomment-22611116\n.\n\n\nGreg Avola\nhttp://gregavola.me\n(c) 508.596.8811\n. ",
    "ashishbhatt": "Hey guys, can we use media query? \n. Hey guys, can we use media query? \n. ",
    "andywhite37": "This is not related specifically to fries, but I wanted to add a note that I've seen this same problem occur in PhoneGap 2.7 using Bootstrap UI components (Bootstrap 2.2.2), running on the Galaxy S4.  There is one occurrence of translate3d in the Bootstrap CSS (bootstrap-responsive.css), and I changed it to \"translate\".  At first it appeared to help address the UI glitch, but later on the problem came back randomly.  I'm also not using any flexbox layout stuff.  It does appear to be a rendering issue or hardware acceleration issue, specifically on the Galaxy S4, and possibly other Samsung devices from that time period.  To add one last note, it appears to mainly affect UI elements that have position: fixed.  It does not seem to crop up for non-fixed elements.\n. This is not related specifically to fries, but I wanted to add a note that I've seen this same problem occur in PhoneGap 2.7 using Bootstrap UI components (Bootstrap 2.2.2), running on the Galaxy S4.  There is one occurrence of translate3d in the Bootstrap CSS (bootstrap-responsive.css), and I changed it to \"translate\".  At first it appeared to help address the UI glitch, but later on the problem came back randomly.  I'm also not using any flexbox layout stuff.  It does appear to be a rendering issue or hardware acceleration issue, specifically on the Galaxy S4, and possibly other Samsung devices from that time period.  To add one last note, it appears to mainly affect UI elements that have position: fixed.  It does not seem to crop up for non-fixed elements.\n. ",
    "Kaarthikeyaan": "HI Team,\nI am using Phonegap 2.7.0 with appframework UI,  the app looks very nice except Samsung Galaxy s4.  In S4 HTML input elements breaks, some images disappears and all drastic changes happens.  My resources are present within the bundle no request is triggered outside the application.  When i render the html in browser it works fine, the same is not working in webview.  Please give some solution to achieve this.\nI have tried by removing translate3d in css. But no use of it.\nThanks,\nKarthik\n. HI Team,\nI am using Phonegap 2.7.0 with appframework UI,  the app looks very nice except Samsung Galaxy s4.  In S4 HTML input elements breaks, some images disappears and all drastic changes happens.  My resources are present within the bundle no request is triggered outside the application.  When i render the html in browser it works fine, the same is not working in webview.  Please give some solution to achieve this.\nI have tried by removing translate3d in css. But no use of it.\nThanks,\nKarthik\n. ",
    "sidneys": "This is a bug in Samsung phones' webviews concerning position: fixed elements. Don't bother trying to fix it.\n. This is a bug in Samsung phones' webviews concerning position: fixed elements. Don't bother trying to fix it.\n. ",
    "KailoonZeng": "hi,is there any solution for this issue? i have the same problem with Samsung galaxy S4 , but it dose n't occur on other several models of Samsung phones. by the way,the follow line can make things a little better,but just a little better:\n        text-transform: translateZ(0);\n    transform:translateZ(0);\n. hi,is there any solution for this issue? i have the same problem with Samsung galaxy S4 , but it dose n't occur on other several models of Samsung phones. by the way,the follow line can make things a little better,but just a little better:\n        text-transform: translateZ(0);\n    transform:translateZ(0);\n. ",
    "Sabirahmed": "I am facing the same issue on samsung S4 devices.\n1)  Layout breaking\n2) Camera issue: Capture the image then save, After click on save button goes to splash screen. It's working on other devices iOS / Android.\n3)  Anomalous behavior of Apps.\nPlease let me know, if anyone has done this issue.\nRegards,\nRAkesh Nigam\nemail: rakesh.nigam@srmtechsol.com\n. I am facing the same issue on samsung S4 devices.\n1)  Layout breaking\n2) Camera issue: Capture the image then save, After click on save button goes to splash screen. It's working on other devices iOS / Android.\n3)  Anomalous behavior of Apps.\nPlease let me know, if anyone has done this issue.\nRegards,\nRAkesh Nigam\nemail: rakesh.nigam@srmtechsol.com\n. ",
    "kyleraymorgan": "Also, the 'menu' icon is missing - the one that has three horizontal lines. I don't think that this is included in the Android Icons pack (http://developer.android.com/design/style/iconography.html), so I don't think android provides it's own. So the menu icon must be a custom icon, but regardless, It would make my life a bit easier to have this icon already included with fries - because I've used that icon on almost every project I've worked on. Hope to see it soon. And thanks for fries!\n. Yes, Action Bar Icon Pack is licensed under CC2.5. I don't know a whole lot about that license though. I wonder if it would be better to custom make this icon as an svg image and not include it in the icon pack. Also if you decide to remake ALL the icons, please be very careful. The point of fries is to look like android. The icons are the big give-away. If the icons look any different (even the slightest bit) then it just looks like some bad knock off. So if you do go down this route, I don't know how much you know about iconography but, I'd suggest reading the link I provided in my original comment, and this here http://www.behance.net/gallery/Google-Visual-Assets-Guidelines-Part-1/9028077 (there are two parts)\n. Also, the 'menu' icon is missing - the one that has three horizontal lines. I don't think that this is included in the Android Icons pack (http://developer.android.com/design/style/iconography.html), so I don't think android provides it's own. So the menu icon must be a custom icon, but regardless, It would make my life a bit easier to have this icon already included with fries - because I've used that icon on almost every project I've worked on. Hope to see it soon. And thanks for fries!\n. Yes, Action Bar Icon Pack is licensed under CC2.5. I don't know a whole lot about that license though. I wonder if it would be better to custom make this icon as an svg image and not include it in the icon pack. Also if you decide to remake ALL the icons, please be very careful. The point of fries is to look like android. The icons are the big give-away. If the icons look any different (even the slightest bit) then it just looks like some bad knock off. So if you do go down this route, I don't know how much you know about iconography but, I'd suggest reading the link I provided in my original comment, and this here http://www.behance.net/gallery/Google-Visual-Assets-Guidelines-Part-1/9028077 (there are two parts)\n. ",
    "Turbo87": "Hi @jaunesarmiento, please read the discussion that we had about this issue at https://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/issues/2\ntl;dr: we figured that since the original icon set is CC-BY-2.5 we didn't really have the option to license the webfont under anything less restrictive, without suggesting to the user that he doesn't have to attribute anyone. I'm happy to relicense though if it is possible and legal.\n. @jaunesarmiento as I mentioned in the issue, I'm not actually that interested in the attribution, I only chose the license to be compatible with the original iconset. Looks alright :)\n. Hi @jaunesarmiento, please read the discussion that we had about this issue at https://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/issues/2\ntl;dr: we figured that since the original icon set is CC-BY-2.5 we didn't really have the option to license the webfont under anything less restrictive, without suggesting to the user that he doesn't have to attribute anyone. I'm happy to relicense though if it is possible and legal.\n. @jaunesarmiento as I mentioned in the issue, I'm not actually that interested in the attribution, I only chose the license to be compatible with the original iconset. Looks alright :)\n. ",
    "justindomingue": "Don't be sorry! You have done an amazing work with Fries!\nIt would be nice if the docs were in your GitHub repository so we could send pull requests.\n. Don't be sorry! You have done an amazing work with Fries!\nIt would be nice if the docs were in your GitHub repository so we could send pull requests.\n. ",
    "hbrls": "@jaunesarmiento then which do you prefer? require.js or namespace like window.Fries || window.Fries = {}; window.Fries.spin = blabla;\n. @jaunesarmiento then which do you prefer? require.js or namespace like window.Fries || window.Fries = {}; window.Fries.spin = blabla;\n. ",
    "florindumitru": "@jaunesarmiento pls also need to know if fries work on iOS and android 2.2 ?\n. @jaunesarmiento pls also need to know if fries work on iOS and android 2.2 ?\n. ",
    "grobmeier": "Hi\nit's good you have the permission of Tobias and you should say so on your webpage: \"no license\" is a serious blocker for using an open source project. Having the permission of the IP owner is actually good. In best case you have it in signed form. Tobias really should make clear on his license, I will open an issue on his project for that. Otherwise i need to manually exclude his contribution, which would be a shame as they look very nice.\nThanks for considering!\nChristian\n. Issue is here: https://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/issues/2\nin case you are interested\n. Tobias mentioned he is going to apply the CC Attribution license:\nhttps://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/issues/2\n@teusinkorg: I am fine with spending 25$, but this doesn't fix the issue with the work of Tobias.\n. You mean CC 2.5?\nTobias made things clear and licensed under 2.5:\nhttps://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/commit/dc5f260b27cb87af9c17dd261d43fa65c0f1ca82\nPlease note, I can't find the attribution to Google (well, and Tobias now) on the Fries website. Icons are used there too (in the examples). I am not a lawyer and surely will not hunt you on that, just saying.\nA note for Fries users that attribution needs to be given would be helpful still. Please consider reopening this issue.\nI will not follow this any longer, because I know what I have to do. \nThanks for patience and work, we enjoy Fries and will give you credits in our app.\n. Hi\nit's good you have the permission of Tobias and you should say so on your webpage: \"no license\" is a serious blocker for using an open source project. Having the permission of the IP owner is actually good. In best case you have it in signed form. Tobias really should make clear on his license, I will open an issue on his project for that. Otherwise i need to manually exclude his contribution, which would be a shame as they look very nice.\nThanks for considering!\nChristian\n. Issue is here: https://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/issues/2\nin case you are interested\n. Tobias mentioned he is going to apply the CC Attribution license:\nhttps://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/issues/2\n@teusinkorg: I am fine with spending 25$, but this doesn't fix the issue with the work of Tobias.\n. You mean CC 2.5?\nTobias made things clear and licensed under 2.5:\nhttps://github.com/Turbo87/Android-Action-Bar-Icon-Pack-Font/commit/dc5f260b27cb87af9c17dd261d43fa65c0f1ca82\nPlease note, I can't find the attribution to Google (well, and Tobias now) on the Fries website. Icons are used there too (in the examples). I am not a lawyer and surely will not hunt you on that, just saying.\nA note for Fries users that attribution needs to be given would be helpful still. Please consider reopening this issue.\nI will not follow this any longer, because I know what I have to do. \nThanks for patience and work, we enjoy Fries and will give you credits in our app.\n. ",
    "m-vdv": "Take a look at https://github.com/ftlabs/fastclick\n. Take a look at https://github.com/ftlabs/fastclick\n. ",
    "Splact": "I'm experiencing the same issue with v2.0.0\n. I'm experiencing the same issue with v2.0.0\n. ",
    "ithustle": "Hi @jaunesarmiento I've an Android 2.3.7 device, if you want i can be you test-man-droid :)\n. @jaunesarmiento I got you back ;)\n. Hi @jaunesarmiento, I already test Overthrow, not today, but few days ago and didn't work, but at now am using nicescroll.js and work well :) http://areaaperta.com/nicescroll/\n. I think  the biggest concern now is putting to work Tab and Spinner on Android 3.x early. What you say, @jaunesarmiento ?\n. So, in this case what you think to do? @jaunesarmiento \n. Hi @jaunesarmiento I've an Android 2.3.7 device, if you want i can be you test-man-droid :)\n. @jaunesarmiento I got you back ;)\n. Hi @jaunesarmiento, I already test Overthrow, not today, but few days ago and didn't work, but at now am using nicescroll.js and work well :) http://areaaperta.com/nicescroll/\n. I think  the biggest concern now is putting to work Tab and Spinner on Android 3.x early. What you say, @jaunesarmiento ?\n. So, in this case what you think to do? @jaunesarmiento \n. ",
    "MichaelDC": "I have used nicescroll but it brings bugs when i want to go back in my app, is there another tool to bring scroll on android versions lower than 4.0?\n. Hi again, I have used Iscroll.js but i have a problem, the scroll returns to the top of the page, I searched on internet for some hints but each solutions did work.\n. I have used nicescroll but it brings bugs when i want to go back in my app, is there another tool to bring scroll on android versions lower than 4.0?\n. Hi again, I have used Iscroll.js but i have a problem, the scroll returns to the top of the page, I searched on internet for some hints but each solutions did work.\n. ",
    "hackersys": "@MichaelDC use iScroll.js\n. @MichaelDC use iScroll.js\n. ",
    "EltonZhang13": "Hmm, must've been from the master branch. Thanks for the reply. I'm gonna update you on my situation; hopefully, you'll still reply.\n. Could you explain to me why the error occurred? In other words, what changed in the code fixed the error.\n. Could you explain to me why the error occurred? In other words, what changed in the code that fixed the error.\n. It does, thanks for that. Another thing that you might have fixed (but I'm just to dumb to find by myself) is that Stack.js transitions into another html page don't allow for js specific to that page to be run. \n. Hmm, must've been from the master branch. Thanks for the reply. I'm gonna update you on my situation; hopefully, you'll still reply.\n. Could you explain to me why the error occurred? In other words, what changed in the code fixed the error.\n. Could you explain to me why the error occurred? In other words, what changed in the code that fixed the error.\n. It does, thanks for that. Another thing that you might have fixed (but I'm just to dumb to find by myself) is that Stack.js transitions into another html page don't allow for js specific to that page to be run. \n. ",
    "jituiitm": "Hi @jaunesarmiento , \nThanks for quick reply.\nI tested first on chrome desktop. Then I did with phonegap on android.\nBoth the cases i find i can not access radio button functionality. Even i removed the radio button code and pasted a simple HTML radio button. Even there I can only able to click one radio button, but I have 2 of them. Once clicked on one i can not switch to other.\nRegarding the code,\nI copied your master file, from https://github.com/jaunesarmiento/fries/archive/master.zip\nThen through MAMP i loaded it and then i hit localhost/fries-master/examples/index.html\nThen I clicked on forms. There i tried clicking on switch and radio buttons.\nFor phonegap, I copied the dist,js and index.html to my assets/www folder.\nLet me know if there is another way to do it. \nAlso if its not more to ask, can we do a quick skype or hangout ?\nThanks\n. Hi,\nAndroid 4.1.2 and chrome latest version.\nAnyway even i will try whole night and will let u know if i get any\nconclusion\nThanks\nOn Mon, Sep 30, 2013 at 9:52 PM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nThat's odd. Hmm. On what device and Android version are you testing the\nPhonegap app on? Can't do skype/hangout right now unfortunately. I'll check\nthis on my end. Will keep you posted.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/66#issuecomment-25378242\n.\n. Hi @jaunesarmiento , \nThanks for quick reply.\n\nI tested first on chrome desktop. Then I did with phonegap on android.\nBoth the cases i find i can not access radio button functionality. Even i removed the radio button code and pasted a simple HTML radio button. Even there I can only able to click one radio button, but I have 2 of them. Once clicked on one i can not switch to other.\nRegarding the code,\nI copied your master file, from https://github.com/jaunesarmiento/fries/archive/master.zip\nThen through MAMP i loaded it and then i hit localhost/fries-master/examples/index.html\nThen I clicked on forms. There i tried clicking on switch and radio buttons.\nFor phonegap, I copied the dist,js and index.html to my assets/www folder.\nLet me know if there is another way to do it. \nAlso if its not more to ask, can we do a quick skype or hangout ?\nThanks\n. Hi,\nAndroid 4.1.2 and chrome latest version.\nAnyway even i will try whole night and will let u know if i get any\nconclusion\nThanks\nOn Mon, Sep 30, 2013 at 9:52 PM, Jaune Sarmiento\nnotifications@github.comwrote:\n\nThat's odd. Hmm. On what device and Android version are you testing the\nPhonegap app on? Can't do skype/hangout right now unfortunately. I'll check\nthis on my end. Will keep you posted.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jaunesarmiento/fries/issues/66#issuecomment-25378242\n.\n. \n",
    "guilhermecaldas": "Hi, I tested right now in my Chrome browser Desktop. The error happens only when fingerblast.js is enabled. So: \nFingerblast enabled:\nWorks: Tabs\nDoesn't work: check box, switch and radio buttons\n\"I can confirm that the on/off switches and radio buttons does not work on desktop. But I've tried them on https://github.com/jaunesarmiento/fries-phonegap and they work fine.\"\nYes, I'm sure you were not using fingerblast on phonegap, as say your instructions, right(to only use on desktop test)?\nI believe it's not really a bug... Right?\n. Hi bobarna! Did you tried to run on mobile? It looks ok on my Android. \nWhich navigator are you testing your page?\n. Hi, I tested right now in my Chrome browser Desktop. The error happens only when fingerblast.js is enabled. So: \nFingerblast enabled:\nWorks: Tabs\nDoesn't work: check box, switch and radio buttons\n\"I can confirm that the on/off switches and radio buttons does not work on desktop. But I've tried them on https://github.com/jaunesarmiento/fries-phonegap and they work fine.\"\nYes, I'm sure you were not using fingerblast on phonegap, as say your instructions, right(to only use on desktop test)?\nI believe it's not really a bug... Right?\n. Hi bobarna! Did you tried to run on mobile? It looks ok on my Android. \nWhich navigator are you testing your page?\n. ",
    "berthojoris": "I have not tried the solution you gave. It seems to run well if we give ID to every page that will be on the go. Have you tried it?\n. I have not tried the solution you gave. It seems to run well if we give ID to every page that will be on the go. Have you tried it?\n. ",
    "soomtong": "thanks a lot! go go fries~\ntake care :)\n. thanks a lot! go go fries~\ntake care :)\n. ",
    "vishnu123": "Is this fixed in Fries v2.0.3?\n. Ok. Thanks A lot :) \n. Is this fixed in Fries v2.0.3?\n. Ok. Thanks A lot :) \n. ",
    "dfrojas": "Yes, look in the page 1 I have a list and each item has a link, each link go to page 2 and the page 2 has other list, but for load the list in the page 2 I have to reload the page, the weird is that the header appears normally but not the list. When I use JQM happens the same but this can fix it with data-ajax=false in JQM.\n. Yes, look in the page 1 I have a list and each item has a link, each link go to page 2 and the page 2 has other list, but for load the list in the page 2 I have to reload the page, the weird is that the header appears normally but not the list. When I use JQM happens the same but this can fix it with data-ajax=false in JQM.\n. ",
    "imaginabit": "if i comment the lines in 62 63 content.css \n.content {\n ...\n/\n overflow: auto ; \n overflow-x: hidden;\n/\n..\n}\nand i change the action-bars.css adding position: fixed  to .action-bar.fixed-top to made it fixed to the top again \n. if i comment the lines in 62 63 content.css \n.content {\n ...\n/\n overflow: auto ; \n overflow-x: hidden;\n/\n..\n}\nand i change the action-bars.css adding position: fixed  to .action-bar.fixed-top to made it fixed to the top again \n. ",
    "sadiq81": "Any idea on when this will be fixed, would like to use the switch element.\n. Any idea on when this will be fixed, would like to use the switch element.\n. ",
    "stegrams": "I believe thats a FingerBlast usage issue in file example.js starting from line 58.\nI replaced these lines with these:\njavascript\nif (!detect()) { // detect if running on a non mobile browser\n  window.onload = function(){ new FingerBlast('body') };\n}\nNow my form is working fine as I can see.\n. I believe thats a FingerBlast usage issue in file example.js starting from line 58.\nI replaced these lines with these:\njavascript\nif (!detect()) { // detect if running on a non mobile browser\n  window.onload = function(){ new FingerBlast('body') };\n}\nNow my form is working fine as I can see.\n. ",
    "gregnietsky": "One way too fix this but its not pretty is to set page style overflow hidden ... im sure someone smarter @ css will have a proper solution.\n. One way too fix this but its not pretty is to set page style overflow hidden ... im sure someone smarter @ css will have a proper solution.\n. ",
    "eyecatchup": "Added PR #91 \n. > Let's put this on development branch first.\nYeah, that's what I did in my fork too. Sorry, that's my fault. Didn't wanted tor create the PR to be merged into master but rather into a new branch. \n\nI'll set develop as the default branch\n\n:+1: \n\nso we can merge these without affecting the latest stable release.\n\nWell, that's actually what tags are for, isn't it? Even though current master can be considered stable (and shouldn't be default for adding new commits (except for urgent fixes) anyway), I thought the lastest stable is 2.0.3? ;-)\n(BTW, I noticed that you link to the https://github.com/jaunesarmiento/fries/archive/master.zip in the readme file rather than to https://github.com/jaunesarmiento/fries/archive/2.0.3.zip (=latest stable). Is that on purpose?)\n\nAlso, I'll be creating a branch for version 2.1 with a list of features. I'm planning to add both holo dark and light themes to that as well.\n\n:+1: \n. @jaunesarmiento Would you merge my changes from PR #91 into the new develop branch? If so, I can send you a new PR now. In case you don't, note it contains some JS fixes too. You may still want to merge these changes, even though you don't want to merge themes atm.\n. here you go: #93 \n. closing this one\n. Any ETA for v2.1? Need help? If so; What points from your list are you currently working on and/or have a working implementation already? Or can I take on any of the points above, fix it and submit a PR?\n. Sounds great. No stress; take your time. I know what it means working all day long and maintaining open source projects in the free time. We'Re all thankful for your work and it takes the time it takes. ;-)\nSo, would you mind me starting on a sidebar nav implementation?\n. Nope, all I care for is the result. ;-) \nBut just for me to know: any conflicts or what do you mean by \"this is gonna be tough\"?\n. Actually it's not 54 files that were changed! Most of these 54 files are the holo-light files that were not in the main repo before. Thus, they become a \"change\". But in fact these \"changes\" are just plain copies from the holo-light branch.\nAnd finally I had no conflicts at all when I just tried to merge your wip 2.1 and my dev-2.0.4 branch locally. So, what conflicts do you get?\n. checking \nupdate: it's not fingerblast. it's the changes I made here\n// sometimes Android returns a width and height of zero..\n  // so we wait 10ms and try again.\n  // (Taken from Google's internal dots framework file webview.js)\n  var w = document.documentElement.clientWidth || document.body.clientWidth;\n  if ('undefined' === typeof w || w == 0) {\n    setTimeout(function() {\n       // do stuff\n    }, 10);\n    return;\n  }\ncommiting a fix in a sec\n. Added https://github.com/eyecatchup/fries/commit/ac0fd82d3803fd19a181be469d2750e53a65c2d2 to the PR which should fix the broken scripts At least it does on my side. Can you confirm that?\n. Glad that's solved. :+1: \nOkay your wip/v2.1.0 branch is clean now and includes all recent updates as well as both themes. It is right now 11 commits ahead and 2 commits behind your new develop and the master branch (master and develop are on pair atm).\nSo, should I keep sending send new PRs to wip/v2.1.0 or, as previously said, to the new develop branch? Because actually develop branch is useless right now, isn't it?\n. PS: For the meantime, for those looking for a live demo, here's one: https://eyecatchup.github.io/fries/ (Note: This is a different tree that I started a while ago (off of 2.0.3), but fixes have been merged from latest master (plus, others were added).) \n. First, thanks for the feedback @jaunesarmiento.\nThen could you maybe remove the redirect for the GH pages branch to your custom domain, so people can checkout the current state there? Still better than linking into Nirvana, isn't it?\nLast but not least, in case you no longer maintain Fries, what would you say if I'll take over? As you may remember I commited some code a while ago for the wip/v2.1.0 branch and added \"Multi-Theme-Support\" to the demo site. A month ago I started to work on a Material Design based CSS/JS Framework. Now I came back to Fries to see wether I should consider to use Fries as a base (mainly because I liked the simple code base). \nBasically I'd like to merge Fries and my project anyways - so to have only one Framework that serves Holo and Material themes. So, if you don't care anymore anyway, I think it would be a good idea to let me take over. I guess the 1000+ Fries users would appreciate as well.\nWhat do you think?\n. Almost got it. Except for what you said about you can't give up on the project. Don't get me wrong, I'm perfectly fine to work with my fork. But it is somewhat in contrast to the updated README.md - which asks for somebody to take over now!? Could you clarify that last bit for me, please? Thanks (again)! :)\n. Added PR #91 \n. > Let's put this on development branch first.\nYeah, that's what I did in my fork too. Sorry, that's my fault. Didn't wanted tor create the PR to be merged into master but rather into a new branch. \n\nI'll set develop as the default branch\n\n:+1: \n\nso we can merge these without affecting the latest stable release.\n\nWell, that's actually what tags are for, isn't it? Even though current master can be considered stable (and shouldn't be default for adding new commits (except for urgent fixes) anyway), I thought the lastest stable is 2.0.3? ;-)\n(BTW, I noticed that you link to the https://github.com/jaunesarmiento/fries/archive/master.zip in the readme file rather than to https://github.com/jaunesarmiento/fries/archive/2.0.3.zip (=latest stable). Is that on purpose?)\n\nAlso, I'll be creating a branch for version 2.1 with a list of features. I'm planning to add both holo dark and light themes to that as well.\n\n:+1: \n. @jaunesarmiento Would you merge my changes from PR #91 into the new develop branch? If so, I can send you a new PR now. In case you don't, note it contains some JS fixes too. You may still want to merge these changes, even though you don't want to merge themes atm.\n. here you go: #93 \n. closing this one\n. Any ETA for v2.1? Need help? If so; What points from your list are you currently working on and/or have a working implementation already? Or can I take on any of the points above, fix it and submit a PR?\n. Sounds great. No stress; take your time. I know what it means working all day long and maintaining open source projects in the free time. We'Re all thankful for your work and it takes the time it takes. ;-)\nSo, would you mind me starting on a sidebar nav implementation?\n. Nope, all I care for is the result. ;-) \nBut just for me to know: any conflicts or what do you mean by \"this is gonna be tough\"?\n. Actually it's not 54 files that were changed! Most of these 54 files are the holo-light files that were not in the main repo before. Thus, they become a \"change\". But in fact these \"changes\" are just plain copies from the holo-light branch.\nAnd finally I had no conflicts at all when I just tried to merge your wip 2.1 and my dev-2.0.4 branch locally. So, what conflicts do you get?\n. checking \nupdate: it's not fingerblast. it's the changes I made here\n// sometimes Android returns a width and height of zero..\n  // so we wait 10ms and try again.\n  // (Taken from Google's internal dots framework file webview.js)\n  var w = document.documentElement.clientWidth || document.body.clientWidth;\n  if ('undefined' === typeof w || w == 0) {\n    setTimeout(function() {\n       // do stuff\n    }, 10);\n    return;\n  }\ncommiting a fix in a sec\n. Added https://github.com/eyecatchup/fries/commit/ac0fd82d3803fd19a181be469d2750e53a65c2d2 to the PR which should fix the broken scripts At least it does on my side. Can you confirm that?\n. Glad that's solved. :+1: \nOkay your wip/v2.1.0 branch is clean now and includes all recent updates as well as both themes. It is right now 11 commits ahead and 2 commits behind your new develop and the master branch (master and develop are on pair atm).\nSo, should I keep sending send new PRs to wip/v2.1.0 or, as previously said, to the new develop branch? Because actually develop branch is useless right now, isn't it?\n. PS: For the meantime, for those looking for a live demo, here's one: https://eyecatchup.github.io/fries/ (Note: This is a different tree that I started a while ago (off of 2.0.3), but fixes have been merged from latest master (plus, others were added).) \n. First, thanks for the feedback @jaunesarmiento.\nThen could you maybe remove the redirect for the GH pages branch to your custom domain, so people can checkout the current state there? Still better than linking into Nirvana, isn't it?\nLast but not least, in case you no longer maintain Fries, what would you say if I'll take over? As you may remember I commited some code a while ago for the wip/v2.1.0 branch and added \"Multi-Theme-Support\" to the demo site. A month ago I started to work on a Material Design based CSS/JS Framework. Now I came back to Fries to see wether I should consider to use Fries as a base (mainly because I liked the simple code base). \nBasically I'd like to merge Fries and my project anyways - so to have only one Framework that serves Holo and Material themes. So, if you don't care anymore anyway, I think it would be a good idea to let me take over. I guess the 1000+ Fries users would appreciate as well.\nWhat do you think?\n. Almost got it. Except for what you said about you can't give up on the project. Don't get me wrong, I'm perfectly fine to work with my fork. But it is somewhat in contrast to the updated README.md - which asks for somebody to take over now!? Could you clarify that last bit for me, please? Thanks (again)! :)\n. ",
    "ManZzup": "erm i did a drawer [left and right] with push/overlay and with onswipe for a extension of fries [had to make a framework for a project of mine], it's here https://github.com/ManZzup/thf, if you like it i can send a pull request :)\n. erm i did a drawer [left and right] with push/overlay and with onswipe for a extension of fries [had to make a framework for a project of mine], it's here https://github.com/ManZzup/thf, if you like it i can send a pull request :)\n. ",
    "chelahmy": "It works on Android. However, to make it work on desktop I've to include example.js.\n. It works on Android. However, to make it work on desktop I've to include example.js.\n. ",
    "alanjames1987": "Looks like this has been fixed.\n. Looks like this has been fixed.\n. ",
    "kkirsche": "Of course :smiley: thanks for the merge :+1:\n. Of course :smiley: thanks for the merge :+1:\n. "
}