{
    "jhollingworth": "ta :)\n. it astonishes me you get paid to code... :)\n. Good point, I will look into it ASAP\n. Merged in @buzzedword's fix :)\n. Added (https://github.com/jhollingworth/bootstrap-wysihtml5/blob/master/LICENCE) :)\n. Merged in @buzzedword's pull request. Closing :)\n. Merged in patches. closing\n. Should be fixed now :)\n. Great thanks!\n. Which version of firefox? The rich text editing interface is only supported in IE8+, FF 3.5+, Safari 4+, Opera 11+ and Chrome (See https://github.com/xing/wysihtml5). \n. Hmm odd, are there any js errors in the console?\nOn 20 Mar 2012, at 17:49, javajack\nreply@reply.github.com\nwrote:\n\nok, FF 7.0.1 / Ubuntu 11.10 64 bit\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/9#issuecomment-4601304\n. Fantastic! Thank you :)\n. @buzzedword  thanks for looking - looks like I shall have to dust off my photoshop skills!\n. Bugger. Have you any suggestions of any compatible licences which aren't GPL? I hate GPL. There's an issue raised on the wysihtml5 project to change the licence https://github.com/xing/wysihtml5/issues/22\n. Updated it (https://github.com/jhollingworth/bootstrap-wysihtml5/commit/e4c99a28e73ec95538faf00cd492577596b3d044). That's put a dampener on my day :(\n. It's a known issue with wysihtml5. Ticket has been raised https://github.com/xing/wysihtml5/issues/20\n. that sir is awesome! :D\n. This is a bug in wysihtml5 not bootstrap-wysihtml5 so closing.\n. Sorry, HTML only unfortunately. I think this project is probably what you are looking for https://github.com/samwillis/pagedown-bootstrap :)\n. @hinrik's change has been merged in which should fix this\n. I have implemented the UI on my side but waiting on the latest rc of wysihtml5 which has support for it \n. Underline functionality has been added. Pull the latest version (you will need wysihtml5 rc3 as well).\n\nThanks,\nJames\n. I'm a bit confused. why not just do $('#textarea').val()?\n. The previous version of wysihtml5 had a bug which meant multiple editors wasn't supported. That's fixed now so this should all be a bit easier :)\nI will be adding to the wiki today as well. Thanks for the feedback\n. This should be fixed in the latest code (https://github.com/jhollingworth/bootstrap-wysihtml5/blob/master/src/bootstrap-wysihtml5.js)\n. Great, thank you!\n. Hi, that's next on the list :)\n. Hi, You can now insert images into the page (see http://jhollingworth.github.com/bootstrap-wysihtml5/). At the moment only insert image url's works (that's whats supported by wysihtml5) - doing proper image uploads will get a little more tricky.\nI hope this helps\nThanks,\nJames\n. It's on the list of things to do :)\n. There is now an insert link button which is shown by default. wysihtml5 currently doesn't allow you to specify the link text, I will see if I can add that functionality\n. Awesome! Thank you :)\n. Yeah - makes complete sense. I'd like to expose everything that wysihtml5 does via the options object. Just gotta find the time :)\n. Hmm, odd. could you provide me with some more info? browser, os, etc.\nThanks!\n. hmm annoying - I've got it open in chrome on osx right now and everything is fine. \nit might be a script ordering or something. any chance you could send me more of the html? \n. ah ok, no problem :) my fault for not responding sooner! \nI will close for now, if you find the time to get me some more info I will re-open.\nThanks!\n. I have added support to edit the html. It's not on by default, to use you need to do:\njavascript\n$('#textarea').wysihtml5({\n    \"html\": true\n});\nLet me know if there are any issues\n. that's a bug - I will fix asap. thanks :)\n. Agreed. Updated.\n. Sorry, haven't tried it as of yet. If I get a chance over the next few days I will have a play\nThanks!\n. I think this is more of a wysihtml5 question, it's probably worth asking on their issues list https://github.com/xing/wysihtml5/issues\nThanks!\n. It's currently not supported by wysihtml5 but I really want it as well so I will see if I can implement it at some point \n. Plan for today: improve documentation :) \n. Hi, I've improved the readme with more info (https://github.com/jhollingworth/bootstrap-wysihtml5), added a download which has all the required files (https://github.com/jhollingworth/bootstrap-wysihtml5/downloads) and also mentioned the bootstrap-wysihtml5-rails gem on the readme file for any rails devs. \nI hope that helps! \nThanks,\nJames\n. Updated readme file with exact files that need to be referenced (https://github.com/jhollingworth/bootstrap-wysihtml5).\nThe zip file in the downloads section (https://github.com/jhollingworth/bootstrap-wysihtml5/downloads) contains everything you need to get started with it.\nThanks for the feedback :) \n. That should be fixed now :) Thanks!\n. Agreed and added in :)\nYou can add events like so:\njavascript\n$('#textarea').wysihtml5({\n    events: {\n        \"load\": function() { \n            console.log('loaded!');\n        }\n    }\n});\nThanks!\n. The functionality isn't currently exposed via the wysihtml5 API. I'm happy to implement it but just checking with them first to see if they are happy to include it (https://github.com/xing/wysihtml5/issues/42)\n. My pull request has been accepted (https://github.com/xing/wysihtml5/pull/45). I will add the needed functionality asap\n. Hi, good suggestions. I will add it to my backlog :)\nThanks,\nJames\n. Hi, wysihtlm5 requires the textarea to have an id. \nthis modification should work:\njavascript\nvar textarea = $(\"<textarea id=\\\"\" + new Date().getTime() + \"\\\"></textarea>\");\nHope this helps!\nThanks,\nJames\n. Fix should be in there now. Thanks\n. Can you please give me some more info?\n. Great, thanks!\n. That's been fixed now. You can use any jQuery selector you want. \nSorry for the delay in getting back to you on this one\nThanks,\nJames\n. awesome! thanks :)\n. awesome! thanks :)\n. awesome! thanks :)\n. Awesome! Thanks :)\n. Awesome, thanks!\n. OW\n. @serialseb sounds like a sensible addition. I will try and have a look at some point unless you want to send a pull request? :) Also, any chance you could do a French translation?\n. Hi, the code has changed a bit since the pull request (due to locales) but I have added the change in (https://github.com/jhollingworth/bootstrap-wysihtml5/commit/fa3053fc3a2096371d855e8656393432a491f62e)\nthanks!\n. I'd prefer to not have a global object since there might be multiple editors on a page which each require their own templates. @robashton has just submitted something similar (#80) which allows you to configure the templates for each template individually\nThanks for the pull request though :) \n. @edslocomb fixed this in #95, thanks!\n. Graet, thanks!\n. Great thanks!\n. this is awesome! thank you :)\n. Awesome, thankyou!\n. thanks!\n. Hi, \nWhen passing in the options, set image to false, e.g.\njavascript\n$('#some-textarea').wysihtml5({\n    \"font-styles\": true, \n    \"emphasis\": true, \n    \"lists\": true,\n    \"html\": false,\n    \"link\": true, \n    \"image\": false\n});\n. Thanks for the comments. With regards to changes to code, I would prefer them in the form of a pull request. Much easier to discuss at that point\nThanks,\nJames\n. Awesome! thank you for all these commits :)\n. Great, thanks! \n. :grin: \n. Thanks :smile: \n. brought in (8d94af57f5d49efe3f62381ea5bc3ef4f93384b0), thanks! \n. ",
    "robashton": "Er, I've no IDEA WHAT I JUST DID WITH GITHUB OMG WHAT A NOOB I AM DOING\n. I haven't got write access - but I sit next to @jhollingworth at work so I'll review the commits and beat him over the head with a stick until it is merged.\n. Looks sensible, I'll commence the beating.\n. Why not pass it in as part of options?\nOn 22 Aug 2012, at 19:15, edslocomb notifications@github.com wrote:\nUnfortunately, #85https://github.com/jhollingworth/bootstrap-wysihtml5/issues/85gives\nus no way to alter the parser rules at runtime, which is another\nrequirement for our project.\nWould you be willing to consider a pull request that uses namespacing\ninstead of a closure? I do appreciate the motivation for the closure, but\nmight it be preferable in this case to leave the underlying wysi5html\nnamespace accessible to the developer?\n—\nReply to this email directly or view it on\nGitHubhttps://github.com/jhollingworth/bootstrap-wysihtml5/pull/80#issuecomment-7941703.\n. Oh, and I changed the casing of the various ruby files so I can build on my machine.\n. ",
    "brandonb927": "I came here actually to open the same issue. Good work though!\n. ",
    "buzzedword": "Looks like there needs to be a focus event bubbled up to the iframe wysihtml5 creates so any dropdowns currently open get the \"open\" class removed. Sussing through it now to submit a pull.\n. Just updated the pull request on #11. We'll see!\n. Can you give an example for this? Seems interesting, I might want to take a stab at it.\n. Oh, you're talking nested lists. Like:\n-  this\n  - and this\nas compared to\n-   this\n-   and this\n. Looks like xing/wysihtml5@3c03dc6e222b9c5dbe2be9f7426aa523c532683c doesn't support that. Not much can be done until that's patched up. I'll dig around on their side.\n. Huh! That's interesting. I'll send a pull in with the changes after testing it out. Nice find, @allochi!\n. Submitted a patch for this in #8 and #10-- should be out of your hair if they're cleared.\n. :( boo. Confirmed this is an issue. Just tried using onPaste/onAfterPaste events with designmode activation-- usually works for me with contentEditable blobs, but not this time.\nLooks like @jhollingworth has to suss this one out alone. Sorry bud.\n. Keep posted to the main xing/wysihtml5 branch-- once it gets sussed out there, it should be merged down here. That's definitely an issue with their editor.\n. Funny you just commented on it, they added more documentation for the events they publish which clears up some of the issues here. Looking into the composer events to monitor copy/paste actions.\nedit or I'm an idiot and didn't see the needle in the haystack there-- composer docs have just been chilling in the middle. My bad. Looking into it either way.\n. No problem. Just put another one in fixing up pages. Drives me insane to clone a repo with .DS_Store's in them, plays havoc on some of my automators. Figured I'd contribute back.\n. Just included the dropdown fix with this pull request.\n. Sweet! Don't forget to close out #3-- the updated pull request fixed that too.\n. Looks like this is coming from bootstrap's provided \"glyphicons-halflings\" icon set. Doesn't appear to have a numeric list icon anywhere in it. That's unfortunate. Not going to stomp on @jhollingworth's design here, nothing I can patch for ya.\n. Being addressed at xing/wysihtml5#22 -- you're borked until that's fixed :(\n. This should put a lighter step in your day-- wysihtml5 has been updated to the MIT license. https://github.com/xing/wysihtml5/issues/22#issuecomment-4612193\n. @Nerian, are you setting the options for the editor? Also if you have a gist, gh-pages, or repo to reference that'd be super helpful to build a test case.\n. Well that settles that.\n. That project has a pretty neat ordered list icon (ref #12) in case you're interested.\n. I'm wondering if an i18n language schema would be a bit overkill, or if this should be a user specific option set. Cool idea though, definitely worth looking into.\n. ",
    "brianspinos777": "so how can I make the drop-down button work?\nthanks in advance!\n. the font-style dropdown in not working, how can I make it work? and add only the h2 through h4 ?\nthanks in advance!\n. how can I use a template for the font-style drop-down button??\nthanks in advance!\n. is there a way to add only h2 through h4 ???\n. but how do I implement in my code? using templates? can you post a simple example?\nthanks in advance!\n. ",
    "pixelcort": "Take a look at Google Docs. Pressing the tab key indents.\nOn Tuesday, March 20, 2012, Daniel Garcia \nreply@reply.github.com\nwrote:\n\nCan you give an example for this? Seems interesting, I might want to take\na stab at it.\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/5#issuecomment-4603592\n\n\nCortland Klein me@pixelcort.com +1 408 506 9791\nhttp://pixelcort.com/\n400A Ortega Ave. Unit 319\nMountain View, CA 94040\n. ",
    "allochi": "Hi,\ntry this, replace the list section in the file bootstrap-wysihtml5.js with the following:\njavascript\n\"lists\": \"<li>\" +\n    \"<div class='btn-group'>\" +\n    \"<a class='btn' data-wysihtml5-command='insertUnorderedList'><i class='icon-list'></i></a>\" +\n    \"<a class='btn' data-wysihtml5-command='insertOrderedList'><i class='icon-th-list'></i></a>\" +\n    \"<a class='btn' data-wysihtml5-command='Indent'><i class='icon-indent-left'></i></a>\" + \n    \"<a class='btn' data-wysihtml5-command='Outdent'><i class='icon-indent-right'></i></a>\" + \n    \"</div>\" +\n    \"</li>\",\nWorked for me.\n. ",
    "codef0rmer": "I've found the code that causing this issue but not sure why we need the skipped code so decided to paste the changes here. \nYou can see below is the fire() method which gets called every-time you type or press any key being in an editor. \n``` fire: function(eventName, payload) {\n           this.events = this.events || {};\n                   var handlers = this.events[eventName] || [],\n             i        = 0;\n            for (; i<handlers.length; i++) {\n              // I've put .call() in if-else condition for paste:composer to skip first 2 calls in order to suppress the bug\n                  if (eventName === 'paste:composer' && (i === 0 || i === 1)) {\n                  console.log(eventName + \" \" + handlers[i]);\n              } else { \n                handlers[i].call(this, payload);\n              }\n            }\n            return this;\n    },\n```\n2 calls I skipped : (which are causing a problem)\nthis.observe(\"paste:composer\");               // This clears the formatting of existing content in an editor.\nthis.parent.observe(\"paste:composer\");    // This clears the formatting of the content being pasted.\nHope this will help. \n```\n. I checked xing/wysihtml5 editor which does not have that bug. Need to look into bootstrap-wysihtml5.js\n. ",
    "mpelzsherman": "Reproduced in Firefox 11.0. Fix on the horizon?\n. Yes, but I want to be able to convert the selected text into a hyperlink.\n. ",
    "sblatnik8": "Oh thank goodness!!! I do document development work and have been having this problem for quite some time now. It is absolutely maddening (not to mention a huge time waster), and I've been unable to find a solution online despite extensive efforts to do so. I'm not a coding person so I'm afraid I can't contribute to the solution, but I am so grateful that you are looking into it and only hope I can figure out how to apply the solution when you find it (the tech language is well over my head). \n. Hi--This is such wonderful news!  \nBut I don't know what it means in terms of actual application. Do I have to do anything on my end? Download an update or something or is it just going to miraculously be working in both new AND old documents.\nThanks for help!\nCheers,\nSusan\nSusan Blatnik\nCook International, LLC\nDocument Development Services\n2041 Weber Avenue\nChesapeake, VA 23320\n757-366-5901 (office phone & fax)\n757-348-1193 (mobile)\n-----Original Message-----\nFrom: James Hollingworth [mailto:reply@reply.github.com] \nSent: Sunday, June 17, 2012 3:43 PM\nTo: sblatnik8\nSubject: Re: [bootstrap-wysihtml5] Ctrl+V removes all formatting (#7)\nShould be fixed now :)\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/7#issuecomment-6384059\n. Dear Lord! LOL. I will find a program-competent friend to help me. I can write a dissertation like no one's business, but this stuff stymies me. \nThank you so very much for the info. I can't express how grateful I am. (No one believed this was a problem. Thought I was crazy or an idiot or perhaps both.) \nThanks again.\nCheers,\nSusan\nSusan Blatnik\nCook International, LLC\nDocument Development Services\n2041 Weber Avenue\nChesapeake, VA 23320\n757-366-5901 (office phone & fax)\n757-348-1193 (mobile)\n-----Original Message-----\nFrom: Vinay Kumar D [mailto:reply@reply.github.com] \nSent: Thursday, June 28, 2012 2:34 PM\nTo: sblatnik8\nSubject: Re: [bootstrap-wysihtml5] Ctrl+V removes all formatting (#7)\nSearch for\nfire: function(eventName, payload) {\n    this.events = this.events || {};\n    var handlers = this.events[eventName] || [],\n        i        = 0;\n    for (; i<handlers.length; i++) {\n      handlers[i].call(this, payload);\n    }\n    return this;\n  },\nIN wysihtml5-0.3.0.js\nand replace it with\nfire: function(eventName, payload) {\n this.events = this.events || {};\nvar handlers = this.events[eventName] || [], i = 0;\nfor (; i<handlers.length; i++) {\n// I've put .call() in if-else condition for paste:composer to skip first 2 calls in order to suppress the bug if (eventName === 'paste:composer' && (i === 0 || i === 1)) { console.log(eventName + \" \" + handlers[i]); } else { handlers[i].call(this, payload); } } return this;\n  },\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/7#issuecomment-6637832\n. ",
    "vinaykumard": "Thanks  @codef0rmer it's working just fine..\n. # Search for\nfire: function(eventName, payload) {\n    this.events = this.events || {};\n    var handlers = this.events[eventName] || [],\n        i        = 0;\n    for (; i<handlers.length; i++) {\n      handlers[i].call(this, payload);\n    }\n    return this;\n  },\nIN wysihtml5-0.3.0.js\nand replace it with\nfire: function(eventName, payload) {\n this.events = this.events || {};\nvar handlers = this.events[eventName] || [],\ni = 0;\nfor (; i<handlers.length; i++) {\n// I've put .call() in if-else condition for paste:composer to skip first 2 calls in order to suppress the bug\nif (eventName === 'paste:composer' && (i === 0 || i === 1)) {\nconsole.log(eventName + \" \" + handlers[i]);\n} else { \nhandlers[i].call(this, payload);\n}\n}\nreturn this;\n  },\n. ",
    "javajack": "ok, FF 7.0.1 / Ubuntu 11.10 64 bit\n. Line No : 5441 is the culprit !\nfrom  http://jhollingworth.github.com/bootstrap-wysihtml5/lib/js/wysihtml5-0.3.0_rc1.js\niframeDocument.open(\"text/html\", \"replace\");\nError in Firebug Console :-\n\"Permission denied to access property 'open'\"\n. ",
    "karlbohlmark": "Well, you're pretty much screwed until hopefully xing decides to change the license of wysihtml5. (Which seems not entirely unlikely, it's not really their core business to write wysiwyg editors)\n. ",
    "troygoode": "Yeah, just change it to GPL for now and mirror whatever xing does. If xing changes it to MIT or Apache (or whatever) you should change with him at that point - for now you really have no choice but to switch to GPL...\n. ",
    "Nerian": "I see thanks :)\nI created a plugin for Ruby on Rails: https://github.com/Nerian/bootstrap-wysihtml5-rails\n. Hi Rahil,\nThanks for your contribution. I will update the gem as soon as these changes are merged in this repository.\nThe file you would need to change in this repository would be:\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/blob/master/src/bootstrap-wysihtml5.js\n. Hi,\nThere is a TestApp you can use to test the gem https://github.com/Nerian/bootstrap-wysihtml5-rails/tree/master/testapp. I tested it and it works well :thumbsup: \nI will merge it as soon it is merged in this repo.\n. @AlJohri I created a branch b3 on bootstrap-wysihtml5-rails that supports b3. But I don't have a project with bootstrap 3 to check it properly. Seems to be right on the test app. Do you mind checking it in your project?\ngem 'bootstrap-wysihtml5-rails', branch: 'b3', git: 'git@github.com:Nerian/bootstrap-wysihtml5-rails.git'\nThen, as specified in https://github.com/Nerian/bootstrap-wysihtml5-rails/tree/b3#configuration, do this:\napp/assets/stylesheets/application.css\n*= require bootstrap-wysihtml5/b3\napp/assets/javascripts/application.js\n//= require bootstrap-wysihtml5/b3\nIf you tell me it works properly I will release a new gem version. \nThanks!\n.  @AlJohri Awesome. I just released a new version of the gem, packing this code too.\nThanks\n.  class='btn btn-default btn\"   Why two btn?\n. ",
    "tiff": "btw: this has just been fixed in wysihtml5. https://github.com/xing/wysihtml5\n. (the changes are untested)\n. ",
    "monkeymademe": "Tip to all - Took me a while to work it out. No matter which selector you use to find the textarea you need an id for each textarea and also it needs to be unique so that wysihtml5 knows which textarea the commands goto... \n(I just mention it cause it was not as clear to me for a while) \n. Thanks Maciej\n. ",
    "benbonnet": "how do you associate the toolbar if it is by default using an id ?\n. ",
    "emma-uxrepublic": "@tiff  hello i'm sorry to up this old topic, but I'd like to ask how it's working now ? I want to use several wysiwyg on one page. I saw that the bug was fixed, so I took the latest version, and I'm trying to access to my elements classes like this :\nvar editor = new wysihtml5.Editor(document.querySelector('.wysihtml5-textarea'), {\n```\n            toolbar: document.querySelector('.wysihtml5-toolbar'),\n            parserRules:  wysihtml5ParserRules // defined in file parser rules javascript\n    });\n\n```\nIt's working only for the first one. It's the same as when it was an ID.\nI don't see how the bug was fixed ? Or maybe I'm missing something ?\nThan you for your help.\n. Nevermind I just used an .each() \n=)\n. Hello\nYou should use it in a way near that : \n```\n        $('.wysihtml5-toolbar').each(function(){\n            var textareaid = point your textarea\n            var toolbarid = point your toolbar\n        var editor = new wysihtml5.Editor(textareaid, { \n          toolbar:      toolbarid, \n          parserRules:  wysihtml5ParserRules // defined in parser rules set \n        });\n    })\n\n```\n. One ID can't be repeated pal ^^\nYou've created a loop that is giving the same ID to each wysiwyg\nAlso, you shouldn't put CSS inline in your html. It's not really impacting, but it would be more clean ^^\n. =D\n. ",
    "EpiFred": "@emma-uxrepublic Hi, sorry to up this topic too, but I try to use your method to have several editor but it didn't work for me. Can you please tell me how did you do with the .each() please ? :)\nThanks for your help\n. Thanks for your answer, but it doesn't work :/\nI have my textarea like this with a loop:\n`\nphp for ($i = 1; $i <= $var; $i++) { ?\n```\n                \n\nbold |\n                    <a data-wysihtml5-command=\"formatBlock\" data-wysihtml5-command-value=\"h2\">h2</a> |\n\n                    <a data-wysihtml5-command=\"formatBlock\" data-wysihtml5-command-value=\"h3\">h3</a> |              \n                </div>\n                <textarea id=\"textarea\" name=\"content[]\" placeholder=\"Enter text ...\"></textarea>\n            </div>\n            <?php } ?>`\n\n```\nand the JS\n`$(\".divinput\").each(function(){\n    var textareaid = document.getElementById('textarea');\n    var toolbarid = document.getElementById('toolbar');\nvar editor = new wysihtml5.Editor(textareaid, {\n    toolbar:      toolbarid,\n    parserRules:  wysihtml5ParserRules\n});\n});`\nBut a the end, I only have the first textarea that works well.\nCan you tell me what's wrong please ? Thanks\n. Of course.... shame on me ^^ Thanks a lot for your help it works now ! \nAnd yeah, the css in my html is just for testing, only testing ! ^^\nThanks again !! :D\n. ",
    "deanpcmad": "Oh cool, thanks :)\n. ",
    "mik356ua": "I think they forgot to add \"parserRules\" option. Without this option original Wysihtml5 script won't save any tags except <br> and <span>\n. To make it work you should also make some modifications to bootstrap-wysihtml5.js. I changed it this way:\n39 - toolbar: this.toolbar.attr('id')\n39 + toolbar: this.toolbar.attr('id'),\n40 + parserRules: options ? options.parserRules : null\n. ",
    "sirvine": "Yes, I think you are correct.  I tried this, but it doesn't fix the issue:\n```\nvar wysihtml5ParserRules = {\n    tags: {\n      strong: {},\n      b:      {},\n      i:      {},\n      em:     {},\n      br:     {},\n      p:      {},\n      div:    {},\n      span:   {},\n      ul:     {},\n      ol:     {},\n      li:     {},\n      a:      {\n        set_attributes: {\n          target: \"_blank\",\n          rel:    \"nofollow\"\n        },\n        check_attributes: {\n          href:   \"url\" // important to avoid XSS\n        }\n      }\n    }\n  };\n$('.wysihtml5').wysihtml5({ \"parserRules\" : wysihtml5ParserRules });\n```\n. I see.  Works like a charm.  Thanks!\n. ",
    "hinrik": "For the record, I believe I have a fitting patch for this in https://github.com/jhollingworth/bootstrap-wysihtml5/pull/20\n. Sorry, this was actually caused by the HTML5 browser validations I had activated.\n. Is that really needed? As of 4d553cf23d, all you need to do is paste (or type) a url into the textarea and it just works.\n. Ah, I see. Yeah, that would need to be implemented.\n. It might also be worth mentioning bootstrap-wysihtml5-rails for Rails users.\n. ",
    "simple10": "Here's a fix. It requires overloading of some wysihtml5.dom methods, but it works without modifying any of the wysihtml5 code. Ideally, wysihtml5 v0.5 will improve the events to make it easier to listen for changes.\nhttps://github.com/simple10/bootstrap-wysihtml5-sass/commit/3f136bb7d1eeabe29fe80fa63f1eec9ee8c39501\nHere's a demo...\nhttp://simple10.github.io/bootstrap-wysihtml5-sass/\nI also added auto-resizing of the editor and am working on several other requested features.\n. ",
    "Theadd": "uff, that was stupidly simple but that's not what the above code does.\nTo reach this $('#editable').val(); I was doing $(this).parent().children(\"div.editable\").html();. But the code above is an implementation of your code to support multiple editable sections like in this page. (click edit, edit it and save). Maybe someone is interested in it so I posted it here instead of cleaning up my code, forking, commiting and doing a pull request. (yeah, kind of lazy man)\n. ",
    "Bratzilla": "I just tried to create multiple editable sections using the following method:\n$('.textarea').wysihtml5();\n$('.textarea1').wysihtml5();\nThis did not work, and I get the following message in my console:\nUncaught Error: HIERARCHY_REQUEST_ERR: DOM Exception 3 \nThis is in the latest version of Chrome.\nMultiple instances however work perfectly with regular WYSIHTML5 (did extensive testing).\nIs there a special way to create multiples that is not documented? Thanks!\n. I can confirm that you are correct. I commented about this exact issue in an earlier thread. \n. ",
    "rrosiek": "I'm having the same issues as well when creating multiple text area editors regardless of selections (unique ID's as well).  I'll try to debug and see what I can find, but it does appear to be an issue with the bootstrap skin and not wysihtml5 itself.\n. Outstanding.  I had just downloaded the minified version which was newer than mine, didn't notice you just updated the source.  Works like a charm, thanks!\n. ",
    "sylvainbaronnet": "+1\n. ",
    "TinaJ": "I have the same problem you had. Can you please tell me how you fixed it? Thanks\n. ",
    "miclovich": "that's awesome... :)\n. thanks a lot; I understand; this can get tricky and will depend on the backend framework being used; I work with rails, I think I can provide a patch or gem that should work a lot like https://github.com/thoughtbot/paperclip for anyone wanting to persist images in a form of datastore. I'm sure other devs will come up with a solution that could involve their frameworks (wordpress, kohana, etc.). Thanks.\n. ",
    "jamesosb": "Miclovich, did you get anywhere near creating something what would allow saving of images through paperclip? I have a similar need now. It would be great to see anything you created?\nThanks! \n. ",
    "syewell": "I have a similar need as well, would love to hear what you put together!\nThanks!\n. ",
    "anu-vaid": "+1\n. +1\n. I am having the same issue\n\n. ",
    "bassjobsen": "Please see https://github.com/bassjobsen/wysihtml5-image-upload/ to upload and insert images with Bootstrap Wysihtml5. You have to wrote your own handlers (server side) to store your uploads.\n. ",
    "trantorLiu": "I just created a new repository for this feature.\nI integrated bootstrap-wysihtml5 with jQuery-File-Upload.\nSee https://github.com/trantorLiu/bootstrap-editor.\n. I forked this project and created a new branch file-upload for this feature.\nI decided to close the bootstrap-editor project and move it to that branch.\n. ",
    "r00takaspin": "+1\n. ",
    "danieltamiosso": "+1\n. ",
    "Loremaster": "Please, add possibility to create my own translation (i18n would be awesome)!\n. ",
    "panosru": "@jhollingworth \nhi, the above screenshot is from Google Chrome, but I have the same error on Safari and Firefox\nI'm on OSX :)\n. @jhollingworth well to be honest I put tinymce for not but I'll try to find some time and add it again so you could test it.. :)\n. @XayOn hmm I guess you could be right on that! I just tried it and made sure the id is unique and it works! :) (I just have an anoying backdrop modal on load but I'll figure it out :P )\n. same here for me... \n. ",
    "XayOn": "I probably can explain this, that error ocurs if the id of the element is not unique, or if you pass it an object without any id.\n. ",
    "bernatbombi": "Had the same problem, and solved it setting an Id for every textarea... crappy js :D\n. ",
    "rashidshafique": "for anyone still getting it, make sure the ids you pass when initializing the editor, that they are unique and exist on the page, this includes the toolbar as well and off course the textarea.\n. ",
    "barmstrong": "Agreed - this would be nice.\n. ",
    "michaeljcoyne": "why?\n. ",
    "silasb": "I think it should. When I saw the indent buttons, and not looking very closely, I ended up clicking on the right de-indent button thinking it was the indent button.\n. ",
    "mattbeedle": "Having the same problems. Did anyone figure this out yet?\n. I have the same issue. An editor within a modal breaks when I re-open. If I try to add the editor again from the chrome console I receive the following error:\nError: NOT_FOUND_ERR: DOM Exception 8\n. ",
    "kbaum": "Also having a problem with this.  Anyone have any luck?\n. Interesting.. even using pure jquery i wasn't able to get hold of the wysihtml5 object within the iframe.  It seemed like the data method did not work within another iframe.\n$('textarea#shared_space_message_html', frames['sb-content'].document).data(\"wysihtml5\")\nundefined\nThe same command returns the object when not accessed through the iframe.\nOn Sep 17, 2012, at 6:30 PM, edslocomb wrote:\n\nWe haven't been able to get this working yet either, but it seems it might be less a problem with bootstrap-wysihtml5 than with combining the underlying wysihtml5 library with capybara. It looks like capybara may need an id to address a document in an iframe (via within_frame), and wysihtml5 does not set an id on the iframe it creates.\n—\nReply to this email directly or view it on GitHub.\n. I was able to get it to work using execute_script:\n\npage.execute_script %Q{ $('#textarea').data(\"wysihtml5\").editor.setValue('#{text}') }\nWhere textarea is the id of the initial textarea.  I am using capybara-webkit.\n. ",
    "edslocomb": "We haven't been able to get this working yet either, but it seems it might be less a problem with bootstrap-wysihtml5 than with combining the underlying wysihtml5 library with capybara.  It looks like capybara may need an id to address a document in an iframe (via within_frame), and wysihtml5 does not set an id on the iframe it creates.\n. Ah, it looks like you're trying to do something different, instantiating the editor within an iframe you've set up yourself.\nI'm referring to the simple case, where the only iframe in the application is the one wysihtml5 itself creates to house its contenteditable document; capybara doesn't seem to be able to get ahold of anything within that iframe.\n. Unfortunately, #85 gives us no way to alter the parser rules at runtime, which is another requirement for our project.\nWould you be willing to consider a pull request that uses namespacing instead of a closure?  I do appreciate the motivation for the closure, but might it be preferable in this case to leave the underlying wysi5html namespace accessible to the developer?\n. I believe this should be fixed in #95\n. Support for mailto: URLs was added to the upstream wysihtml5 library after the 0.3.0 release.  There hasn't been another versioned release yet, but you could try compiling the edge version and using that instead of wysihtml5-0.3.0.js :\nhttps://github.com/xing/wysihtml5\n. https://github.com/xing/wysihtml5/issues/18\nAutoresize is marked for inclusion in 0.4.0 of the upstream source, so it might percolate up from there eventually.  In the meantime, there are ways you can add autoresize manually, discussion of which can be found in the issue referenced above.\n. Where did you download version 0.3.1?\nwysihtml5 is currently at version 0.3.0, and bootstrap-wysihtml is at version 0.0.2\n. Are you using a recent download?  There was a bug with multiple editors per page that was fixed not too long ago.\nIf that doesn't do it for you, could you be a little more specific about \"doesn't work\"?  Do any editors appear on the page?  Are they fully functional?  Does your browser report any js errors?  etc...\n. ",
    "dgilperez": "+1 . No luck here after a bunch of time of trying ...\n. Thanks @kbaum !!! I also manage to get it working.\n. :+1: \n. ",
    "juliobetta": "Thanks @kbaum !!! |o/\n. ",
    "PedroSena": "Thanks @kbaum \nI used the same idea for the Redactor editor, the final code is: $('#article-content').setCode('#{attributes[:content]}')\n. ",
    "elfassy": "https://github.com/xing/wysihtml5/issues/69\n. this can already be done, see\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/#custom-templates-for-toolbar-buttons\nand \nhttps://github.com/jhollingworth/bootstrap-wysihtml5/blob/master/src/bootstrap-wysihtml5.js#L43\n. ",
    "auzigog": "Thanks for improving the readme!\nI think there needs to be a bit more for the documentation to help someone get from nothing to a working version of the code: It needs to mention the exact lines you need to have in your code for bootstrap-wysihtml5 to work. The part that your readme is still missing are the javascript and CSS imports that are required to get this working.\nThis includes:\n\n\n\n\n\n\nAnd the readme should include instructions on where to download each of those files at, and where to place them relative to each other in your site.\nI spent a bunch of time reading your docs/examples and the normal wysihtml5 docs/examples to figure out which files in the big repos were necessary for me and how I placed them relative to one another in my site directory to get them all to be included.\nThanks!\n. Perfect! You rock. Thanks.\nLast thing I would say is to reference the download from the readme so it's as simple as:\n- look at read me\n- click download link\n- drop files into project\n- copy past code into project\n- done!\n. ",
    "danielboendergaard": "It also happens in Firefox 11 and IE8\n. ",
    "tallica": "This problem exists in Chrome 19, Opera 11 and Firefox 11 too.\n. ",
    "silviorelli": "Bump!\nFor me works only in FF14 beta\nBroken on Chrome 21 beta and Safari 5.1.7\n. Fixed compiling wysihtml5 from trunk, instead of using the bundled 0.3.0 stable version.\n. ",
    "zippolino": "javascript\n$(document).ready(function () {\n   $('.someLink').live('click', function () {\n     $('#textarea').wysihtml5();\n     var wysihtml5Editor = $(\"#textarea\").data(\"wysihtml5\").editor;\n     console.log('wysihtml5Editor: '+wysihtml5Editor);\n     // The following is important since wysihtml5 is initialized asynchronously\n     wysihtml5Editor.observe(\"load\", function() {\n       wysihtml5Editor.composer.commands.exec(\"bold\");\n     });\n   });\n});\nSolved!\n. ",
    "ric03uec": "Moved the script includes to footer. Solved the problem.\n. @thomasjonas : go to the following link for a complete example of updating the text as well as the editor.\nhttps://github.com/ric03uec/nodeblox/blob/master/public/js/admin/admin.js\nIn summary\n1. keep the 'editor' as the global accessible variable.\n2. initialize the 'editor' with the appropriate configuration during js initialization\n3. use the following to update the text and the editor\nvar editorInstance = editor.data('wysihtml5').editor;\n    editorInstance.setValue('some text to be inserted into editor', true);\nLet me know if this works for you.\n. ",
    "volmer": "I'm not sure if this is a good solution for this issue, once Rails by default inserts all scripts on the page header.\n. That would be great, @frahugo !\n. Nice job, @threestan ! :+1:\n. Excellent, @justgo ! \n@robashton , could you please take a look at this pull request?\n. :+1:\n. Nice, but this is not exactly what we're looking for... It would be great not just to customize buttons, but to be possible to add arbitrary buttons with custom functions binded to them.\n. Hi, @stephane-benoist ! The french locale is already added here. All translations are placed at src/locales, except for english, which is the default.\n. I'm updating the translation file for brazilian portuguese too. Sorry for sending all in the same request :blush:\n. :+1:\n. ",
    "smizell": "Just an FYI: I had this happen to me when I switched versions without restarting the webrick. After restarting webrick, the error went away.\n. ",
    "xamiam": "Moving the script includes to the footer didn't solve it for me. I made sure the textarea has a valid ID and the jquery-selector is fine. Any Ideas? Thanks a lot.\n. ",
    "Darksoulsong": "I got the very same problem. The scripts are in the footer and are loaded following this sequence:\n- jquery (1.8.3)\n- bootstrap.min.js\n- main js script\n. ",
    "andineck": "I get the same error as well, but only ocasionally, sometime it loads fine, seems to be a timing problem with loading of the script.\n. Firs I applied the hack #274 and it worked. Later I found out that the problem was my script loader. It loaded the scripts in parallel. So the order was not defined. When I ensured that the loader would only load the next script once the previous was loaded, it worked fine. wysihtml5-xxx.js must have been loaded before bootstrap-wysihtml5-xxx.js starts loading.\n. ",
    "asakapab0i": "i have this problem also any fix to this?\n. ",
    "jaminto": "You've got to include the scripts in the right order as detailed in the readme:\n<script src=\"js/wysihtml5-0.3.0.js\"></script>\n<script src=\"js/jquery-1.7.2.min.js\"></script>\n<script src=\"js/bootstrap.min.js\"></script>\n<script src=\"js/bootstrap-wysihtml5.js\"></script>\ni got this error when wysihtml5-0.3.0.js was not in order before bootstrap-wysihtml5.js like @andi-neck said, but i didn't need to do his hack first.\nit doesn't matter if they're in the <head> or bottom of the <body> tag...\n. ",
    "bencrouse": "+1 \nI saw the other issue also, but on the demo, selecting text and clicking the button to insert the link doesn't retain the selection of the text.\n. Yeah, I browsed through the wysihtml5 API and couldn't figure out how to do it.\nBut, I wonder how it works in their advanced demo then. http://tifftiff.de/wysihtml5/examples/advanced.html\n. ",
    "zzack": "Is this issue to add a text box on the insert link button or to preserve the selection before the button was clicked and apply the link to it?\n. ",
    "mlapeter": "I would say both. Since it already automatically turns www.example.com in the text into a link, the only reason I could see a user selecting text and then creating a link would be if they wanted to keep the original text. \nAlternatively If they haven't selected text and are clicking the button, it would also be nice to let them choose a title, otherwise some users may never realize it's even an option.  Wordpress for example has two fields in the popup, URL and Title. And thanks James for the quick response!\n. ",
    "ManuelThurner": "has this already been implemented in the project? if not, can anyone tell me how to add it quickly to my project since it is already part of the original wysihtml5 project? thanks\n. ",
    "maciejwalkowiak": "javascript\n$('.wysihtml5-sandbox').contents().find('body').html('');\nWorked on example: http://jhollingworth.github.com/bootstrap-wysihtml5/\n. ",
    "magnusart": "FYI: I forgot to mention here that I added this issue in Twitter Bootstrap, where I think it should be fixed, please comment there if you want to push for a fix: https://github.com/twitter/bootstrap/issues/3233\nIn the end I choose to go with CKEditor instead with a Twitter Bootstrap css layout. It uses different libraries for it's popups so it works but adds extra deps. The image and URL dialog was a bit too simple in bootstrap-wysihtml5 for my needs. But I'll be keeping an eye on this project as it matures...\n. Sorry, I did this change via GitHub web interface and it asked me to submit the pull request directly. I tested this and realized it did not work as expected. I will give it a closer look after work and submit an updated pull request.\n. After looking into this I realized that while I can hack around it, this is something that should be fixed in Twitter Bootstrap directly. I filed an issue there: https://github.com/twitter/bootstrap/issues/3233\n. ",
    "naveenprakash": "Insert link is broken in Chrome(latest version), Mac osX\n. ",
    "ellisio": "This is still broken, any word on this?\n. ",
    "raldred": "Seems like it's something to do with the current selection in the editor, this is a pretty major issue if this doesn't work for me so I've forked to fix, will update with progress\n. Ahh I haven't actually implemented it yet, so I guess I would have found that out :)\nMaybe the demo isn't using the latest source? No biggy then I guess.\n. ",
    "ErneX": "Yeah but the editor works fine if you implement it, somehow the demo is broken.\nBTW: https://github.com/xing/wysihtml5 updated with support to links other than http (ftp, mailto, etc.).\n. ",
    "JoshLedgard": "We've implemented it and have the same issue.  To fix it we had to add a hidden div back to the toolbar code for the selection value to persist: \n+ \"  <div data-wysihtml5-dialog='createLink' style='display: none;'>\"\n           + \" <!--        <label>\"\n           + \"           Link:\"\n           + \"           <input data-wysihtml5-dialog-field='href' value='http://'>\"\n           + \"         </label>\"\n           + \"         <a data-wysihtml5-dialog-action='save'>OK</a>&nbsp;<a data-wysihtml5-dialog-action='cancel'>Cancel</a>-->\"\n            + \"      </div>\"\nThis seems like a total hack - but it works again. \n. ",
    "alekseyev": "Thank you @JoshLedgard, I also couldn't insert URLs in my installations without your hack\n. ",
    "kishorenc": "Realized it's more of wysihtml5 related question. Anyway - for future explorers, using the jQuery hotkeys plugin we can do:\n```\n $('.wysihtml5-sandbox').ready(function() {\n        $('.wysihtml5-sandbox').attr('id', 'editor_iframe');\n        var frame = document.getElementById(\"editor_iframe\");\n        var frameWin=(frame.contentWindow || frame.contentDocument);\n    $(frameWin.document).bind('keydown', 'ctrl+s', doSomething);\n\n});\n```\n. ",
    "dizzyn": "Hello, please, is this the only way how to bind events on the editor?\n. ",
    "thomasjonas": "I have this same issue... \n$('#some-textarea').wysihtml5().data(\"wysihtml5\").editor.setValue('test', true);\nThis does update the underlying textarea value, but not the editor itself... I would love to see an example of how you could set the value of the editor when it's already been initialized.\n. ",
    "moskiteau": "Well it kind of work, the editorInstance instance value gets updated, but the wysihtml5 does not, no text is added.\ni.e.\njavascript\nvar wysihtml5Editor = $('.company-about-editor').wysihtml5().data(\"wysihtml5\").editor;\nwysihtml5Editor.setValue(\"<p>foobar</p>\", true);\nconsole.log(wysihtml5Editor.getValue());\nSo basically, this makes the plugin pretty useless, you cannot set the text...\n. ",
    "sachininmindfire": "This code worked for me :\n$(this.el).find('.textareaContent').wysihtml5();\neditor.setValue(\"abc\");\nHere \"editor\" is kinda global var set after wysihtml5 initialization. We can use that.\n. ",
    "stationkeeping": "This doesn't work at all. How can such a crucial feature be non-functional and undocumented?\n. ",
    "BobMabena": "I'm using the following to copy from one editor to another and it works fine:\n$('#mobileArticleBody').data(\"wysihtml5\").editor.setValue($('#webArticleBody').val());\n. No word on allowing custom buttons?\nI would like to be able to insert a time stamp (and a horizontal line) into my editor.\n. ",
    "kojunghee": "test1\n. 1111111\n. ",
    "cbielich": "\nThis code worked for me :\n$(this.el).find('.textareaContent').wysihtml5();\neditor.setValue(\"abc\");\nHere \"editor\" is kinda global var set after wysihtml5 initialization. We can use that.\n\nThis worked for me, thanks. ",
    "pkmishra": "@fellars  You really saved me. I was wondering about the error then after so much effort I landed on this issue. Thank you so much.\n. Submitted a pull request. https://github.com/jhollingworth/bootstrap-wysihtml5/pull/66\n. ",
    "fellars": "@pkmishra glad it helped.  Now hopefully it gets added to master  :)\n. ",
    "BoringCode": "That's great, thanks for the fix. \n. ",
    "Jan-Bart": "Solved it by adding \"div\": {}, and  \"span\": {}, in parserRules (bootstrap-wysihtml5.js)\n. ",
    "michalsvec": "I think you will have to hack wysihtml5. Textarea used at first is not updated by wysihtml5. Try to look there.\n. ",
    "joshkurz": "At first I was trying to attach the text to the model via some scope variable. But I figured all I needed was the text after it has been rendered by the editor. So for now just calling the .val() method inside of my controller gave me access to the wysiHtml5 editor. \nI do plan on creating an Open Source wyisHtml5-AngularJs widget that connects the rendered text to the scope. \n. http://jsfiddle.net/ZguhP/30/ \nThis is almost it. The Editor is rendered with Angular, however the model is still not connected to the wysiHtml5 editor.\n. ",
    "wgroeneveld": "We used this custom directive. NOtice that we had to pry out the iframe body HTML because the txt.val() value CAN not be up to date yet due to the sync method which syncs the iframe with the textarea. If you're a fast typer, you won't save the latest html! \n``` javascript\n    .directive('wysiwygComponent', function() {\n        return {\n            templateUrl: 'partials/component/wysiwygComponent.html',\n            restrict: 'A',\n        link: function(scope, element, attrs) {\n            var txt = $(element).find(\"textarea\");\n\n            scope.$watch('model', function(val) {\n                txt.siblings(\"iframe\").contents().find(\"body\").html(val);\n            });\n\n            txt.wysihtml5({\n                locale: \"nl-NL\",\n                stylesheets: [],\n                events: {\n                    \"blur\": function() {\n                        scope.$apply(function() {\n                            var html = txt.siblings(\"iframe\").contents().find(\"body\").html();\n                            scope.model = html;\n                        });\n                    }\n                }\n            });\n        },\n        scope: { \n            label:'@',\n            model:'='\n        }\n    };\n})\n\n```\nAs you can see wee needed to bind both ways - the scope watch to fill the inner HTML can be left out but if you revisit the part of your site, angular re-fills the model and the wysihtml5 component doesn't really notice that... \nThe partial is this:\n``` html\n\n{{label}}:\n\n\n\n\n```\n. \"stylesheets\": false is NOT valid \n\nYou'll need \"stylesheets\": empty array\n. ",
    "eugenescray": "I have the same issue\n. ",
    "evadnoob": "I've also had the same issue, I hacked the iframe to show the correct value(note that the selector is very specific to my use case): \njavascript\n$('div[for=\"' + this.textEditorView.id + '\"].editor-container').find('iframe').contents().find('.wysihtml5-editor').html(revertTo.get('text'));\nBut if you can get to the iframe, you can set the html value.  Got the idea from this post here: https://github.com/xing/wysihtml5/issues/118\n. Yeah, I have the same issue, lots of individual editors.   And I access them by their \"id\" and select each one, as much as I tried to use the documented way, I couldn't get the iframe to change the text.  All of the other elements around the iframe were no problem.  \nThanks for the clever hack!  :-)\n. ",
    "oller": "Haha, that was my post too! :)\nThanks, I am using the way suggested in the linked post, however I know there is a native setValue function within the editor object for this, which would be a lot quicker and resilient to any changes in my dom. \nIt's just how to access individual editor objects when there are multiple ones on a page, and they've been initialised via bootstrap-wysihtml5\nThanks though!\n. ",
    "abhasbaghel": "Hello All,\nThis solution has worked for me..\neditor = new wysihtml5.Editor(\"description\", {\n        toolbar:      \"textareaId\",\n        stylesheets: [\"http://yui.yahooapis.com/2.9.0/build/reset/reset-min.css\", \"css/editor.css\"],\n        parserRules:  wysihtml5ParserRules\n     });\nvar composer = editor.composer;\ncomposer.setValue(\"Inser Your HTML Here\"); \n. ",
    "gabisajr": "I had a few issues with this until I found this solutions\n$('iframe').contents().find('.wysihtml5-editor').html('your new content  here');\n. ",
    "kimhongheng": "fdsfds. ",
    "DanielnetoDotCom": "thanks @gabisajr that was the only solution for me. ",
    "frahugo": "Nice.  I wanted to do something similar.  Once merged, I'll submit a French version.\n. ",
    "leehambley": "This looks like a great avenue of work, I need to present wysihtml5 to my clients in German, this would be great!\n. ",
    "kszucs": "javascript\n/**\n * Hungarian translation for bootstrap-wysihtml5\n */\n(function($){\n    $.fn.wysihtml5.locale[\"hu-HU\"] = {\n        font_styles: {\n              normal: \"Normál\",\n              h1: \"Címsor 1\",\n              h2: \"Címsor 2\"\n        },\n        emphasis: {\n              bold: \"Félkövér\",\n              italic: \"Dőlt\",\n              underline: \"Aláhúzott\"\n        },\n        lists: {\n              unordered: \"Rendezetlen lista\",\n              ordered: \"Rendezett lista\",\n              outdent: \"Kihúzás\",\n              indent: \"Behúzás\"\n        },\n        link: {\n              insert: \"Link beszúrása\",\n              cancel: \"Mégsem\"\n        },\n        image: {\n              insert: \"Kép beszúrása\",\n              cancel: \"Mégsem\"\n        },\n        html: {\n            edit: \"HTML szerkesztése\"\n        }\n    };\n}(jQuery));\n. ",
    "justgo": "``` javascript\n/\n Turkish translation for bootstrap-wysihtml5\n Emrah ÇELİK / JustGo\n/\n(function($){\n    $.fn.wysihtml5.locale[\"tr-TR\"] = {\n        font_styles: {\n              normal: \"Normal metin\",\n              h1: \"Başlık 1\",\n              h2: \"Başlık 2\"\n        },\n        emphasis: {\n              bold: \"Kalın\",\n              italic: \"İtalik\",\n              underline: \"Altı Çizili\"\n        },\n        lists: {\n              unordered: \"Liste\",\n              ordered: \"Liste Numaralı\",\n              outdent: \"Çıkıntı\",\n              indent: \"Girinti\"\n        },\n        link: {\n              insert: \"Bağlantı Ekle\",\n              cancel: \"İptal\"\n        },\n        image: {\n              insert: \"Resim Ekle\",\n              cancel: \"İptal\"\n        },\n        html: {\n            edit: \"HTML Düzenle\"\n        }\n    };\n}(jQuery));\n```\n. ",
    "serialseb": "I know the PR is closed n all. But the language should default in the default language for the current document shouldnt it? Also, in xhtml you'd have to find the current xhtml:lang, and in html5 it'd be the lang.\n. ",
    "toinouu": "+1\n. ",
    "robcleghorn": "+2\n. ",
    "luiscruz": "+1\nI really like the editor, but unfortunately font color support is a requirement in the project i'm working.. Maybe I'll take a look and see if it's easy to contribute...\n. ",
    "gordonpro": "+10086\n. ",
    "ForbesLindesay": "This would be great, particularly useful would be to include support for http://imgur.com/ so users can upload images directly within the editor.\n. ",
    "Irio": ":+1:\n. ",
    "pamelafox-coursera": "I believe the problem is that the editor is not focused. I changed my insertImage to:\n self.editor.focus(false);\n self.editor.composer.commands.exec(\"insertImage\", urlToInsert);\nI based this on what the built-in toolbar does for wysihtml5.\n. ",
    "Dric": "I confirm this issue, there is just a black screen without modal when I try to insert image or link with Opera browser in Win7/Opera12.\n. ",
    "thomaspierson": "On demo page, insert image button does not work in FF10-esr.\nConsole error :\nThe container of an boundary-point of a range is being set to either a node of an invalid type or a node with an ancestor of an invalid type.\nhttp://jhollingworth.github.com/bootstrap-wysihtml5/lib/js/wysihtml5-0.3.0.js\nLine 2240\nMy OS is Debian Wheezy.\n. ",
    "oscarcp": "Having the same issue here, and I can't seem able to fix it with the stopPropagation() jQuery function.\n. ",
    "fabioda": "I'm facing the same issue now... Is there any solution yet?\n. Actually that's what I'm doing (create the editor just once).  But also my editor is on a tab inside a modal.. that could be the problem (and it's an home-made tab, not bottstrap's).\nI'll check that out. \nThanks\n. ",
    "ysilvestrov": "For us it works well, we're just creating the wysihtml5 in modal once, then show/hide it by bootstrap. The problem starts if you're recreating editors.\n. Tried to apply your patch; having troubles with creating the bootstrap-wysihtml toolbar :( Could you send me the file you're working with?\n. This is variant of your filldle that is working:\nhttp://jsfiddle.net/wZjeW/1/\nI think it should be very easy to make fixes to the script itself.\n. Actually, running \"each\" is enough. id's are just artefacts from debugging; you don't need them to run the script :)\n. ",
    "goodbomb": "Did anyone figure out a solution for this? I'm having this problem right now as well. I'm only calling the wysihtml5 once on modal show, but every subsequent modal that's displayed doesn't load properly.\n. Figured it out. You have to remove the iFrame and toolbar whenever the modal is hidden and re-show the textarea so that on each subsequent modal display, the wysithml5 function starts all over again. This is what I did:\n```\n$(document).ready(function(){\n    $('#modal').on('shown', function(){\n        $('#textarea').wysihtml5();\n    });\n$('#modal').on('hidden', function(){\n    $('.wysihtml5-sandbox, .wysihtml5-toolbar').remove();\n    $('#textarea').show();\n});\n\n});\n```\nThis issue can probably be closed now.\n. Confirmed what @ndogaru said. This is the code I used to get it working:\n$(document).ready(function(){\n    $('#modal').on('shown', function(){\n        $('#textarea').wysihtml5();\n    });\n});\nEdit: Actually, the above code causes the wysiwyg toolbar to duplicate every time the modal is opened. Haven't figured out a way to prevent that yet.\n. Got it! Woo! This issue can now be resolved. You have to remove the iFrame and toolbar whenever the modal is hidden and re-show the textarea so that on each subsequent modal display, the wysithml5 function starts all over again. This is what I did:\n```\n$(document).ready(function(){\n    $('#modal').on('shown', function(){\n        $('#textarea').wysihtml5();\n    });\n$('#modal').on('hidden', function(){\n    $('.wysihtml5-sandbox, .wysihtml5-toolbar').remove();\n    $('#textarea').show();\n});\n\n});\n```\n. ",
    "fgian": "The Problem of fluid text area was a my stupid error, but still i don't see toolbar using iPad. \n. Solved. The problem is on IOS 4.3 not on 5.0. Thanks!\n. ",
    "kostia": "+1\nWhy isn't it merged yet?\n. ",
    "bootstraponline": "It looks like this has been solved upstream.\n- https://github.com/xing/wysihtml5/issues/104\n. ",
    "trentcioran": "I am experiencing the same issue :-/, my code is similar\n$('textarea[name=longDescription]').wysihtml5();\nInteresting, found this \nhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/28#issuecomment-5191305 \njust tried it and it fixed the error :)\n. ",
    "Chumillas": "Looking forward to this too, so far so good.\n. ",
    "mattbeaubien": "I just did a test of copy/paste from Word and it worked fine on the wysihtml5 demos (http://xing.github.com/wysihtml5/examples/simple.html http://xing.github.com/wysihtml5/examples/advanced.html http://tifftiff.de/contenteditable/editor.html).\nWould love to see this fixed or tips on how to fix it.\n. ",
    "HardlyMirage": "The <p> tag is missing from bootstrap-wysihtml5.js\nAdd \"p\": {} under defaultOptions['parserRules']['tags']\ntags: {\n\"b\":  {},\n\"p\":  {},\n\"i\":  {},\n\"br\": {},\n..............\n. ",
    "wfwei": "as HardlyMirage said, we can add custom tags, it worked fine\nbut I wonder if there is a big set of tags contains most popular tags I can add at once~\n. ",
    "Augustin82": "Thanks!\n. Interesting, but it didn't work for me.\nThis solution did the trick: https://github.com/jhollingworth/bootstrap-wysihtml5/issues/83 (adding the \"p\" tag in the .js file).\n. ",
    "Videles": "On line 12 of bootstrap-wysihtml5.js you will find this.\ndata-wysihtml5-command-value='div'\nChange the value \"div\" to \"p\" and you haveat least a quick workaround with which you are able to insert a paragraph.\n. ",
    "surajdighodkar": "please help guys !! when i am trying to acces data from wysihtml editor by copy and paste it gives problem consider if i copy \" www.google.com \" in wysihtml editor , it internally does something and creates   it should come as it is like \" www.google.com \"\nhow to avoid this .........\n. ",
    "ashleyjwheat": "Bump!\nThis is causing me real issues. I am using wysihtml5 as the editor inside of a web app at a company I am freelancing for, but as most of the staff here use IE8 & IE9, I may have to switch to another editor such as TinyMCE, which I really don't want to do.\n. ",
    "zrod": "Care to provide any possible error messages thrown in the console?\nWhat was the procedure like? (i.e. Loaded editor, clicked over the 'link' button (without clicking over the textarea/iframe then 'insert link' -> error)\nHow to debug w/ IE: http://msdn.microsoft.com/en-us/library/ie/gg699336(v=vs.85).aspx\n. WYSIHTML5 sets an iframe, hence you don't see the option to / can't resize it.\nThere are a few activities related to that at wysihtml5's project page:\nhttps://github.com/xing/wysihtml5/issues/233\nand a similar one here: https://github.com/xing/wysihtml5/issues/18\n. Where have you seen such setting?\n. This may be related to issues #74 and #84\n. This is a feature of wysihtml5 not bootstrap-wysihtml5.\nIt has been implemented on 0.4.0pre (option called \"useLineBreaks\"), just clone the master branch at https://github.com/xing/wysihtml5, build, and then replace it with the one provided by bootstrap-wysihtml5.\nNote, however, that there are still some issues, as reported in here and here.\n. You must provide the full http path.\nOr you could work around the insertImage command to fit your needs, ref: https://github.com/xing/wysihtml5/blob/master/src/commands/insertImage.js\n. ",
    "paradoxxxzero": "It works a bit\nThanks <3\n. ",
    "gareth-reid": "IE8 still has this issue, that is: \n1. when you add a link it adds the entire url @ the START of the editor no matter where the cursor is or what is \nhighlighted.\n2. Adding an image does the same thing (always at the start)\nThese things work fine in FF and chrome.\n. ",
    "henrikweimenhog": "ugh! There's a bug in bootstrap-wysihtml5-0.0.2.js\nat line 145 \nvar editor = new wysi.Editor(this.el.attr('id'), {\n                toolbar: this.toolbar.attr('id'),\n                parserRules: parserRules\n            });\nall options are lost except the toolbar and the parserRules. \nYou should probably add them too? Right?\n. ",
    "mostofreddy": "I tested this feateure and work OK\nGood job! =)\n. ",
    "blocka": "+1 Just got bit with this one as well.\n. ",
    "garrensmith": "Brilliant, thanks.\n. ",
    "xyloman": "+1 I am having an issue with this as well.\n. ",
    "aldilaa": "by the way, did you get it fixed? I am having the same problem\n. ",
    "georgemillo": "Also having this same issue.\n. ",
    "bslipek": "Also\n. ",
    "escopecz": "Also\n. ",
    "salines": ":+1:\n. ",
    "heliostatic": "+1\n. ",
    "rahilsondhi": ":+1: \n. Can't figure out how to add it to this project, but it was easy to add it to https://github.com/Nerian/bootstrap-wysihtml5-rails/pull/35\n. ",
    "heidiv": "This disables access to the toolbar for all keyboard/assistive technology users! I would suggest reverting this and instead add a \"skip toolbar\" link before the toolbar (that is visually hidden but appears when active) that would move the cursor directly to the text area.\n. +1 for klown's advice\n. ",
    "klown": "An alternative is to follow the ARIA Authoring Practices.  It suggests to use TAB to navigate to and from the toolbar, and arrow keys to navigate within the toolbar.  See the \"Keyboard Interaction\" section of the toolbar pattern:\nhttp://www.w3.org/TR/wai-aria-practices-1.1/#toolbar\n. ",
    "ScotterC": "I'll give it a try. Thanks.\n. ",
    "thet": "@jque why did you close this pull request? seems quite useful to me\n. oh.\nbut after studying the source code, i can see that a customTemplates option is accepted. this way and with the other config options, it's possible to inject your additions to bootstrap-wysihtml5\n. for reference: i did an integration of what you've done with the parsing rules for a yafowil (a python form library) widget like so:\nhttps://github.com/bluedynamics/yafowil.widget.wysihtml5/blob/master/src/yafowil/widget/wysihtml5/resources/widget.js\nit extends the bootstrap-wysihtml5 editor with the justify toolbar and parsing rules (among a lot other things).\n. ",
    "jque": "because it is not accepted\n. Good job\n. ",
    "justin-johnn": "@jhollingworth  Oops, I missed the Advanced settings from doc.  Thank you very much  :-) \n. ",
    "bodaonline": "Hi Guys,\ncan't figure out how to get rid of image upload button. Pls help:\nI have this in my header:\n```\n\n$(document).ready(function(){</p>\n<p>$('.wysihtml5').each(function(i, elem) {\n  $(elem).wysihtml5()\n});</p>\n<p>$(document).on('page:load', function(){\n  window['rangy'].initialized = false\n})</p>\n<p>})\n\n```\nThis is in my form html.erb:\n<div class=\"field\">\n<%= f.label :content %><br>\n<%= f.text_area :content, class: 'wysihtml5' %>\n</div>\nWhich produces:\n<div class=\"field\">\n<label for=\"idea_content\">Content</label><br>\n<textarea class=\"wysihtml5\" name=\"idea[content]\" id=\"idea_content\">\nblablah</textarea>\n</div>\n. ",
    "timbaas": "Not working for me too.. Don't know if it's just my project or a bug, have too check that out later.. \n. ",
    "meinhardmeintjes": "Every time I click on the font style dropdown it just jumps to the top (because href=#) without executing anything. I dont get any errors in my console and the rest is working fine. Don't know what to do now..?\nUpdate: Forgot to include bootstrap.js... Works fine now!\n. ",
    "stephanschielke": "had same problem as @meinhardmeintjes \nAlso forgot to inclue the bootstrap 3 js:\n Latest compiled and minified JavaScript \nsrc=\"//netdna.bootstrapcdn.com/bootstrap/3.0.0/js/bootstrap.min.js\" \n. @Nerian I didn't knew about your repository. Now the html-editor works with bootstrap3. Thanks!\n. ",
    "stephane-benoist": "Thanks\n. ",
    "TenSoja": "While no added colors to this file, not run on mine.\n. Nobody?\n. ",
    "kabeza": "did you try bassistance's?\n. ",
    "srkgupta": "Any help on this issue? How do we do validations on this field?\n. ",
    "maca": "Same problem here :(\n. ",
    "nicolasmartinrojo": "same here, anybody?\n. ",
    "bphamous": "same here, appreciate any insights!\n. ",
    "kb6673": "@lucascarvalho I tried combining this with jQuery AutoGrow to no avail. Did you manage to solve this?\n. My bad. I'll use the latest version!\n. ",
    "lucasvalhos": "thanks\n. ",
    "romain-bourgois": "Sorry about that, my mistake... The issue comes from this gem: https://github.com/Nerian/bootstrap-wysihtml5-rails, not yours.\n. ",
    "TheBrockEllis": "I spent some time researching the answer to this as well. Nothing was really working for me until I read this super simple piece of advice: https://github.com/xing/wysihtml5/issues/37\n\"Hi @pkimbrel . I didn't \"refresh\". I just set textarea's value before initializing of wysihtml5.\"\nSo that's what I did. Grabbed my text from the database, passed it to my file via an AJAX call and updated the .val() of the textarea and THEN initialized the editor. \n```\n$.ajax({\n    url: url,\n    success: function(data){\n        var obj = jQuery.parseJSON(data);\n        $('#editpost_id').val(obj.post[0].PostID);\n        $('#editpost_title').val(obj.post[0].Title);\n        $('#editpost_content').val(obj.post[0].Content);\n        $('#editpost_slug').val(obj.post[0].Slug);\n    $('#editpost_content').wysihtml5();\n}\n\n}); //ajax\n```\nWhere #editpost_content is my textarea. Hope it helps!\n. ",
    "garrytan": "Inserting HTML? Use the exec command. \neditor.composer.commands.exec('insertHTML', html)\n. ",
    "sams": "you'd need to enable div tags, as AFAIK div => span, unless a div object is added as a prop of tags in the config passed to initialize call.\nFor some interface you could see the colors dropdown\nset color to true when initializing the editor.\n. its interesting but seems to need some tweaking.  Would be nice to add an example of use.  I have got it partially working but no image is insert I get this error below:\nUncaught Error: INVALID_NODE_TYPE_ERR: DOM Range Exception 2 wysihtml5-0.3.0.js:2240\ncreateBeforeAfterNodeSetter wysihtml5-0.3.0.js:2240\nwysihtml5.Selection.Base.extend.setAfter wysihtml5-0.3.0.js:5976\nwysihtml5.commands.insertImage.exec wysihtml5-0.3.0.js:7419\nwysihtml5.Commands.Base.extend.exec wysihtml5-0.3.0.js:6792\nWysihtml5.initInsertImage.insertImage bootstrap-wysihtml5-0.0.2.js:246\nf.event.dispatch jquery-1.7.2.min.js:3\nf.event.add.h.handle.i\nAlso it would be good to be able to reload the assetUrl (I can't get it to use ./images.json instead it always loads /assets.json) - I think that support for thumbs should be added too.  Something similar could  be done with links also\n. move the getimages below the following block\nif(options[key] !== undefined) {\n                    if(options[key] === true) {\n                        value = true;\n                    }\n                } else {\n                    value = defaultOptions[key];\n                }\nand check if string (it should not be enabled by default)\nif(key === 'imagesUrl' && typeof options[key] === 'string') {\n    this.getImages(options[key]);\n}\nimageUpload should be handled by another script (not bootstrap-wysihtml5 IMHO)\nI have made some progress with using callbacks here\nif these props are enabled the tab menu would have nav items set (for the extra options upload and list)\nI am working towards thumbnails, delete links being optional in image list.\nUsing ids could cause problems with multiple editors.\n. nice :) I don't get that error.\nUPDATE: I have merged a bunch of PRs into a develop branch which I have just pushed\nPlan to add a set of examples in a dir to demo these updates & to add my ideas to this branch\n@Asherlc you may want to have a look at that branch.\n. you can do the html view with the following\n$('.editor').wysihtml5({\"html\": true});\n. ",
    "daniel-love": "I'll give it a try, thanks.\n. ",
    "jefffriesen": "sifarat,\nDid you ever figure this out? I need this as well.\n. ",
    "ijafri": "nope. only in textarea\n\n\n. ",
    "dougc84": "in the textarea:\nhtml\n<textarea my=\"params\" placeholder=\"The text that I want to show\"></textarea>\nthis will work using HTML5 with no problem. there are numerous JS and JQuery plugins you can use if you're using an older doctype.  This really isn't relevant to this plugin though.\n. ",
    "Cyan20": "i was looking for an answer but some are not working and i found your post, thanks dougc84, i found the answer\n. ",
    "webhacking": "i'm working in firefox \n. ",
    "bunnymatic": "i intended this to be two separate pull requests.  i'm going to try to undo this and send over 2 separate branched requests.\n. ",
    "jlebrech": "+1\n. ",
    "kiogo": "I also have this same question. Is this possible?\nThanks\n. ",
    "MYaman34": "change parser :)\n. ",
    "hadees": "that won't get rid of the toolbar buttons though will it?\n. ",
    "chrishough": "I have the same problem :( trying to find a solution now. \n. ",
    "ravishakya": "I have found a solution for that. \na[data-wysihtml5-command=\"Outdent\"],\na[data-wysihtml5-command=\"Indent\"] {\ndisplay:none !important;\n}. ",
    "daviddyess": "You have to use the style attribute in the textarea. \n. See the first line of the readme file\n@CanoGit. ",
    "yairEO": "zrod, so why do WYSIHTML5  gives you this setting if you can't use it? :)\n. you can use this code to resize:\nhttp://www.itsavesyou.com/TextArea_Resizer_example.htm\n. i don't understand your comment..\nI gave a 3rd party solution to resize the iframe since the pluging doesn't not let you do it in any way\n. what do you mean doesn't not seem to resize an iframe based on the example?\nthe example shows exactly how one can resize an iframe using a draggable hook on the bottom of it..it's super :)\nI hooked it up to my wesihtml5 easily.\nyou probably mean about expanding the iframe while writing in it, well I think that is not just a good idea as it get get really large sometimes and it's better idea to use a drag instead to change the height\n. ",
    "ramontayag": "@yairEO that does not seem to be wysihtml5\n. @yairEO It does not seem to resize an iframe based on the example. However, I did not read what the code of the plugin to see if it can resize iframes. In any case, looks like resizing of wysihtml5 is set for 0.4 release :)\n. ",
    "lactose": "@yairEO when using your proposed solution, the textarea is no longer editable. \n. ",
    "jonbursh": "A bit late, but I added the resize attribute using jquery:\n<script>\n    $( document ).ready(function() {\n        $(\".wysihtml5-sandbox\").css(\"resize\", \"vertical\");\n    });\n</script>\n. ",
    "thomaslarsson": "Thanks, man. Better late than never. \n. ",
    "staticaland": "That doesn't work for me. It just jumps back to the initial values when I click inside the textarea.\n. ",
    "CanoGit": "Resize property doesn't work for iFrame on Firefox. ",
    "Asherlc": "Hm, I think I forgot to update the dist file to the most recent version -- I've pushed up the changes (though I didn't apply it to the minified version). It's not giving me that error using the sample page, though I'm having trouble getting GitHub pages to work to test (AJAX loading locally seems to be a problem). Is it working better for you now?\n. Ah, I spoke too soon. The JSON sample file had an error in it. I've corrected it and pushed - the index.html sample page now works fine for me.\n. Forgive me if I'm misunderstanding, but those seem like issues outside the scope of this pull request. Are they specific to the images listing?\n. I've made some more changes that I think will be pretty useful. The most notable is that now there's an ajax file upload field right in the image insert modal, making it much easier to add images on the fly.\nI do have a couple problems I'm encountering, if anyone has any suggestions I'd be very appreciative:\n- The initImageUpload(); function is currently whenever the image modal is clicked. This doesn't really work since that means the function is initiated several times. However, when I add it elsewhere, it seems to get called before the modal is ready, so it never is able to get the DOM object.\n- the imagesUrl default value isn't getting overridden by the instantiation options.\n- I'm getting the Uncaught Error: INVALID_NODE_TYPE_ERR: DOM Range Exception 2 sporadically. I'm not able to make it appear consistently.\nI'm afraid I'm a bit stumped by these problems, so if anyone has ideas, that'd be great. Thanks!\n. Thanks! I'll try that out this evening.\nThe callback for image uploading sounds like a good idea, as well as the tab menu enabling.\nFor the callback, how much do you think should be set up in advance in the template? It needs an iframe in there to do the \"ajax\" upload, so that could either be in the template, or created on the fly with jquery in the callback.\nI'll also work on removing the ID's, and replacing with $.find() methods. One thing is that the iFrame is targeted by the form using the iframe's name attribute, so if people are instantiating multiple wysiwigs on a page using one jquery selector, it might be difficult to make that work.\nLooking forward to seeing what you come up with re: thumbnails and delete links.\n. I've worked in @sams edits and suggestions. I've also included what I think is likely to be the most common upload callback function into the sample html.\nI'm still getting the Uncaught Error: INVALID_NODE_TYPE_ERR: DOM Range Exception 2 error, but that seems to be related to issue #138, so I don't think it's a function of the additions.\n. ",
    "piotr0beschel": "Cannot add image if image path is not url like http://domain.com/img/filename.jpg.\nAlso cant add class for img tag\n. ",
    "brittneykernan": "Any luck with this? Working on this issue now\n. ",
    "anubhava2ksoft": "i have same issue how can use focus event on this editor please help \n. ",
    "adampatterson": "I as well need to add a button that will open a modal and allow me to insert HTML.\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/152\n. Thanks,\nIt looks like I can get what I need from this.\nThe only thing I see off the bat is that he mentions modifying the editor, I would hate to update the core and loose the functionality.\nBut I will give it a try.\n. ",
    "balexandre": "I would love to have left center and right alignments buttons :+1: \n. How did you create the <textarea> ?\nif you are using <asp:TextBox TextMode=\"MultiLine\" Rows=\"10\" id=\"HtmlTextBox\" runat=\"server\" /> all you need to do is call, in your code behind page string myText = HtmlTextBox.Text;\n. That's how to disable HTML cross validation at all.\nJust for your information, in ASP.NET MVC you can just say that, and only that TextBox can contain HTML characteres and keep everything else on the page to thrown an error when submitting, securing your page for any scripting exploits.\n. ",
    "tmaiaroto": "Yea, this is missing a lot of functionality of wysihtml5. It seems to hide it or cut it off in some manner. I'm going to have to rip through this but would rather not. I'm hoping there's a way to extend things... I'd love to add a speech button for starters (tried appending it to the toolbar with the load event but I imagine it's too late at that point). Then I'd love to start building plugins. Which I see how to change up the template for things, but will need greater control.\nAlso tried with custom templates key, but it didn't seem to work either. I could change existing ones but couldn't add new buttons.\nA code button would be a big +1 from me.\n. Yay, figured it out.\n$('#your-textarea').wysihtml5({\n    toolbar: { speech: '<li><a data-wysihtml5-command=\"insertSpeech\">speech</a></li>' }\n});\nI imagine custom commands will need to be built using the functionality of https://github.com/xing/wysihtml5 and then referenced here...\n. As far as your code concerns, you can keep the code tag by doing:\nparserRules: {\n    tags: {\n        code: {}\n        }\n}\nIn the options you pass to wysihtml5() but you're going to still need a button that runs a command to wrap the code in a <code> block unless you wanted to just set html: true and manually do it. If you also set stylesheets: ['bootstrap.min.css']  (whatever your bootstrap css path is) then you'll see that code block in the editor turn red and have a gray background.\n. You can add  blocks with:\n$('#your-textarea').wysihtml5({ toolbar: {\n   code:  function(locale, options) {\n    return '<li><a class=\"btn\" data-wysihtml5-command=\"formatInline\" data-wysihtml5-command-value=\"code\" href=\"javascript:;\" unselectable=\"on\"><i class=\"icon-beer\"></i></li>'\n   }\n});\nNow you're all set for the  blocks...I'm trying to figure out how to do even more though.\n. Ok, it's a little hacky, but I pasted it all out for everyone. If you want a really bad ass editor, use this:\n$('.wysihtml5').wysihtml5('deepExtend', {\n                stylesheets: ['/li3b_core/css/bootstrap.min.css'],\n                toolbar: {\n                    speech: '<li>' +\n                            '<a class=\"btn\" data-wysihtml5-command=\"insertSpeech\" title=\"Voice input\" href=\"javascript:;\" unselectable=\"on\"><i class=\"icon-volume-up\"></i></a>' +\n                        '</li>',\n                    code:  function(locale, options) {\n                        return '<li><a class=\"btn\" data-wysihtml5-command=\"formatInline\" data-wysihtml5-command-value=\"code\" href=\"javascript:;\" unselectable=\"on\"><i class=\"icon-th-large\"></i></li>'\n                    },\n                    insertAnything:  function(locale, options) {\n                            return '<li>' +\n                                '<a class=\"btn\" data-wysihtml5-command=\"insertHTML\" href=\"javascript:;\" data-toggle=\"modal\" data-target=\"#insertAnythingModal\" unselectable=\"on\"><i class=\"icon-asterisk\"></i></a>' +\n                                '<div id=\"insertAnythingModal\" data-wysihtml5-dialog=\"insertHTML\" class=\"modal hide fade\">' +\n                                    '<div class=\"modal-header\">' +\n                                        '<a class=\"close\" data-dismiss=\"modal\">&times;</a>' +\n                                        '<h3>Insert Some Stuff</h3>' +\n                                    '</div>' +\n                                    '<div class=\"modal-body\">' +\n                                        '<textarea id=\"myJazz\"></textarea>' +\n                                    '</div>' +\n                                    '<div class=\"modal-footer\">' +\n                                        '<a class=\"btn\" href=\"javascript:;\" data-dismiss=\"modal\">Cancel</a>' +\n                                        '<a class=\"btn btn-primary\" data-dismiss=\"modal\" data-wysihtml5-command=\"insertHTML\" onClick=\"$(this).attr(\\'data-wysihtml5-command-value\\', $(\\'#myJazz\\').val()); $(\\'#myJazz\\').val(\\'\\')\" data-wysihtml5-command-value=\"jazz\" href=\"javascript:;\" unselectable=\"on\">Insert</a>' +\n                                    '</div>' +\n                                '</div>' +\n                            '</li>';\n                    },\n                },\n                html: true,\n                parserRules: {\n                    classes: {\n                      \"middle\": 1,\n                      \"icon-beer\": 1,\n                      \"prettyprint\": 1\n                    },\n                    tags: {\n                        code: {},\n                        pre: {},\n                        strong: {},\n                        em: {},\n                        i: {}\n                    }\n                }\n            });\nBasically... You're using the \"insertHTML\" command that exists in wysihtml5. The first anchor doesn't really do what \"insertHTML\" normally does, it just brings up the modal. The link within the modal then sets the data attribute.\nAlternatively, you can insert any text with \"insertHTML\" in a static manner like so:\ninsertThis: function(locale, options) {\n                        return '<li><a class=\"btn\" data-wysihtml5-command=\"insertHTML\" data-wysihtml5-command-value=\"I got inserted.\" href=\"javascript:;\"><i class=\"icon-ok\"></i></a></li>';\n                    }\nNote: You can not do both because you can only have one of each command.\nSo it's a bit hacky, but works. I suppose you could make that modal do a bunch of stuff and then send back the final HTML value, combining the command into a big multi-function button. It kinda stinks you can't add multiple of the same command because it could get confusing and leave you in a situation of being limited.\n. You can also look at this guy's solution: http://itsnot.freehostia.com/wysihtml5/wysihtml5-new.htm ... But you have to have focus and I think have something typed in order for the insert to work. You may be able to fix it up so it works a little nicer though.\n. As it turns out, after all this hard work...The thing submits an empty string for me. So wysihtml5 is dead to me. Moved to CKEditor. So glad to have wasted an entire day. Hopefully this helps someone though.\n. Well, now that my frustrations have gone away =) I may give it another shot haha.\n. ",
    "gadicc": "@tmaiaroto, your code was a total timesaver... i'm sorry it didn't work out for you but it worked out great for me.  I just got the value from the textarea using jQuery val(), and it worked perfectly.\n. ",
    "OneDivZero": "@tmaiaroto  thanks for your nice work! It helped me really to figure out some cool internals. Despite all that, I think what  you've tried should not be impossible. Maybe it is not the right way to trust on the internal commands of this plugin. Why didn't you just apply a click-handler on your a-tag in the modal and then do this stuff bypassed? This should work in theory. Even if this plugin has some misterious behaviour when you'll dig in a bit, it's really worth to customize it further.\n. ",
    "condee78": "Hi,\nI had been tried your suggestion, and it's work ^^, thanks balexandre\nah, I want to share one thing. I have facing another problem when I put text with html tag, like bold or italic, it will getting error. and fortunately I know how to fix it. \nI put the code  \" httpRuntime requestValidationMode=\"2.0\"  \" in my web.config, and set the ValidateRequest to false.\njust in case another people facing this error ^^.\nthanks\n. ",
    "OmarBerrayti": "Maybe that will help\nhttp://rcode5.wordpress.com/2012/11/01/custom-image-upload-modal-with-bootstrap-wysihtml5/\n. ",
    "elsupergomez": "Thanks\n. ",
    "brightstreetgroup": "I have this same problem.  I've tried in Chrome, IE, etc.  Moved the scripts around.  Nothing fixes it yet.\nIt looks like the error is on this line.  I think that wysi is \"undefined\"\nvar editor = new wysi.Editor(this.el[0], options);\nWhole function:\ncreateEditor: function (options) {\n            options = options || {};\n            options.toolbar = this.toolbar[0];\nvar editor = new wysi.Editor(this.el[0], options);\n        if (options && options.events) {\n            for (var eventName in options.events) {\n                editor.on(eventName, options.events[eventName]);\n            }\n        }\n        return editor;\n    },\n. ",
    "weotch": "I had this problem and it turned out the problem was that this plugin was loading before the wysihtml5.js file.  This was because I was using Require.js and didn't explicitly set as a dependency of bootstrap-wysihtml5 like:\nshim: {\n        'plugins/bootstrap-wysihtml5' : ['plugins/wysihtml5-0.3.0', 'plugins/bootstrap-bkwld']\n    },\n. ",
    "jackbit": "You have to load javascript in correct orders like this :\n// RAILS Version\n//= require bootstrap-wysihtml5/wysihtml5-0.3.0\n//= require bootstrap-wysihtml5/bootstrap-wysihtml5\n/* CAKE Version */\necho $this->Html->script('bootstrap-wysihtml5/wysihtml5-0.3.0');\necho $this->Html->script('bootstrap-wysihtml5/bootstrap-wysihtml5');\n. ",
    "talha2k": "Re-ordering the files fixed the error for me :)\n. ",
    "iantearle": "Also - how do you default the text to be wrapped in a paragraph? Seems if I just load the editor straight off it doesnt wrap the text in anything.\n. ",
    "TraeRegan": "I'm using wysihtml5-0.4.0pre.min.js and this still doesn't work. e.g.\n<script src=\"js/wysihtml5-0.4.0pre.min.js\"></script>\n<script src=\"js/bootstrap-wysihtml5-0.0.2.min.js\"></script>\n<script>\n$().ready(function() {\n     $('#wysi').wysihtml5({useLineBreaks: false});\n});\n</script>\nstill produces all\n<br>\nand no\n<p>\nAm I doing something wrong? Thank you!\n. Correct... unfortunately.\n. I've confirmed that useLineBreaks: false works fine using wysihtml5-0.4.0pre.min.js without bootstrap-wysihtml5 so something in this project is preventing that setting from working.\n. Just grabbed the latest https://raw.github.com/jhollingworth/bootstrap-wysihtml5/master/src/bootstrap-wysihtml5.js and minified it and useLineBreaks: false is working fine now. Strange, but awesome.\n. ",
    "akimkelar": "it seems some like $('#textarea').wysihtml5({useLineBreaks: false}); does not works\n. ",
    "thawkins": "the underlying editor now has video embed support, it would be great to get it into the bootstrap shim\n. ",
    "elzos": "Some folks with commits on the wysihtml5 editor like:\nhttps://github.com/raulb/wysihtml5/commit/35a8e157376dc4979bed9396dbc0824229d50ed1\nhttps://github.com/xing/wysihtml5/pull/12/files\nhave made it possible. I have used parts of their code into bootstrap-wysihtml5 and made it work too, needs some cleanups though... also some updates to locale files. Hopefully, I'll gather what's needed and commit it.\n. and here it is:\nhttps://github.com/elzos/bootstrap-wysihtml5/commit/fc3701910169256121d8c1e0f99c8b77e609f66c\n. Hmm... I haven't made any changes to the original Gemfile since I forked from http://jhollingworth.github.com/bootstrap-wysihtml5/, and haven't tried to install it as a gem either. Does it work for the original repo URL? Is there some error msg?\n. Ok, so you suggest I add this line to the project's Gemfile? Or is this for someone who wants to import my module to their own project. Sorry, I am not that familiar with Ruby yet.\n. I guess I just have to execute rake, so that the src/ files are copied to dist/, and the gem that is produced includes those in dist. This should make it work, don't you think?\n. ",
    "bcackerman": "@elzos How do I install your version in my gemfile? gem 'bootstrap-wysihtml5', :git => 'git://github.com/elzos/bootstrap-wysihtml5.git' does not work\n. Yeah I get this error\nCould not find gem 'bootstrap-wysihtml5 (>= 0) ruby' in git://github.com/elzos/bootstrap-wysihtml5.git (at master).\nSource does not contain any versions of 'bootstrap-wysihtml5 (>= 0) ruby'\n. Ok, you have to use this in your gemfile since you don't have a gemspec file. gem 'bootstrap-wysihtml5', '0.0.0', :git => 'git://github.com/elzos/bootstrap-wysihtml5.git'\n. The src/ files aren't included properly though\n. Possibly look into \n$('#click_the_textarea').click(function() {\n  $('#editor').show();\n});\n. ",
    "SRWieZ": "I tried this commit and it works perfectly! Thanks.\n. ",
    "SpaHost": "Thats for spanish !\n-            video: {\n-                insert: \"Insertar Video de YouTube\",\n-                cancel: \"Cancelar\",\n-                invalid: \"URL no valida\"\n-            },\nthat will be pulled!! 100% Recommended!\n. ou mai godines !\nmysql_query(\"SET NAMES 'utf8'\");\n;) Esto te ayudará\n. ",
    "hyperrjas": "+1\n. @puredistortion I'm using https://github.com/Nerian/bootstrap-wysihtml5-rails and I can't use this commit with this gem.\nThank you!\n. ",
    "tomkrus": "+1\n. Translation does not work, need to update too.\n. Dead project?\n. This repo is dead. This fork is ok https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. ",
    "dalethestirling": "+1 was an simple merge with current head (commit: 283bb8f859977ac1aafb09bee715a1190f8cfd1b)\nAs seen in https://github.com/puredistortion/bootstrap-wysihtml5/commit/7e2c149dd2a3b6f416dae97d79c4d585eae7a7e9\n. @hyperrjas I have merged the javascript see  Pull Request though I had no idea how to get Rails working so it will need some testing.\n. ",
    "ericcbm": "+1\n. ",
    "AlJohri": "+1 on this PR. Please merge this :)\n. This looks sweet. Nice work!\n. @jspiro My company will also be using your fork (github.com/artillery/bootstrap-wysihtml5) until this gem is updated. Any chance you can update to RC2?\n. @Nerian It's working properly! Thanks a bunch!\n\n. ",
    "daneastwell": "I think this issue might exist in wysihtml5 when the the item clicked is a child element of the createLink link element.\nYou can recreate this by cloning wysihtml5 and wrapping a span element around the link in the advanced example:\nhtml\n<a data-wysihtml5-command=\"createLink\">insert<span> link</span></a>\nClicking on the word 'insert' won't recreate the issue, but the word 'link' will.\nIn the bootstrap-wysihtml5 version, the <i class=\"icon-share\"></i> is a child element so will set up this unwanted behaviour.\n. ",
    "zeekerg": "The main wysiwyg javascript was missing sorry.\n. ",
    "alexykot": "this also shows when you include bootstrap-wysihtml5.js before wysihtml5.min.js. It has to go after, otherwise it also throws wysi is undefined error.\n. ",
    "petrichor8": "possibly hook into the underlying editor to exec commands?\nvar wysihtml5Editor = $('#some-textarea').wysihtml5().data(\"wysihtml5\").editor;\nwysihtml5Editor.composer.commands.exec(\"bold\");\nas seen here (near the bottom):   https://github.com/jhollingworth/bootstrap-wysihtml5/\n. ",
    "ShintoTuna": "Would also like to know how ist it done.\n. ",
    "sundna": "Hi jalalomary ,\ntry this \nvar $editor = $('#some-textarea').wysihtml5()\n$editor.data(\"wysihtml5\").composer.setValue('Some HTML code);\n. ",
    "jameswebbdesign": "@sundna this code still duplicates the toolbar.. ",
    "Lechus": "+1\nDzięki.\n. ",
    "gpoitch": "+1\nWidth calculation is off if existing textarea has padding.\n. ",
    "Intrepidd": "Sory i posted on this repository, i should have posted on the repository of the gem, closing.\n. ",
    "damonjentree": "Try adding this to your config options:\n\"stylesheets\": false\n. ",
    "jhrabows": "This is a valid documentation issue. We need a sentence which explains that 'color' option requires additional css file which needs to be listed in \"stylesheets\" array.\n. See also https://github.com/jhollingworth/bootstrap-wysihtml5/issues/183\n. ",
    "DPSever": "To expand on @wgroeneveld, you need the following option:\nThis also fixes mime type issues in Internet Explorer.\n. ",
    "CaptainQuirk": "The path to the referenced file is wrong. It seems to be relative to the current url, not to the website's root.\n. ",
    "flyersun": "I'm having the same issue. I need to change the live path for lib/css/wysiwyg-color.css, not sure how to do this?\n. ",
    "gplv2": "Seems to work for me this fix.  There isn't a file like that on my whole disk.  Do we need  it ?\n. ",
    "sumit-sharma": "Open bootstrap-wysihtml5.js Search \"stylesheets:  \" on line no 453\nchange path wysiwyg-color.css if not available  download from github \nIt worked for me\n. ",
    "AlexandrM": "In IE (internet explorer) not work color button\n1. Select text\n2. Click on select color dropdown\n   2.1. In Chrome text selection stay on\n   2.2. In IE text selection clear\n3. On select color \n   3.1. Chrome - color changed\n   3.1. IE - color unchanged\nI think problem in selection clear.\n. What porblem if $(\"#Description\").data('wysihtml5').editor = undefined. $(\"#Description\").data('wysihtml5') is Wysihtml5\n? Thanks.\n. ",
    "churiart": "@CaptainQuirk Current wysihtml5 v0.3.0 line 5506, an slash is missed. You can however add it:\nhtml += '<link rel=\"stylesheet\" href=\"/' + stylesheets[i] + '\">';\n. ",
    "farabf33": "open bootstrap-wysihtml5.js,[ find stylesheets:  and edit the URL of wysiwyg-color.css.\n. ",
    "nalonsor": "Try adding this to your config options:\n\"stylesheets\": '../css/wysiwyg-color.css'\ntry to set the css location, it works for me.\n. make sure wysiwyg-color.css is correctly loading on your frontend, and can you paste the example text saved on your BD?\n. ",
    "Enalmada": "Ok, so to use the latest code for now we need to explicitly add ids and then run an each:\n<textarea class=\"textarea\" id=\"ta1\" placeholder=\"Enter text ...\" style=\"width: 810px; height: 200px\"></textarea> \n<textarea class=\"textarea\" id=\"ta2\" placeholder=\"Enter text ...\" style=\"width: 810px; height: 200px\"></textarea>\n...\n<script>\n    $(\".textarea\").each(function(){$(this).wysihtml5();});\n</script>\nThanks for looking into this.\n. ",
    "statico": ":+1: — discovered this on my own, each() is required for multiple textareas.\n. ",
    "nadiyapara": "<textarea class=\"wysihtml5 form-control\"></textarea>\n<script type=\"text/javascript\"> \n  $(document).ready(function () {\n  $('.wysihtml5').wysihtml5();\n  });\n  </script>\n. ",
    "Waxolunist": "Just for completeness. \nThis repo is not maintained anymore.\nIn my fork https://github.com/Waxolunist/bootstrap3-wysihtml5-bower you will find a working example for multiple texteditors on one page.\n. Because this repo is not maintained anymore. Try others, like this one: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. Just created a fork. It is on bower available: bootstrap3-wysihtml5-bower\nsee https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I took your PR and merged it into my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\nThx\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I took your PR and merged it into my fork. https://github.com/Waxolunist/bootstrap3-wysihtml5-bower \nThx\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I made a fork too. It is maintained here: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\nplus available on bower. PRs welcome.\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. Just created a fork. It is on bower available: bootstrap3-wysihtml5-bower\nsee https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. Just created a fork. It is on bower available: bootstrap3-wysihtml5-bower\nsee https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. Done ;)\n. Just created a fork. It is on bower available: bootstrap3-wysihtml5-bower\nsee https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. I don't know if this repo is still maintained. But I would be glad to accept your pull request in my fork: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. Ok, then make a PR, I will accept it immediately.\n. This repo seems to be dead. If you are using bootstrap 3, I suggest you use my fork https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\nIt supports bower for dependency management. If you are using another one, I appreciate any pull request.\n. I pulled your pr into my repo over here: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower \nThx\n. Since v0.2.8 also with Bootstrap 3.1 support.\n. Answered in my repo - https://github.com/Waxolunist/bootstrap3-wysihtml5-bower/issues/37\n. Seems like wysihtml.js is missing.\n. Since this repo is dead, would you mind to make the PR into my still maintained repo over here: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. You can of course fork my repo like any other repo. Clone it, create a branch, copy your files over and make a pull request.\n. thx\n. Hello this Repo is not maintained anymore. Plz check out my repo, which Supports bs3. \n. Oh, you don't have to use handlebars in your project. It's only using handlebars internally for the templates and only the runtime version (about 3k).\n. As mentioned here: https://github.com/xing/wysihtml5/issues/497\nThis repo is not maintained. I suggest switching over to https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. Sorry, I can't. Because this was fixed in the fork by edicy/wysihtml5. \nYou are using a not maintained component based on a not maintained editor.\nThe changes from bs2 to bs3 haven't been big, just some classes have changed.\nWhat you could do is to fork my repo and change the templates. Shouldn't be a big deal.\nMaybe you can add an option for bs2, which adds the correct classes instead of the bs3 classes.\n. This Repo is not maintained anymore. I would ask here: https://github.com/Nerian/bootstrap-wysihtml5-rails \n. This repo is not maintained any more. Feature Request to one of the named sibling projects in the readme.\n. This repo is not maintained anymore.\nMaybe you can use my fork which should be able to achieve what you want.\nSee here: https://github.com/Waxolunist/bootstrap3-wysihtml5-bower#custom-templates-for-toolbar-buttons\n. This repo is not maintained anymore. Could you push to my fork, the official successor. https://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n. ",
    "sigmatht": "https://github.com/jhollingworth/bootstrap-wysihtml5/issues/94\nEssentially in bootstrap.wysihtml5.js file you'll need to add tabindex='-1' to the corresponding btn lines.\n. ",
    "metz0r": "After spending some more time with this, I came to the following conclusions:\n- The problem is introduced in bootstrap.js version 2.1.0 and is not present in the live demo because it uses 2.0.2\n- It is caused by touchstart event bindings on .dropdown\n- This issue describes how it started: https://github.com/twitter/bootstrap/issues/1769\nAnd that's as far as I got. I don't know if it's a bug on bootstrap's part or on bootstrap-wysihtml5's. \nWhat I did to fix it was to comment out the dropdown event bindings in 2.2.2:\n$(document)\n    .on('click.dropdown.data-api touchstart.dropdown.data-api', clearMenus)\n    .on('click.dropdown touchstart.dropdown.data-api', '.dropdown form', function (e) { e.stopPropagation() })\n    .on('touchstart.dropdown.data-api', '.dropdown-menu', function (e) { e.stopPropagation() })\n    .on('click.dropdown.data-api touchstart.dropdown.data-api'  , toggle, Dropdown.prototype.toggle)\n    .on('keydown.dropdown.data-api touchstart.dropdown.data-api', toggle + ', [role=menu]' , Dropdown.prototype.keydown)\nand instead add the dropdown event bindings from 2.0.4:\n$(document)\n    .on('click.dropdown.data-api', clearMenus)\n    .on('click.dropdown.data-api', toggle, Dropdown.prototype.toggle)\nEdit: a cleaner fix that doesn't modify bootstrap.js:\n         $(document).off('touchstart.dropdown.data-api');\n. ",
    "cosmolen": "I found my mistake in translation file. I uploaded new file. Sorry\n. ",
    "yusuf": "Make sure you are loading the files located in /src folder\nAnd the path to the wysiwyg-color.css is correct!\n. #jhrabows wouldn't it be easier if at the top a variable is set for path-to-app-css so users can easily change the path. As, not in all scenarios, we can have the css path in ./lib/css/wysiwyg-color.css, like when using a MVC framework!\nSomething like :\nvar csspath = (window.location.href).slice(0,(window.location.href).indexOf(\"/\",(window.location.host).length+9))+\"/lib/css/\";\nand change :\nstylesheets: [csspath+\"wysiwyg-color.css\"]\nBTW, great work!\n. ",
    "geekyme": "Got it guys thanks.\n. ",
    "togoenvogue": "Hello,\nI have an issue with the \"color\": true property.\nAfter calling : \n$('#test').wysihtml5({\n\"font-styles\": true, //Font styling, e.g. h1, h2, etc. Default true\n\"emphasis\": true, //Italics, bold, etc. Default true\n\"lists\": true, //(Un)ordered lists, e.g. Bullets, Numbers. Default true\n\"html\": false, //Button which allows you to edit the generated HTML. Default false\n\"link\": false, //Button to insert a link. Default true\n\"image\": false, //Button to insert an image. Default true,\n\"color\": true //Button to change color of font\n});\nI can see the color button there, but when I select a text and select a color, the text does not change color.\nDo you have any idea please ?\nThank you\n. Unfortunately not, still couldnt get a solution.\n2013/7/19 ARH3 notifications@github.com\n\nHey @togoenvogue https://github.com/togoenvogue and @julioElpabohttps://github.com/julioElpabodid either of you ever figure this out? I am having the same issue.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/248#issuecomment-21273798\n.\n\n\nJOHN KOMLA\nDirecteur Général\n====== * * *  =======\nTOGO EN VOGUE\nDéveloppement de sites et applications web\nHébergement Linux et Windows\nDéveloppement des solutions Web SMS\nFormation pratique et coaching en Dreamweaver,\nFireworks, xHTML, PHP-MySQL, JAVA, CSS, C#.NET\n====== * * *  =======\n90, bvd du 30 Aout\nA coté de la pharmacie Béthel, Adidogomé\nBP : 81 355, Lomé-Togo\nBureau : (00228) 22 39 48 99\nMobiles (00228) 98 77 97 34 / 90 19 95 22\nSkype : togoenvogue\nPlateforme du web SMS : www.letavi.mobi\nNos services : www.togoenvogue.net\nPortail d'information : www.togoenvogue.com\nÉconomie de carburant : www.ecarburant.com\nEmail : services@togoenvogue.net\nSkype : togoenvogue\n. Thank your ARH3. This was seriously helpful, could have not solved it alone.\nThank you once again !!!\n2013/7/20 ARH3 notifications@github.com\n\nOkay I figured it out @togoenvogue https://github.com/togoenvogue... at\nleast for me. If you look at line 453 of bootstrap-wysihtml5 / src /\nbootstrap-wysihtml5.js it says this:\nstylesheets: [\"./lib/css/wysiwyg-color.css\"], // (path_to_project/lib/css/wysiwyg-color.css)\nYou need to direct that to the css file located in \n/lib/css/wysiwyg-color.css_. IMO this is awful practice to have this one\nrandom css file with some random classes by itself, so what I did was\ncopy/paste that entire file into the bottom of bootstrap-wysihtml5 / src\n/ bootstrap-wysihtml5.css_ and then point like 453 to that file. This way\nI have 1 new css file instead of 2.\nWhen it's all said and done, I only copied 2 files from this repo into my\napp:\n1. bootstrap-wysihtml5 / src / bootstrap-wysihtml5.js\n2. bootstrap-wysihtml5 / src / bootstrap-wysihtml5.css * (with\n   appended with extra classes from /lib/css/wysiwyg-color.css*\n—\nReply to this email directly or view it on GitHubhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/248#issuecomment-21285322\n.\n\n\nJOHN KOMLA\nDirecteur Général\n====== * * *  =======\nTOGO EN VOGUE\nDéveloppement de sites et applications web\nHébergement Linux et Windows\nDéveloppement des solutions Web SMS\nFormation pratique et coaching en Dreamweaver,\nFireworks, xHTML, PHP-MySQL, JAVA, CSS, C#.NET\n====== * * *  =======\n90, bvd du 30 Aout\nA coté de la pharmacie Béthel, Adidogomé\nBP : 81 355, Lomé-Togo\nBureau : (00228) 22 39 48 99\nMobiles (00228) 98 77 97 34 / 90 19 95 22\nSkype : togoenvogue\nPlateforme du web SMS : www.letavi.mobi\nNos services : www.togoenvogue.net\nPortail d'information : www.togoenvogue.com\nÉconomie de carburant : www.ecarburant.com\nEmail : services@togoenvogue.net\nSkype : togoenvogue\n. ",
    "nandodutra": "@togoenvogue I have the same issue that you had, you did solve this issue?\n. ",
    "serkanalgur": "Thanks\n. ",
    "bradt": "Thanks this saved me some serious time!\n. ",
    "vyorkin": "thanks, you saved my time too, it definitely should be in wiki or should be extended to support multiple elements\n. ",
    "valachi": "+1 to this one\n. ",
    "trong291990": "Is it support RTL direction ?\n. found solution with stylesheet option \n. ",
    "mozahran": "Yes it does\n. ",
    "salixzs": "Are you sure your textarea has this attribute:\n<textarea id=\"textarea\">.\nIf you have ID for your textarea element something else, it will not apply wysihtml5 to that text area.\nIf you have textarea another ID, use it in JavaScript line, like\n$('#myownid').wysihtml5()\nAlso if you use Model in your view, you can use it this way\n$('#@Html.IdFor(m => m.TextField)').wysihtml5()\n. ",
    "duskhacker": "Still a bug in 2019.. ",
    "mickvandijk": "Thanks for this answer. Helped me out!\n2013/2/6 Robert Reinhard notifications@github.com\n\nI was getting a \"Uncaught Error: NOT_FOUND_ERR: DOM Exception 8 for\nappendChild call\" error when I had multiple textareas with WYSIWYGs on the\nsame page. It was because, for the second instance, the options.toolbar was\ndefined for the createToolbar() because of how it gets added into the\noptions object in createEditor() before being passed to new wysi.Editor.\nThis fix clones the options object before adding the toolbar.\nYou can merge this Pull Request by running\ngit pull https://github.com/weotch/bootstrap-wysihtml5 patch-1\nOr view, comment on, or merge it at:\nhttps://github.com/jhollingworth/bootstrap-wysihtml5/pull/209\nCommit Summary\n- Fixing issue with multiple instances on a page\nFile Changes\n- M src/bootstrap-wysihtml5.jshttps://github.com/jhollingworth/bootstrap-wysihtml5/pull/209/files#diff-0(4)\nPatch Links:\n- https://github.com/jhollingworth/bootstrap-wysihtml5/pull/209.patch\n- https://github.com/jhollingworth/bootstrap-wysihtml5/pull/209.diff\n\n\nMvg,\nMick van Dijk\nMickert.nl\n. ",
    "dorgan": "javascript\n    $('#id_of_editor').data(\"wysihtml5\").editor.setValue('<p>Som html goes here</p>');\n. I would expect this to be how it works.  As this is a WYSIWYG editor.  If\nyou're worried about that type of stuff extend the code for your needs or\nfilter this server side.\nOn Sunday, April 13, 2014, Ashar Javed notifications@github.com wrote:\n\nHi,\nThe editor is vulnerable to an XSS. The editor allows users to insert link\nand if instead of normal link, I input JavaScript URI\njavascript:alert%28location%29\nthen it works. The attacker can execute arbitrary code of his choice.\nPlease fix this issue. Thanks!\n\nReply to this email directly or view it on GitHubhttps://github.com/jhollingworth/bootstrap-wysihtml5/issues/340\n.\n. \n",
    "valdezalbertm": "Thanks bro! you nailed it!\n. Thanks bro! you nailed it!\n. ",
    "OneWebPro": "Its good question! Im waiting for answer too.\n. ",
    "der-robert": "I have exact the same problem ...\nThe hidden textarea has all the formatin html tag but the editing iframe not \nOnly the span with the color class will be removed...\nThe \"link\" html tag (incl. target=\"_blank\">) works O.o and any other formating like bold, italic and so on still works too.\nUPDATE:\nI solved the problem.\nI had an error in the color class names. In the bootstrap-wysihtml5.js the color class names were called e.g. \"color-red\" but the parser in the wysihtml5-0.3.0.js expected the class wysiwyg-color-red (see regex line 7025).\nI rerenamed the color code names in the bootstrap-wysihtml5.js and all works fine.\n. ",
    "robotslave": "By design, the underlying wysihtml5 widget uses a whitelist-only model for scrubbing input; the fact that there is no easy way to do what you need is considered a feature.\n. ",
    "istrobes": "http://stackoverflow.com/questions/13681594/how-to-disabled-wysihtml5-html-clean-up-in-editor/17656572#17656572\n. ",
    "ghophp": "I have made the same thing, but you perform a good job there, where is the repository owner that not merge this yet?\n. I forgot the locale support. Just a sec :)\n. ",
    "abarriere": "I have the same isue.\nwysihtml5 remove all  attribut and replace it by null if it containts '/'\n. ",
    "rfines": "I totally agree with this. I am trying to implement a character counter for this control and it seems to be impossible to get  hold of the actual element being typed into. Any advice?\n. Wouldnt that only count the characters after the user leaves the text area? I am looking for some way to listen to the keyup and keydown events so that I can have a dynamic character count similar to twitter's counter.\n. ",
    "micksear": "Although I think it would be nicer if you can just hook into events on the original textarea directly, you can make it work in that way by doing this:\n$('textarea').wysihtml5({\n   \"events\": {\n      \"blur\": function() { \n         $('textarea').trigger('change');\n      }\n   }\n});\n. ",
    "jnbt-bb": "Use can use editor.composer.doc to attach listeners. See this jsfiddle: http://jsfiddle.net/6dgYp/\n. ",
    "grjones": "Same issue here\n. ",
    "violacase": "Hi, Thanks for your answer!\nAfter some trying I now have the following working code.\n\neditor = new $('textarea').wysihtml5({\n    \"events\": {\n           \"newword:composer\": function() {\n            text = editor.val();\n        myfilter = text.indexOf('/h');\n        if (myfilter>-1) {\n           text = text.replace ('/h', 'my HTML ');\n          this.clear().composer.commands.exec(\"insertHTML\", text');\n        }\n       }\n    }\n});\n\n. I closed this issue too soon...\nA new problem has arrived:\nAfter running the above code the input cursor (the carot) is being placed at the end of the entire textarea string. This is not what I want because input typing and pasting can occur anywhere in the textarea. Any idea how we can place/focus the cursor directly after the inserted substring?\n. That's a pitty germanotm...\nWhat we need is a better focus() function. It's easy to calculate where the offset is before/after inserting or deleting text.\nA function like FocusMouseCursor(index) or just focus(bool[,index]) is all we need...\nMaybe it's possible to hack some behaviour? https://gist.github.com/mathiasbynens/326491\n. Back to the basics.\nWhat we need is this:\nThe event 'newword:composer' should give the offset index of the 'new word' in the textarea string.\nFor taking action on this event we should be able to use the following commands : \n\nmyHTML = \"Hello world\";\nonNewWord.deleteNewWord();\nonNewWord.insert(myHTML);\nindex += strlen(myHTML);\nonNewWord.focus(bool, index);\n\n. ",
    "germanotm": "I had the same problem too.\nI checked and there are a similar error with CTRL+Z feature.\nI don't solve it yet.\nhttps://github.com/xing/wysihtml5/issues/81\n. ",
    "Klerith": "Nop, eso no resolvio el problema\n. ",
    "slamarca": "Hi, for anyone stumbling upon this issue I managed to find that the plugin copies the styles  from the element pointed to by editor.composer.focusStylesHost every time the composer gets the focus (and does the same on blurring with editor.composer.blurStylesHost). So, if when the plugin gets initialized the textarea is disabled the composer iframe will always get the 'disabled' appearance on focus. You could workaround this issue tinkering at the right moment with the styles of the element pointed by editor.composer.focusStylesHost.\n. ",
    "elygiahh": "I´m still having the same question,...\n. Hey Somiks! So, what was the solution you've found out?! I have the same problem, I don't know how to disable hot keys, it only works in appearance.\n. ",
    "thuatnha": "Plz Help me. \n. ",
    "ykbks": "This worked for me, should for you:\n$('#content').wysihtml5({\n          events: {\n            load: function() {\n              var editor = this;\n              $(editor.currentView.doc.body).on(\"keydown\",function(event) {\n                var l = event.currentTarget.innerText.length;\n                if(l >= 1000) {\n                  $('#count').html('<span class=\"text-danger\">Total characters exceed 1000. Extra characters will not be saved.</span>');\n                } else {\n                  var left = 1000 - l;\n                  $('#count').html('<span class=\"text-info\">'+ left + ' characters left ' +'</span>');\n                }\n              }); \n            }\n          }\n       });\n. ",
    "shaunfreeman": "Yes there is,\nTake a look at the code and remove all h1, h5 and h6 references you find\n. ",
    "jsodeman": "I think \nvar wysihtml5 = editBody.data(\"wysihtml5\");\nshould be\nvar wysihtml5 = element.data(\"wysihtml5\");\nSo\n$(\"#example\").data(\"wysihtml5\").editor.setValue(\"TEST\");\n. ",
    "anjit6": "$(\"#example\").data('wysihtml5').editor always returns undefined, so unable to set value. Is there any other method to get access to editor / set value?\n. Reverted back to v0.3.3 and it works fine now. Might be some problem with master version.\n. ",
    "FriesFlorian": "Reverting to v0.3.3 solved the problem for me as well.\n. ",
    "gordonbisnor": "Also I seed that if I css style the width it does honor that.\n. ",
    "aamederen": "Closing, since the repo is not maintained.\n. ",
    "sennor": "My mistake forgot to include boostrap js in application.js:\n//= require bootstrap\n//= require bootstrap-alert\n. ",
    "julioElpabo": "Hello,\nI have the same issue. Any idea?\nThank you!\n. ",
    "ARH3": "Hey @togoenvogue and @julioElpabo did either of you ever figure this out? I am having the same issue.\n. Okay I figured it out @togoenvogue... at least for me. If you look at line 453 of bootstrap-wysihtml5 / src / bootstrap-wysihtml5.js it says this:  You need to direct that to the css file located in /lib/css/wysiwyg-color.css. IMO this is awful practice to have this one random css file with some random classes by itself, so what I did was copy/paste that entire file into the bottom of bootstrap-wysihtml5 / src / bootstrap-wysihtml5.css and then point like 453 to that file. This way I have 1 new css file instead of 2.\nWhen it's all said and done, I only copied 2 files from this repo into my app:bootstrap-wysihtml5 / src / bootstrap-wysihtml5.jsbootstrap-wysihtml5 / src / bootstrap-wysihtml5.css  (with appended with extra classes from /lib/css/wysiwyg-color.css\n. ",
    "archanavhire": "Thanks @ARH3 .\n. You can do it by setHTML method.\n$(\".selector\").editable(\"setHTML\", \"\", false);\n. ",
    "dinie": "Bump, is there any reason why this shouldn't be merged?\n. ",
    "cmdalbem": "I've just found that the problem is when using icons from Font-Awesome, where the indent icon semantic is inverted. :/\n. ",
    "billvieux": "I had the same issue - fontawesome and bootstrap have the semantics reversed for indent. I turned off the lists option and used the custom templates option for the \"lists\" toolbar.\njavascript\nvar myCustomTemplates = {\n    html : function(locale) {\n      return \"<li>\" +\n             \"<div class='btn-group'>\" +\n             \"<a class='btn' data-wysihtml5-command='insertUnorderedList' title='Unordered List'><i class='icon-list'></i></a>\" +\n             \"<a class='btn' data-wysihtml5-command='insertOrderedList' title='Ordered List'><i class='icon-th-list'></i></a>\" +\n             \"<a class='btn' data-wysihtml5-command='Outdent' title='Outdent'><i class='icon-indent-left'></i></a>\" +\n             \"<a class='btn' data-wysihtml5-command='Indent' title='Indent'><i class='icon-indent-right'></i></a>\" +\n             \"</div>\" +\n             \"</li>\";\n    }\n  }\n. ",
    "renege": "Same problem here! #bug \n. @jhollingworth working with bootstrap v2.3.0 and jquery 1.9.1!\n. ",
    "jukkah": "Pleace swap translations for indent and outdent. Them are currently translated as follows:\njavascript\n{\n    outdent: \"Suurenna sisennystä\", // In English \"Increase indent\"\n    indent:  \"Pienennä sisennystä\"  // In English \"Decrease indent\"\n}\n. Duplicate of #257.\n. ",
    "EOM": "Solution, such as copying contents of a textarea1 to textarea2\n$('#ProductosTexto').wysihtml5();\n$('#ProductosTextoEn').wysihtml5();\n//Copy textarea1 to textarea2\n$('#btnTxtText').on('click', function(){\n      var wysihtml5Editor = $('#ProductosTextoEn').data(\"wysihtml5\").editor;\n      wysihtml5Editor.setValue( $('#ProductosTexto').val(), true);\n });\n. ",
    "ajimenezdev": "I have the same problem\nIs solved this issue?\nor did you find a workaround to solve it?\n. ",
    "lsuder": "I didn't find any solution for this problem, I'm going to use parent project:\nhttps://github.com/xing/wysihtml5\nThis issue is fixed there and it can be easily styled.\n. ",
    "radhewro": "thanks!\n. ",
    "flamebunny": "Hey there, \nDid you manage to get WYSIHTML5 to work inside a modal?\n. I managed to get it to work\nDont need to change the order of the script files\n\nDefault.html\nbutton with id modal_ajax_demo_btn\ndiv with id ajax-modal\nscript src=\"http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js\"\nscript src=\"../Scripts/lib/bootstrap.min.js\"\nscript src=\"../Scripts/lib/bootstrap-modalmanager.js\"\nscript src=\"../Scripts/lib/bootstrap-modal.js\"\nscript src=\"../Scripts/lib/wysihtml5-0.3.0.js\"\nscript src=\"../Scripts/lib/bootstrap-wysihtml5.js\"\nscript src=\"../Scripts/lib/ui-modals-compose.js\"\nscript UIModals.init();\n\n\nui-modals-compose.js\nvar UIModals = function () {\n\n    var initModals = function () {\n\n        $.fn.modalmanager.defaults.resize = true;\n    $.fn.modalmanager.defaults.spinner = '  Loading...';\n    var $modal = $('#ajax-modal');\n\n    $('#modal_ajax_demo_btn').on('click', function(){\n    // create the backdrop and wait for next modal to be triggered\n         $('body').modalmanager('loading');      \n         setTimeout(function(){\n              $modal.load('inbox_compose.html', '', function () {\n               $modal.modal();\n                       // call Wysihtml5 here\n               initWysihtml5();      \n          });\n             }, 1000);\n    }); \n    }\n    var initWysihtml5 = function () {\n        $('.inbox-wysihtml5').wysihtml5({\n            \"stylesheets\": [\"../Content/css/wysiwyg-color.css\"]\n        });\n    }\n    return {\n        //main function to initiate the module\n        init: function () {\n            initModals();      \n        }\n    };\n}();\n\nhope it helps\n. ",
    "maximebeaudoin": ":+1: I have the same issue. I'll try to figure out what is the problem\n. ",
    "spin0us": "Not working for me too.\n. ",
    "ghost": "wysiwyg editor does not works in bootstrap modal because it triggers before creating modal.. or something. so the best way to do it is triggering the modal before wysiwyg editor. so the code should be\ncant post the js via comment. its runing the code. so i am sharing the link i found this trick.\nhope it helps\nhttp://ask.oykko.com/question/13\n. check this code above. \nYou need to put your textarea via js. then active it.\nso its safe to say you have to put the modal body via js then active all of it\n. Here is a example of how to use wysihtml5 editor in bootstraps modal.. hope it helps...\nhttp://oykko.blogspot.com/2013/07/use-wysiwyg-editor-in-bootstrap-modal.html\n. Had the same issue as well. Also, helps to update the 'btn' class to have 'btn btn-default' so it actually pops.\nUpdated: Line 8 for Dropdown, Then a find a replace for <a class='btn\" to <a class='btn btn-default\".\n. ",
    "nithinstany": "Even not working for me . I am using Jquery dialog . I am getting editor in Dialog(popup), but i can't enter text in text area \n. Here is my Ajax code. Still i can't enter data in textarea. Please correct the code if i am wrong\n$(\"#divid\").dialog({  width: 500, title: \"New Instruction\", modal: true, resizable: false });\n$(\"#divid\").html(\"<%= escape_javascript(render :partial => 'form')%>\")\n$('.html-editor').wysihtml5({\"font-styles\": true, \"emphasis\": true,\"lists\": true, \"html\": false, \"link\": true, \"image\": true, \n\"color});\n. ",
    "studentIvan": "\n2 months ago\ni'm waiting\n. RC2 outcome now\n. красава братан!\n. \n",
    "ndogaru": "We got bootstrap-wysihtml5 to work with bootstrap 2.3.1 modal.The key is to make sure that the editor is set up on the show event of the modal not on document ready.\n. ",
    "ammarjabakji": "You can also use this :\n$('#modal').on('shown.bs.modal', function () {\n   $('#textarea-id').wysihtml5();\n}\n. ",
    "AGASS007": "Yay for the translations!\n. ",
    "fletchowns": "I was also running into this error. I'm using django-pipeline to minify & combine all my static resources. The problem seemed to be that bootstrap-wysihtml5 was using window.wysihtml5 and when stepping through the pipelined assets, window.wysihtml5 was undefined, but wysihtml5 was not.\nI ended up fixing it by setting PIPELINE_DISABLE_WRAPPER = True so pipeline does not wrap output in an anonymous function.\n. ",
    "ChorHizzle": "I am currently using another framework, meteor.js, so I ended up replacing window.wysihtml5 with wysihtml5 in the final line of the code in dist/bootstrap-wysihtml5-0.0.2.js after making wysihtml5 global by removing var in the first line of lib/js/wysihtml5-0.3.0.js\n. ",
    "fabicurti": "THAAAAAAAAAAAAAAAAAAAAAAAAAAAANK YOU!\nI was going crazy trying to find a way to do this!\n. Found a PERFECT way to do the job.. here´s the code :)\nI know the question is old, but maybe help somebody looking for this..\nTo make the JQuery Validation work with WysiHtml5, just set the plugin to not ignore hidden textareas:\n$('#form').validate({\n   ignore: \":hidden:not(textarea)\",\n   rules: {\n       WysiHtmlField: \"required\"\n   },\n   submitHandler: function(form) { ... }\n});\n. ",
    "kargaa": "Only @KernelFolla 's solution worked for me, I also use, bootstrapwizard steps.\n@KernelFolla now it shows 2 text areas vertically, I tried to fix it by margin-top:-150 but in one they can't stick togetler, other steps are fine, I getting crazy one stupid validation took my all night :)\nIs there any way to hide iframe ara below textarea?\nignore: \":hidden:not(textarea)\",\ndoesnt even work in any case with \"\" or else , wizard blows up.\n. Ok last solution thanks to @KernelFolla , I added visibility attiribute to hide, div so it works now.\n.nicehide {\n    resize: none;\n    display: block !important;\n    width: 0;\n    height: 0;\n    margin: -200px 0 0 0;\n    float: left;\n    visibility:hidden;\n}\n. ",
    "dubwise": "@KernelFolla & @kargaa\nYou sir are a legend, thanks, was doing my head in trying to figure this out.\n[edit]\nDoes not work when used with responsive template.\n. ",
    "KernelFolla": "for me it works with responsive template but i've done a variant for multiple textarea\njavascript\n    jQuery(obj).wysihtml5({\n       ...\n    }).filter('[required]').addClass('nicehide');\n. ",
    "jorgelbg": "This works almost fine, if you hit the submit button before writing anything in the wysihtml5 editor, it popups the required message, but then even if you fill the wysihtml5 editor with text the message doesn't go away until you submit (again) the form. Any workaround?\n. ",
    "BonceSkip": "thanks you! saved my life...\n. ",
    "efkan": "Thank you @KernelFolla ! You've made my day! :smiley: \nI wanna contribute a little bit to your solution.\nThis is my styles;\n.nicehide {\n    display: block !important;\n    position: absolute; /*Keep the object's original position*/\n    width: 0 !important; /*It should be 0 width. Otherwise the object seems underneath of the editor */\n    z-index: -1; /*Send the object to the bottom layer*/\n}\n. ",
    "BIackSouL": "@KernelFolla where shloud i put the class .nicehide and the jquery function help me please\n. ",
    "Assem": "Thank you @efkan , your css was the one that worked for me :) and thks @KernelFolla for the idea ;). ",
    "cantorrodista": "Done!! :)\n. ",
    "hoopyfrood": "Sorry, this does not solve the issue with icons using Glyphicons not showing :(\n. ",
    "jspiro": "It seems that the image button doesn't work and throws up the gray modal background but no modal image box, and you cannot dismiss it with escape.\n. Modals no longer require hide; they do require modal-dialog and modal-content and modal-title.\nEscape doesn't seem to be dismissing the dialog anymore, and the url inputs don't receive focus.\n```\n            \"link\":\n                \"\" +\n                  \"\" +\n                    \"\" +\n                      \"\" +\n                        \"\" +\n                          \"×\" +\n                          \"\" + locale.link.insert + \"\" +\n                        \"\" +\n                        \"\" +\n                          \"\" +\n                        \"\" +\n                        \"\" +\n                          \"\" + locale.link.cancel + \"\" +\n                          \"\" + locale.link.insert + \"\" +\n                        \"\" +\n                      \"\" +\n                    \"\" +\n                  \"\" +\n                  \"\" +\n                \"\",\n        \"image\":\n            \"<li>\" +\n              \"<div class='bootstrap-wysihtml5-insert-image-modal modal fade'>\" +\n                \"<div class='modal-dialog'>\" +\n                  \"<div class='modal-content'>\" +\n                    \"<div class='modal-header'>\" +\n                      \"<button type='button' class='close' data-dismiss='modal' aria-hidden='true'>&times;</button>\" +\n                      \"<h3 class='modal-title'>\" + locale.image.insert + \"</h3>\" +\n                    \"</div>\" +\n                    \"<div class='modal-body'>\" +\n                      \"<input value='http://' class='bootstrap-wysihtml5-insert-image-url form-control'>\" +\n                    \"</div>\" +\n                    \"<div class='modal-footer'>\" +\n                      \"<a href='#' class='btn btn-default' data-dismiss='modal'>\" + locale.image.cancel + \"</a>\" +\n                      \"<a href='#' class='btn btn-primary' data-dismiss='modal'>\" + locale.image.insert + \"</a>\" +\n                    \"</div>\" +\n                  \"</div>\" +\n                \"</div>\" +\n              \"</div>\" +\n              \"<a class='btn btn-default' data-wysihtml5-command='insertImage' title='\" + locale.image.insert + \"'><i class='glyphicon glyphicon-picture icon-picture'></i></a>\" +\n            \"</li>\",\n\n```\n. See https://github.com/jhollingworth/bootstrap-wysihtml5/pull/279\n. I've updated to bootstrap 3. Have fun!\n. Because I made a mistake? :)\nThis PR isn't meant to be merged as-is; it's for people and me to use until real support is implemented.\n. ",
    "ben-gibson": "Nice work, looks good!\n. ",
    "dawid-drelichowski": "Hi,\nWith pleasure I will fork your repo and add my changes. Please give me few\nhours/days. I am too busy now\nGreetings,\nDawid\n2013/11/22 Christian Sterzl notifications@github.com\n\nI don't know if this repo is still maintained. But I would be glad to\naccept your pull request in my fork:\nhttps://github.com/Waxolunist/bootstrap3-wysihtml5-bower\n—\nReply to this email directly or view it on GitHubhttps://github.com/jhollingworth/bootstrap-wysihtml5/pull/282#issuecomment-29060753\n.\n. \n",
    "kazpsp": "Quick fix, create the list first, then bold the first line, but yes, this is a bug\n. ",
    "JD-Robbs": "I second this (using it with KnockOut JS). The issue only happens if there are HTML-tags in the value (thereby affecting the cursor position).\n. ",
    "alisson04": "Did you find the solution?. ",
    "Jorgelig": "do you fixed?\n. ",
    "Manc": "Thanks @fabaopaiva!\n. ",
    "rogergithubbing": "I fixed that ! the error mentioned that $.fn.wysihtml5.locale was undefined, so I went to bootstrap-wysihtml5.js and saw that that was no mention to locale there.\nWhat happened was that I've followed the link to download 'The latest version' from the page https://github.com/jhollingworth/bootstrap-wysihtml5/, section 'quick start'... The latest version referenced here does not seem to be the latest bootstrap-wysihtml5-0.0.2.zip, updated a year ago.\nOnce I've downloaded the version from that 'Download ZIP' button instead it worked. \nThe only thing left to do was to add header 4-6 to the translation file in spanish, as on the editor's toolbar were appearing three 'undefined' items. I hope it helps others.\n. ",
    "izidormatusov": "@Waxolunist feel free to apply the patch in your fork :)\n. ",
    "amsross": "I'm in favor of this as a pull request. Maybe just a fork, though?\n. ",
    "seinoxygen": "1+\n. ",
    "rudi911": "would like to see this too\n. ",
    "supertedde": "+1\n. ",
    "dbaumann": "+1\n. ",
    "afarazit": "+1\n. ",
    "emmanuelballery": "+1\n. Thanks a lot for this by the way :+1: \n. ",
    "vwasteels": "+1\n. ",
    "flauwekeul": "I saw someone else changed this (much) earlier...\n. ",
    "aueda": "Sorry, I missed your comment.\nYes, I'm not sure but I think it's dead now. I pulled my request to your fork.\n. ",
    "christianromeni": "+1\n. ",
    "varsadadj": "$(\"#editor\").on('paste',function(e){\n            e.preventDefault();\n            var text = (e.originalEvent || e).clipboardData.getData('text/plain') || prompt('Paste something..');\n            document.execCommand('insertText', false, text);\n    });\n. ",
    "SixSatori": "Oh yeah u should, i checked the translation and its all correct.\n. ",
    "Somiks": "i found solution.\n. ",
    "pkshetlie": "you need to import the locale file, for example : \n<script src=\"<path tobootstrap-wysihtml5>/locales/bootstrap-wysihtml5.fr-FR.js\"></script>\nI know the post is from 2013, but it must be help-full for anyone\n. ",
    "droubi": "388 AS @pkshetlie suggested import the locale file and make sure to use the correct locale key in your initializing code\nThe key should be the same as the one defined inside the locale file:\n<script src=\"<path tobootstrap-wysihtml5>/locales/bootstrap-wysihtml5.ar-AR.js\"></script>\n$('#wysihtml5').wysihtml5({ locale: \"ar-AR\"});. ",
    "Page-Carbajal": "Corrupt file. Downloaded it again and worked. \n. ",
    "pavankumar542": "http://xing.github.io/wysihtml5/ while iam trying to implement it in aspx page and opening the design part is showing error that design canoot be opened\nexample of errors are\nError   45  Validation (XHTML 1.0 Transitional): Attribute 'data-wysihtml5-dialog-action' is not a valid attribute of element 'a'.  D:\\pavanWork\\html editor\\xing-wysihtml5-0.3.0-0-g9c73556\\xing-wysihtml5-fb0cfe4\\website\\Editor.aspx 60  63  D:...\\website\\\n. ",
    "benoitbssr": "Even for Bootstrap 3.1 !\n. ",
    "mrmaninew": "I am not able to insert data into textarea using in ajax calls jquery ,\n$(document).ready(function(){\n$.ajax({\n                    url: \"/wikipost\",\n                    type: \"POST\",\n                    data: JSON.stringify(data),\n                    contentType: 'application/json',\n                    datatype: \"json\",\n                    success: function (datas) {\n                        console.log('success');\n                        var res = JSON.stringify(datas);\n                        console.log(res);\n                        $.each(datas, function (index, element) {\n                            $('#textarea').val(element.extract) \n                        });\n});\nI also used .val(), .html(), .append() neither  of these worked \nplease help me out, am I missing something ? ...........\n. ",
    "siberianluck": "I have the same issue - though I have a  guess at what the problem might be.  I'm using bootstrap 3, which uses different classes for the glyphicons.  \nI'm not sure what the best approach is to fix this, so I'd be curious to see if anyone else has resolved it.\n. Ah, I just read issue #325 - I suggest you do as well.\n. ",
    "cheiff": "Sorry, was untested. I forgot to add a comma!\n. how do I do that? If I try to fork it from your repo it takes me back to the original.\nThanks\n. Done.\nRegards\nChristian Sterzl notifications@github.com wrote:\n\nYoucanofcourseforkmyrepolikeanyotherrepo.Cloneit,createabranch,copyyourfilesoverandmakeapullrequest.ReplytothisemaildirectlyorviewitonGitHub.\n. \n",
    "sdekock": "Posted this as wysihtml5 issue instead:\nhttps://github.com/xing/wysihtml5/issues/479\n. ",
    "lotrietb": "hi, i don't know when this was posted, but i'm having the same problem. Is there a workround?\n. ",
    "InstanceOfMichael": "I just ctrl-f + replaced icon- with glyphicon glyphicon- in bootstrap-wysihtml5-0.0.2/bootstrap-wysihtml5-0.0.2.min.js\n. ",
    "impcyber": "@ghost\nWhat about btn class, you may just add: size: 'default' in initialization options:\njavascript\n$('#wiki-content').wysihtml5({\n        size: 'default'\n});\n. ",
    "JamesGreenAU": "Hi Christian my project isn't using Handlebars so I will keep using my patch to this version, but thanks for letting me know about your repo.\n. ",
    "cpereira-AA": "I close it. It's a duplicate actually.\n. ",
    "meenxo": "@Waxolunist Unfortunately, we are still running on Bootstrap 2 and in the process of transitioning to Bootstrap 3 but not quite ready yet. I would like to fork hollingworth's repo and fix this issue for now. Can you point me to the fix to this issue? I would greatly appreciated. \n. ",
    "pdcmoreira": "Err. I'm confused here. For me to create a pull request, I need to fork the 'Waxolunist/bootstrap3-wysihtml5-bower' repo, right? But if I try to do so, it will fork its original repo! How can I do it then?\n. ",
    "chrifmarwen": "I have the same problem\n$(\".selector\").editable(\"setHTML\", \"\", false);\ndoes not work for me.\n. ",
    "benomatis": "http://edicy.github.io/wysihtml5/ seems to be dead too... (404). ",
    "germanio": "Hey @serser please take a look at this issue #322 \nIt may help you with the error you get.. ",
    "JeremyCade": "Hi @caBBAlainB, \nWhat is your use case? Most modern browsers include this feature (spell checking on input fields and text-areas) by default. \n\nFigure: Firefox 38.0.5 Spell Check in WYSIYG field.\n. ",
    "caBBAlainB": "well, maybe you are right...\n. ",
    "ryanwanger": "I think that works as expected. If you just click the insert link button, and then type a url into, it will put the url into the text area, and hyperlink it.\nIf you type some other text into the text area first, highlight it, then click insert link, it will link the text you highlighted to whatever url you put into the insert link dialog.\n. ",
    "BondWong": "recent version does not have this issue. it is a bug of much order version. \n. ",
    "hugoalexmartins": "I just see, if I place these on events array, it works, but toolbar don't show up...\nfocus: function () {\n          $(this).trigger( \"click\" ));\n           console.debug($(this));\n        }\n\n. ",
    "wencs": "tengo el mismo problema pero no veo actualizacion de la libreria. ",
    "lsarni": "I created an issue #390 but when we updated to the latest version and this was fixed.\nWe use this gem bootstrap-wysihtml5-rails and upgraded from 0.3.1.23 to 0.3.3.8.\n. ",
    "michalmarek-sk": "Hi guys, I patched it by inserting empty object instead of boolean value. \nself.editor.currentView.element.focus({});. ",
    "MasterAlchemist": "@michalmarek-sk Thank you very much! It solved my problem! :). ",
    "smartrahat": "I've solved it by editing the .js file.\nI've replaced all font-awesome 4 classes with font-awesome 5 class.\nExample:  fa fa-share-square-o with far fa-share-square. ",
    "sergeyklay": ":+1: \n. "
}