{
    "jp9000": "CS_OWNDC shouldn't have anything to do with the hotkey control.  I've tested the hotkey controls and they seem fine as far as I can tell.  I used CS_OWNDC because I didn't want the text to draw onto the main window when it gets too long, but I now realize that I'm using the wrong text drawing function anyway, so I might adjust it\n. I don't know muf, I just download audacity and its volume meters are indeed quite good.  It seems to get the best of both.  As long as the code executes fast I have no problems with it personally.\nThat being said, I think most of these things are fairly subjective.\nAlso you have to acknowledge how awesome it is that someone came along and added this in.  Minor subjective details aside, this guy deserves a medal.  Especially after having to browse through my rather uncommented code :)\n. Keep your newer code handy, I'm going to put back in your older code so I can put in the newer audio code, as merging may be a bit painful at the moment, and I need to get this update out soon - also in this code I'm about to upload I had slightly modified your previous code to act more responsive, was just playing around with it at the time.\nI'm not too experienced with git, so forgive me in advance\n. Ah wait, I could have merged this..  okay, going to try to get everything back in order with your new code\n. And there we go, fixed it back to the new meter code..  sorry about that.  Wow I think I'm going to get smartgit as r1ch suggested to me after that.\n. Hey, by the way, I had to revert the main volume control code temporarily because people were totally confused by the new set up - sorry about that..  for example, if you set it to like 80%, the output levels would actually be somewhere around 30%, and people were getting really confused and thought it was a bug, so I just reverted it temporarily\n. Feel free to contribute to the project, I added you as a contributer, so if you wish to push changes feel free.  I'm still dabbling with the audio code though.  Audio timestamping issues have been a nightmare.  I'm still working to get the kinks out of the system unfortunately.\nMost of the time using the timestamp from IAudioCaptureClient::GetBuffer is fine, but on some mics/sound cards, time stamp information can basically end up being inaccurate or flat out invalid.  They're supposed to use QPC time in 100ns time, but they unfortunately don't always seem to use it, or sometimes don't care about time at all.  I am still trying to work out some solutions.  Fairly nightmarish situation.\n. I applied some of your patch internally and will be uploading it soon\n. Sounds good to me, citations and everything.  Sounded good when you showed it to me as well\n. Well this actually calls attention a design issue I think, if you add it for this source, then why not all, for example?  So I'm not entirely sure what to think..  it feels like a bandaid to my poorer design decisions.  I wouldn't mind necessarily doing it, but I need to think about it for a short while to see if there's a better way.  I'll probably end up adding it if I can't think of a better way\n. I'm sorry, I just haven't been able to really focus on things at the moment.  I don't really know how to deal with this issue yet.\nThe best idea I have at the moment is having a menu with common resolutions that can easily be selected and changed through.  I don't really know how to \"perfectly\" deal with it but unfortunately this sort of fix doesn't feel right.  Perhaps I'm being too picky, I don't quite know.  Though I can understand the frustration of having to deal with this situation it feels like there has to be a better way about solving this.\n. Oh okay, I see the problem then..  hmm, good point.  I'll add it then.\n. lol\n. Just so you know, if you use the original english translation for something, there's no real need to add it because it'll automatically default to the english translation anyway\n. I'm going to close this for the reason stated above - hope you don't mind.  If you wish I'll add it to the file manually later though, just message me on IRC\n. Ah, woops, unfortunately merged right after I just made a new release..  This will definitely be in all upcoming releases then.\n. thank you kindly!  manually merged in commit 490c79a4044329cc7fd3f17c30d0288df9b20fcf\n. Wow, how on earth did that happen..  Thank you for pointing that out\n. Hmm, looks good, thank you very much.  Also feel free to come and chat any time on the obsproject channel.\n. Thank you very much\n. I apologize if something was lost in translation to other languages.  It was originally meant as a joke.  If someone is changing the language away from the current language, then it's a joke that just says \"but I suppose you can't read this anyway\", a joke which they probably can't read, which is also a part of the joke.  I think arkkis is usually the one who does the finnish translations and keeps them up to date.\nI'll take it out because I'm not entirely sure it was translated with the same meaning.\n. Hold on, before I merge this code, I want you to make sure that it's not getting called every time the user drags the frame.  I don't want the swap chain to be recreated every time a user drags the edges of the window to resize\n. actually, looks okay, I'll check it after\n. duplicate pull request\n. blinks  ..What the..  I think I can easily say on behalf of everyone that you are godlike for taking the time to implement quicksync.  Just going to do a few tests and then merge it.  I give you my absolute most humble thanks\n. Email me some time if you wish to talk further more in depth, and I'm always around on IRC.  would love to talk to you about this some time.\nBy the way I didn't check the code too thoroughly, need to go over it some more and do some more testing, but it seems you're returning the encoded frame the same encoder call, which causes an unnecessary stall to the capture thread (I think).  If you do say a 20-frame delay with threading or something you could make the call asynchronous and give the encoder all the time it needs to encode the frame.  The encode function is designed to be asynchronous like that.\n. Well it stalls the main thread at the moment, as I mentioned above, I don't think it's operating asynchronously\n. I've fixed up some of the issues of async, though the frames have issues due to the fact that they're being overwritten constantly.  I will try copying the frames before sending to the encoder so the data doesn't get changed\n. Thanks again!\n. oh woops, I missed those.  thank you very much\n. thank you very much for your time\n. shousa!  it's good to see you.  hope all is well.  thank you for the translations again\n. Hey shousa - you actually can already use slower and any other preset by doing:  preset=slower as a custom x264 command; the reason why I did not include it and lower ones in the combo box is because users who didn't quite know what they were doing would select the slower presets.  I suppose the point is moot if the other slower presets are included, but they're more meant for lower resolutions.  I didn't really see any benefit added from slower even at lower resolutions, and I figured if someone really needed the preset, they could just type the preset manually as an x264 command.\nI know my reasoning probably isn't the best, but what do you think?\n. Oh, limited by bitrate?  Well I suppose you make a valid argument.  Okay, I'll include it.\n(Also you guys really need a better streaming service if you're restricted -that- much)\n. It also looks like you changed from CRLF to LF (which is fine, but messes up the commit a bit).\nIf you do this through crowdin, should this pull request be closed?\nI can't seem to merge it anyway due to conflicts.\n. should this be closed?\n. twitches\n. kills Gol-D-Ace\n. SACRELIGE\n. thanks, done, will be in next update\n. Thank you kindly\n. I don't mind, but two things before accepting:\n1.) Your virtual function placement breaks the API.  All new functions added to the class must go at the bottom of the class definition, otherwise it breaks all current plugins.\n2.) OBS1 doesn't use tabs.\n. Shousa - could you update that code and post again when it's good to go?\n. Woops, sorry for the delayed response, I'll check this out and verify this later today.\nI had actually turned off notifications because github is very verbose in how it sends out emails\n. reviewing\n. For example, I have one entry in my own from the directshow plugin that causes the entire thing to break:\ndevice : \\?\\usb#vid_041d&pid_082d&mi_10#7&14543079&0&0010#{65e8373d-8f56-11d0-a3b9-00a0c9221196}{bbefb6c7-2dc4-4139-bb8b-a58fba724083}\nThis is actually a valid entry.  Anyway, I already actually made the XConfig file parse json because we needed it for the auto-updater, so I'm sort of confused about what sort of json files you had been having troubles with.\nIn OBS2 we're just using the library jansson for parsing all config files rather than a custom parser.  My custom parser was meant to be a bit more like HJSON rather than JSON, but it should parse regular JSON just fine as well.\n. Could you give me an example json file that breaks the parser?\n. It's not valid JSON - as I said the parser is supposed to be able to parse both the HJSON-esque format I use for OBS files (which I'm ending up regretting having used originally) and JSON.  I'll check out your string\n. https://github.com/jp9000/OBS/commit/9de723ceb6a4157d0f19bbb427b87218e36eb17b\nDon't kill me, but I just ended up doing this myself because I felt like trying to distinguish the formats was more work than necessary in this case.  Let me know if I missed anything.\nThe reason why it worked with the JSON we were using was because the JSON we use for the auto updater had newlines, where as your string was all on one line, and I simply had forgot to account for that.\nI'm really sorry about you going to all that work\n. So with those defines in place to enable/disable it, does that mean it's safe for me to pull either way?  Just checking.\nSorry I didn't get to it right away.\n. sorry that this went under my rader. I will check it out.\n. Hey, wow I took a really long time to get around to answering this particular PR -- we don't actually really need it because the repo will eventually technically become deprecated.  We're trying to focus on the new version at https://github.com/jp9000/obs-studio\n. Oh thank you, I had been meaning to do this\n. You can edit your branch commits by using the interactive rebase to edit, squash, or reorder commits.  If you need to make a change to an earlier commit, you can use the interactive rebase and use 'edit' to edit the contents of that commit and/or its message.  When complete, force push your new fixes, and it will update the pull request and your commits on it.\nIf you made a change that you want to merge in to an earlier commit, interactive rebase can also do that with the 'fixup' command.  When doing the interactive rebase, place the offending commit that you wish to squash below the commit that you wish to squash it in to, and label it as 'fixup'.\nAlso, if you are not experienced with this and need help, let us know on the dev chat.  It's perfectly okay to not be experienced with git, just let us know and we'll help best we can.  #obs-dev on quakenet is the IRC channel if you need help with it.\n. We took a look over it and it's nice.  However, there is one minor thing -- in general settings and on the menu, it's just called 'scenes'.  We felt that was confusing because 'scenes' already occupies a name for a UI object, which is the main scenes list box.  Perhaps 'scene layout' would be better?  Not sure what to call it.\n. Is video even being used in this case?  If it's not, maybe it would be better to add an option to disable the video stream\n. https://github.com/jp9000/OBS/commit/bb8418deae449d943c1a56f71f6aa1696925af43 -- 3 commits in your pull request here are superfluous, so I just added it myself because I'm about to make a new update.\nIf you mess up a pull request, you can always fix it before it's merged by rebasing to alter history and then forcing updates to the branch.\n. Hm, interesting.  Thanks for pointing it out.\n. Okay, will take a look when I get a chance.\n. Appears to be a conflict by the way.  When you guys feels it's ready you'll have to rebase with master and resolve it.\n. I really should have read the original post.  I was originally assuming that you could import global sources from any other scene collection or scene collection file.  I don't like forcing the user to have some \"main\" scene collection, and I don't like that it makes it so that you can only import that way.\nIf there's some programming limitation that makes it a lot of work to do otherwise, then that's still better to deal with than forcing the problem on the user.\n. I've been in similar situations myself where I try a change and the design doesn't really work out -- it doesn't mean you didn't work hard on it.  I've done similar things in the past, and people have ended up yelling at me for them.  That's why it's always necessary to get more opinions, get more review.\nOn my own repos, I've actually stopped making big changes without having them reviewed.  You'll notice that almost all of my own big changes in the obs-studio repo recently have been pull requests.  People will discuss the changes and go over what they like and dislike.  It's actually a healthy environment.\nStill thinking about these changes though.  There doesn't seem to be any really 'ideal' solution in this case.  The whole scenes/sources ideology is probably what causes these sort of problems more than anything.\n. I AM PLEASED.  You don't have to worry about what I think. it's what the users will think.  You just have to remember that there are some users out there that have difficulty figuring out how to even turn on their own computer, so things always have to make sense and not have unusual or implicit functionality.\nI made the mistake of implicit functionality with OBS1 too many times, so I'm simply sharing from experience there.\n. If the pull request is only partially working or has bugs then I'm somewhat hesitant to merge it.\n. The parsing stuff as I said doesn't need to be included, but it really can't have major bugs like that.  I'm sure there are ways of dealing with that situation aren't there?  In OBS1 if a source is no longer in use it's simply destroyed.  It should be possible to communicate with the thread to get it to shut down.\n. Wait wait!  We can help you fix it or something if you want.  I don't want you to just close it.  It's good stuff\n. Or are you just closing it to try to fix it?  I don't want you to toss out the code or anything.\n. I have a backup of your code.  I will fix the thread issue and post it on a branch, and I am going to merge it unless there are any objections.  Most likely the more ideal way to handle it would be by doing the HTTP stuff in tick instead of using a thread.\n. I did a checkout of it.  As it currently is, I feel like it should be renamed to \"export scene\" perhaps.\nIf you want to export to another scene collection, it'd probably be better to have a sub-menu that lists the scenes to export it to.  For example, you click on \"Copy To\" and it would pop up a sub-menu from there with the list of the other scene collections currently available.\n. Eep, no no, I'm terrible sorry, what I meant was that if it exports to a file, it should be labelled export.  If it copies to another scene collection, then 'copy to' feels more correct.  Sorry about the confusion.\n. Okay, looks good.\nFew more things:\n1.) You should make it so it excludes the current scene collection.\n2.) It also seems to copy over the references to global sources even if global sources don't exist in the target scene collection.\n. Seems to work alright for me.  Thanks for listening to all of our feedback.\n. I know it's been a while -- but new and duplicate function identically.  New should bring up a clean unmodified profile.  Would be nice to have.\nI'm sorry I haven't had much time to get around to OBS1 pull requests.\n. Merged here with modifications, (kept the buttons in the general dialog pane, a little redundancy doesn't hurt):  https://github.com/jp9000/OBS/commit/ffe212bdee2efd2e2b3e8ec582e4221f776f43b6\n. Sorry for the delay.  Been more caught up in OBS2 stuff than OBS1 stuff.  New virtual functions must be inserted at the end of the class, not in the middle of the class among other functions, lest it break ABI.\n. Modified and manually merged:  https://github.com/jp9000/OBS/commit/658800ee2ea760f3d232d0f4405d75d1d4c4af18\n. Merged, with a slight modification:  https://github.com/jp9000/OBS/commit/1a9d90c8452848fa4c0de39418c7f2959484e835\n. Terribly sorry about the confusion, but due to the way we have our translation handling set up, you need to use crowdin for translation additions/changes/discussion, the page is here:  https://crowdin.com/project/obsproject\n. Thank you, though readme isn't necessary for this project at the moment, this particular repo is kind of going to be deprecated soon, in favor of the newer version (as soon as I finish the rest of the features and get it back to parity).  If a readme is created, it'll probably end up pointing people toward the newer version of the project.\n(I also sort of prefer text-only as well, markup is nice for browsers but it's not very nice if you aren't viewing it with a regular old text editor.  I admit I might be somewhat old-fashioned.)\n. Yep, this needs to be added via crowdin.  Thank you for pointing it out.\n. Thank you very much for fixing this issue.  It works great.\n. Merged here:  https://github.com/jp9000/OBS/commit/6ed7721c7d4c43ef2a7409bf3c2f49e0ca1806da\n1.) got rid of whitespace and changed the commit formatting.\n2.) Squished those last two commits together.\n3.) Also fixed up a case where buffering might not have been turned on automatically\n. I think you're looking for the VCE thread here:  https://obsproject.com/forum/threads/obs-branch-with-amd-vce-support.13996/\nWhat you did here was made a pull request for the main project, which appears to be not what you were aiming to do.\n. If you really want this functionality for whatever reason I'd recommend using the multiplatform version which has no limits.\nNot that anyone can really live encode at 144 frames per second.\n. We're not really working on the project anymore (we're working on https://github.com/jp9000/obs-studio ), although I suppose I don't mind because it's a small bugfix, and your solution works\n. We're not really accepting this sort of stuff at this point in time.  There are very good reasons why the project isn't being actively developed, as you've seen.  We're accepting only bug fixes and minor tweaks at this point.  Feel free to run the static analysis and fix the bugs you encounter with them, I'm willing to merge them if you do that, but at this point those of us who are doing active development are on the new version of the project.\nSo if you have time, fix the static analysis bugs, submit, and if they're okay I'll merge.  I'm not personally going to go through all the static analysis results myself though at this point in time though.\n. Finally got this confirmed.\n. yea, going to revert and hotfix\n. CS_OWNDC shouldn't have anything to do with the hotkey control.  I've tested the hotkey controls and they seem fine as far as I can tell.  I used CS_OWNDC because I didn't want the text to draw onto the main window when it gets too long, but I now realize that I'm using the wrong text drawing function anyway, so I might adjust it\n. I don't know muf, I just download audacity and its volume meters are indeed quite good.  It seems to get the best of both.  As long as the code executes fast I have no problems with it personally.\nThat being said, I think most of these things are fairly subjective.\nAlso you have to acknowledge how awesome it is that someone came along and added this in.  Minor subjective details aside, this guy deserves a medal.  Especially after having to browse through my rather uncommented code :)\n. Keep your newer code handy, I'm going to put back in your older code so I can put in the newer audio code, as merging may be a bit painful at the moment, and I need to get this update out soon - also in this code I'm about to upload I had slightly modified your previous code to act more responsive, was just playing around with it at the time.\nI'm not too experienced with git, so forgive me in advance\n. Ah wait, I could have merged this..  okay, going to try to get everything back in order with your new code\n. And there we go, fixed it back to the new meter code..  sorry about that.  Wow I think I'm going to get smartgit as r1ch suggested to me after that.\n. Hey, by the way, I had to revert the main volume control code temporarily because people were totally confused by the new set up - sorry about that..  for example, if you set it to like 80%, the output levels would actually be somewhere around 30%, and people were getting really confused and thought it was a bug, so I just reverted it temporarily\n. Feel free to contribute to the project, I added you as a contributer, so if you wish to push changes feel free.  I'm still dabbling with the audio code though.  Audio timestamping issues have been a nightmare.  I'm still working to get the kinks out of the system unfortunately.\nMost of the time using the timestamp from IAudioCaptureClient::GetBuffer is fine, but on some mics/sound cards, time stamp information can basically end up being inaccurate or flat out invalid.  They're supposed to use QPC time in 100ns time, but they unfortunately don't always seem to use it, or sometimes don't care about time at all.  I am still trying to work out some solutions.  Fairly nightmarish situation.\n. I applied some of your patch internally and will be uploading it soon\n. Sounds good to me, citations and everything.  Sounded good when you showed it to me as well\n. Well this actually calls attention a design issue I think, if you add it for this source, then why not all, for example?  So I'm not entirely sure what to think..  it feels like a bandaid to my poorer design decisions.  I wouldn't mind necessarily doing it, but I need to think about it for a short while to see if there's a better way.  I'll probably end up adding it if I can't think of a better way\n. I'm sorry, I just haven't been able to really focus on things at the moment.  I don't really know how to deal with this issue yet.\nThe best idea I have at the moment is having a menu with common resolutions that can easily be selected and changed through.  I don't really know how to \"perfectly\" deal with it but unfortunately this sort of fix doesn't feel right.  Perhaps I'm being too picky, I don't quite know.  Though I can understand the frustration of having to deal with this situation it feels like there has to be a better way about solving this.\n. Oh okay, I see the problem then..  hmm, good point.  I'll add it then.\n. lol\n. Just so you know, if you use the original english translation for something, there's no real need to add it because it'll automatically default to the english translation anyway\n. I'm going to close this for the reason stated above - hope you don't mind.  If you wish I'll add it to the file manually later though, just message me on IRC\n. Ah, woops, unfortunately merged right after I just made a new release..  This will definitely be in all upcoming releases then.\n. thank you kindly!  manually merged in commit 490c79a4044329cc7fd3f17c30d0288df9b20fcf\n. Wow, how on earth did that happen..  Thank you for pointing that out\n. Hmm, looks good, thank you very much.  Also feel free to come and chat any time on the obsproject channel.\n. Thank you very much\n. I apologize if something was lost in translation to other languages.  It was originally meant as a joke.  If someone is changing the language away from the current language, then it's a joke that just says \"but I suppose you can't read this anyway\", a joke which they probably can't read, which is also a part of the joke.  I think arkkis is usually the one who does the finnish translations and keeps them up to date.\nI'll take it out because I'm not entirely sure it was translated with the same meaning.\n. Hold on, before I merge this code, I want you to make sure that it's not getting called every time the user drags the frame.  I don't want the swap chain to be recreated every time a user drags the edges of the window to resize\n. actually, looks okay, I'll check it after\n. duplicate pull request\n. blinks  ..What the..  I think I can easily say on behalf of everyone that you are godlike for taking the time to implement quicksync.  Just going to do a few tests and then merge it.  I give you my absolute most humble thanks\n. Email me some time if you wish to talk further more in depth, and I'm always around on IRC.  would love to talk to you about this some time.\nBy the way I didn't check the code too thoroughly, need to go over it some more and do some more testing, but it seems you're returning the encoded frame the same encoder call, which causes an unnecessary stall to the capture thread (I think).  If you do say a 20-frame delay with threading or something you could make the call asynchronous and give the encoder all the time it needs to encode the frame.  The encode function is designed to be asynchronous like that.\n. Well it stalls the main thread at the moment, as I mentioned above, I don't think it's operating asynchronously\n. I've fixed up some of the issues of async, though the frames have issues due to the fact that they're being overwritten constantly.  I will try copying the frames before sending to the encoder so the data doesn't get changed\n. Thanks again!\n. oh woops, I missed those.  thank you very much\n. thank you very much for your time\n. shousa!  it's good to see you.  hope all is well.  thank you for the translations again\n. Hey shousa - you actually can already use slower and any other preset by doing:  preset=slower as a custom x264 command; the reason why I did not include it and lower ones in the combo box is because users who didn't quite know what they were doing would select the slower presets.  I suppose the point is moot if the other slower presets are included, but they're more meant for lower resolutions.  I didn't really see any benefit added from slower even at lower resolutions, and I figured if someone really needed the preset, they could just type the preset manually as an x264 command.\nI know my reasoning probably isn't the best, but what do you think?\n. Oh, limited by bitrate?  Well I suppose you make a valid argument.  Okay, I'll include it.\n(Also you guys really need a better streaming service if you're restricted -that- much)\n. It also looks like you changed from CRLF to LF (which is fine, but messes up the commit a bit).\nIf you do this through crowdin, should this pull request be closed?\nI can't seem to merge it anyway due to conflicts.\n. should this be closed?\n. twitches\n. kills Gol-D-Ace\n. SACRELIGE\n. thanks, done, will be in next update\n. Thank you kindly\n. I don't mind, but two things before accepting:\n1.) Your virtual function placement breaks the API.  All new functions added to the class must go at the bottom of the class definition, otherwise it breaks all current plugins.\n2.) OBS1 doesn't use tabs.\n. Shousa - could you update that code and post again when it's good to go?\n. Woops, sorry for the delayed response, I'll check this out and verify this later today.\nI had actually turned off notifications because github is very verbose in how it sends out emails\n. reviewing\n. For example, I have one entry in my own from the directshow plugin that causes the entire thing to break:\ndevice : \\?\\usb#vid_041d&pid_082d&mi_10#7&14543079&0&0010#{65e8373d-8f56-11d0-a3b9-00a0c9221196}{bbefb6c7-2dc4-4139-bb8b-a58fba724083}\nThis is actually a valid entry.  Anyway, I already actually made the XConfig file parse json because we needed it for the auto-updater, so I'm sort of confused about what sort of json files you had been having troubles with.\nIn OBS2 we're just using the library jansson for parsing all config files rather than a custom parser.  My custom parser was meant to be a bit more like HJSON rather than JSON, but it should parse regular JSON just fine as well.\n. Could you give me an example json file that breaks the parser?\n. It's not valid JSON - as I said the parser is supposed to be able to parse both the HJSON-esque format I use for OBS files (which I'm ending up regretting having used originally) and JSON.  I'll check out your string\n. https://github.com/jp9000/OBS/commit/9de723ceb6a4157d0f19bbb427b87218e36eb17b\nDon't kill me, but I just ended up doing this myself because I felt like trying to distinguish the formats was more work than necessary in this case.  Let me know if I missed anything.\nThe reason why it worked with the JSON we were using was because the JSON we use for the auto updater had newlines, where as your string was all on one line, and I simply had forgot to account for that.\nI'm really sorry about you going to all that work\n. So with those defines in place to enable/disable it, does that mean it's safe for me to pull either way?  Just checking.\nSorry I didn't get to it right away.\n. sorry that this went under my rader. I will check it out.\n. Hey, wow I took a really long time to get around to answering this particular PR -- we don't actually really need it because the repo will eventually technically become deprecated.  We're trying to focus on the new version at https://github.com/jp9000/obs-studio\n. Oh thank you, I had been meaning to do this\n. You can edit your branch commits by using the interactive rebase to edit, squash, or reorder commits.  If you need to make a change to an earlier commit, you can use the interactive rebase and use 'edit' to edit the contents of that commit and/or its message.  When complete, force push your new fixes, and it will update the pull request and your commits on it.\nIf you made a change that you want to merge in to an earlier commit, interactive rebase can also do that with the 'fixup' command.  When doing the interactive rebase, place the offending commit that you wish to squash below the commit that you wish to squash it in to, and label it as 'fixup'.\nAlso, if you are not experienced with this and need help, let us know on the dev chat.  It's perfectly okay to not be experienced with git, just let us know and we'll help best we can.  #obs-dev on quakenet is the IRC channel if you need help with it.\n. We took a look over it and it's nice.  However, there is one minor thing -- in general settings and on the menu, it's just called 'scenes'.  We felt that was confusing because 'scenes' already occupies a name for a UI object, which is the main scenes list box.  Perhaps 'scene layout' would be better?  Not sure what to call it.\n. Is video even being used in this case?  If it's not, maybe it would be better to add an option to disable the video stream\n. https://github.com/jp9000/OBS/commit/bb8418deae449d943c1a56f71f6aa1696925af43 -- 3 commits in your pull request here are superfluous, so I just added it myself because I'm about to make a new update.\nIf you mess up a pull request, you can always fix it before it's merged by rebasing to alter history and then forcing updates to the branch.\n. Hm, interesting.  Thanks for pointing it out.\n. Okay, will take a look when I get a chance.\n. Appears to be a conflict by the way.  When you guys feels it's ready you'll have to rebase with master and resolve it.\n. I really should have read the original post.  I was originally assuming that you could import global sources from any other scene collection or scene collection file.  I don't like forcing the user to have some \"main\" scene collection, and I don't like that it makes it so that you can only import that way.\nIf there's some programming limitation that makes it a lot of work to do otherwise, then that's still better to deal with than forcing the problem on the user.\n. I've been in similar situations myself where I try a change and the design doesn't really work out -- it doesn't mean you didn't work hard on it.  I've done similar things in the past, and people have ended up yelling at me for them.  That's why it's always necessary to get more opinions, get more review.\nOn my own repos, I've actually stopped making big changes without having them reviewed.  You'll notice that almost all of my own big changes in the obs-studio repo recently have been pull requests.  People will discuss the changes and go over what they like and dislike.  It's actually a healthy environment.\nStill thinking about these changes though.  There doesn't seem to be any really 'ideal' solution in this case.  The whole scenes/sources ideology is probably what causes these sort of problems more than anything.\n. I AM PLEASED.  You don't have to worry about what I think. it's what the users will think.  You just have to remember that there are some users out there that have difficulty figuring out how to even turn on their own computer, so things always have to make sense and not have unusual or implicit functionality.\nI made the mistake of implicit functionality with OBS1 too many times, so I'm simply sharing from experience there.\n. If the pull request is only partially working or has bugs then I'm somewhat hesitant to merge it.\n. The parsing stuff as I said doesn't need to be included, but it really can't have major bugs like that.  I'm sure there are ways of dealing with that situation aren't there?  In OBS1 if a source is no longer in use it's simply destroyed.  It should be possible to communicate with the thread to get it to shut down.\n. Wait wait!  We can help you fix it or something if you want.  I don't want you to just close it.  It's good stuff\n. Or are you just closing it to try to fix it?  I don't want you to toss out the code or anything.\n. I have a backup of your code.  I will fix the thread issue and post it on a branch, and I am going to merge it unless there are any objections.  Most likely the more ideal way to handle it would be by doing the HTTP stuff in tick instead of using a thread.\n. I did a checkout of it.  As it currently is, I feel like it should be renamed to \"export scene\" perhaps.\nIf you want to export to another scene collection, it'd probably be better to have a sub-menu that lists the scenes to export it to.  For example, you click on \"Copy To\" and it would pop up a sub-menu from there with the list of the other scene collections currently available.\n. Eep, no no, I'm terrible sorry, what I meant was that if it exports to a file, it should be labelled export.  If it copies to another scene collection, then 'copy to' feels more correct.  Sorry about the confusion.\n. Okay, looks good.\nFew more things:\n1.) You should make it so it excludes the current scene collection.\n2.) It also seems to copy over the references to global sources even if global sources don't exist in the target scene collection.\n. Seems to work alright for me.  Thanks for listening to all of our feedback.\n. I know it's been a while -- but new and duplicate function identically.  New should bring up a clean unmodified profile.  Would be nice to have.\nI'm sorry I haven't had much time to get around to OBS1 pull requests.\n. Merged here with modifications, (kept the buttons in the general dialog pane, a little redundancy doesn't hurt):  https://github.com/jp9000/OBS/commit/ffe212bdee2efd2e2b3e8ec582e4221f776f43b6\n. Sorry for the delay.  Been more caught up in OBS2 stuff than OBS1 stuff.  New virtual functions must be inserted at the end of the class, not in the middle of the class among other functions, lest it break ABI.\n. Modified and manually merged:  https://github.com/jp9000/OBS/commit/658800ee2ea760f3d232d0f4405d75d1d4c4af18\n. Merged, with a slight modification:  https://github.com/jp9000/OBS/commit/1a9d90c8452848fa4c0de39418c7f2959484e835\n. Terribly sorry about the confusion, but due to the way we have our translation handling set up, you need to use crowdin for translation additions/changes/discussion, the page is here:  https://crowdin.com/project/obsproject\n. Thank you, though readme isn't necessary for this project at the moment, this particular repo is kind of going to be deprecated soon, in favor of the newer version (as soon as I finish the rest of the features and get it back to parity).  If a readme is created, it'll probably end up pointing people toward the newer version of the project.\n(I also sort of prefer text-only as well, markup is nice for browsers but it's not very nice if you aren't viewing it with a regular old text editor.  I admit I might be somewhat old-fashioned.)\n. Yep, this needs to be added via crowdin.  Thank you for pointing it out.\n. Thank you very much for fixing this issue.  It works great.\n. Merged here:  https://github.com/jp9000/OBS/commit/6ed7721c7d4c43ef2a7409bf3c2f49e0ca1806da\n1.) got rid of whitespace and changed the commit formatting.\n2.) Squished those last two commits together.\n3.) Also fixed up a case where buffering might not have been turned on automatically\n. I think you're looking for the VCE thread here:  https://obsproject.com/forum/threads/obs-branch-with-amd-vce-support.13996/\nWhat you did here was made a pull request for the main project, which appears to be not what you were aiming to do.\n. If you really want this functionality for whatever reason I'd recommend using the multiplatform version which has no limits.\nNot that anyone can really live encode at 144 frames per second.\n. We're not really working on the project anymore (we're working on https://github.com/jp9000/obs-studio ), although I suppose I don't mind because it's a small bugfix, and your solution works\n. We're not really accepting this sort of stuff at this point in time.  There are very good reasons why the project isn't being actively developed, as you've seen.  We're accepting only bug fixes and minor tweaks at this point.  Feel free to run the static analysis and fix the bugs you encounter with them, I'm willing to merge them if you do that, but at this point those of us who are doing active development are on the new version of the project.\nSo if you have time, fix the static analysis bugs, submit, and if they're okay I'll merge.  I'm not personally going to go through all the static analysis results myself though at this point in time though.\n. Finally got this confirmed.\n. yea, going to revert and hotfix\n. ",
    "notr1ch": "This looks great! I was thinking of doing something similar myself when I had some time. One note, the OBS code makes use of spaces (not tabs) for indentation, it seems your code includes a number of tabs. If you make any further changes, we'd appreciate it if you could switch to spaces for indentation to keep things consistent with the coding style in OBS.\n. I just noticed your code in MultiplyAudioBuffer is only counting two samples of the audio, is this intended? The SSE2 code is scaling the majority of the samples which do not get added to the sum.\nAlso the smoothing (alpha) applied to the values seems to cause a delay of the meter updating in response to audio, which could make it difficult to isolate sources causing high volume.\n. I've been playing around with this for an hour or so, some more feedback:\nVOL_MAX is set to 6, but since a scale of 1.0 is 0dB, I don't see how the red segment is ever used since it's impossible to go higher than 0dB.\nThe display of the volume bar itself could also be logarithmic, eg the range -70 through -20 is pretty quiet, yet the bar jumps around quite a lot, making larger changes in volume across the -20 to 0dB range less apparent. http://www.darkwooddesigns.co.uk/pc2/testgen.html has a good example of a scaled meter, and this program also seems to respond much better to audio changes (eg clapping my hands will instantly register a peak on this app, versus a small increase in OBS).\n. Thanks! One thing that I feel is really strange with this version is that the peak level indicator moves higher than the actual level bar itself. Eg, clapping my hands will result in a 0dB peak / clipping, yet the audio bar itself never even went into the yellow section. I'm not sure if the average is a good way to represent the volume if it unable to display peaks like this, I think the maximum would be a lot more intuitive. Do you have any strong preference on this?\n. Ah, Audacity's method looks really neat. If we could implement that I think it would be the best of both worlds.\n. Translations are handled through CrowdIn now, please see http://crowdin.net/project/obsproject\n. Could you please check the whitespace? It looks like you're using tabs instead of spaces.\n. Hello, unfortunately we do not accept pull requests for new services - we will add them as demand from our users necessitates. In the meantime we recommend you create a local service file for your users if Custom RTMP is not enough - see edfbea5\n. There does not appear to be any demand for this service. Please create your own local service config file instead if you don't want to use Custom RTMP.\n. Hello, unfortunately we do not accept pull requests for new services - we will add them as demand from our users necessitates. In the meantime we recommend you create a local service file for your users if Custom RTMP is not enough - see edfbea5ba06282d68c298a6b406d6b7c678c5701\n. Merged in 9f9d4ebb337f055f7a47f8b9a0973b8463c039e6\n. This patch causes problems as it seems to use blocking calls without being ready for such.\n21:39:09: librtmp error: RTMPSockBuf_Fill, recv returned -1. GetSockError(): 10035 (A non-blocking socket operation could not be completed immediately.)\n21:39:09: RTMPPublisher::SocketLoop: Got hSendBacklogEvent but WSAIoctl() returned 10038\n21:39:09: RTMPPublisher::SocketLoop: Aborting due to WSAEnumNetworkEvents failure, 10038\n. Closing due to no response.\n. If your users are requesting it, please create a local service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701\n. Merged in e294ac0f13f5658585e4fdd138b49572531d3cac\n. There seem to be mixed spaces / tabs in these commits. Please check your tabs are set to soft-tabs (4 spaces).\n. Please check your whitespace settings, several of these commits are using tabs instead of spaces.\n. OBS Classic is no longer under development.. A DPI scaling manifest was introduced in https://github.com/jp9000/OBS/commit/3df3967c6f7c4251fdcb8cdc823f1fecfa3c0270\n. OBS Classic is no longer under development.. Hello,\nWe no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701 or use our web service at https://obsproject.com/services/add\n. The services file is for your users to download, it will then import into their local OBS installation. You should direct your OBS users to https://obsproject.com/services/4-reall-tv\n. Hello,\nThanks for your contribution. Unfortunately all non-English locale files are imported from crowdin as part of the release process, so merging your changes directly into git would be overwritten by the next import.\nIf you'd like to help translate to Chinese, please submit your changes at https://crowdin.com/project/obsproject instead. Thanks!\n. Hello,\nWe no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701 or use our web service at https://obsproject.com/services/add\n. We finally made a new release with this code, but a ton of NVENC users are reporting sync issues. Is there any particular place where this might have been introduced?\n. Seems to lack any purpose and we don't really want to be adding or supporting new features to OBS classic.\n. Seems to lack any purpose and we don't really want to be adding or supporting new features to OBS classic.\n. We no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701 or use our web service at https://obsproject.com/services/add to create a service file that you can distribute to your users.\n. OBS Classic is no longer under development.. Not really sure what you're trying to do or ask, but this isn't the place for it.\n. Any reason why baseline profile is recommended?. Do you have a reference for that? I couldn't find anything that suggests this is needed.. Chrome appears to be using ffmpeg for H264 decoding, which certainly supports higher than baseline. For encoding it uses OpenH264 which is constrained baseline, but that shouldn't affect decoding.. OBS Classic is no longer under development.. OBS Classic is no longer under development.. This appears to be incompatible with the GPL, and OBS Classic is no longer under development.. OBS Classic is no longer under development.. This looks great! I was thinking of doing something similar myself when I had some time. One note, the OBS code makes use of spaces (not tabs) for indentation, it seems your code includes a number of tabs. If you make any further changes, we'd appreciate it if you could switch to spaces for indentation to keep things consistent with the coding style in OBS.\n. I just noticed your code in MultiplyAudioBuffer is only counting two samples of the audio, is this intended? The SSE2 code is scaling the majority of the samples which do not get added to the sum.\nAlso the smoothing (alpha) applied to the values seems to cause a delay of the meter updating in response to audio, which could make it difficult to isolate sources causing high volume.\n. I've been playing around with this for an hour or so, some more feedback:\nVOL_MAX is set to 6, but since a scale of 1.0 is 0dB, I don't see how the red segment is ever used since it's impossible to go higher than 0dB.\nThe display of the volume bar itself could also be logarithmic, eg the range -70 through -20 is pretty quiet, yet the bar jumps around quite a lot, making larger changes in volume across the -20 to 0dB range less apparent. http://www.darkwooddesigns.co.uk/pc2/testgen.html has a good example of a scaled meter, and this program also seems to respond much better to audio changes (eg clapping my hands will instantly register a peak on this app, versus a small increase in OBS).\n. Thanks! One thing that I feel is really strange with this version is that the peak level indicator moves higher than the actual level bar itself. Eg, clapping my hands will result in a 0dB peak / clipping, yet the audio bar itself never even went into the yellow section. I'm not sure if the average is a good way to represent the volume if it unable to display peaks like this, I think the maximum would be a lot more intuitive. Do you have any strong preference on this?\n. Ah, Audacity's method looks really neat. If we could implement that I think it would be the best of both worlds.\n. Translations are handled through CrowdIn now, please see http://crowdin.net/project/obsproject\n. Could you please check the whitespace? It looks like you're using tabs instead of spaces.\n. Hello, unfortunately we do not accept pull requests for new services - we will add them as demand from our users necessitates. In the meantime we recommend you create a local service file for your users if Custom RTMP is not enough - see edfbea5\n. There does not appear to be any demand for this service. Please create your own local service config file instead if you don't want to use Custom RTMP.\n. Hello, unfortunately we do not accept pull requests for new services - we will add them as demand from our users necessitates. In the meantime we recommend you create a local service file for your users if Custom RTMP is not enough - see edfbea5ba06282d68c298a6b406d6b7c678c5701\n. Merged in 9f9d4ebb337f055f7a47f8b9a0973b8463c039e6\n. This patch causes problems as it seems to use blocking calls without being ready for such.\n21:39:09: librtmp error: RTMPSockBuf_Fill, recv returned -1. GetSockError(): 10035 (A non-blocking socket operation could not be completed immediately.)\n21:39:09: RTMPPublisher::SocketLoop: Got hSendBacklogEvent but WSAIoctl() returned 10038\n21:39:09: RTMPPublisher::SocketLoop: Aborting due to WSAEnumNetworkEvents failure, 10038\n. Closing due to no response.\n. If your users are requesting it, please create a local service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701\n. Merged in e294ac0f13f5658585e4fdd138b49572531d3cac\n. There seem to be mixed spaces / tabs in these commits. Please check your tabs are set to soft-tabs (4 spaces).\n. Please check your whitespace settings, several of these commits are using tabs instead of spaces.\n. OBS Classic is no longer under development.. A DPI scaling manifest was introduced in https://github.com/jp9000/OBS/commit/3df3967c6f7c4251fdcb8cdc823f1fecfa3c0270\n. OBS Classic is no longer under development.. Hello,\nWe no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701 or use our web service at https://obsproject.com/services/add\n. The services file is for your users to download, it will then import into their local OBS installation. You should direct your OBS users to https://obsproject.com/services/4-reall-tv\n. Hello,\nThanks for your contribution. Unfortunately all non-English locale files are imported from crowdin as part of the release process, so merging your changes directly into git would be overwritten by the next import.\nIf you'd like to help translate to Chinese, please submit your changes at https://crowdin.com/project/obsproject instead. Thanks!\n. Hello,\nWe no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701 or use our web service at https://obsproject.com/services/add\n. We finally made a new release with this code, but a ton of NVENC users are reporting sync issues. Is there any particular place where this might have been introduced?\n. Seems to lack any purpose and we don't really want to be adding or supporting new features to OBS classic.\n. Seems to lack any purpose and we don't really want to be adding or supporting new features to OBS classic.\n. We no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5ba06282d68c298a6b406d6b7c678c5701 or use our web service at https://obsproject.com/services/add to create a service file that you can distribute to your users.\n. OBS Classic is no longer under development.. Not really sure what you're trying to do or ask, but this isn't the place for it.\n. Any reason why baseline profile is recommended?. Do you have a reference for that? I couldn't find anything that suggests this is needed.. Chrome appears to be using ffmpeg for H264 decoding, which certainly supports higher than baseline. For encoding it uses OpenH264 which is constrained baseline, but that shouldn't affect decoding.. OBS Classic is no longer under development.. OBS Classic is no longer under development.. This appears to be incompatible with the GPL, and OBS Classic is no longer under development.. OBS Classic is no longer under development.. ",
    "bilhamil": "Yeah sorry, realized that halfway through. Won't happen again I prefer that too.\n. cleaned that up no problem with notepad++\n. Thanks for pointing out the issue in MultiplyAudioBuffer. I am not really familiar with SSE2 but I'm looking into it and should be able to fix it without too much trouble. This could definitely be messing with things potentially..\nThe red segment may end up getting used depending on how high the microphone boost is set. In the case the samples can get scaled over 1, the red meter will end up being used. \nOn the meter, I will continue to try to adjust the scaling on the meter. I have definitely seen meters like the one referenced, and I tried to implement a similar scale but it looked worse than what is committed. I might have been doing something incorrectly though. I will try again to implement a similar scale. The response delay might be several issues one it could be that I am only taking 2 samples as you pointed out. The other might be that the low pass filter might need some tweaking. I will look at this tonight and see if I can tell what is going on. \nI really like this project and I want to help you guys out. Thanks for the feedback!\n. Yeah, it is kind of weird. I just realized that Audacity (an open source audio program) has an interesting way of doing the visualization. They show a bright bar for the RMS value, then it is followed by a darker bar for the max + a 3 second persistent peak indicator. Of course there is a huge debate going between them about switching over to just the peak value with color bands:\nhttp://wiki.audacityteam.org/wiki/Talk:Proposal_Improvement_of_Meter_Toolbar_UI \nThe one thing that I think RMS is good for is getting the relative volume of the desktop and microphone right. Coming from using XSplit before, this always seemed to be really hard to do. But the peaks are important too, the more I look into it the more I realize how many variations there are out there. I am fine with switching to just peaks, let me know what you think.\n. I think what I am going to implement is have both the RMS and the peak readings as is done in audacity. Your visualization mufunyo is interesting, fiddling with the actual colors used will not be hard once I get the peak indicator working correctly. So once I get all the different levels working I should be able to whip up different visualizations w/o much issue. I will post those here for feedback.  \nIf we are going to show both the RMS and the peak, then having the different green/yellow/red colors will probably just muddle things up, so I will probably use the same hue color with varying brightness as both your mock-up and audacity use. Will probably still use red as an indicator if clipping is occurring.\nI'm going to have to come back to this in a couple of days, and it sounds like there is going to be an issue potentially merging with some of the buffer code that Jim is working on. So we'll see where we are in a couple days. \nThanks!\n. Hey guys sorry for the absence, things have been busy at work. I understand about the volume controls, its an understandable issue. \nI updated the meters so that they show both the peak and rms simultaneously as is done in audacity. I implemented the meters with both the solid bars and with the gradients like mufunyo suggested. Here's videos of both in action:\nhttp://www.youtube.com/watch?v=pciUSm3mP9M&feature=youtu.be\nhttp://www.youtube.com/watch?v=SzlAMZjpOFA&feature=youtu.be\nI think the gradient is nice aesthetically, and you kind of get a sense of where the RMS is. On the other hand with the solid bars the RMS and peaks can be both be seen fairly clearly. The imprecision of the gradient might not be a problem since we're not even labeling the dB ticks or anything. \nLet me know what you guys think :)\n. I will point out that the plugin events api provides a mechanism for something like this, your plugin has to export OnStreamStatus and you will receive events for when this changes. Here is a commit that modified some of this stuff https://github.com/jp9000/OBS/commit/28ae32920ead6ef03fe7193e8961f461ba0e8ed8\nYou can see where I am using it in OBSRemote: https://github.com/bilhamil/OBSRemote/blob/master/WebSocketAPIPlugin/MessageHandling.cpp#L562\n. Yeah sorry, realized that halfway through. Won't happen again I prefer that too.\n. cleaned that up no problem with notepad++\n. Thanks for pointing out the issue in MultiplyAudioBuffer. I am not really familiar with SSE2 but I'm looking into it and should be able to fix it without too much trouble. This could definitely be messing with things potentially..\nThe red segment may end up getting used depending on how high the microphone boost is set. In the case the samples can get scaled over 1, the red meter will end up being used. \nOn the meter, I will continue to try to adjust the scaling on the meter. I have definitely seen meters like the one referenced, and I tried to implement a similar scale but it looked worse than what is committed. I might have been doing something incorrectly though. I will try again to implement a similar scale. The response delay might be several issues one it could be that I am only taking 2 samples as you pointed out. The other might be that the low pass filter might need some tweaking. I will look at this tonight and see if I can tell what is going on. \nI really like this project and I want to help you guys out. Thanks for the feedback!\n. Yeah, it is kind of weird. I just realized that Audacity (an open source audio program) has an interesting way of doing the visualization. They show a bright bar for the RMS value, then it is followed by a darker bar for the max + a 3 second persistent peak indicator. Of course there is a huge debate going between them about switching over to just the peak value with color bands:\nhttp://wiki.audacityteam.org/wiki/Talk:Proposal_Improvement_of_Meter_Toolbar_UI \nThe one thing that I think RMS is good for is getting the relative volume of the desktop and microphone right. Coming from using XSplit before, this always seemed to be really hard to do. But the peaks are important too, the more I look into it the more I realize how many variations there are out there. I am fine with switching to just peaks, let me know what you think.\n. I think what I am going to implement is have both the RMS and the peak readings as is done in audacity. Your visualization mufunyo is interesting, fiddling with the actual colors used will not be hard once I get the peak indicator working correctly. So once I get all the different levels working I should be able to whip up different visualizations w/o much issue. I will post those here for feedback.  \nIf we are going to show both the RMS and the peak, then having the different green/yellow/red colors will probably just muddle things up, so I will probably use the same hue color with varying brightness as both your mock-up and audacity use. Will probably still use red as an indicator if clipping is occurring.\nI'm going to have to come back to this in a couple of days, and it sounds like there is going to be an issue potentially merging with some of the buffer code that Jim is working on. So we'll see where we are in a couple days. \nThanks!\n. Hey guys sorry for the absence, things have been busy at work. I understand about the volume controls, its an understandable issue. \nI updated the meters so that they show both the peak and rms simultaneously as is done in audacity. I implemented the meters with both the solid bars and with the gradients like mufunyo suggested. Here's videos of both in action:\nhttp://www.youtube.com/watch?v=pciUSm3mP9M&feature=youtu.be\nhttp://www.youtube.com/watch?v=SzlAMZjpOFA&feature=youtu.be\nI think the gradient is nice aesthetically, and you kind of get a sense of where the RMS is. On the other hand with the solid bars the RMS and peaks can be both be seen fairly clearly. The imprecision of the gradient might not be a problem since we're not even labeling the dB ticks or anything. \nLet me know what you guys think :)\n. I will point out that the plugin events api provides a mechanism for something like this, your plugin has to export OnStreamStatus and you will receive events for when this changes. Here is a commit that modified some of this stuff https://github.com/jp9000/OBS/commit/28ae32920ead6ef03fe7193e8961f461ba0e8ed8\nYou can see where I am using it in OBSRemote: https://github.com/bilhamil/OBSRemote/blob/master/WebSocketAPIPlugin/MessageHandling.cpp#L562\n. ",
    "mufunyo": "I'm strongly leaning towards ditching RMS altogether. Balancing different sources is a legitimate use for it though.\nIf RMS is important to keep, here's something I proposed on IRC:\nhttp://img33.imageshack.us/img33/5172/meterq.png\nThe RMS is dark green, and the peak is a gradient between that and light green. It allows you to use the information that RMS gives you without distracting from the important peak reading.\nAlso, in the current implementation there are two things that irk me: one is that the background is a darker green/yellow/red, which is distracting imho-- it should just be dark grey. The other is that yellow seems to serve no real purpose. In any normal recording the meter is going to be yellow most of the time, yet that shouldn't be any cause for concern as the sample range for yellow is not even close to clipping. Anything that is \"business as usual\" should be green. I would propose a very small yellow range, and reserve red for true clipping only.\nAnother thing is that stereo meters might be useful.\n. Jim, +1 on this being an awesome contribution. There is only so much you can implement yourself, and having someone dedicate time to a single feature is a tremendous help. Lots of people have requested audio levels as well.\nAbout what Audacity does, I didn't download it myself and tried to figure out what exactly it is that it does based on the Wiki Talk comments, but I couldn't really figure it out conclusively. Reading what you said, Bill, it's probably along the same lines as what I had in mind (only they use two solid colours and I suggested a gradient). In any case, I'm looking forward to seeing your proposal. :)\n. I think the gradient looks perfect. It might seem a bit imprecise now but once the UI gets updated to show the volume bars vertically they'll be a lot bigger and easier to see. I maintain that the audacity way looks like there are two volume bars which is guaranteed to confuse people. Great work, Bill!\n. I'm strongly leaning towards ditching RMS altogether. Balancing different sources is a legitimate use for it though.\nIf RMS is important to keep, here's something I proposed on IRC:\nhttp://img33.imageshack.us/img33/5172/meterq.png\nThe RMS is dark green, and the peak is a gradient between that and light green. It allows you to use the information that RMS gives you without distracting from the important peak reading.\nAlso, in the current implementation there are two things that irk me: one is that the background is a darker green/yellow/red, which is distracting imho-- it should just be dark grey. The other is that yellow seems to serve no real purpose. In any normal recording the meter is going to be yellow most of the time, yet that shouldn't be any cause for concern as the sample range for yellow is not even close to clipping. Anything that is \"business as usual\" should be green. I would propose a very small yellow range, and reserve red for true clipping only.\nAnother thing is that stereo meters might be useful.\n. Jim, +1 on this being an awesome contribution. There is only so much you can implement yourself, and having someone dedicate time to a single feature is a tremendous help. Lots of people have requested audio levels as well.\nAbout what Audacity does, I didn't download it myself and tried to figure out what exactly it is that it does based on the Wiki Talk comments, but I couldn't really figure it out conclusively. Reading what you said, Bill, it's probably along the same lines as what I had in mind (only they use two solid colours and I suggested a gradient). In any case, I'm looking forward to seeing your proposal. :)\n. I think the gradient looks perfect. It might seem a bit imprecise now but once the UI gets updated to show the volume bars vertically they'll be a lot bigger and easier to see. I maintain that the audacity way looks like there are two volume bars which is guaranteed to confuse people. Great work, Bill!\n. ",
    "Fyren": "If you decide this should be done another way (or just that there should be similar buttons for other sources) just say so and I'll try to implement what you want if you don't have time.\n. My personal use case for this is that I switch between streaming different small and unusually-sized windows (often not 4:3 or 16:9 in their common resolutions).  Things like emulators or indie games.  I found it irritating to have to look up the resolutions being used and then go set it.  I didn't want to just pick my desktop resolution.  I don't know how common of an issue this is for other people, but a dropdown wouldn't be suitable for me.\n. If you decide this should be done another way (or just that there should be similar buttons for other sources) just say so and I'll try to implement what you want if you don't have time.\n. My personal use case for this is that I switch between streaming different small and unusually-sized windows (often not 4:3 or 16:9 in their common resolutions).  Things like emulators or indie games.  I found it irritating to have to look up the resolutions being used and then go set it.  I didn't want to just pick my desktop resolution.  I don't know how common of an issue this is for other people, but a dropdown wouldn't be suitable for me.\n. ",
    "hwdro": "yeah, lol :))\n. Don't worry about that.\n. Manually merged in 25e5ffd03d6d520c348c1c99f071d675c7a5b369\n. [profile] - [app name] should be more than fine, also, your suggested way for title is fine too ([app name] -profile: [profile], but, sometimes the title can get very long and it will defeat the purpose of showing the active profile (you know , the combination of small window width with a very long window title).\nI will close this issue for now, as I don't think it's 'that' important, but feel free to reopen it if you have something to add or propose a better solution.\n. Let's just wait for something official.\n. baaah , absolute path ... not good :S (just saying)\n. yeah, lol :))\n. Don't worry about that.\n. Manually merged in 25e5ffd03d6d520c348c1c99f071d675c7a5b369\n. [profile] - [app name] should be more than fine, also, your suggested way for title is fine too ([app name] -profile: [profile], but, sometimes the title can get very long and it will defeat the purpose of showing the active profile (you know , the combination of small window width with a very long window title).\nI will close this issue for now, as I don't think it's 'that' important, but feel free to reopen it if you have something to add or propose a better solution.\n. Let's just wait for something official.\n. baaah , absolute path ... not good :S (just saying)\n. ",
    "lmurray": "The pull request seems to also display my merge of your changes in the diff. There should only be a single line difference.\n. The pull request seems to also display my merge of your changes in the diff. There should only be a single line difference.\n. ",
    "foxx1337": "Possible improvements:\n- add right-click menu support there (show/hide OBS, exit)\n- add profile selector to the right click menu\n- add bubble notifications when streaming, switching profiles\n- disable Notification Area icon clicks from throwing SW_SHOW/SW_HIDE at the main window when a modal dialog is displayed\n. Works, also from the notification area.\nA bit annoying that several linked things happen from different places - I had a problem with the same behavior being triggered from different places earlier today with 86fe521c6780d4b41fd3634f5849ee3b066ff78f versus 6e1cadd81102897f575f4274db1be297fa1ab659. So: new feature gets added, new feature doesn't get triggered from all the places that trigger the previous functionality because code needs to be duplicated first.\n. Possible improvements:\n- add right-click menu support there (show/hide OBS, exit)\n- add profile selector to the right click menu\n- add bubble notifications when streaming, switching profiles\n- disable Notification Area icon clicks from throwing SW_SHOW/SW_HIDE at the main window when a modal dialog is displayed\n. Works, also from the notification area.\nA bit annoying that several linked things happen from different places - I had a problem with the same behavior being triggered from different places earlier today with 86fe521c6780d4b41fd3634f5849ee3b066ff78f versus 6e1cadd81102897f575f4274db1be297fa1ab659. So: new feature gets added, new feature doesn't get triggered from all the places that trigger the previous functionality because code needs to be duplicated first.\n. ",
    "johto": "A duplicate of https://github.com/jp9000/OBS/issues/151\nSorry about that, I had no idea you can't attach a pull request to an issue.  (Or at least I fail to do so.)\n. A duplicate of https://github.com/jp9000/OBS/issues/151\nSorry about that, I had no idea you can't attach a pull request to an issue.  (Or at least I fail to do so.)\n. ",
    "Warchamp7": "I'm not quite sure what the problem is. That message is displayed in whatever language you're currently set to whenever you're going to change the language.\nFor example, if the language is set to English, and someone is changing it because they don't speak English, it says \"Changing the language will require restarting OBS. ...Though I suppose if you're changing the language you can't understand this\". I don't see why that shouldn't be displayed in all languages when changing the language setting.\n. A few have said layout doesn't convey the proper meaning, though it's what I would have went with. I spoke with a few groups and they were most content with 'Scene Collection' or alternatively 'Scene Set' for a shorter phrase. \n. I think it'd be best to keep the name consistent and go with Scene Collection in all places.\nYour commit where you 'fixed several issues' solved every bug I had found before, and I've only managed to find one new one.\nSwitching scene collection while live (or previewing in my test case) does not repopulate the source list properly of the top/'default' scene of the new collection. This is fixed when you switch to another scene in the new collection.\nTrying to manipulate a source (which is from the last selected scene in the previous collection) causes a crash.\n. For clarity sake I think that's a good idea\n. Hmm, upon some closer inspection it seems related to Global sources.\nHave two collections. Make sure the first collections top most scene has a global source. Start Previewing. From the top menu, switch to the other collection, and then switch back.\nYou should now have the scenes of the new collection, but the sources listed are the global sources of the scene from the old collection. Trying to then for example toggle visibility of one of these 'mismatched' sources will cause a crash\n. Yeah, it certainly seems inconsistent. \nI think the crash was related to a CLR Browser plugin global source I had, as the crashlog says it was in obsapi and I can't seem to get a crash after removing it.\nSwitching collections definitely bugs out the source list sometimes for me, whether previewing or not and whether there's a global source in the 'top' scene or not. I can't get a consistent situation though.\n. Yeah, I can't get a crash anymore, but I definitely get the incorrect sources when toggling between collections sometimes.\n. I wish I could tell you a specific scenario, but I can't seem too create one.\nHere's a crash log I just got though http://pastebin.com/ZEBNTMe0 if it helps\n. I'm not quite sure what the problem is. That message is displayed in whatever language you're currently set to whenever you're going to change the language.\nFor example, if the language is set to English, and someone is changing it because they don't speak English, it says \"Changing the language will require restarting OBS. ...Though I suppose if you're changing the language you can't understand this\". I don't see why that shouldn't be displayed in all languages when changing the language setting.\n. A few have said layout doesn't convey the proper meaning, though it's what I would have went with. I spoke with a few groups and they were most content with 'Scene Collection' or alternatively 'Scene Set' for a shorter phrase. \n. I think it'd be best to keep the name consistent and go with Scene Collection in all places.\nYour commit where you 'fixed several issues' solved every bug I had found before, and I've only managed to find one new one.\nSwitching scene collection while live (or previewing in my test case) does not repopulate the source list properly of the top/'default' scene of the new collection. This is fixed when you switch to another scene in the new collection.\nTrying to manipulate a source (which is from the last selected scene in the previous collection) causes a crash.\n. For clarity sake I think that's a good idea\n. Hmm, upon some closer inspection it seems related to Global sources.\nHave two collections. Make sure the first collections top most scene has a global source. Start Previewing. From the top menu, switch to the other collection, and then switch back.\nYou should now have the scenes of the new collection, but the sources listed are the global sources of the scene from the old collection. Trying to then for example toggle visibility of one of these 'mismatched' sources will cause a crash\n. Yeah, it certainly seems inconsistent. \nI think the crash was related to a CLR Browser plugin global source I had, as the crashlog says it was in obsapi and I can't seem to get a crash after removing it.\nSwitching collections definitely bugs out the source list sometimes for me, whether previewing or not and whether there's a global source in the 'top' scene or not. I can't get a consistent situation though.\n. Yeah, I can't get a crash anymore, but I definitely get the incorrect sources when toggling between collections sometimes.\n. I wish I could tell you a specific scenario, but I can't seem too create one.\nHere's a crash log I just got though http://pastebin.com/ZEBNTMe0 if it helps\n. ",
    "ThoNohT": "SetFullscreenMode should only be called when the user actually toggles fullscreen from the context menu. This is also the behavior I observed when debugging.\n. Added another commit that enables the Apply button when changing the Device option in video settings.\n. SetFullscreenMode should only be called when the user actually toggles fullscreen from the context menu. This is also the behavior I observed when debugging.\n. Added another commit that enables the Apply button when changing the Device option in video settings.\n. ",
    "Jack0r": "Just gave it a shot, works fine. Thank you very much. \nI would personally keep on using duplicate as the translation :) Maybe its just me, but the term copy makes me want to paste it with the expectation of automatic naming of \"scene1\" to \"scene1(2)\" or \"Copy of Scene1\"  for example. While OBS asking for a new name for the \"duplicated scene\" seems logic! \n. Hey,\nwe discussed it quickly on the IRC chat and it was kinda mixed if this should be merged or not.\nMost programs I use for example tend to use the scheme:\nFilename/Info - Programname\nIt probably depends on the windows theme (taskbar for example) and also a lot on the personal opinion which way one will prefer. Open source software is kinda of a democracy so I would like to hear your opinion.\nDo you see any positive points in this change I am overseeing or missing that could make me change my mind?\n. Thats not everything we have on crowdin right now, is it?\n. I personally never really had to edit a scene while being live and I think I never tried to resize a source that is disabled, before reading this. Sorry if I understood something wrong.\nMy first thinking was to disable the selection completely while the source is disabled, resizing/moving would not be possible through the preview, only through shortcuts or the menu. But this would be bad for the people that often move stuff around while they have it disabled. I personally think its necessary to see the source to resize and align it correctly, unless its a fullscreen source.\nAt the same time I would guess that its better to have the aspect lock active at all times (active or disabled source), unless you hold shift. This seems consistent and how else should you resize a disabled source without stretching it by mistake? If you want to keep a custom aspect ratio, you probably also have something you want to align it to. So you would take this as a guide and just use shift to resize your source.\n. A small question, will we be able to load a scene collection with the shortcut similar to selecting a profile currently?\nOBS.exe -profile \"Profile A\" -scene \"Scene Collection A\"\nhttp://jp9000.github.io/OBS/shortcut.html\nIf not, maybe you could add that too, overall its a very nice addition, thanks for your work! (Have not encountered a Bug yet)\n. In general, wouldn't it be better if the import button would allow you to choose a file from which we could import the global sources?\nThe current behavior with the scenes.xconfig is very confusing.\n. First, I thought we should do it like this, and overhaul the button order/naming a bit:\n\nBut one problem I noticed, you can rename the scenes.xconfig. And then the button will not work anymore.\n. You can make the button use \"Multiline\" with BS_MULTILINE :) \nBut it was just a suggestion. I still think its a somewhat unusable function if the import only works with the Main.xconfig. Would like to hear more opinions on it though from others. (Definitely dont want to block it)\n. I think listing all scenecollections and then their global sources in a submenu would be perfect. You could import a scenecollection if you want a global source out of it. \nMy initial idea was that the import button should probably start an \"Open\" dialog which lets you select the xconfig file and afterwards would list all globalsources, maybe even with the option to import more than one source. Pretty old kind of import style.\nI also want to say thanks a lot for your work so far. Please always take my comments as constructive feedback! I mainly try to think what will our users ask in chat if we add OptionA or use OptionB and try to comment accordingly. What will confuse and what will help them, or will they use the function, etc. \n. I checked, but you havent updated your fork yet right? Sounds pretty good already!\nFor the image here I changed the dialog in OBS and build it quickly. But normally I make screenshots and then just use Fireworks in most cases. (Copy pasta and some editing)\n. Ah that is very nice. Would a Dialog instead of the Popup allow import of several sources at once? Then I would probably prefer that, but for a single source import the popup is perfect :+1: \n. Perfect! Exactly what we needed. Jim also mentioned on IRC that he would like a real Dialog, so that should please him!\n. Awesome, to me its perfect now. The effort to hold ctrl or shift should not be too much and every user should be used to its behavior. \nTried importing several sources, at once and one after the after and so far I could not break it. If a source already exists, it will not import that source but others you selected. (I hate it if you have to recheck all other sources and do the import again because one failed, so I like this very much).\nUnless someone has anything to add, I have no idea how to improve it any further. :+1:\n. Do not merge yet, will change tomorrow!\n. Hmm, I think it would be better if it would copy the references if a global source is used in the scene you copy over. And if no global source is added, do not copy them. \nThe dialog at first totally confused me before I tested it with a global source. If you click no you get an empty source that does not have properties.\n. Oh, so no matter what I do, the global source will not work. And how is the user supposed to import the global source later? I might still be confused.\n. Yea, that is a lot less confusing for me. And you can copy scenes with global sources and they will work, perfect! :)\n. As a german, is Vorgriffstiefe a real word? \nDuden doesnt know it and google only had one result, a patent about \"treillis based spectralformation with prediction\". I mean if its the right word, sure, but I am happy I use the english version of OBS then, as I wouldnt know what setting Vorgriffstiefe is, without having seen this commit.\n. You already got the answer to that question:\n\"We no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5 or use our web service at https://obsproject.com/services/add\"\n. Just gave it a shot, works fine. Thank you very much. \nI would personally keep on using duplicate as the translation :) Maybe its just me, but the term copy makes me want to paste it with the expectation of automatic naming of \"scene1\" to \"scene1(2)\" or \"Copy of Scene1\"  for example. While OBS asking for a new name for the \"duplicated scene\" seems logic! \n. Hey,\nwe discussed it quickly on the IRC chat and it was kinda mixed if this should be merged or not.\nMost programs I use for example tend to use the scheme:\nFilename/Info - Programname\nIt probably depends on the windows theme (taskbar for example) and also a lot on the personal opinion which way one will prefer. Open source software is kinda of a democracy so I would like to hear your opinion.\nDo you see any positive points in this change I am overseeing or missing that could make me change my mind?\n. Thats not everything we have on crowdin right now, is it?\n. I personally never really had to edit a scene while being live and I think I never tried to resize a source that is disabled, before reading this. Sorry if I understood something wrong.\nMy first thinking was to disable the selection completely while the source is disabled, resizing/moving would not be possible through the preview, only through shortcuts or the menu. But this would be bad for the people that often move stuff around while they have it disabled. I personally think its necessary to see the source to resize and align it correctly, unless its a fullscreen source.\nAt the same time I would guess that its better to have the aspect lock active at all times (active or disabled source), unless you hold shift. This seems consistent and how else should you resize a disabled source without stretching it by mistake? If you want to keep a custom aspect ratio, you probably also have something you want to align it to. So you would take this as a guide and just use shift to resize your source.\n. A small question, will we be able to load a scene collection with the shortcut similar to selecting a profile currently?\nOBS.exe -profile \"Profile A\" -scene \"Scene Collection A\"\nhttp://jp9000.github.io/OBS/shortcut.html\nIf not, maybe you could add that too, overall its a very nice addition, thanks for your work! (Have not encountered a Bug yet)\n. In general, wouldn't it be better if the import button would allow you to choose a file from which we could import the global sources?\nThe current behavior with the scenes.xconfig is very confusing.\n. First, I thought we should do it like this, and overhaul the button order/naming a bit:\n\nBut one problem I noticed, you can rename the scenes.xconfig. And then the button will not work anymore.\n. You can make the button use \"Multiline\" with BS_MULTILINE :) \nBut it was just a suggestion. I still think its a somewhat unusable function if the import only works with the Main.xconfig. Would like to hear more opinions on it though from others. (Definitely dont want to block it)\n. I think listing all scenecollections and then their global sources in a submenu would be perfect. You could import a scenecollection if you want a global source out of it. \nMy initial idea was that the import button should probably start an \"Open\" dialog which lets you select the xconfig file and afterwards would list all globalsources, maybe even with the option to import more than one source. Pretty old kind of import style.\nI also want to say thanks a lot for your work so far. Please always take my comments as constructive feedback! I mainly try to think what will our users ask in chat if we add OptionA or use OptionB and try to comment accordingly. What will confuse and what will help them, or will they use the function, etc. \n. I checked, but you havent updated your fork yet right? Sounds pretty good already!\nFor the image here I changed the dialog in OBS and build it quickly. But normally I make screenshots and then just use Fireworks in most cases. (Copy pasta and some editing)\n. Ah that is very nice. Would a Dialog instead of the Popup allow import of several sources at once? Then I would probably prefer that, but for a single source import the popup is perfect :+1: \n. Perfect! Exactly what we needed. Jim also mentioned on IRC that he would like a real Dialog, so that should please him!\n. Awesome, to me its perfect now. The effort to hold ctrl or shift should not be too much and every user should be used to its behavior. \nTried importing several sources, at once and one after the after and so far I could not break it. If a source already exists, it will not import that source but others you selected. (I hate it if you have to recheck all other sources and do the import again because one failed, so I like this very much).\nUnless someone has anything to add, I have no idea how to improve it any further. :+1:\n. Do not merge yet, will change tomorrow!\n. Hmm, I think it would be better if it would copy the references if a global source is used in the scene you copy over. And if no global source is added, do not copy them. \nThe dialog at first totally confused me before I tested it with a global source. If you click no you get an empty source that does not have properties.\n. Oh, so no matter what I do, the global source will not work. And how is the user supposed to import the global source later? I might still be confused.\n. Yea, that is a lot less confusing for me. And you can copy scenes with global sources and they will work, perfect! :)\n. As a german, is Vorgriffstiefe a real word? \nDuden doesnt know it and google only had one result, a patent about \"treillis based spectralformation with prediction\". I mean if its the right word, sure, but I am happy I use the english version of OBS then, as I wouldnt know what setting Vorgriffstiefe is, without having seen this commit.\n. You already got the answer to that question:\n\"We no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5 or use our web service at https://obsproject.com/services/add\"\n. ",
    "tehspirit": "installed vs2010 + sp1 + dx sdk... somehow compiled... took 522b, overwritten with compiled OBS.exe, OBSApi.dll, GraphicsCapture.dll, DShowPlugin.dll\npc setup:\ndesktop 1920x1080\nin-game 1280x720\ncpu i7 3770k\nin-game fps around 120\nobs setup:\n30 fps\nbitrate 3000 kbps\nbase resolution 1280x720\nresult: http://cs.twitch.tv/tehspirit/b/401492910?t=4m55s\nbtw: recording using Action! (intel quicksync on), recordings are no prob\n. here it is: http://basemod.bplaced.com/qsv\nbtw made new stream: http://cs.twitch.tv/tehspirit/b/401540926\nplus Action! recording is uploaded too (1st link)\n. latest commit 57a3a93de2\nstill... http://cs.twitch.tv/tehspirit/b/401933728\n. installed vs2010 + sp1 + dx sdk... somehow compiled... took 522b, overwritten with compiled OBS.exe, OBSApi.dll, GraphicsCapture.dll, DShowPlugin.dll\npc setup:\ndesktop 1920x1080\nin-game 1280x720\ncpu i7 3770k\nin-game fps around 120\nobs setup:\n30 fps\nbitrate 3000 kbps\nbase resolution 1280x720\nresult: http://cs.twitch.tv/tehspirit/b/401492910?t=4m55s\nbtw: recording using Action! (intel quicksync on), recordings are no prob\n. here it is: http://basemod.bplaced.com/qsv\nbtw made new stream: http://cs.twitch.tv/tehspirit/b/401540926\nplus Action! recording is uploaded too (1st link)\n. latest commit 57a3a93de2\nstill... http://cs.twitch.tv/tehspirit/b/401933728\n. ",
    "palana": "The encoder indeed works synchronously for now; I didn't want to deviate too far from the encoder interface and for my use cases it worked well enough. A quick fix to hide a bit of latency would be to promote the mfxSyncPoint to a class member and do the output before resetting the mfxBitstream and mfxFrameSurface1: https://github.com/palana/OBS/commit/b7b15d1909e5e6fecac9ee6650d44c4b95f33f44\nFor more asynchronicity it would be necessary to either increase NUM_OUT_BUFFERS/make the associated arrays resizable at runtime or move ownership of the yuv-buffers to the encoder.\n@tehspirit could you make a gist with a) the OBS logfile for your test-stream and b) if you're up to it, a tracer logfile (should be located in ...\\Media SDK 2013\\tools\\mediasdk_tracer) for both OBS and Action!?\n@jp9000 I'll try to catch you on IRC later (and I've updated my profile with my email address)\n. Please squash those commits (see http://blog.steveklabnik.com/posts/2012-11-08-how-to-squash-commits-in-a-github-pull-request)\n. Another squash and we're good to go\n. No problem, your changes didn't miss any deadlines as far as I'm aware ;)\n. In addition to the source comments, please either squash all your commits or create more meaningful commits that don't randomly touch every aspect of your pull request\n. Unfortunately you didn't address all previous comments: squash/rebase your changes\n. Please use spaces for indentation and make sure your commits contain only changes that are actually relevant for that commit (read: merge changes into previous commits, don't add \"fixes\" to later commits that change things which you introduced, for example: https://github.com/Glought/OBS/commit/126f5e12115ee6f0bc6449ba0d08bba0ecd49649#diff-ea800412bc543fdb95226bd5fb868023L2343, https://github.com/Glought/OBS/commit/126f5e12115ee6f0bc6449ba0d08bba0ecd49649#diff-eb09d188e3366bab3df8a63fd788ddb7L964)\n. Disregarding the essentially halted state of development for OBS (see https://github.com/jp9000/OBS/blob/master/README.md), here are a few comments about your pull request:\n- https://github.com/sam8641/OBS/commit/c610a0d5063cef1fddc1b9a9be5d475067b2d6b4 doesn't belong in a pull request\n- https://github.com/sam8641/OBS/commit/a030d88034578e945f9fc3c91d048c9da72fd8e4 doesn't explain what kind of dependency it's supposed to fix (there doesn't seem to be a problem with all configurations currently in use; note that some projects aren't part of the OBS solution, OBS-All contains all projects)\n- there are a lot of unnecessary (whitespace-)changes in https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7 (such as https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7#diff-67c756232e7d7e0357ea7beaf499aee2L59, https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7#diff-67c756232e7d7e0357ea7beaf499aee2L151, and https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7#diff-67c756232e7d7e0357ea7beaf499aee2L154)\n. The encoder indeed works synchronously for now; I didn't want to deviate too far from the encoder interface and for my use cases it worked well enough. A quick fix to hide a bit of latency would be to promote the mfxSyncPoint to a class member and do the output before resetting the mfxBitstream and mfxFrameSurface1: https://github.com/palana/OBS/commit/b7b15d1909e5e6fecac9ee6650d44c4b95f33f44\nFor more asynchronicity it would be necessary to either increase NUM_OUT_BUFFERS/make the associated arrays resizable at runtime or move ownership of the yuv-buffers to the encoder.\n@tehspirit could you make a gist with a) the OBS logfile for your test-stream and b) if you're up to it, a tracer logfile (should be located in ...\\Media SDK 2013\\tools\\mediasdk_tracer) for both OBS and Action!?\n@jp9000 I'll try to catch you on IRC later (and I've updated my profile with my email address)\n. Please squash those commits (see http://blog.steveklabnik.com/posts/2012-11-08-how-to-squash-commits-in-a-github-pull-request)\n. Another squash and we're good to go\n. No problem, your changes didn't miss any deadlines as far as I'm aware ;)\n. In addition to the source comments, please either squash all your commits or create more meaningful commits that don't randomly touch every aspect of your pull request\n. Unfortunately you didn't address all previous comments: squash/rebase your changes\n. Please use spaces for indentation and make sure your commits contain only changes that are actually relevant for that commit (read: merge changes into previous commits, don't add \"fixes\" to later commits that change things which you introduced, for example: https://github.com/Glought/OBS/commit/126f5e12115ee6f0bc6449ba0d08bba0ecd49649#diff-ea800412bc543fdb95226bd5fb868023L2343, https://github.com/Glought/OBS/commit/126f5e12115ee6f0bc6449ba0d08bba0ecd49649#diff-eb09d188e3366bab3df8a63fd788ddb7L964)\n. Disregarding the essentially halted state of development for OBS (see https://github.com/jp9000/OBS/blob/master/README.md), here are a few comments about your pull request:\n- https://github.com/sam8641/OBS/commit/c610a0d5063cef1fddc1b9a9be5d475067b2d6b4 doesn't belong in a pull request\n- https://github.com/sam8641/OBS/commit/a030d88034578e945f9fc3c91d048c9da72fd8e4 doesn't explain what kind of dependency it's supposed to fix (there doesn't seem to be a problem with all configurations currently in use; note that some projects aren't part of the OBS solution, OBS-All contains all projects)\n- there are a lot of unnecessary (whitespace-)changes in https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7 (such as https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7#diff-67c756232e7d7e0357ea7beaf499aee2L59, https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7#diff-67c756232e7d7e0357ea7beaf499aee2L151, and https://github.com/sam8641/OBS/commit/cc2780b0d5e8bf3c8007396a5030f6bd666bd1b7#diff-67c756232e7d7e0357ea7beaf499aee2L154)\n. ",
    "shousa": "Thank you for discussing.\nI know that there are many softwares using such display format you are\npointing out.\nIn the case of applications running at the same time more than one,\nsuch as browser, text editor, etc, I fully agree to what you saying and\neasy to distinguish from others.\nHowever, OBS is not an application like to start at the same time more than\none.\nIn the case of such applications, which is more important information for\nusers?\nI think there is also a matter of taste.\nWhen I started the new test version of OBS, I saw the title of \"Untitled -\nOpen Broadcaster Software ...\".\nUntil then, there was the only application name like \"Open Broadcaster\nSoftware ...\".\nSome users may use custom profile which they named, but others may use\ndefault profile without naming.\nI took into consideration the both case, I think users want to know the\napplication name in the first place,\nand Subsequently the profile name, and I wanted to make it easier to\nunderstand what \"Untitled\" is representing.\nThis is my opinion, and I respect the democracy of open source software, I\nwill follow the outcome of the discussion.\nBest regards.\n2013/7/29 Jack0r notifications@github.com\n\nHey,\nwe discussed it quickly on the IRC chat and it was kinda mixed if this\nshould be merged or not.\nMost programs I use for example tend to use the scheme:\nFilename/Info - Programname\nIt probably depends on the windows theme (taskbar for example) and also a\nlot on the personal opinion which way one will prefer. Open source software\nis kinda of a democracy so I would like to hear your opinion.\nDo you see any positive points in this change I am overseeing or missing\nthat could make me change my mind?\n—\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/251#issuecomment-21685393\n.\n. Hi, Jim.\n\nOBS users in Japan has been increasing steadily, and I have to thank you\nand all OBS developpers.\nOf course, I know the setting of custom x264 command, and I have already\nmade original custom preset and I am using and distributing it.\n(My custom preset is downloaded by many users, but has bit higher load than\n\"slower\" preset.)\nFor sites that can be used with higher bit rate, I think that \"slower\" or\nmore higher load preset is not required.\nWe uses OBS at Niconico Live streaming service, which is the most popular\nsite in Japan.\nBut total bit rate is restricted lower than 480kbps or 384kbps in this\nsite, because there are numerous users and listeners.\nMany users are setting resolution, for example, 640x480, 640x360, 512x384,\n512x288 because of restriction of total bit rate.\nIn such case, \"slower\" preset option is used in many users and in other\nencorder tools, in order to improve the video quality.\nAnd many users are not more in detail of preset, so I think it is better\nthat we can select \"slower\" directly in the combo box with ease.\nIndeed, I have seen that many users do not know the means of doing:\npreset=slower as a custom x264 command.\n(I think \"veryslow\" and \"placebo\" is too high load, I do not even recommended\nthem even if core i7 CPU is used.)\nI'd like to consider these backgrounds.\nBest regards.\n. Thank you for discussing and merging.\nEven though bitrate is limited, this service has many listeners.\nSome users prefer better quality streaming services, but others prefer many\ncomments of many listeners.\n. Hi,Jim.\nThank you for merging with this request.\nHi,dodgepong\nI registered CrowdIn, and added my translations which is same as this pull request.\n. Thank you.\n2013/8/17 dodgepong notifications@github.com\n\nI have added you as a proofreader in CrowdIn.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/272#issuecomment-22797378\n.\n. Hi, Jim.\nI had already updated problems of my code pointed out by palana and tested\nevery combinations yesterday.\n(I separated the channel from the format.)\nI will be send pull request again, please wait for a momoent.\n\n2014-03-03 19:54 GMT+09:00 Jim notifications@github.com:\n\nShousa - could you update that code and post again when it's good to go?\n\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/312#issuecomment-36499433\n.\n. In this case, video stream is used with still image.\n. Thank you for discussing.\nI know that there are many softwares using such display format you are\npointing out.\nIn the case of applications running at the same time more than one,\nsuch as browser, text editor, etc, I fully agree to what you saying and\neasy to distinguish from others.\nHowever, OBS is not an application like to start at the same time more than\none.\nIn the case of such applications, which is more important information for\nusers?\nI think there is also a matter of taste.\nWhen I started the new test version of OBS, I saw the title of \"Untitled -\nOpen Broadcaster Software ...\".\nUntil then, there was the only application name like \"Open Broadcaster\nSoftware ...\".\nSome users may use custom profile which they named, but others may use\ndefault profile without naming.\nI took into consideration the both case, I think users want to know the\napplication name in the first place,\nand Subsequently the profile name, and I wanted to make it easier to\nunderstand what \"Untitled\" is representing.\nThis is my opinion, and I respect the democracy of open source software, I\nwill follow the outcome of the discussion.\nBest regards.\n\n2013/7/29 Jack0r notifications@github.com\n\nHey,\nwe discussed it quickly on the IRC chat and it was kinda mixed if this\nshould be merged or not.\nMost programs I use for example tend to use the scheme:\nFilename/Info - Programname\nIt probably depends on the windows theme (taskbar for example) and also a\nlot on the personal opinion which way one will prefer. Open source software\nis kinda of a democracy so I would like to hear your opinion.\nDo you see any positive points in this change I am overseeing or missing\nthat could make me change my mind?\n—\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/251#issuecomment-21685393\n.\n. Hi, Jim.\n\nOBS users in Japan has been increasing steadily, and I have to thank you\nand all OBS developpers.\nOf course, I know the setting of custom x264 command, and I have already\nmade original custom preset and I am using and distributing it.\n(My custom preset is downloaded by many users, but has bit higher load than\n\"slower\" preset.)\nFor sites that can be used with higher bit rate, I think that \"slower\" or\nmore higher load preset is not required.\nWe uses OBS at Niconico Live streaming service, which is the most popular\nsite in Japan.\nBut total bit rate is restricted lower than 480kbps or 384kbps in this\nsite, because there are numerous users and listeners.\nMany users are setting resolution, for example, 640x480, 640x360, 512x384,\n512x288 because of restriction of total bit rate.\nIn such case, \"slower\" preset option is used in many users and in other\nencorder tools, in order to improve the video quality.\nAnd many users are not more in detail of preset, so I think it is better\nthat we can select \"slower\" directly in the combo box with ease.\nIndeed, I have seen that many users do not know the means of doing:\npreset=slower as a custom x264 command.\n(I think \"veryslow\" and \"placebo\" is too high load, I do not even recommended\nthem even if core i7 CPU is used.)\nI'd like to consider these backgrounds.\nBest regards.\n. Thank you for discussing and merging.\nEven though bitrate is limited, this service has many listeners.\nSome users prefer better quality streaming services, but others prefer many\ncomments of many listeners.\n. Hi,Jim.\nThank you for merging with this request.\nHi,dodgepong\nI registered CrowdIn, and added my translations which is same as this pull request.\n. Thank you.\n2013/8/17 dodgepong notifications@github.com\n\nI have added you as a proofreader in CrowdIn.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/272#issuecomment-22797378\n.\n. Hi, Jim.\nI had already updated problems of my code pointed out by palana and tested\nevery combinations yesterday.\n(I separated the channel from the format.)\nI will be send pull request again, please wait for a momoent.\n\n2014-03-03 19:54 GMT+09:00 Jim notifications@github.com:\n\nShousa - could you update that code and post again when it's good to go?\n\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/312#issuecomment-36499433\n.\n. In this case, video stream is used with still image.\n. \n",
    "Gol-D-Ace": "Actually it is from crowdin. Also including some changes from you.\nEDIT: Sorry didn't read the comment right.\nIt should be everything from crowdin.\nAnd yeah we have some conflicting words. (Words that exist as a German translation and as the original English word.)\n. Well I would \"merge\" the crowdin data (for german only) but I can't download the translation files.\nSo someone like you or Jim have to do this.\n. PS: Don't kill me again.\n. Has already been included.\nhttps://github.com/jp9000/OBS/commit/8c76ea0bbd7ac1b3811b4902d8cfb344f020f792\n. I would just use the english string. It's a technical encoding term.\n. Note to translators: DO NOT translate this file directly. Instead, visit http://crowdin.com/project/obs-studio and submit your translations there.\nPull requests for translations outside of CrowdIn will not be accepted.\nRead this forum post for more instructions on submitting translations: https://obsproject.com/forum/threads/how-to-contribute-translations-for-obs.16327/\n. Restream.io got also added to MP so I don't see a reason why not.\n. Please see https://github.com/jp9000/OBS/pull/415\n. Please see: https://github.com/jp9000/OBS/pull/415\n. Please see https://github.com/jp9000/OBS/pull/415\n. Also please see https://github.com/jp9000/obs-studio/pull/381#issuecomment-75668959\n. Hi.\nAs far as I'm informed, we don't accept new services in OBS Classic.\nBut of course you can submit it to the obs-studio repo.\nSee past commits for how to do it for Studio.\nGreetings\n. We no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5 or use our web service at https://obsproject.com/services/add to create a service file that you can distribute to your users.\n. Actually it is from crowdin. Also including some changes from you.\nEDIT: Sorry didn't read the comment right.\nIt should be everything from crowdin.\nAnd yeah we have some conflicting words. (Words that exist as a German translation and as the original English word.)\n. Well I would \"merge\" the crowdin data (for german only) but I can't download the translation files.\nSo someone like you or Jim have to do this.\n. PS: Don't kill me again.\n. Has already been included.\nhttps://github.com/jp9000/OBS/commit/8c76ea0bbd7ac1b3811b4902d8cfb344f020f792\n. I would just use the english string. It's a technical encoding term.\n. Note to translators: DO NOT translate this file directly. Instead, visit http://crowdin.com/project/obs-studio and submit your translations there.\nPull requests for translations outside of CrowdIn will not be accepted.\nRead this forum post for more instructions on submitting translations: https://obsproject.com/forum/threads/how-to-contribute-translations-for-obs.16327/\n. Restream.io got also added to MP so I don't see a reason why not.\n. Please see https://github.com/jp9000/OBS/pull/415\n. Please see: https://github.com/jp9000/OBS/pull/415\n. Please see https://github.com/jp9000/OBS/pull/415\n. Also please see https://github.com/jp9000/obs-studio/pull/381#issuecomment-75668959\n. Hi.\nAs far as I'm informed, we don't accept new services in OBS Classic.\nBut of course you can submit it to the obs-studio repo.\nSee past commits for how to do it for Studio.\nGreetings\n. We no longer accept new submissions for OBS 1. Please create a .obs-service file as described in edfbea5 or use our web service at https://obsproject.com/services/add to create a service file that you can distribute to your users.\n. ",
    "dodgepong": "Honestly, I don't recommend merging pull requests for translations anymore directly. It makes merging CrowdIn translations a lot more complicated, having to copy up the new translation files to keep things in sync.\nI need to show more people how to merge in CrowdIn data so that I'm not the only one who can do it.\n. The consequence of all translation going through one place is that translations take longer to get into github. Sure, it's not immediate, but as long as translations are merged before a new release or test, it's all good.\n. The content should have already been merged in from CrowdIn, so yes.\n. We are switching to use CrowdIn to manage the translation process rather than merging pull requests directly, so you should register there to add your changes. http://crowdin.net/project/obsproject\nI can add you as a proofreader once you sign up so you will have the power to approve translations for Japanese.\nMore info: https://obsproject.com/forum/viewtopic.php?f=21&t=6538\n. I have added you as a proofreader in CrowdIn.\n. You might notice there are several blank files in this commit. The reason for this is simple: CrowdIn ends up downloading locale files for all languages in the project, including languages that have no translations yet. If we wanted to exclude these blank files, it would make the process of importing CrowdIn data a lot slower, since we have to delete the blank files before committing. Putting the blank files in now makes it faster and easier to get the new translations downloaded and pushed.\n. We don't take translation updates via pull request anymore, and haven't for some time. If you want to contribute translations, you should do so via the CrowdIn page. Details here: http://obsproject.com/forum/viewtopic.php?f=4&t=6538\n. Here is the translation page: https://crowdin.net/project/obsproject/ta\nThere should be a thread on the forums with more info, though I'm having trouble finding it at the moment.\n. I kind of feel like each scene collection should have its own global sources. Global sources aren't global in the sense that they are available to all scene collections, they are global in the sense that they are always loaded between scene transitions. I don't think it's useful to maintain all global sources between all scene collections, especially if that includes sources that aren't relevant to the current scene collection.\n. The point of global sources isn't to be a list of commonly-used sources though. It's a list of sources that you specifically want to make sure stay loaded between scene transitions, that's all. That list may change from scene collection to scene collection. There may also be \"commonly used sources\" that you don't want to stay loaded between scene transitions, such as with the LoL game capture bug in 0.625b (you want the game capture to be reinitialized every time you load the scene). Treating global sources as a handy list of common sources is not its intended design.\n. That is only if you are hosting a project to be translated. All contributors can contribute for free. Since we are an open source project, we can use it as a place to host our translations for free. \n. OBS Classic (this repo) is no longer in development. All development has moved over to OBS Studio (https://github.com/jp9000/obs-studio).\nAlso, even if that were not the case, there is a merge conflict with this PR.. Honestly, I don't recommend merging pull requests for translations anymore directly. It makes merging CrowdIn translations a lot more complicated, having to copy up the new translation files to keep things in sync.\nI need to show more people how to merge in CrowdIn data so that I'm not the only one who can do it.\n. The consequence of all translation going through one place is that translations take longer to get into github. Sure, it's not immediate, but as long as translations are merged before a new release or test, it's all good.\n. The content should have already been merged in from CrowdIn, so yes.\n. We are switching to use CrowdIn to manage the translation process rather than merging pull requests directly, so you should register there to add your changes. http://crowdin.net/project/obsproject\nI can add you as a proofreader once you sign up so you will have the power to approve translations for Japanese.\nMore info: https://obsproject.com/forum/viewtopic.php?f=21&t=6538\n. I have added you as a proofreader in CrowdIn.\n. You might notice there are several blank files in this commit. The reason for this is simple: CrowdIn ends up downloading locale files for all languages in the project, including languages that have no translations yet. If we wanted to exclude these blank files, it would make the process of importing CrowdIn data a lot slower, since we have to delete the blank files before committing. Putting the blank files in now makes it faster and easier to get the new translations downloaded and pushed.\n. We don't take translation updates via pull request anymore, and haven't for some time. If you want to contribute translations, you should do so via the CrowdIn page. Details here: http://obsproject.com/forum/viewtopic.php?f=4&t=6538\n. Here is the translation page: https://crowdin.net/project/obsproject/ta\nThere should be a thread on the forums with more info, though I'm having trouble finding it at the moment.\n. I kind of feel like each scene collection should have its own global sources. Global sources aren't global in the sense that they are available to all scene collections, they are global in the sense that they are always loaded between scene transitions. I don't think it's useful to maintain all global sources between all scene collections, especially if that includes sources that aren't relevant to the current scene collection.\n. The point of global sources isn't to be a list of commonly-used sources though. It's a list of sources that you specifically want to make sure stay loaded between scene transitions, that's all. That list may change from scene collection to scene collection. There may also be \"commonly used sources\" that you don't want to stay loaded between scene transitions, such as with the LoL game capture bug in 0.625b (you want the game capture to be reinitialized every time you load the scene). Treating global sources as a handy list of common sources is not its intended design.\n. That is only if you are hosting a project to be translated. All contributors can contribute for free. Since we are an open source project, we can use it as a place to host our translations for free. \n. OBS Classic (this repo) is no longer in development. All development has moved over to OBS Studio (https://github.com/jp9000/obs-studio).\nAlso, even if that were not the case, there is a merge conflict with this PR.. ",
    "remcoros": "it's what is in all the other project files, just copy/pasted.\n. and without it. building from the command line (using msbuild) fails.\n. it's what is in all the other project files, just copy/pasted.\n. and without it. building from the command line (using msbuild) fails.\n. ",
    "adocilesloth": "These should be fixed now.\n. Those are changed now as well.\n. Ok, I think I got it. Sorry it took so long.\n. These should be fixed now.\n. Those are changed now as well.\n. Ok, I think I got it. Sorry it took so long.\n. ",
    "spangleb": "Thanks Jim. Pretty sure I'm running the directshow plugin so surprised that didn't show up.\nThe JSON I'm parsing is straight out of a PHP website. It is on a single line - so using ',' as a seperator between name/value pairs. I put an example web API response in a comment.\nAre you okay with the concept here? It allows me to wire OBS into services like Brightcove where the stream URL and/or key rotates every 30 seconds (it allows them to manage capacity on the servers but makes it awkward for OBS users since they need to get their stream started quickly).\n. Just double checked this with previous XConfig and it doesn't parse. But it does parse with my changes. Its the comma separator that is the main issue. Previous parser also makes some assumptions on spacing before }. \n{\"data\":{\"stream_url\":\"rtmp://some_url\", \"stream_name\": \"some-name\"}}\nOr for ease of cutting an pasting into code:\nString test = \"{ \\\"data\\\":{\\\"stream_url\\\":\\\"rtmp://some_url\\\", \\\"stream_name\\\" : \\\"some-name\\\"} }\";\nI'll take a look into it not parsing your string - suspect it will if its in quotes - since I'm not sure it would count as valid JSON.\n. Hey - no problem. Changes to XConfig was the thing that scared me a little since it touches quite a bit of the code systems. I'll pull over your code and try things out. Much appreciated.\n. No probs. We’ll all busy. I did think this sort of thing could be handy to allow some OBS settings to be configured by a web interface. Perhaps need to put a little plan together.\nFrom: Jim [mailto:notifications@github.com]\nSent: 17 April 2014 00:17\nTo: jp9000/OBS\nCc: Dr Derek Marriott\nSubject: Re: [OBS] Able to pull RTMP stream URL and path/key from web service. (#324)\nsorry that this went under my rader. I will check it out.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/324#issuecomment-40663994.\n. Thanks - I was having a major fight with Git.\n. Thanks Jim. Pretty sure I'm running the directshow plugin so surprised that didn't show up.\nThe JSON I'm parsing is straight out of a PHP website. It is on a single line - so using ',' as a seperator between name/value pairs. I put an example web API response in a comment.\nAre you okay with the concept here? It allows me to wire OBS into services like Brightcove where the stream URL and/or key rotates every 30 seconds (it allows them to manage capacity on the servers but makes it awkward for OBS users since they need to get their stream started quickly).\n. Just double checked this with previous XConfig and it doesn't parse. But it does parse with my changes. Its the comma separator that is the main issue. Previous parser also makes some assumptions on spacing before }. \n{\"data\":{\"stream_url\":\"rtmp://some_url\", \"stream_name\": \"some-name\"}}\nOr for ease of cutting an pasting into code:\nString test = \"{ \\\"data\\\":{\\\"stream_url\\\":\\\"rtmp://some_url\\\", \\\"stream_name\\\" : \\\"some-name\\\"} }\";\nI'll take a look into it not parsing your string - suspect it will if its in quotes - since I'm not sure it would count as valid JSON.\n. Hey - no problem. Changes to XConfig was the thing that scared me a little since it touches quite a bit of the code systems. I'll pull over your code and try things out. Much appreciated.\n. No probs. We’ll all busy. I did think this sort of thing could be handy to allow some OBS settings to be configured by a web interface. Perhaps need to put a little plan together.\nFrom: Jim [mailto:notifications@github.com]\nSent: 17 April 2014 00:17\nTo: jp9000/OBS\nCc: Dr Derek Marriott\nSubject: Re: [OBS] Able to pull RTMP stream URL and path/key from web service. (#324)\nsorry that this went under my rader. I will check it out.\n—\nReply to this email directly or view it on GitHubhttps://github.com/jp9000/OBS/pull/324#issuecomment-40663994.\n. Thanks - I was having a major fight with Git.\n. ",
    "vulture": "You would still have the project file and an include file as slight differences regardless of the define; and the define as-is is set to use the new hooking method by default. So, take that into account if you decide to pull!\n. You would still have the project file and an include file as slight differences regardless of the define; and the define as-is is set to use the new hooking method by default. So, take that into account if you decide to pull!\n. ",
    "sztanpet": "localization is done through http://crowdin.net/project/obsproject\n. localization is done through http://crowdin.net/project/obsproject\n. ",
    "tk120404": "How to start the tamil language translation there?\n. tx. got it\n. How to start the tamil language translation there?\n. tx. got it\n. ",
    "LevelPulse": "No problem, glad i could help. This is my first pull request ever, never done one of these before :D\n. No problem, glad i could help. This is my first pull request ever, never done one of these before :D\n. ",
    "Glought": "I have removed the tabs but \"merge changes into previous commits, don't add \"fixes\" to later commits that change things which you introduced\" is confusing me i understand it when merging changes into commits i haven't pushed to github  ~~but I don't know what to do for the newer commit with the  changes replacing the tabs with spaces.~~\nI have pushed the commit \"removed tabs\"  or should i just close this pull request , delete my fork, refork and commit all my changed as one commit then do another pull request?  What should i do?  \n. I have cleaned up my commit I have removed changes i accidentally made. Mostly spaces and blank lines I added or removed by mistake.\n. I have removed unnecessary code and fixed several issues. Its is now bug free as I can see.\n. I was thinking the same thing about the method names too. Scene Layout sounds better so I'll go change the method names and \"scenes\" name under \"settings:General\"\n. I thought about Scene Set but i thought it would be confusing for the method names. Scene Collection make way more sense since the scene '.xconfigs' are collection of scenes. \nI'm thinking 'Scene Collection\" for the method names and 'Scene Set' for both the Menu name and The name for the scenes combo box under  'Settings:General'. What do you think?\n. Should I change the folder name where the scenes '.xconfigs' will be stored too?\n. I can't seem to reproduce the new bug you have found.\n. I'm getting the bug now ty \n. It only seems to crash when the global source is the only source in the list if I have another source it doesn't crash. \n. Other then the Global source bug it doesn't crash when switching collections while previewing for me.\n. I haven't gotten any incorrect sources when switching collections.\n. These bugs are so inconsistent  I'm not getting the Global source bug anymore and now sometimes get the incorrect sources. I'm having such a headache trying to figure out what is causing these bugs.\n. I have pushed the changes renaming the methods and the menu name to \"Scene Collection\". I can't seem to  reproduce the Global source bug and the incorrect sources bug anymore.\nAlso should I add both \"MainMenu.SceneCollection=\" and \"Settings.General.SceneCollection=\" to the rest of the locale files?\n. Yes you can right now its \"-scenes\" but I'm changing it to \"-scenecollection\".\n. I see Global sources as a set of commonly used sources for example Follower alerts,Subscriber alerts, Donations Alerts, Webcam ,etc. Having to remake theses types of sources can get annoying to do. \n. I see that now, the other way I thought of is having a \"Import\" button in the Global Sources dialog that imports Global sources from another scene collection into the current scene collections own Global sources.\n. I'm closing this because I have been working on the \"Import\" Global Sources idea.\n. I have fixed the spaced indentation issue.\n. The scenes.xconfig file outside the sceneCollection folder get overwritten depending on what scene collection was open last. Commit 8bfdd25 does this.\nThe issue that is happening is obs is not coping over your original scenes.xconfig to sceneCollection because the folder already has files. It only copies it over when the folder is empty. I hope you have a backup of your original scenes.xconfig just copy and paste it and overwrite the scenes.xconfig in  the sceneCollection folder. This issue only effects people that already have scene collections in the sceneCollections folder before commit 8bfdd25 was made .\n\"In general, wouldn't it be better if the import button would allow you to choose a file from which we could import the global sources?\" \nI thought of that but it got to complicated to code(I'll look into it a little more). \nI think it would be easier to understand if scenes.xconfig when obs copies it renames it to Main.xconfig since for new users it will be their first scene collection and for existing  users it will have their original scenes.xconfig contents. \n. I believe this is ready. I don't think there is anything else I can do to improve it anymore if there is let me know.\n. \"But one problem I noticed, you can rename the scenes.xconfig. And then the button will not work anymore.\" \nYa that is a issue I think changing  the name \"scenes\" to \"Main\" would be better and blocking it from being renamed and deleted.\n. I have resolved the conflict. I have also renamed \"scenes.xconfig\" when it is copied over to \"sceneCollection\\main.xconfig. I have also changed it so \"main.xconfig\" can't  be renamed or removed.\n@Jack0r  I have tried your suggested button order/naming but I can't seem it get part of the name to a newline \\n or \\r\\n doesn't seem to work with button names.\nI believe this is ready. \n. I'll change \"main.xconfig\" back to \"scenes.xconfig\" and I'll work on getting the Import button to be able to import from any scene collection.\nI'm sorry that I didn't work hard enough on it.\n. I'm able to have the import button list the scene collections then have each scene collection's Global sources listed in a sub menu but the issue is I can't seem to get it open a specific scene collection to import a Global source. \nI don't think it is possible to use popup menus. The other way I thought of is to have the Import button open a dialog with a combo box listing the scene collections and have a Listbox list the global sources from the selected scene collection. \nAny suggestions?\n. @Jack0r I got it working with a Open dialog so the user can open a scene collection file it is still listed in a popup menu(It appears where the cursor is). I may change that to a dialog window with a listbox that lists the global scenes. \nAlso what program are you using to make those mockup gui image? \n. I have updated my fork my changes are in the branch \" SceneCollectionGlobalSourcesImport\"\n. It might be possible to import several sources but I will just have to work on it to be 100% sure if it will work or not.\n. @Jack0r What do you think of this?\n\n. @Jack0r Good news I got it working Its using \"LBS_EXTENDEDSEL\" so your able to import multiple global sources by holding shift or ctrl and clicking on the ones you want to import or if you prefer I could change it to \"LBS_MULTIPLESEL\" users would just have to click on the global sources they want to import.\nI believe it is ready. Let me know if you have anymore suggestions. :) \n. Thank you for all the suggestions. :)  I just renamed some XElement variables like \"mainSceneGlobals\" to \"selectedGlobals\" and  \"mainSceneGlobalSources\" to \"selectedGlobalSources\"\nIt is ready.\n. Anyone have any suggestions?\n. @jp9000 I have renamed it \"Export Scene\" and I have the scene collections listed in a sub-menu.\n. Ya it just copies scenes to another scene collection. I'll just rename it back to \"Copy To\".\n. @jp9000 \n1. I have made it exclude the current scene collection.\n2. I have made it so a dialog opens asking the user if he/she wants to remove the references to the global sources. If the user clicks \"No\" he/she will need to import the Global sources into the target scene collection.\n. @Jack0r The references do get copied over when the user clicks no the user just needs to import the global sources to the scene collection the user copied the scene to.The references get removed if the users clicks yes\n. @Jack0r\n\"And how is the user supposed to import the global source later?\"\n My pull request #362 got merged  3 days ago.\nI might just change it so it will also import the Global sources to the target scene collection or open the \"Import Global Sources\" dialog.\nThe dialog message is asked even if there is no references to a global sources.\n. @Jack0r  I have changed it so it asks if  the user wants to also copy the global sources to the target scene collection if the user clicks \"No\" the references are removed from the copied scene.\nAlso I have changed it so the dialog only opens if there is references to Global sources in the copied scene.\n. If anyone else has suggestions let me know otherwise its ready.\n. I haven't merged the commit 16af67a to b80ba15 in case you want to keep the the Add/Rename/Remove in settings general. I didn't remove the profile Combo box because it is still useful when a user wants to switch to a different profile while in the settings dialog. \nI will merge them  if you do decide to merge this pull request.\n. I decided to merge the commits.\n. I have fixed the issue New now creates a new unmodified profile.\n. I had a feeling I missed something oops.\n. Ty for the suggestion I have changed it to what you have recommended.\n. I have removed the tabs but \"merge changes into previous commits, don't add \"fixes\" to later commits that change things which you introduced\" is confusing me i understand it when merging changes into commits i haven't pushed to github  ~~but I don't know what to do for the newer commit with the  changes replacing the tabs with spaces.~~\nI have pushed the commit \"removed tabs\"  or should i just close this pull request , delete my fork, refork and commit all my changed as one commit then do another pull request?  What should i do?  \n. I have cleaned up my commit I have removed changes i accidentally made. Mostly spaces and blank lines I added or removed by mistake.\n. I have removed unnecessary code and fixed several issues. Its is now bug free as I can see.\n. I was thinking the same thing about the method names too. Scene Layout sounds better so I'll go change the method names and \"scenes\" name under \"settings:General\"\n. I thought about Scene Set but i thought it would be confusing for the method names. Scene Collection make way more sense since the scene '.xconfigs' are collection of scenes. \nI'm thinking 'Scene Collection\" for the method names and 'Scene Set' for both the Menu name and The name for the scenes combo box under  'Settings:General'. What do you think?\n. Should I change the folder name where the scenes '.xconfigs' will be stored too?\n. I can't seem to reproduce the new bug you have found.\n. I'm getting the bug now ty \n. It only seems to crash when the global source is the only source in the list if I have another source it doesn't crash. \n. Other then the Global source bug it doesn't crash when switching collections while previewing for me.\n. I haven't gotten any incorrect sources when switching collections.\n. These bugs are so inconsistent  I'm not getting the Global source bug anymore and now sometimes get the incorrect sources. I'm having such a headache trying to figure out what is causing these bugs.\n. I have pushed the changes renaming the methods and the menu name to \"Scene Collection\". I can't seem to  reproduce the Global source bug and the incorrect sources bug anymore.\nAlso should I add both \"MainMenu.SceneCollection=\" and \"Settings.General.SceneCollection=\" to the rest of the locale files?\n. Yes you can right now its \"-scenes\" but I'm changing it to \"-scenecollection\".\n. I see Global sources as a set of commonly used sources for example Follower alerts,Subscriber alerts, Donations Alerts, Webcam ,etc. Having to remake theses types of sources can get annoying to do. \n. I see that now, the other way I thought of is having a \"Import\" button in the Global Sources dialog that imports Global sources from another scene collection into the current scene collections own Global sources.\n. I'm closing this because I have been working on the \"Import\" Global Sources idea.\n. I have fixed the spaced indentation issue.\n. The scenes.xconfig file outside the sceneCollection folder get overwritten depending on what scene collection was open last. Commit 8bfdd25 does this.\nThe issue that is happening is obs is not coping over your original scenes.xconfig to sceneCollection because the folder already has files. It only copies it over when the folder is empty. I hope you have a backup of your original scenes.xconfig just copy and paste it and overwrite the scenes.xconfig in  the sceneCollection folder. This issue only effects people that already have scene collections in the sceneCollections folder before commit 8bfdd25 was made .\n\"In general, wouldn't it be better if the import button would allow you to choose a file from which we could import the global sources?\" \nI thought of that but it got to complicated to code(I'll look into it a little more). \nI think it would be easier to understand if scenes.xconfig when obs copies it renames it to Main.xconfig since for new users it will be their first scene collection and for existing  users it will have their original scenes.xconfig contents. \n. I believe this is ready. I don't think there is anything else I can do to improve it anymore if there is let me know.\n. \"But one problem I noticed, you can rename the scenes.xconfig. And then the button will not work anymore.\" \nYa that is a issue I think changing  the name \"scenes\" to \"Main\" would be better and blocking it from being renamed and deleted.\n. I have resolved the conflict. I have also renamed \"scenes.xconfig\" when it is copied over to \"sceneCollection\\main.xconfig. I have also changed it so \"main.xconfig\" can't  be renamed or removed.\n@Jack0r  I have tried your suggested button order/naming but I can't seem it get part of the name to a newline \\n or \\r\\n doesn't seem to work with button names.\nI believe this is ready. \n. I'll change \"main.xconfig\" back to \"scenes.xconfig\" and I'll work on getting the Import button to be able to import from any scene collection.\nI'm sorry that I didn't work hard enough on it.\n. I'm able to have the import button list the scene collections then have each scene collection's Global sources listed in a sub menu but the issue is I can't seem to get it open a specific scene collection to import a Global source. \nI don't think it is possible to use popup menus. The other way I thought of is to have the Import button open a dialog with a combo box listing the scene collections and have a Listbox list the global sources from the selected scene collection. \nAny suggestions?\n. @Jack0r I got it working with a Open dialog so the user can open a scene collection file it is still listed in a popup menu(It appears where the cursor is). I may change that to a dialog window with a listbox that lists the global scenes. \nAlso what program are you using to make those mockup gui image? \n. I have updated my fork my changes are in the branch \" SceneCollectionGlobalSourcesImport\"\n. It might be possible to import several sources but I will just have to work on it to be 100% sure if it will work or not.\n. @Jack0r What do you think of this?\n\n. @Jack0r Good news I got it working Its using \"LBS_EXTENDEDSEL\" so your able to import multiple global sources by holding shift or ctrl and clicking on the ones you want to import or if you prefer I could change it to \"LBS_MULTIPLESEL\" users would just have to click on the global sources they want to import.\nI believe it is ready. Let me know if you have anymore suggestions. :) \n. Thank you for all the suggestions. :)  I just renamed some XElement variables like \"mainSceneGlobals\" to \"selectedGlobals\" and  \"mainSceneGlobalSources\" to \"selectedGlobalSources\"\nIt is ready.\n. Anyone have any suggestions?\n. @jp9000 I have renamed it \"Export Scene\" and I have the scene collections listed in a sub-menu.\n. Ya it just copies scenes to another scene collection. I'll just rename it back to \"Copy To\".\n. @jp9000 \n1. I have made it exclude the current scene collection.\n2. I have made it so a dialog opens asking the user if he/she wants to remove the references to the global sources. If the user clicks \"No\" he/she will need to import the Global sources into the target scene collection.\n. @Jack0r The references do get copied over when the user clicks no the user just needs to import the global sources to the scene collection the user copied the scene to.The references get removed if the users clicks yes\n. @Jack0r\n\"And how is the user supposed to import the global source later?\"\n My pull request #362 got merged  3 days ago.\nI might just change it so it will also import the Global sources to the target scene collection or open the \"Import Global Sources\" dialog.\nThe dialog message is asked even if there is no references to a global sources.\n. @Jack0r  I have changed it so it asks if  the user wants to also copy the global sources to the target scene collection if the user clicks \"No\" the references are removed from the copied scene.\nAlso I have changed it so the dialog only opens if there is references to Global sources in the copied scene.\n. If anyone else has suggestions let me know otherwise its ready.\n. I haven't merged the commit 16af67a to b80ba15 in case you want to keep the the Add/Rename/Remove in settings general. I didn't remove the profile Combo box because it is still useful when a user wants to switch to a different profile while in the settings dialog. \nI will merge them  if you do decide to merge this pull request.\n. I decided to merge the commits.\n. I have fixed the issue New now creates a new unmodified profile.\n. I had a feeling I missed something oops.\n. Ty for the suggestion I have changed it to what you have recommended.\n. ",
    "BtbN": "Translations are handled via CrowdIn:\nhttps://crowdin.com/project/obsproject\n. Yes, i split the specific commit out in a second PR. It was merged for some reason, even though it doesn't look like the underlying sync issue was addressed: https://github.com/jp9000/OBS/pull/459\n. This broke stuff for a lot of people. Would it be possible to revert the merge and release a hotfix?\nWas just sitting in a stream that ended up with no video from Twitch, and after all NVENC was the reason for it.\n. Translations are handled via CrowdIn:\nhttps://crowdin.com/project/obsproject\n. Yes, i split the specific commit out in a second PR. It was merged for some reason, even though it doesn't look like the underlying sync issue was addressed: https://github.com/jp9000/OBS/pull/459\n. This broke stuff for a lot of people. Would it be possible to revert the merge and release a hotfix?\nWas just sitting in a stream that ended up with no video from Twitch, and after all NVENC was the reason for it.\n. ",
    "ho-ho-ho": "If I understand correctly, this only applies to the APIInterface class functions, right ?\nThe event reporting functions in the OBS class for example will cause no breaking as the OBS and OBSApi projects are always build together. ( I oriented myself on how the Replay Buffer API was implemented )\nThen this commit should fix it completely.\n. If I understand correctly, this only applies to the APIInterface class functions, right ?\nThe event reporting functions in the OBS class for example will cause no breaking as the OBS and OBSApi projects are always build together. ( I oriented myself on how the Replay Buffer API was implemented )\nThen this commit should fix it completely.\n. ",
    "hanasu": "What would you suggest instead?\n. What would you suggest instead?\n. ",
    "RoyHP": "The English is probably fine.\n. The English is probably fine.\n. ",
    "progre": "thanks for suggestion. i created new issue in crowdin: https://crowdin.com/translate/obsproject/13/enus-ja\n. thanks for suggestion. i created new issue in crowdin: https://crowdin.com/translate/obsproject/13/enus-ja\n. ",
    "alex8b": "Fixed the whitespaces. And removed the translations.\n. Fixed the whitespaces. And removed the translations.\n. ",
    "Sheep-y": "Another site to register, just because of a few lines. (sigh)\nThe crowdin's plan page seems to suggest that I only have 10 days of free usage once I register?\n. Another site to register, just because of a few lines. (sigh)\nThe crowdin's plan page seems to suggest that I only have 10 days of free usage once I register?\n. ",
    "KallDrexx": "I have noticed OBS-Studio adding a bunch more services with the new show all commit that was done.\nIf I redo this pull request for obs-studio would it still get rejected?  We have a lot of users that use OBS so that htey can use us to multi-stream to twitch, hitbox and other uses, and I think this would be beneficial.\n. I have noticed OBS-Studio adding a bunch more services with the new show all commit that was done.\nIf I redo this pull request for obs-studio would it still get rejected?  We have a lot of users that use OBS so that htey can use us to multi-stream to twitch, hitbox and other uses, and I think this would be beneficial.\n. ",
    "zeeboguy": "will do, thanks for response\n. will do, thanks for response\n. ",
    "ElectronicWar": "Closed in Reference to #415 \n. Closed in Reference to #415 \n. ",
    "kokarn": "This will be closed, see #415 for reference\n. This will be closed, see #415 for reference\n. ",
    "shughes-uk": "Forgot to set my settings in VS! Should be fixed now, caught some other ones too.\n. Forgot to set my settings in VS! Should be fixed now, caught some other ones too.\n. ",
    "ElPumpo": "From Visual Studio 2015 +\nIndicates that the application is DPI-aware and will not be automatically scaled by Windows at higher DPIs. Windows Presentation Foundation (WPF) applications are automatically DPI-aware and do not need to opt in. Windows Forms applications targeting .NET Framework 4.6 that opt into this setting, should also set the 'EnableWindowsFormsHighDpiAutoResizing' setting to 'true' in their app.config\n. From Visual Studio 2015 +\nIndicates that the application is DPI-aware and will not be automatically scaled by Windows at higher DPIs. Windows Presentation Foundation (WPF) applications are automatically DPI-aware and do not need to opt in. Windows Forms applications targeting .NET Framework 4.6 that opt into this setting, should also set the 'EnableWindowsFormsHighDpiAutoResizing' setting to 'true' in their app.config\n. ",
    "Gitoffthelawn": "It would be ideal if OBS differentiates between the two cases: live and recording.  That way, it can deliver the appropriate message to the user.\nI am not a proponent of \"are you sure\" phrases within UI's.\nI recommend:\n     OBS is currently sending a live stream.\nDo you want to stop the live stream and exit OBS?\nand\n    OBS is currently recording.\nDo you want to stop recording and exit OBS?\n. You're welcome.  Feel free to post any UI or UX questions.  I'll do my best to answer them as time permits.\n. It would be ideal if OBS differentiates between the two cases: live and recording.  That way, it can deliver the appropriate message to the user.\nI am not a proponent of \"are you sure\" phrases within UI's.\nI recommend:\n     OBS is currently sending a live stream.\nDo you want to stop the live stream and exit OBS?\nand\n    OBS is currently recording.\nDo you want to stop recording and exit OBS?\n. You're welcome.  Feel free to post any UI or UX questions.  I'll do my best to answer them as time permits.\n. ",
    "ghost": "Hello. I make 2 files via https://obsproject.com/services/add , fist (ReAll) without settings, and its file not work (make OBS crash), second (reall.tv) with settings - works correctly, can u add to public service from second file? Thank You.\n. Can You add our stream settings to default installation of OBS? \n. Hello. I make 2 files via https://obsproject.com/services/add , fist (ReAll) without settings, and its file not work (make OBS crash), second (reall.tv) with settings - works correctly, can u add to public service from second file? Thank You.\n. Can You add our stream settings to default installation of OBS? \n. ",
    "super999": "ok,i'd like to .\n. ok,i'd like to .\n. ",
    "sam8641": "This changes suppose to be changing only the dshow, not quicksync code.\nAs for whitespaces, I was doing a blind replace all tabs to spaces, the whitespace changes was a tab.\nMight be ok to just close this for now as my code is just kindof messy.\n. This changes suppose to be changing only the dshow, not quicksync code.\nAs for whitespaces, I was doing a blind replace all tabs to spaces, the whitespace changes was a tab.\nMight be ok to just close this for now as my code is just kindof messy.\n. ",
    "sir-ragna": "You should probably add pull requests #461 and #460  into one and provide a title and a description.\nAt line https://github.com/jp9000/OBS/pull/460/files#diff-c15ccc4d9faddaa53a2bae673a42575aR1431 you call malloc but you don't call free in the same scope. Don't you introduce a memory leak by that? (I'm asking as I don't write C++ myself.)\n. You should probably add pull requests #461 and #460  into one and provide a title and a description.\nAt line https://github.com/jp9000/OBS/pull/460/files#diff-c15ccc4d9faddaa53a2bae673a42575aR1431 you call malloc but you don't call free in the same scope. Don't you introduce a memory leak by that? (I'm asking as I don't write C++ myself.)\n. ",
    "jackun": "Yes. Also sizeof there gives the pointer size, not array's. sizeof(char) == [ 4 || 8 ] depending on cpu architecture. Correct would be to just use char array[64]; but it looks like dead code anyway.\n. Yes. Also sizeof there gives the pointer size, not array's. sizeof(char) == [ 4 || 8 ] depending on cpu architecture. Correct would be to just use char array[64]; but it looks like dead code anyway.\n. ",
    "Heufneutje": "Not to mention this part of the README:\n\nOutside of simple and specific bug fixes, pull requests for this version of OBS are unlikely to receive review - we encourage you to spend your time developing for OBS MP instead.\n. Not to mention this part of the README:\nOutside of simple and specific bug fixes, pull requests for this version of OBS are unlikely to receive review - we encourage you to spend your time developing for OBS MP instead.\n. \n",
    "notmark": "Yes to be compatible with WebRTC playback. . My own extensive testing. If you don't use baseline then you get severely choppy playback in the browser. The only time I didn't experience that is encoding H.264 with HVENC, but I'm assuming that is using baseline as well. . You would think it wouldn't, but baseline is the only profile that gives smooth playback. . Yes to be compatible with WebRTC playback. . My own extensive testing. If you don't use baseline then you get severely choppy playback in the browser. The only time I didn't experience that is encoding H.264 with HVENC, but I'm assuming that is using baseline as well. . You would think it wouldn't, but baseline is the only profile that gives smooth playback. . ",
    "derrod": "Edit: Seems that was wrong, I misremembered something.\nIt seems that baseline should be supported by all WebRTC clients that support H.264, while high remains a \"SHOULD\" according to this RFC: https://tools.ietf.org/html/rfc7742#section-6.2\nBeam.pro also limits you to baseline for WebRTC (FTL) streaming because they probably encountered the same issues. It might also just be a limitation of some browsers (e.g. firefox) though I haven't tested that.. Edit: Seems that was wrong, I misremembered something.\nIt seems that baseline should be supported by all WebRTC clients that support H.264, while high remains a \"SHOULD\" according to this RFC: https://tools.ietf.org/html/rfc7742#section-6.2\nBeam.pro also limits you to baseline for WebRTC (FTL) streaming because they probably encountered the same issues. It might also just be a limitation of some browsers (e.g. firefox) though I haven't tested that.. ",
    "Poliwrath": "ok. ok. "
}