{
    "kattrali": "Awesome! Thanks!\n. That is definitely my thought as well. Maybe trigger the \"Create Podfile?\" dialog from \"Integrate Pods\" as well. \n. @alloy Hmmm, I see your point. Handling only \"Edit Podfile\" is simpler as well.\n. Thanks for the contribution!\n. Awesome, thanks! Kiwi is great for this kind of testing.\n. Oh shucks, I just pushed something for this. Awesome work though, I think I could migrate in the tests still.\n. @brennanMKE Oh, maybe we have a bit of a naming issue. \"Install/Update CocoaPods\" is supposed to install/update the cocoapods gem, while \"Update Pods in Podfile\" (pod update) is for installing the latest versions of all pods in the Podfile not locked to a particular version. There is currently no \"Update Pods in Podfile\" command in master.\n. @brennanMKE pod update ignores the versions specified in the Podfile.lock and rewrites the file with the latest versions of pods without a specified version in the Podfile\n. Awesome work, thanks!\n. Nicely done! :+1: :beers: \n. Fixed.\n. Given this setup, it shouldn't be necessary to install cocoapods at all, since it's being bundled into the distribution. If you see a good approach by blessing the job and continuing to do an external installation of cocoapods, I'm open to that as well. Not requiring the user to install it at all is eventually what I think this project should do.\n. Agreed! Thank you!\n. Thanks for your work on this, and I apologize for the late reply. To make this as flexible as possible, the latest version of the plugin includes support for specifying a custom path to your CocoaPods installation. It can now be updated in the menu via Product > CocoaPods > Gem Path\n. This is awesome! I'm sorry it took so long to get back to this. Things have been busy. :smile: \n. Thanks! :beers: \n. Whoa! This is awesome! I'll give it a look tomorrow and try to get it merged in. :+1: \n. @priteshshah1983 Hello! I am sorry about the delay. Too much going on at once. :smile: There are a few small tweaks to be made, but it looks good. I'll update soon!\n. I was certain that I merged this already. o.o I'm so sorry about this, I've been running it locally for months.\n. :+1: \n. This is perfect! :)\n. Thanks!\n. Looks good! Just the one change and I'll bring it in.\n. Merged! Thank you!\n. Looks alright, the only change I think necessary is to keep the license headers the same as the license file, for consistency.\n. > You might want to add an Acknowledgements or Core Contributors section to the README to make contributions from larger contributors more visible.\nNoted. For now, there is not a particularly large number of contributors, and as they are sorted by the size of the contribution, a link to the generated list will do. Thank you!\n. Looks good :) Thanks!\n. Thanks!\n. Thanks!\n. The plist change is good, but could you remove the binary file? I'm not sure what it is for.\n. Looks good, thanks!\n. Thanks!\n. Looks good, thanks!\n. Thanks!\n. Thank you for the contribution, @xiongcaichang. I took a slightly different approach to fixing this, by adding a separate mode for running pod offline. This handles your use case as well as adding support for pod outdated without adding a new menu item for each one.\n. > the mac gem_path default value is /usr/local/bin also have updated.\nThis is a good change, though I'm more comfortable making it in a separate request.\n. To use \"Offline Mode\", select \"Update and Install Offline Only\" from the menu.\n. I think this should be a little more user-friendly, maybe \"Update Pods (Offline only)\"\n. ",
    "alloy": "I’m thinking it would be nicer if ‘Edit Podfile’ would still be enabled and would create the Podfile if it doesn’t exist yet. (Or possibly change the caption to ‘Create Podfile’ in that case.)\n. I was going to say that at first, but that would make the actions triggered by that menu item inconsistent and thus confusing.\n- When there’s no Podfile: it creates it and allows you to edit it, but it does not perform any installation.\n- When there’s a Podfile: it does not allow you to edit it and it does perform an installation.\n. ",
    "orta": ":+1: \n. :clap: \n. Looks good to me, and I have push access, thus, pushing.\n. ",
    "modocache": "Whoops, looks like I hadn't kept up with changes on master. This is outdated.\n. ",
    "brennanMKE": "@kattrali That makes sense. I will make sure that I pull the latest on master to my fork and put it on a branch for this update. I can organize the various commands. \nHere are the current commands.\n- Integrate Pods (pod install)\n- Check for Outdated Pods (pod outdated)\n- Created/Edit Podfile\n- Create/Edit Podspec\n- Install/Update CocoaPods (gem install cocoapods)\n- Install Docs during Integration \nI am not clear on the difference between pod install and pod update since I run those interchangeably and do not know the difference. It would help to make the difference clear.\n. Thanks for letting me know. I will check this out later tonight.\n. I've forked the code and ran the build instructions. I'd like to put together the necessary calls to SMBlessJob and a agent process which can call execute the necessary shell commands so that gem install cocoapods can be run successfully and prompt the user from within Xcode to authorize the action. I am not sure if I will run into any issues, but I will give it a try to see what happens.\nSound good?\n. I agree with that. I don't want to touch Ruby at all if possible as an iOS/Mac developer. I am still interested in learning about Xcode plugin development and using SMBlessJob. I will be putting something together this weekend to show what could be done. On Tuesday I will be presenting what I have learned to the local NSCoder Nights group. I would also like to create a plugin which manages collections of snippets. I have my collection on GitHub and have a way to manage it via the command-line. A plugin as well as a manager run from Xcode could be helpful.\n. I won't need SMBlessJob for managing snippets, but another Xcode plugin may need to raise privileges for another purpose, liking managing the Hosts file. I will publish it on GitHub once I have something to share.\n. @kattrali I've made a minor change to the menu.\n. ",
    "martinrybak": "+1\npod update and pod install have different behaviors:\nhttps://github.com/CocoaPods/CocoaPods/issues/2229\nThanks for a great plugin!\n. ",
    "DenTelezhkin": "This also seems like a more clean solution for #22 and #23 \nSummoning @kattrali , what do you think? =)\n. ",
    "aelam": "\n. ",
    "priteshshah1983": "Hi @kattrali,\nDid you get a chance to review this PR?\nThanks,\nPritesh.\n. ",
    "pjaillon": "Hi @kattrali,\nFirst thank you for this awesome Xcode plugin!\n+1 for @priteshshah1983's PR. He showed it to me and I really liked it.\nThanks!\nPascal\n. Great! Thanks!\n. ",
    "markeissler": "Hi. I updated the (c) header to point to you in the two new files. You might want to add an Acknowledgements or Core Contributors section to the README to make contributions from larger contributors more visible. I know there's a \"Contributors\" button on github but it kind of just lumps everything together. I did add a LICENSE section to the README as it is good practice to do so.\n. ",
    "linked67": "commit please\n. ",
    "942v": "+1\n. ",
    "NSCabezon": ":+1: \n. ",
    "4brunu": "+1\n. ",
    "Eveian": "Ok. Sorry. I'm unfamiliar with github.\n. ",
    "xiongcaichang": "the  first version  just can give a update   support for pod outdated   but bot install  for pod outdated. at my last version.I renamed it as   Install pod(Offline only). and the   mac  gem_path default value is /usr/local/bin  also have updated.\n. ",
    "qzs21": "That great.\n. "
}