{
    "bruno-": "yes please :+1: \n. ",
    "VinSpee": "This would be ideal\n. ",
    "rmoriz": "It probably won't work on OSX as it relies on gnome and X\n. ",
    "tckmn": "Unfortunately this will not work on OS X, since it's using xdpyinfo, wmctrl, etc. I don't have access to any OS X machines, but do feel free to suggest a pull request that makes it work!\n. Done! newcast now finishes recording when the terminal it spawns exits. Thanks for the idea!\n. Are you sure you have a window open with the title \"Terminal\"?\n. It's saved as out.gif in the directory from which you run it.\n. Sorry, the example was outdated (-c no longer exists). Try:\n$ mkcast Terminal 10\nor\n$ newcast\n. gnome-terminal is not a hard requirement. It works perfectly fine for casting, say, a web browser as long as you feed it the right title.\n. That file can easily be changed. Or you can just use mkcast instead of the convenience askcast script.\n. Ugh... I wanted this to be GIF-only, but fine. New syntax:\n$ newcast -o out.webm  # also supports ogg/ogv\n. Thanks, this is fixed now.\n. Thanks, not sure how I missed that.\n. OS X support is not currently planned.\n. Fixed via your own pull request (thanks!).\n. So don't run it twice? That's why it's called a \"setup.\"\n. No worries, my fault for not checking over the pull request closely enough ;) Thanks!\n. ",
    "buzzbo": "OK I didn't realize we needed an existing terminal with a title. It appears to have been successful (no errors) but where is the gif file?\n. yeah...I don't find out.gif in the current directory.\n. OK I'm in Mint 17.1 with mate and so I replaced gnome-terminal with mate-terminal which appears to progress, but I get this output in the original window like 'kill' was not used correctly: \nUsage:\n kill [options] <pid> [...]\n...etc\n. ",
    "comster": "On ubuntu 14.04\nmkcast$ ./mkcast Terminal 10 -o out.gif\n./mkcast: line 59: 2340/2-/2: syntax error: operand expected (error token is \"/2\")\n./mkcast: line 60: 1440-: syntax error: operand expected (error token is \"-\")\nmkcast$ sudo ./newcast\nThe last one opens a terminal, but seems to return right away.  No out.gif\nEDIT: installing all the deps fixed this for me, on ubuntu: \nsudo apt-get install wmctrl byzanz -y\n. ",
    "mrchimp": "I'm getting this same error in Terminator on Xubuntu.\nIt seems that $ww, $wh, $wx and $wy are empty/undefined when using newcast.\nI think this might be related to #10 .\n. ",
    "bogdanr": "In this file it's a hard requirement:\nhttps://raw.githubusercontent.com/KeyboardFire/mkcast/master/newcast\n. ",
    "JaredCubilla": "+1\n. ",
    "brunowego": "+1\n. :+1: \n. ",
    "Kiniamaro": "+1\n. ",
    "allisonmachado": "Yes, I would like to help translating it to Portuguese!\n. ",
    "ruslanosipov": "+1 on this. I just moved my mkcast and newcast to $HOME/bin.\n. True, it returns Cannot open display.. The issue seem to be specific to terminator - it works in default gnome terminal. Would be nice to expand support to terminator.\n. ",
    "TheHippo": "Had the same issue with Ubuntu 14.04.\n. ",
    "davidlowryduda": "This indicates that the $wx is empty. To confirm, you might try to type\n$ wmctrl -l\nIt seems extremely likely to me that you will get an error about now receiving window properties. To fix, you would either need to find a different way of getting the dimensions of your window, or hardcode the byzanz-record call in mkcast.\n. I should also note that I must have a setting which removes some trailing whitespace in python, and many of the changes in the diff are simply a trailing white character being removed. I hope you don't mind.\n. ",
    "Aetet": "Same issue for xfce4-terminal 0.6.3\n. ",
    "sahat": "Same issue on Mac OS X 10.10 and Fish terminal.\nbash\n➜ ~ cd mkcast\n➜ mkcast git:(master) ✗ newcast\n/usr/local/bin/mkcast: line 55: xdpyinfo: command not found\n/usr/local/bin/mkcast: line 57: wmctrl: command not found\n/usr/local/bin/mkcast: line 59: /2-/2: syntax error: operand expected (error token is \"/2-/2\")\n/usr/local/bin/mkcast: line 60: -: syntax error: operand expected (error token is \"-\")\n/usr/local/bin/mkcast: line 61: wmctrl: command not found\nreadlink: illegal option -- f\nusage: readlink [-n] [file ...]\n➜ mkcast git:(master) ✗ kill: 6082: No such process\n. ",
    "jghibiki": "same issue on arch linux with urxvt 256 colors, xterm, and gnome-terminal\n. ",
    "mmccoy37": "I have one screen on Debian Jessie and have this problem. \n\n. ",
    "p-v": "Sadly, this is because of the browser window opened in the background which has mkcast tab opened. \n. ",
    "morenoh149": ":+1: osx\n. surely we can investigate how hard it would be to add support. Then determine if it's too hard and say it's not supported. @nickdesaulniers @tdlm What wmctrl features are used? if it's just window positioning there are other solutions http://superuser.com/questions/679149/is-there-any-wmctrl-alternatives-on-os-x\nI'm not a fan of applescript but have been fiddling with it since yosemete added javascript for automation support\nyou could install wmctrl via brew via the x-11 homebrew tap https://github.com/Homebrew/homebrew-x11\nif I get it working I'll report back :8ball: \n. @tdlm what's that trying to do? open xquartz?\nhere's the output of xpdyinfo on my machine https://gist.github.com/morenoh149/f5a72da5b9ead46bc3e4 if you look at the bottom I also run the grep dimension.\nThe regex here https://github.com/KeyboardFire/mkcast/blob/ece3dba8480ea218106b03b5ef6fe746aa1a1c90/mkcast#L55 could be modified to get the dimensions correctly. @KeyboardFire what is the output of xdpyinfo | grep dimensions on a typical linux machine. Once we compare we can change the regex to get the right info.\n. @tdlm @nickdesaulniers could you test this line works on your machine echo '    dimensions:    1440x877 pixels (381x232 millimeters)' | awk '{print $2}' if so I'll submit a pull request\n. lol this'll never work on osx due to the dependency on gnome-terminal. It was fun diving into xquartz anyway. @tdlm I got output from wmctrl but you need to run it within a terminal that's launched by xquartz \n\n. yeah not sure how this software works but my guess is it finds the window and targets some screen capturing software. Then translates the video to a gif.\nWould be cool to make gifs from the output of http://unixhelp.ed.ac.uk/CGI/man-cgi?script Not sure if it's possible.\nupdate: uses Byzanz-record so it's screen to gif directly.\n. ",
    "nickdesaulniers": "+1 would use on OSX\n. ",
    "tdlm": "@morenoh149 \nSo I installed wmctrl via homebrew and attempted to run it again.\nbash\n➜  ~  newcast\nxdpyinfo:  unable to open display \"/private/tmp/com.apple.launchd.a93K09UjyA/org.macosforge.xquartz:0\".\nCannot open display.\n/usr/local/bin/mkcast: line 59: /2-/2: syntax error: operand expected (error token is \"/2-/2\")\n/usr/local/bin/mkcast: line 60: -: syntax error: operand expected (error token is \"-\")\nCannot open display.\nreadlink: illegal option -- f\nusage: readlink [-n] [file ...]\n➜  ~  kill: 289: No such process\nObviously there's no magic bullet for this one. I think you're right about needing to use AppleScript unfortunately.\n. @morenoh149 Bummer, but thank you for looking into that.\n. ",
    "domenkozar": "+1\n. ",
    "tuminoid": "Yup, in 14.04 invoking newcast says:\n~$ newcast\n~$ Wrong option: Unknown option -0\nusage: byzanz-record [OPTIONS] filename\n       byzanz-record --help\n. ",
    "aviau": "Same issue here!\n. ",
    "NLKNguyen": "I got the same problem. This one still works though:\n$ mkcast Terminal 10 -o out.gif\n. ",
    "qinshulei": "Same issue \n. ",
    "dylanaraps": "Also getting this. \n. "
}