{
    "mikeerickson": "Oops, hit send too soon (here is the actual command line)\n\nphp artisan make:migration:schema create_dogs_table --schema=\"type:string:unique, gender:boolean\"\n\n. @slayerfat not sure what happened there (appears with in Droplr admin)?\nat any rate, I cant reproduce issue now (all is working as expected) so I am gonna close this puppy \n. Remove quotest, call as\ncomposer require laracasts/generators\n. So we are within a month of the release of Laravel 5.5 and this subject is still active.\nSeems as though this project is going the way of deprecation if you ask me.. ",
    "slayerfat": "next time, you can edit your message to append the missing code.\nanyway, the error link is 404, link again\n. ",
    "laracasts": "\"Excerpt\" was correct.\n. Yeah - haven't heard of any others with this issue..\n. You need to do a composer update to get the latest version of Laravel.\n. Not sure what you mean.\n. Yeah - it's tough. I need some kind of split point for the regular expression. I've spent a lot of time trying to find a way to make this optional, but no dice.\nThe primary issue is that you can do:\n--schema=\"username:string, age:integer\"\nIf it were just this, then we could make the ,[space] optional. But the user can also pass arguments:\n--schema=\"username:string, amount:decimal(1,2)\nSo, if somebody knows how to split that up into chunks, while allowing no spaces between each field:column,  please do let me know. I haven't been able to figure out how. \nThe regex would need to give me, using the example above, an array with two items:\n- username:string\n- amount:decimal(1,2)\n. So this is fixed and merged now.\nThanks, all.\n. Great work!! Thanks so much.\n. Whatever is most common, I'm fine with.\n. user_id:integer:unsigned:foreign\n. I'll merge this, and then add the spaces around the ! back in.\n. What is the need for this?\n. You're supposed to pass the names of the two tables as arguments. So that's expected behavior.\n. Have you done a composer update lately? I've used this command countless times and have never seen that.\n. Wrong package. You want the Laravel 4 Generators package.\n. Hmm - only thing is that it's not really related to the process of generating files at all.\n. ",
    "rattfieldnz": "Did you use Composer to create your Laravel app, or Laravel's own app creating tool? I created a test project with Laravel's tool, issued your 'composer require ...' command, and didn't see any errors at all. I only came across this yesterday so I can't give anything definitive - I'm not sure if the laracasts generators require any special dependencies of some sort.\nHere's a screenshot of the test project creation, with your composer command:\n\n. ",
    "enigmatic-user": "Same problem here, see screenshot. I tried it on a Windows 7 machine.\n\nOmitting the single quotation marks (I had copied the complete line from the readme page) lead to success. Maybe it would be good to change this in the readme.md.\n. Hm, isn't that what I wrote above?  ;)\n. ",
    "thanhquang1988": "Please change :\ncomposer require 'laracasts/generators'\nto :\ncomposer require \"laracast/generators\"\n. ",
    "lesterfibla": "I have the same issue in my win7+xampp\nLaravel install 10 minutes ago (then, i have the v5) via composer\n. Perfect!!!\nWithout the quotes its works perfect.\nThanks\n. ",
    "slavensaka": "Changing:\ncomposer require 'laracasts/generators' \nto :\ncomposer require \"laracast/generators\"\nWorks perfectly!\n. ",
    "rdharma": "Thank you all for your help.\n. Remove the quotation marks. Use it like this composer require laracasts/generators --dev\n. ",
    "keithmclaughlin": "I also got the error mentioned above and did not pass the -no-migration either.\nPHP\nMigration created successfully.\nexception 'InvalidArgumentException' with message 'The \"--no-migration\" option does not exist.' in C:\\wamp\\www\\laravel-5\\vendor\\symfony\\console\\Symfony\\Component\\Console\\Input\\ArrayInput.php:177\n. ",
    "sukonovs": "Kinda partly revelant question, do I need to for fork repo for this in github? Or there was option to change this in \"laracasts/Laravel-5-Generators-Extended\" directly?\n. ",
    "kadeprice": "That's how it was with the L4 Generator. I assume the script knows it's a new line because there is a space. You can't do it on the comma because then this wouldn't work \n--schema=\"amount:double(15,2), customer_id:integer:index, customer_id:foreign:references('id'):on('customers'):onDelete('cascade')\"\nIt would start a new line at (15,2). So the space is how it knows to start a new column.\n. ",
    "BrandonSurowiec": "I did some searching and found how to separate using commas, as long as they weren't in parenthesis. Did some testing and this works for me:\n$preg_split = preg_split('/,(?![^()]*+\\\\))/', $schema);\nreturn array_map(\"trim\", $preg_split);\nI had to run trim on the array to get rid of the spaces that may appear in front when using commas and spaces.\n[ I added a pull request: https://github.com/laracasts/Laravel-5-Generators-Extended/pull/9 ]\n. You're welcome, glad to help!\n. Fair enough. That's why I wanted to ask. Thanks!\n. You do it like this:\nmake:migration:schema add_password_to_users_table --schema=\"password:string(60)\"\n. ",
    "binalfew": "Yeah, the generator command is now working even without a space after the comma. Awesome!!\n. ",
    "zoransa": "Hey!\nYes this command should do composer dump-autoload -o by default and have switch no-dump-autoload to turn it off\n. ",
    "phillipsharring": ":thumbsup:\n. BTW, \"unsigned\" is also the 3rd argument to integer. You can do:\n$table->integer('user_id', false, true);\n. ",
    "hendrikusR": "\ni have problem with composer dump-autoload, how i solve?\n. ",
    "Shentia": "i just use\n composer dump-autoload -o\nand work fine.\nGenerating optimized autoload files\n. ",
    "Michal-sk": "This is an older issue, but i would agree that if there would be an option to auto run the optimized dump-autoload after update or install, i would enable it.. ",
    "Mythos": "IMHO a primary key out of FK1 and FK2 would be best.\nLike users_groups:   PRIMARY(user_id, group_id)\nAt the moment you can add the same entry multiple times which does not make sense to me.\n. Please correct that indentation.\n. ",
    "etenzy": "Thanks to @vinkla for commiting.\nCurrently i don't have the ability for pushing code up to github...\nI've testet different cases:\nPRIMARY(user_id, group_id) will end up with:\n'Illuminate\\Database\\QueryException' with message 'SQLSTATE[23000]: Integrity constraint violation: 1062 Duplicate entry 'xxx-xxx' for key 'PRIMARY\nUNIQUE(user_id, group_id) results similar...\nWithout checking the relation before inserting you will have two options:\n1. Use an incremented id field as primary key & no UNIQUE(user_id, group_id) key and get along with duplicates\n2. try/catch every save/attach on every many to many relation...\nso...\nThe most open way is adding an incremented id field as primary key as default.\nIf you want to avoid duplicates just add an UNIQUE key and try/catch everything\n. ",
    "darkponyhq": "Thanks Jeff, this works but still, documentation needs updating. It is misleading.\nhttps://github.com/laracasts/Laravel-5-Generators-Extended#foreign-constraints\nanyhow, since foreign keys mainly (if not always) match primary keys, this could have been pre-setted without the need of the :unsigned flag.\n. Same as issue https://github.com/laracasts/Laravel-5-Generators-Extended/issues/12\nThe solution is: user_id:integer:unsigned:foreign\nDocumentation needs updating, but anyhow I would prefer to have this automated even without the unsigned option, it makes sense, doesn't it?\n. ",
    "RomainLanz": "If you use the command with singular table name relations will be wrong.\nphp artisan make:migration:pivot user post\nwill create\n$table->integer('post_id')->unsigned()->index();\n$table->foreign('post_id')->references('id')->on('post')->onDelete('cascade');\n$table->integer('user_id')->unsigned()->index();\n$table->foreign('user_id')->references('id')->on('user')->onDelete('cascade');\ninstead of\n$table->integer('post_id')->unsigned()->index();\n$table->foreign('post_id')->references('id')->on('posts')->onDelete('cascade');\n$table->integer('user_id')->unsigned()->index();\n$table->foreign('user_id')->references('id')->on('users')->onDelete('cascade');\n. ",
    "sebastiaanluca": "Also kind of missing this great feature from Laravel 4 :)\n. ",
    "vaughany": ":+1:  I've just started looking at the Laravel framework; would love to see generate:scaffold in the L5 version of your generators. (I have previously used CakePHP's bake command which is an amazing way to hit the ground running.)\n. ",
    "fcaivano": "+1 Interested also\n. ",
    "tabacitu": "Sorry for closing this, guys. Jeffrey doesn't really have time to maintain this package anymore, so please don't expect more features. He's been kind enough to give me write access to bring it up-to-date and make it work on L5.4 and L5.5, but I can't allocate a lot of time for this myself, I have 12+ projects in Backpack that take priority. \nThanks for understanding. Cheers!. I think it's a great practice, thank you for sharing @davestewart . But I'm afraid it's not very DRY - you'd then have to change this there if you manually change them in the migration...\nSorry for closing this, guys. Jeffrey doesn't really have time to maintain this package anymore, so please don't expect more features. He's been kind enough to give me write access to bring it up-to-date and make it work on L5.4 and L5.5, but I can't allocate a lot of time for this myself, I have 12+ projects in Backpack that take priority. \nThanks for understanding. Cheers!. Closing, as it's working with --model=0.. Sorry for closing this, guys. Jeffrey doesn't really have time to maintain this package anymore, so please don't expect more features. He's been kind enough to give me write access to bring it up-to-date and make it work on L5.4 and L5.5, but I can't allocate a lot of time for this myself, I have 12+ projects in Backpack that take priority. \nThanks for understanding. Cheers!. Closing this, as you can use command make:model Models/YourModel as @dswtech said.. Thank you @RanZix - merged!. Hi @imanghafoori1 - loopback looks nice, but I'm afraid Jeffrey no longer has the time to maintain this package. He's given me write access, but my goal is right now only to bring it up-to-date and close issues and PRs, not provide any more features. I have 12+ repositories myself in Backpack that take priority. So I'm afraid if you really want this feature, the only way to get it would be to fork this repository and add it.\nCheers!. Thank you, @arifmahmudrana ! Merged!. Also fixed by #119 (already merged, needs tag).. @AbdelilahLbardi , try:\n\"require\": {\n        \"laracasts/generators\": \"dev-master as 1.1.4\"\n},\nCheers!. @AbdelilahLbardi how about this way?. Hi guys,\nJeffrey has been kind enough to give me write access to the repository, so:\n- I've fixed and tagged the release, you can now use it after a composer update;\n- I'll do my best from now on to keep this reasonably up-to-date, but please keep in mind I have 12 other repositories in Backpack that are my priority, so I can't dedicate a lot of time to this; any help is truly appreciated;\nCheers!. Also fixed by #119 (already merged, needs tag).. Thank you @jpuck - merged!. Hi guys,\nJeffrey has been kind enough to give me write access to the repository, so:\n- I've just tagged the release, you can now use it after a composer update;\n- I'll do my best from now on to keep this reasonably up-to-date, but please keep in mind I have 12 other repositories in Backpack that are my priority, so I can't dedicate a lot of time to this; any help is truly appreciated;\nCheers!. Hi guys,\nJeffrey has been kind enough to give me write access to the repository, so:\n- I've just fixed and tagged the release, you can now use it after a composer update;\n- I'll do my best from now on to keep this reasonably up-to-date, but please keep in mind I have 12 other repositories in Backpack that are my priority, so I can't dedicate a lot of time to this; any help is truly appreciated;\nCheers!. Hi @enasellithy - sorry but I'm going to have to close this. It doesn't look like a generators error at all. Cheers!. Hi @Omranic - Jeffrey already merged a PR that also fixes this, so you're ready to go. Please run a composer update and it should fix it for you. Thanks for the PR, cheers!. Hi @bericp1 - Jeffrey just merged a PR that also fixes this, so you're ready to go. Please run a composer update and it should fix it for you. Thanks for the PR, cheers!. Hi guys,\nJeffrey was kind enough to merge the PR, so we're now ready to go. A composer update should fix it for you guys. Also, I've tagged it as v1.1.4 so you no longer need to require the dev-master, you can use it like any other package.\nCheers!. Not a Generators issue, sorry.. Hi guys,\nA PR has been merged that fixes this, so I'll close this - a composer update should fix it for you. Feel free to reopen the issue if you're still having this problem.\nCheers!. @johnsvenn - actually I'd rather you not use that repository, it was just a fork for a PR, so it most likely will get deleted. Jeffrey was kind enough to give me write access to this repository, so I'll try to keep this reasonably up-to-date. You can use it like any other package now.. Hi @enimiste - thanks for the PR, but Jeffrey has just merged another one that also fixes this. You should now be able to run composer update to fix that error. Cheers!. Hi @trakons ,\nSoo... Id columns should be unsigned if artisan is configured to add foreign key constraints. Do I understand you suggestion correctly? \nCheers!. Thank you @93gaurav93 !. Hi @itepifanio ,\nLooks like packagist had that package down for a little while. It happens sometimes, even for big names like Packagist. Hell, even for big names like Github :-)\nI’m sure it’ll work if you try again, so I’ll close the issue.\nCheers!. Hi @nathanaelytj ,\nJeffrey himself hasn't pushed any updates to this project in a while, no. A while back he gave me write access, because we use it in Backpack for Laravel, but we don't need or plan to add any features to it - just keep it working.\nRight now, it IS working on 5.7 - I've used it myself.\nCheers!. ",
    "jdavidbakr": "Just ran into this myself as well. It should be creating dropForeign instead of dropColumn for the first line in the down closure.\n. Fixed in pull request https://github.com/laracasts/Laravel-5-Generators-Extended/pull/59\n. Fixes issue https://github.com/laracasts/Laravel-5-Generators-Extended/issues/21\n. ",
    "joelcuevas": "I just keep running on the same error every few weeks... Any update on this?\n. ",
    "phroggyy": "For sake of certainty, I would suggest instead detecting a foreign key constraint being added, and adding the reverse of that, since I have experienced instability with just removing a column that has a constraint attached. Hence, first removing the constraint will always be the best way (and migration-wise will make a lot more sense.\n. Hey @sangimed, this is because Laravel 5 will create RESTful resource controllers by default when you run php artisan make:controller. If you don't want a RESTful controller, you have to pass the optional --plain parameter to create a controller without methods\n. ",
    "ieo": "Was wondering the same thing\n. ",
    "sahibalejandro": "You can use my gists https://gist.github.com/sahibalejandro/1030d43259a6fe95f79f\nJust update the namespace and register the command on your Laravel proyect and now you can use make:view in the same way as generate:view from way/generators.\n. ",
    "ilkovich": "Just ran into this myself. Apparently carets have been recently introduced in composer. You need to run this first: \nshell\ncomposer selfupdate\n. ",
    "jorenmartijn": "Strange, because I think I did that quite recently. ​I'll try it anyway. Thanks!\n. Well, it seems to have worked!\nMaybe it's a good idea to update the readme to include this issue and the solution? Just a thought.\n​I can't be the only one who experienced this and updating composer wasn't my first idea while trying to troubleshoot the error. \nOp dinsdag 24 mrt. 2015 om 19:14 schreef Joren de Graaf jorendegraaf@gmail.com:\nStrange, because I think I did that quite recently. ​I'll try it anyway. Thanks!\n. ",
    "vinkla": "Its good that you made it work again. Though, I don't agree this should be in the readme. This is not an issue specific for this package. This should be closed.\n. I'm not sure what your question is but here is an answer anyway. You have to add it to the config/app.php to register that the commands exists before you can use them in the command line.\n. Okay, now its more clear what you're asking. Could you maybe paste the AppServiceProvider class in this thread?\n. Have you set the APP_ENV variable to local in your .env file?\n. Thats strange, I do this myself in this project without any problem at all. It should work the same when visiting the root folder on your mac and in homestead. \n. Done.\n. ",
    "mkwsra": "$this++\n. ",
    "lsc20051426": "which means If i am using Laravel 5, I cann't generate model from table anymore?\nOr i need to use Laravel 4 Generators package and Laravel 5 Generator Extended at the same time?\n. ",
    "zhuzhichao": "@Niban  Thank you . You are right.\n. ",
    "driesg": "Sorry long night, should've been more clear. Step 2 of readme.md states:\nYou'll only want to use these generators for local development, so you don't want to update the production providers array in config/app.php. Instead, add the provider in app/Providers/AppServiceProvider.php ...\nWhich is what I did, after step 1 of course.\nI actually just realised that the generators ARE available when I ssh into my homestead box but NOT when I just cd to the project folder on Mac OS X. Is this expected behaviour?\nThe above is happening on my Macbook. On my iMac at work I can use them from the Mac OS command line. \nSo I'm just confused as to what is correct? Should these generators be used inside homestead box or can I use them from the OS X? \n. sure, here you go\n```\n<?php namespace App\\Providers;\nuse Illuminate\\Support\\ServiceProvider;\nclass AppServiceProvider extends ServiceProvider\n{\n    /\n     * Bootstrap any application services.\n     \n     * @return void\n     /\n    public function boot()\n    {\n        //\n    }\n/**\n * Register any application services.\n *\n * @return void\n */\npublic function register()\n{\n    if ($this->app->environment() == 'local') {\n        $this->app->register('Laracasts\\Generators\\GeneratorsServiceProvider');\n    }\n}\n\n}\n```\n. yes\nAPP_ENV=local\nAPP_DEBUG=true\nAPP_KEY=XYZ\n. Something must've been wrong with the .env file.Everything works after deleting and recreating it. Thanks for your help!\n. ",
    "avlastenok": "If what you pasted was in the model file then I don't see an issue here as this is expected behavior.\n. ",
    "bvangraafeiland": "What would you expect to be in the model class? Just by extending Model, they can be used already.\n. ",
    "davestewart": "It would be cool if it populated the PHPDoc comments like so:\n/**\n * Club model\n *\n * @property    int     id\n * @property    string  name\n * @property    string  email\n * @property    string  abbreviation\n * @property    Carbon  created_at\n * @property    Carbon  updated_at\n */\nThen we'd get type-hinting, in PHPStorm at least.\nI do this with all my models.\n. ",
    "lukeed": "I figured it had to be compatible! Derp\nTrolled through and found that lines 5 and 79 needed uncommenting in bootstrap/app.php\n. ",
    "sangimed": "okay got it thank you :)\n2015-06-24 8:16 GMT+01:00 Leo Sjöberg notifications@github.com:\n\nHey @sangimed https://github.com/sangimed, this is because Laravel 5\nwill create RESTful resource controllers by default when you run php\nartisan make:controller. If you don't want a RESTful controller, you have\nto pass the optional --plain parameter to create a controller without\nmethods\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/laracasts/Laravel-5-Generators-Extended/issues/37#issuecomment-114757924\n.\n. \n",
    "pkunze": "also see #26 \n. also see #26\n. ",
    "jorenvanhee": "I'm also having this issue\n. ",
    "amin101": "you should remove underscore from class name manualy\nso it would be : CreateBartableFootablePivotTable\n. ",
    "rodelapena": "i have the same problem, please help.\nhere ii is:\nrodrigo@jarvis:~/Projects/asistencia > php artisan make:migration:schema create_managers_table --schema=\"username:string, email:string:unique\"\nMigration created successfully.\nModel created successfully.\nCreated Migration: 2015_05_13_224930_create_managers_table\ntwo migration files are created:\n2015_05_13_224929_create_managers_table.php\n<?php\nuse Illuminate\\Database\\Schema\\Blueprint;\nuse Illuminate\\Database\\Migrations\\Migration;\nclass CreateManagersTable extends Migration\n{\n    /\n     * Run the migrations.\n     \n     * @return void\n     /\n    public function up()\n    {\n        Schema::create('managers', function(Blueprint $table) {\n            $table->increments('id');\n            $table->string('username');\n            $table->string('email')->unique();\n            $table->timestamps();\n        });\n    }\n/**\n * Reverse the migrations.\n *\n * @return void\n */\npublic function down()\n{\n    Schema::drop('managers');\n}\n}\nand:\n2015_05_13_224930_create_managers_table.php\n<?php\nuse Illuminate\\Database\\Schema\\Blueprint;\nuse Illuminate\\Database\\Migrations\\Migration;\nclass CreateManagersTable extends Migration {\n```\n/\n * Run the migrations.\n \n * @return void\n /\npublic function up()\n{\n    Schema::create('managers', function(Blueprint $table)\n    {\n        $table->increments('id');\n        $table->timestamps();\n    });\n}\n/\n * Reverse the migrations.\n \n * @return void\n /\npublic function down()\n{\n    Schema::drop('managers');\n}\n```\n}\nhere is my info:\nrodrigo@jarvis:~/Projects/asistencia > php artisan\nLaravel Framework version 5.0.31\nrodrigo@jarvis:~/Projects/asistencia > php -v\nPHP 5.5.9-1ubuntu4.9 (cli) (built: Apr 17 2015 11:44:57) \nCopyright (c) 1997-2014 The PHP Group\nZend Engine v2.5.0, Copyright (c) 1998-2014 Zend Technologies\n    with Zend OPcache v7.0.3, Copyright (c) 1999-2014, by Zend Technologies\ncomposer require laracasts/generators --dev\nrodrigo@jarvis:~/Projects/asistencia > mysql -V\nmysql  Ver 15.1 Distrib 5.5.41-MariaDB, for debian-linux-gnu (x86_64) using readline 5.2\nthank you!\n. ",
    "odin88": "+1 same problem to me as well\n. ",
    "joarobles": "+1 same problem to me as well after upgrade from 1.1 to 1.1.1\n. Totally agree, furthermore model=true or model=1 would never ever be used\n. ",
    "AngelinDark": "+1 the same for me\n. ",
    "woodytang": "same here!\n. ",
    "carlyle-v": "+1 same problem\nfirst go creating default\nphp artisan make:migration:schema create_posts_table --schema=\"user_id:integer:foreign, title:string,body:text\"\nand after script work as well and create his own migration and model\n. I do not understand why, but I dont have this problem more)\n. ",
    "Elyahou": "+1 here\n. ",
    "dojorob76": "+1 -although, oddly, it doesn't happen about 1% of the time...\n. +1, --model=false is not honored at all.\n. ",
    "arifmahmudrana": "same here\n. Same here not working\n. yes using 5.1\n. @RobertoGongora which version of Laravel & PHP. Also give your whole command you run. @RobertoGongora I have created a PR for this fix you can check that on how to fix that while my PR is accepted or rejected. ",
    "erenmustafaozdal": "same here. Please help! :)\n. ",
    "lmatab": "Same  Here!, Hey  Jeff  where are you?\n. yes it  happens, I guess  it is a bug, I always  keep and eye  on the  files generated so I can delete  the  ones that  are not  necessary!\n. ",
    "cantecim": "Sometimes it doesn't happen only we get migration that trash one. Its even worse now in my case\n. ",
    "azamuddin": "same here\n. ",
    "bebnev": "make:migration:schema is using Laravel make:model command for model generation.\nAnd by default make:migration:schema will generate model class (if it does not exist).\nIf you are using laravel/framework 5.0.* make:model by default will generate the migration.\nSo calling make:migration:schema generates the migration, then calls make:model which generates Model and migration (again). So that is the point.\nlaravel/framework 5.1.* make:model command by default will not generate the migration file, so updating laravel will solve the problem.\nOr if you don't want to update just call make:migration:schema with option --model=0 (because --model=false doesn't work #41), and generate model by your hands or with laravel make:model command with option --no-migration\n. ",
    "EspadaV8": "--model=0 works. It looks like 'false' doesn't get cast to a boolean but it treated as a string\n. This should help issues like #41 \n. @joarobles model=true is the default, so yeah, no need to ever pass that in.\n. My use case for this is using PostgreSQL. My default is to use uuid columns for ids and timestampTz for the created_at and updated_at columns.\nThe current behaviour remains for ids if the user doesn't pass in an id definition. The timestamps won't be added if either created_at or updated_at have been passed in (otherwise they'd be a column clash).\nTests have been added for the new functionality.\n. ",
    "nonDeath": "--model=0 works. But the #50 issue is more clear.\n. The same.\n. ",
    "RanZix": "@nonDeath, thank you for solution. Was facing same problem.\n. Go to vendor/laracasts/generators/src/Commands/MigrationMakeCommand.php, on line 107 change \n'name' => $this->getModelName()\nto\n'name' => 'models/'.$this->getModelName()\n. Found solution, --model=0 works\n. ",
    "sandeep514": "Artisan::call('make:migration:schema',[\n                                '--model'=>false,\n                                'name'=>'create_'.$org->id.'_users',\n                                '--schema'=>'name:string, email:string:unique, password:string, address:string:nullable,\n                                phone:integer:nullable, approve:integer:default(0)'\n                            ]);\n    Artisan::call('migrate');.\n",
    "lagseeing": "Lumen is based on laravel 5 not laravel 4\n. I'll try to submit a PR\n. Yeah it hasn't been tagged.\n. I was working on this, you beat me to it :+1:  I vote this to be merged.\n. It hasn't been updated on Packagist\n. ",
    "deepu9": "So lagseeing, you mean, I can use Laravel 5 Generators for Lumen 5?\n. ",
    "Houbsi": "I had the same issue,\nbut the issue is that you enter the \"Model\" Name in singular:\nmake:migration:pivot User Company\nBut in the created migration it uses as tablename for the foreign key the \"singular\"name instead of the default \"multiple\"name.\nThis:\n$table->foreign('company_id')->references('id')->on('company')->onDelete('cascade');\nShould be:\n$table->foreign('company_id')->references('id')->on('companys')->onDelete('cascade');\n. +1 I just encountered the same issue.\n. ",
    "nardev": "same for seed too\n. ",
    "jakecleary": ":+1:  I'm getting the same issue.\nI'm guessing this is a simple fix? Might be worth one of us PRing it @nardev. I'll see if I have time this weekend.\n. ",
    "summermick": "I'm using php 5.6.11, have the problem too.\nI wonder if anyone has this issue with php 5.5.*\n. ",
    "gcphost": "Reported here:\nhttps://github.com/laracasts/Laravel-5-Generators-Extended/issues/51\nSaid was fixed, bad link, not fixed when I tried 3 days ago.\nCommenter said this branch works:\nhttps://github.com/hiendv/Laravel-5-Generators-Extended/tree/fix/pivot-dummy-classname\n. +1 @snetty , Eloquent is massively annoying at relations and then the coveted generators are an epic fail with this bug. \n. ",
    "gerardreches": "Same issue here.\n. ",
    "ikkentim": "This was already fixed in e4820fdb0b2dd5ff5b24bacf3315aae0986cd51d, but no release has been made since.\n. This was already fixed in e4820fdb0b2dd5ff5b24bacf3315aae0986cd51d, but no release has been made since.\n. @Samyoul it has already been fixed but @JeffreyWay needs to push a release!\n. :+1: \n. @JeffreyWay Can you tag a new version of the L5 generators so people can enjoy the latest patches trough composer?\n@laracasts \n. Duplicate of #53\n. See #53\n. Simply marking user_id in create_posts_table as unsigned does the trick as well without having to manually modify the migration\nphp artisan make:migration:schema create_posts_table --schema=\"user_id:integer:unsigned:foreign, title:string, body:text\"\nIt might be easier if any integer tagged with foreign would automatically be marked unsigned.\n. Or #53\n. Are you running the version on master?\n. Duplicate of #53\n. This was already fixed in e4820fdb0b2dd5ff5b24bacf3315aae0986cd51d, but no release has been made since.\n. ",
    "andreluizmorita": "https://github.com/laracasts/Laravel-5-Generators-Extended/pull/58\n. Fixed \nhttps://github.com/laracasts/Laravel-5-Generators-Extended/pull/58\nhttps://github.com/laracasts/Laravel-5-GeneratorsExtended/commit/3efba3438bc119d4d489506d7c72d1baf4b9d1a5\n. ",
    "atorscho": "Same issue.\n. I think that's only on Laravel 5.1. \n. ",
    "mstnorris": "Same issue (using Laravel 5.1.2)\n. ",
    "hiendv": "There are many pending pull requests related to this issue.\nYou can use my branch as the temporary workaround:\nhttps://github.com/hiendv/Laravel-5-Generators-Extended/tree/fix/pivot-dummy-classname\n. ",
    "vjandrea": "@JeffreyWay please update the release!\n. ",
    "Samyoul": "I've experienced this with make:migration:pivot also.\n. ",
    "floristenhove": "FYI: This is still happening.\n. ",
    "netcore-janisb": "Same here, still a problem. L 5.2.5\n. same here, looks like bug with L 5.2\n. ",
    "RobertoGongora": "Still happening :( . Latest version of Laravel(5.3.28 I believe), valet 2.0.3, PHP 7.0.3, Mac Os Sierra 10.11.2, and the command is ‘php artisan make:seed reviews‘  . Thank you! I will check it out ASAP and report back. ",
    "snetty": "can we get this merged in please, generators aren't much use if you have to go fix what they generated for you :(\n. ",
    "tbezman": "I found out what the bug is. It's because in the source of the MigrationMakeCommand, he uses a relative path :\nreturn '/migrations/' . date('Y_m_d_His') . '_' . $name . '.php';\nwhen it should use Laravel's helpers :\nreturn database_path() . '/migrations/' . date('Y_m_d_His') . '_' . $name . '.php';\n. ",
    "tnagengast": "Great spot!! Works like a charm, thank you :)\n. ",
    "EHLOVader": "@andreluizmorita, are you accidentally pushing commits into this pull request since it was on the master branch? \nI also wanted to comment on the implementation. Would it be a better option to use :softDeletes instead of softDeletes.  Your code doesn't check that the type is missing and makes columns named softDeletes (I understand the unlikelihood of this) impossible to define. \nSkipping right to the type, with no name might be an easier option.\n. @JeffreyWay I understand your response given the PR is not a clean feature branch but I myself like the idea and original spirit behind the request.\nWas it the concept of the request or the implementation that you are opposed to?\nI know the timestamps is handled by automatically assuming they are desired and put in the stub however these table decorators aren't handled well and there are more than just timestamps and softDeletes.\nInstead of timestamps one might prefer nullableTimestamps. And besides softDeletes there is also rememberToken which would be nice to support.\nAlthough it is easy to modify the timestamps which was generated or to add these afterwards I feel that it would make for a more complete solution to have a syntax for these built in, for the ones we have and ones that may be added.\n. ",
    "JeffreyWay": "Think we'll pass on this. Thanks, though!\n. #53 merged. Thanks for this, though!\n. #53 merged. Closing.\n. #53 merged. Thanks for this, though.\n. ",
    "stamp": "Is there any reason why this haven't been merged yet? I keep running in to this bug almost every day and its a little frustrating. \nLoves the generators by the way! :+1: . ",
    "nathanjisaac": "It has the same name on my install of laravel 5.1.\n. ",
    "fbidu": "I can confirm that I was affected by this bug as well\n. ",
    "jrsickles": "This also affected me. Simple camel-casing of the class name should resolve the issue, no?\n. ",
    "janokary": "After that I manually named the class\nCreateCampaignresponseCampaignPivot\nand run\ncomposer dump-autoload\nthe class is now in autoload_classmap.php\nBut now I am getting\nClass 'CreateCampaignresponseCampaignPivotTable' not found in vendor/laravel/framework/src/Illuminate/Database/Migrations/Migrator.php on line 324\n. ",
    "shanecp": "I'm seeing the same issue as well. Using dev-master branch.\n. ",
    "Noir-": "I got frustrated by this issue too and on the first glance it seems to be a great idea to automatically add the unsigned modifier.\nBut on the second glance this only makes sense if the foreign key is actually an unsigned integer. In most cases this would be probably true but you can never be sure.\nThe real problem is still that MySQL throws quite shitty error messages. Even if Oracle is never going to fix that it could be better if a workaround for meaningful error messages is implemented in Laravel rather than in this library.\n. ",
    "azulkipli": "Sorry my bad, I forgot add the provider to AppServiceProvider\n. ",
    "jackkeller": "I'm totally new to Laravel but I saw the resource generator too and was amazed, I know one can do the individual commands but getting up and running that'd be helpful to see all the files needed for a model/etc\n. ",
    "miadz": "see this change\nhttps://github.com/laracasts/Laravel-5-Generators-Extended/pull/61\n. ",
    "fwartner": "Getting stil the same error.\n. Yep. Fixed it now by hand..  Works\n. ",
    "unclepickles": "thanks\n. ",
    "dmp593": "I have the same problem\n. ",
    "njbarrett": "Same issue\n. This ought to get merged\n. ",
    "scalerboy": "Add :unsigned. \neg. user_id:integer:unsigned:foreign\n. ",
    "alameya": "it should be putted automaticly because it always present in primary key 'id'\n. ",
    "Maidomax": "+1\n. +1\n. ",
    "sevmardi": "Is this merged with the current version? Can't seem to recognize --current? \n. $table->dropForeign(['supplier_id']);\n$table->dropColumn('supplier_id');\nDid the trick. Any other methods I should know about? \n. ",
    "ghost": "Same error. Waiting for the fix.\n. Thanks! Fixed it.. ",
    "inpariswithyou": "Also get the same error and would like a fix!\n. ",
    "ivanvermeyen": "It's just this reference to Composer:\nhttps://github.com/laracasts/Laravel-5-Generators-Extended/blob/master/src/Commands/MigrationMakeCommand.php#L8\nAs Laravel's upgrade says:\n\"The Illuminate\\Foundation\\Support\\Composer class has been moved to Illuminate\\Support\\Composer.\"\nThere's already a pull request for this: #82\n. ",
    "mikeritter": "For the time being:\n\\vendor\\laracasts\\generators\\src\\Commands\\MigrationMakeCommand.php\nline 9\nchange to use Laracasts\\Generators\\Migrations\\NameParser;\nSee @tfortier below. ID10T error on my part.\n. ",
    "tfortier": "I actually had to change line 8 of this file : \n\\vendor\\laracasts\\generators\\src\\Commands\\MigrationMakeCommand.php\nto this use Illuminate\\Support\\Composer; in order to solve the error message.\n. ",
    "firescript": "Thanks guys! Big help :+1: on the quick fix, @tfortier worked for me.\n. ",
    "xiaolp": "replace use Illuminate\\Foundation\\Composer;\nto\nuse Illuminate\\Support\\Composer; \nScaffoldMakeCommand.php \n. ",
    "rvanbaalen": "Just starting the migration from 5.1* to 5.2 and this is still an issue apparently. Why hasn't this been addressed yet?\n. By searching for Illuminate\\Foundation\\Composer in my vendor folder, I found an incompatible package which was causing this error.. ",
    "LourensThalen": "Wondering the same. Keeps giving errors, even when I want to switch back to 5.1 :(\n[ReflectionException]\n  Class Illuminate\\Foundation\\Composer does not exist\n. ",
    "SoeThandarAung": "Hello, Can anyone help me? When I run php artisan , I got\nBadMethodCalException error and\nCall to undefined method [RegisterSyncsTableConnector]\n. ",
    "kevosomi": "To solve this issue please find \"Illuminate\\Foundation\\Composer\" in your entire project and replace with \"Illuminate\\Support\\Composer\". That should fix the problem. Worked in my case in Laravel 5.3.. ",
    "nivv": "@CasperLaiTW Out of curiosity, wouldn't this break backwards compatibility with Laravel 5.1?\n. ",
    "CasperLaiTW": "Yes, it breaks backwards compatibility with Laravel 5.1 or 5.0\nI patch #83\nThis issue can be closed\n. ",
    "dennisoderwald": "+1\n. ",
    "JoeyHoutenbos": "PR https://github.com/laracasts/Laravel-5-Generators-Extended/pull/82 is same and closed.\nPR https://github.com/laracasts/Laravel-5-Generators-Extended/pull/83 will solve with backward compatibility...\n. ",
    "dustinleblanc": "@JeffreyWay seeing as there is none, and it seems useful, would you like contributions to add that functionality? \nI remember listening to a recent laravel podcast in which you, Taylor, and Matt discussed PR's with no advanced notice and I'd like to avoid being part of the crowd :)\nI'd like to volunteer some time to work on this if you desire to add it.\n. ",
    "Braunson": "Any updates on this?. Bump, any fix on this @laracasts @JeffreyWay ?. @hashlash You have an error in your code. Look at the full stack error message for the file the error occurred in and fix the extra {. ",
    "xitude": "See #81 \n. ",
    "iBet7o": "https://github.com/sensiolabs/SensioDistributionBundle/issues/243\n. ",
    "andjelicsasa": "A bit of an issue here with the default value for --path If not submitted.. I'll commit a fix soon, please do not merge until then.\n. Fixed the issue, sorry for the inconvenience.\n. ",
    "dswtech": "You can just insert command make:model models/YourModel\n. ",
    "mishbah": "if this package have config file, we can change the model directory\n. ",
    "iraklisg": "It looked like I had to include a space character between the --schema= and the first double quote \"\nI.e. \nphp artisan make:migration:schema create_positions_table --schema= \"name:string, employee_id:integer:foreign\"\nNow the migrations are correctly created\n. ",
    "Yolcar": "To add the decimals placed in parentheses. example\namount:decimal(5,2)\nGenerates the following:\n$table->decimal('amount', 5, 2);. ",
    "mexists": "108 seems this bug is new\n. ",
    "ssirjann": "This is probably because the if condition inside the register function of AppServiceProvider.php is failing. \nMaybe your installation is not local. Check for a .env file in root directory of your Laravel installation. \nIf this still doesn't work, then for now, you can remove the if, which is not recommended.\n. ",
    "BartHuis": "I get it too when using after adding the package with composer:\n```\n$ artisan make:migration:pivot promotions multimedia_objects\n[Symfony\\Component\\Console\\Exception\\CommandNotFoundException]\n  There are no commands defined in the \"make:migration\" namespace.\n  Did you mean this?\n      make\n```\nif you get this too, maybe you forgot step 2? in my case it was...\n. ",
    "iyadh": "I've solved this issue by creating a .env in my project root with this setting:\nAPP_ENV=local\nThen the command worked as expected.. ",
    "TCB13": "I'm running into this in Lumen. Lumen (5.3.3) (Laravel Components 5.3.*).\nThe solutions above doesn't seem to fix the issue:\n.env:\nAPP_ENV=local\nAppServiceProvider.php:\n`````\n public function register()\n    {\n    if ($this->app->environment() == \"local\") {\n        $this->app->register('Laracasts\\Generators\\GeneratorsServiceProvider');\n    }\n\n}\n\n`````\nWhat am I missing? Thank you.\n\nJust found my issue, with Lumen we need to uncomment the following section at bootstrap/app.php:\n|--------------------------------------------------------------------------\n| Register Service Providers\n|--------------------------------------------------------------------------\n$app->register(App\\Providers\\AppServiceProvider::class);\nHave fun!. ",
    "akramabdulrahman": "Laravel-5-Generators-Extended version 1.1 \nrun php artisan make:migration:pivot sectors service_providers\ngenerated CreateSectorService_providerPivotTable \ninstead of CreateSectorServiceProviderPivotTable \n. ",
    "cs-abdulwahab": "same issue  that took my entire day. now pivot is causing issue in laravel 5.4\nafter renaming the class \non migrate    class not found exception occur\nhave applied   composer dump-autoload   etc\n. ",
    "S4Mi": "php artisan make:migration:pivot courses levels generated class App\\ extends Migration ! no class name.. ",
    "mklahorst": "Have same issue as @S4Mi , but it also changes the table name \"media\" to \"medium\" when running:\nphp artisan make:migration:pivot media submissions\nAnd generates medium_submission for the table and medium_id for the column name.\n. ",
    "bogdankharchenko": "issues are addressed in this PR, https://github.com/laracasts/Laravel-5-Generators-Extended/pull/154. No it should not, this is addressed in PR, https://github.com/laracasts/Laravel-5-Generators-Extended/pull/154. Opened a PR https://github.com/laracasts/Laravel-5-Generators-Extended/pull/154  https://github.com/laracasts/Laravel-5-Generators-Extended/pull/154/commits/d0b3d2e26482a5686a6f9b763c242aefb016a3a0. opened a PR, https://github.com/laracasts/Laravel-5-Generators-Extended/pull/154. I created a PR for this, https://github.com/laracasts/Laravel-5-Generators-Extended/pull/154. @cristianuibar I'm not sure when it'll get merged ---- I don't have those privileges.  Feel free to pull my repo in the meantime, https://github.com/bogdankharchenko/Laravel-5-Generators-Extended \nadd git repo to composer.json, \n\"repositories\": [\n    {\n      \"type\": \"git\",\n      \"url\": \"https://github.com/bogdankharchenko/Laravel-5-Generators-Extended\"\n    }\n]\nand change your versioning to,     \n\"laracasts/generators\": \"dev-develop\"\n. ",
    "Behinder": "One year later, error still persist. I use @bogdankharchenko  repo and I still have similar issue.\nI have two models: Corner and Song - the tables are called \"corners\" and \"songs\".\nIf i create pivot with \"php artisan make:migration:pivot corner song\" (I've read in everyplace this is proper naming convention) resulting code is:\n```\n<?php\nuse Illuminate\\Database\\Schema\\Blueprint;\nuse Illuminate\\Database\\Migrations\\Migration;\nclass CreateCornerSongPivotTable extends Migration\n{\n    /\n     * Run the migrations.\n     \n     * @return void\n     /\n    public function up()\n    {\n        Schema::create('corner_song', function (Blueprint $table) {\n            $table->integer('corner_id')->unsigned()->index();\n            $table->foreign('corner_id')->references('id')->on('corner')->onDelete('cascade');\n            $table->integer('song_id')->unsigned()->index();\n            $table->foreign('song_id')->references('id')->on('song')->onDelete('cascade');\n            $table->primary(['corner_id', 'song_id']);\n            $table->integer('program_id')->unsigned;\n    });\n}\n\n/**\n * Reverse the migrations.\n *\n * @return void\n */\npublic function down()\n{\n    Schema::dropIfExists('corner_song');\n}\n\n}\n```\nProblem is primary keys are referencing wrong table name then, because neither \"corner\" nor \"song\" exists.\n. Ok it's working only if you remove Bogdan repo.\nwhen I left it, and added dev-master it created wrong class name in header.\nafter composer upgrade pivot was created correctly. I'm writing it in case   someone else find this problematic\n. Not working in 5.8. Is there any way to install from dev-master branch using composer?\nOn Sun, Mar 10, 2019 at 9:22 PM Bogdan Kharchenko notifications@github.com\nwrote:\n\nYou have to used dev-master branch, since the maintainers did not tag a\nnew release since this patch was merged.\n—\nYou are receiving this because you commented.\nReply to this email directly, view it on GitHub\nhttps://github.com/laracasts/Laravel-5-Generators-Extended/pull/154#issuecomment-471340568,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AAkHlphJvGMbuIjXL0A0bfaKRu-dzidOks5vVWmGgaJpZM4Rt6qJ\n.\n. \n",
    "Jeloo": "@sevmardi i think you also should drop index like\n$table->dropIndex('supplier_id_foreign')\n(the name of index is just an example. It is usually the same as foreign key name)\n. ",
    "anchepiece": "What was your complete command? Did you have --model=false before the name?\n. Also take a look at issue #96\n. ",
    "santoshachari": "I have tried it both ways, it doesn't seem to work. \n\n. ",
    "seanmangar": "Looking at the code, seems that the option is a string \"false\". In PHP non empty strings always evaluate to true. Looking at all the PRs pending in this repository, it does not seem to be actively maintained.\n```\nprotected function makeModel()\n    {\n        $modelPath = $this->getModelPath($this->getModelName());\n    if ($this->option('model') && !$this->files->exists($modelPath)) {\n        $this->call('make:model', [\n            'name' => $this->getModelName()\n        ]);\n    }\n}\n\n```\n. Please look at PR https://github.com/laracasts/Laravel-5-Generators-Extended/pull/50\n. ",
    "tucq88": "@JeffreyWay Could you please consider merge PR for fixing this issue ? \n. ",
    "doctorthompson": "Passing --model=0 works.. ",
    "dansup": "Yeah this affected me when updating Laravel to 5.4 which is out now.. Use 'dev-master' and run 'composer update' to pull in fix in latest commit 4e9ce5d. ",
    "joeldbirch": "This just bit me, too.. ",
    "Jaspur": "Yep, same here. . @JeffreyWay merge?. ",
    "uusa35": "any clues ? . ",
    "stedop": "Yeah so, looks like that trait has been removed from laravel,  I can understand why, it started a larger piece of code but by 5.3 was just this\n<?php\nnamespace Illuminate\\Console;\nuse Illuminate\\Container\\Container;\ntrait AppNamespaceDetectorTrait\n{\n    /**\n     * Get the application namespace.\n     *\n     * @return string\n     */\n    protected function getAppNamespace()\n    {\n        return Container::getInstance()->getNamespace();\n    }\n}\nI'm going to submit a pr to fix this shortly.\nEDIT : In fact I just checked the current prs and #120 will fix this using a newer way.\n. ",
    "rhonz10": "I tried to update src/Commands/MigrationMakeCommand.php with the fix from #120, migration file created but the class name is incorrect. \n```\n<?php\nuse Illuminate\\Database\\Schema\\Blueprint;\nuse Illuminate\\Database\\Migrations\\Migration;\nclass App\\ extends Migration\n{\n```\ninstead of something like\n```\n<?php\nuse Illuminate\\Database\\Schema\\Blueprint;\nuse Illuminate\\Database\\Migrations\\Migration;\nclass CreatePostTagPivotTable extends Migration\n{\n```\nproviding a correct class name migrates successfully. . ",
    "AbdelilahLbardi": "I am using Laracasts generators to generate migration files for my [package] and need to require the update that supports Laravel 5.4 .\nHere's my composer.json schema:\njson\n\"require\": {\n    \"laracasts/generators\": \"1.1.3\"\n},\nCleared the composer cache and changed the release to dev-master but i still have the same error. \n````bash\nTrait 'Illuminate\\Console\\AppNamespaceDetectorTrait' not found in \nC:\\Users\\abdelila\\Documents\\auctions\\vendor\\laracasts\\generators\\src\\Commands\\MigrationMakeCommand.php on line 16\n````\n[package]: https://github.com/abdelilahlbardi/laragenerator. Hi @tabacitu, thanks for your answer.\nI changed the version but still getting the same package trait error.\nRegards,. Too ! I already tried that one but it didn't work.. @leanicoferreyra yes for sure. To make it working, the package users should require the laracasts generators too while waiting for the stable version to be released.\n\"require\": {\n    \"laracasts/generators\": \"master@dev\",\n    \"abdelilahlbardi/laragenerator\": \"^1.5\"\n}. ",
    "Agapito78": "+1. ",
    "leanicoferreyra": "AbdelilahLbardi donkey question, did you run \"composer update\" command after the composer.json change?. With the exactly same problem i used this:\n\"require-dev\": {\n        \"fzaninotto/faker\": \"~1.4\",\n        \"laracasts/generators\": \"dev-master\",\n        \"mockery/mockery\": \"0.9.*\",\n        \"phpunit/phpunit\": \"~5.7\"\n    },\nThis is a vanilla instalation  with generators\nThen composer update and the register code in the provider...\nAnd the problem was solved automaticaly.\nTry with a fresh install to see if the problem have a solution like this and then try clean your current instalation. Without your fork maybe or other namespace possibly altered in the process.. ",
    "linares82": "I had the same problem, and found this code in laravel 5.3 \n<?php\nnamespace Illuminate\\Console;\nuse Illuminate\\Container\\Container;\ntrait AppNamespaceDetectorTrait\n{\n    /\n     * Get the application namespace.\n     \n     * @return string\n     /\n    protected function getAppNamespace()\n    {\n        return Container::getInstance()->getNamespace();\n    }\n}\nSo I decided create the file in Illuminate\\Console directly in laravel 5.4 inside vendor\\laravel\\framework\\src\\Illuminate\\Console it is not correct but it works.. ",
    "mxrxdxn": "This works fine for me using dev-master as the version when upgrading from Laravel 5.3 to 5.4.. ",
    "DevAbas": "I changed this codes in the composer.json and fixed all issue\n\"require\": {\n        \"laracasts/generators\": \"dev-master as 1.1.4\"\n}, \nThanks everyone.\n. ",
    "mbarwick83": "\"laracasts/generators\": \"dev-master\" worked for me.. ",
    "arahmdiamola": "app.php\n'env' => env('APP_ENV', 'development'),\nand \nAppServiceProvider.php\nif ($this->app->environment() == 'development') {\n      $this->app->register('Laracasts\\Generators\\GeneratorsServiceProvider');\n }\n. ",
    "vlakoff": "Saving a step when installing Backpack wouldn't be a luxury… The fix is merged and awaiting for 3 months, all you have to do now is to tag a release. Please.. ",
    "StephanMeijer": "Go fix this! . ",
    "perskinet": "Problem affects me too :) \nThis is fixing partially:\n\"require\": {\n\"laracasts/generators\": \"dev-master as 1.1.4\"\n},\nWhen you generate migration for pivot you have no class name at generated migration :) But artisan works :). ",
    "hashlash": "i'm having issue for migration class name using dev-master version (just like @perskinet said). The generated class name is always App\\ which is give me error \n[Symfony\\Component\\Debug\\Exception\\FatalThrowableError]\n  Parse error: syntax error, unexpected '\\' (T_NS_SEPARATOR), expecting '{'\nwhen I try to do php artisan migrate:refresh. @Braunson i simply do the php artisan migrate:refresh and just get that two lines of error info\nBy the way, the class name issue has been disscussed in here and solved by this merge.\nCan we combine the solutions for both problems (AppNamespaceDetectorTrait not found and class name problem)? I still newbie in this kind of thing. ",
    "tmaly1980": "@JeffreyWay , any suggestion what we should do? 5.4 has been out for the last month and any new laravel installs automatically use it, so this isn't working. =( Seems like dev-master works but it just needs to be merged into master.. ",
    "i-bajrai": "Change AppNamespaceDetectorTrait to DetectsApplicationNamespace in:\nvendor/laracasts/generators/src/Commands/MigrationMakeCommand.php. ",
    "vpratfr": "Same question here. Thanks too.. ",
    "villeneuve-michael": "Meanwhile I fixed it using : \n    \"laracasts/generators\": \"master@dev\",\n\nTo drop down to minimum-stability for the package.. ",
    "cohan": "Using master@dev as mentioned doesn't seem to play nicely when creating pivot tables. Resulting migration file doesn't have a class name\nclass App\\ extends Migration\nFresh install of Laravel 5.4 and master@dev laracasts/generators. ",
    "mmjjb": "\nInstall bug\nBug with creating pivot tables\n\nGoing very fluently.... . @qeifar Bad explained from me. I was referring to the fact that we have to use an minimum stability package in order to make it work (install issues) and that when we finally have it working, that we have an problem with the name creation. \nWhy is this issue not being resolved? This issue is regarding 5.4 and we are slowly already moving to 5.5.\nIn a few months we are 1 year further. ",
    "qeifar": "@mmjjb  what did u mean by install bug?\n. ",
    "AlbinoDrought": "Same issue here, this was fixed in the repo ( https://github.com/laracasts/Laravel-5-Generators-Extended/pull/119 ) but composer seems to be downloading an older version.. As an alternative to https://github.com/laracasts/Laravel-5-Generators-Extended/issues/125#issuecomment-336312926 , you could also override the existing command and then add the new one to your app/Console/Kernel.php. This would allow it to persist through deployments and composer installs.\napp/Console/Commands/CompatibleMigrationMakeCommand.php:\n```php\n<?php\nnamespace App\\Console\\Commands;\nuse Laracasts\\Generators\\Commands\\MigrationMakeCommand;\nclass CompatibleMigrationMakeCommand extends MigrationMakeCommand\n{\n    public function handle()\n    {\n        $this->fire();\n    }\n}\n```\napp/Console/Kernel.php:\n```php\n<?php\n/ stuff here... /\nclass Kernel extends ConsoleKernel {\n    /\n     * The Artisan commands provided by your application.\n     \n     * @var array\n     /\n    protected $commands = [\n        / maybe some existing commands here... /,\n        Commands\\CompatibleMigrationMakeCommand::class, // just add this line\n    ];\n```\n(there's probably a wrapper for this somewhere - if not, someone should make it ;) ). ",
    "hosmelq": "This fix has not been taged.\nAt the moment you can add this to your composer.json\n\"laracasts/generators\": \"dev-master\". ",
    "fntneves": "@laracasts Could you please tag a new release ?. ",
    "flavz27": "Any fix for this ? using \"dev-master\" isn't working for me. ",
    "keithwhyman": "Other fix  \n  \"laracasts/generators\": \"dev-master as 1.1.4\"\n also not working for me. ",
    "abr4xas": "This work for me:\n\"laracasts/generators\": \"dev-master\"\n . ",
    "littlebookboy": "\"laracasts/generators\": \"dev-master\" and composer update then the file, /path/to/vendor/laracasts/generators/src/Commands/MigrationMakeCommand.php, will be fixed. \nIt's woking for me and no more error like Trait 'Illuminate\\Console\\AppNamespaceDetectorTrait'.. ",
    "theNailz": "Confirmed, above fix works. Better formatting:\n\nChange composer.json to use \"laracasts/generators\": \"dev-master\".\nRun composer update\n\nDone!. ",
    "erayaydin": "This fix should be tagged as new version.... Added dev-master and dev-master#4e9ce5db9d93475ca27b993a92de3b15090aa139 to required dependecy but still doesn't fix handle() error on Laravel 5.5\n[ReflectionException]                                                               \n  Method Laracasts\\Generators\\Commands\\MigrationMakeCommand::handle() does not exist. @tahiryasin Nope, its not safe. But after owner fixed and tag as version, its will overwrite vendor folder and still same. But updating files in vendor isn't safe. Its fix for limited time. You shouldn't deploy product until owner tagged this fix.. @AlbinoDrought its perfect fix for this issue, I think 👍 Thanks for that. This should be merged when Travis CI build success. :+1: . Also there is no Travis CI build error because of HHVM is no longer supported on Ubuntu Precise. Please consider using Trusty with 'dist: trusty'.\nAll PHP version builds success, so this should be merged :+1: . ",
    "bradacjan": "For anyone, who just wants this fix, but does not want further updates from dev-master (so that you do not accidentally load any dev updates that you do not want), you can require the commit via it's hash:\n\"laracasts/generators\": \"dev-master#4e9ce5db9d93475ca27b993a92de3b15090aa139\",\nI also agree that this should be tagged as a new release, after which this workaround will not be required. . ",
    "urbanlegion": "when creating a pivot table with php artisan make:migration:pivot tags posts\nI'm guessing something got screwed up in the stub for this script, as i'm getting:\nclass App\\ extends Migration {\nBut the rest of the schema looks fine.. ",
    "Promixius": "@urbanlegion I am receiving the same fault here.. ",
    "RichardStyles": "Same issue seen on 5.4 - @theNailz solution resolved the missing trait error.. ",
    "iLLia12": "\nChange composer.json to use \"laracasts/generators\": \"dev-master\".\nRun composer update\nIt isn't working for me, the problem appear during run composer update command . I have fixed it for me . In my RouteScanCommand.php \nuse Illuminate\\Console\\AppNamespaceDetectorTrait switched to \nuse Illuminate\\Console\\DetectsApplicationNamespace. i also added \"laracasts/generators\": \"dev-master as 1.1.4\", but i`m not sure is it some how  helps, anyway... \n",
    "ajaykucse": "how can i fixed it anyone help me \n[Symfony\\Component\\Debug\\Exception\\FatalThrowableError]\n  Class 'Illuminate\\Notifications\\NotificationServiceProvider' not found\n. ",
    "teusa": "Confirmed, these fix works. As follows:\nChange composer.json to use \"laracasts/generators\": \"dev-master\".\nRun composer update. ",
    "brytorres": "@erayaydin I'm having the same issue with Laravel 5.5. I've tried all the above recommendations and nothing works. \nI encountered this issue while trying to run \nphp artisan make:migration:schema create_entity_table --schema=\"entity_id:string:unique\" --model=0. Found a solution here for those with this issue with Laravel 5.5:\nOpen MigrationMakeCommand.php in vendor/laracasts/src/Commands/\nAdd this function to it:\n/**\n* fire method seems to handle everything but does not get called\n*/\npublic function handle ()\n{\n    $this->fire();\n}\nAs the user in the other issue noted, other commands might still throw exception errors.. @tahiryasin and @erayaydin I must admit that I wasn't aware of the issues with changing vendor files. @AlbinoDrought solution looks great and I'm about to integrate it asap.. ",
    "tahiryasin": "@brytorres updating files in vendor folder are safe?. ",
    "happy-sadan": "Has this not been fixed ?. > > Has this not been fixed ?\n\nIt was merged but release was not cut, just switch it to master-dev version in composer.\n\nHow can I do this ?. Works perfectly, thanks !\nOn Mon, Dec 3, 2018 at 11:35 PM Bogdan Kharchenko notifications@github.com\nwrote:\n\nHas this not been fixed ?\nIt was merged but release was not cut, just switch it to master-dev\nversion in composer.\nHow can I do this ?\nin require-dev section of composer.json,\nput\n    \"laracasts/generators\": \"dev-master\"\n\n—\nYou are receiving this because you commented.\nReply to this email directly, view it on GitHub\nhttps://github.com/laracasts/Laravel-5-Generators-Extended/issues/129#issuecomment-443896896,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ATOCIXQZoTrO0ninSIhNs90vwt1E93Cgks5u1acygaJpZM4NhoB5\n.\n. \n",
    "amberlampsio": "\nHas this not been fixed ?\n\nIt was merged but release was not cut, just switch it to master-dev version in composer.. > > > Has this not been fixed ?\n\n\nIt was merged but release was not cut, just switch it to master-dev version in composer.\n\nHow can I do this ?\n\nin require-dev section of composer.json, \nput \n\"laracasts/generators\": \"dev-master\". Install dev-master ---\ncomposer require laracasts/generators:dev-master\nShould work just fine, Just tried it.. You have to used dev-master branch, since the maintainers did not tag a new release since this patch was merged.. > Hi @nathanaelytj ,\n\nJeffrey himself hasn't pushed any updates to this project in a while, no. A while back he gave me write access, because we use it in Backpack for Laravel, but we don't need or plan to add any features to it - just keep it working.\nRight now, it IS working on 5.7 - I've used it myself.\nCheers!\n\nPlease cut a new release!\n. ",
    "bericp1": "Note: confirmed that chaging fire->handle does not remove support for Laravel 5.0.. ",
    "rap2hpoutre": "Do you want me to close this PR? Or do you want to merge it?. ",
    "EmanueleCoppola": "Can this be merged?. ",
    "Nks": "Any chance see this in the master branch?. ",
    "divdax": "Yeah please merge @JeffreyWay 😄 . ",
    "tomasienrbc": "Why was this closed? I had this error too . ",
    "cristianuibar": "Not all commands should have a handle method by default? it's missing entirely in the package.. Yes, indeed the method was renamed, #138 fixes the issue.. I can confirm this is still an issue. Any ETA for merging the fix from @bogdankharchenko ?. ",
    "cytRasch": "Take a look at this commit:\nrenamed AppNamespaceDetectorTrait to DetectsApplicationNamespace as p…\nJust follow the changes and everything works fine.. ",
    "OutRunner": "Thanks @cytRasch!\nFor anyone confused, once you've run composer require laracasts/generators --dev and have seen the error message the package will still be on your file system. You can just search your project for the src/Commands/MigrationMakeCommand.php file and make the changes the commit @cytRasch linked above. After that just run composer require laracasts/generators --dev again and it should all be working!. ",
    "johnsvenn": "Rather than changing the files you could include @tabacitu branch in composer rather than updating the files manually e.g.\n```\n{\n    \"name\": \"laravel/laravel\",\n    \"description\": \"The Laravel Framework.\",\n    \"keywords\": [\"framework\", \"laravel\"],\n    \"license\": \"MIT\",\n    \"type\": \"project\",\n    \"repositories\": [\n        {\n            \"type\":\"vcs\",\n            \"url\":\"https://github.com/tabacitu/Laravel-5-Generators-Extended.git\"\n        }\n    ],\n    \"require-dev\": {\n        \"laracasts/generators\": \"dev-package-autodiscovery\",\n    },\netc.\n```\nUpdate composer then run composer update\n(works for me just now in Laravel 5.5.19). @tabacitu - no problem. I was thinking just in terms of a quick fix. But, often quick fixes have a nasty habit of hanging around longer than they should!. ",
    "prinzt": "The names are generated alphabetically.\n\"php artisan make:migration:pivot a b\" or \"php artisan make:migration:pivot b a\"\nwill always be a_b. afaik it's a convention / considered best practice.. ",
    "m3pogrammer": "Thanks for answer. but, why !?. +1. ",
    "rockyx128": "Forgive me for my poor English.\n Aha~. ",
    "sean-swannie": "Based on a \"quick\" look at the code of the SchemaParser functions it looks like you can pass the length after the type declaration. It looks like the parser will split the schema string that you passed into the seperate fields which are then parsed into segments. Each segment is then checked for attributes and options which is then assigned to the variables \"name\", \"type\", \"arguments\" or \"options\" fields which are used to build the stubs.\nFor Example: \n--schema\"title:string(100) email:string:unique another:integer some:string(15):unique\" \nwill be split into the fields...\n1. title:string(100), and then into name = title, type = string, arguments = 100, options = null\n2. email:string:unique, and then into name = email, type = string, arguments = null, options = unique\n3. another:integer, and then into name = another, type = integer, arguments = null, options = null \n4. some:string(15):unique, and then into name = some, type = string, arguments = 15, options = unique. ",
    "michaelradionov": "thanks, @bogdankharchenko. +1. ",
    "Procionegobbo": "+1. ",
    "lexxyungcarter": "So, when is the pull request getting merged to main branch?! 2 months later no action!. ",
    "kentsigurdsen": "+1. "
}