{
    "LeoNatan": "I would really love to, but I have very little experience with pods, and I hear there are issues with Xcode 6 frameworks and pods. \nI would really appreciate any help you can provide.\n. I know what they are.\nThis is what I mean: https://github.com/CocoaPods/CocoaPods/issues/2272\nCocoaTouch framework support is not yet ready.\n. No. This project uses a Cocoa Touch framework, a new feature of Xcode 6 and iOS 8. This is currently not supported by CocoaPods.\nI am not interested in changing the project to be a static library just for Pod support.\n. Let's keep the issue open. Eventually there will be support, and I would like to add support for CocoaPods. \n. I see that you have an appIdentifier parameter, but do not use it to remove only the notifications from that app.\n. The project has been tested on iOS 8 only. I think I use some API there which will not properly work in iOS 7, such as automatic table cell height (in settings). If you do not need this functionality, it could work.\n. What is the error exactly?\n. I am not sure if I will have time to look at iOS7 support. Please feel free to submit PR with fixes. \n. @zuckerbreizh Added support for iOS 7. See readme for instructions how to use the framework.\n. I also prefer the first solution. I will look to implement soon. :+1: \n. @damienrambout Implemented.\n. I will look to solve the problem soon.\n. @gastonborba Please try now, should be fixed. Thanks for reporting this issue!\n. You are quite right, it should be MIT. Doesn't the GitHub project description say so? Will add the license file. \n. Nope, feel free. That's why it's out there. \n. Fixed.\n. What iOS is installed on the iPad? The problem seems to be dyld (dynamic library loader) is unable to open the framework dynamic library. \n. Hm this is strange, it should work by adding the project as a framework. What OS version are you targeting? Perhaps targeting an older version than 8.0 cause the dynamic library to not be added as bundle resource.\n. Hi guys, I've been busy and was unable to look.\nPerhaps it's a signing issue. Try signing the framework with your provisioning profile and see if that helps.\n. Guys, please use the 7.1 method for now, by including the source of the library in your project directly. I have been very busy and did not have time to look at the issue yet.\n. Guys, please see http://stackoverflow.com/questions/24002836/dyld-library-not-loaded-rpath-libswift-stdlib-core-dylib\nThis appears to happen to many people, even with Apple's own Swift dynamic libraries. Make sure to update your certificates at the Apple developer portal, and also make sure to set the signing identity of the library.\n. That's not a solution, that's cheating. :) You are statically linking the library now. That's not what is meant here. In your solution, remember to also take the asset files, or else images will not appear.\n. This is an old issue, no longer reproducing. See main readme how to integrate in Xcode 7. \n. Hi,\nThanks for your pull request.\nCan you please give a short explanation of what the problem is and how this solves it?\nThanks\n. I do not like your last commit with the iOS6 code. I understand why you need it, but it makes the code ugly for the purposes of the project. I will close the merge request for now.\n. Thanks for reporting! I will take a look soon.\n. As I understand it, you should call AudioServicesDisposeSystemSoundID after playback to ensure resources are freed, otherwise you may hit issues. This is an issue because you do not know the duration of the playback.\n. Can you please comment on my above concern?\n. I will take a look some time soon. Thanks\n. I'll take a look, thanks for pointing it out!\nI was able to replicate and will look to fix now.\n. Thanks for your suggestion, will look into it for future updates when I have the time.\n. WhatsApp recently improved their in-app notifications to include a swipe to respond feature. And it's quite a pain to use because if you swipe above a certain threshold, the iOS Notification Center picks up the gesture. So it sometimes works and sometimes doesn't. \n. I am closing this one. I just don't think this works well after playing with WhatsApp's implementation. It is too close to the notification center, and pulling down in most cases opens the notification center, instead of the pan gesture of the notification.\n. There is no point anymore. With iOS 10, you can choose to display remote and user (new term for local) notifications natively. So really, I will be deprecating this framework soon. It is good for what it does on iOS 8 & 9, but with 10 you just get the real, native system implementation.\n. Yes indeed, when handling notifications using the new API (UNUserNotificationCenterDelegate), you have an option to specify whether the notification should be displayed inside the application.\n. Hi,\nTo dismiss, either wait, tap on it or swipe up. If you tap, the notification's handler will be called if set.\n. Not possible at this time. Please state your requirements, as they are not clear. Once the notification is shown, it will be on screen for a few seconds and perish. Is it really needed to be able to hide it faster from code? I guess it is possible to develop, I just wonder what the use case is. Thanks\n. Cheers, now it's more clear. Will see what I can do. \n. @mohpor I am having a problem designing this workflow.\nFor you to know which notification is currently displayed, I could provide a currentlyPresentedNotification property, but managing such a property is difficult. For example, if notifications are presented as alerts, several notifications can overlap and when dismissing the top one, presents the previous one. Now imaging a mix of both banners and alerts.\nYou should change your design to not display notifications if the UI already presents the information of the notification. For example, in a mail application, you would not display a notification of new mails, if the user already has the inbox open and can select the new mails. Likewise, why display a notification if your user can already select a cell and open the view?\nNotifications are meant to be set and forget.\n. @mohpor But even in Apple's case this is the case with their own implementation. If you receive a mail banner notification and while it is open, start the Mail app, the banner will also remain open until it closes.\nI am not saying having this ability is not useful, just that it requires thinking. \n. I will leave the the issue open. Perhaps in some time I will come back to it and think of something better. I am planning some major changes for this library eventually, and will look to incorporate this.\n. Hi,\nThanks for your pull request.\nHow does this work with Xcode dynamic libraries?\n. I think accepted a PR with CocoaPods support? Since I am not familiar with CP, I would like to have some assistance. \n. Guys, as stated in my other project, I am not a fan of CocoaPods, and will not actively support it. I will however find the time to add Carthage support for a modern and better (in my view) management system.\n. I would actually prefer a PR with an implementation of the actual drawer purpose on iOS8 - present custom actions and text input. However I have not found the time to sit and do it. \n. Since the drawer is very easy to hide, let's keep it as is for now. I will find the time eventually to make the drawer. Perhaps iOS9 will inspire me. \n. Yes, and commenting these lines is very easy. :-)\n. My problem with such API is that I need to expose API which is not normally public API. None of the view hierarchy is exposed, nor are there any rendering settings available. So only place left is the notification itself, but that is not the correct place for this issue. Sorry\n. Well, the intent of this library is to give you as much of a native experience as possible. As long as iOS does not provide customization API, I am not sure I want to. \nThanks\n. Thanks, fixed\n. Hi Ash,\nMy implementation of actions is very similar to how UIAlertController handles actions. You should be able to learn from tutorials on that how to handle it with my framework.\nWhat have you tried so far?\nLeo\n. Do you mean the demo app? It is not meant to be memory efficient but demonstrate the library. Feel free to submit pull requests with optimizations. \n. Agree with you that this is needed, and as with #14, I plan to do this at some point.\n. Let's track this issue with the other one. I modified that title to indicate that both action buttons and input fields are needed.\n. BTW, I am not seeing an error on iOS 9.\n. I don't see the point of this. I especially do not like the need for explicit self-> requirement. All blocks in this library are temporary and disposed of correctly, so the possibility of a retain cycle falls only on bad practice by the developer, not the library internally. I will not accept the PR. But thanks for submitting.\n. Just a warning. If you have a weak object, calling weakObject->ivar will crash if weakObject is nil. Make sure to take a strong reference to the object and check for nullity.\n. It means your project was compiled with BitCode, but LNNotificationsUI currently does not have it enabled. Enable BitCode and recompile.\n. Thanks!\n. Hi,\nThanks for reporting this issue. I do not have time to take a look at this. Feel free to play around with the gesture recognizers. If you find a solution, do not fear sending a pull request.\nThanks,\nLeo\n. Look for the swipe gesture recognized. \n. Pan gesture makes more sense when there are options when pulling (as with iOS 8 and above). But this is not supported currently. There is already an issue existing for such an enhancement (#14).\n. I don't have a lot of free time these days, and this is a major undertaking. Pull requests are welcome! :wink: \n. I fixed this in my latest commit. Thanks for the PR!\n. I'll take a look, thanks!\n. Yeah, need to fix that. Need to use the specific bundle API. Thanks\n. Accepted. Forgot to do it yesterday. Thanks!\n. Actually, iOS 7 is supported (unofficially :wink: ) . Dynamic framework are not, but you can add all source files directly to your iOS 7-supported project and it should work, although not tested for a while. This used to be officially stated in the readme file, as well as there was a demo project. I no longer wish to officially support iOS 7.\n. How do you lock your the orientation of your app? Have you set the correct orientation in the app plist?\nAnother option is to implement - (UIInterfaceOrientationMask)application:(UIApplication *)application\n  supportedInterfaceOrientationsForWindow:(UIWindow *)window in your app delegate, and provide the portrait orientation there.\nI am not sure how to solve this. Each window allows its controller stack to determine the allowed orientation. So I could query the main window's allowed orientation, but this is incorrect, as there may be multiple windows alive, each with different supported orientations. Another option is to display notifications only in the orientation the interface was at the time of presentation. I don't like this because the experience suffers for all other applications where rotation is supported.\n. I just tested on my demo project.\nIf the project is defined correctly to only support portrait, notifications do not rotate. Define like so:\n\nIf your entire app is portrait, you should remove all your functions and just use that.\n. @raymondchau-sinodynamic Do you mind submitting a pull request so I can accept?\n. Thanks!\n. What happens if the current application is playing something in addition to the notification sound? Will this call interfere with the playback?\n. I'll be working on the project again and add Carthage support soon. Will close the PR for now, but thanks for submitting it!\n. How does it differ currently with iOS banners? I think my measurements of 2.5/5.0 were accurate, at least at the time of development.\nThere is currently no API to cancel all pending notifications for an app. It shouldn't be difficult to implement, but I have very little free time right now for this library. If you wish to submit a pull request for this, I'd appreciate it.\n. BTW, I see there already exists API for dismissing notifications.\nobjectivec\n- (void)clearPendingNotificationsForApplicationIdentifier:(NSString*)appIdentifier;\n- (void)clearAllPendingNotifications;\nDo these methods not implement what you need? When entering the portions of UI where notifications are not needed, clear them.\n. Exposing the constants as modifiable just doesn't sound right. 😉\nSeriously though, the point of this library is to be as close to Apple's look and feel. This includes animation timing and duration. I would like to keep this rule here. WhatsApp's implementation, for example, feels foreign, and somewhat falls in the uncanny valley due to the liberties they have taken with presentation and drawing of their banners. Feel free to fork the lib and modify the values to your heart's content.\n. Hi,\nCocoaPods is not supported. So I cannot comment if correct because I am not familiar with CocoaPods. \nConsider using Carthage. \n. Hi,\nI'll be removing support for CocoaPods soon. It will only support Carthage.\nWill close this issue for now.\n. Yes, there are plans to support Carthage soon. Cocoa Pods will not be supported.\n. Hi, I will not be supporting Cocoa Pods anymore. I will add support for Carthage soon.\n. Approved! Thank you so much!\n. Sorry but what is this? The distance between the icon and text is 8 points. \n. I will be going to a vacation. When I'm back, I'll take a look.\nThanks for the PR.\n. Good catch, thanks! Want to submit a PR with a fix?\n. CocoaPods is not supported.\n. It's a bad package management system. Carthage is much better, and now that we have the new Swift Package Manager, there is really no need for CocoaPods anymore.\n. I don't understand what the problem is here. UIWindow has a hidden property, which controls if a window is shown or hidden.\n. Approved! Thank you so much!\n. Have you added the framework as a dependency of you main project in build phases?. Adding source files is problematic because the framework has assets, and I'm not sure how I handle them in code. It should just work the way you did it. . Ah I found the issue. \nIt should be @import LNNotificationsUI;. It was a spelling mistake on your part. Take a look at your screenshot, it is written incorrectly.. Does the demo app compile for you?. I am sorry, I don’t understand the problem or the title.. This is internal framework API. You should be providing an action.\nSee:\nhttps://github.com/LeoNatan/LNNotificationsUI/blob/master/LNNotificationsUI/LNNotificationsUI/LNNotification.h\nAlso, take a look at the example project.. Thanks. This doesn’t look correct to me. This stops the currently playing sound, but that sound could belong to a different notification. The correct approach here would be to send notification banners the audio player, and stop it there. \nStopping the global sound is no less correct than not stopping a sound at all.. ",
    "vani2": "I used pods, Xcode 6 and your code, it works good. Pods help us get your last version of this framework. Read this http://guides.cocoapods.org/making/making-a-cocoapod.html Feel free to ask something unclear.\n. If I understand correctly, this issue is about how to create framework from your pod. And there are nothing about creating \"pure\" pod with pod spec file.\n. Ok, I got it, thanks for clarify\n. ",
    "mdeora": "My bad, didn't noticed it earlier, check the latest pull..\n. ",
    "zuckerbreizh": "Just recompile the project for iOS7 and it works ;)\nThanks\n. Yes :( it's not working on ios7, issues with NSLayoutConstraint in LNNNotificationBannerView. I do not need automatic table cell height, is there a solution to have your component working on ios7 ? \nThanks\nC\n. error is : \nException:NSDictionaryOfVariableBindings failed because either one of the values is nil, or there's something wrong with the way the macro is being invoked.  Cannot assign value nil for key \"contV\". Keys:(\n    contV\n)\nThanks for your feedback ;)\nC\n. ",
    "gastonborba": "Works great :+1: thanks so much\n. ",
    "CalQL8ed-K-OS": "¿do you mean the README.md file?\nif so, i can't find it in there, so even if it is, it's kind of burried.\nthanks for the quick turnaround on this, now i don't have to worry about using the code :smile: \n. ",
    "Kjuly": "I'm trying to upgrade my Xcode to c whether it's caused by it.\n. iOS 8.0 (12A365)\n. I added reference to .h/.m files only instead of LNNotificationsUI.xcodeproj from my project, then it works. And of course, need to import lib via #import \"xxx.h\" instead of #import <xxx/xxx.h> then.\n. My \"Deployment Target\" is iOS 8 either. :)\n. @LeoNatan sure, thx anyway :)\n. ",
    "jnordh": "Hello, \nyour Demo App crashes as well! iOS 8.2, xcode 6.2. Same error as described above. :-(\n. ",
    "kittany13": "hello there ... i have found some sort of solution for this problem :\ni opend the .xcodeproj file , copied the project files, all the 15 file + the LNNotificationsUI.h.\nchanged the the LNNotificationsUI.h to:\nimport \"LNNotification.h\"\nimport \"LNNotificationCenter.h\"\nimport \"LNNotificationAppSettings.h\"\nimport \"LNNotificationSettingsController.h\"\nthat's all enjoy ... :)\n. first of all thanks for the great library of yours .....\ni have tried 4 day long to solve the issue because i wanted this library so bad ... \nwhene you solve this issue i'll gladly reuse it 👍 \n. ",
    "refusebt": "Sometimes, I hope the UIViewController force landscape. When trigger the LNNotification, it maybe portrait or landscape base on device. The LNNotification's Orientation is different with the UIViewController. If the LNNotification's Orientation is the same with the statusbar, the problem can be solved.\n. I'm sorry I commit \"IOS6 compatibility\" to your repository. I create a new branch to pull request. I think the orientation problem should be fixed. \n. ",
    "fotiDim": "That would be helpful\n. ",
    "cannyboy": "+1\nI don't think any other in-app notification libraries have this - though I have asked about it https://github.com/hyperoslo/Whisper/issues/67\n. @LeoNatan - do you mean notifications will be shown even if the app is active? (in iOS 10)\n. ",
    "oferRounds": "Makes sense, thanks for the update!\n. ",
    "MHX792": "I still think that this feature should be implemented. Wouldn't it be possible to restrict the gesture area to the lower part of the notification banner? For an additional effect the banner's height can be slightly increased. Unfortunately I am not good at ObjC (I prefer Swift), otherwise I would have tried to implement it.\n. ",
    "devios1": "Sorry I meant programmatically. Is there a way to dismiss a LNNotification object?\n. ",
    "mohpor": "I'm very much in need of this feature too:\nMy app may display a few notifications in a root window, I might tap on one of them and go to another page (which will gracefully dismiss the notification too), but, if I tap a row in my table view and go to the same destination page (which is essentially what tap on notifications will result in too) the notification will wait out it's time and then gets dismissed.\nI want to be able to dismiss the visible notification at any time. I can clear pending notifications, I know that, but if it was possible to dismiss the current notification too, that'd be awesome.\nP.S.: LNNotificationBannerWindow already has the functionality: - (void)dismissNotificationViewWithCompletionBlock:(void(^)())completionBlock; and just needs a finishing touch to be able to link it to the current notification (a banner one of course) and we are good to go.\n. @LeoNatan, I remember when I was reviewing the library to what we can do to mitigate this problem and I came to the same conclusion. but:\n1- We can provide this possibility for notifications other than alerts, because alerts shouldn't be dismissed without user's action IMHO,\n2- I already prevent the app from displaying notifications, but there are cases where we would move to a view which makes the notification obsolete. In those cases, it would very much help the UX if we could dismiss the current notification as well!\n. OK, point taken. Lets move on for now and see what we can do in the future. Thanks for your time and cheers as always.\n. Sounds great, good luck. Let me know if I could help.\n. ",
    "usami-k": "If you want to use frameworks, add use_frameworks! in Podfile.\nCocoaPods can handle Xcode dynamic libraries.\n. ",
    "allaire": "Just saw this commit, but does not fix the above warning: https://github.com/LeoNatan/LNNotificationsUI/commit/4d389d59c8c63b01493b883671f8a5ccce3973ce\n. See https://guides.cocoapods.org/making/getting-setup-with-trunk.html\n. A complete drawer would be cool, but much more time consuming to do. I plan to use LNNotificationsUI as my notification system when the user receives an notification when he's using the app, so hiding the drawer control is required in my case.\n. @LeoNatan What do you mean by very easy to hide? I'm talking about https://github.com/LeoNatan/LNNotificationsUI/blob/master/LNNotificationsUI/LNNotificationsUI/LNNotificationBannerView.m#L211-L254\n. @LeoNatan but since I'm using Cocoapods, each time I update, it will get overwritten, so it's not optimal :-1:\n. Hi Leo,\nI think this will be inevitable at some point to expose an API to customize some elements of the UI like most librairies.\nI'm open to discuss any API design with you so we can find a solution :)\nLet me know, thanks!\n. Heh that's your library, I think having a couple visual settings here and here is not a bad thing, but ultimately it's your call. Have a nice day!\n. ",
    "cashmash": "yes would be cool :)\n. ",
    "ghost": "Is it un cocoa pods?\n. ",
    "ryuheechul": "+1\n. ",
    "irosenb": "+1 :smile: \n. This library isn't technically on Cocoapods, but they do have a podspec. \nI just pointed at the git repo, and cocoapods successfully installed it. Like so: \npod 'LNNotificationsUI', :git => \"https://github.com/LeoNatan/LNNotificationsUI.git\" \n. ",
    "ppaulojr": ":+1:  me too\n. ",
    "PankovSerge": "+1 \n. @irosenb wow, i'll try it, thank 4 your solution\n. ",
    "mehulparmar4ever": "@LeoNatan ,@miscventura\ndid any1 Find Solution for this issue  ????\napp is crash instantly... please share your solution.. need help\n\n. ",
    "rogcui": "Drag the entire xcode project into your own project. Then embed binary the LNNotificationsUI.framework file.\nWorking for me on iOS 9.0.1 .\n. ",
    "miscventura": "Great! Thanks for the reply.\nI got mine working by changing things around a bit.\nNot having any issues anymore.\nimport \"LNNotificationAppSettings.h\"\n\nimport \"LNNotificationAppSettings.m\"\n\n. ",
    "fabb": "No hard feelings. The explicit use of self-> makes programming mistakes less likely. But as you said, all used in the current version are currently safe. \n. Thanks for the tip. I usually refrain from using ivars directly. \n. ",
    "vicky1787": "Can you redirect me as to which class can I handle this exactly, may be a lead to this will help me to update the Component.\n. I am mostly interested in Pangesture rather than Swipe , actually similar like the smoothness to achieve when we to pan gesture to dismiss iOS Push notification / Local notification bar.\n. Appreciate if you can do this , as its best component out of all i have experience and well coded. Hats of for your development and looking for this pending feature.\n. No worries dear as explain I will definitely try I am just new to this Cocoapods, forking and all, will do if i can manage that,\n. I have put this in LNNotificationBannerWindow but i know it will overwrite on the pods update for the fixes you may do to improvise this component.\n-(UIInterfaceOrientationMask)supportedInterfaceOrientations\n{\n    return UIInterfaceOrientationMaskPortrait;\n}\n- (UIInterfaceOrientation)preferredInterfaceOrientationForPresentation\n  {\n  return UIInterfaceOrientationPortrait;\n  }\nCan we have a handle outside to lock or access this.\n. Hello LeoNatan,\nI have implemented the stack in every controller to past the code that will determine what orientation is supported in the view controller.\n`\n```\n -(BOOL)shouldAutorotate\n {\n   return YES;\n }\n\n\n(UIInterfaceOrientationMask)supportedInterfaceOrientations{    //NSLog(@\"supported called in red    1\");\n    return UIInterfaceOrientationMaskPortrait;\n}\n\n\n(BOOL)shouldAutorotateToInterfaceOrientation:(UIInterfaceOrientation)toInterfaceOrientation\n{\n    return toInterfaceOrientation == UIInterfaceOrientationPortrait;\n}\n\n\n(UIInterfaceOrientation)preferredInterfaceOrientationForPresentation\n{\n    return UIInterfaceOrientationPortrait;\n}\n```\n\n\nAlso the customised navigation controller have this code.\n```\n - (BOOL)shouldAutorotate {\n    return [[self.viewControllers lastObject] shouldAutorotate]; \n}\n\n\n(UIInterfaceOrientationMask)supportedInterfaceOrientations {\n    return  [[self.viewControllers lastObject] supportedInterfaceOrientations]; \n}\n\n\n(BOOL)shouldAutorotateToInterfaceOrientation:(UIInterfaceOrientation)toInterfaceOrientation\n{\n    return [[self.viewControllers lastObject] shouldAutorotateToInterfaceOrientation:toInterfaceOrientation]; \n}\n\n\n(UIInterfaceOrientation)preferredInterfaceOrientationForPresentation\n{\n    return [[self.viewControllers lastObject] preferredInterfaceOrientationForPresentation];\n}\n```\n\n\nAs i have some view controller that support both orientation so the above APPDelegate fix is not good. Please suggest me some solution over this.\n. No my few pic gallery full screen views are supporting both orientation hence I can't use the settings above as u mentioned\n. Ok i installed it using this reference link 'https://github.com/LeoNatan/LNNotificationsUI/issues/18'\nBy solution given by ironseb \npod 'LNNotificationsUI', :git => \"https://github.com/LeoNatan/LNNotificationsUI.git\"\nCan you confirm if this is okay :)\n. ",
    "pronebird": "Thank you!\n. I know you don't actively support CocoaPods, but would you mind tagging 0.1.0 / updating version in Podspec and pushing an update to CocoaPods? \nThank you so much, outstanding notifications UI.\n. ",
    "raymondchau-sinodynamic": "Thanks @LeoNatan .\nYour library is really nice. I love it so much.\n. Sorry for such a late reply.\nAs I tested, this call just notify the original sound playing app to resume the music/playing sound. It shouldn't interfere the playback.\n. ",
    "jyounus": "I'm pretty sure it's exactly the same as iOS right now. However the Messages.app by Apple doesn't show any custom alerts while the app is open, if I'm not mistaken.\nHowever WhatsApp uses a custom implementation and that feels like that the cut off time is around 1.5 rather than 2.5. I'm pretty sure they also debounce some in-app notifications, but I can handle that manually, outside of this lib.\nEither way, it doesn't matter. I think some extra flexibility would be nice to allow devs to tweak the duration values. :)\nCool, if I do get a chance to implement this myself, I will definitely submit a PR. \n. Oh wow, I totally didn't realise they existed, they should do exactly what I need!\nAwesome! :D\nNow I just need those constants changed so that I can actually modify their values. :)\n. Fair enough, if you want to strictly keep this lib as close to Apple's look and feel and not allow any modifications, then that's understandable. \nThanks for your help anyway!\n. ",
    "xor22h": "Created pull request for this. I also had some problem. at least with 3 different projects. \n. ",
    "sirnacnud": "Actually the horizontal constraint is putting 11 points between the icon and the message. If it should be 8 instead of 11, then the constraint needs to be fixed.\n[_notificationContentView addConstraints:[NSLayoutConstraint constraintsWithVisualFormat:@\"H:|-15-[_appIcon]-11-[_messageLabel]->=15-|\" options:0 metrics:nil views:NSDictionaryOfVariableBindings(_appIcon, _messageLabel)]];\nEither way, the preferredMaxLayoutWidth needs to use the same constants in the calculation, or it will cause the text to wrap incorrectly for certain strings.\n. ",
    "igorkotkovets": "The lib is still useful because we still need to support iOS8+. Could you have a look to pull request?. ",
    "brightsider": "but why?\n. ",
    "vickydhas": "Yes please. Never mind I fixed it by manually taking the source files\nrather drag and drop of project.\nAs I mentioned I want iOS 8,9 support so have to use this can't go with\napples thing as it's iOS 10 and above only.\n-- \nSent from my iPhone6+\n. Where to import , if you have managed to fixe in your code can you please let me know. so we use the default practise of importing project as Drag and drop. . Okay I tried again by pasting from the Demo app that you have given but\nstill same issue.\n-- \nSent from my iPhone6+\n. Yes please , thats strange and i know i am missing very basic thingy.\n. Only difference is mine is workspace based project and you have a project.\n-- \nSent from my iPhone6+\n. ",
    "solarisis": "u have a function called \n- (void)_userTappedNotification\n{\n    [[LNNotificationCenter defaultCenter] clearSound];\n[self _dismissNotificationViewWithCompletionBlock:_pendingCompletionHandler force:YES];\n\nif(_notificationView.currentNotification != nil && _notificationView.currentNotification.defaultAction.handler != nil)\n{\n    _notificationView.currentNotification.defaultAction.handler(_notificationView.currentNotification.defaultAction);\n}\n\n//    UIStoryboard storyboard = [UIStoryboard storyboardWithName:@\"Main\" bundle:nil];\n//    UIViewController viewController;\n//    viewController = [storyboard instantiateViewControllerWithIdentifier:@\"PushVC\"];\n//    self.window.rootViewController = viewController;\n//    [self.window makeKeyAndVisible];\n}\nhow do I push a view controller when I click on this notification... "
}