{
    "natecavanaugh": "Heya Aaron, please send the pull request to me :)\n. Hi there,\nSorry for the delay in getting back to you, but if you take a look at: https://github.com/liferay/alloy-ui/blob/master/demos/io-request/index.html#L104\nYou can see how you would pass in the parameter.\nUnfortunately, the YUI option only accepts either a string ID or a raw element (so nodes or selectors don't work). I agree that this is a weird part of their API considering everything else works with selectors and nodes.\nIf you already have the element as a node (for instance, in your case above, you should be able to do: id: my_form.getDOM().\nAdding it as an example is a great idea.\nThanks!\n. Hi Jeroen,\nI'm not sure why you can't do a checkout. That is quite strange.\nHowever, if you don't care about having all of the history, you can do:\ngit clone --depth 1 git://github.com/liferay/alloy-ui.git\nYou can change depth to being whatever you want it to be (the higher the entry, the more commit entries you'll get).\nWe have done aggressive garbage collection, but that actually won't fix anything, since garbage collection runs locally.\nThe problem/benefit with git is that the repo size is because of the history of everything that was ever committed.\nThis repo used to be on Subversion, and since we didn't have git modules, we stored YUI as a zip in the repo (with a build task to extract it properly).\nBut in addition to that, we also have other large binaries that have been committed at one time or another. These all exist in the history.\nWe're currently looking at ways to remedy this, but whichever path we take will require deleting some history, which will cause some problems for people who already have the repo cloned. Basically, we're trying to find a way to minimize those problems, and reduce the repo size down to a manageable level.\nI hope that helps give some context :)\nThanks Jeroen\n. Hey Zeno,\nCan you give me an example? This sort of thing could be fixable right now\nif you want to shoot a pull request (but let me know which ones you mean\nand I'll see if I can help you remove them).\nThanks,\nNate Cavanaugh\nDirector of UI Engineering\nLiferay, Inc.\nEnterprise. Open Source. For life\nOn Thu, Aug 9, 2012 at 7:16 PM, Zeno Rocha notifications@github.com wrote:\n\nThere's a lot of trailing spaces along all the project, we need to make\nsure that it's not going to happen on the new version.\n—\nReply to this email directly or view it on GitHubhttps://github.com/liferay/alloy-ui/issues/11.\n. Hi Zeno,\nI totally agree. We actually have a very consistent pattern in Liferay\n(this is documented on our internal wiki), and ideally it would be the same\nacross the board (that way developers don't have to learn two types of\nformatting).\n\nDo you know of any tools that help enforce different coding standards?\nThanks Zeno,\nNate Cavanaugh\nDirector of UI Engineering\nLiferay, Inc.\nEnterprise. Open Source. For life\nOn Thu, Aug 9, 2012 at 7:29 PM, Zeno Rocha notifications@github.com wrote:\n\nWe need to define a code style for the project. I've seen a mix between\ntabs vs spaces, for example.\nSome consolidated definitions:\n- Idiomatic JS https://github.com/rwldrn/idiomatic.js/\n- Idiomatic CSS https://github.com/necolas/idiomatic-css/\n- jQuery Core Style Guidelineshttp://docs.jquery.com/JQuery_Core_Style_Guidelines\n- Dojo Style Guide http://dojotoolkit.org/community/styleGuide\n- Google JavaScript Guidehttp://google-styleguide.googlecode.com/svn/trunk/javascriptguide.xml\nMaybe we could follow the YUI's code style (if it exists).\n—\nReply to this email directly or view it on GitHubhttps://github.com/liferay/alloy-ui/issues/12.\n. Hey guys,\nRegarding the https, it's not as simple as purchasing the certificate for alloyui.com. The reason is because the CDN is what serves the content, so the cert has to be stored and served by the CDN.\nThe cost for doing this is considerably more than $60 dollars a year. We're currently in the process of setting up a global domain for all Liferay properties to be able to access it, but it won't be the same domain.\nIt may be similar, but probably won't be able to just have a protocol-less url (which might be better... the protocol-less method doesn't work if you copy/paste it into a file that you're testing with running from your local file system).\n\nAbout the combo handler, we've discussed having it on a node js instance before, but there's little value at this point. We'd have to create another server to just run node js for the combo handler, as well as write this combo handler (and debug any potential issues).\nWe already have one that runs in PHP, we've been using it for years and unless we can have some sort of quantifiable reason to change, it would simply be a distraction.\n@jonathantneal about why it's not a \"plugin\" is that it needs to concatenate the files on the server-side to return all requested modules in one http request.\nIn Liferay, our combo handler is in Java, but Eduardo also wrote one in PHP to run from a host that only has PHP (which is far more common).\nI believe people have written other ports for it in other languages, but not sure.\n. We're getting SSL support for the CDN, but it just won't be under the same\ndomain. I'm not sure what it will be quite yet, but as soon as I know, I'll\nupdate the ticket.\nNate Cavanaugh\nDirector of UI Engineering\nLiferay, Inc.\nEnterprise. Open Source. For life\nOn Wed, Mar 20, 2013 at 3:56 PM, Eduardo Lundgren\nnotifications@github.comwrote:\n\nI would love having https support for CDN.\n@natecavanaugh https://github.com/natecavanaugh What is needed in order\nto make our CDN run https?\n—\nReply to this email directly or view it on GitHubhttps://github.com/liferay/alloy-ui/issues/25#issuecomment-15209194\n.\n. Hi there,\nWe'll be notifying everyone officially shortly, but we do now have https setup for the cdn, though it requires a different domain (one that's shared for all Liferay properties).\n\nThe URL to access it is: https://cdn.lfrs.sl/alloyui.com/2.0.0pr6/aui/aui-min.js (you can replace the 2.0.0pr6 with the appropriate version).\nOr, to access any file from our cdn via https, you would just replace this:\nhttp://cdn.alloyui.com/\nwith:\nhttps://cdn.lfrs.sl/alloyui.com/\nI'll close this one out, but we'll make sure to update the website to share this data.\nThanks!\n. Hi @megastef \nThis should be working now (I tested it and it is now sending the proper headers).\nI'm going to close this one out, but let me know if you are still having an issue.\nThanks again for the heads up :)\n. ",
    "clovisdasilvaneto": "Just started reviewing :) :octocat: Sent from GH.. ",
    "jonmak08": "Forgot to specify Nate in the pull request.\n. Hey @origineil02,\nThank you for submitting this update.  You can track this update at https://issues.liferay.com/browse/AUI-1389.\nPlease let me know if you have any questions.  Thanks!\n. Closing pull request as this will be updated via a cherry pick from https://github.com/liferay/alloy-ui\n. Hey @origineil02,\nThank you for submitting this update.  You can track this update at https://issues.liferay.com/browse/AUI-1389.\nPlease let me know if you have any questions.  Thanks!\n. Closing pull request as this will be updated via a cherry pick from https://github.com/liferay/alloy-ui\n. Hey @origineil02,\nThank you for submitting this update.  This update can be tracked at https://issues.liferay.com/browse/AUI-1389.\nNew Pull Request: https://github.com/eduardolundgren/alloy-ui/pull/565\nPlease let me know if you have any questions.  Thanks!\n. Hey @gamerson,\nCan you send this to @eduardolundgren for review instead of the @liferay account?\nhttps://github.com/eduardolundgren/alloy-ui\nThanks!\n. Hey @origineil02,\nThank you for submitting this pull request to @liferay.  We appreciate your help in making Alloy UI a better product.  We love having community questions, suggestions, and involvement.   \nI have reviewed this change and have sent it over to @eduardolundgren to be pushed into the alloy-ui repository.\nNew Pull Request: https://github.com/eduardolundgren/alloy-ui/pull/751\nPlease let me know if you have any questions.  Thanks!\n. Hey @randsonjs,\nI have reviewed this update and have sent it to @eduardolundgren for final review to merge into alloy-ui/master.\nNew Pull Request: https://github.com/eduardolundgren/alloy-ui/pull/806\nThank you for your help in making AlloyUI better.  We appreciate all your help from the community.\nPlease let me know if you have any questions.  Thanks!\n. For future updates, please create a ticket detailing the update at https://issues.liferay.com/.  I have created a ticket for this issue at https://issues.liferay.com/browse/AUI-1717.\nPlease let me know if you have any questions.  Thanks!\n. Hi @hiwjcn,\n@natecavanaugh has posted a blog about the future of Alloy UI as discuss and decide what will be best.  You can read the blog at https://www.liferay.com/web/nathan.cavanaugh/blog/-/blogs/yui-liferay-and-the-future.\nPlease let me know if you have any questions.  Thanks!\n. Hi @thenets,\nWe do have a secure CDN available at https://cdn.lfrs.sl/alloyui.com/3.0.1/aui/aui-min.js, but please note that this is not an official release to our CDN server.\nPlease let me know if you have any questions. Thanks!\n. I have @jhanda looking into this issue, but I have gone ahead and changed all the JIRA tickets that were affected back to their closed status.\n. Hi @sunishkumar,\nI am closing this issue if there is no further discussion regarding the various releases.  If you continue to have questions or issues regarding the various releases, please feel free to reopen this issue or file a new issue.\nPlease let me know if you have any questions. Thanks!. Hi @Palbear,\nThe attribute maxPageLinks is only an attribute in Alloy UI 1.5.x.  In Alloy UI 2.0.x and above, this attribute was removed and replaced with the attribute total.  I have created a JIRA ticket in our system for this issue at https://issues.liferay.com/browse/AUI-3098.\nPlease let me know if you have any questions. Thanks for reporting this issue and making our product and website better!. Reviewed and Merged.  Thanks!. Hi @FirasAbbasi,\nThanks for reporting this issue.  I have created a ticket in JIRA for this issue at https://issues.liferay.com/browse/AUI-3128.  We will use this ticket to resolve the issue and report back on its status when it is completed.\nPlease let me know if you have any questions. Thanks!. Reviewed and Merged.  Thanks!. Closing as this is not a pull request.. Hi @oshingc,\nUnfortunately, Alloy UI is being deprecated and nothing new is being added to the project; so a new Bootstrap 4 compatible version will not be developed.  We are strictly in maintenance mode on this project going forward.\nSorry for the inconvenience!\nPlease let me know if you have any questions. Thanks!. Hi @waqar2012,\nI just tested the aui-scheduler in Safari (Version 11.1.1 (13605.2.8)) on my Mac (High Sierra 10.13.5) and it rendered fine.  Please see below:\n\nCan you provide your browser and OS information?\nPlease let me know if you have any questions. Thanks!\n. Closing issue as there has been no update.  If you feel there is still a problem, please feel free to reopen the issue and add additional comments.\nThank you!. Hey @sky0123,\nI am closing this pull request since there is no new code to be reviewed.\nIf this is in error, please feel free to reopen and comment with what needs to be reviewed.\nPlease let me know if you have any questions. Thanks!\n. Hi @jan-tosovsky-cz,\nYou can achieve you desired result of not having the tooltip displayed on load by adding the attribute visible: false to your configuration object on component instantiation.\nEx.\njavascript\nYUI().use(\n  'aui-tooltip',\n  function(Y) {\n    new Y.Tooltip(\n      {\n        trigger: '#myTooltip',\n        position: 'right',\n        visible: false\n      }\n    ).render();\n  }\n);\nPlease let me know if you have any questions. Thanks!. Hey @rodrigopaulino,\nI'll be reviewing this today.  Sorry for the delay.\nPlease let me know if you have any questions. Thanks!. Reviewed and Merged.  See https://github.com/liferay/alloy-ui/compare/efdff6c050d5cfcc069028ca48b410f0baca3a18...d9f384cc2851f81a18f13d7678a725dccf46a40f. ",
    "eduardolundgren": "Do you still need review on this pull?\nRegards,\n. Why the pull is closed? Can you reopen it?\n. Thank you for the pull Zeno! We have a lot to improve together :)\n. I recommend Google Closure style guide with few exceptions, for instance, the underscore on private members in the end of the name.\nI have been using this style on my components and personal projects and seems to be very close to what we have in Alloy/Liferay.\nhttp://google-styleguide.googlecode.com/svn/trunk/javascriptguide.xml\n. Fixed on 1ab1ffae8e2e70221c9b7b2357583db3a22d75fa.\n. Hello, this is already fixed on YUI repo, see https://github.com/yui/yui3/blob/master/src/node/js/node-style.js#L11\nThank you for reporting!\n. Could you send the pull to @jonmak08? And make sure also send it to 2.0.x branch if make sense.\nThank you!\n. I would love having https support for CDN.\n@natecavanaugh What is needed in order to make our CDN run https?\n. Actually, our core components will use @metal as core. Metal.js creates a jQuery plugin for each component written on it, and for HTML markup we will go with Bootstrap 3 syntax.\n. Could you send to my user if its still valid? Thx.\n. Could you send to my user if still valid? Thx.\n. Could you send this pull to my user in case its still valid? Thx.\n. Could you send to my user? Thx.\n. Yep. Leave this issue open here. It's something I have planned to fix before GA. Thanks @juandopazo.\n. :+1: \n. Is that supposed to be sent to me?\n. Either one, he can forward to me after. Thx.\n. Thank you for reporting. We are going to analyze the issue.\n. Yes, you can combine any YUI skin with any Bootstrap 2 theme.\n. We have plans for adding AlloyUI to NPM for the next quarter.\n. /cc @jonmak08 . Variable initialization on scheduler is done on this file and shared with other scheduler sub-modules. Need to double check if scheduler is still working after the move.\n. ",
    "ipeychev": "Yes, Eduardo, I do.\nThanks!\n. ",
    "kastork": "Thanks Nate, I'll check it out.\n. ",
    "asystance": "I can't even do a checkout of the repo!\n$ git clone git://github.com/liferay/alloy-ui.git\nCloning into 'alloy-ui'...\nremote: Counting objects: 78515, done.\nremote: Compressing objects: 100% (18071/18071), done.\nremote: Total 78515 (delta 57345), reused 78054 (delta 56979)\nReceiving objects: 100% (78515/78515), 503.46 MiB | 1.58 MiB/s, done.\nerror: index-pack died of signal 95)\nfatal: index-pack failed\nYUI3's git repository (the .git directory) is just 148MB, so something is terribly wrong here :)\nHave you tried (aggressive) garbage collection?\nYou could move api, demos and sandbox/ into different repositories.\nSince api is derived from src, there's no need to use version control at all.\n. ",
    "zenorocha": "Hey Jeroen,\nThanks for your concern.\nWe are planning to move some of those things to the website's repository.\nhttps://github.com/zenorocha/alloyui.com/issues/1\nhttps://github.com/zenorocha/alloyui.com/issues/5\nAs @natecavanaugh said, we are looking at ways to remedy this problem.\n. I just sent a pull request removing them, but I created this issue just to remember that we need to take care with those kind of things in the new version.\n. Thanks @brunocoelho! For those who use Sublime Text there's a similar option to.\n1. Install Trailling Spaces plugin\n2. Add \"trim_trailing_white_space_on_save\": true to your user settings.\n. Nice!\nI don't know any tools that can help us detecting different coding standards, but I'll see if I can find one.\n. While I was writing examples for alloyui.com, I remembered how important this Code Style Guide is and because of that I returned to this issue again.\nWell, I made some research and I think I finally found a solution.\nYUI-Lint, a new project from YUI Team that offers a set of configurations to use with JSLint. \nThe good thing about this is:\n1. It's written in NodeJS, so we can easily integrate with Shifter (alloy-ui) or Docpad (alloyui.com)\n2. We are not going to have just a document that declares our rules\n3. Instead we are going to have a tool that can be attached to our code editors to automate the process of verifying if that piece of code follows our rules or not\nWhat do you think?\n. Just added it to the alloyui.com repository.\nhttps://github.com/zenorocha/alloyui.com#jshint\n. Hi @kastork, sorry for the delay here. We haven't been looking at github tickets, since we've started using Jira for tracking issues instead.\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\nWe have a table that lists the AlloyUI versions used in each Liferay version.\nhttps://github.com/liferay/alloy-ui/wiki/Liferay-Integration\n. Sorry about that @jonathantneal.\nYou're right, we should add the possibility of loading AlloyUI with HTTPS, that's very important. I'll talk to @natecavanaugh and see if we can get this working on our CDN.\nI sent the pull request to cdnjs a couple months ago, but I'm afraid it doesn't work there, because we need some YUI Combo configuration on server.\n. Changing this PHP combo to a NodeJS one is in the backlog too.\n. I didn't noticed, thanks for reporting @jonathantneal :)\n. Hey @jonathantneal,\nI understand what you feel.\nTo write plugins for AlloyUI you're going to use this \"Component\" module, that's an extension of YUI Widget. All AlloyUI widgets inherit from this base class. \nBut we didn't documented yet =/\nSo I'll make sure to prioritize it on our todo list.\n. I agree with you @jonathantneal, this style guide is bad for a lot of reasons.\nFor each day that we mantain it, we keep new users away.\nSince Liferay still use it @brianchandotcom decided to keep it.\n. We don't support IE6 @themorecolor.\n. Next time, keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. Hey @juandopazo,\nWould be awesome to collaborate and avoid doubling efforts. \nAt this moment, we still need to add our implementation in the Gallery.\n. Btw, what do you think about our implementation? Is there any additional feature you would like to see?\n. Moved to Jira: http://issues.liferay.com/browse/AUI-940?focusedCommentId=328126\n. Hi @zekenie, sorry for the delay here. We haven't been looking at GitHub tickets, since we've started using Jira for tracking issues instead.\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\nWe couldn't reproduce the error, so if you're still facing it please create a JSFiddle and send us the link.\n. Hey guys,\nI'm happy that you managed to send this PR.\nThe problem is, those are country-specific validations, if we start adding specific validations for each country this project will be super bloated. My advice (not only for this project) is try to open an issue to discuss things before, that way you can save time :)\n. Oh that's true. Thanks a lot for reporting it @juandopazo :)\n\n. @eduardolundgren have you seen this?\n. Hey @GlitterCakes,\nWe're planning to publish them into the YUI Gallery next month.\nI'll let you know.\n. Thanks @pkvn!\nhttps://github.com/eduardolundgren/alloy-ui/pull/712\n. Keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. We still haven't add it to npm but you can track the progress of this issue on AUI-1604\nNext time, keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. Thanks for fixing it @rafael-lima :)\nReviewed at: https://github.com/eduardolundgren/alloy-ui/pull/388\n. This issue can be closed now.\n. Hey @F21,\nWe do have plans to push all AlloyUI modules to YUI gallery.\nI can't give you a deadline right now but I just want to let you know that we're already in contact with the YUI team to make it happen.\n. I put together a JSFiddle to reproduce this error and you're right, it's not working.\nhttp://jsfiddle.net/qyfadbe2/1/\n. However this problem was already fixed in latest versions.\nSee this example running with v3.0.0pr1: http://jsfiddle.net/qyfadbe2/2/\n. Next time, keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. Hey @sergeyrolich, thanks for reporting.\nCould you post this problem and the steps to produce it on Jira instead of GitHub Issues?\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. https://www.liferay.com/web/nathan.cavanaugh/blog/-/blogs/yui-liferay-and-the-future\n. This PR https://github.com/liferay/alloyui.com/pull/186 fixes this issue. It will be live pretty soon.\n. Thanks for reporting @lifeart :D\n. Done, clear your cache and you'll see it fixed\n. Thanks for reporting @megastef, we requested our provider to add this header and we'll let you know when it's done.\n. ",
    "phasebash": "This repository layout appears to follow YUI3's previous repo structure.  api/ and demo/ could probably be broken out into another git project, while build/ could arguably be distilled to a release artifact and not kept in the repo.  Also, by adopting the new YUI3 yuidoc node module and deploying a static site (pehaps on liferay.com proper), we could lessen the load on most root folders.  If there are relative paths between demo/ and build/, those could probably be resolved against the YUI CDN.\n. +1 for Shifter and JsLint. \n. ",
    "brunocoelho": "Do you guys use vim? Add these lines at your .vimrc and it will remove automatically trailing spaces when you save a file.\nshell\n\" Strip trailing whitespace\nfunction! <SID>StripTrailingWhitespaces()\n  \" Preparation: save last search, and cursor position.\n  let _s=@/\n  let l = line(\".\")\n  let c = col(\".\")\n  \" Do the business:\n  %s/\\s\\+$//e\n  \" Clean up: restore previous search history, and cursor position\n  let @/=_s\n  call cursor(l, c)\nendfunction\nautocmd BufWritePre * :call <SID>StripTrailingWhitespaces()\n. ",
    "jonathantneal": "http://alloyui.com/tutorials/\nNIT PICKING ALERT\nThe current indentation is somewhat maddening, and note the function (Y) vs function(Y).\njs\nYUI().use(\n  'node',\n  'transition',\n  function (Y) {\n    Y.one('.aui-btn').on(\n      'click', function() {\n        this.transition(\n          {\n            width: '500px'\n          }\n        );\n      }\n    );\n  }\n);\njs\nYUI().use(\n  'aui-carousel',\n  function(Y) {\n    new Y.Carousel(\n      {\n        contentBox: '#myCarousel',\n      }\n    ).render();\n  }\n);\n. Yea, cdnjs is great. What say you, @zenorocha, @natecavanaugh?\n. Well, a week has passed, and there's no rule that I know of against updating the cdnjs repository, so I'll go ahead and do that. Version 2.0.0pr3 is awesome enough for alloyui.com. :cake:\n. Interesting. So, by default, AUI relies on a php combinator?\nI'd have guessed the combinator was just a plugin, since alloyui runs in so many different environments. Liferay uses Java, and I think alloyui.com is built with Node and runs on PHP.\n. What I meant by \"a plugin\" is \"an amendment to the out of box Alloy\"; the goal being to not rely on a combinator, which then relies on php.\nIt's a bummer that you guys can't get an SSL for the CDN. I wonder how cdnjs does it.\nAnd I was wrong about the $60 a year, sometimes you can get them for as cheap as >$20.\n. @zenorocha, @djalmaaraujo, thanks. I'll help write up documentation, or at least a blog post about it, once it's available.\nI have a backlog of native js stuff I've written the last few weeks that I would like to try and put into Alloy.\n- Font-face loading\n- Menu intents\n- Flash and Silverlight embedding\n- Neat coloring box effects\nAnd scalable text and a few other little guys that I think would be useful for the community. If you guys get a chance to hop on IRC or whatever you prefer, I'd love to chat more. Again, let me know if I can help with the documentation - I certainly need to learn it.\n. That all sounds pretty neat. http://metaljs.com/\nYou folks sure do make cool things.\nDoes this mean my issue resolved by https://github.com/metal/metal.js/wiki/Creating-your-own-component ? If so, I’ll consider this issue resolved and report this sweet news back to my senior engineer.\n. Hey all,\nI took a thorough look at the code examples tonight. I went ahead and applied the following rules, usually because they were consistent with the rest of the documentation, and in harmony with most formatting guides:\n- Braces are followed by indented children on new lines, with the child commas followed by new lines.\n- Parentheses, brackets, and all other commas are not followed by new lines or indented children.\n- Anonymous functions have one space between the declaration and the opening parenthesis.\n- Single-line comments start with two slashes and one space.\n- Hexidecimal colors are written uppercase.\n- Dissimilar declarations (\"different thoughts\") are separated by an empty line.\n- Markdown JavaScript sections have one empty line outside each of their boundaries, but none touching inside their boundaries.\nI've file a pull request:\nhttps://github.com/liferay/alloyui.com/pull/161\nBy the way, this pull request happens to resolve two related issues:\nUnexpected identifier @ http://alloyui.com/examples/datatable/real-world/\nCSS 404 @ http://alloyui.com/examples/video/ & http://alloyui.com/examples/video/real-world/\n. ",
    "guli": "Sorry,\nThank you for the answer.\n. ",
    "marclundgren": "Sorry, my gitpr script got wiped out and didn't have my default reviewer enabled.\n. ",
    "balupton": "Whoops, wrong repo. Moved to: https://github.com/liferay/alloyui.com/issues/145\n. Whoops! wrong repo. Moved to https://github.com/liferay/alloyui.com/issues/144\n. ",
    "peterborkuti": "Sorry, I forgot to choose an appropriate base repo.\n. ",
    "wesbos": "Looks like cdnjs provides a https version:\nhttps://cdnjs.cloudflare.com/ajax/libs/alloy-ui/1.0.1/aui-min.js\n. ",
    "sammso": "Indeed interesting, the PHP combinator is simple, may be should also have nodejs and java ports from it.\n. ",
    "llessurb": "Has there been any progress made on this request? I am attempting to get started with using AlloyUI on a project, and my site is always accessed via https. In a browser like Chrome, the alloyui js is not loaded with the page, because it is an insecure URL accessed from a secure URL. The recommendation seems to be to not host the AlloyUi js locally, but without an https URL, that would be my only option if I want to avoid possible browser issues for my users accessing the site.\n. ",
    "djalmaaraujo": "Hi @jonathantneal, we will fix this ASAP, that's a promise.\n. ",
    "manpreetssethi": "@zenorocha I found out about AlloyUI recently, and it's awesome! That said, would love to extend the library to write some plugins, but can't find the documentation, some examples perhaps?\nThanks in advance.\n. ",
    "netlander": "Liferay are moving away from alloyUI more towards JQuery/Bootstrap 3.\n. Will this be for 7.0 or later?\n. ",
    "mairatma": "Hi @gvaish, sorry for the delay here. We haven't been looking at github tickets, since we've started using Jira for tracking issues instead.\nAnyway, I've just checked the current version of alloy and it's working well on firefox, so this is probably not an issue anymore: http://alloyui.com/examples/audio/\n. Next time, keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. Hi @pkvn, thanks again for reporting this. I've just created an issue on Jira and we'll be fixing it soon: https://issues.liferay.com/browse/AUI-1605.\n. Next time, keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. Hi @mese79, sorry for the delay here. We haven't been looking at github tickets, since we've started using Jira for tracking issues instead. \nNot sure if you still need this information but, in case you do, you just need to set the activeCoord datatable attribute to change the active record (something like: datatable.set('activeCoord', [1, 0]) to select the second row). Same goes when deselecting everything, it can be done via activeCoord as well (something like: datatable.set('activeCoord', [-1, -1]). And finally, to get the whole model data from a record you can just use the getAttrs method: record.getAttrs().\n. Next time, keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\n. Hi @Divran, thanks for the suggestion. \nI've created an issue on Jira for this, since we're not using github issues anymore (see https://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues). I'll close this then, but you can take a look at the Jira ticket instead for updates about this: https://issues.liferay.com/browse/AUI-1675.\n. Thanks a lot for reporting these problems. I've opened two separate jira issues for those (https://issues.liferay.com/browse/AUI-1837 and https://issues.liferay.com/browse/AUI-1838).\nNext time, keep in mind that issues should be posted on Jira instead of GitHub :)\nhttps://github.com/liferay/alloy-ui/blob/master/CONTRIBUTING.md#1-issues\nI'll close this since we'll be working on the jira issues instead then. You should be able to access them too if you wish to see the progress or add something.\n. We've just added the distributions files to the most recent version of alloy-ui for bower, so you should be able to use it now. Sorry for the delay on this :)\n. I don't believe there's a way to do this out of the box, but AlloyUI's scheduler allows you to implement your own views and use them, so you could try implementing a new view for it. The only requirement is that it has to extend from SchedulerDayView, so you should take a look at it and see if extending it or one of the other existing views (like SchedulerWeekView, which is the one in the example you showed) can be enough for your purposes. Since the columns won't be dates I'm not sure how easy it will be though.\n. Hi @mbowerman. First of all, thanks for the contribution!\nThe code looks good, but we have some contributing guidelines that need to be followed for a commit to be pushed to liferay/alloy-ui, so let me explain it to you:\n1) The code has some lint errors. Before sending a pr to alloy-ui you should run gulp lint, it will expose those errors so you can fix them.\n2) Pull requests for alloy-ui should be first sent to @thiago-rocha, instead of liferay.\n3) Pull requests should always come with a test for the change it makes. In this case, just add a test case to fix this new feature and run the tests with gulp test to make sure all pass.\n4) Changes should be added to the HISTORY.md file for the changed modules. You basically just need to add one more line to the HISTORY.md file for aui-form-validator with the information about the jira ticket that this pr is for.\nCan you make these changes and then send this again, but this time to @thiago-rocha?\n. Oh, no problem at all. At least I've already gone through some of the contribution guidelines with him. It's great having more people contribute :)\nBy the way, I also don't like the github interface for this, so I'd suggest using Node GH if you like using the terminal. It's pretty simple to install, and to use it you just type gh pr -s thiago-rocha for example, to send the current branch as a pr to a certain user. There are many other features too, and it's supported by some Liferay engineers, so just putting it out here in case you guys didn't know about it.\n. It's true, we're using Jira now, but since this is simple to answer I'll take the chance and explain here.\nThe component is not wrong actually, nor is the demo. The date being passed to the component is in February, not in January. The javascript Date object uses zero indexed numbers for month codes, so January is 0 and February is 1, even though it looks weird. To confirm, just type on your browser's console: new Date(2013, 1, 4, 5).toString(). This will output something like: Mon Feb 04 2013 05:00:00 GMT-0300 (BRT).\n. @blzaugg, it may be a coincidence by I think that this pr somehow caused the jira issues related to the commits to be reopened. I got many emails, and the issues are all from commits in this pr, all being reopened with a message saying that github rejected them. Check out the screenshot:\n\nDo you know what could have caused this?\n. Can you show the code where you're creating the from builder instance? If you add this right after that code it should work.\n. We support multiple older versions of alloy-ui, due to projects that are still using them. When starting a new project I'd recommend using the latest regular version, 3.1.0, which is the latest in npm. Let me know if that helped.. ",
    "yuchi": "Sure!\n. Sure Eduardo, I'll work on it early next week.\n. ",
    "mese79": "Any way please?\n. dataTable.set('data', myData);\nThanks.\n. I'll try some themes from here : http://bootswatch.com/2/ .\nThanks.\n. Glad to hear it!\nI'm using AlloyUI with node-webkit sdk, so it would be great to have AlloyUI via npm.\n. ",
    "mariol3": "Hello! Alloy DataTable is based on YUI DataTable so I suggest you to read both Alloy and YUI documentation.\nAnyway you can find something here: http://yuilibrary.com/yui/docs/datatable/#getting-data\nYou can also find an example here: http://yuilibrary.com/yui/docs/datatable/datatable-dsget.html\nHope it helps!\n. ",
    "juandopazo": "The only thing my version has that AUI's doesn't have is keyboard support, which is nice for accessibility.\nOtherwise they're both pretty similar and they suffer from the same defects:: little docs and no unit/functional tests. :trollface: \n. ",
    "jojovem": "+1\n. ",
    "emfol": "+1\n. ",
    "tluciano": "Ok, \nit is clear that the commit was unnecessary. \nBut it is possbible to come out with a solution that holds complementary and generic functions? \nAs this specific validation would be very useful to brazillian developers.\nWhat do you think?\n. ",
    "GlitterCakes": "Thank you very much, we look forward to using it =)\n. ",
    "blzaugg": "I sent it to Zeno, should it be you instead?\n. It was me. I intended to send a PR to myself, but must have sent it to Liferay by mistake. Jira is going nuts right now, sending emails to a lot of people.\n. ",
    "pkvn": "@eduardolundgren Thank you. Cheers!\n. ",
    "henvic": "@eduardolundgren, @zenorocha please review.\n. I'm closing this pull request and opening it again at @eduardolundgren's fork: https://github.com/eduardolundgren/alloy-ui/pull/433\n. Dear @jawedkhan,\nthis isn't the appropriate channel for this kind of question.\nI recommend you use www.stackoverflow.com to search for that. Also, try hard not to ask it there as many people already did so it's easier for everyone if you just google for an answer. Find an answer there instead and try to compose the crucial parts to this question on your mind instead parts (for what I see it can be divided in two questions: 1) how to store data using MySQL using PHP, 2) how to send the scheduler data to the server).\n. I've checked once again and it seems fine. I've searched all the project for lines like this but found none or found later that it was used and then re-wrote the lines on the files that used them (see commit 3360a67).\n@zenorocha, can you take a look to make sure this pull request is ok?\n. ",
    "rowbare": "I ran into that too. It is an issue with the draggable option. You can tab through the inputs but can't click on them. Buttons work though.\nAs a workaround, If you set draggable to false it should take focus.\n. ",
    "gamerson": "Sure thing.\nOn Sat, Aug 16, 2014 at 3:59 AM, Jonathan Mak notifications@github.com\nwrote:\n\nHey @gamerson https://github.com/gamerson,\nCan you send this to @eduardolundgren https://github.com/eduardolundgren\nfor review instead of the @liferay https://github.com/liferay account?\nhttps://github.com/eduardolundgren/alloy-ui\nThanks!\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/liferay/alloy-ui/pull/68#issuecomment-52350990.\n\n\nGreg Amerson\nLiferay Developer Tools\nLiferay, Inc. www.liferay.com\n. ",
    "mthadley": "Wrong reviewer, closing.\n. ",
    "sergeyrolich": "I post this problem on Jira https://issues.liferay.com/browse/AUI-1620\n. ",
    "rands0n": "Thanks @jonmak08 :) \n. I've created an issue here: https://issues.liferay.com/browse/AUI-1751\n. ",
    "IgorMarques": "I'm getting this error too. It's a rails app deployed at heroku. You can check it the \"implementation\" field in this form here:\nhttp://that-s-the-way-you-do-it.herokuapp.com/docs/new\nRunning local everything is fine.\n. ",
    "lifeart": "Awesome! \n. example: http://codepen.io/lifeart/pen/mympwG\n. if image has styled max-width or max-height, and image bigger then (max-width or max-height), cropper has a Zoom problems.\n. ",
    "thiago-rocha": "2b4639155d3b9080d75a1669fa3b0bd8df52eb11\n. ",
    "brunobasto": "@BaurzhanSakhariev Can you give more detailed info about what failed?\nThanks,\n. There is no toJSON method by default, but one way of doing that would be:\n```\nvar serializedFields = [];\nformBuilder.get('fields').each(\n    function(field) {\n        serializedFields.push(\n            {\n                name: field.get('name'),\n                showLabel: field.get('showLabel')\n                ...\n            }\n        );\n    }\n);\n```\n. Thank you!. ",
    "BaurzhanSakhariev": "registerFieldTypes is not a function\n. ",
    "stiemannkj1": "@michaelnguyen547,\nCheck out my Q&A on StackOverflow, and see if it answers your question.. ",
    "BryanEngler": "i think @mbowerman meant to send this to me. the pull request \"interface\" on the github website is a little tricky when youre first learning to send pull requests so this pr accidentally went to the liferay repo.\n. ",
    "filiperinaldi": "I just realised you are using Jira now.\n. ",
    "marcellustavares": "cc @mairatma \n. ",
    "jawedkhan": "how to scheduler data save in mysql using php how help me.\n. ",
    "vionemc": "Yup! Already solved. It was just about code placement. I forgot to close this issue. \nThanks!\n. ",
    "brandizzi": "Hello @harish278!\nDo you want to change the popover in Liferay's calendar application, or are you using the scheduler in your own application?\nAlso, could you show us a screenshot of the popover as it is today, and annotate it to show us what you want to change?\nThanks!. What a pity, I really wanted to know what we could do here :disappointed: :wink: . ",
    "HatsuSakura": "Hello, I'd like to reopen this thread.\nI'm trying to create a custom input popover for the SchedulerEventRecorder: I need to insert and save more options than just the title.\nFor the project purpose I need to chose one among a set of event categories and one among a set of event owner while creating the event.\nCan you give me some tips, please!\nThank you in advance. ",
    "robframpton": "Hey @adeonir, thanks for reporting the issue.\nI was able to successfully run bower install on master just now. It could have been that github was just down when you tried installing.\nIf it still doesn't work for you, can you provide us with your version of Node, npm, and bower, as well as your OS?. ",
    "adeonir": "Hi @Robert-Frampton. Thanks for the quick answer.\nYesterday I've tried to install on Windows 10 and macOS Sierra with the latest versions of node, npm and bower.\nIt worked now without problems.. ",
    "vbence86": "@zenorocha Please reivew.. ",
    "rodrigopaulino": "Hey, guys.\nDo you have any estimative on when this will be reviewed?\nThis information would help me a lot since I have the customer waiting for the fix.\nHere's the https://github.com/jonmak08/alloy-ui/pull/440. Resent to reviewer https://github.com/jonmak08/alloy-ui/pull/440. "
}