{
    "lipis": "Assets are used only for the demo, not needed if you want to use them in your project.. while the css is needed if you don't want to mess with less.. that's the idea to have them separate..\n. Thank for spotting that out.. I also posted an issue to the original projects with the flags and I'll fix this one once I'm back from vacations..!\nhttps://github.com/koppi/iso-country-flags-svg-collection/issues/36\n. So I reverted to the original flags without reducing the sizes using the https://github.com/svg/svgo because it was breaking a lot of flags :(\nIf someones knows how to make them smaller (and more consistent) it would be nice.. :)\n. Hey I added the main endpoint but removed the version completely as it's not really needed..\n. There is no England in this list: http://en.wikipedia.org/wiki/ISO_3166-1#Current_codes\n. Actually you can already.. I just never updated the README file.. just do:\nbash\nbower install flag-icon-css\n. https://github.com/lipis/flag-icon-css/blob/master/bower.json\n. Thanks for the feedback, but for the actual SVG files and their proportions.. please refer to the original projects of the flags: https://github.com/koppi/iso-country-flags-svg-collection/issues and if it will be fixed there, then I will update them.\n. For the web most of the times you kind of want to have the same aspect ratio for all images for consistency.. and sometimes you need it as a square so I don't see a real problem.. and as for a wrong collection.. do you have anything alternative in mind?!\n. Thanks for the feedback, but for the actual SVG files and their proportions.. please refer to the original projects of the flags: https://github.com/koppi/iso-country-flags-svg-collection/issues and if it will be fixed there, then I will update them.\n. This is a collection of flags.. and flags belong to countries.. not languages! You will have to make your own logic for that.. because like you already mentioned which should I choose for English.. the British or the American.. or the Australian?\n. Here is what you will find in this collection: http://en.wikipedia.org/wiki/ISO_3166-1\n. Sorry but this will not going to happen.. one example on how you could easily override some rules to match your needs: https://github.com/gae-init/gae-init-babel/blob/master/main/static/src/style/locale.less\n(I had similar problem, to display the languages in http://babel.gae-init.appspot.com)\n. cool!\n. It's a known thingy and you can solve that with different ways..\nYou can change also the background-size: contain; to background-size: cover; and it will try to fit the flag inside the box so instead of having double border sometimes it will just crop the flag.. \nOr instead of the border you could use the box-shadow property\ncss\nbox-shadow: 0 0 1px @gray-light, 0 0 1px @gray-light, 0 0 1px @gray-light;\nBut I'm leaving all that to the end user as it really depends on the project..\n. I'm getting lots of requests about that issue and the problem is that there is no official list of all the languages with their corresponding flag.. because simply flags are belonging to the countries..!\nWhy using the british flag for the english instead of the US... I'm pretty sure the americans would totally prefer that.. and we didn't ask the australians.. :) same for spanish and many others..\nSo officially I don't think that we could cover all the languages without upsetting someone.. but it's quite easy to make some updates to the .less file to match your needs and add whatever flag you want to your language. I myself also needed that for another project, so you can check the example on how it works: https://github.com/gae-init/gae-init-babel/blob/master/main/static/src/style/locale.less\n``` less\n.flag-icon(@country, @locale) {\n  .flag-icon-@{locale} {\n    background-image: ~\"url(@{flag-icon-css-path}/4x3/@{country}.svg)\";\n    &.flag-icon-squared {\n      background-image: ~\"url(@{flag-icon-css-path}/1x1/@{country}.svg)\";\n    }\n  }\n}\n.flag-icon(gb, en);\n.flag-icon(gr, el);\n.flag-icon(ar, es);\n```\nand then using .flag-icon-en with the gb flag :)\n. @Rvanlaak If you do the above override then you will be able to use the .flag-icon-en instead of the .flag-icon-gb which is also what I'm using in my other app when I use en for the locale and I want to use a flag for it..\n. I think with that nice link we can close this issue for one more time :)\nFlags are for countries.. how people are going to use them is another thing and the method I described above is very very simple..!\n. Never used it before so what do I have to do on my side? \nAny chance that you can simply use Bower for your front end stuff?!\n. hey.. totally forgot about that.. I will do something about it I the coming days..\n. @Rvanlaak Do you mind creating a PR with the valid composer.json for this app and then I will add it to Packagist..\n. So here you are!! https://packagist.org/packages/components/flag-icon-css\n. Let me know if it actually worked on your sides :)\n. nice.. I thought about it later.. but instead of component/.. I might\nrename it to lipis/.. or something, but either case it works :)\n. You are Irish so I guess you're right :)\n. I think we can just delete the version from here... it's not mandatory and it's always visible in releases..\n. package.json is ignored anyway in the bower.json.. and if you install it using bower the version is stored in the .bower.json in the bower_components\\flag-icon-css\nInstall anywhere using to test it..\nbower install flag-icon-css#0.5.0\n. From package.json but ok :)\n. Thanks and btw.. using Sublime's multiple selection you could do that much easier without a script..!\n. thanks.. could you also squash the commits before I'll merge that?\n. http://stackoverflow.com/a/5201642/8418\n. And then I will just have to register it here: https://packagist.org/packages/components right?\n. Thanks man..! It's all there and I enabled the automatic update as well..\nhttps://packagist.org/packages/components/flag-icon-css\n. @N8boy is right.. I'm sorry but I won't add any user assigned flags..\n. @rolandjitsu In this particular project I'm including only the official flags.. it's very simple :)\nIf someone wants to include the user assigned it's super easy to fork and add them to match their individual needs..\n. It's been discussed before https://github.com/lipis/flag-icon-css/issues/13#issuecomment-42109283\n. I'll keep that project strictly for countries for now.. and here is one modification if you have locales instead... https://github.com/gae-init/gae-init-babel/blob/master/main/static/src/style/locale.less\n. as it's not on the list.. I won't be adding any new flags.. sorry.. but feel free to fork and do whatever..\n. I think the problem was from the original project that all the flags were 4x3 or 1x1 ratio.. as this flag is not in 4x3 the original creator modified it a bit to make it fit.. yes it's wrong to modify the flags, but in the web sometimes we just want a small flag/icon to represent it.. as I can see in this one the colors are also different which should definitely updated.\nAnother idea to fix it maybe it would be to stretch the background to fit the 4x3.. WDYT?\n. Fixed in #69.. can you please check if it's ok?\n. Fixed in #69 \n. Sorry but I won't be adding any PNGs to this project.. \n. Nope.. as Europe is not a country and this project is dealing only with ISO_3166-1 initials/flags\n. Should be OK now:\n- https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/cn.svg\n- https://github.com/lipis/flag-icon-css/blob/master/flags/1x1/cn.svg\n. https://github.com/lipis/flag-icon-css/commit/d88fa40dfa3bfde7df1b11a7257a7efbbbd2acc7\n. I think these flags were on purposely slightly changed to fit in the 4x3 aspect ratio.. as it was the whole point of the old (now deleted) project.. I wasn't maintaining the flags and I'm not sure what do with them now as this project is also for the web and I want unified sizes for all flags. (To use them in dropdowns, icons, etc..)\nI think we'll have to take them per case if about to change.. especially the Cocos (#38)\n. I have individual issues now.. so closing this one..\n. Yes unfortunately the link is dead now and I'm not sure what kind of license I have to give them as there were not made/modified by me.. \n. EU is not a country that is why\n. Fixed.. there are too many stars.. :P\nhttp://lipis.github.io/flag-icon-css/\n. Work on mine.. and if it works on Firefox but not on Chrome.. then most likely you did something wrong :/ Either case without extra info or a link.. it's impossible to reproduce or help..\n. Yes.. guys sorry.. it's already hard to maintain all those flags in two different formats and adding support for something that was last updated 3 years ago is really not worth it :)\n. If someone is force to supported IE8 then they will have to do it on their own..\n. The PNGs used to be generated in the original project, that unfortunately is no longer exist.. and from what I remember it required bunch of planets to be aligned in order for it to work properly.. plus bunch of options for sizes and ratio... so to tell you the truth I'm not willing to maintain that thingy :) having said that if there is a simple script I could possibly include it to generate stuff.. or at least point to where you can find a clone.. for now I will close this issue and if anyone wants to maintain a IE8 fork.. please do so and let me know so I can link to it in the readme.. \n. Me neither... thanks @martinlindhe \n. sorry for that..\n. I refactored a bit.. https://github.com/lipis/flag-icon-css/blob/master/less/flag-icon-base.less\n. Would you mind squashing the commits?\n. Thanks you very nice!\n. there are quite a few known issues that are already there.. but unfortunately there is no much time :/ color fixes are super easy so if you find anything feel free to report it..\n. Not really sure about that.. as I believe noone should automatically compile all the less files..\n. Cool.. point taken :) I don't see any major issue of not going for it.. if you can rebase/squash your PR and also since we SASS now.. please update those as well..\n. Still around?!\n. will close this one..\n. thanks\n. everything is possible but I have no idea how WordPress works or what exactly you want to achieve.. this is just a bunch of collection of files.. :)\n. Because these flags are not on the list.\nhttp://en.wikipedia.org/wiki/ISO_3166-1#Current_codes\n. I guess it didn't stay long enough :)\n. If you use something like http://brianreavis.github.io/selectize.js/ sure :)\n. In short.. this is by design.. as that was the whole point of the original project, as these flags are suppose to be used in lists, dropdowns, etc where flag area should be exactly the same, because there is a decision that has to be made on what to do with the potential empty space.. white? transparent? \nThese flags should not be used or intent to be the official official flags.. I hope it's OK.. \n.  I will keep this repo for the ISO 3166 list only.. it's not really hard to add more flags even if this repo is used via Bower \n. Also the color is off.. that was from the original project that they did some modifications as the main target was small icons and it made sense.. but maybe we'll have to reconsider..\n. Let's continue in #126 \n. Thanks!\n. there is no script and if you really need instructions on how to use the CSS.. then you might don't really need these flags :D\n. That is not that of a bad idea at all.. on vacations now.. but will do it once I'm back :) I'm guessing just a white background or something would be enough..\n. Fixed in #66 but I'm not sure if it will be merged after all..\n. did you read the readme?\n. http://en.wikipedia.org/wiki/ISO_3166-1_alpha-2 Wikipedia has a better overview \n. no sorry.. I won't be doing it.. there are some PRs if you want to use, but this project is not going to support anything else than SVGs..\nhttps://github.com/lipis/flag-icon-css/issues?utf8=%E2%9C%93&q=ie8\n. pull requests.. #42 #33 \n. I've done that in the past.. but unfortunately some of the flags are ruined because of that... \nhttps://github.com/svg/svgo/issues/162\n. Will follow up after I'm back from my vacations.. I'm totally up for SVGO if flags are not breaking.. or at least if we know for sure which ones are breaking.. (like 100% sure)\n. or somehow identifying which flags are breaking is also good for me\n. @petethepig lol.. so lets delete the US flag..\n. @petethepig This repo is used not only via CSS and this is a very small optimisation that I don't see any reason to modify..\n. Many flags were optmized.. and from now on it will happen on per flag basis..\n. You didn't find it.. because Europe is not a country :D #34\n. Maybe a better idea would be to clone this project to be able to have it in sync much easier with the new flags and stuff..\n. I meant.. fork so people could see how back/front it is.. but nothing to this project.. closing it as outdated for now.\n. Lets continue the issue #60 here\n. You can submit a PR for ba if its not breaking it..\n. Also we need to take it per case.. as the original creator has killed the project and I didn't find an automated way to use this viewBox in a unified way for the whole folder..\n. Missed that one..\n. Freaking Illustrator.. \nThe generated file is not visible in the GitHub's viewer: https://github.com/lipis/flag-icon-css/blob/lk/flags/4x3/lk.svg\nWhile this one is OK: https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/lk.svg\n. yep\n. I added a new label, so people could easily find those.. we'll see in the future if we'll include flags that are not part of the ISO-3166..\n. As I mentioned in some other issue.. I might start adding more flags than the official ISO ones.. just need to clean some things up first..\n. but but but but.. I like Less :D\n. https://www.npmjs.com/package/flag-icon-css everything should be ok now..\n. https://github.com/lipis/flag-icon-css/issues/26#issuecomment-47708813\n. You can also check this (undocumented) thingy: http://flag-icon-css.lip.is/api/v1/country/  you have all the data there.. so basically do whatever you want..  \n. https://github.com/lipis/flag-icon-css/search?q=kosovo&type=Issues&utf8=%E2%9C%93\n. Nice!! Thanks guys..\n. Is it really needed?\n. sorry.. too much trouble\n. @ninjanye no.. sorry\n. @ninjanye yes.. @belikemike's version doesn't support 2-digit code :)\n. I appreciate the effort.. could you also include the links in the description to the currently used flags?! It will be much easier to search later and refer to them.\nHaving said that.. these flags have to be adjust to 4x3 and 1x1 ratios so it's not that easy :/\n. Because that's how it this whole repo is: https://github.com/lipis/flag-icon-css/tree/master/flags\n. and the main problem is that the guy who created the original flags has shut down his project.. :( and I'm the master of SVGs :)\n. I wanted to say.. that I'm not the master of SVGs :)\n. Fixed in #98 \n. While I agree with the Less changes.. what's the point of having sass and less for the development?! If anyone wants to use it can get the css, less or scss version of and all good.\nSo generating the same css with 2 different ways is really no need..\n. Not very doable with SVGs.. (even though there is a plan to optimise them) so what you can do is to choose your preferable size and transform them into PNGs or something..\nP.S. There were requests to include the PNGs in this project.. but since there could be many different sizes.. they won't be included at all :)\n. I tried the svgo in the past, but it was ruining some flags.. never got the time to find see if it's breaking less these days..\n. easier said than done.. doing that to all files without ruining some of them..\n. Some of them are optimised... this is an ongoing process..\n. https://github.com/lipis/flag-icon-css/search?q=europe&type=Issues&utf8=%E2%9C%93\n. https://github.com/lipis/flag-icon-css/issues?q=is%3Aissue+european+is%3Aclosed or you can simply check #71 \n. :100: \n. Must be outdated now.. I'll close that issue.. I hope it's OK :) 🍻 . could you submit a pr?\n. Hey.. All good.. especially if you have somewhere a link to the original source code.. is even better.\n. Nice!\n. https://github.com/lipis/flag-icon-css/issues?utf8=%E2%9C%93&q=+eu\n. will review it soon... thanks\n. More like all of them that you touched :D https://github.com/lipis/flag-icon-css/pull/111#issuecomment-159642513\n. So I guess I'm closing this one..\n. Something is not right though..\n\n. Same issue on GitHub preview..\n- https://github.com/copycut/flag-icon-css/blob/add-view-box-attributes/flags/4x3/ad.svg\n- https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/ad.svg\n. I'm in general against anything that is not on the ISO 3166-1-alpha-2 code list.. but maybe due to the popular demand I'll have to start adding more flags.. we'll see :)\n. So if we are about to do it.. I will need some help in terms of codes and what is what :) For someone that is not from GB it might be confusing.. so lets move this conversation to #120 \n. :)\n. While I appreciate the optimised/better flags if they are in the same format (viewBox: 512x512 and 640x480) I don't see any reason why including the sources and sketches or updating the minified css file..\n. maybe.. but definitely not part of this one..\n. https://github.com/lipis/flag-icon-css/commit/3cd183cb1729d26482080db9a60fb589ba383cfc\n. #71 or https://github.com/lipis/flag-icon-css/issues?utf8=%E2%9C%93&q=eu+OR+europe\n. thanks :) I thought it was final..\n. Even though we could have more instructions.. but I think you might want to spend more time with HTML and CSS in general, before trying to use these flags.. not sure where people learn these days, but this one looks cool enough: https://www.codecademy.com/learn/web\n. What codes should we use for all these flags? \n. @simonwielens, @Jokero are you guys fine with these flags?\n. that's one of the reasons that I didn't want to include extra flags for so long.. :/\n. Sounds like a good idea..\n. Should be fine now.. :)\n. Maybe I'll merge the #125 as well.. before publishing.. the most demanded flag so far :)\n. Published :) should appear soon in your nearest shop..\n. > :D You can run into a lot of troubles by just mention \"NIR is not a country and it does not have own official flag\"\nWhat kind of troubles?! It's a free world man.. we can say and do whatever we want.. (at least in this part of the world..)\n\nCould you add that flag to your files, please. I'm sure you won't get that many request for NIR.\n\nNope.. sorry.. maybe if I'll get too many requests I'll reconsider.. :)\n. Internet is a fun place..! Not sure why people are getting mad.. or think that I'm lazy or care so much for something that they didn't do or wanted to do anyway.. like I mentioned before @carlosdv4 we live in a free world and nobody is paying me for doing that.. so how can you even demand or assume that I'm lazy?! do you think that this project just appeared here?! wtf?\n@seanfoo Yes.. that was the whole point.. that I sticked only to the official CIA listed recognised countries  but eventually due to the large demand I added a few more in the #120.. and now the chaos!! I enjoy the ride anyway.. it's fun! Thanks for the support..\n. @jakwo  That's a good reason.. can you point me to one or two such websites..?!\n. @jakwo Sold! Will do :)\n. There :)\n. If you publish your app.. feel free to come back to us to show off ;)\n. duplicate #38\n. @SergioBarja Fixed the ratio and colors..\n@agorilla yes.. the size is quite big (147KB) so maybe it's not a bad idea to have the other variant of the flag..\n. http://www.spain-flag.eu/flag-variants.htm\nSpain has only one national flag and ensign, the one with coat-of-arms. Any merchant or fishing ship can fly the coat-of-arms version. Many don't, just because the cost of a flag with a colored coat-of-arms is much higher than one without it.\n. I'll keep it for now.. and we'll see later..\n. no sorry..\n. Couldn't agree more with @copycut..\n. Fixed in https://github.com/lipis/flag-icon-css/commit/d3f57d3ec4293bf7b66a126ec4fbd24f79c8249b\n. Fixed in https://github.com/lipis/flag-icon-css/commit/f31cd4f67bb0c4f6c3d33f266d1e7e2d3987689f\n. Quite the opposite.. they are more than welcome! :dancer: \n. Isn't that fixed? https://github.com/lipis/flag-icon-css/commit/2c6ecf46c7ec962d8c53e071cb5563cbd363f319\n. will do today.. don't be that sorry.. it's not a big deal :) :dancers:\n. Cool stuff man! :) Thanks..\n. I'm not dealing with PNGs and the SVG sprite will be huge..\n. Good stuff!\nI would recommend you (if it's not too late) to make it a fork of this one though.. as I'm updating the flags quite often and then it will be much easier to check how far behind or merge/sync with the upstream easier..\n. We've been through this before.. and it's an ongoing process that is happening on per flag bases at the moment.. It was breaking a lot of flags when done in bulk..\n. https://github.com/lipis/flag-icon-css/issues/63\n. Because I guess the Brazilian flag wasn't ruined :) SVGO is more reliable since that time.. so maybe less flags are broken.. but still :)\n. @vltr The written text many times can be misunderstood.. But xenophobia is one of the last things that could characterise me :) Why do you think I insulted you in any way? (Plus I love Brazil)\n. @vltr LOL :) It's hard to notice if any of the flags are broken after an optimization.. especially if you don't know how the flags should be.. but we (humans) tend to notice familiar things.. and I (wrongly maybe) assumed that you are a Brazilian or at least know how the Brazilian flag looks like since it's written on your profile.. so if the SVGO would break it (like in ruining the XML of it) you would quickly notice it and you wouldn't suggest to optimize all the flags.. That's all I meant..\n(I'm still puzzled on how you got insulted.. but that's Internet I guess)\n. Fact: Some flags will be ruined if running the SVGO and ripping 2MB from all the flags..!\nFact: You assumed that everything will be OK with all the flags..\nFact: People tend to not like if their flag is ruined.. :)\nQuestion: Did you check any of the flags after running the SVGO?! If so.. which ones did you check?!\n. So you are not a Brazilian or you don't live in Brazil and calling you a Brazilian is an insult to humanity?\n. (Even though I didn't call you a Brazilian I just assumed that you will know how the Brazilian flag looks like)\n. You're a funny guy..\n. (I assume that you are a guy.. because of the Richard and it's most common for men population)\n. Please don't feel sorry.. I'm fine :) But I could also be insulted when someone is calling me xenophobic assuming that I am :) That's not very polite in my book...\n. You can still use the flags.. they are not mine :)\n. I won't tell anyone..\n. If these flags were my main job.. yes :) Otherwise reasonable PRs are always welcome..\n. Roger out..\n. thanks!. Should be much better now.. can't be 100% correct as all the flags are adjusted to 4x3 and 1x1\n. Knowing my self and my OCD levels.. Even if you're producing the flags the same way (Inkscape, SVGO, etc) I most likely going to redo it, save and optimise it (2 spaces) again.. so I would recommend you to not make PRs for flags.. at least now that I found how to make them all consistent..\n. Thanks man and I appreciate it.. I will add the contribution so in the future it can be avoided.. at the moment the greatest help is to find the mistakes in flags and report them.. \n. much appreciated.. but you don't really have to do this if you have other better things to do :) :flags: \n. Would you mind also linking in the issue to the flag in the repo for fast comparison?\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/sr.svg\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/1x1/sr.svg\n. I do accept them if they are actually OK. especially the colors are the easiest to accept.. but please keep a single PR per flag. If it's only color changes.. feel free to submit the PR as it's not changing the XML.\n. could you squash the commits? to have only one\n. That one as well... some squashing..\n. No you can do that in the same PR.. here is one way of doing that: https://github.com/ginatrapani/todo.txt-android/wiki/Squash-All-Commits-Related-to-a-Single-Issue-into-a-Single-Commit\n. I just want a single commit.. (it's quite common in many projects)..\n. indeed...\n. :dancer: \n. So basically all flags!! :godmode: \n(keep them coming)\n. Few left.. thanks for reporting them :)\n. @ilyabreev Down to 10 open wrong flags :) Not bad..\n. can you sqaush the commits please?\n. :elephant: \n. set the correct path I guess..\n. I guess everything should be ok.. :)\n. Why should I?! It's not needed for that particular CSS. What if someone wants something else or nothing?\n. sorry.. but no.. it's just reserved.. https://en.wikipedia.org/wiki/ISO_3166-1\n. not very feasible.. too much to maintain and as it was mentioned earlier you can find them in wikipedia.. :) the purpose if this project is to have them somewhere that could align perfectly either in 4x3 or 1x1..\n. In case you didn't notice.. they are all adjusted.. not only the Swiss flag..\n. I'll pass on this one..\n. what's the best sources for the CT?\n. Then maybe we'll pass on this one as well :)\n. these were the proprtions of the original project that had only the stand alone flags without the CSS... because people were complaining a lot.. the original creator couldn't keep up and he deleted the project. I'm still replying and I'm not ready to delete this project.. and I'm also not ready, nor willing to update ALL the flags to any other proportions other than the ones that exist at the moment (mainly because it's an open source project and if someone else wants it sooooooooooo much.. feel free to fork it and make it happen)\n. I'm not emotional sorry for that :) It's the whole written text.. if I would tell you this info over the beer it would be different..\nThe other problem is that someone will have to manually change/adjust/etc ALL the files.. to match this proportions.. which is not easy :)\nJust check the history.. https://github.com/lipis/flag-icon-css/commits/master \nFor some flags is quite easy.. but some of them are quite complicated flags that we need to match them.\nAlso I would like to keep the SVGs consistent and clean as well.. so in reality the reasons that you don't see all these proportions.. is that I'm not getting paid to make flags :D:D But I love having consistent things..\n(Nothing emotional.. just business)\n. Thanks man! Feel free to post any time if you see some flags that are already not filed..\n. what would be the 2 character code.. any reliable source for the most favorable suggestion?\n.  pass on this one  until further notice :)\n. @mattab Thank you. That would be great :) I need to something in order to start adding more of those.. but I don't want people to start thinking that we will add all of them :) But for now I'll reopen this one... I might have to pass on this one.. adding more non ISO codes was already a big step to what's this project was about.. so adding aliases I don't see any good reason to be honest :) \nhttps://en.wikipedia.org/wiki/ISO_3166-1\n. Sorry..\n. It's about countries not languages..\n. Even though many of the flags were already optimized using SVGO with the recent updates it's pretty safe to do it to all flags :)\n```\nBefore:  8.217.280 bytes\nAfter:   6.530.332 bytes\n\nDiff:    1.686.948 bytes\n```\n. Look closer.. :)\n. One of the most difficult ones to solve :). I just didn't manage to do it using Inkscape.. > if this project is list of flags, I'd prefer all flags in their original aspect ratio\n@mareg I would also prefer to have a world peace, but that's not the case :)\nThis project has 2 aspect ratios for all flags.. if you don't like it.. don't use it :). Done.. :) \n. \nThanks!\n. Try again: http://flag-icon-css.lip.is/game/capital/Oceania/\n. Here you can see all of them in a nice sortable table.. http://flag-icon-css.lip.is/country/ so if you find anything else wrong.. please let me know!\n. #215 How many countries?!\n. May I ask you why exactly do we need that or have both things generating the same result?\n. and how #101 is exactly associated with what you did here..?\n. I disagree that it's useful as it is just a matter of taste on how to build the actual css for this particular project.. but has nothing to do if you are actually want to use SASS in your own project.. because sass files are already there...\n. yes :) will update the readme later..\n. Updated readme..      \n. I'm guessing you haven't check how the whole thing is working.. :)\n. Sorry but flags belong to countries/areas.. not languages :)   \n. Also maintenance.. there are thousands of languages and I'm not sure how it will work with simple things.. on which flag to use for English.. US, GB, AU? So in the end of the day.. that's why you have all the sources to adjust those things to your personal needs.. \n. @serhioV Since you are not so stupid.. do you understand that this requirement that you have for your own projects/clients, maybe it's not going to work for everyone, so there is no point of asking for any sort of implementation here... true.. but every website uses their own flags for whatever language they want depending which country their represent.. so there is no way to satisfy everyone by having the UK flag for English or PT for Portuguese, etc.. . Do you have link to wikipedia and the possible ISO code for it with sources?   \n. #120 \nhttps://en.wikipedia.org/wiki/Flag_of_Northern_Ireland\n. Hi.. please update all your requests with links to Wikipedia pages for the flags.. and your best source for potential ISO codes for them..\nheads up: this list is quite strict \n. fixed #120 \n. #120 https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-sct.svg\n. Both are former countries and don't exist in that form anymore.. so I'll pass on this one.    \n. I'll pass for now.. sorry\n. Maybe using <img src=\"flags/1x1/de.svg\"> instead of <image href=\"...\"> will improve dramatically your chances of making it work..\n\n. > The SVG Image Element (<image>) allows a raster image to be included in an SVG document.\nBut this library here doesn't provide any raster images... so I'm not sure what you are trying to achieve..\n. which version of IE?\n. how does it look if you go directly\n1. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/af.svg\n2. https://lipis.github.io/flag-icon-css/flags/4x3/af.svg\n. Don't we all love the good old IE?\n. of course CSS can help.. but the problem is in how the IE renders the SVG.. I'm using the SVGO to optimize them all and it seems that something might be needed for older IEs to figure out the actual size/ratio of the image.. not sure if it's worth fixing it..\n. Thanks @ksymeon! \n@sarathak I will close that issue then as it looks like in the latest IE/Edge they are OK..\n. https://github.com/lipis/flag-icon-css/commit/ba44a8a974ff4b0d9c4815c51f30b57cdfb6e26a\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-nir.svg\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/1x1/gb-nir.svg\n. I'll show the extra flags on the main page and maybe in the instructions.. as they are more than just UK I don't want to be specific for UK stuff as it is in this PR :)\n. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-eng.svg\n. it's ok. no worries about the issues.. it reminds me that I have to update the front page! thanks..\n. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-sct.svg\n. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-wls.svg\n. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-nir.svg\n(I'll include them in the demo though eventually)\n. It's easier to maintain, sort, add, remove, check, etc...\n. Also multi-cursor is your friend..\n. So what do you think about this idea after the answer?\n. I'll pass on this one..\n. #501 . what do you mean by Android support?! get the flags and do whatever...\n. No sorry..\n\nOn 10 October 2010, the Netherlands Antilles was dissolved into Curaçao, Sint Maarten and the three public bodies of the Caribbean Netherlands.\n. thanks for the effort.. but I'll fold on that one\n. 1. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/pf.svg\n2. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/tw.svg\n3. and as for Kosovo there have been many filed issues for it..\n\nnext time one flag/country/issue per issue...\n. Dear @ankit007pandit,\nThank you so much for reporting this issue... and on top of that sending me a personal email to make sure that I will read in. I'm totally on it. I can see that you need it very badly for your project, so I'm dropping everything as we speak and I'll start following up and adding more of your needed flags. Are you sure you want only those?! Maybe some help with other parts of your project..? If the deadline is near, don't hesitate to ask us anything and we'll be at your help.. as soon as possible (as you wanted and you asked)..!! Stay put.. \n\n@tomlutzenberger You didn't have to.. :)\n. @seanfoo @tomlutzenberger It took me a while to add few non ISO flags but I'm not planning in any way to include all of them at this point.. adding them means maintenance and that wasn't the goal of this project.. and definitely there is no plan to have a historical archive.. that's what Wikipedia is for..\nAs for you @ankit007pandit my dear friend.. sure! I'll prepare the flags and send them to you directly.. worry not! Like I said before I have nothing else to do so it won't be an issue and you could totally deliver it on time over the weekend! I can also send them to you in a printed version if you like..\n. @ankit007pandit sure.. no problem!\n. Oh noooo!! I'm right on it.. I'll be away for a while buying all the systems with high contrast mode, but afterwards I'll fix all of them as soon as I can... When is your deadline?! How much time do I have to fix the flags?!\n. I'm already fixing it.. :P\n. @Rak- No problem man.. I'll make all flags black and white only for you by 25th of this month.. anything else?! Maybe you also need some help with other parts of the project like in this issue #262.. \n. @Rak- Jokes aside.. nobody will do anything! There is no point of having black/white flags.. if you really need it.. good luck!\n. It is maintained.. but we are not adding ALLLLL the flags of this planet.. :D Is Catalonia is represented in Olympic gameS?\n. There were strong(er) arguments for those flags.. if these flags are going to participate in some sort of big sporting or other events.. I'll reconsider many of them :) but Oliver this project is not going to include the planet..\n. Not the biggest fan of the variables either.. too much optmization I would say :) if there is such need in the project just override this function or clone and remove the not used flags..\nUsually I'm just including the flags that I'm using only, but never thought of this extra step..\nFood for thoughts :)\n. I will :)\n. can you pass the SVGs with svgo --pretty --indent=2 path/to/svg \nand I'll have to make sure the colors are accurate.. my main source was (and still is) Wikipedia..\n. please keep the PRs to one per country/flag..\n. Spot the difference :D\n\n(Just update the colors.. since colors is the issue)\n. I'll merge it after those comments.. but next time two separate PRs :)\n. thank you \n. Sorry.. I'll pass on this one.. Awesome! :) Thanks for the detailed analysis of the flags that didn't make it. I updated your comment to include the links for faster check.\n. Also after a quick check it looks very legit.. so I'm going to merge it :)\n. I normalized most of the flags to according to the new rules that I just made up :) and your awesome list lives in #277..\n. after vacations I'll update a few thinga.. thanks\n. 2.4.0 is out https://www.npmjs.com/package/flag-icon-css\n. yep.. this is outdated. #277 \n. #277 \n. #277 \n. Thanks @diagramatics :)\nhttps://en.wikipedia.org/wiki/Flag_of_New_Zealand#/media/File:Flag_of_New_Zealand.svg\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/nz.svg\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/1x1/nz.svg\n. Sorry I'll pass on adding quotes :)\n. This looks quite nice to be honest.. :) could you use SVGO to optimize them:\nsvgo --pretty --indent=2 /path/to/fj.svg\n. Thank you lion :)\n. https://github.com/lipis/flag-icon-css/tree/master/flags/4x3 I'll add the extra flags in the main website at one point.. but for now you can find them there..\n\n. No problem! :) It's not that obvious..\n. 💶 :D\n. https://github.com/lipis/flag-icon-css/issues?utf8=%E2%9C%93&q=Catalonia\n. Bunch of flags broke :(\n. I think it would be better that way ;) Less is working in a similar way..\n``` sass\n.flag-icon-background {\n  background-size: contain;\n  background-position: 50%;\n  background-repeat: no-repeat;\n}\n.flag-icon {\n  @extend .flag-icon-background;\n  position: relative;\n  display: inline-block;\n  ...\n}\n``\n. Just update your pr..\n. thanks\n. damn... wrong button :) wanted to squash.. oh well..\n. Haven't played with Webpack but can we add the [stylesheets files](https://github.com/lipis/flag-icon-css/blob/master/bower.json#L3-L6) like in Bower? Because this project is not a JS project to add anindex.js`\n. While you might be right about Cyprus.. Geographically speaking most part of Turkey is in Asia (97%) and same for Russia..\nNow since when Greece belongs to Asia or Kazakhstan to Europe.. that's something that I can't really comment or answer.. check the map again :)\nI was about to update the website with some changes.. could add multiple continents for some countries.. \n. #277\n. do you think that all the flags were just stretched to fit the 1x1?. Can you check if they are better now?!\n. @cnsgithub that is very strange.. because there are no references to xlink or href or anything in those files:\n- https://github.com/lipis/flag-icon-css/blob/master/flags/1x1/bo.svg\n- https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/bo.svg\n. Well not sure what to do.. if you find a solution to the \"problem\" let us know.. until then it looks good from my side..\n. @hulufei Published 2.8.0 :)\n. #277 and more\n. I'll squash it .. but you should update your local branch :)\n. No sorry.. I'm still thinking about whether to add or not some of the currently used, non ISO flags.. so for sure I will pass adding historical ones :)\n(Even though I have a special connection to Soviet Union, as I was born there.. hehe)\n. #277 \n. What about the folder name?! I'm always confused with Sass and their conventions..\n. SJ is part of ISO 3166-1 so I won't remove it.. but I'll update the flag :)\n. np... :D\n. You should have asked before actually doing it.. but that's definitely not the way.. I might add it in the future ass Less and Sass but not like that.. sorry..\n. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/eu.svg my bad that is not easily shown.. but it's there..\n. What we can do for that?!\n. It's in my plans for x-mass to reduce the size and other updates! stay tuned... #395. Is there anything we can do with some of the SVGO settings https://github.com/lipis/flag-icon-css/blob/master/svgo.yaml to reduce the size/complexity of the vectors?!\nUsing the civil flags will of course reduce the size, but I would like to keep the original ones :). #436 saved 13% more :). #437 even more.. :) 1.8MB. I'll close this one for now because of #437, and if anyone wants to simplify manually some big flags I'm open for review... It's already too complicated to maintain 2 formats.. :)\n. More cool stuff..\nNext time though in the brackets write (Fixes #282) so the issue will be closed automatically :)\n. more cool stuff\n. Cool stuff :)\n. I tried once.. but failed miserably.. :)\n. http://flag-icon-css.lip.is/api/v1/country/\n. Maybe in the future.. :/\n. I'll close it for now..\n. thanks.. fixed!\n. In some use cases it might make sense.. I'll give it a try to see the results and if it's not ruining the quality too much I might use it for the big flags..\nIn general I'm using the SVGO before pushing the flags..\n. Also I've seen this tool in the past.. and there is no command line for it if I recall.. right? Maybe that changed..?\n. right..\n. sorry... optimization was the only reason.. :) Some browsers from a previous century you mean?\n. will do :). I think this request is a bit tooooo much :) . Maybe :). Do you mind providing a PR.. or I can do it later this week. Thank you!! Sorry for taking a bit longer... and I'm guessing that's the way :). no.. :/. I had issues fixing those flags.. same for gb :(. mostly because the shape is a bit weird and I couldn't easily adjust it to the 4x3 without ruining too much the flag.. (speaking about gb). awesome.. do you mind running this command on both files?\nbash\nsvgo --pretty --indent=2 ba.svg. Delay?! Nobody is in a rush here :) hehe.. thank you very nice... dunno.. do you mind sharing a link or something because it works here: http://flag-icon-css.lip.is. https://github.com/lipis/flag-icon-css/blob/master/flags/1x1/eu.svg\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/eu.svg\nit's there but not documented... Sorry but I won't be accepting new flags for now especially bunch of them at the same time... No.. sorry... Works fine here.. which browser?! Just ping here and we can reopen this issue. Thanks... I'll try to find some time for this project.. it totally deserves it :). I'm sorry but I can't accept this.. but I fixed it already in #352. They look ok on Ubuntu 16.10\n\n. Is that still an issue?. Usually you would use a few of those flags and if actually you need all of them in one page.. I think anyone can use a sprite or something to cover their needs. This repo will have them separately.. sorry for that.. well I would recommend you to create a simple script that combines the ones that you want.. the total size would still include Serbia... bg. :). There are thousands of flags in general.. we simply can't get them ALL in one project.. :). fixed in #374 . I might start adding more flags.. but I can't accept this PR.. the stripes don't have the same height.. and due to my OCD I might have to make it myself :). The size is the OK.. is the content that I'm worried :) \n\n. fixed in #374 . Beer?. @arcanedev-maroc :) Nice one.. didn't know about it.. I thought this post was random questions :trollface: :D. But why adding more stuff when it's already very visible on top?\n\n\n. Sorry.. but I feel it's not worth it! I believe that everything is there and very clearly.. Thank you!. Why would you do that?! Because according to the docs this is about flags.. not languages! :)\nhttps://github.com/lipis/flag-icon-css#usage. Anything else you need to change to match your needs?!. Awesome.. any time you need anything.. just come here and do whatever you want!. Works here: https://lipis.github.io/flag-icon-css/flags/4x3/ua.svg. also try from different browser.. What do you mean?! If you just open that SVG in your browser does it work?! If the answer is yes.. then the problem is not in the svg.. but the way you use it... No I can't sorry.. the SVG is correct and the last two lines are added by your setup.. remove those lines and it will be fixed!. Pity?! How do you think we should help you exactly?! Should we start using Laravel, try to guess your full setup? try to guess your browsers, your machine and all your pipeline to figure out what is wrong with the rendering of SVG that actually is correct?!. np.. and good luck. . @The-Outrider do we have to update anything in the project, or it's just how people are using with different packages/frameworks?. Thanks @The-Outrider . As there is no a general rule I will close this issue... In the beginning I was only including the ISO 3166, but there were strong arguments (World Cup, Euro Cup, etc) for including some more flags.. . the SVGs are broken... Interesting... Does that makes sense now?. Something like this: http://flag-icon-css.lip.is/api/v1/country/?. anyone can create a PR.. you don't have to be part of the team for that... Thanks @rlenders :) 🍻 . sorry no... nah.. sorry. Fixed. Thanks 🇳🇬. Good stuff!. Soviet Union doesn't exist anymore :)\n(source: I was born there). can you also change the other file as well in 1x1?. Thanks! 🇵🇱 . I will add the task at one point.. #395 and I will experiment locally to see if I'll update all the sources.. but for now I'll close this one.. sorry.. too many edits! :). #393. Nope.. sorry.. . what about Australian or Singaporean? they also speak English... and combine 20 flags that their main language is english?. As we've said that many times in the past.. flags belong to countries and not to languages.. :). :D . This is actually quite interesting.. :). and there is no breaking change here.. right?. fixed. Interesting.. just to make it more unique though for possible conflicts.. shall we maybe switch to flag-icon-css-xx. Looks good to me :). Thanks @SaphuA 🍻 . But: https://en.wikipedia.org/wiki/Flag_of_Croatia#Colors. I will agree with @Findus23, let's have them here as official as possible :). Nah.. most them already optimized using SVGO but, I want them with --pretty --indent=2. One day I'll implement the #395 so it will be easy to adjust for anyone... the main reason that I have it like that is for easier view/fix here in the repo when submitting minor PRs, color changes etc.. and in general it saves 250kb in almost 7MB of total data if you are using the whole thing.. so overall you are saving around 3% which is not the worst case scenario.. and usually as you already mentioned you are not loading everything.. that's awesome.. thanks man for the link.  :). I'm sorry but I won't accept that one... Will be there soon.. thanks!. do you mind opening a PR for it?. I will close it for now then... Can you give an example in https://jsbin.com (or anywhere else) with your issue?. Works for me.. do you see anything here http://flag-icon-css.lip.is?. sure.. but this project has a different purpose :). are you using the squared version?. and instead of flag-icon you can use the flag-icon-background and flag-icon-squared but maybe some overrides need to be done.. haven't played with squared background ones :). Yes send more 💰💵💴💸 to continue.. :). Sorry maestro.. :/. oups.. thanks . We are up and running! thanks again @johndierks . Thanks @minidoc.. works now  :) it's this time of the year again!\n. Thank you Peteris :). Can you have the minimum number of dependencies that are causing this error?. so I guess we can close this issue?. Not sure what we can do here.. seems fine from my end :). Oups.. removed IDs accidentally. Of course I'm interested.. thank you very much for this.. I'm on mobile now, but can you tell me if anything is broken.. and if we need to manually fix any of those flags?. Awesome... Thanks again!!. sure do you also need any other ratio?. The f*ck is this?. I think I'm going with this one :). @Findus23 thank you for that! Yes, that's quite expected, but hopefully nothing major was broken..!. While I don't have it in the repo.. you can take it from the http://flag-icon-css.lip.is/api/v1/country/?limit=-1\nBut keep in mind that we have more .svg that the displayed flags there :). Country is missing as well :). @2009 Thanks cat :). I kind of agree to use white for Polish flag..! I'm down.. any other objections..?. Can you file an issue for it? Because this PR seems a bit wrong :). As it's hard to know which one should be the default flag.. I'll close this issue.. They are there: https://github.com/lipis/flag-icon-css/tree/master/flags/4x3\nBut not listed :(\n\n. We've been here before.. and I think I'll fold on this one :). Good stuff!. I'll trust you on this one :). Skål 🍻 :). @kent1D Feel free to edit the colors?!. because there are no transparent flags.. :). aaa now I saw the flag.. hmm. nah.. it's hard to maintain the ones that we have.. there are no plans to introduce historical ones.. Plus what is URRS? Do you mean USSR?. how do you feel about making a PR? and many a link to confirm it.. on mobile right now :). So what do we do guys?! I like this one with Pantone definition #d52b1e (and the one that Wikipedia is using) over the #ff0000... So.. which one should be?. So going with #ff0000?. @dependabot rebase. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/ad.svg\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/1x1/ad.svg. viewBox is back... 🍦. @dependabot rebase. @dependabot rebase. Thanks man! . Feel free to use it.. and if you make a few gazillions I wouldn't mind getting my share :). We could fix the colors but it will be tricky to shrink the Navy rectangle... Well all the flags here are either 4x3 and 1x1.. what do you mean replace it?. How do you feel about editing the files with these colors and submitting a pull request?. Check under Montenegro and Serbia.. http://flag-icon-css.lip.is . We only support iso flags with a few exceptions that are mostly for sport events... Remove the adblocker?!. https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-eng.svg. This projects was created to have 1x1 and 4x3 flags only for a particular purpose.. If someone wants the original ones.. there are plenty of sources... So which one should we use?. #474. I updated the colors.. if it's not the correct one please comment here.. hmm... what did you do? how are you using it?. There is no official globe flag or anything like that.. this project was and still is about the current Country flags :). Regardless of what you are using.. the flags are under flags and depends on which Style you want.. you will find the css, less, or scss under the respected folders... Done. Sorry... Not sure if it's worth it for this project.. as this sprite will be quite huge... #487. @dependabot rebase. Indeed unlikely :). This is Sierra Leone :) Slovenian code is SI :). I have no idea what you are talking about... :). If you are up for writing that script I'll be happy to accept a PR.. as long as it's just a script and not the actual assets... awesome. Just in case you have nothing to do @Blackjacx on your holidays.. :). @Blackjacx no rush! :). can you be more specific on what you need and how can we help?. works from here https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/es.svg. integrate what? where? language? platform? what do you mean? it's just a collection of flags with their code in the filename.. use them as you wish :). https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#User-assigned_code_elements\nThe code XK is being used by the European Commission,[20] the IMF, and SWIFT,[21] CLDR and other organizations as a temporary country code for Kosovo.[22]\nOK.. you win! I'll add it... @pkrstic You are right! But I was getting a lot of request and in the end I ended up adding it... I'm not offended at all.. and I don't want to go into politics.. so case closed :). will do it tomorrow.. . So is this one ready? Bulletproof and all?!. Good enough... if you ever going to feel the need to improve it! Don't be shy... 3.3.0 is released.. can you verify if it's all good?. Yes, we've been through the language topic a lot.. and I still believe that it's outside of the scope of this project. This project is about flags.. country flags!. I'm open to PRs with suggestions @aerovistae!. it really depends on how your project is setup.. webpack gulp manual etc.. it could be anything. you just have to get the CSS and the icons included in your app :) . Do you see the flags when you deploy the app? Then it's good.. . Not sure how to help here.. sorry!. yes it should!. I'm sorry but we simply can add them all... https://github.com/lipis/flag-icon-css/blob/master/package.json#L40. I'll close that without any comment.. :). https://en.wikipedia.org/wiki/ISO_3166-1. @lycwed you are confusing languages with countries.. They are SVGs.. which means they can be any size you want! :)\nhttps://lipis.github.io/flag-icon-css/flags/4x3/es.svg. 3.3.0 released.. https://www.npmjs.com/package/flag-icon-css. I think this is issue should be on https://github.com/cdnjs/cdnjs side instead.. I have nothing to do with it :). I'm sorry but adding you as an author doesn't make much sense as you actually din't author anything in the actual project files and the list of the contributors is clearly shown here: https://github.com/lipis/flag-icon-css/graphs/contributors\n. I would also add the less/** as someone might want to use the source files instead\n. can you keep the same number of lines to have it one to one.. it will be easier for the conversations later.. and if @mixin flag-icon-background has to be first.. then change the order in the less file as well.. but either case I want them to have the same in terms of lines :)\n. add the end of line :)\n. lower case colors..\n. is it possible to remove the xmlns:xlink=\"http://www.w3.org/1999/xlink\"?. here as well. can you do it lower case?. can you do it lower case.. and next time would be nice to have them in one PR... The blue part is taking a quarter of the area (half of the width and half of the height) in the original one.. can we keep this ratio?. Sorry for being picky.. but can you make the blue area to occupy here again a quarter of the whole area? (half the width and half the height). suggestion\n  @include flag-icon(un);\n  // Other flags\nLet's add the comment to have it as a separator from the ISO flags. ",
    "ambahk": "Hi Lipis, \nin version 0.5.0+, stars are missing from both 1x1/cn.svg and 4x3/cn.svg flags.\n. ",
    "ariandi22": "there's no england. is United kingdom.. ",
    "nadouani": "Thanks, I missed something and thought it was not supported.\n. ",
    "tomByrer": "Honestly, I believe you are using the wrong source collection.  It dishonors the designs.\n. > do you have anything alternative in mind\nI was hoping for SVG with regular/official proportions, more or less what Wikipeidia has, in a single collection.  ISO/'country code top-level domains' country initials is handy.  Minified SVG is ideal.\nI understand wanting more square icons, but it gives me Y2K design flashbacks ;)\n. ",
    "mabasic": "I was only suggesting that you make an alias for en or something. It would be very helpful ... But nevermind\n. I really do not care which flag I get for en: us or gb...\n. ",
    "xavadu": "Thanks for the quickly reply @lipis \n. ",
    "rvanlaak": "So what do you recommend when en is needed? The locale in my application everywhere is en instead of gb or us.\n. I've been looking into the 'components' repository over here at Github, which all are available via Packagist. \nBut, as can be seen in the FontAwesome repo, they still have to update manually. The easiest way is to add a composer.json to your own project and add it to Packagist.org. \nNice article about this can be found here:\nhttp://tech.arendjantetteroo.nl/blog/2013/11/06/switching-from-bower-to-composer-with-components/\n. Well, the thing is that adding a composer.json does not directly make the package usable by Symfony. All code will be added to the /vendor folder, where it should be in the /web folder.\nA possible solution would be to let composer install assets via an extra plugin. Can you take a look at the following two options?\n- https://github.com/atelierspierrot/assets-manager\n- http://www.phpclasses.org/blog/package/8429/post/1-Using-Composer-to-Install-JavaScript-CSS-and-Images-Under-the-Web-Document-Directory.html\n. Nice! Will try in the near future\n. ",
    "mdxs": "Representing languages with national flags is problematic; as explained in http://flagsarenotlanguages.com/blog/why-flags-do-not-represent-language/\nThat doesn't mean flags cannot be used (if your audience understands them), but probably only as a supplementary visual cue; for that the method described by @lipis can be followed.\nMy vote: -1 for this feature request.\n. How can we actually check (in gae-init-babel that is) what version of flag-icon-css is used?\n. Thanks for the clarification, didn't know there was such a (hidden) .bower.json file next to the bower.json in the bower_components\\flag-icon-css folder.\n. Oops... got confused; time to go to bed :-)\n. Note that I checked the original index.html existing ids for potential conflicts, but didn't find any two letter IDs in prior use on that page.\n. ",
    "roest01": "+1\n. Works like a charm - thank you :)\n. I would prefer to let it on '/component'\nStructure in Symfony2 for libs is\n/vendor/\n/vendor/js\n/vendor/css/\n/vendor/packageName/....\nbower seems to use the /component/ folder as default - so there of course there are some bower packages in packagist (like your's) and if you use one of it - you will have the component folder next to the vendor folder.\n/vendor/\n/vendor/css/\n/component/flag-icon-css/\nFinaly the nicest solution for me is to have everything in /vendor/ but this seems not to be useful because of different package manager defaults.\nThe best compromise is to have a vendor for libs and bundles and components for frontent stuff installed with bower.\nthe badest solution (for me) is, to have a third folder next to them - vendor, component and libs ...\nSo I suggest to keep the 'component/' folder setting and orientate at the bower defaults.\n. ",
    "ickbinhier": "or via https://github.com/RobLoach/component-installer\n\"extra\": {\n    \"component\": {\n        \"name\": \"flag-icon-css\",\n        \"files\": [\n            \"js/datei1.js\",\n            \"css/datei2.css\",\n            \"oder_das_verzeichnis_mit_allem_inhalt/**\"\n        ]\n    }\n}\n. you can it rename to 'lipis/'\n. go to https://packagist.org/packages/submit , login with github account, put the github url in the field and click to check.\nand confirm the name components/flag-icon-css\n. ",
    "N8boy": "http://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#Decoding_table\nhere you can find all ISO Codes. Some of them, like xk, are just user assigned so they are not officially assigned. I think that's the reason why there is no xk flag.\n. #33 \n. ",
    "rolandjitsu": "@N8boy, I see. I get the countries from here and the data is not under my control. I'd prefer if I wouldn't do any data manipulation and if the flags would match the same alpha 2 code that mostly everyone uses.\nOtherwise, under what code is this country flag if it exists?\n. @N8boy, sure, so what your are saying is that you'll just ignore the existence of one country :) Because you do not have that flag as part of the pack, no matter if the code is user assigned or not.\nAnyway, I have just decided to use PNG sprites instead since I do not want to make 250+ requests for each flag, even if it means that I will not have the flexibility of scaling up/down.\n. ",
    "andcam": "voicing my request also for XK also. it's widely used, including the European Commission.\n. ",
    "gentisaliu": "Need the Kosovo (XK) flag as well, as the previous commenter noted, it is widely used, even in international institutions.. ",
    "RudeySH": "There's even an emoji for the XK flag.. EU is a known reserved ISO 3166 code. CIS on the other hand isn't even a two-letter code.. I would assume, yes. This entire repository is based on ISO 3166-1-alpha-2 country codes.. This is a duplicate of #332.. Similar to #359, this flag doesn't fit in because it does not have an ISO 3166-1 alpha-2 country code.. If I'm not mistaken Galicia is a subdivision of Spain. This repository only collects \"top-level\" country flags.. ",
    "Enalmada": "Kosovo getting an official code may remain a political issue forever but there is no reason for it to remain a technical issue.  I understand the initial hesitation, but at this point the XK code is universally accepted as a provisional code by enough organizations and databases that it belongs in this project.     . Kosovo getting an official code may remain a political issue forever but there is no reason for it to remain a technical issue. I understand the initial hesitation, but at this point the XK code is universally accepted as a provisional code by enough organizations and databases that it belongs in this project.. Kosovo getting an official code may remain a political issue forever but there is no reason for it to remain a technical issue. I understand the initial hesitation, but at this point the XK code is universally accepted as a provisional code by enough organizations and databases that it belongs in this project.. ",
    "catamphetamine": "I can see the flag has been added.\nhttps://github.com/lipis/flag-icon-css/pull/501\nSo that people reading this issue would know.. @copycut Did you come up with some other SVG flags source or how did you get around this issue?. @lipis I can see that \"XK\" territory flag has been added but the npm package hasn't been released since then. Will you be releasing an updated version?. @lipis Do you want a pull request?. ",
    "Saluev": "Indeed.\nWell, maybe you might accept modifications to icon-base.less simplifying alias creation for future users. .flag-icon-custom mixin can be renamed to something like .flag-alias then.\n. ",
    "yaniv691": "I think stretching the background height so the original design fits a 4x3 ratio is a good idea. The flag's original design should be first priority, with some stretching if needed. Can you please update the Sri Lankan flag?\n. @chris-gunawardena, correct me if I'm wrong, but I think stretching the yellow background is better than stretching the elements on the flag.\n. Hi, any update on these flags?\n. Why's is that intentional? The flag is wrong that way...\n. ",
    "chris-gunawardena": "Looks good to me. The colours represents different ethnicities and this is closest to the original colour ratios. \n\nThanks for all the input and great work put into fixing this guys!\n. ",
    "jackocnr": "Confirmed. Currently both vi.svg and vg.svg look like this:\n\nBut vi.svg should look like this:\n\nIt appears wikipedia is using an SVG - can we just use that?\n. ",
    "atomfrede": "Reasonable decision :) Thanks for the useful project.\n. ",
    "jonathanzh": "So quickly, thanks for your support!\n. ",
    "salsaweb": "Hi Lipis, looks like Flag of French Guiana is wrong or missed\nhttp://upload.wikimedia.org/wikipedia/commons/2/29/Flag_of_French_Guiana.svg\nGF:\n\nThanks!\n. ",
    "praveenscience": "Hi Lipis... Also India flag is wrong. Check out the Ashoka Chakra's (the blue disc) position. It should be inside the white background and also it should have some padding. Also the colours are totally not right.\nIN\nhttp://lipis.github.io/flag-icon-css/flags/4x3/in.svg\n\nCheck out the reference image from Wikipedia:\nhttp://upload.wikimedia.org/wikipedia/en/4/41/Flag_of_India.svg\n\n. ",
    "DelBianco": "\n\nThanks for this great work\n. ",
    "zanona": "could be a great additional anyway for those using for currencies and such ;) definitely worth the effort I guess.\n. ",
    "martinlindhe": "@lipis: question: could this \"png\" images situation perhaps be handled with a script that produces the png:s from the source svg:s using a cli tool? then this repo could distribute the script, and users in need could run it to produce the png:s, and we dont need to have the generated images in the repository. Just an idea\n. @lipis ah, well was just my 2 cents. i have no personal need for this, so won't put any effort into it\n. @tristanlins thanks! merged :)\n. @lipis i'll look into this hopefully tonight\n. @lipis Hi again. I have updated my branch and it is now line-by line as close as it can be with the flag-icon-base.less.\nI did originally reorder the .flag-icon properties alphabetically because it was suggested by scss-lint, but i reverted it to match your less version, and removed some empty lines. Hope this is fine to merge!\nThanks\n/m\n. @lipis ive created a new pull request with a squashed commit. had troubles rebasing this branch because i merged with your master.\n. ",
    "girtsl": "Ah, noticed that there has been the same issue already - #26.\n. Thanks! Btw, the proportions of the cross and rectangles also seems incorrect...\nPerhaps you could open up a new issue on going through all flags and checking their correctness?\n. ",
    "tristanlins": "@martinlindhe please see https://github.com/martinlindhe/flag-icon-css/pull/1 :-)\n. ",
    "karlito-who-else": "I absolutely agree with you, normally I would normally whitelist the LESS or SASS files to be processed via manual inclusion in a Gulp or Grunt task, however on this occasion I was testing out Harp as I had heard a lot of good things about it being quick and easy to get up and running with, but given the behaviour that I described, its approach is quite limiting in these kinds of situations.\nReally, I wouldn't have raised a pull request just because of Harp normally but a lot of my more junior colleagues use tools such as CodeKit, Koala, etc. so I thought I would mention it as it is an issue I see them dealing with quite often with vendor code:  It takes them 10 seconds to add a project, but then it takes them a few minutes to remove all of the LESS and SASS files from their project's bower_components or node_modules directories!\nI guess that they can deal with their problem at hand but based on those factors, I thought I would try and proactively offer a way to make this project easier to work with in these types of scenarios. If you feel strongly opinionated that developers should be in full control of their workflow and want to leave the code as-is then I understand that.\nPersonally I have a way around using this project within my own without encountering these issues so please go ahead and close this if you want.\nThanks\n. ",
    "catonwall": "Oh, I see. Sorry, I think I just have a mess in my mind. Because I think it's impossible to have flags as characters, I thought this could imput the flags without the img src an such...\nLooks that I will have to study more, haha. Thank you so much for replying. <3\n. ",
    "lampego": "Ok. Thanks\n. And I added the new country (Netherland Antilles) to http://en.wikipedia.org/wiki/ISO_3166-1#Current_codes\nWiki: http://en.wikipedia.org/wiki/Netherlands_Antilles\nYou can check here: http://userpage.chemie.fu-berlin.de/diverse/doc/ISO_3166.html\nThanks\n. Maybe :) Ok. I simply remove this country from my project\n. ",
    "ppowalowski": "Perhaps one could play a little with the colors. Looking at it again tells me that this one has very much contrast. This can be used as starting point - I think the idea is clear.\nWhat do you think?\n. For futher clarity: It's already in use on http://www.sygns.com\n. ",
    "SergioBarja": "Hi,\npersonally I think that in the small icons the emblem doesn't have sense because it's so small than it's not visible and it's only a black blurring.\n(I edited the svg to remove the emblem, to use svg is a great idea :+1:  )\n. ",
    "agorilla": "Also the file size of the SVG currently is 175 KB large because of the emblem. I'd also prefer a simpler version without the emblem which shrinks the size to 0.3 KB (the size of the french flag). \nSVG is an awesome format but if the graphics get to detailed, the file size explodes.\n. ",
    "oleksmarkh": "thanks for such a neat collection!\n. ",
    "bonatoc": "Nevermind, got it by looking at the source code of the demo.\nThanks.\n. ",
    "CThuleHansen": "+1\n. Sweet, thank you lipis. \n. ",
    "StuartMorris0": "No problem. I'll put it on my one day list and fork it. What do you mean by PRs?\n. ",
    "flekschas": "Sounds great thanks! Maybe I find out how to avoid breaking some flags by disabling certain SVGO plugins.\n. ",
    "petethepig": "+1\n. Another possible improvement would be to get rid of duplicates.\nus - um pair for example\n. @lipis I'm saying that this:\ncss\n.flag-icon-um {\n  background-image: url(../flags/4x3/um.svg);\n}\ncould potentially look like this:\ncss\n.flag-icon-um {\n  background-image: url(../flags/4x3/us.svg);\n}\nThus, if you have both flags (us and um) on one page you would only have to download one image.\n. ",
    "ilyabreev": "@lipis Do you mean to copy code from https://github.com/cfiorini/flag-icon-sass into this repo?\n. El-Salvador flag fixed in https://github.com/lipis/flag-icon-css/issues/131\n. @lipis now can kindly close this issue. Thanks for fix!\n. Do you plan to merge this pull request in near future?\nGithub viewer seems to show new version of flag https://github.com/lipis/flag-icon-css/blob/lk/flags/4x3/lk.svg\n. Made a pr https://github.com/lipis/flag-icon-css/pull/146\n. Really don't understand how this issue relates to the project.\n. Keeping true ratio isn't the goal of this repo, according to https://github.com/lipis/flag-icon-css/issues/129\nBut you're right that Bermuda (BM) flag is wrong. Especially the emblem.\n. I cannot find task \"sass:build\" in Gruntfile.\nI see  'less' task and it is called as a part of default Grunt run.\ncoffee\ngrunt.registerTask 'build',   ['less', 'cssmin']\ngrunt.registerTask 'default', ['build', 'watch']\nMaybe it would be better to add 'sass' task smimlarly but not including it to default build? \n. Thanks! I hope my issue reports are not very annoying :loudspeaker:\n. I'm sorry man. It is really fixed. \nIn my bug reports I looked at production package from bower.\nMay be other issues also already fixed?\nWhen do you plan to make a new release?\n. I think that accuracy in flag representation is very important even for this repo.\nFlags are svgs and they can be represented at any size. If they are small it's ok that they have some minor errors. But if they are large, minor errors become major :-(\n. You mean \"sprite\" right?\n. @jasomdotnet this example is using pngs. This repo is SVG.\nI think it would be better to use service like https://www.flag-sprites.com/en_US/ to build your own css sprite.\n. @jasomdotnet Всегда пожалуйста! :smile: \n. Maybe it'll be better to add grunt task that optimizes svgs and puts them to separate folder.\nOriginal flags won't get hurt in that case. And if anyone find ruined flag, we will submit an issue to svgo.\n. Relax man. We are all friends, no matter where are we from. \nIt is just a joke, I think. Don't let it stick to your heart so hard!\n. fixes #116 \n. Oh... Can you provide clear and precise manual for contributors in Readme.md? I'd like to help and I'll follow all of your recommendations.\nI use Inkscape for Windows and saved result as Optimized SVG.\n. Ok, I'll try to do my best and find as many errors as I can.\n. Yes, I know! But I am currently using your repo in my own project so in fact I combine business with pleasure :-) \n. Ok, will do for future issues.\n. Ok, understood.\n. Oops. Something goes really wrong. It's better to start from scratch for me.\n. I'm not an experienced git user so I don't understand. These commits appeared because I'm merged from your repo without rebase?\n. And now I must close this pull request, pack 3 commits into 1 and create new pull request?\n. Now THAT looks better.\n. Haha, noooo! Not all. But many. :smiley: \nRuined your email with github notifications? :smile: \n. ",
    "asauvez": "It seems that some flags do have a viewbox attribute:\nhttp://lipis.github.io/flag-icon-css/flags/4x3/ba.svg\nThis flag has viewBox=\"0 0 512 512\" on both 1x1 and 4x3 format. On 4x3, it should be \"0 0 640 480\".\n. ",
    "edorivai": "Could you take a look at #275?\n. ",
    "franciscod": "I think that's intentional on some flags. Argentina's 1x1 does it too but 4x3 doesn't.\n. ",
    "stjepan": "The flag is wrong. The colors are inverted.\n. It worked for me. Start up your NodeJs command prompt and go to the root folder of your ionic application and do following:\n1. npm install --save flag-icon-css\n2. bower install --save flag-icon-css\nNow back in your index.html (or what ever is your application startup file), include the css-file which is now in the lib/flag-icon-css/css folder.\n<link href=\"lib/flag-icon-css/css/flag-icon.min.css\" rel=\"stylesheet\">\nNow you're free to use it in you html files like this:\n<i class=\"flag-icon flag-icon-gr\"></i>\n. ",
    "p-l-": "Thanks! I use this contribution for one of my projects (https://github.com/cea-sec/ivre/commit/71ef4d1fcde22e00db1142c756ffdfe69489e10d). Hope it's OK for you @craigmdennis.\n. Even though the European Union is not a country, \"EU\" is an ISO 3166-1 alpha-2 code \"exceptionally reserved\", as well as \"UN\", among others.\n. ",
    "craigmdennis": "@p-l- Yeah, all good. I grabbed the SVG from the Wikipedia page and resized the container to match the other flags in this repo. \n@lipis Nice one.\n. ",
    "kamituel": "+1, even though EU is not a country, not having this flag limits usability of this, otherwise nice, library.\n. I've forked this repo and published it to bower under the \"flag-icon-css-eu\" name. It's exactly the same, but includes the eu flag.\nIt's here, for anyone for grabs: https://github.com/kamituel/flag-icon-css and here: http://bower.io/search/?q=flag-icon-css-eu.\n. ",
    "Foorack": "+1 Need this.\n. ",
    "1dolinski": "Could use this\n. ",
    "draconteus": "It feels a bit of aggressive change. Made a pull request (#91) which adds a possibility to use Sass as well, not changing completely to Sass (sass source files are already existed, but there wasn't any build tasks for it).\n. Wrong report, unofficial flag.\n. Sure. I try to also help in some of these issues and contribute to the repo :)\nI bit off:\nWhy is the 1:1 ratio? As I saw, the official flag designs using 2:1 (which would look ugly on website), but 1:1 distort the flags very badly. 4:3 seams a bit easier to achieve.\n. Yeah, sure. I saw it :) No offense, just was curious about implication of 1:1.\n. haha :D\n. Having a sass generation, in my opinion, encourages more developer to contribute to the repo. Lots of us use sass primarily.\nBut true, generating the same css with Less than Sass in not the best.\n. ",
    "barrymieny": "That isn't an official flag - it's just a design project.\n. ",
    "michellaurent": "This is probably because there are no version number in the package.jsonfile.\n\"version\": \"0.7.1\",\n@lipis: It would be also nice to publish the package on the npmjs.com website.\nYou should simply create an account and then npm publish your code.\n. ",
    "dbwhddn10": "iso code does not exist yet. but  International Aid Transparency Initiative defined XK code\nsee http://iatistandard.org/201/codelists/Country/\n. ",
    "semplon": "this my list in array already. maybe useful.\n$countries = array(\"AF\" => \"Afghanistan\",\n                    \"AX\" => \"Åland Islands\",\n                    \"AL\" => \"Albania\",\n                    \"DZ\" => \"Algeria\",\n                    \"AS\" => \"American Samoa\",\n                    \"AD\" => \"Andorra\",\n                    \"AO\" => \"Angola\",\n                    \"AI\" => \"Anguilla\",\n                    \"AQ\" => \"Antarctica\",\n                    \"AG\" => \"Antigua and Barbuda\",\n                    \"AR\" => \"Argentina\",\n                    \"AM\" => \"Armenia\",\n                    \"AW\" => \"Aruba\",\n                    \"AU\" => \"Australia\",\n                    \"AT\" => \"Austria\",\n                    \"AZ\" => \"Azerbaijan\",\n                    \"BS\" => \"Bahamas\",\n                    \"BH\" => \"Bahrain\",\n                    \"BD\" => \"Bangladesh\",\n                    \"BB\" => \"Barbados\",\n                    \"BY\" => \"Belarus\",\n                    \"BE\" => \"Belgium\",\n                    \"BZ\" => \"Belize\",\n                    \"BJ\" => \"Benin\",\n                    \"BM\" => \"Bermuda\",\n                    \"BT\" => \"Bhutan\",\n                    \"BO\" => \"Bolivia\",\n                    \"BA\" => \"Bosnia and Herzegovina\",\n                    \"BW\" => \"Botswana\",\n                    \"BV\" => \"Bouvet Island\",\n                    \"BR\" => \"Brazil\",\n                    \"IO\" => \"British Indian Ocean Territory\",\n                    \"BN\" => \"Brunei Darussalam\",\n                    \"BG\" => \"Bulgaria\",\n                    \"BF\" => \"Burkina Faso\",\n                    \"BI\" => \"Burundi\",\n                    \"KH\" => \"Cambodia\",\n                    \"CM\" => \"Cameroon\",\n                    \"CA\" => \"Canada\",\n                    \"CV\" => \"Cape Verde\",\n                    \"KY\" => \"Cayman Islands\",\n                    \"CF\" => \"Central African Republic\",\n                    \"TD\" => \"Chad\",\n                    \"CL\" => \"Chile\",\n                    \"CN\" => \"China\",\n                    \"CX\" => \"Christmas Island\",\n                    \"CC\" => \"Cocos (Keeling) Islands\",\n                    \"CO\" => \"Colombia\",\n                    \"KM\" => \"Comoros\",\n                    \"CG\" => \"Congo\",\n                    \"CD\" => \"Congo, The Democratic Republic of The\",\n                    \"CK\" => \"Cook Islands\",\n                    \"CR\" => \"Costa Rica\",\n                    \"CI\" => \"Cote D'ivoire\",\n                    \"HR\" => \"Croatia\",\n                    \"CU\" => \"Cuba\",\n                    \"CY\" => \"Cyprus\",\n                    \"CZ\" => \"Czech Republic\",\n                    \"DK\" => \"Denmark\",\n                    \"DJ\" => \"Djibouti\",\n                    \"DM\" => \"Dominica\",\n                    \"DO\" => \"Dominican Republic\",\n                    \"EC\" => \"Ecuador\",\n                    \"EG\" => \"Egypt\",\n                    \"SV\" => \"El Salvador\",\n                    \"GQ\" => \"Equatorial Guinea\",\n                    \"ER\" => \"Eritrea\",\n                    \"EE\" => \"Estonia\",\n                    \"ET\" => \"Ethiopia\",\n                    \"FK\" => \"Falkland Islands (Malvinas)\",\n                    \"FO\" => \"Faroe Islands\",\n                    \"FJ\" => \"Fiji\",\n                    \"FI\" => \"Finland\",\n                    \"FR\" => \"France\",\n                    \"GF\" => \"French Guiana\",\n                    \"PF\" => \"French Polynesia\",\n                    \"TF\" => \"French Southern Territories\",\n                    \"GA\" => \"Gabon\",\n                    \"GM\" => \"Gambia\",\n                    \"GE\" => \"Georgia\",\n                    \"DE\" => \"Germany\",\n                    \"GH\" => \"Ghana\",\n                    \"GI\" => \"Gibraltar\",\n                    \"GR\" => \"Greece\",\n                    \"GL\" => \"Greenland\",\n                    \"GD\" => \"Grenada\",\n                    \"GP\" => \"Guadeloupe\",\n                    \"GU\" => \"Guam\",\n                    \"GT\" => \"Guatemala\",\n                    \"GG\" => \"Guernsey\",\n                    \"GN\" => \"Guinea\",\n                    \"GW\" => \"Guinea-bissau\",\n                    \"GY\" => \"Guyana\",\n                    \"HT\" => \"Haiti\",\n                    \"HM\" => \"Heard Island and Mcdonald Islands\",\n                    \"VA\" => \"Holy See (Vatican City State)\",\n                    \"HN\" => \"Honduras\",\n                    \"HK\" => \"Hong Kong\",\n                    \"HU\" => \"Hungary\",\n                    \"IS\" => \"Iceland\",\n                    \"IN\" => \"India\",\n                    \"ID\" => \"Indonesia\",\n                    \"IR\" => \"Iran, Islamic Republic of\",\n                    \"IQ\" => \"Iraq\",\n                    \"IE\" => \"Ireland\",\n                    \"IM\" => \"Isle of Man\",\n                    \"IL\" => \"Israel\",\n                    \"IT\" => \"Italy\",\n                    \"JM\" => \"Jamaica\",\n                    \"JP\" => \"Japan\",\n                    \"JE\" => \"Jersey\",\n                    \"JO\" => \"Jordan\",\n                    \"KZ\" => \"Kazakhstan\",\n                    \"KE\" => \"Kenya\",\n                    \"KI\" => \"Kiribati\",\n                    \"KP\" => \"Korea, Democratic People's Republic of\",\n                    \"KR\" => \"Korea, Republic of\",\n                    \"KW\" => \"Kuwait\",\n                    \"KG\" => \"Kyrgyzstan\",\n                    \"LA\" => \"Lao People's Democratic Republic\",\n                    \"LV\" => \"Latvia\",\n                    \"LB\" => \"Lebanon\",\n                    \"LS\" => \"Lesotho\",\n                    \"LR\" => \"Liberia\",\n                    \"LY\" => \"Libyan Arab Jamahiriya\",\n                    \"LI\" => \"Liechtenstein\",\n                    \"LT\" => \"Lithuania\",\n                    \"LU\" => \"Luxembourg\",\n                    \"MO\" => \"Macao\",\n                    \"MK\" => \"Macedonia, The Former Yugoslav Republic of\",\n                    \"MG\" => \"Madagascar\",\n                    \"MW\" => \"Malawi\",\n                    \"MY\" => \"Malaysia\",\n                    \"MV\" => \"Maldives\",\n                    \"ML\" => \"Mali\",\n                    \"MT\" => \"Malta\",\n                    \"MH\" => \"Marshall Islands\",\n                    \"MQ\" => \"Martinique\",\n                    \"MR\" => \"Mauritania\",\n                    \"MU\" => \"Mauritius\",\n                    \"YT\" => \"Mayotte\",\n                    \"MX\" => \"Mexico\",\n                    \"FM\" => \"Micronesia, Federated States of\",\n                    \"MD\" => \"Moldova, Republic of\",\n                    \"MC\" => \"Monaco\",\n                    \"MN\" => \"Mongolia\",\n                    \"ME\" => \"Montenegro\",\n                    \"MS\" => \"Montserrat\",\n                    \"MA\" => \"Morocco\",\n                    \"MZ\" => \"Mozambique\",\n                    \"MM\" => \"Myanmar\",\n                    \"NA\" => \"Namibia\",\n                    \"NR\" => \"Nauru\",\n                    \"NP\" => \"Nepal\",\n                    \"NL\" => \"Netherlands\",\n                    \"AN\" => \"Netherlands Antilles\",\n                    \"NC\" => \"New Caledonia\",\n                    \"NZ\" => \"New Zealand\",\n                    \"NI\" => \"Nicaragua\",\n                    \"NE\" => \"Niger\",\n                    \"NG\" => \"Nigeria\",\n                    \"NU\" => \"Niue\",\n                    \"NF\" => \"Norfolk Island\",\n                    \"MP\" => \"Northern Mariana Islands\",\n                    \"NO\" => \"Norway\",\n                    \"OM\" => \"Oman\",\n                    \"PK\" => \"Pakistan\",\n                    \"PW\" => \"Palau\",\n                    \"PS\" => \"Palestinian Territory, Occupied\",\n                    \"PA\" => \"Panama\",\n                    \"PG\" => \"Papua New Guinea\",\n                    \"PY\" => \"Paraguay\",\n                    \"PE\" => \"Peru\",\n                    \"PH\" => \"Philippines\",\n                    \"PN\" => \"Pitcairn\",\n                    \"PL\" => \"Poland\",\n                    \"PT\" => \"Portugal\",\n                    \"PR\" => \"Puerto Rico\",\n                    \"QA\" => \"Qatar\",\n                    \"RE\" => \"Reunion\",\n                    \"RO\" => \"Romania\",\n                    \"RU\" => \"Russian Federation\",\n                    \"RW\" => \"Rwanda\",\n                    \"SH\" => \"Saint Helena\",\n                    \"KN\" => \"Saint Kitts and Nevis\",\n                    \"LC\" => \"Saint Lucia\",\n                    \"PM\" => \"Saint Pierre and Miquelon\",\n                    \"VC\" => \"Saint Vincent and The Grenadines\",\n                    \"WS\" => \"Samoa\",\n                    \"SM\" => \"San Marino\",\n                    \"ST\" => \"Sao Tome and Principe\",\n                    \"SA\" => \"Saudi Arabia\",\n                    \"SN\" => \"Senegal\",\n                    \"RS\" => \"Serbia\",\n                    \"SC\" => \"Seychelles\",\n                    \"SL\" => \"Sierra Leone\",\n                    \"SG\" => \"Singapore\",\n                    \"SK\" => \"Slovakia\",\n                    \"SI\" => \"Slovenia\",\n                    \"SB\" => \"Solomon Islands\",\n                    \"SO\" => \"Somalia\",\n                    \"ZA\" => \"South Africa\",\n                    \"GS\" => \"South Georgia and The South Sandwich Islands\",\n                    \"ES\" => \"Spain\",\n                    \"LK\" => \"Sri Lanka\",\n                    \"SD\" => \"Sudan\",\n                    \"SR\" => \"Suriname\",\n                    \"SJ\" => \"Svalbard and Jan Mayen\",\n                    \"SZ\" => \"Swaziland\",\n                    \"SE\" => \"Sweden\",\n                    \"CH\" => \"Switzerland\",\n                    \"SY\" => \"Syrian Arab Republic\",\n                    \"TW\" => \"Taiwan, Province of China\",\n                    \"TJ\" => \"Tajikistan\",\n                    \"TZ\" => \"Tanzania, United Republic of\",\n                    \"TH\" => \"Thailand\",\n                    \"TL\" => \"Timor-leste\",\n                    \"TG\" => \"Togo\",\n                    \"TK\" => \"Tokelau\",\n                    \"TO\" => \"Tonga\",\n                    \"TT\" => \"Trinidad and Tobago\",\n                    \"TN\" => \"Tunisia\",\n                    \"TR\" => \"Turkey\",\n                    \"TM\" => \"Turkmenistan\",\n                    \"TC\" => \"Turks and Caicos Islands\",\n                    \"TV\" => \"Tuvalu\",\n                    \"UG\" => \"Uganda\",\n                    \"UA\" => \"Ukraine\",\n                    \"AE\" => \"United Arab Emirates\",\n                    \"GB\" => \"United Kingdom\",\n                    \"US\" => \"United States\",\n                    \"UM\" => \"United States Minor Outlying Islands\",\n                    \"UY\" => \"Uruguay\",\n                    \"UZ\" => \"Uzbekistan\",\n                    \"VU\" => \"Vanuatu\",\n                    \"VE\" => \"Venezuela\",\n                    \"VN\" => \"Viet Nam\",\n                    \"VG\" => \"Virgin Islands, British\",\n                    \"VI\" => \"Virgin Islands, U.S.\",\n                    \"WF\" => \"Wallis and Futuna\",\n                    \"EH\" => \"Western Sahara\",\n                    \"YE\" => \"Yemen\",\n                    \"ZM\" => \"Zambia\",\n                    \"ZW\" => \"Zimbabwe\");\n. Hmm I see, I'll try to edit it one by one so it considerable. \n. ",
    "jjmpsp": "@semplon Thank you, saved me some time :+1: \n. ",
    "yratof": "Less of an issue, more of a helper for projects where all flags can be used.\nHaving to manually type this list can be time consuming, so it's been done\ntwice here. Ideally, this should be attached on a document or a gist\nOn Fri, 22 Jan 2016 at 12:27, Ilya Breev notifications@github.com wrote:\n\nReally don't understand how this issue relates to the project.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/lipis/flag-icon-css/issues/80#issuecomment-173888438.\n\n\nCheers,\nCommon sense advocate,\nAndrew Smith\n. ",
    "felipearosemena": "@yratof Thanks for this! I was trying to find a good solution for a country field for ACF. I just created a select field and added your list as options. Saved me tons of time!\n. ",
    "thecotne": "https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#User-assigned_code_elements\nthis country is even participating in the Olympic games (European Youth Olympic Festival Tbilisi 2015)\nso country defiantly exists \ni am developing Tbilisi 2015  website Kosovo is in country list\ni have add flag manually but ....\nconsider adding Kosovo flag\n. ",
    "jimaek": "I enabled auto-updates on jsDelivr. Our bot will now automatically keep this project updated. The latest version is now live http://www.jsdelivr.com/#!flag-icon-css\n. ",
    "p2made": "Yay! :)\n. ",
    "nebrot": "Here is a list: https://github.com/lipis/flag-icon-css/issues/80\n. ",
    "Filoz": "I think it could be... and it should not be so difficult to do.\nMany people prefer to save in their application  alpha-3 code rather  then alpha-2.\n. In order to keep a smaller size for the css file, it could be created a version with only alpha-3 so the user can choose which one to use (alpha-2.css or alpha-3.css).\n. @ninjanye give a look to this repo: https://github.com/7kfpun/flag-css\n. ",
    "ninjanye": "This would be useful to me too. Would you accept a pull request to address this issue? I'd be happy to do it\n. Thanks @Filoz. For what it is worth, I have forked the repo and added all the ISO3166 Alpha-3 characters.\nMy repository is here: https://github.com/ninjanye/flag-icon-css\nThe result is as follows:\n.flag-icon-gr,\n.flag-icon-grc {\n  background-image: url(../flags/4x3/gr.svg);\n}\n.flag-icon-gr.flag-icon-squared,\n.flag-icon-grc.flag-icon-squared {\n  background-image: url(../flags/1x1/gr.svg);\n}\n. Does that differ from my fork? https://github.com/ninjanye/flag-icon-css\n. Ah, ok.  If it helps you, the fork I made already has support for both 2 and 3 digit codes\n. ",
    "belikemike": "I forked it and converted it to 3 digit last night. Our geolocation uses the 3 digit code. I will also be supporting the 2 digit as well. \n. Not yet, I needed 3 currently, working on supporting both. I am open to project organization suggestions.\nhttps://github.com/belikemike/flag-icon-css\n. I was confused when because I only saw a few 3 digit svg files. Looking into the last commits I see your approach. Take my flags if you want, but as Lipis pointed out, I am not fan of both at the same time as since we don't use 2 digit codes.\n. ",
    "jgpacheco": "Why not merge @ninjanye fork to main repo?. ",
    "tbaddade": "You can use a compressor, like this one. http://petercollingridge.appspot.com/svg-editor\nE.g. rs.svg File \nOriginal file size: 883.9 kB\nOptimised file size: 533.2 kB (60.3%)\n. ",
    "CemDemirkartal": "You have to delete metadata and combine sturctures in svg because all are seperated. This is totally awful size of svg. with junk data. Nobody needs meta in background-image.\nAnd why 512px ?\nYou have background-size: contain; in css. Even it can be 1px too. Doesnt need big numbers to calculate and waste traffic in websites\nOptimize by myself (CorelDraw X7 SVG Export + Text editor)\nI reduced 1x1/tr.svg  1.57 kb to 409 byte\n-> Size 100px\n-> Include <?xml version=\"1.0\" encoding=\"UTF-8\"?>\n-> No SVG tag attributes (only width/height/xmlns)\n-> No Metadata and Comment\n-> No id in tags\nSVG tag attributes are useless mostly, You can save more by deleting not needed parts.\n. I'm started to interest in different way of it. I try to find easylier way. Some of flags are out of the real drawing elements, according to flags in Wikipedia. The program which you used, it doesnt use SVG's rendering elements like circle and etc. It's only in basic level.\nCorelDraw is not the best tool for it. I seen that too high detailed flags are getting broken like US flag. CorelDraw changes cordinates to strange type of numbers. Originals in wikipedia so nice.\nBut only withot not needed tags it reduces size.\n. ",
    "copycut": "PR: https://github.com/lipis/flag-icon-css/pull/111\n. By using the flag I discover that some don't render well with this viewBox set :(\n. Yes I don't know where the flags came from but I think I will remake them with sketch base on wikipedia source and optimized as possible for the web. Thanks for your feedback.\n. Agree the minified css must be the same, I will restore at the original version.\nThe sketchs files can be usefull for someone that want another ratio then 1.3 ou 1:1.\nMaybe I can make another repository with theses sources files ?\n. I agree with @lipis, this repository, I think, is about a out of the box, easy to use, harmonized flags. And many flags have multiples ratio (my country, Belgium is a great example), it's the responsibility of wikipedia to keep all theses specifications and historical choices.\n. ",
    "alchemy313": "really need this\n. ",
    "Jokero": "+1\nThese flags are widely used in Web. For example, you can see Scotland. Wales and Northern Ireland flags on Miss World page (http://www.missworld.com/contestants)\n. Maybe country name?\nflag-icon-scotland\nflag-icon-england\nflag-icon-wales\nflag-icon-northern-ireland\n. gb-eng, gb-nir, gb-sct, gb-wls are good. They all are from ISO 3166-2\n. gb-eng, gb-sct, gb-wls are ok, but I'm not sure about Northern Ireland flag.\nFrom Northern Ireland wiki:\n\nThe official flag is that of the state having sovereignty over the territory, i.e. the Union Flag.\n...\nThe Ulster flag and the Cross of St Patrick have no official status and, under the Flags Regulations, are not permitted to be flown from Government Buildings\n\nBut from flag of Northern Ireland wiki:\n\nThe Saint Patrick's Saltire is sometimes used by the government to represent Northern Ireland alongside the other countries of the United Kingdom, and is the centrepiece of the badge of the Police Service of Northern Ireland.\nThe Ulster Banner remains in use by unionists, a number of sporting organisations in Northern Ireland and some local government authorities under Unionist control.\n\nSt Patrick's Saltire:\n\nUlster Banner:\n\n\nI do not know which one to use. Maybe we add both flags?\n. We can keep only the flags of Scotland, England and Wales. Because they are all countries and have official flag\n. And GB-NIR is province (https://en.wikipedia.org/wiki/ISO_3166-2:GB)\n. Cool!) Thanks :+1:  Publish please new version\n. It would be great)\n. @carlosdv4 I tried to investigate this early https://github.com/lipis/flag-icon-css/pull/120#issuecomment-167011317. NIR is not a country and it does not have own official flag\n. @carlosdv4 I don't know the real situation around Northern Ireland, I just use public resources to get information :) So you can take a look at this page https://www.iso.org/obp/ui/#iso:code:3166:GB and find \"Northern Ireland\". It's marked as \"province\". In context of ISO 3166-2 my phrase is correct, but there is another question: does this standard contain correct information? :smile: Anyway this question is not related to this repository\n. ",
    "hdIsaac": "Not yet! There will be another referendum to decide if we keep our current flag or choose the new design.\n. ",
    "briannyeko": "hi!\nSolved the issue(using bower to simplify everything) \nthx anyways!\n. ",
    "jcdsr": "Great! stuff. Thx. But the GB-NIR is not showing up on your css. \nNIR Flag\nhttps://en.wikipedia.org/wiki/File:Flag_of_Northern_Ireland.svg\nThis NIR flag has been used on football and other events.\nhttp://www.irishfa.com/ \nhttp://www.uefa.com/uefaeuro/season=2016/teams/team=63/index.html\n. :D You can run into a lot of troubles by just mention \"NIR is not a country and it does not have own official flag\"\nMay not be totally official but to every NIR that's their flag.\nCould you add that flag to your files, please. I'm sure you won't get that many request for NIR.\nRegards.\n. Anyway if you don't want to do it, here is the solution for NIR flag your lazy...\nhttps://github.com/carlosdv4/norther_ireland_flag_svg\nTook me 5 min to do it.\n. Here is the solution for Northern Ireland:\nhttps://github.com/carlosdv4/norther_ireland_flag_svg\n. ",
    "seanfoo": "I will say that I'm using the flags in a sports-related setting and for the\npurpose of soccer, NIR is a \"country\" that competes with other countries.\nRegardless of that though you probably need to pick a standard and stick\nwith it as there are dozens of such gray areas all over the world.  Kosovo,\nSouth Sudan, Catalonia, Gibraltar, Jersey etc.  I'd definitely look at the\nstandards out there as they've been dealing with these issues for a while\nnow.\nBTW, great project. really love it.\nsean\n\nSean Forman\nSports Reference LLC, President\nhttp://www.sports-reference.com/\nOn Wed, May 11, 2016 at 5:54 AM, Lipis notifications@github.com wrote:\n\n:D You can run into a lot of troubles by just mention \"NIR is not a\ncountry and it does not have own official flag\"\nWhat kind of troubles?! It's a free world man.. we can say and do whatever\nwe want.. (at least in this part of the world..)\nCould you add that flag to your files, please. I'm sure you won't get that\nmany request for NIR.\nNope.. sorry.. maybe if I'll get too many requests I'll reconsider.. :)\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly or view it on GitHub\nhttps://github.com/lipis/flag-icon-css/pull/120#issuecomment-218414151\n. I may be wrong, but I believe that if you wanted to contribute a set of\noriginal aspected flags you could upload them as a pull in github.  My\nterminology may be off.\n\nsean\nSean Forman\nSports Reference LLC, President, http://www.sports-reference.com/\nhttps://twitter.com/sean_forman     https://www.linkedin.com/in/seanforman\nOn Wed, Feb 6, 2019 at 5:31 AM Marek Matulka notifications@github.com\nwrote:\n\n@Findus23 https://github.com/Findus23 but that would mean a manual work\nfor every project - if this project is list of flags, I'd prefer all flags\nin their original aspect ratio - then using css it's easy to place them\ninside square/circle/rectangle and fit/zoom/stretch/what not - for a\nparticular use. Or if user users mostly are looking for 1x1 and/or 4x3\nratio, then have three sizes: original, 1x1, 4x3.\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/lipis/flag-icon-css/issues/224#issuecomment-460974557,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AAV6phzU0PD3h9a8oYHVMthKPLV02dZDks5vKq76gaJpZM4IGVgN\n.\n. I believe that X? codes are in some way provisional so I'd question if they\nare appropriate for the project.\nOn Jun 20, 2016 4:38 AM, \"Tom Lutzenberger\" notifications@github.com\nwrote:\n1.\nJan Mayen is Part of Norway and has no own flag:\n\"Jan Mayen is a volcanic island in the Arctic Ocean and a part of the\n   Kingdom of Norway.\"\n   (Wikipedia https://en.wikipedia.org/wiki/Jan_Mayen)\n\"Neither Svalbard nor Jan Mayen have their own flag or coat of arms,\n   and the flag of Norway is used for both of them, both alone and as a group.\"\n   (Wikipedia\n   https://en.wikipedia.org/wiki/Svalbard_and_Jan_Mayen#Application)\n2.\nSaba is missing (Flag\n   https://en.wikipedia.org/wiki/Saba#/media/File:Flag_of_Saba.svg)\n   3.\nZimbabwe is not missing. See here\n   https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/zw.svg\n   4.\nSint Eustatius is missing (Flag\n   https://en.wikipedia.org/wiki/Sint_Eustatius#/media/File:Flag_of_Sint_Eustatius.svg\n   )\n   5.\nKosovo is missing, but (IMHO) it's political status should be\n   clarified (Flag\n   https://en.wikipedia.org/wiki/Kosovo#/media/File:Flag_of_Kosovo.svg)\nFor the future, please do more research.\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/lipis/flag-icon-css/issues/262#issuecomment-227082127,\nor mute the thread\nhttps://github.com/notifications/unsubscribe/AAV6pnyVD50V0unf9HdRQBUwKPCT69Jeks5qNlGHgaJpZM4I5bWS\n.\n. @stevensacks,\n\nif you want to create a sprite and upload it here. I'm sure the maintainer would consider including it in the build process.  This might be helpful.\nhttps://css-tricks.com/svg-sprites-use-better-icon-fonts/\nhttps://github.com/jkphl/svg-sprite\nWe've been using the icons as given for over a year now with no issues, but we only include one flag per page.  We can debate whether forcing every user to download a the 170kb serbian svg is appropriate or not.  YMMV.\nsean. You should do that Niels. I would subscribe.\nOn Sat, Jun 30, 2018, 11:20 AM Niels Brummerstedt notifications@github.com\nwrote:\n\nMost countries have standards (or even laws) defining their flag.\nI propose creating a new series next to 1:1 and 3:4, which will be\nstrictly following these rules.\nFor example: The Danish flag is of proportions 28:37, while the US flag is\n10:19\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/lipis/flag-icon-css/issues/469, or mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AAV6preNaHmIz4enWdSYFuYX_sNn12TOks5uB5c9gaJpZM4U-AXv\n.\n. \n",
    "jakwo": "@lipis First of all, thanks for your work!\nI am writing a small app about the UEFA EURO2016, for which Northern Ireland qualified. So the flag is widley spread on every match schedule everywhere. No offense, just saiing :) \nI am using @carlosdv4 flags for now.\n. Well, the official UEFA website is probably a good starting point: http://www.uefa.com/uefaeuro/season=2016/teams/team=63/index.html\n. @lipis Thank you :)\n. That was fast. Appreciate it!\n. ",
    "bcaller": "Yes.\n4x3 flag is broken\n1x1 flag looks fine except colour #ccc should be #fff\n. ",
    "jasomdotnet": "How much is \"huge\"?  Everything under 200-300 KB is acceptable.\n. Perfect tip @ilyabreev , spasiba!\n. ",
    "vltr": "Oh, well, sorry! I didn't searched for it earlier. For me the results were great, but I didn't pass through all flags with a clinical eye :) Cheers!\n. I sense a bit of xenophobia in your comment, but stay cool, I looked at least 10 flags, including Spain, \"gb-wls\", South Africa, Mexico and others. I really feel sorry for your comment.\n. Thanks @ilyabreev, that's a more constructive idea, but, as the course of this issue goes, it's better for me to unstar the project, use a gif / png version I already have and wave good luck for a project that's in a social network with a xenophobic author. That doesn't seems right.\n. @ilyabreev I'm relaxed :)\n@lipis You insulted me by making assumptions, either I'm brazilian or not. If you chose the brazilian flag as an example of success of SVGO, directly, it's probably because this happened before. I repeat, PROBABLY. In any case: a very unfortunate example to give.\n. @lipis The insult is in your own words:\n\n.. and I (wrongly maybe) assumed that you are a Brazilian or at least know how the Brazilian flag looks like since it's written on your profile..\n\nDo you always makes this assumption, that all people will look only their flag and absolutely forget that this project have all flags?\n. Agreed about all facts. And, about your question, the answer is in the third comment after you closed this issue. Perhaps if you named another flag, this could have passed in blank, I'll not deny that because I'm no hypocrite. But, in a second thought, the behavior itself it's wrong. It's valid to anyone.\n. No, you didn't understand a bit what I'm talking about. You simply presume that someone will only look at the flag of his country (and not the rest) based on his profile. That's the bottom line.\n. I'm just polite and dislike controversial assumptions of any kind, specially from the author of a project I was keen to use (and help). I just feel sorry for you.\n. We're settled then :) Cheers!\n. But the project is and the course taken was not pleasant, unfortunately.\n. Neither I. But here's something for the future releases: unit tests, based on high-res flags (originals) and renders of the SVG flags on PhantomJS (or any other engine), with pixel subtraction and a bias level of acceptance (since not every anti-aliasing algorythm is equal, IMHO).\n. Oh ... Well, it was my time to make the wrong presumption then, but I'll keep it to myself. Cheers!\n. ",
    "joshghent": "@lipis Can this be closed now? Looks like this was done in https://github.com/lipis/flag-icon-css/pull/338 👍 \n. ",
    "palnes": "Thanks for the prompt reply, I didn't stop to think about your ratios. (22:16 for .no). :)\n. ",
    "downhiller": "With over 5000 stars I don't really understand how these glaring issues haven't been fixed yet.  Do you not accept PRs from contributors or something? :(. I've noticed a lot of colours are wrong - even simple well-defined things like the red and blue on the UK flag.  Is that intentional for some reason, or should I fix?. Still missing eleven months later.... ",
    "tomlutzenberger": "Colors are identical.\n. @MatneX Flags are not always used to display languages. Also, some countries use more than one language officially.\n. http://www.flagsarenotlanguages.com/blog/why-flags-do-not-represent-language/. I can reproduce on Win7 / IE 11.0.9600\n. Really strange...\nOn the first link it gets displayed like 1x1, but the black and green area seem to get cropped.\nOn the second one it's rendered correctly (4x3).\n\n. <sarcasm>Of course we do...</sarcasm>\nCould it be possible that there's something \"wrong\" (= IE incompatible) with the HTML or CSS on the project page?\n. I tried max-height: 75%; on .country and img.flag.\nDidn't work.\nBut the following makes it less worse (only tested in IE11 yet):\ncss\n.country {\n  /*max-width: 100%;*/\n  width: 100%;\n}\n.country .flag {\n  margin: 0 auto;\n  max-height: 7.5vw;\n  max-width: 10vw;\n}\nYou could also try to add width and height to the image tags.\nhttp://stackoverflow.com/questions/3396475/specifying-width-and-height-as-percentages-without-skewing-photo-proportions-in\n. I partially agree with @felixvictor, except I would just loop the list and call the mixin.\n. Please see #26 . 1. Jan Mayen is Part of Norway and has no own flag:\n\n\"Jan Mayen is a volcanic island in the Arctic Ocean and a part of the Kingdom of Norway.\"\n(Wikipedia)\n\"Neither Svalbard nor Jan Mayen have their own flag or coat of arms, and the flag of Norway is used for both of them, both alone and as a group.\"\n(Wikipedia)\n2. Saba is missing (Flag)\n3. Zimbabwe is not missing. See here\n4. Sint Eustatius is missing (Flag)\n5. Kosovo is missing, but (IMHO) it's political status should be clarified (Flag)\n\nFor the future, please do more research.\n. You're almost right, @seanfoo :smiley: \nAfter a quick research, I found out, that those X* Country Codes are user-assigned = non-official.\nhttps://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#User-assigned_code_elements\nAnd I agree, that it it questionable if \"unofficial\" Flags should be included.\nOn one hand, it would be nice to have a complete collection of all country flags. On the other hand it is also reasonable to only include currently official and acknowledged flags.\nBut it's @lipis' turn to decide wether he wants to maintain a flag collection that represents the current situation or a historical flag archive.\n. I seriously wonder how this is even supposed to work...\nHigh contrast modes are always associated with color reduction.\n@Rak- How about a screenshot or something?\nYou can't just drop a line with almost no information and expect that it get fixed.\n. I doubt that \"fixing\" this is possible. Because there is nothing to fix.\nHigh contrast mode means color reduction.\nAfter enabling, in most cases 2-4 colors are left to display.\nNo colors = no flags.\n. What if the opposite is the case and someone only needs the square flags?\nThen he/she faces the same problem.\n. This would be a solution, I thought of that.\nBut I'm not really a fan of string comparison/checking like if (var == \"something\") doThat().\nNot sure. Let's wait for @lipis' reply and see what he thinks of it.\n. I'm not sure if this would compile correctly, because of the usage of variables inside the quotes.\n. Duplicate of #305 and many more (https://github.com/lipis/flag-icon-css/issues?utf8=%E2%9C%93&q=is%3Aissue%20europe)\nSee:\n- https://github.com/lipis/flag-icon-css/blob/master/flags/1x1/eu.svg\n- https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/eu.svg\n. This could also be realised by using CSS.\n. You might consider replacing it entirely.\nThere are a lot differences to the original flag.\n. Why not copy the wikipedia flags and scale/crop them?\n. @matteocng You could call the API via AJAX and store the data.\n. Can confirm.\n. @notcmoore  Maybe file reading permissions on the server?. Based on @Findus23 idea I'd suggest to move all non-official flags to a separate project to keep this on small and clean. Most people will only need the official flags.. @inoas https://github.com/lipis/flag-icon-css/blob/master/LICENSE. Because it's necessary. @lipis mentioned about a thousand times, that he will only include official flags of countries which are in ISO 3166-1-alpha-2.\nOtherwise people will come up with some flag only he/she might need once in a lifetime and the project will end with a million flags including every karate club flag in south-east-asia and every.\nThat would be ridiculous.. Like a JSON file?. Please see #13 and #236 . I'd suggest fork+extend OR overwrite in your own CSS file.. I recommend to look at Ionic's documentation first:\nhttps://ionicframework.com/docs/developer-resources/third-party-libs/\nGoogle \"use css library with ionic 3\" => 2. result. @Elfayer Did you take a look at Wikipedia's SVG as well? There is a different color value than #f00 (=> #de2910). Also, if you google for \"Pantone 186\" you get a differing value (#c8102e), too.\nPretty confusing.... > \"For the Federal Identity Program, the red tone of the standard flag has an RGB value of 255–0–0 (web hexadecimal #FF0000).\"\nhttps://en.wikipedia.org/wiki/Flag_of_Canada. I'd argue that using pantone is kinda useless on the web... 🤔 . I'd say RGB. @Dinfyru This would mean to rename everything and as a result it would break everybody's code on upgrade. Bad idea.\nYou should disable your adblocker or reconfigure it to exclude the flag.. Kurdistan is not an official country nor does it have an ISO-3166 country code. Therefore I doubt that there is any chance it will be included.. @ejdzipi If you browse through some of the older issues, you'll see that there have been a lot of requests for extra flags. As @lipis stated many times, this project will only contain flags of countries that are listed within the ISO 3166-1 Standard.. ",
    "oller": "Sure...\n. ",
    "JeetuChoudhary": "I  am facing the same issue. I did as described above, still it is not working . ",
    "RalPhounet": "You can download the flag-icon-css-master.zip there http://flag-icon-css.lip.is/.\nThe you can just copy the\"css/flag-icon.css\" file into your Ionic project \"src/assets/css\" folder, and the\"flags\" folder into your \"src/assets/flags\".\nThen add the <link href=\"assets/css/flag-icon.css\" rel=\"stylesheet\"> line in your index.html.\nNow you're free to use it in you html files like this:\n<button ion-button (click)=\"changeLang('fr')\">\n      <i class=\"flag-icon flag-icon-fr\"></i>\n    </button>. ",
    "vanthome": "I think I explain why you should:\nThis allows usage with package managers that are CSS aware or eco systems like the VCL https://github.com/vcl/doc\nWhat do you mean by \"something else\"?!\nThis lib just has one set of CSS rules as far as I can see in the built version.\n. ",
    "blabno": "Why? This is very good PR. I would really like to see that in.. ",
    "Suriv": "Hi\n@lipis \nCatalonia is not a country , it is an autonomy of a country\n. ",
    "ramoncarreras": "That's true @Suriv. 👍\nAccording to the project description (a collection of all country flags in SVG), it should not be added.\nI opened this issue because I use the SVG flags to represent languages ​​in my web projects.\n. ",
    "ttk": "No need to get emotional and I want to keep this discussion technical.  And I am not complaining, but just seeking clarification.  So the short answer is that there isn't any technical limitation to having different flag proportions, and the current choice of proportions was arbitrarily chosen by the previous project maintainer.  Fair enough.\n. ",
    "gregorymachon": "Feel free to ignore me ;) just realized it's already done.\nGreat work btw!:)\n. Just had a look here https://github.com/jakearchibald/svgomg \nSVGOMG = SVGO + MG (Missing GUI) :)\nSo it's pretty much the same thing, with I guess some additional options switched on by default (in the GUI).\n. Thanks for updating rs flag.\nJust an FYI, on our end we've ended by with running: svgo -f ./flags/4x3 -o ./flags/4x3 --config=svgo.yml --precision=1 using below svgo.yml saving ~30% on the overall size.\nplugins:\n    - cleanupAttrs      \n    - cleanupEnableBackground\n    - cleanupIDs\n    - cleanupNumericValues\n    - collapseGroups\n    - convertColors\n    - convertPathData\n    - convertShapeToPath\n    - convertStyleToAttrs\n    - convertTransform\n    - mergePaths\n    - moveElemsAttrsToGroup\n    - moveGroupAttrsToElems\n    - removeComments\n    - removeDesc\n    - removeDimensions\n    - removeDoctype\n    - removeEditorsNSData\n    - removeEmptyAttrs\n    - removeEmptyContainers\n    - removeEmptyText\n    - removeHiddenElems\n    - removeMetadata\n    - removeNonInheritableGroupAttrs\n    - removeUnknownsAndDefaults\n    - removeUselessDefs\n    - removeUnusedNS\n    - removeUselessStrokeAndFill\n    - removeXMLProcInst\n. ",
    "PoGo606": "According to the ISO Online Browsing Plarform the code TB is currently Unassigned.\nBut looking at this page : https://vec.wikipedia.org/wiki/ISO_3166-1, Tibet is referenced as TB \nMaybe this code would be fine to use.\n. @okzhu \nThe wikipedia page I'm quoting is saying otherwise.\nIt appears that the TB is referenced in ISO_3166-1 but not in ISO_3166-2, strange...\n@lipis Do you have any concerns about using the TB for the Tibet flag ? Or shall we use another code ?\n. @okzhu Look, I'm not trying to have a debate whether the TB is official or not.\nAll we need here is a suitable code to use for the Tibet flag in the library :)\nDo you have any recommendation on this matter ?\n. Great.\n. ",
    "okzhu": "@PoGo606 lol... check this。。。\nhttp://www.iso.org/iso/home/store/catalogue_tc/catalogue_detail.htm?csnumber=63546 \nor \nhttp://www.unece.org/cefact/locode/subdivisions.html , \nno Tibet in ISO_3166-1 ,you are liar,\n顺便说一句。悄悄的在wiki上面夹带一些假消息，然后大肆宣扬，有意义吗？或者说这样的钱，你赚得不亏心吗？\n. @PoGo606 what？check this。。。https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2\nISO_3166-1 has 3 alpha version，tell me。。 which version。\nin your last post it says come from alpha 2，but i checked 。。no。。。。no tb in alpha-2 ，\nyour are error。 wikipedia。。don't trust it。。。。\n. @PoGo606 no。i don‘t want debat。i just tell you what ever in ISO_3166-1 or ISO_3166-2 ，no tb。wikipedia has a lot error message。\nif you want tb in this lib。。\ni don't care ..do ever you want。this your chose。\nbut you shud more strict。。\n. @ruoru 妈的。贼。他妈的恶心。上面还说什么流行。。我还说 is 的旗  也流行啊。作者其实已经关闭了。并且已经说明了 这个lib 依据的是 ISO 3166-1-alpha-2  这个。莫名其妙的要一些其他的旗子。其实放不放上去。根本就是政治问题。和自己的身份认同的问题。既然作者说了是 ISO 3166-1-alpha-2 那有个屁的好说的。要么叫作者改描述。然后作者想加什么旗子就加什么旗子。这群家伙在这里bb的没完。. ",
    "MrBenGriffin": "'bo' is the 2 character language code for Tibetan, but that is Bolivia in the country code..\nSo, the actual value is CN-54  (as Tibet is now a region of China). cf. https://en.wikipedia.org/wiki/Template:ISO_3166_code_China_Tibet\n. Flags are political. There will be some (such as okzhu above) who object to the idea of depicting the Tibetan flag as it is considered (by the Chinese Communist Party) representative of the Tibetan Freedom movement.\nHowever, the Tibetan flag serves many purposes - it's very much a symbol that represents the Tibetan culture and community both within and outside Tibet - without any furtherance of a political agenda.  Needless to say, as the current government of China has decided to denigrate the Tibetan flag, they would not consider it as representative of the Tibetan Autonomous Region as marked by the region code CN-54.\nAm I personally in favour of adding the Tibetan flag? Definitely so. Will you get stick from China if you do?  Most likely.. I would like to add that as soon as you added Northern Ireland, you extended the set to include regional flags. The official flag for Northern Ireland is the Union Flag, (popularly known as the Union Jack) which is the same as the GB flag.  Bearing that in mind, the use of a flag for Tibet would be acceptable within your current boundaries.. @okzhu - please keep a civil tongue, regardless of your language. 說話彬彬有禮. ",
    "mattab": "Hi @lipis \nGood to see you here! \nWe're considering using your nice flags icons in Piwik core :-)\nFYI In @Piwik we're adding Tibet with country code ti and this flag: https://github.com/piwik/piwik/pull/11272/commits/50ae36c17078a3e1079e126229b8736dd4553239\n. ",
    "ruoru": "I come from China. I do not think politics should be included in any code. Tibet is a part of China. The Tibet flag is a national flag. If you have time to look at the history of Tibet and go to Tibet, it is a beautiful place, welcome to China.\nwiki Tibet flag and please close this issue.. @okzhu \n\nipis reopened this Feb 20, 2017\n\n你能看到这个issue的状态是open的状态，因为这个旗子是跟国旗放在一起的，当然不行了～\n@MrBenGriffin\nChina is different from Northern Ireland, and i do not argument some politics in code.. no, thank u. :). ",
    "recallfx": "UK is exceptionally reserved ISO 3166-1 alpha-2 code:\nSee https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#Exceptional_reservations\n. ",
    "ShreyasFadnavis": "Check this out\nhttps://github.com/lipis/flag-icon-css/pull/235\n. @MaximMoiseenko I will do that in a day or two.. Thank you for your response ☺\n. Done.. Sorry for the late response! Check #259 \n. ",
    "MaximMoiseenko": "Great, thanks\n. @ShreyasFadnavis can you add css derective and merge this commit into master banch?\n. ",
    "netcitylife": "What about this issue and pull request? It does not satisfy you?\n. Hi, @lipis , what about merging? :). ",
    "Naituw": "Can't see any difference 😂\n. ",
    "WillXing": "is the height of the horizontal red belt....?\n. ",
    "jbialobr": "The wiki flag has 8 dark blue triangles. The 4x3 gb.svg has 4 triangles and 4 trapezes.\n. ",
    "ais-one": "looks like flag width has been shortened\n. ",
    "mrchief": "\nlooks like flag width has been shortened\n\nMore like resized (width only) and then cropped.... This project is great but the number of open issues and the velocity makes me reluctant to use it. For my current needs, I can live without SVG (and even just having 16x16 png); but it'd be great to see the issues (at least the wrong and missing flag ones resolved ASAP). \nI can pitch in a bit, my illustrator/svg skills are beginner level at best but I think that might suffice. \n(I tried doing that with Font Awesome and later found out that icon contributions were off limits, so if something like that is not an factor here, I can help).. I fiddled a bit and I see your point now... :disappointed: . Although, one could argue that this is inevitable (making square flags out of rectanglular ones) . \nIt's the same problem video editors have, trying to fit widescreen formats scale to 4:3 or other formats - they solve it using blackboxes or crops. Crops lead to data loss but is the better option here (rather than having blackboxes in this case).\nSo, not an issue then? :smile: . @mareg like @lipis said, this is probably not the right project for you. I found this: https://github.com/hjnilsson/country-flags which seems to have the flags in their native aspect ratio which might be a better fit for you. . ",
    "mareg": "Every flag has its aspect ratio defined - I would like to see all flags by default in their original aspect ratios. E.g. Switzerland's flag is 1x1, so displaying it in 4x3 is incorrect (and some may find it disrespectful).. @Findus23 but that would mean a manual work for every project - if this project is list of flags, I'd prefer all flags in their original aspect ratio - then using css it's easy to place them inside square/circle/rectangle and fit/zoom/stretch/what not - for a particular use. Or if user users mostly are looking for 1x1 and/or 4x3 ratio, then have three sizes: original, 1x1, 4x3.. ",
    "Findus23": "@mareg The issue is that nearly every single flag has a different aspect ratio which makes it hard to use them as an icon:\nhttps://en.wikipedia.org/wiki/List_of_aspect_ratios_of_national_flags\nIf you need the \"original\" flags, you don't need this project, but could instead directly use the SVGs from above Wikipedia entry.. @serhioV\nI agree with, @lipis that there is no general mapping from languages to flags. But this doesn't mean that there couldn't be a mapping for a single project (e.g. because all of your German speaking users are coming from Germany and you don't make business with Austrians)\nThis mapping is specific to your use case and therefore should be build in your program. Just write a function that takes the language you want to display and outputs the classname of the flag. . Another Idea would be creating two collections. One strict collection, which only includes flags from acknowledged states and a second one with all other types of flags.\nThis way everyone can get the flags they want for their project.. https://lipis.github.io/flag-icon-css/flags/4x3/ua.svg returns \n```svg\n\n\n\n\n\n\n``\nfor me. Have you got any browser extension which modifies the response?. Maybe open the local svg file in the node_modules folder and check if it has a duplicate`. The next step would be checking the http request in the developer tools. If you click on the request, you can see its content:\n\n. Check in \"Response\" if the duplicate </svg> is also there. If you want to you can use this icon, which we are using in piwik:\nhttps://github.com/piwik/piwik-icons/blob/master/unk.flag.svg\nThere is also an alternative (more flag-like) version: https://github.com/piwik/piwik-icons/blob/9487be120d11bc59dc5f763eb0084e0ee6cc772d/unk.flag.svg. I don’t thinks it’s a good idea to modify all colours just for one use case. Especially when they are officially specified. \nHow those colours are displayed isn’t the job of the svg file. . Just for your information:\nOnly a handful flags changed visually because of this change and we are only speaking about a few pixels that aren't visible at 64px size.\nSee https://github.com/piwik/piwik-icons/commit/d4d8bf63b7831db7258a60830cd89dd49ea9d126. If we can trust this Wikipedia list, then the only standard is that nearly every flag has a different aspect ratio\nhttps://en.wikipedia.org/wiki/List_of_aspect_ratios_of_national_flags\n2:3 seems to be pretty common, but there are even countries with irrational aspect ratios. . But when you are using non-square flags and forcing them to be square via CSS there is no other way than adding spacing at the top. \nTo have a aspect ratio of 4:3 you'll need to use a height of 63.75px.. In case you are interested, the visual differences are really minimal (left is the new one).\nAll other stayed byte-identical with a 64x48 pixel png.\npe:\n\nlv:\n\nva:\n\n. Nothing needs to be changed, without the imagemagick compare tools I wouldn't be able to see a difference.. This time nearly all files have been changed visually. \nBut I didn't see any change that I'd consider wrong.\nIf someone wants to check them:\nhttps://lw1.at/diffs/index.html. https://commons.wikimedia.org/wiki/File:Flag_of_Poland_(normative).svg\nmentions that the slightly greyish flag is the normative one.\nI think the current is correct (at least according to https://en.wikipedia.org/wiki/Flag_of_Poland#National_colors). See also #381 and #332\nIf you want to you can use this icon, which we are using in Matomo:\nhttps://github.com/piwik/piwik-icons/blob/master/unk.flag.svg\nThere is also an alternative (more flag-like) version: https://github.com/piwik/piwik-icons/blob/9487be120d11bc59dc5f763eb0084e0ee6cc772d/unk.flag.svg. But just to keep in mind using the Pantone definition results in another color:\nhttps://en.wikipedia.org/wiki/File:Flag_of_Canada_(Pantone).svg. It looks like https://commons.wikimedia.org/wiki/File:Flag_of_the_United_States.svg cropped on the right side (to fit 4x3) and with slightly different colours.. Have you seen\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/1x1/gb-sct.svg\nand \nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/gb-sct.svg\n?. @lazysergey \nI'd recommend you to setup HTTP 2.0 which makes the overhead of all those requests a bit less dramatic.\nAnd keep in mind that putting all SVGs as base64 would mean that the browser have to wait with the css rendering until 3MB css have been loaded (even more as bas64 is larger than binary).. One more thing: If the flags are shown really small (~20px) you could do something similar to what I am doing in Matomo: Convert the SVGs to optimized PNGs (with 3x resolution for high-res displays). \nAs flags compress incredibly well the files will have about 180 bytes(!) each with 64x48 px and maybe they will load and render faster in the browser.. > This doesn't have any side effects, so it's safe to be merged.\nI have to disagree. SVGs without newlines become hard to maintain if they are complex. In addition git tools like blame and diffs stop working properly if all changes happen in the same line.\nAnd while I haven't tested it, the size reduction of the gzip'ed files would be far more useful and I think it will be very close to zero because newlines compress well.. Like this one?\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/kr.svg\n(Took me a while to find out that kr is the country code of South Korea). ",
    "ctaepper": "+1\n. ",
    "federvieh": "Great, thanks for the quick fix. And the entertaining game, of course!\n. ",
    "dsmwebdesigner": "Well I saw this issue: https://github.com/lipis/flag-icon-css/issues/101\n. I just was thinking that it was useful to have separated sass task...\nBut I agree this pr is more related to the last comment of the issue than the issue itself.\n. ",
    "mxframe": "True. But do you choose country or languages for websites?\nSo it is possible to use them as language selector, too. And the countries are still working.\nBut ok. Ignore my changes if you want. Why should it be so easy to switch languages with cour flags css. ;) :P\n. ",
    "serhioV": "really, how often do you think your package is used to reference countries, rather than languages?\nGive a language its default country as fist country that matches it, and let users optionally modify that setting. Surely, languages have no flags, but your package should be flexible enough to become a popular one... . @tomlutzenberger \nDo you really think we are so stupid don't understand what there are countries having 2 or more languages, and a flag does not represent a language? \nHowever, personally I don't care about this philosophy. \nI need to find a way to associate a country's flag with a language, and if your library does not offer such a way, I will search another one, it's all.  \nYou can write me a philosophical essay on the languages and countries associations, however if my client asked me to click a picture to change a language, I don't care about what do YOU or ME personally think about that question. \nwe are here to solve practical needs, so please let me associate a UK flag to the EN language, without telling me that is not so good my idea. \n. @lipis quite sure the vast majority of library users don't have list of countries on their sites, but languages. you can go for a poll, so as long it could be the main target for users, I could ask an implementation here. \nJust do a Google Search of \"choose language\" pictures.. this is why I ask to give a developer a way to customize the language flag for a country, if the default (there should be a default) implementation does not satisfies them. \nBy ex by default is Romania flag for the Romanian language, but some people from Moldova would like to select the Moldova flag for the Ro language, however the large majority would like to have the Romania flag for Romania language and not  to develop every time the same code, every developer by its own, to re-code a language flag for your library, if not, why do bother using your library. . Humm... instead of having an explanation on why is not desirable, I also rather need a way to replace \"gb\" by \"en\", closing that doesn't solve the problem.. ",
    "mrmckeb": "I use flags as flags too. I understand the need that some people have for flag icons as languages, but I'd also suggest talking to your UX/design team about alternatives.\nAs an Australian, clicking a British flag (or a half-British half-American flag) is a learnt behaviour, but still an unintuitive one. This selection method isn't used by companies like Facebook, Google, Microsoft, etc.. This is no different than me complaining that ISO 3166-1-alpha-2 codes are no good for me as I need ISO 3166-1 alpha-3 codes.\nThe way to fix this is to create a map. This package has worked for me before, and if it's missing some information, create a PR to help them fix it. They're very receptive and their package is designed to do exactly what you want.\nhttps://www.npmjs.com/package/country-data. ",
    "peshmerge": "Can I know the exact reason of declining my request?! It will be fine if you can tell. \nThanks,\nPeshmerge \n. ",
    "pling": "It appears to be the trailing comma after the sass entry in the main array in bower.json that causes this error.\n. ",
    "benjamincanac": "245\n. ",
    "victorkristof": "Except that I use them in an interactive D3.js Sankey diagram (i.e., within an svg element), where images are sourced with an <image> tag.\n. I'm doing something like this (interactive SVG):\n\nHowever, in Firefox it it displayed like that:\n\nUnless I add the viewBox, like I did for the german flag.\nI was using these SVGs since I'm using them as CSS in other places. But you're right, maybe I should use raster images. Just thought it was easier like that :)\n. ",
    "cristianFainis": "Hi guys, I had the same problem with IE. The solution I found is very easy. Just give a width and a height to the image.\nfunction drawFloor() {\n                    svg\n                        .append(\"svg:image\")\n                        .attr(\"id\", \"image\")\n                        .attr(\"height\", \"386\")\n                        .attr(\"width\", \"1000\")\n                        .attr(\"xlink:href\", \"images/floor_1.png\");\n                }\nEasiest way to test it is to write the html code and delete width=\"1000\" height=\"386\". You`ll notice that IE will not render the image.\n. ",
    "batbayar-su": "i confirm this. Would you please fix it.\n. ",
    "sarathak": "11.0.96\n. can you open \nhttp://flag-icon-css.lip.is/\nwith ie\nthen you can see\n. ",
    "labilbe": "I can't reproduce on Win10 / IE 11.306.10586.0 and testing with multiple sizes.\n. Ok thanks!\n. ",
    "ksymeon": "All tests on Windows 10 latest update. From the tests below obviously the SVG file is correct and all browsers can display it properly. Only issue I can see is the way the github page is rendered:\n- http://flag-icon-css.lip.is/\n  - IE 11.187.14393.0: good\n  - Microsoft Edge 38.14393.0.0: good\n  - Chrome 53.0.2785.116 m (64-bit): good\n- https://github.com/lipis/flag-icon-css/blob/master/flags/4x3/af.svg\n  - IE: BAD (1)\n  - Edge: BAD (2)\n  - Chrome: good\n- SVG file downloaded and opened in the browser:\n  - IE: good\n  - Edge: good\n  - Chrome: good\n(1):\n\n(2):\n\n. ",
    "rjourde": "Thanks !\nSorry for the inconvenience. I created these issues after checking on the Github page and I didn't find these flags.\n. ",
    "felixvictor": "Just an idea ;-)\n. Sorry, @lipis, I don't understand your question.\n. ",
    "abhishekbh": "@willrax, this is pretty old, but do you want to merge this?. ",
    "amiceli": "+1 for kosovo flag. ",
    "Eldzej": "+1 for kosovo flag. ",
    "doublex": "+1. ",
    "joshlbaker": "Is this getting merged anytime soon? Would love to have it in 🙏 ❤️ . Bump. Wait, why was this closed? I don't see a PR linked with the fix. Was this just added? @lipis . ",
    "Khaagar": "@lipis Is there a chance that you will accept this PR?. ",
    "djmenkveld": "Excellent work, thanks! I'll wait for the Kosovo one.\n. ",
    "ankit007pandit": "thanks for the quick response we hardly need these flags in our project this weekend is our deadline,we appreciate if u can add those missing flag before our deadline,will be waiting for reply\n. @lipis  thanks , it's a great help from your side,  thanks for giving your time \n. ",
    "samanat": "@lipis can you please add all the flags of the municipalities of Spain ASAP? \nI need them for my project, and I need them tomorrow.. \n. ",
    "Rak-": "@tomlutzenberger here you find the attachment of sample page\n\n. @lipis  below code may help you in fixing this issue please find the below mention sample code\n@media screen and (-ms-high-contrast: active) {\n  /need to add class name with backround images over here/\n.flag-icon-ad {\n  background-image: url(../../../../images/oneprofile/flags/4x3/ad.svg);\n}\n}\n@media screen and (-ms-high-contrast: black-on-white) {\n      /need to add class name with backround images over here/\n.flag-icon-ad {\n  background-image: url(../../../../images/oneprofile/flags/4x3/ad.svg);\n}\n}\n@media screen and (-ms-high-contrast: white-on-black) {\n      /need to add class name with backround images over here/\n.flag-icon-ad {\n  background-image: url(../../../../images/oneprofile/flags/4x3/ad.svg);\n}\n}\n\nIf possible need this fix bye 27 of this month,\n. @lipis  not required issues #262.\nThanks for your time. If possible please give it on 24 of this month,\n. ",
    "Mibou": "\"Latest commit May, 23rd\", is this project still maintained?\nWould it be possible to merge please?\n. That's the reason why I've added it as an \"flag-icon-more\" flag. Just as you've added England, EU, UN, Scotland, Ireland and Wales which aren't either represented in the Olympic Games. ;)\n. ",
    "marqu3z": "Hi @lipis \nI know this was discussed about 1 year ago but i think there is more space for discussion here.\nI'm not catalan, but i lived there for more then 1 year and i know how deep is their country identity.\nThis is something not related to sport events.\nI works on a product that provides several translations. One of them is catalan and customers are complaining about flag that is not the catalan one.\nI can understand that including ALL the flags on the planet with all the minor not officially recognized states is not the goal of this project but in this case we are talking of a region with 7.5 M of people where the first officially language is Catalan.\nI would contribute, but seeing that a PR was already refused force me to monkey patch the library or doing a personal fork.\nIs there any chance this flag can be reconsidered?. ",
    "voda": "I can improve the PR. Not sure if it is better to add another boolean flag or change the variable to allow values such as both/squared/4x3. Any thoughts?\n. Ok, we managed to get a working version with not that much copy-paste. For anyone interested:\n``` less\n@import \"~flag-icon-css/less/variabless\"; // ~ is used by webpack to load file from node_modules dir\n@import \"~flag-icon-css/less/flag-icon-base\";\n.flag-icon-n(@country) {\n    .flag-icon-@{country} {\n        background-image: ~\"url(@{flag-icon-css-path}@{flag-icon-rect-path}/@{country}.svg)\";\n    };\n}\n@import \"flag-icon-list\"; // custom list with flag-icon-n(gb) calls\n```\nThis solution is good enough for use, so you can close this PR if you want.\n. ",
    "sqwk": "It looks like the Italian flag also has the same problem.\n. Fixed the formatting. Will keep the PRs to one country in the future. \n. Sure, will do tonight, after the broadcast …\n. Should I split the two flags into two seperate pull requests or can this be merged?\n. Should be good to go …\n. Yes, but those colours are not broadcast safe—they blur or even become transparent when passing them through any kind of (SDI) video mixer. As an alternative to merging them into master, I can start a parallel branch myself that includes these sort of fixes?. ",
    "a4vi2r": "Anybody home?\n. ",
    "papaonlegs": "Ping @lipis . ",
    "asleepwalker": "Country: Portugal\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/pt.svg\n. Country: Portugal\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/pt.svg\n. Country: Spain\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/es.svg\n. Country: Spain\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/es.svg\n. Country: France\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/fr.svg\n. ",
    "zeecho": "FYI, the new code for Corsica is FR-COR (https://en.wikipedia.org/wiki/ISO_3166-2:FR#Regions_(since_January_1st,_2016)). ",
    "MA-Maddin": "seems like all flags are missing the viewBox at the moment.. ",
    "vchumakov": "@tomlutzenberger you can check on http://beautifytools.com/scss-compiler.php \nwith\n$a: '/my.png';\nbody{\n    background: url(\"#{$a}\");\n}\n. ",
    "2009": "Done. =)\n. Sorry this has taken me a while, I've updated the 1x1 flag so the blue portion only takes up a quarter of the area.. @Findus23 Thanks for the first link I didn't see this one.\nI did look at the official colors and noticed they did include the slight grey color, it looks like it is an issue they are trying to get an official answer for:\n\nContinuing efforts are being made to better approximate for universal computer display the official white and red of the Polish flag, as well as to obtain a ruling from the Polish government on the matter of displaying the flag as a luminous computer image. Accordingly, this flag depiction will be updated as future developments warrant.\n\nI think the choice of either using #e9e8e7 or #ffffff really depends on the goal of this project. If the goal is to provide the most legally accurate version of flags use #e9e8e7, and if the goal is to provide flags that are more usable use #ffffff.\nI feel like we should use #ffffff as a user would expect to see white, even on light backgrounds.\nFrom the first link it looks like they put it to a vote for their usage and decided on using #ffffff for symbolic representations.\nWhat are your thoughts?. I've update the blue part to be a quarter of the area, I've been trying to match the flags as close to the original and not look too awkward. Are there any general guidlines for adjusting flags into 4:3 and 1:1 ratios?. ",
    "gabelloyd": "There is a flag for Scotland, resolved with Issue #252 . I used it on my last project with gb-sct. Not sure about specific flags for England and Wales.\n. Try GB-SCT. \n. +1. Use GB-SCT for Scotland.\nOn Mon, Aug 7, 2017 at 9:53 AM Treveshan Naidoo notifications@github.com\nwrote:\n\nHi\nWill there be any additions for Scotland ?\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/lipis/flag-icon-css/issues/383, or mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AB7_TmPpvgws0Ft8Y40Uwdjr3lHSdAXVks5sVxa9gaJpZM4Ovd5f\n.\n-- \n\nGabe LloydUS +1 401-954-5650\nEvent Websites, Marketing, and Production\nlongtailcreative.com // TWITTER https://twitter.com/longtailcre8ive //\nFACEBOOK https://www.facebook.com/longtailcre8ive\n. ",
    "robhurd86": "Ah silly me, I didn't notice the sub GB options. Thank you.\n. ",
    "Leo4815162342": "Found it, sorry ;)\n. ",
    "Designer023": "Yeah that makes sense.\n. ",
    "Chklang": "The index.js is only to specify files to import on the application. So it's not a JS file used for execution but only for compilation. After i don't know if it's possible to import only css, i've seen the project bootstrap-css to understand it : https://github.com/StevenIseki/bootstrap-css/blob/master/index.js .\n. ",
    "ilhansubasi": "...in your web site.\n. Around 10% of Kazakhstan is located in Europe. http://kazakhworld.com/kazakhstans-biggest-question-europe-or-asia/\nInterestingly something like 15% of population of Turkey is in Europe. And heart quarters of biggest Turkish companies are mostly (like more than half of them) are located in European side of Istanbul. And almost all national TV channels are located in European side too. Likewise rich people prefer to live in European side. I would like to say that half of the mind power is in European side. Just sayin, not to argue. I mean, on what should be based on; land area (then once UK was not a European) or population, may be capital city. Nevermind.\n. @HLFH \nSo you mean that if someone moves to French Guiana, which is in South America, he should look in the list of Europe? Because it is part of EU.\nAnd if you move to Lichtenstein you should not look at the list of Europe?\nAsia is a continent, Africa is a continent, South America is a continent, North America is a continent, and Europe is a continent. European Union is not a continent.\nWhat does UE mean?\nLichtenstein is not part of UE => Asia?. ",
    "HLFH": "@lipis\nThe European Union is a Politico-economic association and has the purpose to be a federal republic in the next decade.\nGreece is part of the UE => Europe\nTurkey is not part of the UE => Asia\nRussia is not part of the UE => Asia\nKazakhstan is not part of the UE => Asia\nCyprus is part of the UE => Europe\nCould we close this issue? . If we conqueer Turkey, it will be part of Europe. We lost it in 1453. We have to take it back to make @ilhanyumer happy.. ",
    "ddinchev": "@ilhanyumer by any sources I could find Cyprus is being considered to be in Europe, I don't know what role their EU membership plays. In all honesty - tectonically Asia and Europe stay on the same plates and the separation is entirely product of how people have drawn lines at some point in history. IMHO, Turkey should be listed under both Europe and Asia, to help people find it easier. And this issue should be closed before it gets into a bigger argument.. ",
    "trancee": "When will this be merged into master?. ",
    "cnsgithub": "The Bolivia flag still has the error (same xlink) but the Fiji flag passed.\n. probably  tags completely. Didn't see a difference on the flag itself.\n. Suggestion (adapted from wikipedia to match 4:3)\nhttps://de.wikipedia.org/wiki/Flagge_Bahrains#/media/File:Flag_of_Bahrain.svg\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<svg xmlns=\"http://www.w3.org/2000/svg\" width=\"640\" height=\"480\" viewBox=\"0 0 110 90\">\n<path d=\"M0,0H150V90H0\" fill=\"#fff\"/>\n<path fill=\"#ce1126\" d=\"M150,0 37,0l23,9 -23,9 23,9 -23,9 23,9 -23,9 23,9 -23,9 23,9 -23,9H150\"/>\n</svg>\n. ",
    "hulufei": "@lipis Can you publish 2.6.0 to npm please, seems the issue solved, but npm package haven't update, thx\n. ",
    "GrimLink": "Apology is seem it is included but not part of the documentation on http://flag-icon-css.lip.is/\nClosing Issue\n. ",
    "eveyrat": "Sorry\n. ",
    "sercinci": "As not all projects use Less or Sass I've found this the right solution. Never mind for the merge ;)\n. ",
    "ThePJMP": "Nice, thanks for your quick response. I didn't noticed that it was already included.\n. ",
    "sandstrom": "This would be great. Trimming the largest ~10 flags would drastically reduce the total file size. I guess a vector tool can be used to manually shrink them, or perhaps some tracing functionality to automatically simplify (though this may not work that well).. @lipis Awesome! ⛵️ \nYou probably already know about these things. But just in case, I'd try the following two things:\n\nSimplifying paths (probably the biggest wins here, basically make the flags with over-complicated things 'dumber' / simpler.\nSimplify the SVG-file output.\n\nSome links:\n\nhttp://graphicdesign.stackexchange.com/questions/47145/how-to-reduce-the-number-of-nodes-in-a-traced-map-using-inkscape\nhttp://vectorboom.com/load/tips/techniques/some_ways_to_simplify_path_or_reduce_extra_points_in_illustrator/16-1-0-452\nhttp://stackoverflow.com/questions/7068425/minimizing-svg-file-size. Using civil flags is a great suggestion! Set a threshold and use the civil version (where available) for all flags above the threshold size: https://en.wikipedia.org/wiki/State_flag. @maxlibin Awesome! Seems like overall size for the 4x3 directory is ~4 MB -> ~2 MB, so roughly half. The largest flag is down to 74 kb from 467 kb.\n\n@lipis Is this anything you are willing to consider for this repo?. @lipis I think that's what this PR did: https://github.com/lipis/flag-icon-css/pull/393. Great! 😄 \nI still think some flags could be shrunk further. It's just a handful of flags that make up ~95% of the total file size. But for them, simplification of the vector may be beyond an automated tool (or atleast we'd have to use another, automated tool).\nBut anyway, this is still a nice improvement! 🏆 . Great, but instead of keeping them in a separate optimized directory, wouldn't it make more sense to replace the old flags with new optimized ones?. ",
    "anho": "@lipis another possibility would be to provide the civil flags instead of the national ones for the countries with more complex shapes (as additional set or whatever). A very good example is the spanish flag.. ",
    "TunaFish2": "SVGo. ",
    "generator85": "I agree, it's a good idea. But I think it's better to be consistent and use the civil version for all flags.. ",
    "maxlibin": "I have replaced large svg with civil version, checkout here. @slany \n[\n  {\"label\": \"Afghanistan\", \"value\": \"af\"},\n  {\"label\": \"Åland Islands\", \"value\": \"ax\"},\n  {\"label\": \"Albania\", \"value\": \"al\"},\n  {\"label\": \"Algeria\", \"value\": \"dz\"},\n  {\"label\": \"American Samoa\", \"value\": \"as\"},\n  {\"label\": \"AndorrA\", \"value\": \"ad\"},\n  {\"label\": \"Angola\", \"value\": \"ao\"},\n  {\"label\": \"Anguilla\", \"value\": \"ai\"},\n  {\"label\": \"Antarctica\", \"value\": \"aq\"},\n  {\"label\": \"Antigua and Barbuda\", \"value\": \"ag\"},\n  {\"label\": \"Argentina\", \"value\": \"ar\"},\n  {\"label\": \"Armenia\", \"value\": \"am\"},\n  {\"label\": \"Aruba\", \"value\": \"aw\"},\n  {\"label\": \"Australia\", \"value\": \"au\"},\n  {\"label\": \"Austria\", \"value\": \"at\"},\n  {\"label\": \"Azerbaijan\", \"value\": \"az\"},\n  {\"label\": \"Bahamas\", \"value\": \"bs\"},\n  {\"label\": \"Bahrain\", \"value\": \"bh\"},\n  {\"label\": \"Bangladesh\", \"value\": \"bd\"},\n  {\"label\": \"Barbados\", \"value\": \"bb\"},\n  {\"label\": \"Belarus\", \"value\": \"by\"},\n  {\"label\": \"Belgium\", \"value\": \"be\"},\n  {\"label\": \"Belize\", \"value\": \"bz\"},\n  {\"label\": \"Benin\", \"value\": \"bj\"},\n  {\"label\": \"Bermuda\", \"value\": \"bm\"},\n  {\"label\": \"Bhutan\", \"value\": \"bt\"},\n  {\"label\": \"Bolivia\", \"value\": \"bo\"},\n  {\"label\": \"Bosnia and Herzegovina\", \"value\": \"ba\"},\n  {\"label\": \"Botswana\", \"value\": \"bw\"},\n  {\"label\": \"Bouvet Island\", \"value\": \"bv\"},\n  {\"label\": \"Brazil\", \"value\": \"br\"},\n  {\"label\": \"British Indian Ocean Territory\", \"value\": \"io\"},\n  {\"label\": \"Brunei Darussalam\", \"value\": \"bn\"},\n  {\"label\": \"Bulgaria\", \"value\": \"bg\"},\n  {\"label\": \"Burkina Faso\", \"value\": \"bf\"},\n  {\"label\": \"Burundi\", \"value\": \"bi\"},\n  {\"label\": \"Cambodia\", \"value\": \"kh\"},\n  {\"label\": \"Cameroon\", \"value\": \"cm\"},\n  {\"label\": \"Canada\", \"value\": \"ca\"},\n  {\"label\": \"Cape Verde\", \"value\": \"cv\"},\n  {\"label\": \"Cayman Islands\", \"value\": \"ky\"},\n  {\"label\": \"Central African Republic\", \"value\": \"cf\"},\n  {\"label\": \"Chad\", \"value\": \"td\"},\n  {\"label\": \"Chile\", \"value\": \"cl\"},\n  {\"label\": \"China\", \"value\": \"cn\"},\n  {\"label\": \"Christmas Island\", \"value\": \"cx\"},\n  {\"label\": \"Cocos (Keeling) Islands\", \"value\": \"cc\"},\n  {\"label\": \"Colombia\", \"value\": \"co\"},\n  {\"label\": \"Comoros\", \"value\": \"km\"},\n  {\"label\": \"Congo\", \"value\": \"cg\"},\n  {\"label\": \"Congo, The Democratic Republic of the\", \"value\": \"cd\"},\n  {\"label\": \"Cook Islands\", \"value\": \"ck\"},\n  {\"label\": \"Costa Rica\", \"value\": \"cr\"},\n  {\"label\": \"Cote D'Ivoire\", \"value\": \"ci\"},\n  {\"label\": \"Croatia\", \"value\": \"hr\"},\n  {\"label\": \"Cuba\", \"value\": \"cu\"},\n  {\"label\": \"Cyprus\", \"value\": \"cy\"},\n  {\"label\": \"Czech Republic\", \"value\": \"cz\"},\n  {\"label\": \"Denmark\", \"value\": \"dk\"},\n  {\"label\": \"Djibouti\", \"value\": \"dj\"},\n  {\"label\": \"Dominica\", \"value\": \"dm\"},\n  {\"label\": \"Dominican Republic\", \"value\": \"do\"},\n  {\"label\": \"Ecuador\", \"value\": \"ec\"},\n  {\"label\": \"Egypt\", \"value\": \"eg\"},\n  {\"label\": \"El Salvador\", \"value\": \"sv\"},\n  {\"label\": \"Equatorial Guinea\", \"value\": \"gq\"},\n  {\"label\": \"Eritrea\", \"value\": \"er\"},\n  {\"label\": \"Estonia\", \"value\": \"ee\"},\n  {\"label\": \"Ethiopia\", \"value\": \"et\"},\n  {\"label\": \"Falkland Islands (Malvinas)\", \"value\": \"fk\"},\n  {\"label\": \"Faroe Islands\", \"value\": \"fo\"},\n  {\"label\": \"Fiji\", \"value\": \"fj\"},\n  {\"label\": \"Finland\", \"value\": \"fi\"},\n  {\"label\": \"France\", \"value\": \"fr\"},\n  {\"label\": \"French Guiana\", \"value\": \"gf\"},\n  {\"label\": \"French Polynesia\", \"value\": \"pf\"},\n  {\"label\": \"French Southern Territories\", \"value\": \"tf\"},\n  {\"label\": \"Gabon\", \"value\": \"ga\"},\n  {\"label\": \"Gambia\", \"value\": \"gm\"},\n  {\"label\": \"Georgia\", \"value\": \"ge\"},\n  {\"label\": \"Germany\", \"value\": \"de\"},\n  {\"label\": \"Ghana\", \"value\": \"gh\"},\n  {\"label\": \"Gibraltar\", \"value\": \"gi\"},\n  {\"label\": \"Greece\", \"value\": \"gr\"},\n  {\"label\": \"Greenland\", \"value\": \"gl\"},\n  {\"label\": \"Grenada\", \"value\": \"gd\"},\n  {\"label\": \"Guadeloupe\", \"value\": \"gp\"},\n  {\"label\": \"Guam\", \"value\": \"gu\"},\n  {\"label\": \"Guatemala\", \"value\": \"gt\"},\n  {\"label\": \"Guernsey\", \"value\": \"gg\"},\n  {\"label\": \"Guinea\", \"value\": \"gn\"},\n  {\"label\": \"Guinea-Bissau\", \"value\": \"gw\"},\n  {\"label\": \"Guyana\", \"value\": \"gy\"},\n  {\"label\": \"Haiti\", \"value\": \"ht\"},\n  {\"label\": \"Heard Island and Mcdonald Islands\", \"value\": \"hm\"},\n  {\"label\": \"Holy See (Vatican City State)\", \"value\": \"va\"},\n  {\"label\": \"Honduras\", \"value\": \"hn\"},\n  {\"label\": \"Hong Kong\", \"value\": \"hk\"},\n  {\"label\": \"Hungary\", \"value\": \"hu\"},\n  {\"label\": \"Iceland\", \"value\": \"is\"},\n  {\"label\": \"India\", \"value\": \"in\"},\n  {\"label\": \"Indonesia\", \"value\": \"id\"},\n  {\"label\": \"Iran, Islamic Republic Of\", \"value\": \"ir\"},\n  {\"label\": \"Iraq\", \"value\": \"iq\"},\n  {\"label\": \"Ireland\", \"value\": \"ie\"},\n  {\"label\": \"Isle of Man\", \"value\": \"im\"},\n  {\"label\": \"Israel\", \"value\": \"il\"},\n  {\"label\": \"Italy\", \"value\": \"it\"},\n  {\"label\": \"Jamaica\", \"value\": \"jm\"},\n  {\"label\": \"Japan\", \"value\": \"jp\"},\n  {\"label\": \"Jersey\", \"value\": \"je\"},\n  {\"label\": \"Jordan\", \"value\": \"jo\"},\n  {\"label\": \"Kazakhstan\", \"value\": \"kz\"},\n  {\"label\": \"Kenya\", \"value\": \"ke\"},\n  {\"label\": \"Kiribati\", \"value\": \"ki\"},\n  {\"label\": \"Korea, Democratic People'S Republic of\", \"value\": \"kp\"},\n  {\"label\": \"Korea, Republic of\", \"value\": \"kr\"},\n  {\"label\": \"Kuwait\", \"value\": \"kw\"},\n  {\"label\": \"Kyrgyzstan\", \"value\": \"kg\"},\n  {\"label\": \"Lao People'S Democratic Republic\", \"value\": \"la\"},\n  {\"label\": \"Latvia\", \"value\": \"lv\"},\n  {\"label\": \"Lebanon\", \"value\": \"lb\"},\n  {\"label\": \"Lesotho\", \"value\": \"ls\"},\n  {\"label\": \"Liberia\", \"value\": \"lr\"},\n  {\"label\": \"Libyan Arab Jamahiriya\", \"value\": \"ly\"},\n  {\"label\": \"Liechtenstein\", \"value\": \"li\"},\n  {\"label\": \"Lithuania\", \"value\": \"lt\"},\n  {\"label\": \"Luxembourg\", \"value\": \"lu\"},\n  {\"label\": \"Macao\", \"value\": \"mo\"},\n  {\"label\": \"Macedonia, The Former Yugoslav Republic of\", \"value\": \"mk\"},\n  {\"label\": \"Madagascar\", \"value\": \"mg\"},\n  {\"label\": \"Malawi\", \"value\": \"mw\"},\n  {\"label\": \"Malaysia\", \"value\": \"my\"},\n  {\"label\": \"Maldives\", \"value\": \"mv\"},\n  {\"label\": \"Mali\", \"value\": \"ml\"},\n  {\"label\": \"Malta\", \"value\": \"mt\"},\n  {\"label\": \"Marshall Islands\", \"value\": \"mh\"},\n  {\"label\": \"Martinique\", \"value\": \"mq\"},\n  {\"label\": \"Mauritania\", \"value\": \"mr\"},\n  {\"label\": \"Mauritius\", \"value\": \"mu\"},\n  {\"label\": \"Mayotte\", \"value\": \"yt\"},\n  {\"label\": \"Mexico\", \"value\": \"mx\"},\n  {\"label\": \"Micronesia, Federated States of\", \"value\": \"fm\"},\n  {\"label\": \"Moldova, Republic of\", \"value\": \"md\"},\n  {\"label\": \"Monaco\", \"value\": \"mc\"},\n  {\"label\": \"Mongolia\", \"value\": \"mn\"},\n  {\"label\": \"Montserrat\", \"value\": \"ms\"},\n  {\"label\": \"Morocco\", \"value\": \"ma\"},\n  {\"label\": \"Mozambique\", \"value\": \"mz\"},\n  {\"label\": \"Myanmar\", \"value\": \"mm\"},\n  {\"label\": \"Namibia\", \"value\": \"na\"},\n  {\"label\": \"Nauru\", \"value\": \"nr\"},\n  {\"label\": \"Nepal\", \"value\": \"np\"},\n  {\"label\": \"Netherlands\", \"value\": \"nl\"},\n  {\"label\": \"Netherlands Antilles\", \"value\": \"an\"},\n  {\"label\": \"New Caledonia\", \"value\": \"nc\"},\n  {\"label\": \"New Zealand\", \"value\": \"nz\"},\n  {\"label\": \"Nicaragua\", \"value\": \"ni\"},\n  {\"label\": \"Niger\", \"value\": \"ne\"},\n  {\"label\": \"Nigeria\", \"value\": \"ng\"},\n  {\"label\": \"Niue\", \"value\": \"nu\"},\n  {\"label\": \"Norfolk Island\", \"value\": \"nf\"},\n  {\"label\": \"Northern Mariana Islands\", \"value\": \"mp\"},\n  {\"label\": \"Norway\", \"value\": \"no\"},\n  {\"label\": \"Oman\", \"value\": \"om\"},\n  {\"label\": \"Pakistan\", \"value\": \"pk\"},\n  {\"label\": \"Palau\", \"value\": \"pw\"},\n  {\"label\": \"Palestinian Territory, Occupied\", \"value\": \"ps\"},\n  {\"label\": \"Panama\", \"value\": \"pa\"},\n  {\"label\": \"Papua New Guinea\", \"value\": \"pg\"},\n  {\"label\": \"Paraguay\", \"value\": \"py\"},\n  {\"label\": \"Peru\", \"value\": \"pe\"},\n  {\"label\": \"Philippines\", \"value\": \"ph\"},\n  {\"label\": \"Pitcairn\", \"value\": \"pn\"},\n  {\"label\": \"Poland\", \"value\": \"pl\"},\n  {\"label\": \"Portugal\", \"value\": \"pt\"},\n  {\"label\": \"Puerto Rico\", \"value\": \"pr\"},\n  {\"label\": \"Qatar\", \"value\": \"qa\"},\n  {\"label\": \"Reunion\", \"value\": \"re\"},\n  {\"label\": \"Romania\", \"value\": \"ro\"},\n  {\"label\": \"Russian Federation\", \"value\": \"ru\"},\n  {\"label\": \"Rwanda\", \"value\": \"rw\"},\n  {\"label\": \"Saint Helena\", \"value\": \"sh\"},\n  {\"label\": \"Saint Kitts and Nevis\", \"value\": \"kn\"},\n  {\"label\": \"Saint Lucia\", \"value\": \"lc\"},\n  {\"label\": \"Saint Pierre and Miquelon\", \"value\": \"pm\"},\n  {\"label\": \"Saint Vincent and the Grenadines\", \"value\": \"vc\"},\n  {\"label\": \"Samoa\", \"value\": \"ws\"},\n  {\"label\": \"San Marino\", \"value\": \"sm\"},\n  {\"label\": \"Sao Tome and Principe\", \"value\": \"st\"},\n  {\"label\": \"Saudi Arabia\", \"value\": \"sa\"},\n  {\"label\": \"Senegal\", \"value\": \"sn\"},\n  {\"label\": \"Serbia and Montenegro\", \"value\": \"cs\"},\n  {\"label\": \"Seychelles\", \"value\": \"sc\"},\n  {\"label\": \"Sierra Leone\", \"value\": \"sl\"},\n  {\"label\": \"Singapore\", \"value\": \"sg\"},\n  {\"label\": \"Slovakia\", \"value\": \"sk\"},\n  {\"label\": \"Slovenia\", \"value\": \"si\"},\n  {\"label\": \"Solomon Islands\", \"value\": \"sb\"},\n  {\"label\": \"Somalia\", \"value\": \"so\"},\n  {\"label\": \"South Africa\", \"value\": \"za\"},\n  {\"label\": \"South Georgia and the South Sandwich Islands\", \"value\": \"gs\"},\n  {\"label\": \"Spain\", \"value\": \"es\"},\n  {\"label\": \"Sri Lanka\", \"value\": \"lk\"},\n  {\"label\": \"Sudan\", \"value\": \"sd\"},\n  {\"label\": \"Suriname\", \"value\": \"sr\"},\n  {\"label\": \"Svalbard and Jan Mayen\", \"value\": \"sj\"},\n  {\"label\": \"Swaziland\", \"value\": \"sz\"},\n  {\"label\": \"Sweden\", \"value\": \"se\"},\n  {\"label\": \"Switzerland\", \"value\": \"ch\"},\n  {\"label\": \"Syrian Arab Republic\", \"value\": \"sy\"},\n  {\"label\": \"Taiwan, Province of China\", \"value\": \"tw\"},\n  {\"label\": \"Tajikistan\", \"value\": \"tj\"},\n  {\"label\": \"Tanzania, United Republic of\", \"value\": \"tz\"},\n  {\"label\": \"Thailand\", \"value\": \"th\"},\n  {\"label\": \"Timor-Leste\", \"value\": \"tl\"},\n  {\"label\": \"Togo\", \"value\": \"tg\"},\n  {\"label\": \"Tokelau\", \"value\": \"tk\"},\n  {\"label\": \"Tonga\", \"value\": \"to\"},\n  {\"label\": \"Trinidad and Tobago\", \"value\": \"tt\"},\n  {\"label\": \"Tunisia\", \"value\": \"tn\"},\n  {\"label\": \"Turkey\", \"value\": \"tr\"},\n  {\"label\": \"Turkmenistan\", \"value\": \"tm\"},\n  {\"label\": \"Turks and Caicos Islands\", \"value\": \"tc\"},\n  {\"label\": \"Tuvalu\", \"value\": \"tv\"},\n  {\"label\": \"Uganda\", \"value\": \"ug\"},\n  {\"label\": \"Ukraine\", \"value\": \"ua\"},\n  {\"label\": \"United Arab Emirates\", \"value\": \"ae\"},\n  {\"label\": \"United Kingdom\", \"value\": \"gb\"},\n  {\"label\": \"United States\", \"value\": \"us\"},\n  {\"label\": \"United States Minor Outlying Islands\", \"value\": \"um\"},\n  {\"label\": \"Uruguay\", \"value\": \"uy\"},\n  {\"label\": \"Uzbekistan\", \"value\": \"uz\"},\n  {\"label\": \"Vanuatu\", \"value\": \"vu\"},\n  {\"label\": \"Venezuela\", \"value\": \"ve\"},\n  {\"label\": \"Viet Nam\", \"value\": \"vn\"},\n  {\"label\": \"Virgin Islands, British\", \"value\": \"vg\"},\n  {\"label\": \"Virgin Islands, U.S.\", \"value\": \"vi\"},\n  {\"label\": \"Wallis and Futuna\", \"value\": \"wf\"},\n  {\"label\": \"Western Sahara\", \"value\": \"eh\"},\n  {\"label\": \"Yemen\", \"value\": \"ye\"},\n  {\"label\": \"Zambia\", \"value\": \"zm\"},\n  {\"label\": \"Zimbabwe\", \"value\": \"zw\"}\n]. ",
    "Clement-TS": "Also the file size can be checked online: https://jakearchibald.github.io/svgomg/\nOr dynamically via a tool provided within your package: https://github.com/svg/svgo\nI'm also interested in lowering the size of flag-icon-css, it nearly doubles my application size.. ",
    "ritcheyer": "@Clement-TS I just submitted a PR that uses svgo to minify the flag icons to 1 precision point. see here: https://github.com/lipis/flag-icon-css/pull/393. @maxlibin PRed to you too! \nhttps://github.com/maxlibin/lite-flag-icon-css/pull/1 \n😄 . @scottkellum are there any tools that can help us to clean up these icons? I'm looking to use this project in production at work and I cannot justify a 456kb svg (4x3 do.svg really is this big) 😬 Even the largest optimized flag in @maxlibin's repo being 41kb is still pretty large for production usage... is there anything in our disposal to optimize these further, like you're suggesting, without compromising the quality or the design on the flag(s)?\nIf no suitable SVG source file exists, would it be just a manual process of opening each flag in Illustrator or some such to clean up the points? (this sounds incredibly tedious and unfun, btw). Maybe there should be a separate folder/naming convention for historical flags?\n\nThanks,\n-e\n\nOn Oct 8, 2017, at 5:13 PM, bitedge notifications@github.com wrote:\nThe flag of the former soviet union does exist and is useful in manny contexts. In the case of my site we list historical sporting results with a flag for each country. The former soviet union is included and so to needs to be its flag.\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n. @lipis if you would like me to move the icons I can do this, just lmk. 👍🏻\n\n\nThanks,\n-e\n\nOn Oct 8, 2017, at 4:08 PM, Lipis notifications@github.com wrote:\nClosed #393.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n. This does not seem like a very good idea\n\n\nThanks,\n-e\n\nOn Nov 7, 2017, at 5:11 AM, Jimmy Merrild Krag notifications@github.com wrote:\nSure! Why not?\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n. \n",
    "scottkellum": "The point structure here looks like it’s unsuitable for production use. It could be that in expanding a stroke a design program added a huge number of extra points that are unnecessary. Vector art should have one point per every 90° turn in the path on a curve. Occluded points don’t need to be curved. Simply by having a clean source file you can probably cut 90% of the file size and on paths this bad adjusting precision might even make things worse because the points are so close together the paths are prone to become lumpy as they are placed on a more coarse grid but test this last point instead of taking my word for it as you want precision as coarse as possible without visual regression.\nIf you can find cleaner source files of flags like these you’ll find significantly smaller file sizes. As a designer this looks like a bad source SVG and I wouldn’t want to send it into production looking like that no matter how good the SVG optimization engine is.. @ritcheyer There is only so much you can do with a tool and the tools listed above in the thread are fantastic. Think of this like a book with a lot of repeated stuff, you could have a computer try to parse it down but what you clip out and the order in which you clip it out might change the meaning so this task is very hard for a computer to do well. Illustrator has a simplify path tool but because Illustrator doesn’t understand why points are in some places I haven’t had good luck with it or any similar tool.. ",
    "Askamedia": "Thanks a lot\n. ",
    "matteocng": "Great, thanks! Any chance that JSON could be included in this repository, so that one could for instance:\njs\nvar countries = require('flag-icon-css/countries.json');\n...\n. ",
    "bogomips": "Hello, I find these missing too, why has this issue been closed?. ",
    "pedroct92": "Hi, firstly I would like to say that you have done an amazing job. Secondly, I know you have closed already the issue but would it be possible to add this flag? We could add it was fr-ca. In some applications we identify the dialect of French from Canada with this flag. \nAny thoughts? \nhttps://commons.wikimedia.org/wiki/File:Flag_of_Quebec.svg. ",
    "chillinski": "+1\nWould be nice to have something like this. I use the flags to visualize the communication in a network, where countries are linked with IPs using a GeoIP database. Private Network IPs and Broadcast-IPs are unknown and in my case marked with a pseudo-country code. (Private IPs = \"00\", Unknown = \"??\"). ",
    "michaelthuren": "+1 :). I would appreciate this as well, i'm using this repository for almost all projects with international setup. The only thing i'm missing every time is a global and unknown flag\nPotential flag of earth suggestions\nhttps://en.wikipedia.org/wiki/Flag_of_Earth\nPotential unknown flag is mentioned here #332. ",
    "seandcoleman": "That and/or show the 3 character country code? +1. Or if unavailable, Just the capitalized 3 character country code [ADP]?. ",
    "didididi2": "it's iso code is no more (AN) it's BQ now\nhttps://en.wikipedia.org/wiki/ISO_3166-2:AN. ",
    "dmersiowsky": "Here you go :). Thanks for merging! No worries, I have seen pull requests taking waaay longer ;-). ",
    "Nuc1eoN": "damn :/. Why?. ",
    "amarkasapovic": "Changed the layout for Bosnian flag to correspond to the real one.. Done. Sorry about delay.. ",
    "jurajkrivda": "Chechnya is a country?. ",
    "egyptianbman": "Welp, that's quite disappointing.. ",
    "ilmam": "Would be a great feature if available. Not sure why not supported since it's similar case to EU or UN. . ",
    "brakerb": "Chrome Browser, don't know version. I will check it again when I got some time.\nIt worked after I opened the flag in inkscape and saved it again.. ",
    "sustained": "I like @Findus23's idea.. @tomlutzenberger I'd like to add some non-official (ISO) flags, if you'd accept them, otherwise I guess I'll just maintain a fork for my project-specific flags.\nCan you perhaps ping me when this separate project is done?. Why would you not want to include some flags? Seems ridiculous.\nShould rename this project to \"only-some-flags-icon-css\" in that case.. Oh, right, of course, I thought that would be obvious to people.\nI was under the impression that only a subset of ISO flags were being included, or something. :tongue: . ",
    "acookrojas": "ok, thanks!. ",
    "reustle": "I was going to make a PR adding this, but I can't find the docs in this repo 🤔 The index.html file in the repo isn't the same, and the gh-pages branch isn't much different (and is pretty old). lipis also redirects the github.io domain to his personal domain, but the pages seem the same (probably a url alias).. ",
    "sshyran": "ok, probably this is only 14.04 rendering isuue. ",
    "stevensacks": "For example, we have an international site and we have drop down where people choose what country they're from. We don't have EVERY country, but we have over 100. That's a lot of requests for each user to make to load the page. We like your flags, but we can't use them unless there's a sheet.\nAs far as Serbia goes, is that the raw size or gzipped?. ",
    "Granitosaurus": "\nEU is a known reserved ISO 3166 code. CIS on the other hand isn't even a two-letter code.\n\nYour point being? That's it's not a flag? Does inclusions of an union flag depend on ISO code registry?. Seems unnecessarily limiting but sure, I can add one svg file to my own fork.. ",
    "rhamses": "There was a issue a while back about this flag. I hope it'll be merged to the master branch but I doubt that, unfortunately. . ",
    "gerardreches": "As it has its own language (catalan), it should be included to use it in language selectors.. ",
    "markitosgv": "Then you may have to include:\n\nhttps://commons.wikimedia.org/wiki/File:Flag_of_Galicia.svg\nhttps://es.wikipedia.org/wiki/Archivo:Flag_of_the_Basque_Country.svg. +1\n\n361 issue was solved including catalonia flag.",
    "d0whc3r": "Fixes #361. The svg files have the same height than other images\nheight=\"480\" width=\"640\" for 4x3 \nand width=\"512\" height=\"512\" for 1x1. What about the content? I don't know what do you mean. ",
    "RKushnir": "@d0whc3r Yellow stripes are broader than red stripes.. ",
    "russellhoff": "Has it been definitely added?. Please, would you accept my PR?. Can I solve this?. ",
    "geeksareforlife": "Wasn't this disolved in 2010 into CW, SX and BQ?\nAlso, same issue as #334. ",
    "arcanedev-maroc": "Beerware License 🍺. ",
    "inoas": "Ref: https://github.com/lipis/flag-icon-css/issues/364#issuecomment-299874319. Well the habit for many is just to scroll to the bottom of the README to find the license. Anyway feel free to close if you consider it not worth it.. Don't worry. All good :). ",
    "stijnvanouplines": "In an application I use the ISO 639-1 codes to manage translations. To get the correct flag I changed the name of the file.. No, not at the moment :). ",
    "anantaramdas": "Yes I can see that... however following source code is delivered by above link:\n```\n\n\n\n\n\n\n\n```\nbasicly for all flags delivered smth different. For instance for /fonts/ga.svg?3bccb26524d04e3abb3dc4fa8b5047df\n<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"480\" width=\"640\" viewBox=\"0 0 640 480\">\n  <g fill-rule=\"evenodd\">\n    <path fill=\"#ffe700\" d=\"M640 480H0V0h640z\"/>\n    <path fill=\"#36a100\" d=\"M640 160.003H0V0h640z\"/>\n    <path fill=\"#006dbc\" d=\"M640 480H0V319.997h640z\"/>\n  </g>\n</svg>\n1.33h512.004z\"/>\n  </g>\n</svg>. BTW /fonts/gb.svg?fd72d9b5184b47afb2f7b4db0c8a35de is working perfectly fine... I'm bit confused.\nI cleaned and republished node_modules but it did not helped. @Findus23 on GitHub it working fine... Im not able to get it into my code fully :(\nThus any help is really appreciated. Double checked - local files are fine.... Thanks for support. However followng are dev tools both Chrome and Firefox:\n\n. Could you tell me what should I look for? Thanks!. @lipis could you help me understand how route like /font/*svg is working? \n@Findus23 yes it contains that is weird :(. SOrry if it was misunderstanding.\nAs you can see on my screenshot I sent hour ago it is not displayed for UA and RU but showed for GB. SO answer is Yes and No. I'm using it like this:\n<span class=\"flag-icon flag-icon-ru\"></span>\nAfter I got following style class \n.flag-icon-ru {\n    background-image: url(/fonts/ru.svg?073f6ef795fdf4440534d05fa592f2d0);\n}\nIf I go to that link I will receive:\n<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"480\" width=\"640\" viewBox=\"0 0 640 480\">\n  <g fill-rule=\"evenodd\" stroke-width=\"1pt\">\n    <path fill=\"#fff\" d=\"M0 0h640v480H0z\"/>\n    <path fill=\"#0039a6\" d=\"M0 160.003h640V480H0z\"/>\n    <path fill=\"#d52b1e\" d=\"M0 319.997h640V480H0z\"/>\n  </g>\n</svg>\n</g>\n</svg>\n. @lipis could you point me out where I'm doing mistake. Thank you!. Pity.. anyway thanks for your time. No of cource not... I just said thank you for your time. \nYoure right npm is adding this during compilation. But I'm not sure why and how to fix it.. ",
    "The-Outrider": "Hey Love your work here @lipis thanks for making this package.\nI think I have the solution for @anantaramdas here. \nWhen using laravel-mix for compiling the sass and js files, if you use the sass version. \n@import './components/flags/flag-icon.scss';\nThis will add that terrible extra few lines on the end, something wrong with how the default laravel-mix configuration is perhaps.\nHowever if you follow -> https://github.com/lipis/flag-icon-css/issues/428\nAnd add it to the app.js file after an npm install import 'flag-icon-css/css/flag-icon.css'\nEverything should compile like normal, and you can add the flags as per the README.MD\nHope that helps!\n. @lipis I believe this is an issue in the laravel-mix package, and no code changes need to be made here. 👍 \n. ",
    "jgrandar": "I also need Basque flag please.. ",
    "yammadev": "Give it a try! :+1: \n. ",
    "slany": "Yes, it can by JSON file or js file which can be included; \nFor examle JS file :\nlipis={};\nlipis.flags={};\nlipis.flags.list=[\n{key: 'ao', name: 'Angola', continent: 'Africa'},\n{key: 'bf', name: 'Burkina Faso', continent: 'Africa'},\n...];. ",
    "vsternbach": "@slany I am using this package for this, by the way it also provides emoji for each country:\nhttps://github.com/OpenBookPrices/country-data. ",
    "tbjgolden": "Did the research and it seems there are very few flags with grey on the outside:\nValle del Cauca Department (not a country) #e7e7e7\nSantiago Metropolitan Region (not a country) #585767\nSo #ddd seems very safe. @lipis I've fixed this locally, is there any chance you could add me as a contributor so I can create a pull request for this issue. ",
    "pioz": "Should be great have en as alias of gb or as a new flag half us and half gb (for language purpose). ",
    "treveshan": "Great!!! it worked thanks. ",
    "argasek": "Can we get one, pretty please?. ",
    "romucci": "Still no Kosovo flag for the boyzz?. ",
    "cborchmann": "It´s easy to deal with in some cases:\n<?php \n    $flag = strtolower($iso);\n?>\n<span class=\"flag-icon flag-icon-<?php echo $flag;?>\" style=\"font-size: 5.0em\"></span>. ",
    "sanaulla123": "Yes its easier, but out of the box support should be even more easier and a much better solution in my opinion . ",
    "keraf": "The flags of England (gb-eng), Northern Ireland (gb-nir), Scotland (gb-sct) and Wales (gb-wls) are already available but unfortunately not displayed on the website (http://flag-icon-css.lip.is). Would be nice to get them added on there.. ",
    "bitedgecom": "The flag of the former soviet union does exist and is useful in manny contexts. In the case of my site we list historical sporting results with a flag for each country. The former soviet union is included and so to needs to be its flag.. ",
    "lukasz17m": "Done :smiley: . ",
    "AlexWayfer": "Although it seems like nothing breaks…. ",
    "genefedorchenko": "Solution was in webpack config\nexternals: [nodeExternals({\n    whitelist: [/^flag-icon-css/]})],\nsorry for blaming it on css. :). ",
    "kiseok04111": "I tried it the same solution. but it does not work.. ",
    "beruic": "Well that colours my problem worse. I guess the solution it to add a flag for the English language.. Sure! Why not?. I guess irony was not the way to go.\nAnyway, to conclude this thread in all seriousness: It's not gonna happen.. ",
    "joshjung": "Can we please get this merged into develop? We really need this feature :). ",
    "SaphuA": "Went ahead and did it anyway. I wrote a little script that updates all the files so let me know if you need it in another format.. @lipis I've added the prefix to all attributes. Let me know if it's ok like this.. ",
    "jorgelf": "Yeah, it's an autonomous community inside Spain, but it has the same status as Catalonia, which had its flag included in this repository. That's why I thought the galician flag could be added as well.. Galicia has the same status as Catalonia and its own language as well, so I can't see why it's ok to include one but not the other. In fact, the Galician flag, along with the Basque one, was already brought up in #361, probably for the same reason as these three regions are the spanish subdivisions with their own languages.. ",
    "juanqui66": "Finally I have achieved it with the following steps (besides installing your module):\n\nEdit the file ./node_modules/[at]ionic/app-scripts/config/copy.config.js of our project (creating the file ./config/copy.config.js has not worked for me). We add the following lines at the end of it:\n\ncopyFlagIconCss: {\n     src: ['{{ROOT}}/node_modules/flag-icon-css/css/'],\n     dest: '{{BUILD}}'\n   },\n   copyFlagIconFlagsCss: {\n     src: ['{{ROOT}}/node_modules/flag-icon-css/flags//'],\n     dest: '{{WWW}}/flags/'\n\nEdit the file ./src/index.html to add:\n\n\nThe problem was in which copy.config.js to use and the second line added in this file, that in no forum had seen that it was necessary to use.\nThank you and excuse my bad English.\n. ",
    "koddr": "@lipis ok.\nFor me (and not only me) save traffic for my website visitors — is better than pretty icon code view :) It's OK, when you use 1-2-3 icon per page.. but in my case — I use about 50 icons on one page and (for me) use SVGO with max optimization — only right way.. ",
    "mingtsay": "According to the article on Wikipedia in Chinese, it says \"雖然《中華民國憲法》與《中華民國國徽國旗法》並未規範國旗之配色標準，但根據中華民國內政部之建議，繪製國旗時應求顏色純正，故有後列之配色參考\"; which means that the color of the Flag is not specified in the law in Taiwan, but it is recommended to use three specified colors[1] from the Ministry of the Interior.\nAlso, the border of white sunshine is rounded instead[2]; you can reference the picture to find out the way to layout the Flag.\nMaybe @Akanyan can helps to redraw the Flag?\n[1] Blue = C100-M80-Y0-K20 | White = C0-M0-Y0-K0 | Red = C0-M100-Y100-K5~10\n[2] https://commons.wikimedia.org/wiki/File:Republic_of_China(Taiwan)_sheet.png. ",
    "Elfayer": "@tomlutzenberger Right... On wikipedia, they say \"The following are the approximate colours of the Hong Kong flag in different colour models.\" I have seen other flags colors mismatching the wikipedia suggested colors for different flags in the lib. Maybe it's not too bad since it seems like it is not easy to find a source of truth on these.... ",
    "gr8bit": "Came here looking for the 3:2 aspect ratio, clicked Findus23' link above, had a good laugh and am now happily going with your 4:3 flags. :)\n. ",
    "Humeira": "@lipis nope only flag-icon flag-icon-us and my custom width & height. @lipis thanks i'll try that. . ",
    "minidoc": "Same issue seems to be reoccurring. \nThe page seems to show up for a sec at http://lipis.github.io/flag-icon-css/, before being redirected to http://flag-icon-css.lip.is/ \nAnd http://flag-icon-css.lip.is/ does not resolve.\n. ",
    "rhymes": "@akinhwan check this out: https://github.com/vikkio88/vue-flag-icon. ",
    "stychu": "Also having problem with use flags with webpack project. Im using Angular 5 (cli)\n. @griffiti  \n\nI'm using Angular 5.2.5. Here's how the flags are being used:\n<i class=\"flag-icon flag-icon-ad h1\" title=\"ad\" id=\"ad\"></i>\n\nAnd how to include the library to be able to use the css?. ",
    "papoola": "js\nimport 'flag-icon-css/css/flag-icon.css'. ",
    "cbeaujoin": "With Angular 5, you can refer to the CSS file in the .angular-cli\n\"styles\": [\n        \"../node_modules/flag-icon-css/css/flag-icon.min.css\"\n      ]. ",
    "akinhwan": "thanks everyone!. ",
    "griffiti": "I'm getting the same error.\nEnvironment:\nWindows 10\nNode 9.5.0\nError:\nERROR in ./node_modules/raw-loader!./node_modules/postcss-loader/lib??embedded!./node_modules/flag-icon-css/css/flag-icon.css\n(Emitted value instead of an instance of Error) CssSyntaxError: C:\\dev\\projects\\simpliq-full\\node_modules\\flag-icon-css\\css\\flag-icon.css:166:399: Can't resolve '%23a' in 'C:\\dev\\projects\\simpliq-full\\node_modules\\flag-icon-css\\css'\nOccurring for the following countries:\nnp\nnu\nnz\nsl\nza\nbj\n. I'm using Angular 5.2.5. Here's how the flags are being used:\n<i class=\"flag-icon flag-icon-ad h1\" title=\"ad\" id=\"ad\"></i>. ",
    "aldenteTarnow": "Despite the error. How do you include and use flags with angular??  Are you guys using angular 5?  Can someone guide me how to??? . ",
    "kloasn": "Updating to the latest version of angular/cli (1.7.1) resolves the issue.. ",
    "aligit": "I manage to fix it by restoring package-lock.json. I've also upgraded my @angular/cli from 1.4.2 to 1.6.0. For me that's fine. @griffiti did you manage to fix it by upgrading your angular.. ",
    "kaleidocore": "I too can confirm that updating to angular/cli 1.7.3 resolved the issue. In fact, I just ran\nnpm update\nin my angular project folder, and bunch of stuff  got upgraded and the compile errors disappeared.\n@stychu \n\nAnd how to include the library to be able to use the css?\n\nI'm using the latest Angular 5 SPA template.\n\nInstall the module with npm:\n\nnpm install flag-icon-css\n\nFor testing purposes you can add it globally in styles.css:\n\n@import \"~flag-icon-css/css/flag-icon.css\";\n\nFinally, just use the tag in your html, e.g. in home.component.html:\n\n<span class=\"flag-icon flag-icon-se flag-icon-squared\"></span>\n. ",
    "sushil302": "@lipis  @kaleidocore  Hi i am using Angularjs 1.3.13 and using flag-icon-css i am only able to display us and gb flag and not able to display any other flags. i tried doing npm update but didnt work for me. \nAnyone know solution on it?. ",
    "SuperUserNameMan": "funny. I needed one too, and I decided to kinda make myself one with a greenish \"globe\" icon from fontello over a bluish background.. also see #444 . ",
    "davidstokes5000": "Ah thats great. \nThank you.. ",
    "omBratteng": "It was pretty close already. But the red was too dark and the blue was too bright. Cheers!. ",
    "kent1D": "Following https://www.norden.org/en/fakta-om-norden-1/the-nordic-flags/the-norwegian-flag : \n\nRed should be PANTONE 186 C => #C8102E (https://www.pantone.com/color-finder/186-C)\nBlue should be PANTONE 287 C => #003087 (https://www.pantone.com/color-finder/287-C)\n\nThe real reference should be there : http://nordicflagsociety.org/vexillologi/flaggfarger/\nBut the link is 404, maybe someone reading danish (or other language, sorry) may find it ?. Here is for norway : http://nordicflagsociety.org/wp-content/uploads/2016/09/Norway.pdf. Here https://www.pantone.com/color-finder/186-c it says #C8102E. ",
    "RobinPel": "It's there: https://github.com/lipis/flag-icon-css/blob/2a66fc2e1a048a4389117fe648b3957bd7029bdf/css/flag-icon.css#L1527. ",
    "537mfb": "Curaçao is code cw\nSerbia is code rs\nSaint Martin is code mf\nThey're all there. ",
    "thomaslarsson": "@537mfb Thank you very much. Seems like the third party API we are calling have the wrong ISO-codes for these countries. We are getting:\n\n[AN] Curaçao\n[YU] Serbia\n[S1] Saint Martin (sic!)\n\nAlso, I must have been a little tired when creating this issue. Not really sure why I checked the alpha-3 instead of the alpha-2 standard. \nClosing.. ",
    "gkzsolt": "Will do. Unfortunately (or fortunately) I am only a humble employee, but I'll do what I can. Thanks anyway ;). @Findus23, thank you for the link ! That's awesome :-). Can't you just replace the flag with the one on wikimedia, pointed to by @Findus23 ? I've done this in our project. Unfortunately I don't speak SVG.. Well, I have not checked the exact aspect ratio of the flag on wikimedia. In our project we needed round flags, what I produced creating a pixel image for the flag (from the 1x1 collection, and the wikimedia US flag), then manipulating it with imagemagick apps. The result being icons, it didn't matter too much that the US flag was shrank horizontally. But I admit that it can count in other use cases. Anyway, it may be worth to look at the SVG from wikimedia: it might be easier to change.... ",
    "dinfyru": "@lipis mb is there ways to fix it?) mb className - 'flag-andorra' and 'andorra.svg'. @tomlutzenberger i can't disable adblock for my users) How can i reconfigure module (mb in webpack) for rename ad.svg for something else?. ",
    "eranshmil": "You could change the naming in your node modules and create a patch script using https://www.npmjs.com/package/patch-package. ",
    "sporritt": "https://www.youtube.com/watch?v=dQw4w9WgXcQ. ",
    "dreamyguy": "I came to know of this repo (flag-icon-css) yesterday, as I'm currently diving deep on the subject of flags. While I really appreciate the great effort put into \"normalizing\" the flags to some pre-defined aspect ratios, it was a huge downer when it came to my specific need: to have flags as close as possible to their original proportions.\nI created https://github.com/dreamyguy/flags today, downloading each and every country flag available on Wikipedia. Maybe someone would like to reuse that to cover this particular need on this repo? 😉 . ",
    "nbrummerstedt": "Interesting. Of course, Pantone is the most reliable source (I used Wikipedia).\nHowever, the color is still wrong, then.. ",
    "sandeepkamathkr": "Now it worked as i mentioned the flag-icon.css in angular.json file. Which\nwas not mentioned in readme page\nOn Mon 2 Jul, 2018, 8:36 PM Lipis, notifications@github.com wrote:\n\nhmm... what did you do? how are you using it?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/lipis/flag-icon-css/issues/472#issuecomment-401836431,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AGuJoATG28n5kUmIOZrsLcuw7Mrq62_Oks5uCjbpgaJpZM4U_X4V\n.\n. \n",
    "mendeza": "Fair enough, thanks for your response.. Unlikely. The maintainer has stated more than once that only country flags are included.. ",
    "vbosh": "Perfect! Thanks for the quick response. I was looking in the http://flag-icon-css.lip.is/?continent=Europe. . ",
    "dnsnx": "Also missing flags for Macedonia and Kosovo. Would it be possible to add? Thanks in advance!. ",
    "sydneyhenrard": "I checked the css for france and spain:\n```\n.flag-icon-es {\n    background-image: url(\"es.svg\");\n}\n.flag-icon-fr {\n    background-image: url(\"data:image/svg+xml,%3Csvg xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22 id%3D%22flag-icon-css-fr%22 width%3D%22640%22 height%3D%22480%22%3E  %3Cg fill-rule%3D%22evenodd%22 stroke-width%3D%221pt%22%3E    %3Cpath fill%3D%22%23fff%22 d%3D%22M0 0h640v480H0z%22%2F%3E    %3Cpath fill%3D%22%2300267f%22 d%3D%22M0 0h213.337v480H0z%22%2F%3E    %3Cpath fill%3D%22%23f31830%22 d%3D%22M426.662 0H640v480H426.662z%22%2F%3E  %3C%2Fg%3E%3C%2Fsvg%3E\");\n}\n```\nDo you know why it's different?. This is a bug in Angular CLI.. ",
    "robluton": "I haven't used this library yet, but looks like it's there to me.\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/4x3/ps.svg\nhttps://github.com/lipis/flag-icon-css/blob/master/flags/1X1/ps.svg\n.flag-icon-ps {\n  background-image: url(../flags/4x3/ps.svg);\n}\n.flag-icon-ps.flag-icon-squared {\n  background-image: url(../flags/1x1/ps.svg);\n}. ",
    "ejdzipi": "@lipis Why was this closed, without any explanation? Thanks. Ok, thanks for explanation.. ",
    "ddimass": "I have no idea what you are talking about... :) - its universal answer for all questions.. ",
    "Blackjacx": "Okay, leave that issue open please. I'll care for that. I am only on holiday the whole October. After that I can do that for you.. Hey there, I will try to code it this week 😁. OK done: https://github.com/lipis/flag-icon-css/pull/503\nYou can have a look. If you need any additions, you know where to find me ;-). I must admit there is room for improvement but I successfully executed it on your catalog and use the AssetCatalog with PDF's in my framework.. ",
    "lazysergey": "@lipis can you give a comment on this?. sure, I’m using your awesome lib in countries phonecodes dropdown. When I open the dropdown my app triggers 257 get requests for each *.svg flag\nSo I thought it might be good feature to have css where all SVGs are encoded directly in css via base64 so server will not be hit with hundreds extra get requests for the flags - it will get all of them along with css. ",
    "pkrstic": "Why did you approved this PR and added Kosovo flag, when Kosovo is not a country? Kosovo is still part of Serbia (UN resolution 1244). Same way you could add Palestine, Kurdistan, Catalonia and all other regions that are not publicly recognized, and have some special status in UN, but they are not members of UN. Use list of UN members use that as guideline.. @jonbulica99 I'm from Serbia, and i know what our PM is telling, he is there to finish Kosovo transformation into country, and yet 1244 is still only valid document, which says that Kosovo is part of Serbia. My comment wasn't political, just pointing out to something that i see as irregularity.\n@lipis I'm sorry if I offended you in any way, it wasn't my intention, this is great project. ",
    "jonbulica99": "@pkrstic \nSince we are discussing politics I might as well weigh in on this. There were flags of regions not recognized as countries by the UN to begin with (Palestine on top of my head). Furthermore, merely reading the Kosovo Wikipedia page makes it perfectly clear that your statement is very far-fetched. Even the Serbian PM admits it's unrealistic to think Kosovo is still part of Serbia. UN resolution 1244 is a paradox by definition, since it did not \"resolve\" anything at all. It was a \"solution\" which left everything open, satisfying neither side of the conflict. But then again, anything else besides that would've been vetoed immediately, again just showing how ineffective the UN is at resolving anything. \nAlso LOL @ telling the repo owner what he ought to use as a guideline. . ",
    "sktwentysix": "I love the idea of ISO 639-1 support. Having some form of visual representation, while subjective, would be great.\nHowever, there are a lot of languages in the spec that just do not have any representation in the form of a flag. Take Yoruba as an example, an ethnic group of people mainly found in Nigeria, but numerous other countries too. There are no credible flags to represent the ethnic people themselves other than this crude gif I found - https://www.crwflags.com/fotw/flags/ng%7Dyorub.html\nA collection of ISO 639-1 icons would be great but somewhat controversial. ",
    "julianeden": "I figured it out, but for the record I still think this should be addressed in the usage section rather than treat it as a given. It would only take one additional sentence.. ",
    "Dremet": "Would have been nice, if you would have at least shared your insights @julianeden. I am having the same question and have not yet figured it out. Or could you explain how to use it @lipis? Still does not seem to be included in the readme file.. I want to specify my problem. It is true that I am quite new to node, but nevertheless people like me also should know how to use it. So generally I have all my scss/css files in the \"public/\" folder, which is how it is supposed to be, but after installing flag-icon-css nothing appears there. That is what probably also confused @julianeden. We both looked into \"node_modules/flag-icon-css/\", but those files should probably not be used for the website content I guess because just all files in \"public/\" are supposed to be visible by the user (via source code look-up). So what is the correct way of including the css/scss in a node application after installing the package?. I just figured out a way, but I do still not know whether this is good practice. I think this will help a lot of other persons who are also in the same phase as me (developing the first projects with node):\nAfter installing the package with npm, I included this in my app.js:\napp.use('/flags', express.static(path.join(__dirname, 'node_modules/flag-icon-css/'), { maxAge: 31557600000 }));\nand in my (pug) template file I included:\nlink(rel='stylesheet', href='/flags/css/flag-icon.min.css')\nand now I am able to use the css classes. Does this sound like good practice to you @lipis? (I do not use webpack, gulp,...). I do, I just worried cause by applying that \"app.use(...)\" line might make something publicly available that should not be available.. ",
    "o-arslan": "I found a workaround for this, however you cannot use npm this way. After I got the flag-icon-css package all my ratios were wrong (1x1) and I could not fix it. After looking into the style that got loaded in i did not see an indication of 4x3 or 1x1, just the name of the file.\nAfter a closer look it had put all the flags into the root of my build folder. To fix this I just downloaded the css file and got all the flags in the correct folder, so both 1x1 and 4x3. These i put in the assets folder.\nSo you get:\n* src\n   * assets\n      * css\n         * flag-icon.css <-- main css file\n      * img\n         * flags <-- here i put the svg assets.\n            * 1x1\n            * 4x3\nNow in the flag-icon.css change the url src from \"../flags/....\" --> \"../img/flags/...\"\nAfter this angular.json under assets, make sure \"src/assets\" is included in the assets propery and finaly in your index.html add:\n  \nThis will make sure the build folder is neat and structured, and you can use the css selectors throughout your application. Also this fixed the aspect ratio for me..\nHope this helps. ",
    "BenDevelopment": "\nI found a workaround for this, however you cannot use npm this way. After I got the flag-icon-css package all my ratios were wrong (1x1) and I could not fix it. After looking into the style that got loaded in i did not see an indication of 4x3 or 1x1, just the name of the file.\nAfter a closer look it had put all the flags into the root of my build folder. To fix this I just downloaded the css file and got all the flags in the correct folder, so both 1x1 and 4x3. These i put in the assets folder.\nSo you get:\n\n\nsrc\n\n\nassets\n\n\ncss\n\n\nflag-icon.css <-- main css file\n\n\nimg\n\n\nflags <-- here i put the svg assets.\n\n1x1\n4x3\n\n\n\n\n\nNow in the flag-icon.css change the url src from \"../flags/....\" --> \"../img/flags/...\"\nAfter this angular.json under assets, make sure \"src/assets\" is included in the assets propery and finaly in your index.html add:\nThis will make sure the build folder is neat and structured, and you can use the css selectors throughout your application. Also this fixed the aspect ratio for me..\nHope this helps\n\nThank you @o-arslan, this is a good solution but it will break the npm link as you said. No more npm update :(.\nAnother problem is that it will add css and flags img in source control.. ",
    "Petronious": "Well, I've found an (ugly) workaround:\nIn angular.json, add \n{\n    \"glob\": \"*.svg\",\n    \"input\": \"node_modules/flag-icon-css/flags/4x3/\",\n    \"output\": \"images/flags\"\n}\nAnd in your component's scss, \n$flag-icon-css-path: '/images/flags' !default;\n$flag-icon-rect-path: '' !default;\n@import \"~flag-icon-css/sass/flag-icon\";\nI'm only using 4x3 icons so I didn't included 1x1.. ",
    "MiguelRozalen": "Hi @Petronious i don't know in which part of angular.json put your solution... Can u help me?\n--EDIT:\nI finally fixed it. Your solution works like black magic! I got it put your info inside assets object:\n\"assets\": [\n     \"src/assets\",\n     \"src/favicon.ico\",\n     {\n         \"glob\": \"*.svg\",\n         \"input\": \"node_modules/flag-icon-css/flags/4x3/\",\n          \"output\": \"assets/flags/4x3/\"\n    },\n    {\n         \"glob\": \"*.svg\",\n         \"input\": \"node_modules/flag-icon-css/flags/1x1/\",\n          \"output\": \"assets/flags/1x1/\"\n   }\n],\nThen in my app style .scss: \n$flag-icon-css-path: '/assets/flags' !default;\n$flag-icon-rect-path: '/4x3' !default;\n$flag-icon-square-path: '/1x1' !default;\nAnd got it YEAH!. ",
    "alexandernst": "@Findus23 About the maintaining part: if those SVGs are edited by hand instead of using a graphical design tool, then yes, you're right. But I'm not sure if that is the case.\nAbout the size reduction: the resulting file size after gzip-ing the files in this patch will be smaller compared with the current files, after gzip-ping them. The reason for this is very simple: no matter how good gzip can \"compress newlines\", it still has to keep those newlines somewhere. If the newlines are removed, then gzip doesn't have to store anything related to newlines.. @lipis It doesn't seem to be working from outside of the project itself. If I create a \"Hello world\" project (with vue-cli, for example), and I do npm i flag-icon-css and then npm run build, the build folder will contain uncompressed flag icon SVG files.. ",
    "lycwed": "kr is not Korean flag it's Kanuri : https://fr.wikipedia.org/wiki/Liste_des_codes_ISO_639-1\nAs you can see ko is Korean.. ok sorry !. ",
    "houndci-bot": "Prefer double-quoted strings\n. Prefer double-quoted strings\n. Line contains trailing whitespace\n. Line contains trailing whitespace\n. Line contains trailing whitespace\n. Line contains trailing whitespace\n. Commas in mixin parameters should be followed by a single space\n. Commas in mixin parameters should be followed by a single space\n. Rule declaration should be preceded by an empty line\n. Rule declaration should be preceded by an empty line\n. Rule declaration should be preceded by an empty line\n. Rule declaration should be preceded by an empty line\n. @else should be placed on same line as previous curly brace\n. @else should be placed on same line as previous curly brace\n. Rule declaration should be preceded by an empty line\n. Rule declaration should be preceded by an empty line\n. "
}