{
    "Lokaltog": "Thanks for the patch! Merged in 80b10ebfc98a6d83b3045d5e7631509a69157108.\n. I don't particularily like the arrows, but I agree with the idea of including symbols which are compatible with most setups without requiring a patched font. I thought that the separators might look better with the medium shade glyph (▒) instead, so that the separator effect is a gradient rather than an arrow. What do you think?\n. Yeah, that looks pretty bad. I'll investigate this further, and if I can't find any better solutions I'll merge this one.\n. I won't merge this because it includes a merge commit and the coding seems like a copypaste of another segment. I will however try to add proper VirtualEnv support when I have the time.\n. Closed due to a lot of core changes introduced in 4a0a52cc76851f1ab38ccee01c7aa9eeb9927568. Please resubmit the pull request if you update the code to work with the latest revision.\n. Could you upload a screenshot so I can see how it looks?\n. Looks pretty good, let me know when you've worked on it and I'll merge it into the main repo.\n. Thanks! I'll wait with the merging of these commits until I have some customizing solution (#37) so that it's possible to enable and disable each segment of the statusline.\n. See #37 and the feature/customizability branch for progress on the customization. I'm hoping that it will be ready soon.\n. Closed by 404c8b0d400e98e685a2bbc81cdea1169f837071.\n. Closed due to a lot of core changes introduced in 4a0a52cc76851f1ab38ccee01c7aa9eeb9927568. Please resubmit the pull request if you update the code to work with the latest revision.\n. I could be missing something here, but is there any reason why you don't use the %B statusline flag (hex value of the character under the cursor), or getline('.')[col('.') - 1] combined with char2nr/nr2char?\n. No, I'll handle it. I don't want it to be part of the main theme, but rather a segment that may be manually inserted for those who need it, so I'll close this pull request when I've created the new segment.\n. I think your method may be the best way of retrieving both the character under the cursor as well as the character code. I've created a modified version of your function which I'll commit soon.\n. Thanks, I'll fix this soon.\nRefs #79.\n. Thanks!\n. Thanks! I won't merge this directly because I want to modify the code a bit (I want to create a combined function for the branch segment that works with several VCS plugins, and create a configurable line info segment). I'll close this pull request when I've updated the code.\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. I'm going to merge the sass-status plugin, but I won't add it as a segment in the default theme. Those who are interested can add it to their theme using Pl#Theme#InsertSegment().\n. Thanks for creating a Solarized theme for Powerline. I'll merge this into the main repo if you can create a new pull request with a single commit that conforms with Tim Pope's guidelines for git commits.\n. It looks good, but I'm unsure about merging this into the main repo. I'll merge it if anyone else thinks it's a good idea.\n. I'm closing this due to lack of feedback.\n. Looks good. I'm currently merging several pull requests and I want to include this, has the theme been updated so the statusbar has the correct color?\n. Thanks. I removed the sass segment from the commit and did some minor changes to the colorscheme file so you should pull the latest changes from my repo.\n. This is actually intentional as it will automatically reformat paragraphs with the wa formatoptions (see :h fo-table). I don't know if this is bad practice (I remove trailing WS from all other files), but I find it pretty useful for keeping text files automatically formatted.\n. What exactly does this change do?\n. Looks good, thanks! I'll merge it soon.\n. I'll consider merging this, but I really want something that draws attention to the segment and the slashes makes the segment much more visible in my opinion. Do you have any suggestions to how we could draw attention to the segment (it's reporting errors so it should be very visible) apart from having \"noisy\" symbols in it?\n. Sorry man, I've been on vacation. I'm reviewing and merging all the pull requests now. :)\n. I agree, I'd rather just change the default gray color than merge this.\n. Good idea, thanks!\n. All colorschemes are compatible with the fancy icons. :)\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. Nice, thanks!\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. Unfortunately it isn't possible to hide empty segments yet. I'm planning to implement this in the Python port, but due to work pressure I haven't been able to do much work on this lately.\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. These commits got merged along with #230.\n. Very nice, I'm reviewing this now.\n. Great job, I did some commend cleanup to make it consistent with the current commit history and merged everything into develop.\n. I like it! Great job!\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. I disagree with this and won't merge it into the develop branch. I think the statusline should be as simple as possible, and it's a given that there's no branch available if the segment is missing from the statusline. I know that this is an issue with colorschemes that want a different bg color for the branch segment, but this is already resolved in the upcoming Powerline version.\n. Thanks! Merged into develop.\n. This project is deprecated in favor of Powerline, a Python-based port of this project. No new features or other changes are going to be accepted into this project.\n. I recommend that you switch to the new version of Powerline as soon as possible - the bug is fixed there and that project is actively maintained. No further code changes will be merged into this project.\n. This project is no longer being maintained. Also, the powerline-fonts repo only contains fonts for the new version of powerline.\n. This project is deprecated and abandoned and no further changes will be merged. Check out the powerline project instead.\n. ",
    "yacoob": "Here's a screenshot.\n. At least in Monaco (the default Mac font), those blocks don't really stretch to the top of the character space :( Plus with small font sizes, thedots get smeared via antialiasing in a bad way. Take a look. I'm not particularly fond of the arrows either, but I found them acceptable and semi-good looking with Monaco - and I haven't found anything better.\n. ",
    "danielbeardsley": "Here's some screenshots.\nhttp://imgur.com/a/a895K\nThough I'll probably do a bit more work on it...  a few details left.\n. Ready to go for now.\nUpdated screenshots: http://imgur.com/a/m3QWW\nNotice the red '+' modified marker, and the buffer # in lower left.\n. ",
    "jelera": "I was gonna do a pull request on this one too, but you were too fast my good sir :-D\n. excellent... keep up with the great job\n. Ubuntu, Debian and OSX do not refer python2.x as python2, only as $ python. I think applying this patch will break it for everyone else but arch users. http://www.archlinux.org/news/python-is-now-python-3/\n. My knowledge in Python is limited, perhaps someone could make a version check in the beginning of the file\n. ",
    "gaving": "+1ing this pull request as I'm wanting to add some whitespace warnings but I'll hold off to see how the customisation works.\n. ",
    "ming13": "@jelera Yep, you’re right, just checked on Ubuntu and OS X, environment magic doesn’t work. And now I don’t know how to solve it.\n. Well, there is no way to use right Python version everywhere, so I replaced change of enironment with printing message to user if something going wrong. I hope it would work fine.\n. ",
    "delphinus": "The method with col(.) can't be used in multibyte environment. It will return a part of bytes.\nBut, about %B statusline flag, I've forgotten it! Surely, I could get charcode without function. Should I rewrite it?\n. ",
    "twe4ked": "Is this enabled by default? I don't see any RVM info. Cheers.\n. That would be it, thanks :D\n. ",
    "qqshfox": "\nIs this enabled by default?\nYe.\nI don't see any RVM info.\nMaybe you need vim-rvm (https://github.com/tpope/vim-rvm.git).\n\n2012/2/28 Odin Dutton\nreply@reply.github.com:\n\nIs this enabled by default? I don't see any RVM info. Cheers.\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/Lokaltog/vim-powerline/pull/78#issuecomment-4207989\n. \n",
    "soli": "np, no hurry here, just putting some spare time to use ;)\n. ",
    "skwp": "Discussion at #108\n. So rather than updating the default.vim, I added my own skwp.vim. I'm wondering if you are considering taking submissions like this one, similar to what oh-my-zsh does, to ship powerline vim with a few different themes?\n. Sounds good, thank you.\n. My pleasure :) If you love solarized check out my dotfiles project which has all vim plugins optimized for solarized http://skwp.github.com/dotfiles\n. This is a solarized dark. @kepbod I recommend taking a look at my changes and taking a look at the solarized website. It should be pretty easy to plug in the colors you want.\n. @cj hmm, check out the theme code, it's actually pretty straightforward. maybe there's an obvious use of one of the 'gray' colors instead of 'base'. i don't know when i'll be able to look at this\n. Yes updated, I force pushed. It doesn't look 100% in non macvim for me, but for @cj above seems to work right. I don't use non-macvim so didn't figure out what's wrong. I'm not even getting the blue color outside of macvim either. The theme works well in macvim, so up to you whether to merge it in that state, it may take me some time to make it work 100% on command line since I don't use that.\n. :+1:\n. This theme is for dark, but take a look at how it's done, then go to solarized website and pull up the color codes, it should be pretty easy to substitute the light ones in there. I don't use light so I didn't spend time making that work..\n. Fyi the git branch is indicated in the skwp theme, as is paste mode (on the right) :)\n. @patricklewis fyi the wierd version wiht missing segments and that says \"Help\" was apparently the result of some bug on the main fork. My theme didn't have these problems till it was merged upstream, but they supposedly fixed it in https://github.com/Lokaltog/vim-powerline/pull/141\n. Nicely done sir :)\n. ",
    "patricklewis": "Thanks for making a Solarized theme!\n. Is it possible to get a Solarized colorscheme that works with the default theme as opposed to the stripped-down skwp theme? \nI miss things like the paste-mode indicator, git branch indicator, etc. that are not present in the skwp theme.\nBasically, I just want this, but with a Solarized-appropriate color instead of the lime green in Powerline:\n\n. @skwp is it? I don't see either one (this is using skwp theme & skwp colorscheme):\n\n. @pearofducks Thanks, I'm using your solarizedLightLC colorscheme with the default theme and it's pretty close to what I'm looking for (though the middle part of the status bar seems to be using the same color as the Solarized background color):\n\n. @pearofducks Great, thanks!\n. Hi, can you please explain how this is different than the one I submitted 4 months ago? https://github.com/Lokaltog/vim-powerline/pull/162\n. ",
    "kepbod": "Is this theme adjusted to solarized-dark colorschem or solarized-light colorschem? I remembered that you designed a beautiful solarized-dark theme a month ago, I wonder if it is possible to design a solarized-light theme.\n. ",
    "cj": "@skwp there seems to be an issue in iterm with the status bar color, it looks like:\n\nWhen in Macvim it looks like (which is correct):\n\n. @skwp I've tried changing every color, it still won't change it from that gray color :/\n. @skwp So it turns out base02 which is 235 needs to be 0, once I changed it to that in your solarized vim and powerline theme everything was right in the world :)\n. ",
    "pearofducks": "@cj: If you're using the solarized terminal colors as well, you can actually change all the values to their 16-color equivalent. IIRC solarized was originally designed to work off of this method anyhow.\n. I'm making one for light. Early version can be seen here (along with alternative 'solarized' colorschemes based off the default Theme):\nhttps://github.com/pearofducks/vim-powerline\n. Feel free to copy what I have so far and make any changes you like, I'm being pretty aggressive in my design decisions, so a more conservative version would probably make more people happy. :D\nThe file you're likely interested in:\nhttps://github.com/pearofducks/vim-powerline/blob/develop/autoload/Powerline/Colorschemes/solarizedLightLC.vim\n(One quick note, the color names are not the 'solarized' names, but are based on his LAB values because those are much easier to work with)\n. @patricklewis \nTry this:\nhttps://github.com/pearofducks/vim-powerline/blob/develop/autoload/Powerline/Colorschemes/solarizedDarkLC.vim\nor this:\nhttps://github.com/pearofducks/vim-powerline/blob/develop/autoload/Powerline/Colorschemes/solarizedDark.vim\nSee above for the light version. Both are WIP but I'm using them daily with the default theme.\n. @patricklewis The middle being the same color is an intentional design choice (that I realize some might not like, hence why I'm making an LC and a normal version). If you want to fix it, change line 57 in the colorscheme file\nfrom:\n\\ 'n': ['b65', 'b97'],\nto:\n\\ 'n': ['b65', 'b92'],\nor any value: b65, b60, b50, b45\nOtherwise later this month I'll have a non-LC version that won't be so aggressive and will be closer to default-powerline only with solarized colors.\n. Did you make sure you have the skwp files? If you cloned this repo a while back maybe an update is needed?\n. ",
    "leafac": "Does this colorscheme support both light and dark solarized flavors?\nI could only get it to work with the dark one and I prefer the light.\n. @skwp Yeah, that's what I thought. Just needed to ask in case I was doing a dumb misinterpretation on something.\nThanks for the good work and quick response.\n@pearofducks I'm also interested in making the light theme work. I've just forked the powerline repo with this in mind.\nI could help you, instead of starting from zero.\n. @pearofducks Ok, got it.\nI got your scheme installed, it fits better with solarized light than the default powerline scheme, of course.\nI'll start working on it soon.\nThanks for the initiative.\n. ",
    "wunki": "I feel a bit stupid, but how do I use this theme? Adding:\nlet g:Powerline_theme='skwp'\nlet g:Powerline_colorscheme='skwp'\nDidn't do it for me in Macvim.\n. Ah, I saw that I was on the wrong branch. Was on master instead of develop. Working now, thanks.\n. ",
    "skanev": ":(\n. ",
    "jlamontagne": "Thanks! It appears as though addb4716b763c37d9dcb65ac24639039e1093888 was just overlooked.\n. ",
    "char101": "\nfor the 'short' style, if autochdir is set, it's useless to expand to the current dir, since it will always be expanded to the base filename only. So instead just take the head directory and shorten it to the initial letters\nfor the 'full' style, it simply doesn't work.\n\nlet filepath = expand('%') -> file.txt\nlet ret = filepath . dirsep -> file.txt/\nwhich ends up being file.txt/file.txt in the status line.\nThe right way is\nlet filepath = expand('%:p') -> /some/dir/file.txt\nlet ret = fnamemodify(filepath, ':h') . dirsep -> /some/dir/\n. ",
    "meh": "+1\n. ",
    "lepture": "@Lokaltog The yellow color is enough to draw my attention. Besides, we have marks on the sidebar.\n. ",
    "tholschuh": "+1\n. ",
    "vheon": "Seems really nice, but I don't fully understand why do pull requests on colorschemes when they can be added as needed separately... It's true that their size is basically a few Kb, but why every person should have this in their setup when they're not using it? I also made my own version (light and dark based on skwp's) of the solarized colorscheme adjusted for my taste and I keep them in a separate repository and no matter occured... that's only my 2 cent and again good job...\n. ",
    "ZyX-I": "@vheon I believe for the same reason why there is code supporting different plugins: if you can convince other plugin authors to add powerline support to their plugins it is good, but if you can’t this is much better then having to double number of repositories to checkout (I mean, plugin own repository and repository with powerline support for it). Colorschemes in this case are in better position: while in order to add support for powerline to foreign plugins changes to colorscheme and default theme are needed (unless author accepts something like what I suggested in issue #155), adding powerline support to colorscheme is just placing one file in a proper location.\n. @patricklewis Just look at screenshots. It is obvious it uses different colors and your one is darker.\n. vim-powerline is deprecated in favour to python-based powerline. No new features are officially accepted, see README.\n. vim-powerline is deprecated.\n. ",
    "sgrif": "Would be great to have a light version for people who use solarized dark, too\n. ",
    "dougireton": "Sorry about the whitespace fixes in this commit.\n. @Lokaltog in there anything in this commit which would prevent you from merging it? If you just haven't gotten time to review yet, no worries.\nThanks,\nDoug Ireton\n. ",
    "bittersweet": "Could you provide a screenshot? I'm wondering what it looks like!\n. ",
    "teoljungberg": "\nCould you provide a screenshot? I'm wondering what it looks like!\n\nI'm wondering the same\n. It looks about the same, except the new gray color\n. In my opinion, that change isn't merge-worthy. Tho, I'm not the shotcaller\n. :shipit: (ship it)\n. Post some screenshots to show off the colorscheme\n. That actually looks pretty good, is it compatible with the fancy icons also?\n. Was interested in how it looked with the fancy icons\n. ",
    "szw": "Sure, here it is: http://imgur.com/a/0UTMO . This is Vim in 256 color terminal (Ubuntu) with molokai colors. The upper screenshot shows default vim-powerline color theme on molokai. Notice the inactive window powerline background is invisible. The lower screenshot shows a bit modified gray0 color, so now it's visible. It matters especially if you have more horizontally split windows. \n. Exactly, only gray0 has changed.\n. great :). If the default gray changed it would be sufficient.\n. ",
    "mattn": "I suggest this patch to use get.\nlet mode = get(g:, 'Powerline_mode_v', 'VISUAL')\nYou don't need set default values. And probably, we can save few memories.\n. ",
    "andy-morris": "Right, of course. I forgot you could use g: as a dictionary.\n. ",
    "s0undt3ch": "@Lokaltog Ok. Thanks for the work done so far though ;)\n. ",
    "stardiviner": "+1\n. ",
    "MarioRicalde": "I'm glad you liked it. Thanks for including it on the repo.\nWill keep it up to date as I go.\nCheers.\n. ",
    "darcyparker": "It seems many people are having this issue (including me).  See http://codejury.com/consolas-font-in-vim-powerline-windows/#comment-331  I hope this pull request will be accepted.\n. I actually figured out a workaround to this.  I added the following to my vimrc to change these strings:\n     let g:Powerline_mode_V=\"V·LINE\"\n     let g:Powerline_mode_cv=\"V·BLOCK\"\n     let g:Powerline_mode_S=\"S·LINE\"\n     let g:Powerline_mode_cs=\"S·BLOCK\"\n. @Lokaltog - Thanks. I was trying the latest Powerline. But had challenges with setup/configuration on windows. So I reverted to this version.  (I had issues with flashing windows.. I saw https://github.com/Lokaltog/powerline/issues/36, but haven't spent enough time to figure out how to install libgit2 + pygit2.)  I will come back to it later.\n. "
}