{
    "lokesh": "Fixed. Thanks for catching that.\n. Thanks for mentioning this.\nI'm writing the javascript in Coffeescript. All of Coffeescript's output is wrapped in an anonymous function already which makes this easy to fix. I aliased jQuery in that scope. See the compiled js below:\n(function() {\n  var $, Lightbox, LightboxOptions;\n$ = jQuery;\n. Thanks Jules for your help!\nI'm curious, what did you use for optimizing the images?\n. Thanks Kostin! I made your suggested edits in the source Coffeescript file. \n. Flash movies and dropdown menus often appeared above the lightbox overlay and this function temporarily hid them to prevent the problem. I will review this to see if the issue still persists.\n. @akamustang - Thanks for the idea. Implemented in the source Coffeescript file and added to master.\n. Rendering performance is good at the moment. Sub 10ms for almost all paints on a 2 yr old Macbook Air that I'm using. \nI don't want to hardcode width and height values in the javascript as people might switch out the default loading image with another that has different dimensions and not be aware or want to mess with the javascript code. We could preload the loader, close, and arrow images and get the dimensions but this would add a bit of code complexity.\nGoing to leave as is for now. Thought if performance becomes an issue, all of these items should be reevaluated.\nThanks @akamustang.\n. Unable to recreate problem overlay problem on iPad. Closing out this issue.\n. Modernizr and html5shiv compatibility in the latest version on master.\n@sibprogrammer - Thanks for the note.\n. Moved the reference to the loading and close images out of the javascript file and into the css. Preloading the image in css using the following technique:\nhttp://www.thecssninja.com/css/even-better-image-preloading-with-css2\nSee my commit:\nhttps://github.com/lokesh/lightbox2/commit/953badfffffcfac749bc2a2f81aec88d08861052\n. Dropped the semicolons as they didn't serve a purpose as noted above. Thanks for the heads up.\n. @vikethehube - Added options for show/hiding the image number label and looping through image set once you reach the end or clicked the previous arrow from the beginning. Thanks for the suggestions and code. Latest is in mater on github.\n. Fixed in master. Thanks @ilyador.\nDoing some Github issues and PR clean up today.\n. Testing these changes tonight. Much needed. Thanks!\n. Working on the resizing of large images to fit in viewport problem though with a slightly different solution. I'm going to close this issue out and continue discussion here https://github.com/lokesh/lightbox2/pull/32.\nI'm also evaluating using css for fades and resize animations though a javascript fallback is still required for older browsers.\n. Working on a fix now. Going to close this issue as their another discussion on this topic here https://github.com/lokesh/lightbox2/pull/32\n. Going the HTML data- attribute route. I will be merging in this PR https://github.com/lokesh/lightbox2/pull/27 which will make HTML5 Validators happy. \n. Working on getting @TheConstructor's PR in which would support the old rel attribute syntax as well as a HTML5 valid data-lightbox syntax. Closing this PR in favor of https://github.com/lokesh/lightbox2/pull/27\n. Spriting the images will cut down on a couple of http requests and is a good idea for end users. I'm keeping the previous arrow, next arrow, and closing images separate in the main codebase to allow for easier customization. \n. I was never able to recreate this issue. Closing out. Doing some github cleanup. \nIf the issue still exists in the latest version of Lightbox on github > master, let me know. Thanks.\n. Closing out as there is limited demand for this feature. Thanks for submitting though @shakiba .\n. As @sarvaje noted, I am using the Compass framework's opacity mixin to generate the x-browser css. I'm going to leave as is since having an opaque background in IE8, though not ideal, is passable for this slightly older browser.\n. For simplicity, Lightbox will remain only for displaying images. There are some great alternative scripts for displaying html content.\n. Better late then never. I'm adopting most of your suggestions and working them into master manually. Thanks for taking the time to do this.\n. FAST! Thanks for that. Looks good to me. Will merge.\n. These days I value more and more, readable, consistent, and jshint happy code so these changes are appreciated.\n. Added support for data-lightbox alongside rel=\"lightbox\". See the latest in master. The commit is linked (the relevant bits are in lightbox.coffee):\nhttps://github.com/lokesh/lightbox2/commit/c31a0eba6a5bd9c82c132dac8609a201974b1710\n. I made some edits and merged a few PRs. The script should now work with with the latest versions of jQuery.\nI tested the latest lightbox.js code with jQuery 1.10.1 and 2.0.2 successfully. Grab the latest from this github repo. I will be updating the demo page download links tomorrow.\nPlease reopen this issue if the problem persists. Thanks!\n. Thanks @duergar for the submission. I worked on a similar fix that I will be releasing in the next day or two. \nI'm closing this issue out as there is a similar discussion happening in https://github.com/lokesh/lightbox2/pull/32/\n. Adding in the upcoming release. Thanks for the feedback.\n. Added a 'fitImagesInViewport' option. Take a peek:\nhttps://github.com/lokesh/lightbox2/commit/8e00c3086c7ca1f7ac5f316a5d7bd9f0903e2013\n. @OutPunk - Updating master with your suggestion. Thanks.\n. The reason for this issue was that there was an incorrect reference to the loader image. The jQuery selector was looking for '.loader' instead of '.lb-loader'\nThis is fixed in master on Github. I'll update the demo page in the next day or so.\nThanks for catching.\n. Implemented your change in the latest version of Lightbox on Github. Thanks @soyuka.\n. Good catch!\nI updated the screen.sass file which eventually compiles into screen.css. You can see the fix in place:\nhttp://lokeshdhakar.com/projects/lightbox2/#donate\n. Fixed in the latest code, check master branch on Github. I'll be updating the demo page in the next day or two. Thanks for catching this @nffdiogosilva.\n. I'm going to close this as there is the sass-convert command available for users who prefer the SCSS syntax. Though it is nice to have the css in multiple syntaxes ready to go, it's not worth the bit of extra overhead to maintain two different versions.\nThanks @danielsitek and @TheConstructor \n. Making edits to the Lightbox demo page now. Your comments have been noted. Thanks @tchalvak \n. Fixed in master branch. Thanks @outmanone.\nDoing some Github cleanup.\n. In v2.7.0 due out shortly I'm allowing the usage of the data-title attribute for generating the caption (as well as maintaining support for the title attribute) which will make it easier to embed links and other html in the caption.\n. @MOHS3N - Unclear about your question. Your best bet is to post your question on stackoverflow.com\nI'm reserving Github Issues for feature requests and bugs.\n. I'm avoiding embedding images in CSS as it might confuse some users who are unfamiliar with the practice and are looking to customize these images.\nI did move the reference to the loading and close images out of the javascript file and into the css. Preloading the image in css using the following technique:\nhttp://www.thecssninja.com/css/even-better-image-preloading-with-css2\nSee my commit:\n953badf\n. Everything here is great but I recently made the decision to move away from SASS and Coffeescript for Lightbox. It was a barrier to entry for many people.\n. Thank @XhmikosR!\nI'm working to get the rest of the issues resolved and PRs reviewed and put up a new version on the demo page today.\n. @XhmikosR - What tool are you using for image optimization? I need to introduce something into my normal dev workflow.\n. @XhmikosR - I was unfamiliar with jshintrc files. Sublimelinter supports them which makes me happy. Thanks for that and the other additions. \n. Thanks @Heleen. Your changes were merged in. I patched locally and then pushed up to github. I'll credit you in the Thank you section in the updated Readme. Going to get everything up later this evening.\nhttps://github.com/lokesh/lightbox2/commit/b2655b3ba926fa52d464ad9c7a3b7c2668589417\n. @mwasson - Thanks for the edits. I particularly appreciate your 'albumLabel' addition for its clarity. Merging PR.\n. In bad form, I merged before I tested locally. I have limited experience with package.json files and was unfamiliar with the custom 'scripts' actions. Not an excuse, still my bad.\nYour edits look good. Worked for me on local.\nJust curious, any difference between the following you are aware of or is it just a style preference:\ncoffee --compile --output ./js/ ./coffee/\nover:\ncoffee --compile --output js/ coffee/\n. Lots of these changes moved into master and part of next release. Will credit properly for the changes. :beers: \n. Works on mobile. If you see an issue on a certain mobile device please create a new issue with details on how to recreate that issue. Thanks.\n. Just pushed your fix to master. Thanks for noting the issue and sending the fix. Appreciated!\n. Lightbox is for images only. There are plenty of good alternatives that support html content.\n. Thanks.\nThis doesn't seem to affect newer versions of Firefox. I tested with the following versions:\n- OSX Firefox 25\n- OSX Firefox 26\n- Windows 7 Firefox 27\n. Fixed in latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. Unable to recreate any more. Closing.\n. Fixed: https://github.com/lokesh/lightbox2/commit/f8d4a10635f5a92f4af116a46512ab8ab798f8c9\nGrab the latest release, 2.7.0: http://lokeshdhakar.com/projects/lightbox2/\n. Fixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. There used to be a small FAQ and a forum as well. But both of those were difficult to maintain so I have offloaded everything to Stackoverflow.\nWith the exception of a Getting Started section and an Options table.\n. Since this is unlikely to be a common usage for the Lightbox script I'm going to close this Issue out as part of my Github Issues cleanup.\n. Adding the ability to display more than images is not on the roadmap for Lightbox2. Keeping the script simple. There are some great alternative scripts that allow yout to lightbox html content. Take a look at this discussion on Stackoverflow:\nhttp://stackoverflow.com/questions/4124561/simplest-jquery-lightbox-for-html-content\n. Fixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. Closing out old issues with no recent activity.\n. Unable to reproduce.\n. Closing. Unable to recreate any more.\n. Triggering a click is the nicest way at the moment.\nYou could also call lightbox.start(link). link being a jQuery wrapped anchor element.\n. This feature is not on the roadmap. Try an alternative script that supports SWFs:\nhttp://fancyapps.com/fancybox/\n. Please post support questions on Stackoverflow. Github Issues are for bugs and feature requests only.\n. Slow to get to this, but thanks for the PR. Your fix is great and I've dropped it in for an upcoming release. I'll give you credit.\n. Fixed: https://github.com/lokesh/lightbox2/commit/f8d4a10635f5a92f4af116a46512ab8ab798f8c9\nGrab the latest release, 2.7.0: http://lokeshdhakar.com/projects/lightbox2/\n. This feature is not on the roadmap. Check out alternatives:\nhttp://stackoverflow.com/questions/1361323/lightbox-to-show-videos-from-youtube-and-vimeo\n. As @thomaswarmington noted, trying using the simplified HTML5 doctype. I don't test Lightbox in IE7, so no guarantees there on if it will work.\n. Fixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. Fixed. Ended up using max-width: inherit;. Thanks.\n. The latest version of Lightbox, 2.7.1, makes it easier to add links in captions. An example:\njavascript\n<a href=\"img/image.jpg\" data-lightbox=\"example\" data-title=\"<a href='http://google.com'>Link to google</a>. More text.\">My image link</a>\nGrab the latest code: http://lokeshdhakar.com/projects/lightbox2/\n. Latest release, 2.7.0, has a new option: alwaysShowNavOnTouchDevices\nIt is set to false by default but toggle to true to make sure arrows always display when viewing image sets on touch devices.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n``` javascript\nvar LightboxOptions = (function() {\n    function LightboxOptions() {\n      this.fadeDuration                = 500;\n      this.fitImagesInViewport         = true;\n      this.resizeDuration              = 700;\n      this.positionFromTop             = 50;\n      this.showImageNumberLabel        = true;\n      this.alwaysShowNavOnTouchDevices = false;\n      this.wrapAround                  = false;\n    }\n```\n. Displaying non-image content is not on the roadmap for Lightbox. There are great alternative scripts that offer this.\n. Nice modification. But I don't think it has enough general purpose use for merging into master as the alt and title attributes should carry different data.\nhttp://www.wpromote.com/blog/seo/image-alt-vs-title-using-alt-title-attributes-in-image-tags/\n. Fixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. Manually merging in your fix into next version: 2.7.0\nThanks :+1: \n. This feature request is too far out of scope of Lightbox which is first and foremost for displaying images.\n. Doing some Github Issues cleanup.\nI'm unable to recreate this issue. If this problem still exists for anyone please post a link and I will reopen this issue and investigate. Thanks.\n. Unable to recreate this issue.\nDoing some Github clean up and closing this out. I'll reopen if the issue still exists. \n. Closing out old issues with no recent activity. I can reopen if needed.\nI'm working on a new major release, v3.0, and I'll be exploring the idea of visual navigation via thumbnails\n. Fixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. Specific issues are to be posted on http://stackoverflow.com. Github is for bugs only.\n. FYI...  the latest release, 2.7.0, has a new option:\n'alwaysShowNavOnTouchDevices'\nClosing this issue out.\n. Closing out old, inactive issues.\nI did this test the latest version of Lightbox in IE10 and was not able to reproduce any scrollbar issues.\n. Specific support questions are to be posted at stackoverflow.com\nCleaning up Github issues and closing this out.\n. Fixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. Specific support questions are to be posted at http://stackoverflow.com.\nCleaning up old Github issues.\n. Closing out old PRs that are now challenging to merge. There are some great ideas in this one.\nI'll be exploring touch interactions in detail in the next major release, v3.0. You can see some of the initial brainstorming in the Roadmap.. This is out of scope for the Lightbox script but perfect for others to fork and build. \n. Yes, this should have been closed. oops\nIf something more than the existing albumLabel option is required than I can reopen this issue.\n. Lightbox doesn't support your scenario out of the box.\n. Closing older, inactive issues.\n. I was slow to get to this, but this fix is going out with the next release. l'll give you credit. Thanks.\n. Fix noted. Thanks.\n. Fixed: https://github.com/lokesh/lightbox2/commit/f8d4a10635f5a92f4af116a46512ab8ab798f8c9\nGrab the latest release, 2.7.0: http://lokeshdhakar.com/projects/lightbox2/\n. I'm unable to recreate this issue. I'll reopen if more reports of this issue appear.\n. Done. :+1: \n. Specific support issues to be posted on http://stackoverflow.com/. Thanks.\n. It should wrap to the next line automatically. This is how it appears with a long caption in my test:\n\n. Closing out old PRs.\nI'll review the turbolinks req to see if it is still worthwhile. The change is minimal so I can get in.. This is an interesting feature but not a common enough request for a core feature in the script.\nClosing this issue as part of the Github project cleanup.\n. Lightbox works at narrow resolutions. If there is a specific responsive feature you are looking for, let me know.\n. Closing out old, inactive issues.\nI am investigating improvements for mobile layout and interaction. Nothing set yet.\n. Does this problem still exists on the demo page with the latest version of Chromium?\nwww.lokeshdhakar.com/projects/lightbox2/\n. @wb7 Thanks!\n. By default the wrapAround option is set to false. Set it to true to get the loop back behavior.\njavascript\nvar LightboxOptions = (function() {\n    function LightboxOptions() {\n      this.fadeDuration         = 500;\n      this.fitImagesInViewport  = true;\n      this.resizeDuration       = 700;\n      this.showImageNumberLabel = true;\n      this.wrapAround           = true;\n    }\n. Find this line in the javascript:\njavascript\n      // Position Lightbox\n      var top  = $window.scrollTop() + $window.height() / 10;\nReplace $window.height() / 10 with 50.\nI'm working on adding the position from top as a configuration options to make this edit easier. The change is available in the master branch:\nhttps://github.com/lokesh/lightbox2/commit/85b71780e9b37f5e4f8a5ea88cb62bdeb1092bf6\n. Specific support questions are to be posted at stackoverflow.com. Thanks.\n. The plan for Lightbox is to remain for images only. Keeping it simple.\nThere are many great Lightbox script alternatives that support displaying html content though.\n. Closing out old issues.\nI've taken note of the feedback regarding alt text and ARIA techniques. I'm working on a brand new version of the script, v3.0, and it will address accessibility issues from the start versus the current version which has mostly ignored them.\nSome of the accessibility issues I'm looking at:\n- Alt attributes.\n- ARIA roles.\n- Constrast ratios for type.\n- Keyboard inputs and tabbing.\n- Click/touch target size.\n. These features are out of scope of Lightbox which is dedicated to displaying images. There are plenty of alternative scripts that handle videos and html content in modals well.\n. I've added the ability to use the browser's native right-click to save the image in a commit today:\nhttps://github.com/lokesh/lightbox2/commit/363c3cb8af8fae1b6f95d6679df976022290f878\nIt'll be in the next release v2.9.0 coming out at the end of the weekend.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out inactive issues.\nLooks like the original problem was related to a conflict with retina.js script.. Oops. Nice catch.\n. This is going into the next version 2.7.0. I've switched back from Coffeescript to plain old Javascript so I'm unable to merge your code. I'll move the edits over manually and give you proper credit. Thanks @copycut \n. Thanks for the edit. I'm reviewing your changes and seeing if I can recreate the issue you were seeing.\nThe default width and height of 250px are used as a starting point for the Lightbox container to animate from towards the size of the image to show.\n. Closing out old PRs. This issue looks to have been fixed as no recent reports have been seen.. I am unable to recreate your reported issue. Can you post detailed steps to recreate this issue. \nThanks. I'll reopen at that time.\n. I attempted to recreate this issue in Windows 7 Internet Explorer 11.0.9431.0 with no luck. Can you post detailed steps to recreate if this issue still exists. I'll reopen this issue at that time. Thanks.\n. Please post specific support questions to stackoverflow.com. I'm using Github for feature requets and bugs. Thanks.\n. Fixed: https://github.com/lokesh/lightbox2/commit/f8d4a10635f5a92f4af116a46512ab8ab798f8c9\nGrab the latest release, 2.7.0: http://lokeshdhakar.com/projects/lightbox2/\n. Closing out old issues.\nUnfortunately, the Lightbox v2.x's API is very limited and there are no hooks for devs. I'm working on a new major release, v3.0, that looks to fix this. Thanks for the  feedback.\n. Fixed: https://github.com/lokesh/lightbox2/commit/f8d4a10635f5a92f4af116a46512ab8ab798f8c9\nGrab the latest release, 2.7.0: http://lokeshdhakar.com/projects/lightbox2/\n. Please post specific support questions at stackoverflow.com. Thanks.\n. Closing out old issues.\nThere was a bug in earlier versions of Lightbox that affected the width of images after the first. This has been resolved.\n. You're not going to be happy to hear this but there is no video support planned.\nThis is a common request so I've updated to the readme's roadmap to note this.\nhttps://github.com/lokesh/lightbox2#roadmap\nRoadmap\nActively being worked on\n\nMaintenance. Get open Issues and PRs number down.\n\nNot on the roadmap\n\nHTML or video content. The goal of the script from the start has been to provide a better image viewing experience and I am planning on staying focused on that vision. Don't worry though there are plenty of alternative scripts a google away for those who need HTML or video content support.\n\nv3.0 - In Brainstorming Phase\n. The latest version of Lightbox, 2.7.1, makes it easier to add links in captions. An example:\njavascript\n<a href=\"img/image.jpg\" data-lightbox=\"example\" data-title=\"<a href='http://google.com'>Link to google</a>. More text.\">My image link</a>\nGrab the latest code: http://lokeshdhakar.com/projects/lightbox2/\n. There are no plans for video support. Keeping it simple.\nTry one of the alternative lightbox scripts that support video or open-ended html.\n. Fixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. :+1: \n. You can now specify the caption with a data-title attribute or a title attribute.\nFixed in the latest release, 2.7.0.\nGrab it here: http://lokeshdhakar.com/projects/lightbox2/\n. There are no plans for video support. Keeping it simple.\nTry one of the alternative lightbox scripts that support video or open-ended html.\n. What @jimlongo56 said. You can change the structure of the html generated for Lightbox and style accordingly. Using CSS only without any HTML edits it is difficult.\n. Please post support questions to Stackoverflow. Instructions are available here:\nhttp://www.lokeshdhakar.com/projects/lightbox2/#help\n. @julcunen, does this problem still exist or did you find a solution? I'll reopen this issue if I can find a way to recreate. Thanks.\n. This is out of scope of script. Though there are many Wordpress specific 'lightbox' scripts.\n. I'm unable to recreate this issue. I'm testing in Chrome 33.0.1750.117.\nWas this issue occurring on the demo page? and if so, is it still reocurring?\nhttp://www.lokeshdhakar.com/projects/lightbox2/#help\n. The latest version of Lightbox, 2.7.1, makes it easier to add links in captions. An example:\njavascript\n<a href=\"img/image.jpg\" data-lightbox=\"example\" data-title=\"<a href='http://google.com'>Link to google</a>. More text.\">My image link</a>\nGlad Fancybox worked for you.\nhttp://lokeshdhakar.com/projects/lightbox2/\n. UMD support is in the latest version of Lightbox. \n. First click on the thumbnail opens Lightbox and the second one on the dark overlay closes it. This is the expected behavior. Don't worry, most users aren't double clicking in browsers.\n. By default the wrapAround option is set to false. Set it to true to get the loop back behavior.\njavascript\nvar LightboxOptions = (function() {\n    function LightboxOptions() {\n      this.fadeDuration         = 500;\n      this.fitImagesInViewport  = true;\n      this.resizeDuration       = 700;\n      this.showImageNumberLabel = true;\n      this.wrapAround           = true;\n    }\n. Fixed in latest.\nhttp://lokeshdhakar.com/projects/lightbox2/js/lightbox.min.js\n. Please post specific support questions on stackoverflow.com. Also, make sure to include the relevant code and a link to the page where the problem exists. Thanks!\n. This is not a common enough request for me to add an option to enable/disable preloading.\nThe change is simple though. Remove the following line in the showImage() method:\nthis.preloadNeighboringImages();\n. My original comment had a markdown syntax issue which made it unreadable. Sorry!\nHere is what I was trying to say for how to disable preloading:\n\nThe change is simple though. Remove the following line in the showImage() method:\nthis.preloadNeighboringImages();\n. I'm able to recreate this issue as well. I'm using Chrome v33.0.1750.152 in OSX. This is a tricky one. :bug: \n\nThe CSS values for the overlay at the start and end of the fade seem to be correct but Chrome sometimes does and sometimes doesn't render the element. Interestingly, I see this problem more often on my Macbook Pro w/Retina display versus my non-retina external display.\nIf you resize the window or have Developer Tools open and mouse over an element in the Elements panel the overlay will appear. I'm going to continue investigating this issue. If anyone makes progress, please post here. Thanks!\n. This might be related to be a Chrome browser bug. The reported bug and some discussion:\nhttps://code.google.com/p/chromium/issues/detail?id=345894\nhttps://github.com/dimsemenov/Magnific-Popup/issues/381\nA fix is in the Chrome nightlies and will hopefully appear in Chrome stable release soon.\nDoes someone have steps to recreate this issue consistently?\n. The latest version of Lightbox, 2.7.1, allows the use of the data-title attribute instead of the title attribute. Try this instead. For example, it is now easier to add links in captions:\njavascript\n<a href=\"img/image.jpg\" data-lightbox=\"example\" data-title=\"<a href='http://google.com'>Link to google</a>. More text.\">My image link</a>\nGrab the latest version from the demo page:\nhttp://lokeshdhakar.com/projects/lightbox2/\n. @mplax7 - Can you post a link so I can see the issue you are running into.\n. Please post specific support issues to http://stackoverflow.com. Make sure to post a link or the relevant code.\n. Please post specific support questions on http://stackoverflow.com. Make sure to include a link to the page where the problem exists. Thanks.\n. Closing out old issues.\nThere was a bug in earlier versions of Lightbox that affected the width of images after the first. This has been resolved.\n. Fixed in latest version: 2.7.0\nhttp://lokeshdhakar.com/projects/lightbox2/\n. Thanks for the fix!\nI manually dropped in your edits.\n``` javascript\n  // Enable anchor clicks in the injected caption html.\n  // Thanks Nate Wright for the fix. https://github.com/NateWr\n  if (typeof this.album[this.currentImageIndex].title !== 'undefined' && this.album[this.currentImageIndex].title !== \"\") {\n    this.$lightbox.find('.lb-caption')\n      .html(this.album[this.currentImageIndex].title)\n      .fadeIn('fast')\n      .find('a').on('click', function(event){\n        location.href = $(this).attr('href');\n      });\n  }\n\n```\n. Fixed: https://github.com/lokesh/lightbox2/commit/b65993ae19c33aa81cb6dc8c010aa0699a1ecffe\nGrab the latest version: http://lokeshdhakar.com/projects/lightbox2/\n. Thanks for the PR, unfortunately there was not enough interest in this feature to have it be brought into master.\n. I stand corrected. I found a couple of requests for this feature.\nI'll move this into master and queue up for release. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Old issue, but chiming in for any existing readers who might run across this.\nQuestion 1:\nalwaysShowNavOnTouchDevices option will keep the navigation visible on any device with touch support which include not only phones and tablets, but now some laptops.\nI'm working on a a full rewrite of Lightbox that adds better mobile and touch support with improved layouts and gestures. No date yet on this.\nQuestion 2:\nYou can edit with the navigation css (.lb-next, .lb-prev) to move the arrows off the image. You'll need to use absolute positioning for these items and make sure the clickable area for navigating still overlaps the image. \n. Closing out old, inactive issues. \nThere wasn't enough demand for this specific feature to bring it into the script.\n. Lightbox supports, and will continue to focus on displaying images only. There are some great alternatives that support other media including video.\nClosing out some old issues.\n. Closing out old, inactive issues. If there is still an issue with Lightbox that you are seeing, please note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nI think the horizontal layout issue with the overlay not covering the entire page was resolved some time ago. I can reopen this issue if anyone can recreate the problem. Thanks.\n. Closing out old, inactive issues.\nSorry this didn't get a response.\n. Old issue, but I wanted to note that this feature has been added to the script. Thanks.\n. This fix is in newer versions of Lightbox. Thanks.\n. Old issue, but this might still be happening. If anyone is able to reproduce this issue consistently can you post a link or the relevant code below. Once you do that I will reopen this issue. Thanks.\n. Looks like this issue was eventually resolved for everyone. I can reopen if needed. Thanks.\n. Closing out old issues.\nThis feature is in the works for the next major release, v3.0. Thanks for the feedback.\n. Closing out old, inactive issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\nI was not able to recreate this issue in the Android emulator. I just ordered an Android phone for testing. I hope to test again when it arrives in a couple of weeks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old, inactive issues.\nI can reopen if this is still of concern.\n. Old issue, but quickly chiming in.\nThere is no way to use the built-in options with lightbox2 to get the results you are looking over. To get what you want, you would need to collect the location and size of the thumbnails prior to making the overlay visible and adjust the size and position of it accordingly.\n. Closing out old, inactive issues. \nLet me know if there are any new or existing Lightbox issues and I can reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Closing out old issues.\nI'm in early stages of the next major iteration of the script, v3.0. I've taken note of the feedback and will be opening up the API to allow programatic opening/closing of component.\nIf you still need help with anything, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. :+1: \n. Closing out old, inactive issues.\nIf there are still issues or things you are trying to achieve with Lightbox, please note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf anyone is able to recreate this bug consistently still I will reopen the issue and investigate.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old issues.\nFYI... the latest version of Lightbox has an option called fitImagesInViewport which should meet the OPs requirements. It is set to true by default.\n. Reviewing Lightbox backlogged PRs and Issues.\nThanks for submission. At this point, I'm avoiding any IE8 or earlier specific code.\n. This is in the works for the next major release, v3.0. https://github.com/lokesh/lightbox2#v30---in-brainstorming-phase\n. This has been fixed. Thanks.\n. Old issue, but I want to chime in for others who might be looking for similar behavior.\nFind the following code in lightbox.js:\njs\n      var alwaysShowNav = false;\n      try {\n        document.createEvent('TouchEvent');\n        alwaysShowNav = (this.options.alwaysShowNavOnTouchDevices) ? true : false;\n      } catch (e) {}\nChange to:\njs\n      var alwaysShowNav = true;\n. Quickly chiming in on this old issue.\nThis is a nice-to-have but I will keep it the responsibility of the developer and not the script to catch broken image links.\n. Doing some overdue Github project cleanup.\nThat link above is handy. Updating the demo page. Thanks.\n. Old issue. But just noting that these changes are now in master. Thanks.\n. Closing out old issues.\nThanks for the help!\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old issues.\nIt is not possible at this time to make the image a link out-of-the-box.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Old issue, but just wanted to note that the latest version of Lightbox has a public option method that can be used for setting options. Same idea as you noted above.\nhttp://lokeshdhakar.com/projects/lightbox2/#options\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Lightbox still continues to support image loading only.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. This was fixed in later releases. Closing out this old issue.\n. Closing out old issues.\nFor the record, yes, Lightbox is not allowing complex content addition out-of-the-box and is remaining a streamlined image viewer. It will display captions and some navigational items, but not much else.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old, inactive issues. Please reopen with more details if appropriate.\n. Closing out old, inactive issues.\nFYI... there was a bug in earlier versions of Lightbox that affected the width of images after the first. This has since been resolved and might have been related.\n. Closing out old issues.\nNo auto-play available out of the box for Lightbox, sorry.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Closing out old, inactive issues. Please reopen with more details if appropriate.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old, inactive issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Old issue, but chiming in.\nThere was not enough interest in this feature to warrant it going into the script. For those people looking to add a print button, modify the html generated in Lightbox.build() to include a print link or button and have the event handler run window.print().\n. Closing out old, inactive issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf issue is still of interest, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues. I recommend using Tumblr's built in lightbox-esque features.\n. Old issue, but chiming in.\nThere are alternative scripts that allow you to show videos and html content. The plan is to keep Lightbox focused on displaying images and continue improving this experience. Thanks.\n. The plan is to keep Lightbox focused on displaying images and continue improving this experience. There are alternative scripts (ex. Shadowbox) that allow you to arbitrary html content.\n. Closing out old PRs.\nThere is a task related that is in-progress that will help with this usecase. Thanks.. Old issue. But for the record, an easier way to set options has since been added:\nlightbox.option({\n      'resizeDuration': 200,\n      'wrapAround': true\n    })\nhttp://lokeshdhakar.com/projects/lightbox2/#options\nThe API for the plugin is still limited and that is something I am hoping to open up in the next major release.\n. Closing out old PRs.\nThis improvement can likely be implemented with will-change now.\nhttps://developer.mozilla.org/en-US/docs/Web/CSS/will-change. Closing out old issues.\nRequiring an <a> tag was intentional for accessibility purposes.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old, inactive issues.\nIf this issue still persists, let me know and I will reopen and review. Thanks.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.. Closing out old issues.\nThe addition of thumbnails is out of scope for v2.x of Lightbox. I'll evaluate for the next major release though.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old issues but wanted to chime in real quick. I haven't seen examples of the Lightbox script modified for this feature. But it is an interesting idea. I'll take a look into it.\n. Closing out old, inactive issues.\nFYI, discussion on closing windows with Javascript. \nhttp://stackoverflow.com/questions/19761241/window-close-and-self-close-do-not-close-the-window-in-chrome\n. Closing out old issues. Using Github Issues for bugs only now. Thanks.\nI'll re-review UI performance when I begin working on the next major version of Lightbox v3 ( Roadmap).. This is being fixed now. All prior releases and the demo page were included in the Bower package previously. Oops.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. This has been fixed. Thanks.\n. Closing out old issues with no recent activity.\nQuick follow-up on the original questions:\n1- what is the browser compatibility? any fallbacks?\nhttp://lokeshdhakar.com/projects/lightbox2/#browser-support\n2- I'm trying to set \"positionFromTop\" in \"%\", but it doesn't seem to work. is that possible?\nOut-of-the-box you are limited to pixel values. Though as noted in the discussion above, you can make some edits to the script to allow percent values.\n3- is it also possible to move the \"close\" button to the top?\nYou can override with css but depending on the layout you are trying to achieve you might need to update the image positioning javascript code to account for this additional height.\n. Closing this issue as I have not heard any recent reports.\nIf you are still seeing it happen, please post a link and I will reopen this issue review. Thanks.\n. @Trost123 are you able to share a link so I can inspect the issue? Also, what browser are you using and which version of Lightbox. Thanks.\n. @Trost123 Try moving the loading of lightbox.css above the loading of lightbox.js. That should fix it.\nI'm making an update to the script in the next release so that you will be able to load these files in any order with out issue. Till then, try the above.\n. Closing out old issues.\nNo out-of-the-box solution for custom animations. But I am beginning work on a major new release, v3.0, and it will allow custom transition animations.\n. There are alternative scripts that allow you to show videos and html content. The plan is to keep Lightbox focused on displaying images and continue improving this experience. Thanks.\n. This change is in master. Thanks for sending months ago!\nhttps://github.com/lokesh/lightbox2/commit/892e3ed35bb8b26976ce9b66689628e85f19080c\n. I'll look into optionally allowing zooming of large images in the next major release, v3.0. Adding this feature-request to that milestone.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old, inactive issues. Please reopen with more details if appropriate.\n. Closing out old issues.\nFYI.. I'm working on a major overhaul of the mobile web experience of Lightbox in the next release, v3.0. Expect a lot more polish for mobile this time around!\n. Closing out old, inactive issues.\nI can reopen if this is still of interest for anyone.\n. Closing this PR as their are some conflicts now. But... the goal is still valid: to add an example showing a link inside of the data-title attr. I'm adding an example on the official homepage. Thanks.. Closing out old, inactive issues.\nRe: Feature 1\nI'm looking into adding animated transition between images. I'm particularly curious about panning that is triggered by touch based swiping gestures.\nRe: Feature 2\nWhen viewing a set of images the next image is preloaded behind the scenes.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old, inactive issues.\nThis request was a out of scope of the current roadmap for Lightbox unfortunately.\n. Closing out old, inactive issues.\nThis feature request was not general enough to warrant this feature being introduced into the script.\n. @chillichicken old question, but I wanted to chime in about the lighthouse on the cliff photo that is on the Lightbox2 demo page:\nhttp://lokeshdhakar.com/projects/lightbox2/\nIt is a lighthouse in Point Reyes California:\nhttps://www.google.com/search?q=point+reyes+lighthouse&safe=off&espv=2&biw=1152&bih=1174&source=lnms&tbm=isch&sa=X&ved=0CAcQ_AUoAmoVChMIpLHm4YWWxgIVjC6ICh1ttAxD\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. This feature is a great idea but the use case isn't general enough to be put into the main code path. Thanks.\n. Closing out old issues.\nLightbox fits images in the viewport by default. Set fitImagesInViewport option to false in lightbox.js if you'd like to show images at full size w/o any resizing.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Thanks @erezgreenberg\nI was able to recreate the issue as well by moving the lightbox.css loading after the lightbox.js script load and execution.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out this old issue.\nIt should have been resolved by https://github.com/lokesh/lightbox2/pull/280\n. Closing out old issues.\n. I've switched from $(window).width() to $(document).width()) in the latest master. I'm going to hold off on setting position: relative on the body tag is that could have adverse affects on the rest of the page for users.\nIn the next major release which is being planned I'm going to look a fresh look at mobile rendering.\n. These changes have all made their way into Lightbox.\n- jQuery is specified as a dependency.\n- Releases and the demo page have been removed from the repo and bower download.\n. Closing out old issues.\nSome info on the body:after. It is a hack for preloading the assets. Though this causes some issues in IE8, because of the waning usage of this browser I will not be making any changes to accommodate.\n. Thanks for submitting this PR quite some time ago. The feature is great, but there is not enough demand to make it into the main codepath. Closing. \n. Thanks @anvarulugov . I haven't used Wordpress in some time so I was not able to contribute to this discussion. If more Wordpress issues arise I will invest some time looking into them.\n. Closing out old issues.\nSorry this didn't get a response. For the record, if you wanted to add a line break to the count label then you would need to do two things:\n1. Add <br /> tag into your albumLabel string\n2. Replace the .text() call with .html() in the following line:\nthis.$lightbox.find('.lb-number').text(labelText).fadeIn('fast');\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. I am unable to reproduce this issue. Closing for now.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old issues.\nre: Opening image in lightbox in parent window from child iframe\nIn the next major release, v3.0, which is in early stages, I'm investigating expanding the API to allow you to choose an element where the Lightbox component will be placed. I have limited experience with iframes but I will test if the iframe document can reference an element upstream in a mannert like this: window.parent.document.getElementById('foo'); tbd\nIf you still need help in the meanwhile, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. This is being fixed now. The demo page and prior releases are being removed. Sorry!\n. This is fixed in master. Thanks.\n. Dupe of #233 \n. Same idea, executed differently.\nYou can now set options as such:\nlightbox.option({\n      'resizeDuration': 200,\n      'wrapAround': true\n    })\nhttp://lokeshdhakar.com/projects/lightbox2/#options\n. @jimmyangel \nhttp://lokeshdhakar.com/projects/lightbox2/#options\n. Thanks for PR. I'm avoiding server-side code in this project though.\n. Support for per-image alt attributes, separate from the title attr incoming in next release:\nhttps://github.com/lokesh/lightbox2/pull/609\nI'll close this issue once it is released.. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. @gitaarik this is being merged into master today. Sorry for delay.\n. lightbox.css was written with plain old CSS and only the demo/docs page used SASS to compile its CSS. This has now been made more clear as all SASS (along with the demo page) have been removed from the repo.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old PRs.\nA major new version of Lightbox, v3.0, is in the works and it will open up the API to give developers more control of initialization, opening, closing, options, and more. Though it is still generally discouraged to trigger lightbox from a natively non-clickable tag for accessibility reasons.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow.. Old issue, but I wanted to chime in. I have done some IE8 testing and have not been able to reproduce this issue.\nCan you post a link to the issue or the relevant code. I can reopen this issue then. Thanks.\n. Closing out old issues.\nNo auto-play available out-of-the-box, sorry.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Old issue, but I wanted to chime in quickly.\nThis is not a mistake. When an image is loaded with Lightbox, the 'prev' navigation width is 34% but the 'next' navigation width is 64%. Moving forward to the next image is the most common action and the click target for this is intentionally made wider.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help. Closing out old issues.\nOne point about titles/captions vs alt text. Alt text is used mainly for describing images to screen readers to help those with visual impairments and for SEO purposes. Title/Captions serve very different purposes. In most cases, you do not want to make visible your alt text as a caption. \n. Closing out old issues.\nI'm putting a roadmap for the next major release, v3.0, and I've noted your suggestions regarding the use of figure and figcaption. I'll review to see if that makes the most sense vs other semantic markup.\n. Closing out old issues.\nIn the roadmap for v3 is a complete rewrite with a focus on mobile.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Closing out old issues.\nThis definitely could be a real bug. I'm not planning any more work on the mobile web experience for version 2.x of the script so I'm going to let the bug stand if it exists as it is minor.\nI've made note of the issue though and I'll tackle it in v3.0 which I'm beginning work on. Thanks for reporting.\n. Chiming in a bit late. If issue is still relevant, can you clarify. I'm having a trouble understanding the request.\nOnce more details are provided I will reopen the issue and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. There are alternative scripts that allow you to show videos and html content. The plan is to keep Lightbox focused on displaying images and continue improving this experience. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. The 2.x versions of jQuery which Lightbox uses do not support IE8. \nI am working to remove the jQuery dependency from Lightbox and revert support for IE8 at that time.\n. I changed my mind on this. Until I remove the jQuery dependency, which may take a bit of time, I am going to switch back to an older version of jQuery that supports IE8. This reversion is now in master.\n. It's a hack but you can add a link that is empty to the page and then trigger a click on it via jQuery:\n```\n\n\n$('#img').trigger('click');\n\n```\nI'm planning out what features to put in to the next major release of Lightbox, v3.0, and I'll definitely be exposing more methods to devs to initialize, open, close, and configure the script.\n. All of the changes noted in this PR are in master.\nThx!\n. If you want to add a watermark directly to the image to prevent theft, rather than just something visually on top,it is possible using Javascript and the Canvas tag. Here is a script that does this: http://brianium.github.io/watermarkjs/\n. Fixed in https://github.com/lokesh/lightbox2/pull/280\n. I am unable to recreate this issue. Can you post a link to the issue or the relevant code below. Once you do that I will reopen and investigate. Thanks.\n. Closing out old issues.\nLightbox doesn't offer thumbnails out of the box so I'm guessing you're referring to a variant of this plugin.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. This issue is usually caused by an incorrect link to the image in the anchor tags href.\n. Closing out old issues.\nThere is not out of the box solution for vertical centering in the viewport but there are some tweaks you can make that will allow it. If anyone is curious, take a look at the discussion in this issue:\nhttps://github.com/lokesh/lightbox2/issues/172\n. An option has been added in the master branch: disableScrolling. It takes a slightly different approach than your PR in that it sets overflow: hidden on the <body> to prevent any scrolling while Lightbox is open. The option is disabled by default.\nThanks.\n. Old issue, but if anyone is still seeing an incorrect image count with Lightbox, please let me know and post relevant code or a link. Thanks.\n. Sorry, I do not have experience with Flash Slideshow Wizard.\nI am considering adding a slideshow/thumbnail tray into a future version of Lightbox which might meet your needs though.\n. Old issue, but I'm curious if this was ever resolved. If it wasn't, can you post a link to the issue or relevant code and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. The above suggestion will work. :+1: \n. Anything is possible! :-)\nI currently do not have plans to make a polymer Lightbox component.\n. It would be nice to use a vector format such as SVGs for the icons but downloading the entire Font Awesome icon set is not worth it for this script..\n. Closing out old issues.\nThanks @sjmogg for sharing your modification. Works great!\nI'm keeping social sharing buttons off the roadmap and out of the core script. The goal of this script from it's beginnings till today is to to provide a better image viewing experience. I'll let other talented folks add-on features outside the scope of this goal.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. In lightbox.js around line 20 there is an option that can be adjusted:\njs\n      this.fadeDuration = 500;\nThe value is in milliseconds.\n. Totally revamped mobile and touch experiences on the roadmap for v3. \n. There are alternative scripts that allow you to show videos and html content. The plan is to keep Lightbox focused on displaying images and continue improving this experience. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Need more details. Any examples?\nCurrently there is no left/right sliding in Lightbox nor is there an auto-playing slideshow. Keeping things simple!\n. There are alternative scripts that allow you to show videos and html content. The plan is to keep Lightbox focused on displaying images and continue improving this experience. Thanks.\n. There are no options built into Lightbox to help you with this feature request. To achieve this effect you could attach a mouseover event handler to the image containing div and switch the image to another image specified in a custom html attribute such as data-image-variant=\"lamp-on.jpg.\n. Old issue, but if this is still of concern. Can you post a screenshot. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. For anybody who might run across this issue, you can call lightbox.init() or lightbox.enable yourself.. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. This is not possible or in the current roadmap for Lightbox. Sorry, you'll need to tinker around with the Javascript code to make this sort of modification.\n. @tjsreece I had neglected my maintenance duties on this project. I'm reviewing PRs and Issues actively now to make up for this. Down to 148 issues. Progress!\n. The problem with this approach is that is will halve the image size for non-retina displays.\nA better angle would be to detect the DPI of the device and adjust the size of the image accordingly to match the pixels one to one. I'm going to look into this further for the next major release.\nThanks for submitting, appreciate it!\n. Can you post a link to a page where I can see the problem or all the relevant code below. Once you do that I will reopen this issue. Thanks.\n. Closing out old issues.\nThere is not out of the box solution for vertical centering in the viewport but there are some tweaks you can make that will allow it. If anyone is curious, take a look at the discussion in this issue:\nhttps://github.com/lokesh/lightbox2/issues/172\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. A disableScrolling option now existing to prevent page scrolling behind the Lightbox once it is open.\nhttps://github.com/lokesh/lightbox2/blob/master/src/js/lightbox.js#L52\n. Updated README.md with your suggestion. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. The link you posted does not work anymore. If this issue still exists, can you repost a link to the issue or all the relevant code below. Once you do that I will reopen. Thanks.\n. Given the following link on the page:\nhtml\n<a class=\"example-image-link\" href=\"images/demopage/image.jpg\" data-lightbox=\"example-set\">Example Link</a>\nYou can automatically start Lightbox once the DOM is loaded by running the following code:\n``` js\n$(function() {\n    lightbox.start($('.example-image-link'));\n});\n```\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.. Since this issue was reported earlier this year I have stripped much of the custom styling out of lightbox.css. The plugin does a better job of blending into to the existing page by utilizing existing fonts and colors.\nTo customize further, overwrite the rules in lightbox.css.\n. Were you able to resolve this issue? If not, can you post a link to the issue or the relevant code. Once you do that I will reopen and investigate. Thanks.\n. @msikio you can fix this by moving the other anchor tags that link to the images in the set below the anchor that is used to open up Lightbox.\n\nI can see why this is counter intuitive though. I will look to get an update in. Thanks.\n. You cannot rotate with Lightbox. This is something you should do with the images ahead of time in a graphics application.\n. @gshaxor this feature is not on the roadmap for Lightbox.\nIf you want to do it yourself I would add a another attribute to the image link, maybe data-rotate=\"90\", that you read with Javascript and use to apply a CSS transform. Goodluck!\n. @innerpeacelove can you post a link to a page where I can see the problem? Maybe you can create a jsfiddle or codepen example. I am unable to recreate the issue. Thanks.\n. @planetjordan can you post a link to the issue or all the relevant code below. Once you do that I will reopen. Thanks.\n. Learn something new every day. Thanks for the info on bower.json version property being not used.\nGetting the change into master today.\n. There are no plans for media support besides images in Lightbox. Sorry.\n. @f1roro can you post a link to the issue or all the relevant code below. Once you do that I will reopen. Thanks.\n. Given the following link on the page:\nhtml\n<a class=\"example-image-link\" href=\"images/demopage/image.jpg\" data-lightbox=\"example-set\">Example Link</a>\nYou can automatically start Lightbox once the DOM is loaded by running the following code:\n``` js\n$(function() {\n    lightbox.start($('.example-image-link'));\n});\n``\n. @idoshhh inlightbox.js`, find the following code which is around line 24:\nthis.wrapAround                  = false;\nSet this value to true.\n. Reviewing old issues.\nMy gut says this issue has to do with encoding and is not a Lightbox script problem, but I could definitely be wrong. If anyone is still seeing this issue and can post a link to a test case where I can investigate I will reopen. Thanks!\n. @Sonnyluu you have one link that you click to trigger the Lightbox. Make sure all the other image <a> tags are placed below that link in your html.\nHere is animated gif (2.4mb download) showing the fix:\nhttp://g.recordit.co/ZulvXHdBmj.gif\n. Re: rounded corners and opacity on overlay\nI was not able to recreate these issues. I tested in IE 11 and IE 9 on Windows 7 using Virtualbox emulation on OSX.\nRe: Incorrect version number in zip\nMy mistake!\n. I was unable to recreate this issue in Firefox 38 and 39 on OSX.\nAre you seeing this error still? Can you recreate it on the main Lightbox page? http://lokeshdhakar.com/projects/lightbox2/\n. This looks to be an issue with your demo site setup vs an actual bug. Let's move this isse to Stackoverflow from Github. Can you add a question on http://stackoverflow.com, make sure to add the lightbox2 tag.\nPlease include the following details in your question:\n- What version of Lightbox2 you are using\n- Information on which browsers and operating systems you have reproduced the bug on\n- Steps to reproduce the bug\n- A link to your production site where the bug is visible or all relevant HTML, CSS, and Javascript required to recreate the bug\nI'll look into it there and others can also help. Thanks.\n. @ADTC thanks for noting this. I'll try to reproduce the issue and update the Getting Start section accordingly.\n. @CrateMayne Thanks for testing Lightbox w/jQuery 1.9.\n@ADTC I investigated the minimum version jQuery requirement you asked about.\nLightbox 2.8.0 works with jQuery 1.7 and up. jQuery 1.7 introduced the .on() and .off() event APIs which are being utilized by Lightbox. http://blog.jquery.com/2011/11/03/jquery-1-7-released/\nI'm updating the main site (http://lokeshdhakar.com/projects/lightbox2/) to note the minimum jQuery requirements as well as adding a tip about loading the scripts at the bottom of the page.\nThanks for the feedback!\n.  @vtforester Thanks for catching this!\n. @mathishuettl \nInformation on how to get help: http://lokeshdhakar.com/projects/lightbox2/#help\nIf you post your question on Stackoverflow, make sure you provide the following information:\n- What version of Lightbox2 you are using\n- Information on which browsers and operating systems you have reproduced the bug on\n- Steps to reproduce the bug\n- A link to your production site where the bug is visible or all relevant HTML, CSS, and Javascript required to recreate the bug\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. Closing out old issues.\nAs far as package management goes, keeping things in sync with NPM and Bower is enough work. 😛 \n. It has since been added. \nbower.json\n\"dependencies\": {\n    \"jquery\": \"~2\"\n  }\n. Another user reported this issue. Their fix was related to the placement of the other images vs the link to activate Lightbox. See here:\nhttps://github.com/lokesh/lightbox2/issues/459\nIf that doesn't fix the issue, please do the following fdetails:\n- What version of Lightbox2 you are using\n- Information on which browsers and operating systems you have reproduced the bug on\n- Steps to reproduce the bug\n- A link to your production site where the bug is visible or all relevant HTML, CSS, and Javascript required to recreate the bug\n. The following is not valid HTML:\nhtml\n<a href=\"css/images/project1.jpg\" data-lightbox=\"projects\">\n    <a href=\"css/images/project2.jpg\" data-lightbox=\"projects\">\n        <a href=\"css/images/project3.jpg\" data-lightbox=\"projects\">\n            <div class=\"botonLink\">\n                <div class=\"buttonGo\">Link                  \n                </div>\n            </div>\n</a></a></a>\nYou cannot nest <a> tags inside of each other. Here is the error as reported by the W3C Validator:\n\nChange your code to the following:\nhtml\n<a href=\"css/images/project1.jpg\" data-lightbox=\"projects\">\n            <div class=\"botonLink\">\n                <div class=\"buttonGo\">Link                  \n                </div>\n            </div>\n<a/>\n<a href=\"css/images/project2.jpg\" data-lightbox=\"projects\"></a>\n<a href=\"css/images/project3.jpg\" data-lightbox=\"projects\"></a>\n. Merging. Thanks! :+1: \n. Closing out old issues.\nThere isn't an out-of-the-box solution for setting options per image or image set. I'm beginning work on a major revamp of the script, v3.0, which will allow setting options on the fly and potentially with html attributes. \n. I haven't heard any other recent reports of this IE11 issue. If anyone can recreate, please send a link and I will reopen this issue and investigate. Thanks!\n. Available on NPM...\nhttps://www.npmjs.com/package/lightbox2\n:ship: \n. Closing out old issues.\nI didn't see other similar reports so hopefully this was a one-off or was fixed by updates to the script over the past year+. Thanks for reporting.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. There are ways to solve this but since this linter rule isn't important for this project I will simple remove it. Thanks for catching.\nThe lint rule that was causing issue in \n```\n.jscrc\n\"validateLineBreaks\": \"LF\"\n```\n. Closing out old issues that have not seen recent activity.\nI'm happy to reopen if others are still seeing the issue and I will then investigate. Thanks.\n. Good catch!\nI've added a max-height: none; to the lightbox image css rule to override any max-height that was set outside the script.\n. @frankroch You can load the script in the head section and then call lightbox.init() manually after the images are added to the DOM.\nThis isn't clear at the moment. I'll look to adding some documentation. Thanks for the note!\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. I need more details on this one as I don't understand the note. Thanks.\n. This has since been fixed. Thanks for the original PR way, way back.\n. @r3wt I'm not adding new features except for some improved mobile interactions to Lightbox2. It is otherwise in maintenance mode.\nI am beginning to brainstorm what v3 would look like and providing event callbacks and other hooks for devs is definitely on the list.\nhttps://github.com/lokesh/lightbox2#v30---in-planning-phase\n. Thanks for catching this. Merging.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\nI did not test on a physical Android device in the past so this could have been, and could still be, a real issue.\n. I'm going to rename the option to disableScrolling but keep everything else. Thanks!\n. Sorry, no out-of-the-box way to do this. But I've added an item in the roadmap for version 3 to consider allowing placement inside of a specified element. Feature request noted.\n. Done!\nThanks for the nudge. \nhttps://www.npmjs.com/package/lightbox2\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Closing out old issues.\nLooks like the discussion has moved to StackOverflow. 👍 \n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Closing out old issues.\nI was never able to recreate this issue. 😕 \nThanks for reporting and submitting a PR to resolve the issue you were seeing.\n. This is an old PR that rewrites the CSS with SASS. I wanted to chime in on why it wasn't merged for anyone who comes across it in the future. For this project I've opted to keep the barrier for usage and outside development very low. So this means no precompilers. At one point I had switched to Coffeescript which caused significant confusion for those unfamiliar with it.\nAlso, at this point, SASS is making way for PostCSS. And with the minimal amount of CSS in the project, it isn't worth it IMHO.\nFor features like this that aren't on the roadmap I keep the PRs open so they are visible for others who might be interested in utilizing the code.. This has been fixed recently and will be in the next release v2.9.0 coming out in 2 days:\nhttps://github.com/lokesh/lightbox2/commit/7047214f77cfc8f892e8513426b57d45bf29e9cd\n. Looks like the linked jsfiddle does what you're looking for. The example could benefit from using css transforms to smooth out the animations but otherwise it works well!\nThis feature isn't requested enough to be in the main codebase though so I'm closing out this issue.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Closing out old issues.\nDidn't get enough interest in this feature so going to keep this outside of the scope of the project and let devs handle networking issues themselves.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. You are correct that the current version of Lightbox (v2.x) does the initialization automatically on loading the script. I'm planning out v3.0 now and it will give developers much more control about how and when the script is initialized. It is unlikely to be a jQuery plugin as I am exploring removing the jQuery dependency altogether.\nYour feedback has been noted in the README.md's v3.0 brainstorming section. Thanks!\n. This was intentional as most of the time you are moving forward. Thanks for the feedback though. Appreciated!\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nGood to see the situation resolved. Team work! 👍 \n. The concern about reducing excessive HTTP requests has been noted. Though this issue will be less of a concern HTTP/2, it is still a legitimate performance issue now. My plan for v3 of the script is to use inline svgs to solve this issue. Less requests and no additional dependencies.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nThanks.\n. Unable to recreate issue. Closing. I'll reopen if others can recreate.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Reviewing old issues.\nSince this issue was not reproducible on the demo site I am going to assume this is not a bug in the script but a conflict with the local set up. Though this could still be a legit bug; I have not heard similar reports.\nClosing for now. I can reopen if others reproduce and can isolate the issue.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\n. I love this idea! I'm planning out what features to put in to the next major release, v3.0, and I'll add this to the list.\n. Chiming in on this older issue.\nIf anyone else is seeing this issue they can call lightbox.enable() instead of lightbox.init(). The enable method attaches the click events to the newly added images but does not construct any new DOM elements to append to the page.\nIn the next release I'll be adding a code check to prevent the duplication of the DOM elements. Multiple init() calls will not cause any side effects.\nhttps://github.com/lokesh/lightbox2/pull/615. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. I'm closing this issue but keeping the following PR open:\nhttps://github.com/lokesh/lightbox2/pull/522\nFor v3 which is still in planning stages I will likely remove all JS deps.\n. The lack of original context/right-click menu to save images has always bugged me as well. I decided to investigate the issue today.\nThe way I solved it is to listen for right mouse button down event on the div on top of the image and then quickly set the pointer-events to none so that when the mouseup and right-click events do occur the div is not listening and the event continues bubbling down through to the image.\nFix is incoming in the next version.\n. https://github.com/lokesh/lightbox2/commit/363c3cb8af8fae1b6f95d6679df976022290f878\nChanges will go out in next release.\n. @teo1978 The solution I have added https://github.com/lokesh/lightbox2/commit/363c3cb8af8fae1b6f95d6679df976022290f878 is a bit of a hack but it works well for desktop users w/mice. It doesn't adversely affect mobile touch users.\nThe ideal desktop solution, also a bit of a hack, but cleaner, would be to have the nav items be small and matching the size of their icons. So right-clicking the nav items would show the contextmenu for the icons and right-clicking anywhere else on the image would show the image's contextmenu. Then a mousemove event listener would be added to the image and we would detect which section of the image the mouse pointer is on and then use that data to apply a class to a parent that would be used to show/hide the specific nav arrow as required. On clicking the image, we would also check the mouse pointer position so we can determine if the prev or next action should be executed.\nThe problem is that this would be a breaking change so I am not planning anything this drastic in v2.x.\n. I haven't seen or heard of any incompatibility issues with jQuery 3.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Take a look at this issue for some ideas how to vertically center Lightbox in the viewport:\nhttps://github.com/lokesh/lightbox2/issues/172\n. This was actually a case of flawed documentation. The aspect ratio is maintained if one of the max options is set. I've updated the options description as well as added a comment in the source javascript for clarity. Thanks for catching.\nhttp://lokeshdhakar.com/projects/lightbox2/#options\nhttps://github.com/lokesh/lightbox2/blob/master/src/js/lightbox.js#L307\n. Closing out old issues.\nOne point for the record:\nBreaking changes in non-major version bumps. Some history... Lightbox started before semantic versioning became the norm. When version 2 come out, it was a complete re-write, with a brand new feature set. It was branded as a Lightbox2. A new shiny thing. I am reserving major version bumps for these large branded changes. A couple of breaking changes did slip in during v2.x. But, I do not plan to make any more breaking changes till v3.\nFor fun, you can still take a peek at Version 1 here.\n. I appreciate all the discussion in this thread but I'm only keeping issues open that have actionable items as they are bug reports or feature requests.\n. @teo1978 just for you, I'm fixing it. It'll be in the next patch release. :-)\nThe enable and build methods required the body tag to be in the DOM. Simply delayed their execution till the document is ready.\n. Added a imageFadeDuration option. Incoming in v2.9.0:\nhttps://github.com/lokesh/lightbox2/commit/6d5f99a65f189a5d2bd7bbfac4682fe36e62871e\n. I agree with all of the above! It requires multiple css edits to customize a simple border.\nThe reason for this complication is that when you are navigating a set of images you want to keep this 'border' visible while at the same time fading in and out the images. This is the reason that the images weren't originally given a simple css border.\nHere is how it looks now:\n\nHere is what it would look like with the removal of the white background on the outer container and the addition of css borders on the images:\n\nWith some Javascript magic it would be possible to allow a user to simply set css borders on the images and have the transitions render as they do now. Or even simpler would be to add Javascript options for border controls. I have opted again these approaches for simplicity.\n. @teo1978 Thanks for all the feedback. Again, you bring up some really good points.\n\n\"...straw man. You just removed the background\"\n\nI agree. That comparison was done in haste. \nI'm testing some changes that would allow users to set the border directly on the image and would continue to support the previous 'padding to expose parent container bg hack':\nhttps://github.com/lokesh/lightbox2/commit/214361297f1dd5f0c19c1d80ff37c398cdda55cb\n. The Lightbox scripts were originally created in a desktop dominated world where mobile web usage was limited. And the lackluster mobile/touch experience shows that mobile was an after thought.\nI'm not planning any more work on the v2.x mobile web experience. Though I understand how this issue qualifies as usability issue if the dev creates a gallery and it is unclear to the user how to navigate between the images on mobile. I'm going to let it stand as is in v2.x.\nv3.0, which is in planning, will completely rethink the mobile experience. I'll be exploring gestural navigation for forward/prev navigation, tilt panning for panoramas, and making it clear visually that the image being viewed is part of a set, besides many other things.\n. By default the caption link should use the color that is set as your default a color.\n\nClosing as this is not a bug.\n. @eliz82 thanks for the follow-up and the details. You make some good points. I'll review solutions today.\n. Per your suggestions I'm updating the default link color in Lightbox captions. I'm defaulting to a light blue similar to the default blue link color:\n.lb-data .lb-caption a {\n  color: #4ae;\n}\n\nThanks again for all the feedback!\n. For help getting Lightbox up and running, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Thanks for the PR. This isn't common enough of a request to move into the main codebase but hopefully other glyphicon fans can utilize it.\nThe concern about reducing excessive HTTP requests has been noted. Though this issue will be less of a concern HTTP/2, it is still a legitimate performance issue now. My plan for v3 of the script is to use inline svgs to solve this issue. Less requests and no additional dependencies.\n. Cool interaction! This isn't common enough of a usecase to roll it into the main release but I'm going to keep this PR open so others can grab the code if they need it. Tested locally, worked!\n. I appreciate the security consideration but for now I will continue injecting the caption as html as Lightbox assumes it to be trusted data. If it is user submitted data via some other system outside of the script that could be malicious than I think it is fair to have the responsibility of sanitizing that data outside of the Lightbox script which is strictly for image display.\nAgain, thanks for the submission!\n. Was this issue in Mobile Chrome or the Android Browser?\nI'm going to close this issue as I am unable to recreate. But... I will reopen once someone else can recreate and provide details on their platform, browser, and lightbox version. Thanks!\n. Thanks for reporting the bug, and even more importantly, reporting a fix. For the time being, no new work for support any versions of IE below 9 are happening. The audience for these browsers is too small now.\nThanks again!\n. Put each image in their own set:\n<a href=\"images/image-2.jpg\" data-lightbox=\"set1\">Image #2</a>\n<a href=\"images/image-3.jpg\" data-lightbox=\"set2\">Image #3</a>\nFor future help getting Lightbox up and running, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. I am looking to improve the mobile viewing of wide photos. It is on the roadmap!\n. Hello -- \nFor dynamically added content, you'll need to run lightbox.init() after the content has been added.\nFor future help getting Lightbox up and running, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. I'm avoiding introducing new methods to Lightbox v2 but I am beginning to think about v3 which will expose many more API methods to allow things like reloading the component or making option modifications on the fly.\nThanks again for the submission. The need for this has been noted.\n. Sorry, there is no auto-play feature.\n. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help. Hi John,\nFor help getting Lightbox up and running, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nGithub Issues is for bugs only. Thanks.\n. Thanks for creating this non-breaking version which should be harmless to bring in to the lib. 👍 \n. You can use your own copy of jquery including v3.x with lightbox.js.\n. Thank you for reporting the bug but since IE 8's browser share has continued to shrink and Microsoft itself has discontinued support for the browser I am going to update the Lightbox browser support policy to drop IE 8. Sorry for the inconvenience but this will make maintenance and testing easier.\n. Closing out old issues.\nFeature request is reasonable but not something that will go into this version of the script.. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help\nUsing Github Issues for bugs only now. Thanks.. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help. Closing out old issues. \nIf anyone is still having the issue, please post a link to where the issue can be reviewed or relevant code. Thanks!. Closing out old issues.\nThis feature unfortunately never made it on the roadmap.. In older browsers selects would be visible through and the overlay div that is placed on top of the page to give it a dim appearance. This doesn't seem to be the case in modern browsers but I haven't had a chance to fully test across the board so I'll be leaving this check in for the time being as it isn't causing much harm.. Possible related: https://github.com/lokesh/lightbox2/issues/514. Feature coming in next release. Currently in dev branch:\nhttps://github.com/lokesh/lightbox2/pull/609. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. Closing out old issues. Hopefully everyone made progress on their issue.\n. Closing out old issues.\nUnfortunately this feature is not on the Roadmap.. Old issue. But I want to say, thank you for investigating.\nI have removed the offending code in a recent PR. The code was originally used as a hack for preloading images via CSS. This isn't necessary any more as the images are loaded once the lightbox markup is appended to the DOM which is on dom ready.\nPR: https://github.com/lokesh/lightbox2/pull/612. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. Glad this issue was sorted out. Closing. Thanks to everyone who helped. 👏. Sorry for delays. The problem as stated is correct, there is no simple way to add an alt attribute to the displayed image.\nI've instituted a fix which adds a new data-alt attribute on the link. This approach is preferable to populating the alt attr with the title as those two items are distinct.\n\ntitle should have supplemental info, for example a caption or credits.\nalt should have text that could replace the image. It is not meant for supplemental info and the alt attribute should not repeat info provided in the title attr or surrounding content.\n\nThe addition of the data-alt option is queued up in the dev branch and should be released soon.\nhttps://github.com/lokesh/lightbox2/pull/609\nThanks.\n. Work w/jQuery 2>. I have a pending change to update the bower.json jquery dep requirements:\nhttps://github.com/lokesh/lightbox2/pull/614\nre: this.options.albumLabel.replace is not a function\nThe albumLabel prop must be a String and not a Boolean. \n. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. Thanks for catching. Instead of fixing, I'm going to remove the browser prefixes for border-radius as Firefox has supported them w/o for a long time now.. I haven't heard any other reports of this issue in the past year. So closing it out.\nThanks for reporting.. Fix queued up in dev branch. I'll release this shortly.\nhttps://github.com/lokesh/lightbox2/pull/613. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. Closing out old issues.\nIf you still need help, please post your question on Stackoverflow. See more details here: http://lokeshdhakar.com/projects/lightbox2/#help. Closing out old issues.\nIf issue is still relevant, please make a note and I will reopen and investigate. Thanks.\nCan you post a link to the issue or the relevant code below. Once you do that I will reopen and investigate. Thanks.. Old issue. Still a problem? If so, please provide more details as this isn't enough to investigate. Thanks.. Fix queued up in dev branch. This will go out shortly. Sorry about that! \nPR: https://github.com/lokesh/lightbox2/pull/613. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. There is no way to move the Close/X unfortunately.\n. > 可以在点开图片的时候添加旋转按钮吗\n\n\n\"Can I add a spin button while opening a picture?\" \nFrom Google Translate.\n\n\nA spinner does exist now so this issue is unclear. Closing. Happy to re-open if more details are provided.. Yes, Lightbox works with jQuery v3.x. I just tested with v3.2.1. @carinp2 are you still seeing this issue?. Your proposal is much better than the current code. But after some testing, I noticed that preloading the images via CSS is altogether unnecessary. On DOM Ready the lightbox elements are appended to the body. Even though they are hidden with display: none, the images are loaded.\nhttps://github.com/lokesh/lightbox2/pull/612. Can you post a link to where I can see the issue? or can you post more of your code?\nI haven't seen this issue before and need more info to recreate and debug. I'll reopen this issue once more context is provided.. Closing this issue as the feature is not currently planned. I'll be exploring this when the next major version is worked on. See the API section of the doc:\nhttps://github.com/lokesh/lightbox2/blob/master/ROADMAP.md\n. Fix incoming in next release. Currently in dev branch. Thanks for reporting.\nhttps://github.com/lokesh/lightbox2/pull/611. Resolved: https://github.com/lokesh/lightbox2/releases/tag/v2.10.0. Hi @majkimajki ,\nThis is a perfect question for Stackoverflow.\nGithub Issues is for lightbox code bugs only. Thanks.\n. ",
    "julesjanssen": "ImageOptim. http://imageoptim.com/\nImageAlpha (http://pngmini.com/) possibly reduces the size even more. Have not tried that.\n. ",
    "XhmikosR": ":+1: \n. Is this still an issue? I tried with the latest CoffeeScript which is v1.4.0 at the moment and it seems to work fine.\n. :+1: \n. This should make things better, meaning less requests.\n. Looks good, I hope it can be added.\n. @lokesh: One can use http://spritegen.website-performance.org/ to quickly create the sprite.\nIn my opinion, this is a good improvement; -2 requests, -570 bytes for everyone that uses lightbox :)\nHere is my sprite, compressed and ready to use: \n\n. I already rebased the branch. You can reopen the PR and check the changes.\n. No problem, glad I could contribute something even if it's not real code changes :)\n. Just for reference  http://gtmetrix.com/compare/d78Q0Gqs/G6Pn5aDW\n. I believe you should use a pure JS implementation instead of a bat file. This way it will be cross platform.\nYou can use https://github.com/arturadib/shelljs.\n. If you know bash then you know shelljs already.\nShell scripts aren't cross platform without more dependencies.\nBut now that I think about it you can simply use npm scripts in package.json.\n. I think the scripts aren't needed anymore; the npm run solution is truly cross platform.\nThe docs are more than welcome, though.\n. Anything to make installing the dependencies easier, is good in my opinion.\nFeel free to extend the script in package.json.\nAlternatively, we can simply use shelljs to do anything we need to, if the scripts get more complex, without worrying for platform compatibility.\n. :+1: \n. I split the patches in two branches and I added JSHint support too.\n. @lokesh: For image optimization, I use PNGGauntlet which is using optipng, pngout and deflopt. Then I use zopfli-png which is using zopfli (it's very slow especially with --i1000) and one last pass with PNGGauntlet.\n. @lokesh: Did you try the solution before merging? I forced pushed my branch with a fix in the coffee command but it seems you missed it.\n. @lokesh: Now everything should be ok. Sorry for the stupid typo :)\n. Don't worry, we have all been there :P  \nTechnically, using ./ means look at the current dir only. Both would work, but I tend to use ./.\n. bump\n@lokesh: Would you like to add csslint support too?\n. ",
    "lekkerduidelijk": "Thanks a lot @sibprogrammer! This helped me out when using Modernizr. @lokesh should merge this in master.\n. ",
    "smoya": "Really thanks @sibprogrammer. \n+1 for this PR !!\n. ",
    "Bikket": "Grand merci @sibprogrammer.\n. ",
    "shawn-ortis": "Thanks!!! this works great!\n. ",
    "ajcw": "+1 Thanks a lot\n. +1 Same issue here\n. ",
    "hisuwh": "Thanks a lot for this fix\n. ",
    "ilyador": "Merged it into my fork and it gave me a small speed boost on mobile. thanx\n. I also merged it with @AugustusKling s branch replacing images and overlay functions with pure CSS and replacing all Id's with classes for better CSS practice.\nIf you don't want those changes or want to merge them separately you might want to use my earlier commits. (I'm new to git & github, so i'm not sure what should have been the best practice here)\n. ",
    "mblackford": "This is also necessary to use the library in WordPress themes. CSS images are automatically relative to the theme directory whereas JS images are not. It's a very simple change that would open the library up to a lot more people.\n. ",
    "TheConstructor": "One drawback when moving the reference to loading.gif and close.png into the css file is that the browser will request these images another bit later (after having fetched the JavaScript and the CSS).\nWhile it is true, that the user is able to scroll away the dialog it also means that the mobile experience gets worse when switching to location:fixed.\n@mblackford if you want to make sure the loading & close images are found regardless of the URL you can also edit the js according to https://github.com/lokesh/lightbox2/pull/25/files\n. Except that I would merge data-lightbox and data-lightbox-group so that data-lightbox=\"[value]\" triggers grouping for non-empty-values differing from \"lightbox\".\nOne could also argue to let the JavaScript handle new and old attributes so no-one needs to edit all their files.\n. Oh, it seems you deleted you fork. I added a pull-request for https://github.com/TheConstructor/lightbox2/tree/html5, but maybe you want to add a pull request for this onto the original repository instead.\n. Rebased and filed as #44\n. Thank you! Been to busy this weekend to rebase this.\n. So mobile users will propably never be able to see any image detail by zooming in, right?\n. Aren't SASS and SCSS files interpreted by the same engine and can be interchanged?\n. Did you use sass-convert as presented in http://sass-lang.com/docs/yardoc/file.SASS_REFERENCE.html#syntax or did you hand translate them?\nWhile I understand you prefer to have the same syntax for all files in your project, I would guess, that converting between scss and sass is easy and if the converter delivers usable results you can increases maintainability by using it.\n. Didn't want to learn something new for batching two commands.\nCan do a regular shell-script, if you like.\nNeed to add gem install compass to the documentation and maybe should transfer the whole description to some ReadMe\n. Currently npm run does not care for sass to css conversion right now. I guess this can be fixed, but wanted to mention.\nThe Ruby prerequisites could be provided through Bundler; if you're interested.\n. So, I did some ruby-things in #53 as sass seems to come that way. (Couldn't resist -.-)\n. Maybe you should do the second commit on a different branch so it is easier to integrate into the main branch.\nCherry-picking could help.\n. ",
    "AugustusKling": "It has been a while since I've proposed the change but if I recall correctly it was only a problem with CoffeeScript 1.1.1 but not with newer versions. I'm still in favour of doing the change because the semicolons don't serve a purpose other than breaking compatibility with older CoffeeScript versions.\n. ",
    "internetespecialista": "Can this loop function be added to the current lightbox-2.6.min.js ?\n. ",
    "kakysha": "Plus 1. In my project almost every photo is 1200px width and 900px height, but it is not scaled and the bottom part is cutoff( \n. ",
    "kevinkhill": "Plus 2, I am also having issues with images extending outside of the visible window space.\n. ",
    "ollie": "I'm also +1 for this. Why not use data-attribute(s) for HTML5 sites? Something like data-lightbox=\"true\" or data-lightbox=\"gallery-name\". Maybe it would be a good idea if it would be configurable somehow...\n. ",
    "b1rdex": "It's hardcoded for now.\n``` javascript\nLightbox.prototype.enable = function() {\n      var _this = this;\n      return $('body').on('click', 'a[rel^=lightbox], area[rel^=lightbox]', function(e) {\n        _this.start($(e.currentTarget));\n        return false;\n      });\n    };\n…\nLightbox.prototype.start = function($link) {\n…\nif ($link.attr('rel') === 'lightbox') {\n…\n_ref = $($link.prop(\"tagName\") + '[rel=\"' + $link.attr('rel') + '\"]');\n…\n}\n```\nAnd I think data-lightbox=\"true\" is not more semantic as rel so I'm -1 for this.\n. I'd prefer a class too.\nAnd I think ideal way is to define gallery using data- attribute.\n. ",
    "TheDutchCoder": "Well... rel stands for the relation of the source to it's destination, it has no place in a jQuery lightbox.\nI know this has been a popular way of doing things, like, 5 years ago, but that doesn't make it a good practice ;-)\nThere are more semantic alternatives to this, like an extra class or the HTML5 data- attributes (which were designed for things like this).\nI'd prefer a class, at it provides an easy hook for CSS as well and keep the selectors super easy and fast.\n. ",
    "adymorz": "Both sounds reasonable. I decided to use two differents attributes because the have two different purposes. Keeping the JS compatible to old attributes makes absolutely sense.\n. ",
    "chan-man": "I made the arrows sprites on my lightbox 2 and it blinks for some reason but it doesn't bother me. Here is the image:\n\nHere is the code:\n.lb-prev:hover, .lb-next:hover {\nbackground: url(../images/sprite.png) no-repeat;\n} \n/* line 81, ../sass/lightbox.sass */\n.lb-prev:hover {\n  background-position: -0px -0px;\n  width: 50px;\n  height: 45px;\n  margin: 48% 0 0 3%;\n}\n/* line 85, ../sass/lightbox.sass */\n.lb-next:hover {\n  background-position: -61px -0px;\n  width: 50px;\n  height: 45px;\n  margin: 48% 0 0 3%;\n}\n. I hope it can be added to, I think it just makes things a bit cleaner.\n. Why not go ahead and turn the images into sprites while your working on the arrows? Issue #19 \n. ",
    "Galacticstarkiller": "I had this bug recently. I reloaded my browser in incognito mode and the issue went away for the next and previous buttons. The close button continued to open a new tab. I was forced to remove the 'X' close button. Since I've gotten lightbox to work the close button has had the open tab problem. I feel the next and previous button issue could have been a cached version stuck in the browser.. ",
    "ricain": "Hi,\nThank for this but it does not work in the last version of Lightbox (v5.51) because the sizeContainer function is not the same: Lightbox.prototype.sizeContainer = function(imageWidth, imageHeight) {}\nCan you take a look at it please?\nthank\n. Why this image appears stretched? \nhttp://faktura72.ru/Portals/10/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA%2025.JPG?timestamp=1397556395440\nI think this is a problem with your links, not this script.\n. Example:\nhttp://jmercadier.fr/horizontal-example/\n. ",
    "sarvaje": "I found where is the problem, and there are some issues:\nFirst, compas, when use opacity mixing, it create the css property: filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=85);\nThis work fine only if you don't need animate the opacity with jquery.\nThe solution is replace this property by: filter: Alpha(Opacity=85).\nAnyway, Yo need update the jquery version (I test with 1.10).\nI don't create a pull request, because the origin of the problem is on compass, not in lightbox library\n. ",
    "WaNgeL-SaTaR": "I think you should use http://twitter.github.com/bootstrap/javascript.html#modals .\n. You should modify \"lightbox.js\" for this usage. Но я думаю что это будет костыль =) Так что проще подключить еще один плагин.\n. ",
    "beshur": "Thank you for reply, WaNgeL-SaTaR.\nI know there are ways to display HTML content in a pop-up, but I was interested if there is one with the Lightbox, because I already have it in use on the web-site and don't want to add other libraries.\n. Thank you for reply.\nБез костыля уж лучше руками это сделать) Заготовки есть для поп-апов.\n. ",
    "hltbra": "Great idea. This issue also bothers me. Please merge it!\n. ",
    "danielsitek": "I second that :)\n. Yes they are. But SASS is using different syntax, that not everyone can like or want to use. Just like me, I'm writing all styling files in SCSS, so I would have it much rather in proper SCSS too.\n. Speaking about something you didn't look at, hmm? :) \nI did it by myself, I didn't use sass-convert.\nI believe I did a piece of good work and I would like to share it with the others. Somebody may find it handy.\nIf you don't like it, ok :)\n. ",
    "tonypine": "I didn't know that this plugin has mobile support. You right, this is a problem, I did haven't think about it, I was focused on desktop users. I will try to extend support for mobile.\n. ",
    "VSEphpbb": "@fernandosavio\n$obj.attr('...') is not deprecated in jQuery 1.9\nThis script is using it correctly, to get the actual values of attributes. What is deprecated is using attr() to get property values (of form elements, for example) in which case prop() and val() are required now.\nBut to get element titles, ids, href and rel attributes, as this MOD does, $obj.attr('...') is still the correct way to do it.\nReference:\nhttps://github.com/jquery/jquery-migrate/blob/master/warnings.md#jqmigrate-property-based-jqueryfnattrvalue-is-deprecated\nhttp://api.jquery.com/attr/\n. ",
    "fernandosavio": "@VSEphpbb\nYou're right, 'tagName' is the only propertie that the script access.. the others are attributes..\nSorry..\n. @haiecapique\nYes, \nI did it, and it works on 1.9.0...\n. ",
    "kamicoder": "So we just need to change \"the way you create de DOM Elements\" ?\n. Thanks, it's work.\nBut I don't know coffeescript too...\n. ",
    "dmethvin": "The specific problem with the original code is the use of .after() on disconnected elements:\nhttp://jquery.com/upgrade-guide/1.9/#after-before-and-replacewith-with-disconnected-nodes\nUsing an HTML string is definitely a cleaner way to create that much markup. \n. ",
    "careilly": "I've done a fork (https://github.com/careilly/lightbox2) that incorporates those changes.\nPull request sent.\n. Great!\nColman\nOn 21 Feb 2013, at 05:16, dorthrithil notifications@github.com wrote:\n\nthanks bro! works fine now.\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "dorthrithil": "thanks bro! works fine now.\n. ",
    "lemingos": "Thanks a lot!\n. ",
    "StevenEWright": "+1\n. ",
    "Abijeet": "Thank you! This helped. For folks still confused just copy  \"the way you create the DOM Elements\" part!\n. ",
    "Bartinger": "It to me a day to figure this out :/ Thanks\n. ",
    "Nymoda": "All i made to make it work is...\nOn line 44, deleted '$, ' so the line look like :\njavascript\nvar Lightbox, LightboxOptions;\nCleared line 46 : \njavascript\n$ = jQuery;\nLine 344, changed to:\njavascript\n$(document).ready(function(){\nAnd apply the part two of the main post as fernandosavio greatfully shared with us!\nand it worked for me!\nThanks!\n. ",
    "anais1477": "Thank you very much ! \nFinally I had to change the DOM as fernandosavio adviced. \nThen i did what Nymoda said. \nAnd it works fine with jQuery 1.9- now =)\n. ",
    "eflorit": "Only the second part of fernandosavio's post is needed to make it work. Thank you.\n. ",
    "ryabenko-pro": "Thank you! My brain is saved.\n. ",
    "gongiskhan": "Hey, just wanna say thanks. Had a deadline tomorrow and your post will allow me to actually deliver on time!\n. ",
    "joe44850": "THANK YOU. Worked like a charm. \n. ",
    "becdetat": "This seems to work well except for the #lightbox img { width: 100%; height: 100% }. In Chrome 25 and IE 10 the bottom border isn't correct. Reverting the 100% to auto seems to work. Note that I'm only trying this using the compiled JS, not from source.\n. ",
    "bentleyo": "Unfortunately the script failed for me because of the return on line 81. I fixed it by simply removing the return keyword. Thanks for the contribution!\nhttps://github.com/careilly/lightbox2/blob/89e6994c592812848a86b655ad0c6a0d0732de8b/js/lightbox.js#L81\n. ",
    "jphellemons": "Thanks @careilly and @Bentleyo you two fixed the incompatibility of lightbox with jQuery 1.9!\n. my ie11 does display lightbox, but on the left instead of center of screen and no text sliding down below the image....\n. Hi dwwebster00, I have verified that there is no js error. The jQuery works on the website. It seems that the div with id lightbox has left: 0px.\nnever mind. this only occurred local with vs2013 and iisexpress. it runs fine on the production server iis. \n. ",
    "alex88": "Will never be merged?\n. ",
    "Chaser324": "Thanks a lot @careilly for the fix! It would be awesome to get this and any other completed fixes merged in so that people don't have to drill into here to find it.\n. ",
    "gertjanjansen": "Thanks for the fix! Why won't this be merged?\n. ",
    "hiwanz": "i have pushed one commit to fix this issue,but not merged yet\n. only the authorized person can merge it into the master branch,you can follow https://github.com/hiwanz/lightbox2/commit/48698dc406270fac8e4404a5a9280e9b526ae8f0 this link to check the change,it's a simple code that you can add it to yours by yourself\n. ",
    "nffdiogosilva": "Can you merge then? ^^\nI'm not familiar with this process, since you're not the repository author, i guess you need to make a pull request.\nHow can i get access to your commit?\n. I appreciate your time. Thank you\n. Glad i could help ;)\n. ",
    "Heleen": "The fix code I added in this issue was mathematically incorrect, something I realised today.\nI've submitted a pull request with the correct code: https://github.com/lokesh/lightbox2/pull/49\nSorry for the mess.\n. ",
    "raducretu": "Managed to solve it. Just add this to the css.\n.lb-image{\n    max-width: inherit;\n}\nbootstrap has default img max-width to 100% and for some reason lightbox stops resizing.\nAlso if you want i replaced all icons with FontAwesome icons, i can pass the css file if you are interested\n. ",
    "ghost": "Hi Lokesh,\nDon´t know on wich version you´ve applied the fix, but it´s not in the CSS included in v 2.6 on the download from your website - maybe not copied?\n@kiballion: Thanks for the fix!\nThe problem with that fix: It´s not responsive any more - images don´t stlye properly on mobile devices any more (tried on my iPhone 4). Before the update of the css it worked fine. I added it with a media query now:\n// For devices with min-resolution of 980px (desktops)\n// Thats necessary to avoid an image resizing bug which appears with lightbox v2 when it´s used together with bootstrap\n// --------------------------------------------------\n@media (min-width: 980px) {\n  .lightbox .lb-image {\n    max-width: inherit;\n  }\n}\nMichael\n. You´ll have the image resizing problem as described by Kiballion above when using max-width: none...\n. @bendolan epic solution. I can't believe I didn't find this sooner. Talk about right under your nose!  Much appreciated!\n. BIG THANKS\n. Haven't the time to find out why, but i can confirm that issue.\n. <img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAP///wAAACH5BAEAAAAALAAAAAABAAEAAAICRAEAOw==\" class=\"lb-image\" - missing alternative text alt=\"\".\n<a href=\"\" class=\"lb-prev\" </a - no text\n<a href=\"\" class=\"lb-next\" </a - no text\nScreen reader problems.\n. I had the same issue. If you go into the lightbox js file and search for title, you will find the title attribute and it will have title in quotes, basically grabbing from the HTML and using that. I changed that to caption and I changed the text on my images from title to caption so the HTML tooltip doesn't register it and won't display.\n. Try importing the \"lightbox.css\" before importing the JS, if you are not already doing so.\n. Yes, please realize this! +1\nHere is a full working demo:\nhttp://www.rudirakete.de/rudirakete/main#2008-10-5-1526107735\n. Error solved !!!\nI have deleted the first part of the code (.css ; .js) from my php index page.\nNow I have the code only at my page where my images for the lightbox are.\n. the same problem was with me but i relised that when some one open the categoriy it showing 10 thumbs with 200x50 images thumb, what was i wrong doing is putting the thumb iamge path in <a href=\"\" so i just chnge the path to full images in the link href and the issue is resolved\n. Having the same issue, did you work out what it was?\n. My problem was I was leaving the href=\"#\" on the a-tag as I didn't see the point for it, once this was added it worked :) Doh\n. I have the same issue!. ",
    "j0ch3": "To make it responsive again, just add max-width: none; instead of max-width: inherit;\nThats the default value. I run it with max-width: none; at my project and it's responsive.\nAlso i don't recognized any additional issues until now by adding max-width: none;\n. ",
    "TaleTN": "I guess this issue is about the overlay not having any opacity in IE7/8 (thus by default showing a black background). If so, then this can indeed be fixed by specifying -ms-filter (and filter and opacity) like this:\ndiff\ndiff --git a/css/lightbox.css b/css/lightbox.css\nindex cc4db10..b12f0eb 100644\n--- a/css/lightbox.css\n+++ b/css/lightbox.css\n@@ -11,7 +11,8 @@ body:after {\n   left: 0;\n   z-index: 9999;\n   background-color: black;\n-  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=80);\n+  -ms-filter: \"progid:DXImageTransform.Microsoft.Alpha(Opacity=80)\";\n+  filter: Alpha(Opacity=80);\n   opacity: 0.8;\n   display: none;\n }\n@@ -121,7 +122,8 @@ body:after {\n .lb-prev {\n   left: 0;\n   float: left;\n-  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=0);\n+  -ms-filter: \"progid:DXImageTransform.Microsoft.Alpha(Opacity=0)\";\n+  filter: Alpha(Opacity=0);\n   opacity: 0;\n   -webkit-transition: opacity 0.6s;\n   -moz-transition: opacity 0.6s;\n@@ -130,7 +132,8 @@ body:after {\n }\n /* line 90, ../sass/lightbox.sass */\n .lb-prev:hover {\n-  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=100);\n+  -ms-filter: \"progid:DXImageTransform.Microsoft.Alpha(Opacity=100)\";\n+  filter: Alpha(Opacity=100);\n   opacity: 1;\n   background: url(../img/prev.png) left 48% no-repeat;\n }\n@@ -139,7 +142,8 @@ body:after {\n .lb-next {\n   right: 0;\n   float: right;\n-  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=0);\n+  -ms-filter: \"progid:DXImageTransform.Microsoft.Alpha(Opacity=0)\";\n+  filter: Alpha(Opacity=0);\n   opacity: 0;\n   -webkit-transition: opacity 0.6s;\n   -moz-transition: opacity 0.6s;\n@@ -148,7 +152,8 @@ body:after {\n }\n /* line 99, ../sass/lightbox.sass */\n .lb-next:hover {\n-  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=100);\n+  -ms-filter: \"progid:DXImageTransform.Microsoft.Alpha(Opacity=100)\";\n+  filter: Alpha(Opacity=100);\n   opacity: 1;\n   background: url(../img/next.png) right 48% no-repeat;\n }\n@@ -208,7 +213,8 @@ body:after {\n   background: url(../img/close.png) top right no-repeat;\n   text-align: right;\n   outline: none;\n-  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=70);\n+  -ms-filter: \"progid:DXImageTransform.Microsoft.Alpha(Opacity=70)\";\n+  filter: Alpha(Opacity=70);\n   opacity: 0.7;\n   -webkit-transition: opacity 0.2s;\n   -moz-transition: opacity 0.2s;\n@@ -218,6 +224,7 @@ body:after {\n /* line 138, ../sass/lightbox.sass */\n .lb-data .lb-close:hover {\n   cursor: pointer;\n-  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=100);\n+  -ms-filter: \"progid:DXImageTransform.Microsoft.Alpha(Opacity=100)\";\n+  filter: Alpha(Opacity=100);\n   opacity: 1;\n }\n. Here is how I fixed it by moving the previous/next background declarations:\n``` diff\ndiff --git a/css/lightbox.css b/css/lightbox.css\nindex cc4db10..f744109 100644\n--- a/css/lightbox.css\n+++ b/css/lightbox.css\n@@ -127,12 +127,12 @@ body:after {\n   -moz-transition: opacity 0.6s;\n   -o-transition: opacity 0.6s;\n   transition: opacity 0.6s;\n+  background: url(../img/prev.png) left 48% no-repeat;\n }\n / line 90, ../sass/lightbox.sass /\n .lb-prev:hover {\n   filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=100);\n   opacity: 1;\n-  background: url(../img/prev.png) left 48% no-repeat;\n }\n/ line 94, ../sass/lightbox.sass /\n@@ -145,12 +145,12 @@ body:after {\n   -moz-transition: opacity 0.6s;\n   -o-transition: opacity 0.6s;\n   transition: opacity 0.6s;\n+  background: url(../img/next.png) right 48% no-repeat;\n }\n / line 99, ../sass/lightbox.sass /\n .lb-next:hover {\n   filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=100);\n   opacity: 1;\n-  background: url(../img/next.png) right 48% no-repeat;\n }\n/ line 103, ../sass/lightbox.sass /\n```\n. Don't you mean a horizontal (left to right) scrollbar? If so, then yeah, I also get that in IE10 (on Windows 7 Pro), with my own websites as well as the Lightbox 2 website.\nI have a fix for it, which simply hides the horizontal scrollbar while viewing an image in the lightbox. This may not work for all websites, but (thusfar) it seems to work fine for mine (especially since there shouldn't be a horizontal scrollbar anyway).\n``` diff\ndiff --git a/js/lightbox.js b/js/lightbox.js\nindex 3da927b..117fd69 100644\n--- a/js/lightbox.js\n+++ b/js/lightbox.js\n@@ -13,7 +13,7 @@ Licensed under the Creative Commons Attribution 2.5 License - http://creativecom\n(function() {\n-  var $, Lightbox, LightboxOptions;\n+  var $, Lightbox, LightboxOptions, orgOverflowX = '';\n$ = jQuery;\n@@ -199,6 +199,10 @@ Licensed under the Creative Commons Attribution 2.5 License - http://creativecom\n     };\n Lightbox.prototype.sizeOverlay = function() {\n\n\nif (!orgOverflowX) {\norgOverflowX = $('body').css('overflowX');\n}\n$('body').css('overflowX', 'hidden');\n       return $('#lightboxOverlay').width($(document).width()).height($(document).height());\n     };\n\n@@ -307,6 +311,12 @@ Licensed under the Creative Commons Attribution 2.5 License - http://creativecom\n       $(window).off(\"resize\", this.sizeOverlay);\n       this.$lightbox.fadeOut(this.options.fadeDuration);\n       this.$overlay.fadeOut(this.options.fadeDuration);\n+      setTimeout(function() {\n+        if (orgOverflowX) {\n+          $('body').css('overflowX', orgOverflowX);\n+          orgOverflowX = '';\n+        }\n+      }, this.options.fadeDuration);\n       return $('select, object, embed').css({\n         visibility: \"visible\"\n       });\n```\n. ",
    "thelfensdrfer": "Same problem for me. Ubuntu 13.04 with Chrome, but with the fix it is working.\n. ",
    "sphericalhorse": "Same problem for me. Ubuntu 13.04 with Chrome.\n. ",
    "johangirod": "Same here, although I'm using firefox 22.0 on windows 7. The fix worked for me. \n. ",
    "deadosaurus": "Same here, Firefox and Windows 8.\n. ",
    "yangshun": "thanks, this works for me. you're a saver!\n. ",
    "momoteRyanmt": "+1, fixed the same issue in firefox/OSX but i do end up with a side scrollbar for some reason\n. ",
    "RhinonMike": "Looks like you found the same problem as me. I was submitting a bug at the same time you entered yours.\n. ",
    "Maciejos": "Maybe we are the only one still using IE :P\n. ",
    "vinceg241": "I had the same problem - Ran fine on Chrome & Firefox, but not in IE10. I loaded the latest code from LB 2.6 and it now works fine in preview on IE10 on my desktop, but not from my hosting server on IE10. Works fine on Chrome & FireFox.. http://www.confectionarydesigns.com/testimonials.htm\n. I have the same problem, plus.....\nIt started when I loaded LB 2.6 to correct a problem with IE10, where the LB failed to appear, and sent you to a plain browser page with the image. The new code corrected that problem, but now it doesn't work in IE9. No problems with Chrome or FireFox....\n. @propi....\nYour changes fix the nav arrow problem.... Thank you.\nStill have the problem of LB not working on IE10, but is working on Chrome & FireFox.\nSee images below of IE10 results & Chrome results:\nhttp://www.confectionarydesigns.com/testimonials.htm\n(first image in the list)\n\n\n. @Jnwebsite \nRecoded for LB 2.6 and no longer have issues with IE10, Chrome or FF...\nStill have the same issues with IE9, and have received no help from this forum moderators.....\n. @Jnwebsite \nThanks for this.... Will give it a try...\nvince g.\n. Update on this issue.....\nRewrote http://www.confectionarydesigns.com/TestLB2.htm\nand loaded to server.\nIE10 still shows no image or navigation;\nChrome works perfectly;\nFireFox works partially, but shrinks the \"lb-outerContainer\" for some reason....\nHelp is appreciated...\nThanks,\nvinceg\n. @ dossy\nThanks for the post....\nI reloaded the code from LB 2.6 and recoded the image tags.... it now works on IE10, Firefox & Chrome.\nThe strange thing is that the code that works on IE10 does not seem to work on IE9.\nTake a look at http://www.confectionarydesigns.com/testimonials.htm\nand http://www.confectionarydesigns.com/WelcomeBaby.htm\nif you have the time, and let me know what results you see with each browser.\nAnd thanks again for the post\nvinceg\n. @dossy \nThanks again for the post.... Changed WelcomeBaby as you suggested, but the Testimonials page was fine.\nStill having the problem with IE9, but not with IE10, Chrome or Firefox....\nvinceg\n. @kay0007 \nThanks for the post. Will give this a try to see if it helps with IE9, but as I mentioned, I no longer have a problem with IE10, Chrome or Firefox.\nvinceg\n. To all the folks who responded, Thanks! I'm closing this topic, and opening one for IE9.\nvinceg\n. No responses - still have the issue....\n. @davidmoninger ....\nOn the road right now, but will give it a try when I get back....\nMuch appreciated....\nvince g\n. I have the same problem..... 2.6 works perfectly on Chrome & FFox, does not work at all on IE10, either as single image or as a picture set....\nCan anyone let me know specifically how to unblock scripts and ActiveX on IE10?\nWent thru the Internet Options and checked/unchecked what appeared to be appropriate boxes, but still have problem.\nBTW, this was working fine until one of the auto updates for IE10 was applied....\nThanks to all...\nvinceg\n. This issue is all over the place, but seems to be resolved for me.... Just updated to IE11, and everything works fine... Also on Chrome 30, & FireFox 22, and they work as well. Hard to know what happened in IE10..... So far, IE 11 works OK using default Security settings.... Thanks to all for all the help....\nvince g\n. ",
    "John1000": "Demo Works great in FF. I am also using IE 9 and the page jumps left and right when using the arrow keys.\nNext and previous buttons are missing?\nCan anybody help with this?\n. First thing i would try is adding a default css page which zero's browser settings (place this link first in line like this:\n\nI find that 2.6 works well in all browsers!\nCopy the following code and save the file as: default.css (place the file in the css folder)\nhtml,body,div,dl,dt,dd,ul,ol,li,h1,h2,h3,h4,h5,h6,\npre,form,fieldset,input,textarea,p,blockquote,th,td { \n        margin:0;\n        padding:0;\n    border:0;\n    }\ntable {\n        border-collapse:collapse;\n        border-spacing:0;\n    }\nfieldset,img { \n        border:0;\n    }\naddress,caption,cite,code,dfn,em,strong,th,var {\n        font-style:normal;\n        font-weight:normal;\n    }\nol,ul {\n        list-style:none;\n    }\ncaption,th {\n        text-align:left;\n    }\nh1,h2,h3,h4,h5,h6 {\n        font-size:100%;\n        font-weight:normal;\n    }\nq:before,q:after {\n        content:'';\n    }\nabbr,acronym { border:0;\n    }\n. ",
    "propi": "I created and added blank/transparent background image (blank.gif) to .lb-prev and .lb-next classes -- and it works for me!!\n/* line 84, ../sass/lightbox.sass */\n.lb-prev {\n  left: 0;\n  float: left;\n  background: url(../img/blank.gif);\n}\n/* line 90, ../sass/lightbox.sass */\n.lb-next {\n  right: 0;\n  float: right;\n  background: url(../img/blank.gif);\n}\n. ",
    "ondrejsika": "Thanks\n. ",
    "Jnwebsite": "@vinceg241\nI am having the exact same problem in IE 9. Did you manage to find a fix?\nThanks\n. @vinceg241 \nI have managed to, by process of elimination, worked out where I was experiencing problems, and now I have good functionality across IE 10, IE 9, Chrome and iphone/ipad safari\nI looked at the sample lightbox page and tried to match as best I could and work out where the problem was.\ntraced it back to not having a \"<!DOCTYPE HTML>\" tag at the top of my pages.\nI referred here:\nhttp://www.w3.org/QA/2002/04/valid-dtd-list.html \nworked through a few to get the right one for my site.\nI also found a conflict problem relating to another js script that was to overcome no flash on ipad/iphone. managed to make another rather un-elegant bolt on solution, but it seems to work.\nHope this helps\n. ",
    "frederik-b": "adding:\nposition:relative;\nz-index:11;\nto the right and left link element works as well and dosn't use an image hack\nthis worked once for me but now fails me too...\nsince it also dosn't work for pixelador I apparently need to take my solution back.\n. position:relative;\nz-index:11;\nworks as well and dosn't need this image hack\n. ",
    "pixelador": "Tried the options listed above and the only one that seemed to work for me was the transparent background fix. ymmv\n. ",
    "luuk-meester": "I combined the background fix and the z-index. I did not add the position:relative.\nLightbox v2.6\nBrowsers tested: IE8, IE9, IE10, Chrome v30, Firefox 24.0 , Safari 5.1.7 and my IPhone (Chrome and Safari).\nMy CSS code:\n/* line 84, ../sass/lightbox.sass /\n.lb-prev {\n    z-index:11;\n    left: 0;\n    float: left;\n    background: url(../img/blank.gif);\n}\n/ line 90, ../sass/lightbox.sass */\n.lb-next {\n  right: 0;\n  float: right;\n  background: url(../img/blank.gif); \n  z-index:11;\n}\n. ",
    "lennerd": "Miss that, too. I wonder if it is possible anyway to config the plugin?\n. ",
    "RyanZim": "http://lokeshdhakar.com/projects/lightbox2/#options\n. @lokesh This is solved by the albumLabel option. Shouldn't this be closed?\n. ",
    "dorfire": "I agree! a very important feature.\n. ",
    "enrique7": "how do i add .html instead of a single image?\n. ",
    "obelich": "I confirm this error i add a image wallpaper size and it display in worng size :(\n. ",
    "drewkinney": "I have a similar issue. The overlay image is compressed horizontally.\n\n. ",
    "lsicotte": "The problem I see is exactly like shown in @drewkinney screenshot.\n. Thanks @VasilyVasinov for your help but I ended up trying the @bendolan css\nfix (.lb-image{ max-width: inherit; }) and all was back to normal.\nI think you raise an issue that should be verified in the lightbox code.\nThanks again\nOn Mon, Jul 29, 2013 at 4:41 PM, Vasily Vasinov notifications@github.comwrote:\n\n@lsicotte https://github.com/lsicotte, @obelichhttps://github.com/obelich,\n@drewkinney https://github.com/drewkinney, I had the same issue.\nAfter poking around with the source code, I realized that on line 190\n$image.width(imageWidth); doesn't get set properly, even though imageWidthis correct. The width attribute is used later on line 195: return\n_this.sizeContainer($image.width(), $image.height());. I was able to fix\nthe issue by simply replacing $image.width() with imageWidth. So line 195\nlooks like this now:\nreturn _this.sizeContainer(imageWidth, $image.height());\nIt sounds to me like there is an issue with jQuery and not Lightbox2,\nsince width() is a jQuery function. I'll leave it to the author of the\nlibrary to decide what to do about the code.\nHope that helped.\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/69#issuecomment-21749819\n.\n. Thanks @bendolan !\nThe CSS fix worked fine.\n\nAnd I should maybe have mentionned I use Bootstrap 2.3.2 and JQuery 1.10.2 along with lightbox-2.6.\n. ",
    "AydinHassan": "Also having the same issue @drewkinney has displayed\n. ",
    "bendolan": "This problem looks similar to the bootstrap issue.\nPlease try adding the following to your CSS:\n.lb-image{\nmax-width: inherit;\n}\n. ",
    "kumekay": "Thanks @bendolan !\nFix works for me too\n. ",
    "alexbrahastoll": "Thanks @bendolan, the fix also worked for me! I'm using jQuery 1.9.1, Twitter Bootstrap 2.3.1 and Lightbox 2.6.\n. ",
    "framelita": "the fix is not working for me. I'm not using bootstrap. Is there any other way to solve this?\nIt seems like anything i put in .lb-image doesn't work. I tried to test it by display:none and the image still appear.\n\nI fixed it by changing the width of the .lb-outerContainer to auto.\nbut after i click few images, the size starts to be incorrect again.\n. ",
    "cabroll": "It seems to have fixed distortion for me, except now when my window width is smaller than the image, the image just spills over the container both right and underneath.  The image is no longer scaling with the width of the page.  (Trying to make sure it scales properly for mobile devices with widths less than the image sizes.) Any suggestions on a fix?\n\n. ",
    "MariusRumpf": "Thanks @bendolan !\nFor me it worked too.\n. ",
    "hfinck": "Thank you @bendolan !\nWorked for me.\n. ",
    "sg1303": "Thanks @bendolan.\n. ",
    "steckinsights": "Thanks @bendolan !\n. @talofo Can you remove the !important from your img tag?  If you're building responsively, then it's the order of the code in your CSS that effects the priority.  The !important tag shouldn't be necessary on the img rule.  Instead, place !important on the max-width: inherit so that it overrides the hard-coded inline CSS.\nIf all else fails, I wouldn't hard-code the plugin, because you'll lose that the next time the plugin is updated.  I'd go with a jQuery solution if the CSS solution doesn't work.  jQuery can allow you to find an element and change it's CSS.  Look up .css( propertyName, value ) in jQuery's API Documentation.\n. ",
    "dustinmiller24": "Thanks @bendolan!\n. ",
    "bdnorris": "Anyone still having an issue with this, like @cabroll, try commenting-out the width and height for .lb-outerContainer in lightbox.css\n.lb-outerContainer {\n  position: relative;\n  background-color: white;\n  *zoom: 1;\n/width: 250px;\n  height: 250px;/\nmargin: 0 auto;\n  -webkit-border-radius: 4px;\n  -moz-border-radius: 4px;\n  -ms-border-radius: 4px;\n  -o-border-radius: 4px;\n  border-radius: 4px; \n}\n. ",
    "adampope": "This is still an issue (version 2.6) and @bendolan's fix works great.  I added it to line 38 of lightbox.css\n. ",
    "LinKyaw": "Thanks @bendolan!\nI've the issue coz of twitter bootstrap!\nfix work for me, too!\n. ",
    "Autive": "Also without bootstrap this is an issue, the fix of @bdnorris works partial, when i have images with an smaller width, the width doesn't go back for the wider images. So still no solid solution.\n. ",
    "marlboro77": "Thanks @bendolan - bootstrap fixed.\n. ",
    "Newman5": "Thanks @bendolan !\nFor me it worked too.\n. ",
    "goody": "@bendolan is the man.\n. ",
    "talofo": "I'm using this new version and the same issue occurs. I hard coded the values I wanted on the light box, otherwise, no dice. On the inspector is shows display block and the dimensions correctly BUT visually, a huge vertical image keeps appearing. \nNote: Since I'm building a responsive website, I may have added img {width: 100% !important}. on the css.\n. Thanks. \nI thought that rule would apply only prior to the fix on 2.7.0 version?\nSo the issue should be fixed, and you shouldn't need that rule any longer? Or am I see it wrong?\n. ",
    "jamesmartinduffy": "I had to add a max-height: inherit to .lightbox .lb-image. Was having the same issue with a compressed height, but that fixed it.\n. ",
    "Maypeur": "I still have a problem with the size, but i dynamically change the src attribut of the source img. Is there anyway to reset the size or force to check the iamge size every time we click on the image ?\n. ",
    "gvance": "@jamesmartinduffy This fixed also worked for me. Thank you.\n. ",
    "mukesh019": "however the lightbox currently lacks a window resize event. Please make sure the lightbox scales correctly when the window is resized.\n\npls help me.. ",
    "dossy": "Not a great solution, but a temporary work-around might be to force IE into IE9 -- LB 2.6 doesn't even seem to work in IE10 Compatibility View mode.\nAdd this to your HEAD element:\n<meta http-equiv=\"X-UA-Compatible\" content=\"IE=9\">\n. @vinceg241, the your testimonials.htm uses an incredibly outdated version of Lightbox 2.04 that depends on Prototype.js, while the WelcomeBaby.htm page loads both Lightbox 2.6 with jQuery and Lightbox 2.04 with Prototype.js.  You should probably fix that problem, first.\n. ",
    "kay0007": "Changing the doc type to transitional/loose fixed the IE10 issue for me.\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\"> \n. It worked for me on IE9 and IE10.\nMichael \nFrom: vinceg241 [mailto:notifications@github.com] \nSent: Friday, August 09, 2013 6:03 PM\nTo: lokesh/lightbox2\nCc: Michael Kay\nSubject: Re: [lightbox2] LightBox stopped working on IE10.... (#70)\n@kay0007 https://github.com/kay0007\nThanks for the post. Will give this a try to see if it helps with IE9, but as I mentioned, I no longer have a problem with IE10, Chrome or Firefox.\nvinceg\n—\nReply to this email directly or view it on GitHub https://github.com/lokesh/lightbox2/issues/70#issuecomment-22425792 . https://github.com/notifications/beacon/4xHXsMJly1OAPm8Y-KjHll-Q3wQ_DXrz31n6GN0SeA1_JwgJWi_-AH3R2GUJSi1u.gif \n. ",
    "satyrias": "I had probably the same problem.\nResizing for height was ok, but not for width (that was blocked at about 250px ^^).\nMaybe a time shift between image loading and access to image's width/height properties ?\nMaybe only for \"big\" images and/or slow connections ?\nAny way setting .lb-outerContainers width/height to 100% fixed the \"issue\".\nThanks nath :)\n. ",
    "flowl": "\ncan confirm this, setting the height/width as suggested by https://github.com/nathannash worked for me\n. duplicate of bug https://github.com/lokesh/lightbox2/pull/73\n. ",
    "maloky": "hi, \nthe .lb-outerContainers width/height to 100% solution works great. but there is still a bug happening.\nWhen the container drops the size, it can not strech to the original size. ex: if you have 2 images, of diferent widths, when you see the smallest then the width os the container is restrined to that size.\ni hope i make my self clear, even i'm a bit confused :P\n. ",
    "mrextreme": "With a trick. You can trigger a \"click\" event on a HTML element by calling $( '#elementId' ).click() . Not the nicest way, but works.\n. I ran into a similar issue. $image.width() seems to be misbehaving. I even put an \"alert( $image.width() ); just below the line where it says $image.width( XXX );, and it's not XXX... ???? I fixed it by changing lines from 174 to 197. All I did was using imageWidth and imageHeight a bit more, because preloader.width and height are correct, while $image.width() and height() are not.\njavascript\n        imageWidth = preloader.width;\n        imageHeight = preloader.height;\n        $image.width(imageWidth);\n        $image.height(imageHeight);\n        if (_this.options.fitImagesInViewport) {\n          windowWidth = $(window).width();\n          windowHeight = $(window).height();\n          maxImageWidth = windowWidth - _this.containerLeftPadding - _this.containerRightPadding - 20;\n          maxImageHeight = windowHeight - _this.containerTopPadding - _this.containerBottomPadding - 110;\n          if ((preloader.width > maxImageWidth) || (preloader.height > maxImageHeight)) {\n            if ((preloader.width / maxImageWidth) > (preloader.height / maxImageHeight)) {\n              imageWidth = maxImageWidth;\n              imageHeight = parseInt(preloader.height / (preloader.width / imageWidth), 10);\n              $image.width(imageWidth);\n              $image.height(imageHeight);\n            } else {\n              imageHeight = maxImageHeight;\n              imageWidth = parseInt(preloader.width / (preloader.height / imageHeight), 10);\n              $image.width(imageWidth);\n              $image.height(imageHeight);\n            }\n          }\n        }\n        return _this.sizeContainer(imageWidth, imageHeight);\n. Go to line 150 in lightbox2.js and change the \" / 10\" at the end of the line to \" / 20\".\n. @abbedabb : Use a proper text editor, which shows you the lines numbers. It may be turned off by default, you may need to turn it on, most likely in the \"View\" menu. On M$ Win try Notepad++, on Linux gedit or Kate.\nAlternatively, search for this text \"Lightbox.prototype.changeImage\", that's in line 159.\n. My change might fix this for you, or give you the idea to fix it. See my comment in #82 . You may need to look at the lines from \"if ((preloader.width > maxImageWidth) || (preloader.height > maxImageHeight)) {\"\n. ",
    "fpacius": "I have this problem also, and creating suggested default.css does not solve it.\n\n. Forgot to add that I am using skeleton framework on my site. Could it affect lightbox this way? On the other hand, I disabled other css files and lightbox still does this.\n. Problem solved somehow. For some reason, Flux4 which I use, shows this phenomena in preview, but now as I previewed it in Firefox and Safari after emptying cache, everything is alright again.\n. ",
    "davidmoninger": "Did you ever get a fix or other resolution for this issue ... I'm receiving the same results for a code set that works fine in Firefox and Chrome, but fails - as above - on IE9\n. I have fallen back to version 2.03, and it seems to work for IR 9 & 10,\nFirefox  Chrome, Safari(PC), and Opera\nHere is MY test page:\nhttp://www.demosite01.com/cgi/display_comm_unit_detail.pl?CommID=1200BT&UnitID=201\nA a courtesy, with NO warranty, expressed or implied, I have made the zip\nfile available for that release at\nhttp://www.wsbd.com/lightbox/\nI'm not sure what the bug fixes may be between 2.03 and 2.64, as well as\nwhat features may be missing ... but at least it works!!\nI did have to change data-lightbox= to rel= in my A Hef  tag, and the link\nand script lines in the header section.\nBut it works!!\nOn Mon, Sep 16, 2013 at 4:13 PM, vinceg241 notifications@github.com wrote:\n\nNo responses - still have the issue....\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/79#issuecomment-24540598\n.\n. I have fallen back to version 2.03, and it seems to work for IR 9 & 10,\nFirefox  Chrome, Safari(PC), and Opera\nHere is MY test page:\nhttp://www.demosite01.com/cgi/display_comm_unit_detail.pl?CommID=1200BT&UnitID=201\n\nA a courtesy, with NO warranty, expressed or implied, I have made the zip\nfile available for that release at\nhttp://www.wsbd.com/lightbox/\nI'm not sure what the bug fixes may be between 2.03 and 2.64, as well as\nwhat features may be missing ... but at least it works!!\nI did have to change data-lightbox= to rel= in my A Hef  tag, and the link\nand script lines in the header section.\nBut it works!!\nOn Mon, Sep 16, 2013 at 6:25 PM, jediah notifications@github.com wrote:\n\nI got the same problem, and i can not find why this appears..\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/104#issuecomment-24549872\n.\n. Be sure your links are pointing the proper directories and that the image\nvalues and other \"links\" in the css and js files are pointing to the proper\n\"paths\"    I set mine up with \"/css/xxxx.css\"   to insure correct pathing\nregardless of the position of the calling page.\n\nSend me a link if you'd like\nOn Mon, Sep 16, 2013 at 8:52 PM, jediah notifications@github.com wrote:\n\nThanks but, this is still not working for me.. in IE it goes directly to\nthe physical image..\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/104#issuecomment-24556851\n.\n. \n",
    "louismagie": "That would be an awesome feature ... \n. ",
    "mgmoonlight": "Still not an option? Looking to display and play an mp4.\n. ",
    "jaekqubp": "I was in a position in which I needed to put a video in lightbox, I ended up accomplishing this by nesting another plugin inside the lightbox. If your project is not dependent on lightbox, I would suggest that it may be easier for you to use an alternative code that supports embedded video.\n. Hi nickck20030, \nI have been helping a friend build a site, and have been experiencing this same issue. I haven't been able to reproduce it, however, outside of the context of this project. Were you able to isolate and/or resolve the problem?\n. ",
    "justinmasuga": "Can you explain your nesting inside of lightbox further?\n. That would be awesome. Has anyone figured out a workaround? Like adding a link or something to the image.\n. I agree.\n. I would be fine with being able to add iframe videos from YouTUbe.\n. ",
    "zerokarma": "I have the same problem when it comes to IE 8, it will not work at all with the Lightbox 2.6 version. It works in IE 10 but not 8\nScreen goes black and the image will not load, just a small tiny white box opens.\nIs there any solutions to fix it for IE 8?\n. ",
    "worf2": "I have exactly the same problem in IE 8.\nTable at bottom of page works fine in FF http://www.rheidolrailway.co.uk/fares.htm\nAny fix yet?\nMany thanks\n. ",
    "thomaswarmington": "After one of our old asp sites was having this exact issue I stripped everything out and the only thing left that fixed it was changing the doctype from \n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nto just\n<!DOCTYPE html>\nI notice worf2 uses the same doctype so maybe this will fix your ie7 / ie8 problems\n. ",
    "pepperstreet": "Same issue here. Although I can see correct sizes in IMG lb-image style,\nthe inline width of DIV class lb-outerContainer and lb-dataContainer are way to small. Almost the half of the height. In other words, the image is squashed in width.   \nEnvironment:\nLightbox2 v2.6, Bootstrap v2.3.2, jQuery1.8.3\nJoomla 3.1.5 CMS template with other misc scripts.\nPS: Additionally i see an error in browser console, not sure about the cause and source. Previous site/joomla extension used lightbox 2.5.1: \n\"ReferenceError: Can't find variable: LightboxOptions\"\n. ",
    "snurolss": "The commit above from TimVNL fixes this issue for me (jQuery 1.9.1). Delete width: 250px; height: 250px; from .lb-outerContainer {} in lightbox.css, lines 49-50. \n. ",
    "mciszczon": "The same issue I had with Foundation fom ZURB. And deleting lines 49-50 from lightbox.css worked for me too.\nAlso, adding max-width: none; to .lightbox .lb-image fixes the problem. It's due to Foundation (and Bootstrap too) rule that applies to images and gives them max-width.\n. ",
    "danielevigi": "Same issue here. TimVNL and mrextreme solutions have solved the problem.\n. @klarita download this file: https://github.com/lokesh/lightbox2/blob/master/js/lightbox.js and change the lines as indicated by mrextreme.\n. ",
    "zahanm": "Ah, didn't see this earlier. I addressed this in #147 \n. Not sure if the width: auto change addressed your issue, but I think the correct fix is in #147.\n. @lokesh  Note, I didn't update the minified Javascript as you didn't specify a minifier / build script.\nPlease update that when you pull this in?\n. @lokesh ping?\n. ",
    "klarakucerova": "Same issue here. I have tried to delete the the width & hight in .lb-outerContainer as recommended by TimVNL, but didn't help. I'm using the jQuery 1.10.2 - just recently downloaded from Lightbox 2,6 version. \nI don't have much idea about javascript, so can't workout the above fix from mrextreme. First of all the .js file is compressed, so not sure how to decompress it to try the above code.\nI'm not using Bootstrap or any other frameworks and this is only jQuery/ javascript code on my website.\nCould anyone kindly talk me through this fix please :) very appreciated !!!\n. many many thanks for the advice @TimVNL & @danielevigi, all working fine now :)\n. ",
    "TimVNL": "@klarita will update my fork soon with a fix for your problem I hope\nMt fork is updated and the the problem seems fixed here\n. ",
    "furiabhavesh": "Thanks @mrextreme, your code change just works.\n. ",
    "Ghallydc": "Thank you y'all\n. ",
    "Katenkka": "Thanks!!\n. ",
    "binaryreality": "Thanks for this comment. I just ran into the same issue. The fix works very well.\n. ",
    "frankaellen": "Perfect. Thanks for this. Was very easy to fix. \n. ",
    "mnolae": "Greath!\n. ",
    "josedesoto": "Thanks!!\n. ",
    "danmayer": "awesome fixed for me.\n. ",
    "maracaipe": "Big Thank you!\n. ",
    "Otomatic": "Hi,\nIt works in Firefox with à right-clic on the link and Open in a new tab\n. ",
    "remimoment": "Hello, \nThanks for your answer !\nI know it works like this, but our user don't know the \"open in new tav\". That is why i want a simple link, and the click redirect on the good page\n. ",
    "AsylumET": "I wanted to do this as well but used html entities for the link instead however it has the same result. Nothing unless you right click.\n<a href=\"someimage.jpg\" data-lightbox=\"gallery\" title=\"About the image.&lt;br /&gt;&lt;a href='/somelink.htm'&gt;Link Text&lt;/a&gt;\">IMAGE TAG HERE</a>\n. ",
    "DemidovVladimir": "You can try to make this: title=\"\"\nAfter that it will make everything in userYourActionInJavaScript() function\nYou can reach me at skype: vladimir050486\n. title=\"\"\n. doesn't show tags(((\nTry to insert in title attr link and inside link not just direct redirection, use onclick with Javascript function\n. ",
    "planetalk": "Is there anyone who can help with this?\nKirk\n. ",
    "drusus-major": "Hi. The arrows are a 'hover' state, and there are no hover events with iOS. But if you look at post #103 in the list here, you'll find a way to make the arrows show up all the time. I believe there's also a way to make it do that when an iOS device is accessing the page, but revert to hover when not.\nHope that helps. And if you know a way to get Lightbox to load retina (@2x) images, please do post it - I'm trying to find that out.\n. The URL is http://cadmiumgreen.com/rg/index.html\nThink I'm getting an idea of the cause of the problem here. As far as I can tell, the retina replacement script looks for  the 'img' attribute to swap images. The full-size image in the markup does not have this attribute. The thumbnails, which do have the attribute, are swapped out appropriately.\nApologies - I can't figure out how to post a line of code here.\n. It's still relevant - never been answered.\nThanks.\nOn Tue, Jun 23, 2015 at 8:28 PM, Lokesh Dhakar notifications@github.com\nwrote:\n\nClosed #141 https://github.com/lokesh/lightbox2/issues/141.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/lokesh/lightbox2/issues/141#event-338517343.\n. \n",
    "ivandurst": "Google is your friend:\nhttps://www.google.com/search?q=fancybox+alternative&rlz=1C5CHFA_enUS542US542&oq=fancybox+alternative&aqs=chrome..69i57j69i60j0l2j69i61j0.4962j0&sourceid=chrome&ie=UTF-8#fp=13d6aa3a7d487f41&q=lightbox+alternative\nI recommend fancybox2.\n. ",
    "clouddueling": "Maybe you could make an extended version or use twitter bootstrap modals. Personally I'd prefer to keep the size of lightbox as lightweight on my site as possible.\n. @mergjo @hothandao Have you tried my left position fix?  Did it work for you as well?\n. @mergjo Would you mind changing left in the css to -10000px and see if this problem persists for you?\n. ",
    "freepius": "Hi lokesh ! :-)\nThis pull request interest you ?\nIt is very important for me, and I prefer to follow your branch.\nSo can you merge it or invalidate it ?\nThanks.\nfreepius\n. Hi @lokesh ! Is it possible to apply this very useful patch ?\nThanks a lot.\n. ",
    "Eizens": "I had this problem if using the same image link for all thumbs. Just use different images or rename them.\n. ",
    "abbedabb": "I have the same problem, but I can't find any line numbers.\nThe caption ends up more than 50% under the bottom of the screen, and only the top of the X (for closing) is visible. Same problem in IE, Chrome and Firefox. On all browsers the light box shows up about 90 px under the top of the page, and that is really unnecessary. If I could just move everything up about 60 px.\n. ",
    "mkstix6": "I have the same problem. I changed \"e.containerBottomPadding-110\".\nMade the number 150, seems to do the trick.\nObv. a bit annoying I need to do it at all.\n. ",
    "patrickmaciel": "Thanks guys\n. ",
    "hothandao": "Yeah, this issue happen to me as well:\nPlease see demo here\nhttp://diaocx.com/duan_s/du-an-chung-cu-euroland-tsq-chung-cu-lang-viet-kieu-chau-au.html\n. I though there is an option. lol. Anyway, this works perfectly.\nThanks @Steven737\n. ",
    "mergjo": "i have the same issue\nif the page is very long, the lightbox opens on bottom of the sreen\nI can´t change it.\n\nplease see the test-page here: http://www.the-flying-stars.de/galerie4-2.htm ... in the 6. galery \n. Hello clouddueling.\nI don´t know, hwat you mean.\nSorry, I´m only a \"user\", not a progammer. \nleft is \"0\" (zero)\n...\n/* line 20, ../sass/lightbox.sass */\n.lightbox {\n  position: absolute;\n  left: 0;\n  width: 100%;\n  z-index: 10000;\n  text-align: center;\n  line-height: 0;\n  font-weight: normal;\n...\n. on a short page the lightbox.css works fine.\nsee: http://www.the-flying-stars.de/galerie4-1.htm\nbut not on a very long page.\nwhitch parametre is impotant for the \"high position\"? \n. left: -10000px;\nthe same problem, as before\n. Hello danglering, it´s great!! Thanks for this idea.\nI also changed 10 to 100 and it works fine! \n. ",
    "danglering": "I had the same problem as  mergjo. I tried to change the css, as described above, but it did not help me.\nThen I look into the js file lightbox-2.6.min.js\ni'm not a javacript programmer, i just search word \"top:\", because it is responsible for the location in html:\ndiv id=\"lightbox\" class=\"lightbox\" style=\"display: block; top: 4298.05px; left: 0px;\"\ni find this word in lightbox-2.6.min.js on line:\nf=b(window);o=f.scrollTop()+f.height()/10;n=f.scrollLeft();this.$lightbox.css({top:o+'px',left:n+'px'})\ni.e. top:o+'px'\nand \no=f.scrollTop()+f.height()/10\nto decrease variable 'o' i changed 10 to 100:\no=f.scrollTop()+f.height()/100\nand it works! now my pics open at right height, even if the height of the page is over 9000 px\n. mergjo, you are welcome! \nI just struggled with this problem for over a month, so I decided to tell the others about my solution )\n. ",
    "jenfield": "Thank you danglering.\nI changed mine to:\no=f.scrollTop()+10\nwhich then does not based the position on the height of you page at all... it just put's it 10px down on the page.\n. ",
    "claireannice": "I tried the css left change, and the js change, to both +10 and /100. None of these have worked for me.\nSo frustrating.\n. ",
    "phbernard": "I could observe this issue with LB 2.8.2, by calling lightbox.init() twice. First time, everything works as expected. Second time, the loader is shown as described by @clouddueling.\nFixes:\n- Call lightbox.init() only once. Definitely the right thing to do, since calling it twice is unnecessary. Maybe a check could be done internally by LB to avoid the mistake (on second call, throw an error or do nothing).\n- @clouddueling's \"set left to -10000px\" workaround also works, although this is obviously not the preferred solution here.\n. ",
    "dorsetdog-dot-com": "Just wondered if you ever got anywhere with this Mark - mlavey\nI still use Lightbox 2.05 with js and css - it works very well on my Google Sites site. http://www.dogshowcorscombemosterton.info/photos-of-2013-show\nI also want to recreate the single large image with scrolling thumbnails to the side of the main image, the same as above. Many screens now are wide and low, which gives more room for the filmstrip to be vertical and to the side of the main image - rather than underneath.\nThis is a doctored image to show what I am after \n\n. ",
    "ttymsd": "OS: Mac OS X 10.7\nbrowser : chrome 28\n. ",
    "bokorben": "ooo fuck, sorry, wrong tab, wrong github.. \n. ",
    "Steven737": "In the lightbox.css you can change the class .lb-prev {left: 0;float: left;} into .lb-prev { left: 0; float: left; background: url(../img/prev.png) left 48% no-repeat; } and delete .lb-prev:hover {background: url(../img/prev.png) left 48% no-repeat; }. The same on the lb-next class. \n. ",
    "jediah": "I got the same problem, and i can not find why this appears..\n. Thanks but, this is still not working for me.. in IE it goes directly to the physical image..\n. ",
    "dubaprata": "Hi davidmoninger ,\nThanks It really Works!!!\nThanks a lot!!!\nNow It is Working perfectly in Firefox 25.0\n. ",
    "Dennis1993": "Can anybody reproduce it?\n. Hey,\nthanks for your answer.\nYes, of course, I mean horizontal (left to right). Now I use Windows 8.1 with Internet Explorer 11 and the scrollbar is not shown longer. Mybe you can fix it in next version for the IE10, please.\nThank you very much!\n. Thank you very much!\n. ",
    "cstuart": "Add a thumbnail image to your links.\n. ",
    "kmboyett": "Having the same problem - I've got the images in the order I want, not sure why it insists on opening at the end\nHelp?\n. ",
    "aasthatuteja": "I didnt get the fix for the issue, but to get rid of this, I just removed the option to show Image Numbers...\n. Comment below code from \"lightbox-2.6.min.js\" file, if you think \"removing the Image # of #\" option will work for you.\nreturn \"Image \" + b + \" of \" + c\n. ",
    "justinthrelkeld": "This sounds like an interesting opportunity for a separate social add-on for Lightbox. I'm going to think on it and see what I can come up with.\n. I'm going to attempt this as a side project over in this repo. I'm a little loaded project wise up at the moment, so the progress might be slow, but let's see what happens. It shouldn't take too much to make this work.\n. ",
    "Galdekot": "Well, I can't wait, that will be a huge advancement to Lightbox. Keep me\nposted, or should I say, keep us all posted.  Ron\nOn Tue, Nov 5, 2013 at 3:04 PM, Justin Threlkeld\nnotifications@github.comwrote:\n\nThis sounds like an interesting opportunity for a separate social add-on\nfor Lightbox. I'm going to think on it and see what I can come up with.\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/111#issuecomment-27807412\n.\n. Sounds awesome, I'll be keeping my eye on this. I'll want to be one of the\nfirst to have this functionality.\n\nRon\nOn Fri, Nov 8, 2013 at 5:14 PM, Justin Threlkeld\nnotifications@github.comwrote:\n\nI'm going to attempt this as a side project over in this repohttps://github.com/justinthrelkeld/lightbox-social.\nI'm a little loaded project wise up at the moment, so the progress might be\nslow, but let's see what happens. It shouldn't take too much to make this\nwork.\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/111#issuecomment-28102486\n.\n. \n",
    "drinklikachamp": "I have experienced the same issue with IE 10 on Windows 7. have to go outside of it and come back to see (and use) the arrows.\nAdditional information:\nViewing your Ownsite in IE 10 experiences the same behavior http://lokeshdhakar.com/projects/lightbox2/ \nI am using in conjunction with Twitter Bootstrap\n. I have experienced the same issue with IE 10 on Windows 7. have to go outside of it and come back to see (and use) the arrows. \nAdditional information:\n- Viewing your Ownsite in IE 10 experiences the same behavior http://lokeshdhakar.com/projects/lightbox2/\n- I am using in conjunction with Twitter Bootstrap\n. ",
    "dwwebster00": "Sorry! I found the problem. IE10 blocks scripts and Active X  unless told otherwise. So you need to un-block them.\n. My version of IE10 puts a bar across the bottom of the page that says it\nblocking scripts and Active X and that gives you  Yes/No buttons to unblock.\nDavid Webster\nOn Thu, Nov 7, 2013 at 1:43 PM, vinceg241 notifications@github.com wrote:\n\nI have the same problem..... 2.6 works perfectly on Chrome & FFox, does\nnot work at all on IE10, either as single image or as a picture set....\nCan anyone let me know specifically how to unblock scripts and ActiveX on\nIE10?\nWent thru the Internet Options and checked/unchecked what appeared to be\nappropriate boxes, but still have problem.\nBTW, this was working fine until one of the auto updates for IE10 was\napplied....\nThanks to all...\nvinceg\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/112#issuecomment-28009405\n.\n. Check the help information in Windows for something on the \"Internet\nExplorer Information bar\".\n\nOn Thu, Nov 7, 2013 at 7:41 PM, David Webster dwwebster00@gmail.com wrote:\n\nMy version of IE10 puts a bar across the bottom of the page that says it\nblocking scripts and Active X and that gives you  Yes/No buttons to unblock.\nDavid Webster\nOn Thu, Nov 7, 2013 at 1:43 PM, vinceg241 notifications@github.comwrote:\n\nI have the same problem..... 2.6 works perfectly on Chrome & FFox, does\nnot work at all on IE10, either as single image or as a picture set....\nCan anyone let me know specifically how to unblock scripts and ActiveX on\nIE10?\nWent thru the Internet Options and checked/unchecked what appeared to be\nappropriate boxes, but still have problem.\nBTW, this was working fine until one of the auto updates for IE10 was\napplied....\nThanks to all...\nvinceg\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/112#issuecomment-28009405\n.\n. That's what happens if it can't run JQuery. I am using IE10, not IE11, but\nIE10 seems to block Active X and scripts (i.e. Javascript/JQuery). You need\nto allow it run scripts. In my case, you can do this from an information\nbar that is displayed at the bottom of the page.\n\n\nDavid Webster\nOn Wed, Nov 13, 2013 at 6:18 AM, JP Hellemons notifications@github.comwrote:\n\nmy ie11 does display lightbox, but on the left instead of center of screen\nand no text sliding down below the image....\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/112#issuecomment-28397300\n.\n. \n",
    "roman-yagodin": "Localization support in the Lightbox2 would be a very nice feature.\n.  I think using localized templates like \"Image %d of %d\" instead of concatenation would work better for more languages.\n. ",
    "jaywink": "Made a pull :)\n. If this can be accepted, can add a section to the index.html demo page if needed :)\n. Anything I can add to this PR?\n. @reitermarkus oh ok, closing this then, thanks for the heads up\n. This is here to be able to actually call setTranslations safely, when it is really available in window.\n. ",
    "matriphe": "+1 for localization!\n. ",
    "sudo-web": "+1 for localization!\n. You can easy do it like this:\nhtml\n<a href=\"images/image01.jpg\" data-lightbox=\"set01\" data-title=\"Image 01\"><img src=\"images/image01.jpg\" alt=\"\"></a>\n<a href=\"images/image02.jpg\" data-lightbox=\"set01\" data-title=\"Image 02\"></a>\n<a href=\"images/image03.jpg\" data-lightbox=\"set01\" data-title=\"Image 03\"></a>\n<a href=\"images/image04.jpg\" data-lightbox=\"set01\" data-title=\"Image 04\"></a>\n<a href=\"images/image05.jpg\" data-lightbox=\"set01\" data-title=\"Image 05\"></a>\n<a href=\"images/image06.jpg\" data-lightbox=\"set01\" data-title=\"Image 06\"></a>\n. ",
    "elcodedocle": "+1!\n. +1!\n. ",
    "DriesArnolds": "I've got the same problem. Only on IE9+. The link layer doesn't seem to be triggered. Maybe it's a z-index problem?\n. LightBox 2.6, Jquery 1.10.2, IE9/Win7 and IE10/Win7\n. ",
    "bibivsouza": "I m with the same problem!\n. ",
    "kinetifex": "+1\n. ",
    "ctrlbee": "I had the same issue. Did you ever figure out a fix?\n. FYI, just found this on another post that worked for me (I'm also using bootstrap): \n.lb-image{\n   max-width: inherit;\n}\n. It shouldn't matter if they are both included in your project, but I put it in the css file from lightbox. \n. ",
    "jakubjanecek": "Thanks. I \"fixed\" it by using the latest development version...\n. ",
    "DenSim": "chrisbee, where did you place that code? In your stylesheet or the one that came with Lightbox?\n. Thanks so much Chris. Worked like a charm!\nThanks,\nDennis Simmons\n- Sent from my mobile. Pardon the brevity/typos. \n\nOn Nov 22, 2013, at 12:46 AM, chrisbee32 notifications@github.com wrote:\nIt shouldn't matter if they are both included in your project, but I put it in the css file from lightbox.\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "drusellers": "This fix worked for me as well.\n. ",
    "Kayne": "Worked for me as well. I think it should be merged into master.\nVery annoying bug…\n. ",
    "mib32": "That code still works great. Use it if you want turbo links compatibility.\n. ",
    "FrEaKmAn": "I disagree. Having this feature on the mobile phones is sometimes a must.\n. ",
    "marcwiest": "+1\n. +1 for #inline content\n. ",
    "supergia": "Is anyone going to take a look at this inquiry?  Thanks.\n. ",
    "patrick-mcdougle": "How do you expect this to do anything more than it currently does? There's only so much space on your screen in landscape.\n. ",
    "wb7": "No, it is shown correctly now.\n. I've tested again. At the demo page there is no problem, but local is. Firefox, Iceweasel, Midori - correct. But Chromium makes this mistake at the local page without any stylesheet.\n. https://github.com/lokesh/lightbox2/issues/176#issuecomment-37581275 fixes it for me.\n. The comment from @martoko fixes the issue for me.\n. ",
    "25ml": "Thank you so much !!!! :+1: \n. Yes please!!!! I need to make loop to. When we are for example at image 6/6, click next and go to the first ( 1/6 )\n. Got it from another post:\nBy default the wrapAround option is set to false. Set it to true to get the loop back behavior.\nvar LightboxOptions = (function() {\n    function LightboxOptions() {\n      this.fadeDuration         = 500;\n      this.fitImagesInViewport  = true;\n      this.resizeDuration       = 700;\n      this.showImageNumberLabel = true;\n      this.wrapAround           = true;\n    }\n. ",
    "GMaster479": "Guess he is gone...\n. ",
    "Pleshoun": "Sry, Im an idiot... \n. ",
    "hrd1984": "I have the same problem, but it seems to only be in webkit browsers:\n\n. ",
    "ivopivo72": "i fixed for me... in lightbox-2.6.js found this string: \" top:o+'px' \", replace with \" top:'50px' \" \n. ",
    "clomaka": "I too would like this. I was able to hack together something in the caption section, but the 'target' function doesn't work, so it requires right-clicking on it. Any quotes in the href will screw up the caption.\ncode:\n\nclass=\"image\" src=\"img/TH_Acro.jpg\">\nIdeally, I'd like some icon next to the close icon that'll open the large image in a new window, but getting a way to enable the href target function in the above code would  be a decent workaround.\n. Worked for me when I grabbed it a year or so ago.\n. http://www.megafileupload.com/2lLA/lightbox2.zip\n. ",
    "kalvish21": "I was able to hack something together for this as well, but would be better to support a download link on it.\n. ",
    "sjmogg": "Folks,\nI have hacked version 2.6 to add pinterest, facebook, google+ and twitter links on our web site at http://www.sanctuaryhillretreat.com/\nIt wouldn't be hard to add a download link in a similar way.\ngrab the following files.\nhttp://www.sanctuaryhillretreat.com/css/lightbox.css\nhttp://www.sanctuaryhillretreat.com/js/lightbox-2.6.min.js\nhave fun.\n. hi paulmil,\nI have added pinterest, facebook, google+ and twitter links to version 2.6 on our web site at http://www.sanctuaryhillretreat.com/\ngrab the following files.\nhttp://www.sanctuaryhillretreat.com/css/lightbox.css\nhttp://www.sanctuaryhillretreat.com/js/lightbox-2.6.min.js\nhave fun.\n. Folks,\nI have hacked version 2.6 to add pinterest, facebook, google+ and twitter links on our web site at http://www.sanctuaryhillretreat.com/\nIt wouldn't be hard to add a download link in a similar way.\ngrab the following files.\nhttp://www.sanctuaryhillretreat.com/css/lightbox.css\nhttp://www.sanctuaryhillretreat.com/js/lightbox-2.6.min.js\nhave fun.\n. ",
    "werc": "I´m missing simple right clicking and download in browser.\n. ",
    "margox": "\nhttps://github.com/Margox/lightbox2\nI have added a download button,download these files and use it.\n. aha，yesterday I restyled this plugin,(in fact only modified the css file),and the image is no longer coverd by the prev/next buttons.so you can save the image just click the right mouse button as a normal web image,but I am  not beside  my computer now,because it's morning in China, I will  update this at about 10 am today(^_^)\n. @pingyangtiaer \nsee the snapshot below,do you like this style?\n\nhere is the link: http://lazypress.net/lightbox2.zip\n. ",
    "pingyangtiaer": "@ margox\nI downloaded https://github.com/Margox/lightbox2 and didn't find the download working, actually I can not find the download arrow show up when I hovering the mouse there. Are you sure it is working?\nThanks.\n. Not working for me yet. I even didn't find the next arrow. Could you please send me a working version?\n. Is there a way to add a \"download\" text in the middle of the title with hyper link for download?\n. @margox \nThanks for the sharing, However, I still did not see the download button yet.\nI found out there was a pull to the github from you one year ago, I will try from there to seek luck.\n. ",
    "tonijn": "To enable the browser's native \"save image as\" functionality, please add the following css. No js needed:\n``` css\n.lb-nav {\n   pointer-events: none;\n}\n.lb-prev, .lb-next {\n   pointer-events: auto;\n}\n```\n. ",
    "itsites": "Work for me:\n.lb-nav a.lb-prev, .lb-nav a.lb-next { width: 20% !important; } \n.lb-nav { pointer-events: none; } \n.lb-prev, .lb-next { pointer-events: auto; }\n. ",
    "ham1": "You might need to give more information for anyone to help you.\nDo you have an example URL we could look at? or code and images?\n. ",
    "wasnlosdu": "This is not caused by lightbox. The problem is that retina.js is only checking for images and since lightbox2 uses \"Anchor-Tags\", which are not images, it never will check those.\nYou can add data-rjs to your Anchor tags. So it looks like this:\nhtml\n<a\n  href=\"full/gejus.jpg\" \n  data-rjs=\"true\"\n  data-lightbox=\"paintings\"   \n  title=\"<em>Gejus</em>. 2013-15<br>oil on canvas<br>60 x 60 inches\"\n  <img src=\"thumbs/t_gejus.jpg\" width=\"151\" height=\"150\" border=\"0\" alt=\"Gejus\" title=\"Gejus\">\n</a>\nTL;DR => data-rjs=\"true\" on every \\<a> with an retina image.. ",
    "victorhaggqvist": "+1\n. ",
    "dansia47": "Try using \"\r\n\" instead of \"< br >\"\n. Sotware changed my message. I meaned \"& followed by # followed by 13 followed by ; followed by & followed by # followed by 10 followed by ;\". I'm hoping in a better luck. \n. ",
    "toabi": "This makes sense.\nI had to do this to allow having Bootstrap3 tooltips on Lightbox images.\nBS3 rewrites the title attribute to 'data-original-title' to disable the native browser tooltip.\n. ",
    "Tovozo": "Thanks, I changed to another way~~\n. ",
    "nwtech": "Thanks for the fix!\n. ",
    "ethaizone": "Thank you. Your fix is working very well.\n. ",
    "ufobm": "When will be this fixed?\n. ",
    "ghanzo70": "Hello, the problem is still there as you can see from attached.The only problem there with IE 11.\nAlessandro\n----Messaggio originale----\nDa: notifications@github.com\nData: 17/03/2014 6.57\nA: \"lokesh/lightbox2\"lightbox2@noreply.github.com\nCc: \"ghanzo70\"haleks@libero.it\nOgg: Re: [lightbox2] Problems with Internet Explorer 11 (#150)\nI attempted to recreate this issue in Windows 7 Internet Explorer 11.0.9431.0 with no luck. Can you post detailed steps to recreate if this issue still exists. I'll reopen this issue at that time. Thanks.\n—\nReply to this email directly or view it on GitHub.\n. if you always open pictures with the same format then no problem. If alternating with horizontal photo portrait photos then you see the flaw.\n. ",
    "wanst": "@Andreas, your not alone ;) , and I think – yes, it's a bug.\n@all: Let me specify it a little: it occurs at least on IE8 and IE9. On other browsers there's no problem. At http://lokeshdhakar.com/projects/lightbox2 the buttons for next and last never appear in IE. At the site I used it, there is something special: if the mouse touches the small white border around the img, then the button on that side appears, when you leave the img (and the border), it fades out and doesn't come back when you move faster over the img without touching the border.\n. ",
    "ajeworrek": "Thank you so much,\nits a pleasure to use your fine software!\nSincerly, Andreas\nZitat von Lokesh Dhakar notifications@github.com:\n\nFixed:\nhttps://github.com/lokesh/lightbox2/commit/f8d4a10635f5a92f4af116a46512ab8ab798f8c9\nGrab the latest release, 2.7.0: http://lokeshdhakar.com/projects/lightbox2/\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/lokesh/lightbox2/issues/152#issuecomment-39018947\n. \n",
    "paulmil": "Thank you so much  for taking the time to help\nBest wishes Paul Milner \nSent from my iPad\n\nOn 5 Apr 2014, at 11:24, sjmogg notifications@github.com wrote:\nhi paulmil,\nI have added pinterest, facebook, google+ and twitter links to version 2.6 on our web site at http://www.sanctuaryhillretreat.com/\ngrab the following files.\nhttp://www.sanctuaryhillretreat.com/css/lightbox.css\nhttp://www.sanctuaryhillretreat.com/js/lightbox-2.6.min.js\nhave fun.\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "fatchupay": "please see the below;\n/* line 7, ../sass/lightbox.sass */\nbody:after {\n  content: url(../img/close.png) url(../img/loading.gif) url(../img/prev.png) url(../img/next.png);\n  display: none;\n}\n/* line 11, ../sass/lightbox.sass */\n.lightboxOverlay {\n  position: absolute;\n  top: 0;\n  left: 0;\n  z-index: 9999;\n  background-color: black;\n  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=80);\n  opacity: 0.8;\n  display: none;\n}\n/* line 20, ../sass/lightbox.sass /\n.lightbox {\n  position: absolute;\n  left: 0;\n  width: 100%;\n  z-index: 10000;\n  text-align: center;\n  line-height: 0;\n  font-weight: normal;\n}\n/ line 28, ../sass/lightbox.sass /\n.lightbox .lb-image {\n  display: block;\n  height: auto;\n  -webkit-border-radius: 3px;\n  -moz-border-radius: 3px;\n  -ms-border-radius: 3px;\n  -o-border-radius: 3px;\n  border-radius: 3px;\n}\n/ line 32, ../sass/lightbox.sass */\n.lightbox a img {\n  border: none;\n}\n/* line 35, ../sass/lightbox.sass _/\n.lb-outerContainer {\n  position: relative;\n  background-color: white;\n  zoom: 1;\n  width: 250px;\n  height: 250px;\n  margin: 0 auto;\n  -webkit-border-radius: 4px;\n  -moz-border-radius: 4px;\n  -ms-border-radius: 4px;\n  -o-border-radius: 4px;\n  border-radius: 4px;\n}\n/_ line 38, ../../../../.rvm/gems/ruby-1.9.3-p392/gems/compass-0.12.2/frameworks/compass/stylesheets/compass/utilities/general/_clearfix.scss /\n.lb-outerContainer:after {\n  content: \"\";\n  display: table;\n  clear: both;\n}\n/* line 44, ../sass/lightbox.sass */\n.lb-container {\n  padding: 4px;\n}\n/* line 47, ../sass/lightbox.sass */\n.lb-loader {\n  position: absolute;\n  top: 43%;\n  left: 0%;\n  height: 25%;\n  width: 100%;\n  text-align: center;\n  line-height: 0;\n}\n/* line 56, ../sass/lightbox.sass */\n.lb-cancel {\n  display: block;\n  width: 32px;\n  height: 32px;\n  margin: 0 auto;\n  background: url(../img/loading.gif) no-repeat;\n}\n/* line 63, ../sass/lightbox.sass */\n.lb-nav {\n  position: absolute;\n  top: 0;\n  left: 0;\n  height: 100%;\n  width: 100%;\n  z-index: 10;\n}\n/* line 71, ../sass/lightbox.sass */\n.lb-container > .nav {\n  left: 0;\n}\n/* line 74, ../sass/lightbox.sass */\n.lb-nav a {\n  outline: none;\n}\n/* line 77, ../sass/lightbox.sass /\n.lb-prev, .lb-next {\n  width: 49%;\n  height: 100%;\n  cursor: pointer;\n  / Trick IE into showing hover */\n  display: block;\n}\n/* line 84, ../sass/lightbox.sass /\n.lb-prev {\n  left: 0; \n  float: left; \n  background: url(../img/prev.png) left 48% no-repeat;\n}\n/ line 87, ../sass/lightbox.sass */\n.lb-prev:hover {\n}\n/* line 90, ../sass/lightbox.sass /\n.lb-next {\n  right: 0;\n  float: right;\n  background:url(../images/img/next.png) right 48% no-repeat;\n}\n/ line 93, ../sass/lightbox.sass */\n.lb-next:hover {\n}\n/* line 96, ../sass/lightbox.sass _/\n.lb-dataContainer {\n  margin: 0 auto;\n  padding-top: 5px;\n  zoom: 1;\n  width: 100%;\n  -moz-border-radius-bottomleft: 4px;\n  -webkit-border-bottom-left-radius: 4px;\n  border-bottom-left-radius: 4px;\n  -moz-border-radius-bottomright: 4px;\n  -webkit-border-bottom-right-radius: 4px;\n  border-bottom-right-radius: 4px;\n}\n/_ line 38, ../../../../.rvm/gems/ruby-1.9.3-p392/gems/compass-0.12.2/frameworks/compass/stylesheets/compass/utilities/general/_clearfix.scss /\n.lb-dataContainer:after {\n  content: \"\";\n  display: table;\n  clear: both;\n}\n/* line 103, ../sass/lightbox.sass /\n.lb-data {\n  padding: 0 4px;\n  color: #bbbbbb;\n}\n/ line 106, ../sass/lightbox.sass /\n.lb-data .lb-details {\n  width: 85%;\n  float: left;\n  text-align: left;\n  line-height: 1.1em;\n}\n/ line 111, ../sass/lightbox.sass /\n.lb-data .lb-caption {\n  font-family: Verdana, Geneva, sans-serif;\n  font-size: 14px;\n  font-weight: bold;\n  line-height: 1em;\n}\n/ line 115, ../sass/lightbox.sass /\n.lb-data .lb-number {\n  font-family: Verdana, Geneva, sans-serif;\n  display: block;\n  clear: left;\n  padding-bottom: 2.5em;\n  font-size: 11px;\n  color: #999999;\n}\n/ line 121, ../sass/lightbox.sass /\n.lb-data .lb-close {\n  display: block;\n  float: right;\n  width: 30px;\n  height: 30px;\n  background: url(../img/close.png) top right no-repeat;\n  text-align: right;\n  outline: none;\n  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=70);\n  opacity: 0.7;\n}\n/ line 130, ../sass/lightbox.sass */\n.lb-data .lb-close:hover {\n  cursor: pointer;\n  filter: progid:DXImageTransform.Microsoft.Alpha(Opacity=100);\n  opacity: 1;\n}\nWhat is the problem here? the next is work, but the prev and close is no show.  Help!!\n. ",
    "milk007": "Yes, I have the same issue in IEs.\n. ",
    "waileagolfer": "I actually figured it it after \"staring\" at the code for awhile. I didn't close my link tags properly and it was making every element in my divs act a a link to the lightbox. Hope this helps someone else. \n. ",
    "crauliuc": "It has the right HEIGHT, but not the right WIDTH.\nHow do I change that?\n. ",
    "pinjula": "It would be a great feature, adding a vimeo or youtube video instead of the picture.\n. ",
    "tkwidmer": "cosigned. \n. ",
    "HericamPhantes": "PLEASE! I'm working with your tool, and I dont want to switch to FancyBox or anything else for now.\nHere is a little solution for Youtube in Fancybox, but I don't have the java skills to Convert this for Lightbox: http://www.sebastianstoehr.de/blog/youtube-videos-in-lightbox/ Maybe you do!\nI Hope so! Please notifie me, if..\n. ",
    "KaduAmaral": "+1\n. @MarcGodard you can do this with active too. Just send a pull request after.\n. @MarcGodard, I think it's maintained, have a some issues closed at few days ago. But maybe is better wait an answer.\n. ",
    "stevejepp": "+1\n. ",
    "oswaldoacauan": "+1\n. ",
    "ShellyTan": "Agreed with the above! Would be fantastic.\n. ",
    "danniejpt": "+1 It would be awesome with video\n. ",
    "stephen304": "Is this ever going to happen?\n. ",
    "sonizef": "+1 ! When ? :)\n. ",
    "Hedde": "+1\n. ",
    "MarcGodard": "+1\n. Is this project still active? If not, maybe I can fork it and add this functionality.\n. @KaduAmaral I know that. But if they are not maintaining it, why would they accept my pull request? Thats why I asked... \n. ",
    "danielgwilson": "+1\n. ",
    "philipstratford": "+1\n. ",
    "mehdiraized": "+1\n. ",
    "Dan233": "I m begging for you to add this feature. Please \n. ",
    "onpointmedia": "I, too, would like to do this.  I see version 2.03a had this option using a rev attribute.  Obviously, that does not work with the newer version.  I tried inserting a link in the title tag, but that didn't work.\n. ",
    "jimlongo56": "I struggled with this for quite a while, and as much as I like lightbox2 I ditched it in favor of Fancybox where it is much easier to implement a clickable element inside the data display of the lightbox.\n. Should be able to move the html near the top of the javascript around without too much problem. Move the lb-dataContainer above the kb-container.\nhtml\n<div id='lightboxOverlay' class='lightboxOverlay'></div><div id='lightbox' class='lightbox'><div class='lb-outerContainer'><div class='lb-dataContainer'><div class='lb-data'><div class='lb-details'><span class='lb-caption'></span><span class='lb-number'></span></div><div class='lb-linkContainer'><a class='lb-link'></a></div><div class='lb-closeContainer'><a class='lb-close'></a></div></div></div><div class='lb-container'><img class='lb-image' src='' /><div class='lb-nav'><a class='lb-prev' href=''></a><a class='lb-next' href=''></a></div><div class='lb-loader'><a class='lb-cancel'></a></div></div></div></div>\n. I eventually used Fancybox where it is much easier to implement this functionality.\n. ",
    "ztratar": "Why was this closed? I can't personally find an accessible function to re-initialize lightbox.\n. ",
    "LeOSW42": "I need the answer too, because I don't find a way to do that.\n. So I'm stupid, that works fine by default, just needed to add the tag to the link and not the img\n. Works fine, already used on prod server\n. ",
    "reneroth": "For me this is not working by default, looking for a solution now...\n. this very simple snippet solved it for me:\nif(!jQuery('#lightbox').length) {\n  lightbox.init();\n}\n. ",
    "Crazydoub": "I got the same problem with high height pages...\nI tried:\no=f.scrollTop()+f.height()/50;\ninstead of \no=f.scrollTop()+f.height()/10;\nIt solved problem.\n. ",
    "fgrs": "in my opinion it should be v-centered by default\n. ended up using jquery trigger\n. use jquery trigger to simulate click event on your lightbox element\n$('button').on('click', function() {\n    $('.lightbox').trigger('click');\n});\n. ",
    "JohnnieMacarroni": "Does anyone has a solution for the actual lightbox2 version?\nNow the var top is set like this;\n      var top  = $window.scrollTop() + this.options.positionFromTop;\nand positionFromTop is already set to 50, but it still doesn't center vertically when the image height is significantly smaller than the browser's..\nAny help would be appreciated.\nThanks.\n. Thank you for you help gTempesta.\nWill try it to see if it works.\n. ",
    "aminalhazwani": "I have the same problem as @JohnnieMacarroni. For images significantly smaller than the browser window the lightbox is not aligned vertically. Any fix?\n. Thank you very much to all of you for the effort and the precise suggestions!\n. In my case only setting this.fadeDuration = 0; \"fixed\" the problem. Any solution without sacrificing the fade? (Chrome 34.0.1847.116 on OSX 10.9.2)\n. Adding this css rule .lightboxOverlay { overflow: scroll; } fixed the problem w/o sacrificing the fade.\n. So far I haven't noticed any\n. Can you attach a screenshot of the double scrollbar because I cannot replicate it, thanks.\n. Please refer to this issue: https://github.com/lokesh/lightbox2/issues/187\nAdding .lightboxOverlay { overflow: scroll; } fixed it for me.\nTake a look at the linked issue for further fixes for possible side effects. \n. I would also love to have such a feature!\n. ",
    "gtempesta": "Hi @aminalhazwani and @JohnnieMacarroni , I made a few tweaks to the original code as I didn't find any other way of defining it from outside. \nInside the start function, at around line 170 I commented out the assignation of the 'top' property, like this: \n// Position Lightbox\n  var top  = $window.scrollTop() + this.options.positionFromTop;\n  var left = $window.scrollLeft();\n  this.$lightbox.css({\n    // top: top + 'px', // comment out this line\n    left: left + 'px'\n  }).fadeIn(this.options.fadeDuration);\nThen inside the changeImage function, at line 232, after this declaration \nself.sizeContainer($image.width(), $image.height());\nI added those lines: \n```\n    var window_height = windowHeight;\n    var img_height = $image.height();\n    var scroll_offset  = $(window).scrollTop();\n    var view_offset = window_height/2 - img_height/2;\n    var top_distance = scroll_offset + view_offset;\nself.$lightbox.css('top', top_distance+'px');\n\n```\nThis should center the image vertically. \n. ",
    "paexthetiker": "Awesome! Works like a charm! \nJust a tip: If you don't want the box to jump around when the height changes, go into the lightbox css and add\ncss\n-webkit-transition: top 300ms;\n-moz-transition: top 300ms;\n-o-transition: top 300ms;\ntransition: top 300ms;\nto the .lightbox class. This animates it to the new position.\n\nUpdate: Shortened the duration as noted by @PortaMx . Good point, thanks! \n. ",
    "Soullighter": "@gTempesta Thank you man. It works\n. ",
    "PortaMx": "works perfect .. as small note .. the ccs above must be add to the class .lightbox{\nand the time of 1 seconds is a little bit long, better you use 0.3s\n. ",
    "jonathansigg": "```\nlightboxOverlay { position: fixed !important; top: 0; left: 0; height: 100% !important; width: 100% !important; }\nlightbox { position: fixed !important; top: 50% !important; transform: translateY(-50%); }\n```\n. ",
    "alexrocco": "@jonathansigg \nWorks perfect! Thanks.\n. ",
    "StudioZut": "@jonathansigg that is exactly what I was looking for, thanks!\n. ",
    "d2a-raudenaerde": "\n```\nlightboxOverlay { position: fixed !important; top: 0; left: 0; height: 100% !important; width: 100% !important; }\nlightbox { position: fixed !important; top: 50% !important; transform: translateY(-50%); }\n```\n\nThis makes my image blurry.. ",
    "nothingrandom": "Found a fix, I'm just going to cross browser test it and then submit.\n. Nope, found the actual problem. The download link on the website doesn't download the latest .css file (which has the same fix that I was going to suggest).\n. ",
    "Eveyy": "Same problem here. I was testing with both aspx and html pages in chrome. The align was fine on the html page but off on aspx. I also tested with IE later which worked fine. Any idea on how to fix it?\n\n. ",
    "adis-io": "Yes, I have the same issue with overlay.\nAt first click - it's working. After I close lightbox and open again it's not working.\nUpdated: \nIt seems to me I solved this problem.\nAdd this rule to css:\n.lightboxOverlay { overflow: scroll; }\n. awilson3rd\nAdd this rule to css:\n.lightboxOverlay { overflow: scroll; }\n. ",
    "awilson3rd": "Hello, \nI am having this issue with the latest version of chrome. I see the black background image in IE and FF but in Chrome the background does not appear. \nAny ideas on how to fix? The demo works ok on your page but when I view the demo on my server I don't see the background. \nThanks \nAndrew\n. Didn't work. In the end I found this and it worked for me by applying to the overlay css:\nhttp://stackoverflow.com/questions/22448086/lightbox-overlay-not-displaying-on-chrome-but-works-well-on-chrome-canary\nThanks \nAndrew\n. ",
    "dg-ratiodata": "This\ncss\n.lightboxOverlay { overflow: scroll; }\nfixes the problem for me as well. I'm using Chromium Version 34.0.1847.116 (260972). \n@lokesh \nWould you mind to add the css-code to lightbox? Thanks.\n. ",
    "davidecarzaniga": "overflow: scroll; worked for me as well.\n. ",
    "mafigit": "I was not sure if I should ship the 'compiled' css and js files. \n. ",
    "johansmitsnl": "Should it not be better to use an icon font with spinner functionality instead of images? #556 . ",
    "izifortune": "Basically support, still need to figure where to call the options\n. ",
    "GeorgeTodea": "Hello, I need to disable the preloading images. Can you tell me again which line is to be removed from showImage() method? Thank you.\n. ",
    "rageforst": "Same here, on IOS browsers like safari and chrome, if you use a lot of high resolution images in the same group the page doesn't load… when I reduce the number of images it works, wich line do we need to remove in the shoyImage() method?\n. ",
    "creativityhurts": "I can confirm. This used to work on older version of Chrome. Right now the lightboxOverlay appears only after resizing the window.\n. The only fix that I found for this so far was to set the fadeDuration to 0.\n. ",
    "siegfriedgrimbeek": "I too can confirm this error. Setting the fade duration to 0 does work but looks really bad when closing the lightbox.\nReplace:\n this.$lightbox.fadeOut(this.options.fadeDuration); this.$lightbox.fadeOut(\"slow\");\n this.$overlay.fadeOut(this.options.fadeDuration); with this.$overlay.fadeOut(\"slow\");\nThis does the trick!\n. ",
    "PeterWalk": "Thanks guys,\nit seems, that this trick with fadeDuration 0 and fadeOut(\"slow\") works!\nI experimented then with the fadeIn, because with Duration 0 it isn´t so nice, but when I replaced it with (\"slow\") too, the bug will appeared again :-/\n. ",
    "quids": "I'm having this issue also. Would be great to hear when there is a solution as I'm using it for a site that's ready to launch! Thanks.\n. Solved the mystery on mine at least. Don't know why but it was being caused by having a line-height set on the body tag in the main css doc for my site. When I removed this it fixed the issue.\n. ",
    "sashkanz": "What is interesting that such issue doesn't replicated for me on lighbox main page http://lokeshdhakar.com/projects/lightbox2/\nBut it does on my project, I wonder what causes it, my chrome version is 33.0.1750.154 m \n. That's fix it in chrome only, firefox,safari, ie11 still have these scrollbars\nThis is what I came up with:\n@media screen and (-webkit-min-device-pixel-ratio:0)\n{ \n    .lightboxOverlay { overflow: scroll; }\n    .lightboxOverlay::-webkit-scrollbar { width: 0px; }\n}\n. ",
    "lipoh": "I have found way to partly overcome this Chrome bug.\nIn lightbox.js after line 188\njavascript\nthis.$overlay.fadeIn(this.options.fadeDuration);\nI have putted those lines:\njavascript\n// Select current height with jQuery\nvar TmpHeigh = this.$overlay.css('height');\n// Set new css property value with 1px less to force Chrome touch the element.\nthis.$overlay.css('height', parseFloat(TmpHeigh)-1);\nWhen Chrome fails to animate the overlayer, the change of css will force Chrome to show the layer as it is.\nThe final flow of window is not so pretty, but at least the overlay appears. This change also seems to has not impact on another browsers, which are capable to animate the overlay.\n. ",
    "Lakshmana515": "I have the same issue, overlay not appearing in Chrome Version 33.0.1750.154 m Windows 8.1, but i do see also on the lightbox main page it is working.. \n. ",
    "IvicaCulina": "Something similar is happening to me. When i open the site in chrome the overlay works just as it should. But when i include the Google map API javascript in my site overlay doesn't show until i resize the browser window. \n. ",
    "Triloworld": "Problem with lightbox.\nOverlay don't show until like said lokesh: If you resize the window or have Developer Tools open and mouse over an element in the Elements panel \"\nAnd don't use screen.css.Using this script to reproduce problem:\nhttp://code.jquery.com/jquery-1.11.0.min.js\nmodernizr-2.6.2-respond-1.1.0.min.js\nbootstrap.min.js\nlightbox-2.6.min.js\njquery.scrollTo.min.js\njquery.localScroll.min.js\nstatic/js/prefixfree.min.js\nlightbox-2.6.min.js\nhttps://maps.googleapis.com/maps/api/js?v=3.exp&sensor=false\"\n. ",
    "elahmo": "Any updates regarding this, is there a way to keep the fade effect but show the overlay?\n. This did it!\nDid you notice any side effects of this?\n. ",
    "mcurtin": "The overflow:scroll did resolve the issue in Chrome. Thanks for finding this! The one issue that I am noticing now is obviously the double scrollbar that now appears with the overlay. There is a quick line of CSS that can be added to remove this.\n.lightboxOverlay { overflow: scroll; }\n.lightboxOverlay::-webkit-scrollbar { width: 0px; }\nThis worked perfectly to hide that extra scroll that appears in the overlay.\n. The addition of the @media screen and (-webkit-min-device-pixel-ratio:0) worked for me as well. This ensures that the overflow:scroll is only applied in the Chrome browser. Here is a screenshot of the double scrollbar that appears in other browsers if this is not applied.\n\n. ",
    "DonSandini": "overflow:scroll; did the job for me too!!!\nI also added width:101%!important; so that blank space could be filled up.\n. ",
    "misak113": "I fixed the overlay rendering in chrome using webkit specific CSS. No other browsers are affected ;)\n.lightboxOverlay {\n    @media screen and (-webkit-min-device-pixel-ratio:0) {\n        overflow: scroll;\n        &::-webkit-scrollbar { width: 0px; height: 0px; }\n    }\n}\n-- Written in LESS --\n. ",
    "mplax7": "Should I expect this to fix escaping issues? In my very little experience and knowledge, it doesn't seem like that would fix anything. In my test cases, I am still getting issues with it not escaping.\nAny further help without face palms would be appreciated!\n. Thanks for the quick response!\nI still have everything running locally so I will try to describe my issue:\nIf I put something like \"(p tag)Test(end p tag) case\" it will escape correctly in the browser, but when I open the lightbox, the title shows up as:\nTest\ncase\nHope this helped. Thanks again!\n. ",
    "ties-v": "@mplax7 What do you expect? Do you expect the title to be <p>Test</p> case?\nBecause if you want that, you have to escape the < and > sign. You can do that by replacing < by &lt; and replacing > by &gt;\nThose codes are called html special charters. For more information and an escape library, search the web\n. Set the option fitImagesInViewport to false in lightbox.js and lightbox.min.js\n. You have to set this option in the lightbox.js and lightbox.min.js file. At the beginning of the file there are the options and there you can set them.\n. The current Lightbox cant open other media types than images. It could be added in the future, but it depends on how much time you and other users are willing to put into adding support for videos.\n. Insert an image tag in the link, like <a href=\"img/image-1.jpg\" data-lightbox=\"image-1\" data-title=\"My caption\"><img src=\"img/image-1.jpg\" width=\"150\" height=\"150\"/></a>\nIn the future: Please post specific support questions on http://stackoverflow.com. Make sure to include a link to the page where the problem exists. Thanks.\n. The url of the <a> tag differs from the image source in the <img/> tag. The link in the <a> tag points to the rotated image.\nIn the future: Please post specific support questions on http://stackoverflow.com. Make sure to include a link to the page where the problem exists. Thanks.\n. @dvdobrovolskiy I now confirm this weird problem. I apologize that I thought it was easy at first. I'm looking into it.\n. I've looked into it and this are some facts:\n- When I enter the image address directly into my browser, a correct image appears.(both in Chrome and Firefox).\n- When I inspect the image via the inspector (Firebug, or the build in in Chrome), the image preview shows also a rotated image. (And the preview is usually raw.) See de enclosed images.\nChrome:\n\nFirefox:\n\nI suggest it is something with your server configuration. I've not jet figured out what exactly, but some facts that support this theory: When I send a custom request with my browser (via an addon), I receive also the rotated image. I have also tried to make a request without cookies and without referer, but it didn't change anything. But when I make a request with curl via the command line, I receive the right (not rotated) image. \nThis is all I've found out, I hope you can do something with it.\n. What do you mean with horizontal layout? Can you give an example?\n. You have included the lightbox script twice. You include lightbox.js AND lightbox.min.js. You should choose one of them. lightbox.min.js is the minified version of lightbox.js and causes faster load times. So that file is recommended on a production websites.\n. ",
    "fujaru": "Hi,\nI was having a problem opening links within the caption in a new window using target=\"_blank\"\nHowever, I'm able to solve it by changing the line:\nlocation.href = $(this).attr('href');\ninto:\nwindow.open($(this).attr('href'), $(this).attr('target') || '_self');\nThis code will open the link in a (new) window based on 'target' attribute, or in the same window if not specified.\nLightbox rocks!\n. ",
    "wbob": "your version of lightbox,js lacks \"this.positionFromTop\". my suggestion would be to download a current version and replace the files. I just tried with your website and it works fine.\n([minified] \"o = f.scrollTop() + f.height() / 10;\" vs \"var top  = $window.scrollTop() + this.options.positionFromTop;\")\n. ",
    "OndrejZeman": "Wbob: Thanks a lot! Now, all is working as it should.\n. ",
    "jhnvz": "Thanks! I already forgot about this PR ;)\n. ",
    "patrickmulcahy": "Sorry I apologise, I'm new to this forum. thanks for the help I appreciate it. \n. ",
    "dvdobrovolskiy": "The url of the <a/> tag certainly differs from the image source in the <img/> tag. The link in the <a> tag points to the non rotated image. It points to a bigger image. \nso\nurl http://faktura72.ru/%D0%A3%D1%81%D0%BB%D1%83%D0%B3%D0%B8/%D0%9D%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5-%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA\nFirst image html is\n<a data-lightbox=\"image-1\" href=\"/Portals/10/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA%2025.JPG?timestamp=1397556395440\"><img alt=\"\" src=\"/portals/10/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA%2025-25.jpg\" /></a>\nAnd here is an image (<img> tag) http://faktura72.ru/portals/10/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA%2025-25.jpg\nand the link to a bigger image \nhttp://faktura72.ru/Portals/10/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA%2025.JPG?timestamp=1397556395440\nIt different image but it is not rotated. It rotated by click on smaller image with activation of lightbox2 script.\nI do not need support really. I can switch to any other popup scripts. \n. it looks pretty normal for me. And column standing here. And it is an url. But if you open it via lightbox it rotated.\n. sure. I believe it somehow dependant on picture hight / width ratio as some images opens normal.\n. I also noticed rotated images in inspector. I see get request to an original image but chrome inspector give me rotated preview. \nI have IIS where but there is no filters or extensions or other thing that might modify content in such a way (it is a deliberate rotation - it takes a calculative power at least to convert)\nAlso I noticed that it takes a time while lightbox opens big image that makes me think that rotation goes on client side. \nPS wget http://faktura72.ru/Portals/10/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA/%D0%BD%D0%B0%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D1%82%D1%83%D0%BA%D0%B0%D1%82%D1%83%D1%80%D0%BE%D0%BA%2025.JPG?timestamp=1397556395440\ngives me original image - http://dobrovolskiy.com/z/z.jpg (I renamed image as its utf-8 name corrupted). No blame to server.\nI suggest it is some JQuery feature. Can you trace javascript?\n. Nope, still an issue.\n. ",
    "JeanHules": "Was this ever resolved? \n. ",
    "cmatteri": "I believe the issue described here occurs because browsers do not honor the Exif orientation when displaying images declared in html (http://stackoverflow.com/questions/12026441/is-there-a-way-to-tell-browsers-to-honor-the-jpeg-exif-orientation).  In Firefox (and probably other browsers), when the image file itself is opened, the Exif orientation is honored and the image is rotated.  Thus the difference in rotation between contexts.\nThere is a simple solution that will give the correct orientation in any context, while preserving image metadata.  Set the Exif orientation to 1 (top-left), then rotate the image to the desired orientation.  You may need to be careful during the second step, as it is conceivable that some programs would alter the Exif rotation rather than actually rotating the image.  My preferred tool is Imagemagick's convert utility, which performs both operations with the -auto-orient option:\nconvert input.jpg -auto-orient output.jpg\nIf an Exif thumbnail is present, it will not be rotated by the above command.  There are several tools that can extract, insert, or regenerate Exif thumbnails.  If you don't update the thumbnail, it should be removed, for example with ExifTool:\nexiftool -ThumbnailImage= image.jpg\n. ",
    "davidsusu": "UPDATE: I was incorrect, this anomaly always happens when I doubleclick on the arrow icon.\n. ",
    "tombresson": "Yeah, this fix definitely works. It should be committed to the main trunk.\n. ",
    "Bakaroo": "I have the same problem.  I made a series of lightbox images, all starting at one thumbnail.  It works, but it starts with the last image.  I tried inserting the code \"rangepic\" in the a href=  but then it did not work at all.\n. This is the way I activated it and when I click on the thumb it always starts with 2 out of 2.  I am using a n iMac, OSX 10.9.4 Otherwise it works just right.  Any suggestions?\n\n. \n. \n. ",
    "geoffbrowne": "I have this issue also. Please see http://www.warehamwednesdays.org/Gallery.html\nAny chance you could look at this please Lokesh ?\nGeoff.\n. ",
    "maximus33": "Yes, yes, yes!!!! I would like this feature very much!! Without the use of downloading an image, I might have to turn to another lightbox, but I really like this one, so could someone please code the files so there is a download image button?? Thank you very much to all creators!\nRobert Alexander\n. ",
    "amastaneh": "+1\n. ",
    "JimmyGlee": "My URL : lme.flyingkids.be\n. ",
    "rpeq": "Same issue here using Chrome (version 34) on Windows 7 Professional, overlay doesn't show when viewing an image, yet when resizing the window it shows. \nAlso works when setting 'fadeDuration' to 0.\n. ",
    "neilhem": "Can you show code example in jsfiddle?\n. ",
    "fubarhouse": "It appears that any a tag is not clickable, where as the images in the core are triggering javascript onclick.\nCommit #194 fixes this once patched correctly.\n. +1\n. ",
    "Caseylyndesign": "How did you do this? I am trying to get the light box to open with a < button onclick=\"\" > any suggestions?\n. ",
    "rob-gordon": "+1\n. ",
    "drdexter1989": "Just do this with javascript\n$(document).ready(function(){\n   $('#element').trigger('click');\n});\n. @dcr07 is simple just set javascript setTimeout(function(){ put your code here to close lightbox },30000);\n. ",
    "dcr07": "Using this method to have the lightbox automatically open, is there a way to set it so that it will close automatically after a set period of time?  That is, the user would still be able to click to close the lightbox but, if they did nothing, the lightbox would automatically close after, say, 30 seconds.\n. ",
    "Hydrothermal": "Lightbox is only for displaying images. I suggest the alternative plugin Fancybox if you want to add HTML content to your lightboxes.\n. ",
    "LukeXF": "Would be nice to be able to move the description of the images to the right hand side, rather than below; it would help for people who want to explain a particularly large amount of text, but keeping it within the page as most people have widescreen monitors.\n. ",
    "munkh-altai": "i was made by myself http://brigad.mn/brigad/273\n. ",
    "targor": "Copy that question for me :)\n. ",
    "leandroruel": "please, close, you not provide any description\n. this plugin is very, very simple. you can choose another image/content gallery plugin.\n. remove this =>  target=\"_blank\"\n. check if any error appear on dev tools.\n. i can't reproduce this here.\n. nope, only images, use shadowbox to do it.\n. ",
    "herrDerToene": "Same here\n. ",
    "Fudoshiki": "Its ur fault, check more about turbolinks for rails. \nhttp://habrahabr.ru/post/167161/\n. ",
    "berliner14": "Hi, awesome! I updated the site right now and recognized that the nav completely is missed. Actually I want that the user can switch between the pictures. I would be happy to get one more time help.\nAntje\n. ",
    "applibs": "This can happen at many ways: when bad connection, when file is deleted with other user and actual user have opened old content, etc.\nWhen I found this issue, believe me that many people have same problem without reporting it.\n. ",
    "mjumartin": "It's the empty src attribute that does it. You need to set the default <img class='lb-image' src='' /> to be not empty. One solution which worked perfectly for me is setting src=\"//:0\" in lightbox.js... the snippet below.\njavascript\n$(\"<div id='lightboxOverlay' class='lightboxOverlay'></div><div id='lightbox' class='lightbox'><div class='lb-outerContainer'><div class='lb-container'><img class='lb-image' src='//:0' /><div class='lb-nav'><a class='lb-prev' href='' ></a><a class='lb-next' href='' ></a></div><div class='lb-loader'><a class='lb-cancel'></a></div></div></div><div class='lb-dataContainer'><div class='lb-data'><div class='lb-details'><span class='lb-caption'></span><span class='lb-number'></span></div><div class='lb-closeContainer'><a class='lb-close'></a></div></div></div></div>\").appendTo($('body'));\n. ",
    "camilos": "That worked fine. I updated the StackOverlow question to mention your solution. Thanks again.\n. ",
    "Donov4n": "@lokesh Please accept this merge request, releases/ folder is huge (7+mb) and make use of this package completely useless with bower.\n\n. ",
    "yavorskiy": "@lokesh any chance to get this merged?\n. ",
    "MadBender": "The Lightbox itself does not process any EXIF information, it leaves that to browser.\nAnd it looks like browsers do not respect EXIF orientation if the image is put on page in the img tag or as background image. See this basic example with your own image: http://jsfiddle.net/vk26Q/4/\n. ",
    "pdevine": "My solution is to process the image ahead of time using ImageMagick.  If you look at the exif:Orientation field, it will give you an integer between 1 and 8 which describes the rotation.  You can get some more info here:  http://sylvana.net/jpegcrop/exif_orientation.html\n. ",
    "kiwifraise": "I had exactly the same need, and finally I added the data-title attribute to the link, and you can put html inside.\nSo, putting a  tag will add a new line :)\n. ",
    "EJBarnes": "I realized I could embed HTML in the line; I just wanted to know if there were special tags for different lines. I guess that's what I'll do -- insert a  and use different font modifiers such as  and such.\n. ",
    "vildhjarta8": "+1. I have a similar problem:\nhttp://screencast.com/t/VjGqd0z0\n. ",
    "bluetidepro": "I also have this problem. Anyone have a fix?\n. I'm having this same issue.\n. ",
    "JapArt": "+1\n. ",
    "uliworm": "i also have this issue. and i have the js included in the photos.php.  maybe that the problem. is it working without ajax and having the js in the header?\n. ",
    "jjmartens": "http://stackoverflow.com/questions/18269367/lightbox2-width-automatically-sets/18530054#18530054\nthis might help\n. ",
    "gentoomaniac": "Have you tried putting the other images in a hidden div?\n. ",
    "evanonearth": "Thanks, that does work using {display: none;} as long as all the images have the same lightbox class.\n. ",
    "tslpdsgn": "I am trying to do the same thing but using php to pull the images from a directory into the hidden div with no success, the lightbox is popping up but just continually loading and not displaying any photos.\nThe code inside the hidden div is:\n<?php $dirname = \"img/love/\";\n$images = glob($dirname.\"*.jpg\");\nforeach($images as $image) {\necho '<img data-lightbox=\"love\" src=\"'.$image.'\" /><br />';\n} ?>\nis this possible? and if so, how can I get it to work correctly?\nHere is my test page: http://knowledgeoverfame.com/tslp/leet/alt/index.html\nThanks!\n. So I believe I have solved my own dilemma here...\n<?php\n            $dirname = \"img/my_directory\";\n            $images = scandir(\"./img/my_directory/\");\n                foreach ( $images as $key => $filename ) {\n                    if ( $key > 1 ) {  //ignores the first two values which refer to the current and parent directory\n                        echo '<a href=\"'.$dirname.\"/\".$filename.'\" data-lightbox=\"love\"><div id=\"thumb\"><img src=\"'.$dirname.\"/\".$filename.'\" height=\"150px\" /></div></a>';\n                    }    \n                } \n            ?>\n. ",
    "fabamatic": "I am no expert either, but I had a similar issue that was fixed by making sure that html and body tags of the main page had height style at 100%\n. ",
    "cqianhui": "@fabamatic  Sorry, but what do you mean by the html and body tags of the main page? Mind pointing it out from my website? Thank you so much!\nhttp://cherrynut.sg/high-collar-lace-blouse.html\n. ",
    "dreamcoder8": "Hello Sam,\nCan you provide link to your website.\nRegards\nHitesh\n. Hello Sam,\nIf you look into inspect element, you will see that complete about as slide is loading twice which is not an issue of light box, that why it's showing twice. search for \"about Ceiling lights\" on inspect element you will get what i mean.\nRegards\nHitesh\n. ",
    "iloft": "Yes of course. www.iloft.co.uk#iloft about\nThen on the right please klick the link (Lights)\nRegards\n Sam\n\nOn 1 jul. 2014, at 00:39, \"dreamcoder8\" notifications@github.com wrote:\nHello Sam,\nCan you provide link to your website.\nRegards\nHitesh\n—\nReply to this email directly or view it on GitHub.\n. Thank you Hitesh,\nunfortunately I can't find out how to fix this problem.\n. \n",
    "marc3ll1nux": "This message was created automatically by mail delivery software.\nA message that you sent could not be delivered to one or more of its\nrecipients. This is a temporary error. The following address(es) deferred:\nmarcellinux86@gmail.com\n    Domain marcellinux.it has exceeded the max emails per hour (101/100 (101%)) allowed.  Message will be reattempted later\n------- This is a copy of the message, including all the headers. ------\nReceived: from github-smtp2-ext7.iad.github.net ([192.30.252.198]:50223 helo=github-smtp2a-ext-cp1-prd.iad.github.net)\n    by srv-hp11.netsons.net with esmtps (UNKNOWN:DHE-RSA-AES256-GCM-SHA384:256)\n    (Exim 4.82)\n    (envelope-from noreply@github.com)\n    id 1X1pUU-000p4d-AG\n    for info@marcellinux.it; Tue, 01 Jul 2014 06:16:22 +0200\nDate: Mon, 30 Jun 2014 21:16:19 -0700\nFrom: Ryjobo notifications@github.com\nReply-To: lokesh/lightbox2 reply@reply.github.com\nTo: lokesh/lightbox2 lightbox2@noreply.github.com\nMessage-ID: lokesh/lightbox2/issues/262@github.com\nSubject: [lightbox2] auto change? (#262)\nMime-Version: 1.0\nContent-Type: multipart/alternative;\n boundary=\"--==_mimepart_53b23613223e5_5f5a3ff7fc6252bc2389ae\";\n charset=UTF-8\nContent-Transfer-Encoding: 7bit\nPrecedence: list\nX-GitHub-Recipient: marc3ll1nux\nList-ID: lokesh/lightbox2 \nList-Archive: https://github.com/lokesh/lightbox2\nList-Post: mailto:reply@reply.github.com\nList-Unsubscribe: mailto:unsub+i-36861163-b638cfe9eae5e5a9b8d0440738cd793d5c842d69-1047025@reply.github.com,\n https://github.com/notifications/unsubscribe/1047025__eyJzY29wZSI6Ik5ld3NpZXM6TXV0ZSIsImV4cGlyZXMiOjE3MTk4MDczNzksImRhdGEiOnsiaWQiOjM1OTI1NDUxfX0=--9a8db564ff450e800056aba8bcc38812465ffceb\nX-Auto-Response-Suppress: All\nX-GitHub-Recipient-Address: info@marcellinux.it\n----==_mimepart_53b23613223e5_5f5a3ff7fc6252bc2389ae\nContent-Type: text/plain;\n charset=UTF-8\nContent-Transfer-Encoding: 7bit\nis there a way to make these images in the lightbox cycle automatically? if so can someone help me with the code?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/lokesh/lightbox2/issues/262\n----==_mimepart_53b23613223e5_5f5a3ff7fc6252bc2389ae\nContent-Type: text/html;\n charset=UTF-8\nContent-Transfer-Encoding: 7bit\nis there a way to make these images in the lightbox cycle automatically? if so can someone help me with the code?\n—Reply to this email directly or view it on GitHub.\n----==_mimepart_53b23613223e5_5f5a3ff7fc6252bc2389ae--\n. ",
    "rgloginja": "Also would like to see this implemented - more so the download button.\n. ",
    "anonemuss24": "Hi, \nWell, \nI`m not sure what u exactly mean but my best guess would be u want a map which should have links in it (normally defined with area and coords). I d say u just need to add the lightbox attributes within that link /area)\nMay I ask what exactly do u mean with u cant \"change the index\" ...?\nGreetings,\nAnonemuss24\n. ",
    "ajaywankhare": "some part of image at right its going out\nplease help me out how to keep it in proper section i made\nits not getting in that box \ni tried editing it \nplease help \nhow to edit\n. ",
    "MediaCarbon": "?I believe your problem is easily solved.  I always link the image to a larger version (or if I can't, I'll use the larger image as both the displayed and the linked image (just size it down for the displayed)).\nIn your example the image you linked to is very small, see below:\n[cid:e0deb0c1-c21a-453a-b354-e8392c445780]\nChris Leeds\nMediaCarbon, Inc.\n(Text/Mobile) 347-4CARBON | 347-422-7266\n(Toll-free) 800-591-5160\n(FB) http://Facebook.com/ChrisLeeds/\n(Skype) ChristianLeeds\n\nFrom: Dmitri Zaitsev notifications@github.com\nSent: Wednesday, July 16, 2014 11:36 AM\nTo: lokesh/lightbox2\nSubject: [lightbox2] Any way to control the image size? (#270)\nThe demo images expand nicely to make use of the screen but I get them too small on my site (http://33hotels.com).\nIs there any way to control their size and location to make better use of the screen?\n\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/270.\n. Instead of trying to do it with actual quotes inside of your required single quotes, try this:\n(Left Double Quotation Mark) “  = “\nRight Double Quotation Mark ” = ”\nJust use the & through the ; in your code and you should be good to go.\nChris Leeds\nMediaCarbon, Inc.\n(Mobile) 347-422-7266 | 347-4CARBON\n(Toll-free) 800-591-5160\n(Skype) ChristianLeeds\n(FB) http://Facebook.com/ChrisLeeds\nFrom: Prosenjit Manna [mailto:notifications@github.com]\nSent: Wednesday, August 27, 2014 1:11 AM\nTo: lokesh/lightbox2\nSubject: [lightbox2] data-title option issue (#301)\nIf i set data-title=\"\"It's About Your Stage Not Your Age\" Headgardeners in the Leader August 2013\"\nor\ndata-title='\"It's About Your Stage Not Your Age\" Headgardeners in the Leader August 2013'\nLightbox caption not display properly. How can I set custom element for data-title\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/301.\n. Two most likely problems:\nThe images aren't uploaded to the server.\nThe paths are slightly different on the server than on your local computer.\nChris Leeds\nMediaCarbon, Inc.\n(Mobile) 347-422-7266 | 347-4CARBON\n(Toll-free) 800-591-5160\n(Skype) ChristianLeeds\n(FB) http://Facebook.com/ChrisLeeds\n\nFrom: sancy007mailto:notifications@github.com\nSent: ý1/ý9/ý2015 8:19 AM\nTo: lokesh/lightbox2mailto:lightbox2@noreply.github.com\nSubject: [lightbox2] Can't load images (#371)\nI get this problem after I upload the script on my webserver? But on my local computer it all works fine. Can some one help me with this issue ?\n[naamloos]https://cloud.githubusercontent.com/assets/10463763/5680219/6a3675a2-980a-11e4-912e-9c9e01d62235.png\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/371.\n. I was just looking at it and was heading in the same direction.  The i-frame threw me off a little.\nCongratulations!\nFrom: sancy007 [mailto:notifications@github.com]\nSent: Friday, January 9, 2015 8:56 AM\nTo: lokesh/lightbox2\nCc: Christian Leeds | MediaCarbon, Inc.\nSubject: Re: [lightbox2] Can't load images (#371)\nOkey, i already found the issue, the extensions of the images where .JPG and i had .jpg in the script.\n—\nReply to this email directly or view it on GitHubhttps://github.com/lokesh/lightbox2/issues/371#issuecomment-69336722.\n. ",
    "dmitriz": "These images have the width 350px, so yes, they are relatively small.\nI don't have a control though, they are on Expedia's server.\nWhat I can do is to stretch them a bit and show either centrally or close to the thumbnail.\nAt present it doesn't look like the Lightbox does any of those. :(\nAny way to solve this problem?\nThanks!\n. My href shows to the big image, so that is not the issue.\n. ",
    "maoanz": "You can probably add some jquery code to change the css , \nthe resolution of the image is still the same, but it will be  definitely more comfortable for user \nto see the image. \nHere a pseudo example: \n$(document).ready(function(){\n          // do something to detect image ratio, and calculate to new width and height\n          var width: xxx; \n          var height : yyy; \n          // find in firebug the name of the container and image\n          // and set the css by jquery. \n          $('.lb-outerContainer').css({\n                 minWidth: xxx; \n                 minHeight: yyy; \n           });\n       $('.lb-outerContainer img').css({\n         minWidth: xxx; \n                 minHeight: yyy; \n       });\n}); \n. ",
    "matheuslc": "I believe this isn't a lib problem. So, a better place for your question is anything like Stack Overflow. But, can you show us the code? Put him in codepe.io, or jsfiddle.com, or just a gist.\n. Here isn't a place for this, if we continue, we make a flood. I called you in Google Hangout for try help you, please, post your question in places like Stackoverflow, Javascript groups and etc.\n. @Redani At moment you can't use percentage values, but I've made a little change and now it works. You can see the pull request and use if you want. Any trouble please speak here.\n. We have to wait the pull request be merged. However, you can download from my fork.\n. @Redani Sorry for that. I make some changes, can you test? Thank you.\n. @Redani Built-in doesn't have this option. But you can override some css and get you close button on the top right.\n. So, the user has to close the modal for have scroll again?\n. I understand. Add another option, like, \"noScroll\" and If this option is true, we block the scroll, if isn't, stay unblocked. What's you think?\n. @Multiflux I made this option, can you test? * I made a pull request, but you can test now downloading from my fork.\n. @Multiflux I'm glad for that, thank you.\n. @WillemII This is a browser implementation, we can't prevent that.\n. +1\nUnfortunately lightbox does not provide that. But this would be helpful.\n. At the moment, the lightbox2  doesn't have this feature. So, If you don't want wait, you have to make it by yourself :(\n. @backlost I think this plugin can help  you.\n. @Slawek24  You don't made anything wrong, but, if you set this.showImageNumberLabel to false, the lb-number have to disappear. You don't changed anything wrong in the code?\n. Can you show me the code or the site url?\n. You have to minify again your lightbox.js after change the variable value.\nYou changed the variable value in the lightbox.js, but you called lightbox.min.js in your page. So, you have to minify again the lightbox.js to lightbox.min.js to apply the changes.\n. What you need?\n. Yes. Set data-lightbox with the same name.\n. +1. I will try\n. ",
    "NickoLabs": "This page is part of an update to a website.\nVisit http://www.distributionsmiro.com/index2.php#produits for the complete beta page.\n. Ok... I suppose that the duplicated images isn't from the library but from a Js conflicting with this library. I'll just use another lightbox script...\nThanks.\n. ",
    "enderoe": "I think it will be a good option to modify the position of the close button as well.\n. ",
    "Kub-AT": "+1\n. ",
    "pankajk1018": "Hi \nIs there any way to add google maps to lightbox\nThanks\n. ",
    "mikealmond": "This was originally fixed in #174 but was not ported from the Coffee Script to the JS version.\n. ",
    "sandord": "I'm surprised as well. Simply replacing var lightbox = new Lightbox(options); by something like window.lightbox = new Lightbox(options); would be enough to allow us to access the options from outside the script through window.lightbox.options. I'm not sure if this would be the most elegant solution though.\n. ",
    "ngonhan2k5": "This is exactly same with my request, #369 may help\n. Because with infiniteLoop enable, bxSlider copy (doubling) the images DOM to prepare for loop display.\nSo you cannot use bxSlider loop and lightbox image set slide at the same time.\nYou could use rel='lightbox' to avoid lightbox create the set\n. Lightbox does nothing with cache. The problem is at browser or your hosting (ex: over proxy), Ctrl-F5 will force browser re-get the images.\n. ",
    "the-real-tokai": "An \"img\" tag without \"src\" is not valid, see: http://dev.w3.org/html5/spec-preview/the-img-element.html\n\"The src attribute must be present, and must contain a valid non-empty URL potentially surrounded by spaces referencing a non-interactive, optionally animated, image resource that is neither paged nor scripted.\"\nI did a similar patch (see pull request #280) which adds a dummy \"data:\" url to the empty src to fix the issues in the browsers. This is not ideal either though. IMHO the whole  tag should first be injected to the html when it is actually needed. I guess that requires a slightly more elaborate patch than our both solutions. ;)\n. ",
    "rulin132": "maybe instead of removing the src tag, which may fix one issue, but introduce other issues, might be better to use the old blank gif trick. a base64 1x1 gif will probably be the best solution if no valid src URL has been provided.\n. I've tested this using the latest PC version of Chrome, Firefox and IE 11 - 8 and seems to work fine.\nWould be nice to see this patch pulled into the Lokesh/lightbox2 repository, in the meantime, I might use this myself.\n. ",
    "MazeChaZer": "I agree. Closing this pull request in favor of #280.\n. ",
    "janmuennich": "I fixed fixed this in janmuennich/lightbox2@d49077fcbcc8ba6c90435c4c1bce5faa36b8bfd0 and created a pull request.\n. ",
    "Semirben": "Thank you Leandro and Jan. The fix Jan provided works perfect.\nGreetings,\nDaniel \n. ",
    "msaliola": "The link - http://www.malaboapd.com.br/espaco-fisico\n. ",
    "JeremyCanfield": "I also am having a problem with Lightbox 2.7.1 in Firefox version 31.  Before version 31 of Firefox, both Lightbox 2.6 and 2.7.1 worked perfectly.  However, now with version 31 of Firefox, the Lightbox opens in a new tab.  I have no problems with Internet Explorer and Google Chrome.  Because I don't have issues with Internet Explorer and Google Chrome, this should confirm that the .js, .css and image files are in the correct directoies in my web server, which I've checked many times to confirm they are in the correct directories.    I set up a very simple page, with the minimum amount of coded needed, here: http://www.jeremyjcanfield.com/images_stage.html.  I followed Lokesh's instructions over and over again, but still I can't get the lightboxes to work in Firefox.  The part that really confuses me is that the Lightboxes do pop up at http://lokeshdhakar.com/projects/lightbox2/ in Firefox on my computer, so I must be doing something wrong.  I'm not sure what to do next.\n. ",
    "vgrish": "Не решили как сделать?\n. ",
    "teo1978": "Just hit the same bug. It's sad to see that it was reported in 2014 and is still not fixed.\nBasically it seems that Lightbox doesn't take the height of the caption into account at all when computing the maximum image size, under the naive assumption that it will never exceed a given fixed height.\n. I've come up with a workaround for this, which is to apply the following stile after lightbox.css:\n``` css\n.lb-image {\n    border: solid 1px #888;\n}\n.lb-nav {\n    position: static;\n    overflow: visible;\n    width: 0;\n    height: 0;\n}\n.lb-nav a.lb-next {\n    float: none;\n    position: absolute;\n    top: 0;\n    right: 0;\n    width: 25%;\n    min-width: 60px;\n}\n.lb-nav a.lb-prev {\n    float: none;\n    position: absolute;\n    top: 0;\n    left: 0;\n    width: 25%;\n    min-width: 60px;\n}\n```\n. Seems a very poor solution to me. \nIsn't it much better to just not have a huge div on top of the image in the first place??\nI have done that. I attach the modified version I produced in case it may be of any help. Unfortunately, it's mixed with some unrelated changes, some of which destroy features that I didn't need (for example, I got rid of animations). Also I modified the compiled js directly. But if you take a diff between v.2.8.2 and mine and have a look, you may be able to isolate the part that addresses this issue. I'm not entirely sure, though, if it is compatible with maintaining your approach to not fixing #533 (it should be pretty orthogonal to that, but I don't remember for sure).\nlightbox2_modified.zip\nOh, there's also this piece of CSS that I applied on top of it. Most of it should be irrelevant to the issue at hand, but in case you quickly try my version \"out of the box\", it would probably give unexpected results without it\n```\n.lb-outerContainer {\n    background-color: transparent;\n}\n.lb-outerContainer, .lb-dataContainer, .lb-container, .lightbox .lb-image {\n    border-radius: 0;\n    -moz-border-radius-bottomleft: 0;\n    -webkit-border-bottom-left-radius: 0;\n    border-bottom-left-radius: 0;\n    -moz-border-radius-bottomright: 0;\n    -webkit-border-bottom-right-radius: 0;\n    border-bottom-right-radius: 0;\n}\n.lb-image {\n    border: solid 1px #888;\n}\n.lb-nav a.lb-prev, .lb-nav a.lb-next {\n    -webkit-transition: initial;\n    -moz-transition: initial;\n    -o-transition: initial;\n    transition: initial;\n}\n```\n. Note that this should be done in a way that does not prevent from fixing #524\n. >  I personally had absolutely no issue with upgrading to this latest version in my framework\nOf course, since as you say, you were already putting the script at the end of body.\n\nI prefer scripts being around  given performance reasons.\n\nGood for you, but a lot of other people prefer scripts in the <head>.\nActually I've never seen a library before that requires you to put it in a specific place.\nThis is not just about backwards compatibility (which is of course a big deal in itself). Not working unless the library is placed at the end of the body is a bug, whether it affects you in particular or not.\n. > However in this case the original author's doc states\n\n\nInclude the Javascript at the bottom of your page before the closing  tag:\nSeems pretty clear to me how to install the script.\n\n\nYeah, I forgot the part where it's actually documented.\nHowever that's just a bad design decision. There's no good reason for imposing an unnecessary and easily avoidable limitation that goes against widespread common practices (whether they are best practices or not)\n\nAnd a toaster not keeping food cold is also a bug if that's what you're hoping for it to do\n\nTo make a better analogy, this would be a freezer that only keeps food cold if you put it in the south side of the kitchen. It is advertised on the box, though, so it's perfectly reasonable.\n. And you are closing the issue because...?\n. What's not \"actionable\" about this? It should be actually pretty easy to fix.\n. > Here is what it would look like with the removal of the white background on the outer container and the addition of css borders on the images\nSorry but that's kind of a straw man. You just removed the background altogether and put a border, as if that was the solution to the issue, and showed it would look bad, hence you conclude that the issue can't be (easily) fixed without the result looking bad.\nAssuming you do want the white background (which I find awful, but that's another story), couldn't you just have a background the exact size of the image (rather than a few pixels larger to create a fake border) and a proper border??\nNo need for \"Javascript magic\", and also the background wouldn't have to be the same color as the border.\n\nI have opted again[st] these approaches for simplicity.\n\nThis is your software and of course you are free to opt for and against whatever you want, but please, please, don't blame \"simplicity\".\n. ",
    "Essentie": "Yes. The problem does still exist\n. ",
    "MoniQQ": "+1! Would be very useful.\n. ",
    "bcherny": "it's a mistake to allow multiple entry points (per language), since that creates ambiguity when consuming a module.\neg. say i use bower to install a module called foo. foo contains a package.json with a \"main\" field. this lets me consume foo without needing knowledge of foo's internal file structure. the \"main\" field provides a normalized interface to consume modules. so instead of require('./bower_components/foo/dist/foo'), i can simply write require('./bower_components/foo'). this avoids a leakage of information from foo to the consumer about exactly how foo's files are organized. when building for a browser, browserify is a nice build tool that honors this convention.\nwe can do the same thing for the main css file, so with appropriate tooling can consume a module's css without having knowledge of the module's internals. this could look like @import \"./bower_components/foo\" (instead of the messier @import \"./bower_components/foo/dist/foo.css\").\nso i propose a slight modification to the above:\nbower.json:\njson\n{\n  \"name\": \"foo\",\n  \"version\": \"1.2.3\",\n  \"main\": \"./dist/foo.js\",\n  \"mainCss\": \"./dist/foo.css\",\n  ...\n}\n. ",
    "deerawan": "+1\n. ",
    "Redani": "Thank you matheuslc for your reply and also for the code changes.\nHowever, i don't see where i can download the new version of lightbox!!\n. Thanks. I downloaded the new version but it works partially:\nif i scroll down and then click on a thumbnail to open lightbox, it's opened 5% from top of the page and not the window. that means i have to scroll to the top to view the popup...\n. THANK YOU very much ;) it works like a charm :) :+1: \nAnd how about the close button? is there a way to customize it and place it in the top right?\n. OK, I was just wondering if it's an option... :)\nthanks for all ;)\nCheers\n. ",
    "dock21": "hello,\nsorry I must be a total jerk on css but to put the close button on the top right, I added this :\nbackground-position: right top; to .lb-close element in lightbox.css file and it didn't work.\nCan you help ?\nThanks in advance and thanks for the great plugin\n. ",
    "eddiehuang": "I have the same issue. Did anyone find a way to fix this? \n. @EvalTracker hey, i just checked out your site. You seemed to have resolved the problem. Any tips on how to get it done right?\n. ",
    "tenaki": "Exact same issue, anyone find an answer?\n. ",
    "SylvainGuittard": "Same issue for me.\n. ",
    "TrackerSB": "I didn´t change anything, but it seems to work. Don´t know really why. \nBut it isn´t working on every site.\nAm 30.09.2014 08:14, schrieb Eddie Huang:\n\n@EvalTracker https://github.com/EvalTracker hey, i just checked out \nyour site. You seemed to have resolved the problem. Any tips on how to \nget it done right?\n—\nReply to this email directly or view it on GitHub \nhttps://github.com/lokesh/lightbox2/issues/304#issuecomment-57271388.\n. \n",
    "smokingcinnamonsticks": "I also have this issue... it's hit + miss... no pattern detected for what causes it. Anyone resolved this yet? \nCheers!\n. ",
    "Trost123": "Still seeing this happen. What should I provide to test?\nScreenshot\n. Here is the link. (Scroll down a bit and click one of the photos to zoom).\nI'm using \"lightbox2\": \"^2.8.2\" (bower).\nThe issue happens in latest Firefox, IE.\nIn Chrome it looks fine.\n. ",
    "citurria": "Never mind. I got it working. I had the header and footer set to  data-position=\"fixed\". Managing this dynamically fixed the problem. Thanks\n. ",
    "akkis": "Yep, it would be great!\n. ",
    "kafeltz": "Good question. This could be a nice feature to add-on.\n. Perfect... I have been waiting for this so long!\n. ",
    "raphael-arce": "Yes, kind of \"locking\" the screen while the lightbox is open.\n. Exactly what i've searched for. Great work !\nThank you very much.\n. ",
    "WillemII": "That's a pity.\nHowever, thanks for your quick reply.\n. ",
    "madhums": "@Margox I made some changes to this PR added some js to make the link clickable and created #323.\n. @direc85 sure go ahead!. ",
    "truongnguyen1912": "Why don't you add event listener on this awsome plugin? It would be grade if we can add some custom function to run during the lifetime of this plugin. For example, events will be fired whenever user click on an image, user move to another image...\n. ",
    "michaelpetri": "+1\n. ",
    "rockmandew": "+1\n. ",
    "nespapu": "+1\n. ",
    "jangxyz": "+1, and...\nThough this would be on 3.0, I just want to share my version of patch to make it work with current implementation.\nIt tries to minimize code modification, and most of the code work is done outside the source. The only modification was to give access to the global Lightbox instance.\nBased on v2.7.4\n1. Patch lightbox.js\n```\n   438c445\n   <     var lightbox = new Lightbox(options);\n\n\nvar lightbox = Lightbox.lightbox = new Lightbox(options);\n\n```\n\nThis just saves the instance under the global Lightbox object.\n2. Add a simple event system\n``` js\nvar original = {};\nfunction args(_arguments) {\n       return Array.prototype.slice.apply(_arguments);\n   }\n// add trigger/on\n   Lightbox.prototype.trigger = function() {\n       $(original).trigger.apply($(Lightbox.lightbox), args(arguments));\n   };\n   Lightbox.on = function() {\n       $(original).on.apply($(Lightbox.lightbox), args(arguments));\n   };\n   ```\nWith this now you can listen to events fired by Lightbox.\n3. Decorate previous methods\n``` js\noriginal['init'] = Lightbox.prototype.init;\n   Lightbox.prototype.init = function() {\n       var result = original['init'].apply(this, arguments);\n       var _args = args(arguments);\n       _args.unshift(result);\n       _args.unshift(this);\n       this.trigger('onInit', _args);\n   };\n   original['start'] = Lightbox.prototype.start;\n   Lightbox.prototype.start = function() {\n       var result = original['start'].apply(this, arguments);\n       var _args = args(arguments);\n       _args.unshift(result);\n       _args.unshift(this);\n       this.trigger('onStart', _args);\n   };\n   original['end'] = Lightbox.prototype.end;\n   Lightbox.prototype.end = function() {\n       var result = original['end'].apply(this, arguments);\n       var _args = args(arguments);\n       _args.unshift(result);\n       _args.unshift(this);\n       this.trigger('onEnd', _args);\n   };\n   original['changeImage'] = Lightbox.prototype.changeImage;\n   Lightbox.prototype.changeImage = function() {\n       var _args = args(arguments);\n       _args.unshift(this);\n       this.trigger('onBeforeChangeImage', _args);\n       //\n       var result = original['changeImage'].apply(this, arguments);\n       //\n       _args.unshift(result);\n       this.trigger('onChangeImage', _args);\n   };\n   original['showImage'] = Lightbox.prototype.showImage;\n   Lightbox.prototype.showImage = function() {\n       var result = original['showImage'].apply(this, arguments);\n       var _args = args(arguments);\n       _args.unshift(result);\n       _args.unshift(this);\n       this.trigger('onShowImage', _args);\n   };\n   original['sizeContainer'] = Lightbox.prototype.sizeContainer;\n   Lightbox.prototype.sizeContainer = function() {\n       var result = original['sizeContainer'].apply(this, arguments);\n       var _args = args(arguments);\n       _args.unshift(result);\n       _args.unshift(this);\n       this.trigger('onSizeContainer', _args);\n   };\n   ```\nLots of code, but notice they all have the same structure.\n   It just re-defines the original method, simply just triggering an event -- with the trigger method we just added at step 2 -- after each method call. \n   Only exception is the changeImage method, where we have an additional onBeforeChangeImage method, which was required for my specific case. You are free to add your own.\nNow here are some use cases of mine.\n1. Disable body scroll while lightbox is on\njs\n   Lightbox.on('onStart', function(event, result, self) {\n       $('body').css('overflow-y', 'hidden');\n   });\n   Lightbox.on('onEnd', function(event, result, self) {\n       $('body').css('overflow-y', '');\n   });\n2. Render lightbox image in iframe\nThis is really a specific case. I need to fetch images from a server which checks the referrer and disables any request that is not from its own domain. One solution is to use iframe to destroy the referrer (see referrer-killer).\n   To show the image inside the iframe, I swap the img after render:\n``` js\n// show iframe image instead of window image\n   Lightbox.on('onShowImage', function(event, result, self) {\n       var $img = $('#lightbox img.lb-image');\n   // use iframe\n   var $iframe = $img.next('iframe.iframify-lb-image');\n   var iimg = $iframe[0].contentWindow.document.getElementsByTagName('img')[0];\n   var $iimg = $(iimg);\n\n   $iframe.attr({\n       'width' : $img.css('width'),\n       'height': $img.css('height'),\n   });\n   $iimg.attr('src', $img.attr('src'));\n   $iimg.css({\n       'width' : $img.css('width'),\n       'height': $img.css('height'),\n   });\n   $iimg.fadeIn('slow');\n\n   // \n   $img.stop(true).hide();\n\n});\n   ```\n3. Preload images in iframe as well\nLightbox tries to \"preload\" the image and its neighboring images.\n   To also move this into iframe, I temporarily \"swap\" the Image object between the window and the iframe during the request, and revert it back.\njs\n   // temporary patch window.Image to iframe.Image\n   // to prevent preloader raising forbidden errors\n   var originalWindowImage = null;\n   Lightbox.on('onBeforeChangeImage', function(event, self) {\n       var $_img = $('#lightbox img.lb-image');\n       var iframeWin = $_img.next('iframe.iframify-lb-image')[0].contentWindow;\n       // patch window.Image\n       originalWindowImage = window.Image;\n       window.Image = iframeWin.Image;\n   });\n   Lightbox.on('onShowImage', function(event, result, self) {\n       window.Image = originalWindowImage;\n   });\nHope this helps anyone.\n. ",
    "sven-ra": "jangxyz, have you updated your version to v2.8.2 aswell?\n. ",
    "backlost": "thx so much \nreally helpful~\n. ",
    "fnhowe84": "Anyone update this yet?\n. ",
    "AlirezaSalimi1": "@backlost   How You solve this issue?. ",
    "Slawek24": "Thank you for your response.\nYes, I never change anything only this variable \"true\" to \"false\". I also tried to change lb-data .lb-number to display: none; but even though I set it, web browser change this automatically to display: inline;\nI checked website in Chrome, Opera and IE and the same occurs.\nMy regards\n. Thank you for your response.\nhttp://scubacarp.24tm.pl/  gallery section.\nIve loaded sample pictures. This gallery is divided into pages by php and lightbox display count images are only on one page because I want to display count of all pictures in gallery or hide this section.\nMy regards\n. Thanks! It works! I Just did not notice.\nBy the way, can I ask one more question?\nWhen I display the approximate image sometimes the image falls in the lower right corner and sometimes it is normally in the frame but the position image is changed to the correct position after refresh the entire page. What does it depend? I didn't change any css variable in lightbox.\nIf you want to see it refresh the page a few times and check the position of the approximate image each time.\nMy regards\nSlawek\n. ",
    "vinitkumar": "We also use it on our production server. Please merge this @lokesh. It is pretty neat and much needed.\n. ",
    "urtzai": "This feature needs to be merged... please...\n. ",
    "pierresh": "That would be very useful! 😃 \n. ",
    "valix85": "Hi, I'm looking for a documentation for download button...where did you explain how to use it?\n. ",
    "sukima": "What is the blocker for this review that started eight months ago? We are in desperate need for this feature.. ",
    "mfredriksen": "Besides making the necessary changes to both the lightbox.js and lightbox.css, as well as placing the icon in the appropriate image directory, what else is needed to make the \"download\" button/link work?  I've done the aforementioned and see the icon appear, but when clicked, the link just opens a new browser window with the appropriate image.  What's missing?  Any other files that need to be amended or installed?. ",
    "direc85": "There seem to be conflicts that prevent merging. I could try to redo your patch against the current master... @madhums Is this fine with you?. ",
    "adcox": "This could actually just be used as a general \"sub-caption\" type of data field. I use it for EXIF data, but it could be many things for other people!\n. ",
    "dodlhuat": "There is no option (as far as i know) for that, but you can set the css for lb-next and lb-prev to opacity 1 and display block. If you set the position to relative you can move those buttons outside with the left or right attribute.\n. ",
    "Codigo-G": "Awsome, yeah good idea thanks!\n. ",
    "JimPM": "I too have this issue. As a work-around, I commend out the padding for .lb-container { /* padding:4px; */ }. It still displays the white box, just no borders. (I also temporarily changed the white background for .lb-outerContainer to black so it doesn't show the white area at all, until the bug is fixed.)\n. ",
    "Sebirlinem": "I found this happened with Chrome when all images in a delta-lightbox group have exactly the same delta-title. Dosn't occur for groups with only a single image.\nCould be fixed by changing or removing the delta-title from at least one of the images in the group.\n. ",
    "savalo": "I solved same problem today, but I need similar look like old version, with white border and with background under image title, there is code to put to the end of lightbox.css:\n.lb-outerContainer {\n  padding:10px;\n  border-bottom-right-radius:0;\n  border-bottom-left-radius:0; \n}\n.lb-container {\n  padding: 0;\n}\n.lb-dataContainer {\n  background-color: white;\n  padding:0 10px;\n}\n.lb-data {\n  padding: 0 4px;\n  color: #444;\n}\n. ",
    "tstavinoha": "This bug is still active in v2.8.1. Everything exactly as described in first two posts. IE works fine, no problemin FF as well. Public demo app works in Chrome, but the overflow appears in a custom site (Bootstrap, React, Webpack, ...).\nIt is connected to calculation of height and width of elements. Size of the displayed image is relative to the size of the container padding. When lightbox sets up, it reads padding sizes using jquery and stores them for later use.\nThe problem is that Chrome reports padding size as 0 until the lightbox is first displayed. By that time, the zeroes are cached and that's that. I don't know, it's wierd.\n. ",
    "erezgreenberg": "This is an old post but thought I'd let you guys know that I had same issue and it was due to the lightbox CSS stylesheet being AFTER the lightbox JS script on the page. As soon as I moved the CSS to BEFORE the JS it worked\n. ",
    "Xatenev": "@whatfield73 Doesn't work for me on Android AND on Iphone -> found the bug, when I am home ( in 2 hours ) I will push it.\n. Check this out while its not pushed yet: https://github.com/Xatenev/lightbox2\n. ",
    "whatfield73": "Works for me.  Thanks.\n. It does work. But with a narrow browser window vs. a mobile browser the narrow browser shows white space on the left now. or on a page where the body is narrower than the page - it shows on the left.  probably needs an if statement for mobile\n. Getting rid of the position: relative statement in the css takes care of the wide shadow problem differences for me\n. ",
    "Absherj": "I second this. I've spent a little bit of time trying to figure out on my own, but I'm just an intern and kind of new to the whole Jquery/AJAX world. \n. ",
    "laurend": "+1. I'm not a JS developer but this would be incredibly useful to me. Realizing this is about a year old, anyone make any headway?\n. +1 for more gracefully dissolving images (should also reference #321). @lokesh I don't think adjusting fadeDuration really gets at the problem. I just posted a question on stack overflow without realizing this was here. \nhttp://stackoverflow.com/questions/33345884/is-there-a-way-to-achieve-smoother-transitions-between-images-using-lightbox2\n. ",
    "barretts": "I'd love to see this get merged in, the bower download is pretty large right now. :+1: \n. Thanks @lokesh!\n. ",
    "g00glen00b": "Nice :+1: \n. ",
    "cdeford": "Hi, are you still working on this? I'd like this script for my wordpress site as well, it's one of the best looking lightboxes out there.\n. Thanks for replying. I'm using Easy Fancybox. I'd like to use this but I haven't been able to make it work. Pity.\n. ",
    "paaljoachim": "I gave up. I got colorbox to work and decided to stick with that.\nIf you get it to work do please post here.\nHave a great weekend!\n. Thank you anvarulugov!\n. Thanks for the info!\nI updated the tutorial and included Magnific popup which I got to work pretty well with the options that existed for it. \n. ",
    "anvarulugov": "I made for my wordpress theme following:\nin functions.php file:\n```\nadd_action( 'wp_enqueue_scripts', 'themeslug_scripts' );\nfunction themeslug_scripts() {\n    wp_enqueue_style( 'bootstrap-min', get_template_directory_uri() . '/media/css/bootstrap.min.css', array(), '3.3.0' );\n    wp_enqueue_style( 'fontawesome-min', get_template_directory_uri() . '/media/css/font-awesome.min.css', array(), '4.3.0' );\n    wp_enqueue_style( 'lightbox', get_template_directory_uri() . '/media/css/lightbox.css', array(), '4.3.0' );\n    wp_enqueue_style( 'style', get_stylesheet_uri() );\n    wp_enqueue_script( 'bootstrap-min', get_template_directory_uri() . '/media/js/bootstrap.min.js', array( 'jquery' ), '3.3.0', true );\n    if ( is_singular() ) wp_enqueue_script( 'comment-reply' );\n    wp_enqueue_script( 'lightbox', get_template_directory_uri() . '/media/js/lightbox.min.js', array( 'jquery' ), '3.3.0', true );\n    wp_enqueue_script( 'themeslug-script', get_template_directory_uri() . '/media/js/functions.js', array( 'jquery' ), '3.3.0', true );\n}\nadd_filter('the_content', 'aus_lightbox_post_image');\nfunction aus_lightbox_post_image ( $content ) {\n    global $post;\n    $pattern = \"//i\";\n    $replacement = '';\n    $content = preg_replace($pattern, $replacement, $content);\n    //$content = str_replace(\"%LIGHTID%\", $post->ID, $content);\n    return $content;\n}\n```\n. @paaljoachim welcome. But I suggest you to test excerpt. I'm not sure wether it conflicts or not.\n. After removing the following lines from lightbox.css buttons showed up normally:\nbody:after {\n  content: url(../img/close.png) url(../img/loading.gif) url(../img/prev.png) url(../img/next.png);\n  display: none;\n}\n. Did you check if the path to images are correct?\n. ",
    "jmfcodes": "thank you all! This thread was helpful. I migrated a site to WP that was previously using Lightbox2, and I really prefer Lightbox2 to the others I've tried so I'm glad I could get it working. In case anyone else stumbles on this thread, here's what I did: \n\nDownload and unzip Lightbox2\nIn WP theme folder, create a lightbox folder\nCopy CSS, JS, jQuery files to lightbox folder\nIn the lightbox folder, create an images folder, and copy the four icons from Lightbox2's images folder\nOpen lightbox.css (the one in your new WP folder) and change url(../images/prev.png) to url(images/prev.png) for each of the four images\nIn lightbox folder, create init.js and add the following:\n\n```\njQuery(function( $ ){\n    $(\"a[href$='.jpg'],a[href$='.jpeg'],a[href$='.png'],a[href$='.gif'],a[href$='.bmp']\").lightbox();\n    $('a.gallery').lightbox();\n});\nlightbox.option({\n    'wrapAround': true,\n    'alwaysShowNavOnTouchDevices': true,\n});\n```\n- In WP theme folder's functions.php file, add the following:\n/* Enqueue Lightbox2 */\nadd_action( 'wp_enqueue_scripts', 'enqueue_lightbox' );\nfunction enqueue_lightbox() {\n wp_enqueue_style( 'lightbox-css', get_template_directory_uri(). '/lightbox/lightbox.css' );\n wp_enqueue_script( 'lightbox',get_template_directory_uri() . '/lightbox/lightbox.min.js', array( 'jquery' ), '', true );\n wp_enqueue_script( 'lightbox-init', get_template_directory_uri() . '/lightbox/init.js', array( 'lightbox' ), '', true );\n}\n\ndata-alt and data-title still need to be added manually per picture.\n. \n",
    "sebslomski": "+1\n. ",
    "reitermarkus": "I found out that this is actually already implemented now. You can set it with the option albumLabel.\nI have it working like this:\nlightbox.option({\n  'albumLabel': 'Bild %1 von %2'\n})\n. ",
    "kinging123": "Me too! same problem.\n. ",
    "dondgitale": "I have the same problem, did you find a solution ?\n. ",
    "magnum79": "I have similar problem.\nBigger image opens inside iframe, everything fine, except vertical positioning, image sticked to the top of iframe instead of vertical centering on monitor.\n. ",
    "bencagri": "+1\n. no luck. I could not manage. \n. ",
    "dsollows": "Nevermind! It was a simple markup error.\nSee here.\nhttp://stackoverflow.com/questions/27023724/img1-displayed-twice-in-lightbox/27023931#27023931\n. ",
    "sadikyalcin": "Issue fixed by dynamically generating image names on each MySQL row.\n. I use both together as well but not linking bxslider images to lightbox. Would be able to help if you can show your code? By the way make sure your not including the js files more than once...\n. Hi John, I meant that if you include the lightbox JS files 2+ you would generally get this issue.\nThere must be a javascript/jquery conflict somewhere between them. If you change minSlides and maxSlides it also affects the number of images on lightbox. I'm afraid I'm no expert in both of those fields. You may need to contact bxslider developers...\n. ",
    "super-summer": "这个swiperight还要引入jquery mobile 文件，\n. ",
    "JohnVermeulen": "Thanks for responding Abdul.\nI'm not sure if i included the js files right. Maybe this is what you ment with 'not including the js files more than once...'?\nMy code:\n```\n<!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\">\n\n\n\n jQuery library Lightbox 271 \n\n\n \n jQuery library bxSlider \n\n\n\n\n\n    #slider {\n      width: 450px;\n    }\n   \n\n\n\n    $(document).ready(function(){\n    $('.bxslider').bxSlider({\n      slideWidth: 147,\n      minSlides: 3,\n      maxSlides: 3,\n      moveSlides: 1,\n      slideMargin: 10\n        });\n    });\n    \n<div id=\"slider\">\n<ul class=\"bxslider\">\n        <li><a href=\"images/1.png\" data-lightbox=\"project\" ><img src=\"images/1.png\" /></a></li>\n        <li><a href=\"images/2.png\" data-lightbox=\"project\" ><img src=\"images/2.png\" /></a></li>\n        <li><a href=\"images/3.png\" data-lightbox=\"project\" ><img src=\"images/3.png\" /></a></li>\n</ul>\n</div>\n\n\n\n```\n. ",
    "dalai-lamia": "I am experiencing the same problem. However, I am using Slick Slider (http://kenwheeler.github.io/slick/). I am sure I'm not including anything twice. My CSS is loaded in the head and all javascripts are loaded in my footer, after all other content.\nI have further noticed the following: \n1. If I use the same data-lightbox name, e.g. \"property20\", for the four images I have for this property, the number shown in the lightbox is ten, and some of the are repeated twice.\n2. If I use a unique name, e.g. data-lightbox=\"property_20.3.jpg\", the same image is repeated three times in the lightbox.\nEDIT: PROBLEM SOLVED!\nIn my case, the problem was caused by the \"infinite: true\" setting of the slider, which creates what it says: makes the slider revolve infinitely. When I changed this setting to \"infinite: false\", the lightbox is now showing the correct number of photos.\n. ",
    "cdchen": "I have the same problem. \nI am using the bxslider 4.1.1 and lightbox 2.7.1. When creating bxslider with infiniteLoop option as true, lightbox always add image to album repeat 2 times, if infiniteLoop as false, the count of images is correct.\n. ",
    "maguijo": "Thank you dalai-lamia and cdchen and ngonhan2k5 for the answer to my problem as well!\n. ",
    "Roemer": "My solution for this problem is to remove the data-lightbox attribtue of all clones. I do this after the slide has loaded with this code:\njavascript\nonSliderLoad: function(){\n    $(\".bx-clone\").children().removeAttr(\"data-lightbox\");\n}\n. ",
    "rinabh": "Roemer's solution work for me, when used lightbox with flexslider\nex.\n        init: function(){\n            $(\".flexslider .clone a\").removeAttr(\"data-lightbox\"); //Remove data-lightox property\n        }\n. ",
    "jimmyangel": "I love it! Thank you very much, Lokesh.\n. It would be great if you merge this in so that we can properly use bower as intended. Much appreciated. Thank you.\n. ",
    "KaptnKonay": "If you want to make a loop in the image slideshow in v2.7.1 you need to change  the following in your js file:\nFirst line:\n\"this.wrapAround=!1\" to \"this.wrapAround=!0\"\n1 = no loop\n0 = Loop\nI hope I could help you!\n. You're welcome! Nice that I could help you! ;-)\nHave nice day!\n. ",
    "DavetheNacus": "That did it!  THANK YOU!\nDave Damianakes\n+1 510.317.6306\nwww.bayareatechwriters.com\n\nOn Jan 7, 2015, at 12:35 AM, KaptnKonay notifications@github.com wrote:\nIf you want to make a loop in the image slideshow in v2.7.1 you need to change the following in your js file:\nFirst line:\n\"this.wrapAround=!1\" to \"this.wrapAround=!0\"\n1 = no loop\n0 = Loop\nI hope I could help you!\n—\nReply to this email directly or view it on GitHub https://github.com/lokesh/lightbox2/issues/363#issuecomment-68992411.\n. \n",
    "djvov": "thank you!\n. ",
    "gcundiff": "I added code to set the alt and title properties of the overlay image and the navigation icons (prev, next, close) for accessibility.  I am using Lightbox v2.8.2.  I use the title of the original image, set that in the addToAlbum function (lines 156-168).  I am also setting the link to the source of the original image instead of the link, but you can ignore that change.  Lines 344-351 set the alt and title of all the navigation images.  Lines 395-399 set the alt and title of the overlay image.\nlightbox.txt\n. ",
    "richandhandsomeman": "I've tried your code, it doesn't work for me. I'm using 2.51, but in my case title attribute of a tag provides caption for overlay image. I need 'alt' and 'title' for overlay picture. If you know how to make it work, please let me know!. ",
    "gitaarik": "I need this, why isn't this merged yet?\n. Cool thanks!\n. ",
    "bearskin": "@lokesh The transfer of the alt-tag still seems (or maybe again) not to be working. Also on your homepage http://lokeshdhakar.com/projects/lightbox2/ the alt tag is not displayed correctly. There the alt-tag displays the src link.\n. ",
    "gauravmanral": "i also want this. did find any help..??\n. I found it in support forum just now.\nhre is the link:\nhttps://github.com/lokesh/lightbox2/pull/323 \n. ",
    "rajasekar-i2i": "No Gaurav, I did not get any help in this issue. This download option is not yet done in my project.\n. Thanks Gaurav, I will use that code. But it is not published as a version, They merged the code but version is not updated. @lokesh , Can you release as a new version(2.7.3). \nOnce again thanks a lot Gaurav.\nThanks in advance Lokesh.  :)\n. ",
    "markentingh": "Apparently, it must be my fault because jQuery should be returning strings for the attr function, but for some reason, it is returning a jquery object for me...\n. ",
    "sancy007": "But i have checkes the script on the html file and addept it also to the place where the images are stored. And still it gives the same problem.\n. Is there any where else that i should look ? \n. Maybe you can check it on http://www.hsgroup.be/referenties.html\n. Okey, i already found the issue, the extensions of the images where .JPG and i had .jpg in the script. \n. thanks\n. ",
    "syg6": "Actually, this is a non-issue. I mistakenly posted here when in fact the Lightbox I was using was a jQuery plugin version of this library. I got rid of the plugin, used this library instead, and all is well.\n. Hi, thanks for the response.\nActually it's no longer an issue. I just updated my post on github. I was using a jQuery plugin version of the Lightbox library. When I substituted it for the actual library itself, it works fine.\nThanks again. \nOn Friday, January 30, 2015 4:51 PM, Oleg Yarigin <notifications@github.com> wrote:\nReassign 'onmouseup' event handler to 'onmouseclick'.—\nReply to this email directly or view it on GitHub. \n. ",
    "arhad": "It is well explained on a site of the project. Shortly, you must provide 'data-lightbox' property, one shared between every photo of a \"subject\", so you get as much unique property values as a number of your subjects. In addition, photos on different subjects may interleave.\n. Maybe because Lightbox is just a wrapper around a link to an image, providing opening the link inside a dedicated area instead of new page?\n. Why does turn it off? I propose to introduce new (mobile-friendly) view. This one would be fullscreen.\nIt would be automatically switched on mobile devices, or any device with small enough screen. Nowadays CSS allows it withous any JS code change.\n. ",
    "Lutacon": "What if we want the caption to be different of the alt of the <img> ?\n. ",
    "quayle": "I suggest to make \"alt\" as default for title, and if \"data-title\" exists, to override default with it.\n. ",
    "andylacko": "@arhad , this is even better solution...\n. ",
    "Redsmith24": "I hope it's not only my problem.\n. We would like to habe no dublicated images in the album.\nIn the moment every link to an images creates an entry in the album. We want to link to an image in the gallery from different places without adding an images multiple times to the album.\nI hope it is getting clearer now ;-)\n. ",
    "martin-ko": "Hi,\nI have the same feature request. Currently, any image is added to the gallery as often as you provide a link to it within your html. In order to change that , the function \"addToAlbum\" should only be called if that image/link is not part of the album yet (line 159 in lightbox.js). My own js skills are not yet sufficient to implement it :-(\nMartin\n. ",
    "fragerbo": "I had the same troubles and I fixed it by playing with the CSS:\n.lightbox a img {\n  border: 8px;\n}\nor\n.lb-container {\n  padding: 0px;\n}\n. ",
    "Drainediam": "Great, thanks a lot, appreciate it.\n. ",
    "a2u": "subscribe to the issue\n. ",
    "NJWebDesign": "You could use CSS?  I use the following to overlay text on an image but it doesn't stop people simply right clicking and saving the image (which won't have the overlaid text or graphic).\nAs a rough guide...\nThe CSS:\n.imagearea {width:640px;height:480px}\n.overlay {position:absolute;visibility:visible;z-index:9999;color:#fff;font-family: Arial, serif;padding:20px;}\nThe HTML:\n    < div class=\"imagearea\" >\n        < div class=\"overlay\" >\n            Overlaid text or transparent PNG watermark\n        < /div ><! end overlay -->\n        < img src=\"imagefolder/image.jpg\" >\n    < /div ><! end imagearea -->\nHope that helps.\nNJ\n. ",
    "ptfagan": "thank you!!!\nOn Fri, Mar 13, 2015 at 8:38 AM, Nathon Jones notifications@github.com\nwrote:\n\nYou could use CSS? I use the following to overlay text on an image but it\ndoesn't stop people simply right clicking and saving the image (which won't\nhave the overlaid text or graphic).\nAs a rough guide...\nThe CSS:\n.imagearea {width:640px;height:480px}\n.overlay\n{position:absolute;visibility:visible;z-index:9999;color:#fff;font-family:\nArial, serif;padding:20px;}\nThe HTML:\nOverlaid text or transparent PNG watermark\n<! end overlay -->\n http://imagefolder/image.jpg\n<! end imagearea -->\nHope that helps.\nNJ\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/lokesh/lightbox2/issues/393#issuecomment-79000565.\n. \n",
    "simonbook": "I know this is an old thread, but I do it this way:\n$(\".imgClass\").click(function() { \n   watermarkLightBox();\n})\nfunction watermarkLightBox(){\n    $(\".lb-container\").append('< img src=\"/theme/default/images/logo1.png\" class=\"lightBoxWaterMark img-responsive\" />'); \n}. ",
    "FoxtrotLima": "I've seen this on an iPhone. FWIW, I did not notice this behavior when using colorbox. \n. ",
    "greyscaleGD": "Thanks, FotxtrotLima. We're having a couple other issues, as well, so perhaps Colorbox might be the answer.\n. Thank you for looking into this. The page is \nhttp://www.phyllisalter.com/test/fresco-retina-test.html http://www.phyllisalter.com/test/fresco-retina-test.html\n\nOn Jun 24, 2015, at 5:53 AM, Lokesh Dhakar notifications@github.com wrote:\nI am unable to recreate this issue. Can you post a link to the issue or the relevant code below. Once you do that I will reopen and investigate. Thanks.\n—\nReply to this email directly or view it on GitHub https://github.com/lokesh/lightbox2/issues/395#issuecomment-114720772.\n. \n",
    "Maccapolo": "I am looking for similar info, my lightbox is used on Oscommerce site for products the main product image is half the width of the page, the thumbnail set is limited to half the width too. I cant seem to find the code to separate the two into different divs! \n. ",
    "r3bify": "I'm having the same issue, I believe it has to do with an issue with their sets. It counts up all the images to add to the \"total\" images, regardless if it is part of the set or not. \n. ",
    "eggins": "Thank you! :)\n. ",
    "valera-rozuvan": "@es88 Can you please provide the code as a text snippet? For example use the http://pastebin.com/ service. The image in your issue is no longer available.\n. @es88 If your issue is resolved, please close this issue. Thanks! = )\n. @andrespipe90 , @canfiax , @rachatfig Do you want to add videos that are natively supported by the browser, or some iframe code from 3rd party services such as YouTube?\n. @meghanlundy Where will the arrow buttons Next and Previous go? What should be the maximum width of the text description be? Should it be overflowed, or truncated? Best to provide a mock up image of what you want to achieve. Maybe use the service http://imagebin.ca/ .\n. @lexxpavlov Do you want to initialize the Lightbox plugin selectively on an element, on a set of elements, or page wide with a single method call? \n. @kylebellamy I think it would be best if the position of the Prev and Next buttons could be set via some percentage relative to the height of the image. Would this be helpful? This can be moved to an initialization configuration block.\n. ",
    "es88": "Thanks for getting back. I have now fixed the issue.\n. ",
    "daverogers": "You couldn't make it an option and assume the user has already loaded the font? Or include a custom icon set with just the FA icons being used via icon font generator?\n. ",
    "lrfowler": "that didn't work for me...\n. yep....you're right...... I had an images folder and a img folder...........but I put the lighbox css stuff in the main css folder r....and I didnt add the 'img' folder where lightbox css could see it................ ot I guess I could have just changed the path setting....\n. ",
    "XtremeChocoholic": "Yup, add an  additional “img” folder for these LB images, unless where you already keep your images is called “img”. TY! :)\n. ",
    "simplenotezy": "Agreed - I'd love this feature.\n. Could be very useful - i.e. for a Vimeo video\n. ",
    "rachatfig": "Yep agreed. \n. ",
    "andfelzapata": "Youtube, Vimeo, etc :)\n. ",
    "danieljulia": "The problem is the \"sentinel\" created by cycle2, changing the height calculation, for instance appending data-cycle-auto-height='600:400' fixes the problem\n. ",
    "rafaelcapucho": "Solved. \nThe css arent loading properly at production. Thx.\n. ",
    "abbeycode": "I'm working on a pull request to address this.\n. Pull request submitted\n. ",
    "uniyalvikas": "I solved this problem,thanks for the response,\n. ",
    "DavidMHaycraft": "\nOops!  cannot include HTML in a GitHub message.  Here it is, disguised:\n< a href=\"photos/news/modeljets090.jpg\" data-lightbox=\"7\" >< img src=\"photos/news/modeljets090_thumb.jpg\">< /a>\n  < a href=\"photos/news/modeljets086.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets088.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets091.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets092.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets094.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets097.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets099.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets100.jpg\" data-lightbox=\"7\" >\n  < a href=\"photos/news/modeljets103.jpg\" data-lightbox=\"7\" >< /a>\n  < BR>\n  < i>Click to view slide show\n. ",
    "skmasq": "I just stumbled upon this issue, would be nice if it was like in photoswipe\n. ",
    "kylebellamy": "I tried that but it ends up being of the edge of the bottom. I was thinking more of physically moving the buttons to the footer next to the close button. \n. ",
    "xuragor": "Did you in your CSS file to a: link formatted with padding or margin ? Take that away or make a pseudo class . (sorry , the text is translated with google)\n. ",
    "badsyntaxx": "Oops sry. I thought I wasn't gonna get a reply. Anyway the link is working again. However this issue seems to have corrected itself in the latest version of firefox. Display:none; seems to be working to hide the vdh-mask now.\n. ",
    "ericcort": "Didn’t work. I’m using html5 and css3.\nhttp://www.eyepopdesign.com http://www.eyepopdesign.com/\nOn Jun 16, 2015, at 12:26 AM, Lokesh Dhakar notifications@github.com wrote:\nGiven the following link on the page:\nExample Link\nYou can automatically start Lightbox once the DOM is loaded by running the following code:\n$(function() {\n    lightbox.start($('.example-image-link'));\n});\n—\nReply to this email directly or view it on GitHub https://github.com/lokesh/lightbox2/issues/443#issuecomment-112283982.\n. ",
    "jeannes": "I have this problem as well.\n. ",
    "Boris160": "I have a similar problem:\n\"prev\"-button works well, just \"next\"-button appears in the images 2, 3, ... of a set not as overlay of the enlarged picture, but in a new line of site after the picture and \"close\"-button works as \"next\"-button. See attached picture.\nKind regards\nBoris\n. Sorry: forgot attaching picture :-(\n\n. I have found a solution for the problem:\n1st I changed .lb-nav a.lb-next { width: 60%;\n2nd I have edited some pictures, which where very high but not wide, I cutted some not necessary inches at top and bottom\nNow next-buttom appears at the correct place\n. ",
    "msikio": "Hello, I'm getting the same problem, any thoughts ?\nhttp://sqc.diskstation.me/~ssedition/acoustique/Gallery_test_Michel.htm\n(Select first image on the top right)\nThanks in advance. @lokesh Thanks a lot... That's great help . ",
    "ploutos27": "Hello again :) \nAll set ;-) I manage to combine the two codes together :D \nLet me know if someone needs a download link ! \n. ",
    "yunker": "Sorry, should have done some testing before posting! I was able to just add a style to the lightbox.css file... Problem solved! :)\n. ",
    "jonathanhecl": "I do not want to modify the image, rotate only to CSS to view rotated 90°. \nHow I can add a button to do it myself? :(\n. ",
    "Huberttao": "thank you！\n. What browser do you use\n. You can use jquery.rotate and easily solve the rotation problem.Still do not know, I can send you the code.\n. What browser do you use\n. Could you describe the problem more specific?\n. Which version of the lightbox you are using now？\nyou can try to reverse the two code.\nlightbox.js :        381line                 preloader.src= this.album[imageNumber].link;\n                          382line                this.currentImageIndex = imageNumber;\nReverse the two code like this:\nlightbox.js :        381line                 this.currentImageIndex = imageNumber;\n                          382line                preloader.src= this.album[imageNumber].link;\n. Do you use Bootstrap in your program?\n. Your  Tag is missing \">\"  .\nBootstrap and lightbox are not compatible , I think ...\n. Your a Tag is missing \">\" .\n. \nInside the picture.\n. a tag\n. No need to thank！\n. ",
    "f1roro": "Thanks - have narrowed it down to the following in Chrome and Safari (assuming Firefox the same but can't test at work), IE appears fine (except that the Lightbox opens underneath a video iframe further down the page, but that's a separate issue!):\nfitImagesToViewport set to 'true' - works as expected when page length is shorter than Viewport (see: http://leemead-timeline.co.uk/files/events/test2.html ), but when page length is longer than ViewPort, the picture displays full-size or limited by width only (see: http://leemead-timeline.co.uk/files/events/test1.html )\n. Issue resolved by the added ‘max width’ and ‘max height’ attributes in v.2.7.2.\nThank you.\nFrom: Lokesh Dhakar \nSent: Tuesday, June 16, 2015 6:07 AM\nTo: lokesh/lightbox2 \nCc: f1roro \nSubject: Re: [lightbox2] FitImagesToViewport only working horizontally (#455)\n@f1roro can you post a link to the issue or all the relevant code below. Once you do that I will reopen. Thanks.\n—\nReply to this email directly or view it on GitHub.\n. ",
    "idoshhh": "thank you so much sir :)\nOn Wed, Jun 17, 2015 at 1:34 AM, Lokesh Dhakar notifications@github.com\nwrote:\n\n@idoshhh https://github.com/idoshhh in lightbox.js, find the following\ncode which is around line 24:\nthis.wrapAround                  = false;\nSet this value to true.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/lokesh/lightbox2/issues/457#issuecomment-112593518.\n\n\n[image: photo]\nIdo Shahar\nPhotograper & Web Developer\nm:+972-54-643-4444 | w: www.idoshahar.com\n | a: Tel-Aviv\nhttp://facebook.com/idoshhh  http://linkedin.com/in/idoqments\nhttp://twitter.com/idoshhh\n I  recently  uploaded\nhttp://instagram.com/p/vxr1c_i_Uv/ http://instagram.com/p/vvJLfyi_Ru/\nhttp://instagram.com/p/vq1t1Yi_bd/ http://instagram.com/p/vgjnLli_b8/\nhttp://instagram.com/p/vVy9lnC_bt/ http://instagram.com/p/u7nKI0C_U0/\n. ",
    "mksglu": "The new version just use wrapAround:!0. ",
    "dmaglio": "demo page work correctly, but the same code in my demo site and 2.8 no, same code and 2.7.4 yes\n. ",
    "CrateMayne": "Just wanted to chime in that I recently upgraded from 2.7.1 to 2.8.0, and it still works perfectly fine with jQuery 1.9.0... With, or without, needing to use jQuery Migrate. I think OP possibly just had an issue with jQuery being properly loaded.\nAnyways, great work on the lightbox!\n. ",
    "ADTC": "It didn't work with jQuery 1.11.3 which I was incidentally using for Bootstrap. Luckily Bootstrap worked fine with jQuery 2, so I was able to upgrade.\nI may have to retest to see if I misread anything. But what is the real minimum version of jQuery required for Lightbox 2?\nI think the more vital part is placing the <script> tag at the end of the page, since it looks for all the lightbox-marked images at the time of script execution, rather than after page-load.\n. Thanks @lokesh nice to see the changes. I must have mixed up the wrong placement of <script> tag with the jQuery version incompatibility. But still, something good came out of it :smile: \nI'll try again with jQuery 1.11.3 so that I can optimize my site to uses to use a single jQuery version.\n. ",
    "chewett": "Once the composer.json file is added, no further work is needed on your part.\nPackagist picks up the new versions from the github tagged releases.\nIf you would consider it I dont mind making the composer.json file (which is all that is needed).\nThanks for the consideration\nChewett\n. ",
    "Guite": ":+1: for composer support. ",
    "hugoesp": "the issue continues coz I have not target an image but a link so even if I exchange the target it will become the last on the list.\nyou can review here the bug:\nhttp://ondiversion.net/vialighting/#content\nin the code the issue begins in the line 106.\nI'm using the latest version.\n. Sweet!\nThanks for your help!\nHave a great day ;)\n. ",
    "mtgibbs": "That would be pretty awesome.  I'd like to be able to stop just copy/pasting this into my dependencies as well.  Let me know if there's something I could do to facilitate this.\n. ",
    "HunterJoe": "I ran into this as well. Using LB 2.8.2; Jq 2.1.3\nThe call to self.sizeContainer($image.width(), $image.height()); always returns 250x250.\nTook a while to track this down and figure out why the lightbox was not resizing like it should with my images. I just replaced this:\nself.sizeContainer($image.width(), $image.height());\nwith this:\nself.sizeContainer(preloader.width, preloader.height);\nwhich is essentially what you did as well.\n. ",
    "khuramali123": "Hi, \nyou remove this css img {\n    max-height: 100%;\n}\n. ",
    "rushiagr": "My bad. Didn't put prev.png and next.png at proper location. Closing. Sorry.\n. ",
    "gbezyuk": "Better late than never )\n. ",
    "cedriclombardot": "Not working :'(\n. ",
    "spyninja": "Any luck with this? I think this could be a common issue.\n. ",
    "skovmand": "+1\n. ",
    "alexmturner": "@lokesh Just so you know, I think you uploaded version 2.8.1 to npm, not 2.8.2.\n. ",
    "innov89": "Looks good.\n. Looks good, let's get it in.\n. ",
    "k-funk": "Use a var like $lb-image-path: '../images'  !default;. It's not uncommon for people to use lots of @imports in their sass/scss, making the relative pathing confusing/wrong. That's why bootstrap-sass does it.\n. LGTM\n. ",
    "helloilya": "Improved styles, fixed a few wrong moments.\n. ",
    "bahiirwa": "+1. https://github.com/lokesh/lightbox2/pull/496. ",
    "fmms": "just wanted to report the same issue. took me a lot of time to find my mistake. Even though it is mentioned in the documentation, this is easily overseen.\nSolution at http://stackoverflow.com/questions/34440731/lightbox-2-not-working/34447470#34447470 would solve this for many users, i guess.\n. There is even a pull request https://github.com/lokesh/lightbox2/pull/482 for this issue. I have just tested it and it works fine for me.\n. ",
    "tiagoboldt": "Chrome mostly, Firefox and Safari occasionally. But I fail to see the relevance of it. \n. ",
    "Magnumv44": "This hacks for Internet Explorer\n. ",
    "mro": "ic, so they seem inevitable, right?\n. ",
    "gpeth398": "using google chrome\n. I am making a portfolio website to show my school projects and I would like to have a main image for each project, that will open a lightbox for all the other images of that project. Right now when I click on the image link it goes straight to image 4 of 4 instead of opening image 1 of 4. All the images are there, but I have to click backwards to see image 3,2, and 1.\n. I am currently using version 2.8.2. I tried reversing the two lines around but there was no change. \n. yes i do\n. Can you be more specific? Which line and where should \">\" be?\n. i figured it out:) thanks for the help!\n. ",
    "cdp1337": "Hey Chris, I actually switched them to FontAwesome in my local fork; as that's already included in this specific project.  You could try that as well by adding the necessary <i> tag and remove the background: url(...)\n. I do tend to agree with @teo1978 that it's generally good coding etiquette to bump the major version when releasing backwards-incompatible work, although I personally had absolutely no issue with upgrading to this latest version in my framework.  In fact, I prefer scripts being around </body> given performance reasons.\nSo, -1 from me on this \"bug report\".\n. > Not working unless the library is placed at the end of the body is a bug, whether it affects you in particular or not\nAnd a toaster not keeping food cold is also a bug if that's what you're hoping for it to do.  However in this case the original author's doc states\n\nInclude the Javascript at the bottom of your page before the closing </body> tag: \n\nSeems pretty clear to me how to install the script.\n. ",
    "anamariasosam": "this closes #494 \n. ",
    "bcarvalho89": "Try something like that: \n<div class=\"bg\" style=\"background-image: url(your_imgl.jpg);\">\n<a href=\"your_imgl.jpg\" data-lightbox=\"galery\"></a>\n</div>\n. ",
    "JboyJW": "I experienced this exact same issue and the solution above fixed it.  My full size images are 800px by 1000px, and the image always showed full size and had to scroll.  Works as expected after altering the js code as above.. ",
    "NaiDev": "Hi, how do I implement that piece of code into my js file?\n. ",
    "timkingman": "I hit a similar issue trying to upgrade from 2.51 to 2.8.2.\nI still had the lightbox script included in the head, which meant the init method was running before I even had any page content at all. The docs tell you to add the lightbox script at the end of body, which fixes this issue. The click handlers are attached to body, so you don't need to run init() again after loading ajax content.\nMy patch recommendation would be to defer init() to run after the dom loads, which used to happen in a $(function(){ } ) block at the bottom of 2.51, but runs on script load in 2.8.2.\n. ",
    "leiz-me": "Same issue. Using the trick that @jpardi provided to make it work.. ",
    "janzii": "I have this issue also.\nSelects from hidden divs pops up after lightbox.end.\nAs long as the element didn't have visibility set explicitly before lightbox open, this can be resolved by setting visibility to \"\" instead of \"visible\", but at least for me those elements don't really need hiding in the first place.. ",
    "blueForestIcarus": "You could roll your own functions and add them to zepto as plugins.\nThis gist should work for you:\nhttps://gist.github.com/wheresrhys/5823198#file-gistfile1-txt\n. ",
    "WhiteCat6142": "please use this for v3\n\nEvaluate droppping jQuery requirement.\n. \n",
    "richrd": "I was just looking for a solution for this. I tried centering by setting display:flex on #lightbox but that won't work since the container has two children which are supposed to be on top of each other. If the container had one extra wrapper this could be easily achieved.. ",
    "kess42": "On a mobile touch device (iPhone 6, IOS 10.2.1, in the Safari browser):\nOn a long page with many images further down below, viewing an image requires to scroll all the way up to the top of the page to view this image(s) because it is not shown relative to the actual position on the page but at the absolute top (on the iPhone). Do I miss a parameter or is there a way out?\nThanks for the great script and your help, BR, kess42. Well, whereas Chrome and InternetExplorer seem to scale the image such that it is shown in full size, Firefox scales it to full width only and for the hight you have to scroll.\nActually for me the Firefox scaling is exactly what I would like to see in all browsers, because I frequently have high pictures (like newspaper articles that can be read scrolling down quite easily, but have tiny letters in full image mode).\nSo I guess, this is a feature request for an option \"fitImagesWidthInViewport\" = \"true\". Does this make sense?. ",
    "andreich1980": "Same story as @kess42 have experienced. \nOn small screens when click link to view a picture it scrolls the page to the top\nUPD It only happens when disableScrolling=true. ",
    "frankroch": "maybe this helps: #480 \n. ",
    "ensemblebd": "Why would you want to put a non-critical script in the header? it goes against SEO practices, and causes load-blocking so your page is slower. The only benefit to keeping it in the head, other than looking pretty, would be if you are using the defer and async attributes, at which point you would have to wrap it in an on-load function anyway. Which is the entire point of putting it in the body, and at the end. So that it is loaded last when the document is ready. And at the least, your page visibly loads before it starts downloading the addon resource!\nI'm sorry but I had to comment, this doesn't make any sense to me. There are far more critical issues at hand. Not to be dismissive or rude, that's not my intent - i apologize in advance if it came across that way. I just don't understand why anyone would want this!!\nI mean I've literally written code to regex process php output in order to get hardcoded head scripts out of there into the body in wordpress due to poor design practices... I can't imagine actually wanting to put something non critical into it! \nWe overuse the head these days, and it really should only have minimal css and meta tags, and only ONLY super critical resources, like a raw dump of jquery (so its available instantly, and compressed into the html output). The head should be redefined as \"only what is needed to load the above-the-fold page goes here\", where the word \"load\" has complete separation from \"display\" when it comes to body contents. \nEspecially when google, bing, etc require your page to load under 1 second to get a good ranking. Async & footer loading all the way man, hands down.\n. ",
    "mkousta": "I know this issue has been resolved but I think you don't need to delay execution until document is ready. Just a thought here, wouldn't just replacing here $('body') with $(document) resolve the issue? I think by doing this, even if someone puts the script in head tag, event delegation will do the work. Just a suggestion. You can ignore it if you have reasons to prefer waiting for document ready, if not, I could do the patch :)\n. ",
    "ashalaby": "Cache refresh fixed the issue\n. ",
    "eliz82": "\nBy default the caption link should use the color that is set as your default a color.\n\n:(\nNO, not a good idea! The \"a\" color of lightbox2 caption should be something visible against lightbox2 default dark background. And I can explain you why.\nBecause default \"a\" color on the page can be something dark/gray especially if the page background is a light color (like white). Your example with \"a\" default color on page being light blue on a white background is a happy coincidence.\nThey are thousands of wordpress themes out there, some users of my wordpress plugin that loading lightbox2 from a CDN may have bad luck and have a wordpress theme with dark \"a\" default color.\nYou must think this from the end users perspective, some wordpress users may not have skills to make css modifications to their theme.\nOr some developers may use CDN to load lightbox2 in the page (\nhttps://cdnjs.com/libraries/lightbox2 / http://www.jsdelivr.com/projects/lightbox2 ) you will force them to use local versions of lightbox2 and manually modify your lightbox.css to add a \".lb-caption a\" specification.\n. > I'm defaulting to a light blue similar to the default blue link color.\nit's ok.\n. ",
    "bufferUnderrun": "Ok thanks\n. ",
    "serdarde": "This is really what that plugin needs. @lokesh  Please add this on your next release . ",
    "jufracaqui": "Sorry for not beeing able to answer sooner. This issue happend while using cordova on Android 4.4.2 and the latest release of lightbox at the time. For styles i used Material Design Light, don't know if it's relevant, but just in case.. ",
    "achaios": "Here's a patch that fixes it. This is against 2.10.0 source, but I have only tested it on 2.9.0.\nThe culprit is that some svgs report 0x0 size, so we just display them with maximum size.\nlightbox-fix-for-0-size-svgs.zip\nGithub doesn't allow attaching *.patch files? How strange.\n. ",
    "objectG": "Thank you very much.\n. I have found the reason. In the function changeImage. you put the 'this.currentImageIndex = imageNumber;' at last. However, the function 'onload' will set the indexof currentImage before the currentImageIndex being chagned. The execute order is different between ie 8 and other browsers.\nAfter I put the 'this.currentImageIndex = imageNumber;'on the front of the 'var preloader = new Image();', it runs well in ie 8.. ",
    "flybeye": "Nevermind, I modified the the ...fadeIn('fast')...else to use \nlocation.href = $(this).attr('href');\n            self.end();\n            return false;. ",
    "simon1tan": "I had this problem too until I realized I didn't include the stylesheet properly.. Try modifying the options to reduce the delay http://lokeshdhakar.com/projects/lightbox2/#options. Yes, I agree this is a great project.. ",
    "miyagisan221b": "This works pretty well, except the play button (YouTube) isn't really clickable without some real precision.  Example: https://www.screencast.com/t/B2Ha5SHj. Ahh - it appears I downloaded the wrong version.  I must have had a moment and thought the latest commit was at the top.  Good show @peppertom, it appears to be working perfectly now.  Hopefully this is merged in with the main project soon.. ",
    "peppertom": "Thanks @miyagisan85, I really appreciate Your comment!\nActually my latest commit (02f0d6e) is about fixing the border (box-sizing) and in update navigation styles over video (d66b03d) I updated the video navigation so that the video could easily be controlled.\nPlease find my gif in which I highlight the nav areas and the YouTube play button.\nhttp://i.imgur.com/q9dJS1V.gifv. thanks @miyagisan85 . ",
    "Luc45": "Hi @lokesh, any plans for merging this? Video support would be a great addition to the library.. ",
    "bright-light-in-the-night": "I'm a little bit dummy. I had an \"e.stopPropagation();\" on all links from the same parent. ",
    "bgardineer4": "I have the same problem. No luck yet.. Okay, for me it looks like Lightbox was conflicting with Unslider, a jQuery slider plugin I'm using. Disallowing infinite sliders solved the issue. After scouring some other forums, it looks like a few others have had this problem with various slider plugins. I imagine it has something to do with how linking is handled for the edge photos of infinite sliders. I actually wasn't seeing duplicates of my interior images, just the exterior ones (e.g. if I had three photos in my infinite slider and tried displaying them in a Lightbox gallery, images 1 and 3 were duplicated, but image 2 was not).. ",
    "bellhop": "The slim version is missing the effects modules that are called by lightbox2.  Therefore, if you use the non-slim version it will work.  I have tested on JQuery v3.1.1 from the JQuery CDN.  See below: \n<script src=\"https://code.jquery.com/jquery-3.1.1.min.js\"></script>\n. ",
    "Blackglade": "ahh okay, woops!. ",
    "gordonchanhk": "Same issue encountered. I am also debugging just now and spot root for root.jQuery is undefined\nhttps://github.com/lokesh/lightbox2/blob/master/src/js/lightbox.js#L27\nAnd wonder this should be window?  https://github.com/lokesh/lightbox2/blob/master/src/js/lightbox.js#L29. I find that I have a Gulp script to run Babel with es2015 and turn out the script changing the this in https://github.com/lokesh/lightbox2/blob/master/src/js/lightbox.js#L29 to undefined. Would this be the syntax issue?. ",
    "so-rose": "Same issue encountered here. Anybody found a fix by any chance?. @mugukamil Thanks for the fix!. ",
    "mugukamil": "@so-rose for fixing, we need to add option to .babelrc { \"modules\": false }.\nBecause babel 5 when transpiling *.js files, replace all this with undefined. ",
    "ondrejsevcik": "@lokesh any chance that this will make it into the release?\n. ",
    "sakonn": "Hello, \nHave you sorted out the issue? . ",
    "reifnotreef": "I'm not sure what I did to fix the issue but it has been resolved.. ",
    "pschfr": "Yup! Check this CodePen!. ",
    "bgeree": "Nope! Try the following option:\n'albumLabel': false\nYou'll get this error in console:\nthis.options.albumLabel.replace is not a function. ",
    "edeleflie": "Ah, I solved it ... I down graded muy versio of JQuery to 2.1.4 (from 2.2 something) and it worked. ",
    "angieyu": "i figured it out :) my .lb-nav element was too big and it was covering the link. I shortened the height and the link works now. . ",
    "masiorama": "I have the same problem @swbdev  has.\nI Tried to reduce duration options but the problem, even if it lasts less time (obviously), still persists.. @swbdev  indeed it disappeared! Thanks.. ",
    "swbdev": "@masiorama can you update your chrome to the new v62? Actually I can't reproduce that bug anymore.. ",
    "gshmu": "add unique data-lightbox and remove unused dom. ",
    "szepeviktor": "Duplicate of #582 . ",
    "hpfn": "I am sorry to open an false issue.\nThe problem was the path to images directory.\nRegards,\nHerbert. ",
    "DarioCorno": "Got the same glitch. Did you find a way to solve it?. ",
    "carinp2": "No fix yet.. Yes, Chrome Version 61 on Win10 and I have no fix yet!. ",
    "mehta-ankit": "@carinp2 was this on chrome 61 and windows 10 ? I have seen a similar issue.. ",
    "davemin": "Same issue on iOS not working.. ",
    "Maculotti": "I can't see the image anymore because the image container it's pushed down and the container is fixed.\n@davemin is it working in your case?\nMay I suggest that if the options disableScrolling it's true always position the lightbox like this:\ntop: 50%\ntransform: translateY(-50%);\ninstead of using top: window.scrollTop() so it will be in the center of the fixed container.\nThanks\n. ",
    "jrpeters89": "It looks like the class \".lb-disable-scrolling\" is the issue. I commented out the \"position: fixed;\" attribute and it seems to be working fine now on desktop.\nhtml.lb-disable-scrolling {\n  overflow: hidden;\n  /* Position fixed required for iOS. Just putting overflow: hidden; on the body is not enough. */\n  //position: fixed;\n  height: 100vh;\n  width: 100vw;\n}\nThe author put a note in here though saying position: fixed is required for iOS. I am going to add this to the css to see if I can make it work on iOS as well (haven't tested yet):\n@supports (-webkit-overflow-scrolling: touch) {\n  /* CSS specific to iOS devices */\n  html.lb-disable-scrolling {\n    /* Position fixed required for iOS. Just putting overflow: hidden; on the body is not enough. */\n    position: fixed;\n  }\n}. ",
    "spdivn": "html.lb-disable-scrolling {\n  overflow: hidden;\n  position: static;\n  height: 100vh;\n  width: 100vw;\n}\nposition static work in iOS device and you can't scroll.\n@jrpeters89 @lokesh @wreighsantos . ",
    "SimranMalhotra": "Just add this script to disable scrolling in lighbox\n<script>\n        lightbox.option({\n    disableScrolling:true\n    })\n    </script>. ",
    "WebSpectrum": "Further investigation : the display problem in firefox is when hovering over next arrow in a sequence of images, . ",
    "olwimo": "Obvious better solution on https://github.com/lokesh/lightbox2/pull/627. Better solution on https://github.com/lokesh/lightbox2/pull/628. See the fix in action at https://jsfiddle.net/olwimo/0gptfeap/. ",
    "ahmeddabak": "Looks Great. ",
    "WildCrasher": "I have the same problem on slimbox2. Sometimes previous button doesn't show up. I discovered, that \"a\" tag displayed as block of next button overlays \"a\" tag of prev button. I will try to fix it locally in my project, but i send tip for you.\nEDIT:\nI have file slimbox2-fs.css and this part:\nlbNextLink {\nwidth: 100%;\nright: 0;\n\n}\nI changed it to:\nlbNextLink {\nwidth: 50%;\nright: 0;\n\n}\nThis file isn't provided by this library. So maybe you have similar file and similar problem.\nAnd working fine. Maybe that will help you in fixing that.. ",
    "MariuzM": "Ignore this i don't think this is related sorry . ",
    "Zenju": "This can be closed, pure CSS is the way to go: https://github.com/lokesh/lightbox2/issues/641. ",
    "Raemy92": "Solved it by adding a new div after the closing </body> tag and changed the append in the lightbox.js script from .appendTo($('body')); to .appendTo($('#id-of-the-div'));. ",
    "mightyiam": "I noticed it as well :)\n. "
}