{
    "M66B": "Thank you very much!\nDid you already try NetGuard?\nAny opinions?\n. The colors are deliberately 'intense' to provoke somebody looking into it ;-)\n. This is a file generated by Android studio\n. Thanks!\n. Thanks for the translation.\nI have manually added it, since there are a few texts more already.\n. Just in time for a new release.\nThanks!\n. Thanks!\n. Thanks for the update!\n. Thanks!\n. Thanks again!\n. There was a merge conflict, so I have updated the translation manually.\nThanks for providing the update!\n. I am glad you are just trying to use GitHub!\n. Thanks for the update!\n. Thank you!\n. Thanks again\n. Thanks again!\n. Thanks for the update!\n. Thanks for the update!\n. Thank you very much!\nThis is highly appreciated!\n. Can you please take a look here too?\nhttp://www.netguard.me/\n. The PayPal donation should be displayed as a clickable icon, which for me it does.\n. Which screen shot do you mean?\n. I first didn't understand the suggestion, but it is actually a good suggestion, so thanks @licaon-kter \nHow does it look like this?\nhttp://www.netguard.me/\n. It should display on mobile devices okay too.\n. @Gitoffthelawn I have replaced the external PayPal image by a self hosted image now, so it should display correct now.\n. I have made the image clickable as a compromise.\n. That would use quite some space when viewing on a small screen (mobile devices).\n. It is a good idea, but it is to wide for small screens.\nThe screenshot itself is already the size of a screen (obviously).\n. I don't think the settings page is the most important to show.\nEven without using the settings page at all, NetGuard is quite usable!\n. Fixed by changing the URL.\n. Should be changed.\nMaybe cached?\nI cannot find other settings on GitHub.\n. Fixed too, thanks.\n. Also fixed, thanks for your sharp eye!\n. Thanks!\n. Some information about .gitignore:\nhttp://stackoverflow.com/questions/16736856/what-should-be-in-my-gitignore-for-an-android-studio-project\n. Thanks!\n. This is the current English Play store description:\nhttps://github.com/M66B/NetGuard/blob/master/PLAY.md\nPlease create a pull request for PLAY-zh-rCN.md if you like to translate it.\n. Thank you very much!\n. Thank your very much!\n. Thanks for the update\n. Thanks for the translation update!\n. Thanks for the update!\n. Thanks!\n. Your remark that the VPN popup could surprise people is absolutely valid.\nMaybe it is better to display an explaining message in the application itself.\nIf you have ideas about a short, descriptive text, please be my guest.\n. I like to leave this to the Chinese translators.\n. How about: \"NetGuard uses a local VPN as a sinkhole for blocked traffic, for this reason you should allow a VPN connection in the next dialog\"\nThere is less information to consume with this text.\n. Thank you very much!\n. Thanks\n. Thank you very much!\n. Typos happen\n. Thank you very much.\n. Thanks for the update!\n. Thanks!\n. Thanks for the update!\n. I am not sure of the texts \"running\" and \"stopped\" yet.\nRunning could be something like \"Blocking selected applications\".\nStopped could be something like \"Allowing all internet\".\n. The texts are now definitive, so you can translate the new texts.\nMaybe wait a little, because more texts are coming ...\n. If you like, you can translate the new texts now.\n. Thanks!\n. Thanks!\nMaybe you can test version 0.17. I like your opinion on the new UI elements and also if the firewall still works in all circumstances (mainly when changing rules/settings and using the notification to stop/start the firewall).\n. Thanks!\n. Thanks for the update!\n. Thanks, this is information people need!\n. Thanks for the update!\n. Looks good to me, so merged.\nThanks for contributing and trying to use GitHub!\n. Thanks for the update!\n. Thank you very much!\n. Perhaps you can also take a look at the texts used by the application:\nhttps://github.com/M66B/NetGuard/blob/master/app/src/main/res/values/strings.xml\n. I am sorry you did this for nothing, since I have removed the feature to auto enable after a delay, because it cannot play nicely with the new widget to turn NetGuard on and off.\n. Thank you very much!\n. Thanks again!\n. Thank you very much!\n. I really appreciate your contribution, but please follow these directions:\nhttps://github.com/M66B/NetGuard#contributing\nAt this moment there are too many texts translated, which will give problems.\n. No problem at all.\nI will try to fix this tomorrow.\n. I have fixed the translation and it will be included in the next release.\nThanks for translation and helping Russian people not so fluent in English!\n. Than there is already to do something ;-)\nhttps://github.com/M66B/NetGuard/blob/master/app/src/main/res/values-ru/strings.xml\n. Thanks for the translation update!\n. Thanks for the update!\n. Thanks for improving the translation!\n. Thanks!\n. Thanks for keeping the translation up to date.\n. Thanks!\n. The long description is quite important, as it is shown in the application list of Play store, so it must say what NetGuard is in one sentence. Not everybody knows what a firewall is.\n. Thanks, documentation is as important as source code.\n. Thanks for the update!\n. Thanks for the suggestion!\n. Thanks, Ivan!\nDid you try the invite function?\n. Thanks!\n. Thanks, as always!\n. Fixed\n. Thank you very much for the translation updates!\n. Thanks for keeping the translation up to date!\n. Thanks!\n. Thanks for the update!\n. Thanks for the translation update!\n. Thanks again!\n. Thanks!\n. Thanks for the translation update!\n. Thanks for your contribution to the project!\n. Thanks, I have updated the Play store description too.\nThere is one little problem: the title is maximum 30 characters long.\nFor now I have left the English description.\n. Very good, thanks!\n. Yes, I know, but there was a sentence added.\n. Muchas gracias!\n. Is there anything that escapes your attention?\n. Now it is\n. Thanks, as always!\n. Something is not going as expected, since there are no files changed.\n. No worries and no hurry.\n. Thanks, you fixed it fast!\n. Thank you very much!\n. Merged too ;-)\n. The idea was to have it read [application/package name] has no internet access.\n. You are right about the internet permission, thanks for the suggestion!\n. Thank you very much!\nMaybe you also take a look at the Chinese Play store description and compare it with the English one (no obligations).\n. The order is the same as in the application slide down settings.\nThe reason for this existing order is that there is a dependency between these two settings.\n. @okungnyo the preferences (settings).\n. @licaon-kter the settings which appear when you tap on an application name in the application list\n. Thanks for keeping the translation up to date!\n. Thanks for keeping the translation up to date.\n. I will see what I can do about it\n. Unfortunately it is not possible to change how a preference title is being displayed, so the text needs to be shorter somehow.\n. Thank you very much!\n. Thanks, as always!\n. Yes, better if the list grows, which unfortunately it does :-(\n. Thanks for the update!\n. Thank you very much!\n. Thanks!\n. Yes, officially it is 'Wi-Fi', thanks.\n. Thanks, as always!\n. Thanks, Ivan!\n. I like this, but I hope the image links won't break in the near future. I tend to support my projects for a long time (XPrivacy almost 2,5 years now).\n. Still missing the height for en_generic_rgb_wo_60.png.\nWhy not use: https://f-droid.org/wp-content/uploads/2014/04/cropped-header_resp1.png\n. Thanks, as always!\n. Thanks!\n. Metered = pay for traffic used.\n. All, please.\n. Thanks!\n. Good idea!\n. Thanks for checking the texts!\n. Thanks!\n. Thanks, as always.\n. Thanks!\n. Thanks for the update!\n. Thanks for the translation update!\nYou can now translate online as well and I am preferring it, since it saves me synchronization:\nhttps://crowdin.com/project/netguard/it\n. Good\n. Thanks for the translation update!\nYou can now translate online here too:\nhttps://crowdin.com/project/netguard/ru\nWhich I prefer, since it saves me copying files back and forth.\n. Perfect, thanks!\n. Thanks!\n. Which device(s) has/have this problem?\nIs checking the telephony manager a reliable/documented method?\n. @marco-scavuzzo can you please check my way of fixing and maybe review the commit?\n. Correction: thank you for fixing this :-)\n. IMHO the telephony manager workaround is better, because telephony might not always require a SIM card.\n. This is only if the feature check returns a wrong result and the workaround kicks in, so I do not consider this as a big problem.\nI am wondering why the feature check returns a wrong result.\n. Thanks!\n. Spying is not the only thing which can be done, also downloading and installing malware, etc.\nI also expect done common sense, so this needs not to be detailed IMHO.\n. I prefer the phrase 'for the selected number of minutes', else this is a good suggestion.\n. Thanks. Could you also please test this new features? And also the new pro features, which have an endless trial at this moment.\n. For now I will not add applications which are part of stock Android, but I might change my mind later, so I keep this pull request open.\n. Unfortunately there is a conflict with the translations already done on Crowdin:\nhttps://crowdin.com/translate/netguard/44/en-de\nMaybe you can check the existing translation on Crowdin.\n. Can you please upload the translation here:\nhttps://crowdin.com/project/netguard/fr\n. Thanks a lot!\n. Thank you for the fixes!\n. Thanks!\nI am assuming you did test if there were no side effects.\n. Thanks, this is a nice addition!\n. It does not work for me, so I have undone the pull request.\n. Yes, with the new host name resolution it will be harder.\nNote that for effectively querying the database the IP address needs to be indexed. This has as disadvantage that writing new records will be more expensive.\nMy advice is to wait with this until I am finished with the native code, since there could be more changes in the way logging is been done (currently there is a performance problem with it).\n. If you want, you can do another try, because I have done the database changes I planned to do (for now). I have also added an index on 'daddr' (formerly 'ip') to facilitate searching. There is also a new menu option to disable/enable host name resolving.\n. I have uploaded your translations to crowdin, which is the preferred way of contributing translations.\nhttps://crowdin.com/project/netguard/es-ES\n(you can login using your GitHub account)\n. I have to thank you for contributing new translations!\nThere are a few strings left to translate, see crowdin, maybe you can look into it.\n. Thanks for fixing this, unfortunately to late for the beta release.\n. Thanks for trying to help, which is much appreciated.\nI intended it to solve it this way: https://github.com/M66B/NetGuard/issues/241\n. This solution seems more transparent to the user, but has as disadvantage the file is not deleted.\n. This change is not needed anymore, since there is a switch to enable/disable domain blocking now.\n. Didn't you update the texts on Crowdin as well?\nThere is no need to do a pull request then, since I will synchronized with Crowdin periodically.\n. The debug options and technical info headers are not translatable, so this is right.\nThe development options will only be available in beta builds, but I have just made the headers of the technical info translatable.\n. The technical info header texts are now available for translation on Crowdin.\n. I think this was nicely written down!\nCan you please add a link to the FAQ from the README as well?\n. AFWall+ has one advantage though: it can prevent leaking during startup, although I am not sure if this works properly. For the rest NetGuard has a few nice extra features, which AFWall+ doesn't have.\n. AFWall+ will use less battery.\n. Perfect, thanks!\n. I am in the middle of rewriting/testing a better TCP handling, after I have finished that, I will merge this.\nThanks for creating this pull request.\n. In my experience beta products often cost you time, which I rather spent in developing NetGuard.\nAs soon as 2.0 stable is released, I will upgrade.\n. The rewritten TCP stack seems to work okay now.\nThe TCP close handling has been revise and receive window calculation has been implemented.\n. There will be an application selector later\n. I didn't add this, because IMO everybody knows what an hourglass means.\n. http://www.netguard.me/NetGuard-v0.90-beta-2016021901-all-release-busy.apk\nhas this pull request, better positions the toasts and long pressing the NetGuard icon will show about.\n. What is your opinion about the current (English) Play store description?\n. I value your opinion, so please do a pull request about how you would describe NetGuard\n. I had the project open, so removing a few letters was easy ;-)\n. But it is a good catch, which will prevent trouble I am not waiting for, so thanks.\n. Thanks\n. Extra spaces? They should not be need, but maybe I am wrong.\n. In the Play store this will show properly.\n. Thanks!\n. I have not overlooked this pull request and I will process it as soon as I am back home. Thanks for translating the Play store description in Spanish!\nFranco notifications@github.com schreef op 26 februari 2016 14:37:56 CET:\n\nAdd Google Play description in Spanish.\nYou can view, comment on, or merge this pull request online at:\nhttps://github.com/M66B/NetGuard/pull/347\n-- Commit Summary --\n- Create PLAY-es.md\n-- File Changes --\nA playstore/PLAY-es.md (62)\n-- Patch Links --\nhttps://github.com/M66B/NetGuard/pull/347.patch\nhttps://github.com/M66B/NetGuard/pull/347.diff\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/M66B/NetGuard/pull/347\n. Sorry, but I don't want to be this part of the source code.\n. - Force restart: fine with me in the debug settings\n- Route DNS: I don't think this will fix anything and risk only breaking things\n- Ignore system DNS: fine with me in the debug settings, but handle the setting in getDefaultDNS, so that the upper layers don't need to be modified\n. Device specific workarounds will not be very maintainable, so better a debug setting.\n\nJust let getDaultDNS return 8.8.8.8 only when the settings is enabled.\n. If there is no use case, I see no point in adding a new setting.\nI have my doubts about the force restart, because I rather find the cause of the problem.\n. Ignore is ignore, so you'll be responsible to provide a DNS server yourself.\n. I have revert the change, since it will let the settings crash\n. The settings assume there is at least one DNS server.\n. Can you tell me why you want this setting again?\n. Thanks\n. The tether routes are also needed in non filtering mode to keep tether traffic from flowing into the VPN.\n. Old already, indeed.\nHopefully Android N us supported now.\n. Thanks.\nMaybe there should be an explanatory text about this.\n. Thanks\n. Thanks!\n. Thanks\n. Thanks!\n. NetGuard is a no-root application, so I see no point in adding this.\n. Thanks\n. Muchas gracias!\n. Thanks!\n. I want to keep the number of settings to a minimum (there are already too many) and I am not sure if people really want this. Nobody has ever asked about it.\n. I have been thinking about this, but high priority notifications should only be used for really important things, like incoming calls and weather alerts, but not to notify about newly installed applications. The Google Play store notifications are similar in nature and are normal priority notifications as well. Personally I would hate this feature.\n. Are you sure that this works?\nCan it detect an installed VPN dialog package?\nCan it detect an absent VPN dialog package?\n. Okay, that is good, but how do we know that the package name is the same on all devices? It is called 'com.android.vpndialogs' in AOSP, but do all manufacturers call it the same? I am afraid this is not the case, which would result in false negatives. IMHO is it better to let NetGuard crash if somebody removed the VPN dialog package, because then that somebody has root permissions and hopefully knows how to handle broken things. I didn't encounter Android versions with a missing VPN dialog so far (no-root users).\n. Too bad for you.. Thanks!\n. I though I merged this (on my mobile device), but apparently not, fixed now.\n. I know it is a kind of hot topic currently, but that is not a good reason to include this detail in the feature list.\n. User are not and even cannot be tracked or profiled, so I don't see any misleading/confusion here.\n. True, but it is not a user profile, since no user information is being shared.\n. Even if the data would be sent over an insecure connection, the data cannot be used to identify people, so IMHO this adds nothing.\n. To me this feels as misleading/confusing people.\nI don't want to apply \"If you can't convince them, confuse them\" (https://en.wikiquote.org/wiki/Harry_S._Truman)\n. It is true that it states the way things are, but it also suggest that a secure connection and the data not being privacy sensitive are related to each other, which is untruthful.\nEven with a MITM attack no privacy sensitive data can be revealed, because no privacy sensitive data is being sent at all.\n. Thanks!\n. Thanks!\n. Thanks for improving/fixing this!\n. Thanks!\n. Thanks!\n. Thanks\n. Translations are managed by Crowdin, menaing that this change would be overwritten later.\nhttps://crowdin.com/project/netguard\n. Indeed, thanks!\n. Thanks!. The idea is good, but some details needs to be worked out.. Thanks for doing this and creating a pull request.\nContributions are rare.. I am going to close this pull request, since it seems abandoned and it is being misuse for somebody else's requests.. I misunderstood, but the traffic stats are also independent of filtering/logging.\nIf these are zero, then your Android version (which?) doesn't support traffic stats. Unfortunately there is no API to check if these stats are supported. Querying for all apps to see if everything is zero is no option.\n. The track usage setting will track the number of bytes sent/received per connection, not for the app as total, which is delivered by Android:\nhttps://developer.android.com/reference/android/net/TrafficStats.html\n. Could you please try compiling with the above commit?\nI can't test this on Android 7 Nougat ...\n. Yes, but there is more in the commit .... I guess you have filtering mode enabled.\nThis can be considered to be a bug in your Android version. It seems to be fixed in Android 7 Nougat.. Thanks for this pull request.. Good, thanks.. Thanks.. Invalid. This project is not about money and the features you are suggesting​ in a rather strange way are not related to a firewall.. Please use the XDA forum for discussion.. @adisib can you please contact me through this contact form?\nhttps://contact.faircode.eu/\n(select \"NetGuard donation\" and fill in your GibHub username as challenge). Big thanks for these corrections!. I already replied earlier today, please let me know if you didn't receive my reply.. Done. Thanks again!. Thanks. Thanks.. Thanks again for the corrections.. Almost nobody asks about this, so I don't think it is worth a FAQ.. Thanks for this!. Thanks for this as well!. Thanks!. Thanks!. Thanks. This will be part of the next release, so you don't have to do anything.. Please use Crowdin to translate text: https://crowdin.com/project/netguard\nCrowdin translations overwrite translations in this repository.. What is this?. NetGuard will close idle connections automatically independent of the protocol, so I don't see what this adds.. After forwarding a packet 'stop' will be set:\nhttps://github.com/M66B/NetGuard/blob/master/app/src/main/jni/netguard/icmp.c#L137\nAfter 'stop' or timeout the socket will be closed:\nhttps://github.com/M66B/NetGuard/blob/master/app/src/main/jni/netguard/icmp.c#L38\n. I will remove the workaround because that seems better to me.\nThanks for your contribution!. Thanks.. Thanks!. Did you check if this doesn't use too many file descriptors? Most devices allow only 1024 file descriptors per app.. That is too much in my opinion. There are already too many problems with running out of file descriptors.. Many apps do pings to check connectivity, so it will not just be ping apps.. Thanks.. Why?. Thanks. All translations are coming from Crowdin and overwrite the GitHub translations, so merging this would not be useful.\nAll translations should therefore be managed on GitHub and Crowdin import issues should be fixed in this file:\nhttps://github.com/M66B/NetGuard/blob/master/tools/crowdin.sh\nI believe you can import the translation file of the pull request in Crowdin, so your work is not lost.. Thanks for doing this anyway!. I will look into this next week.\n. Am I correct that 'nb' is Norwegian Bokmål ?. Could you please check if everything is okay in this release?\nhttps://github.com/M66B/NetGuard/releases/tag/2.205\n. Thanks for doing this. Translations are coming from Crowdin, so merging this would be overwritten on the next Crowdin sync. So, can you please correct here: https://crowdin.com/project/netguard (much easier than a pull request as well). I see no need to rearrange code.\nWhy only a non null attributes for context? BTW, non null attributes were introduced long after this project started, mainly for Kotlin.\nAdding documentation is fine, but it needs to be single line comments, not comment blocks. I am aware that the convention is to use comment blocks, but IMHO they take too much space and I like to see as much as possible source code on one screen.. I am sorry, but I am not going to merge this because you have now introduced bugs that can lead to crashes. NetGuard has a stable code base and I am not going to take any risk with it given that 100 thousands of people rely on NetGuard.\nNote that I am nothing going to explain what is wrong because this isn't a programming course.\nThis is not meant unfriendly, I just want to spent my time on other things.. Thanks for your intention to update the German translation.\nHowever, translations are managed on Crowdin: https://crowdin.com/project/netguard\nThe next download from Crowdin would overwrite your updates, so accepting this pull request isn't useful. So, could you please use Crowdin for this?. Good find.\nThe comment was right, the code wasn't .... I have revert this change because it is incorrect.. https://forum.xda-developers.com/showpost.php?p=78631645&postcount=8207. For privacy reasons Google backups are deliberately disabled.. There is an export for this. When needed, please continue this discussion on XDA.. The .gitignore is the default Android Studio .gitignore.\nWhy should .idea be excluded completely?\n. Isn't that a long title for a menu item?\n. The e-mail the invitee receives contains already part of the Play store description, so 'firewall ce nu necesita root' seems unnecessary to me.\n. The long description is maximum 80 characters.\nWould this be okay: 'Netguard, primul firewall gratis si cu sursa deschisa ce nu necesita root'.\n. This suggestion is okay, but it needs to be a string resource reference to the application name.\n. The width and height (see screenshots) need to be set, else the anchors don't position correctly on all browsers.\n. Better remove this: &referrer=utm_source%3Dgithub\n. I don't like to track people in any way.\n. Please remove these, the contents are too small to justify a separate section/link\n. This one needs to go too.\n. No need for extra white space\n. I don't like spaces after/before parenthesis, because word wrapping is often horrible.\n. I don't like capitalization of all words, but apparently this is what Google does, so leave it.\n. status bar is the correct denomination.\n. The top system bar is called the status bar\nThe second application bar is called the action bar\nDon't blame me ...\n. Okay, I see, but to understand this correctly, you need to know that the status bar notification icon is shown in the status bar even when it is low priority if there are not many other icons to show. The exact behavior is not known to me, since it is not documented. So the notification can and will be visible in both the status bar and the pull down notification screen, depending on the circumstances.\n. This can crash of get system service returns null.\n. This should be 0 (not blocked).\n. Unlike most Americans (nothing bad meant) I don't like unnecessary capitalization.\n. I prefer this check for the call.\nBetter leave curly braces out when not needed, so we can see more code on the screen.\n. Better call this pref_domain_filter\n. Lint will help prevent errors, so why turn it off?\n. Good reason, but we should strive to solve these warnings/errors.\n. This code should stay to enable filtering by default on Android 5.0, but there is a bug here, since LOLLIPOP_MR1 should read LOLLIPOP. People can choose to disable it, but to prevent complains (the blocking all problem) it should be enabled by default (hence the remark \"optional\").\n. This should not be changed like this, since it will mandate filtering on Android 5.0, which is not the intention.\n. So, bug, because filtering should be enabled by default on 5.0 for this reason, not on 5.1\nI don't remember what was wrong with the Note 4, can you refresh my memory?\n. \"Telephone unresponsive\"\nI have no idea if that is fixed now.\n. It is best practice not to negate condition when there is no need to (when there is also an else).\n. Good, but please separate the version name and code by a slash and add this in ActivityMain as well.\n. Several people have reported that NetGuard will crash.\nMaybe it depends on the Android version/customization.\n. That is not possible, I already tried.\n. It should say something like aggregated data.\n. \"Sending usage data can optionally be disabled per application.\"\nI try to prevent using the word user, because it sounds somewhat awkward to me.\n. Generally the caller should check the validity of its arguments to keep the calling code as simple as possible.. Unused imports?. Extra blank lines?. Unneeded braces.\nReason: to keep as many as possible code lines on screen, the number of opening/closing braces should be kept to a minimum.. Isn't this going to be slow on low end devices?. Why removing the watcher?. This will crash on a MalformedURLException (hostsURL null), better restore the original.\nBasically only EditTextPreference needs to be changed into HostsTextPreference on line 292.. What if somebody wants to enter a file:// URI type?\nBetter use getScheme of Uri to check if there is a scheme and build a new URI with the default https (not http) scheme.\nhttps://developer.android.com/reference/android/net/Uri.html#getScheme()\n. Then this is not an acceptable solution, because there is more in the world than only those protocols.\nGoogle doesn't seem to comply to the standards as well: https://www.ietf.org/rfc/rfc3987.txt. SOCKS5 is free, but only available in the GitHub version of NetGuard.. 127.0.0.1 is not a valid DNS server address. This will not be added to NetGuard. isn't this a typo (space missing?). I am no sure what this is about.. ",
    "Gitoffthelawn": "You're quite welcome, Marcel.\nI am not working with any Lollipop or Marshmallow devices right now, so I don't have a test platform for NetGuard.  Otherwise, I would be happy to test it for you.\nThe screenshot looks good.  All the UI elements are clear and understandable.  The layout is effective.\nThe color choice with the bright orange is very intense; I would recommend toning it down a bit.  It may, however, just be an artifact of the device on which you generated the screenshot.\nOverall, it looks like a very useful app.  Well done!\n. LOL  :)\n. You are quite welcome! Glad to give you a hand.  :-)\nThe netguard.me site now looks good as well.  The only error is that the Paypal link does not look like a hyperlink (it looks like normal non-clickable text in most browsers).  This is because it is a form input, and not an a href.  The solution is to convert it to a href or to apply the link color manually.\n. I took another look at the PayPal issue.  It is not an issue with your site.  I restrict access to all external calls to PayPal sites unless certain parameters are met.  As a result, the PayPal image does not appear and I see the alternate text.\nI don't see it as an issue, as long as you are aware that others may block third-party content as well.\nIn regards to the suggestion by @licaon-kter, I think it is a good one.  A screenshot of NetGuard on the netguard.me site is a good idea.  As netguard.me starts to appear in search engines, it may be the starting point of people being introduced to NetGuard.\n. The self-hosted PayPal image works well.  The screenshot does too, but I agree it's a bit small on a desktop screen (although, as you point out, it looks good on a mobile device, which is the primary audience).\n. That works!  :-)\n. You're welcome.  I also finished working on the other strings you requested.\n. You're welcome!\n. You bet.\n. @adisib Implemented.  Thank you for your review.. @M66B You're welcome!  Glad to help.\nWere you asking me to contact you, or @adisib?\nI sent you a direct email, but I can resend using your contact form, if you like.. You're welcome!. You are quite welcome.. No problem.  Although, I'm surprised it's not frequently asked, because without an explanation it feels like a bug.  I have a hunch most people just install NetGuard and use the bare minimum functionality.. Thanks... I'm on it.. Yes.  On it now.... ",
    "Frasprite": "You're welcome.\nGG for the idea!\n. ",
    "S-Shen": "Oh sorry for causing conflict. I'm still trying to figure out how GitHub actually works\nGlad to help. Good day :)\n. One quick question, I can see the description on Google Play is part of README.md. Could I translate that as well and if ok how do I proceed?\nThanks!\n. ok. should I revert the changes and wait for you to finalize?\n. ",
    "licaon-kter": "Do put that screenshot on the right side of the website, it makes the point better.\n. Any\n. Looks smaller, better make it 100%.\n. Also add the preference picture on the site.\n. So I see that now, maybe do it differently, on click show a combined image\n. Users can zoom in/out :)\n. I do agree though.\n. BTW http://blog.bokhorst.biz/about/ yields a 404\n. And the About me page there too, come on :)\n. On faircode.eu I mean.\n. And your name at Copyright lower left :):)\n. Not happy with VpnService API being mentioned?\n. Well yeah, ok.\n. Ok, then delete everything after the comma\n. Yeah ok, but when you \"show more\" you kinda get the same line yet again, mentioning firewall.\nFelt the repeat is unnecessary.\n. Oh forgot about...\nmake it: NetGuard - firewall fara access root\n. I did translate those before... :D\n. not merged?\n. [application/package name] does not have internet permission\nSounds better to me :) because it can get that permission in the future.\nI wanted to emphases \"permission\"\n. What are \"application slide down settings\" exactly ?\n. Ok\n. Better?\n. That's 60 already, I'll need to change the way it's linked though.\n. Now?\n. :)\n. all?\nI though it's better to stand out.\n. Better?\n. Missed it.\n. Hope it's mergeable now.\n. Yeah, just saw it for the widget, I'll amend it right away.\n. Strange: https://crowdin.com/translate/netguard/44/en-ru#906\nThe other are not in the strings yes.\n. The leak protection needs root aka true init.d support in ROM, which might need a custom ROM on an bootloader unlocked device... how many of those are there in % ?\nIf no kernel init.d support you'll need an emulated init.d that's just an app that starts on bootdone intent and runs some stuff, which you already do but it does not fix that.\nIn my tests, on a rooted device I always ended up with all traffic blocked somehow, when having AFWall+s iptables script in init.d, so YMMV.\nI'll mention hosts block for GitHub builds once those are in README.md ;)\n. AS2 entered beta already, maybe you can look at it later too: https://github.com/M66B/NetGuard/issues/211 ;)\n. Yes and no, at first you see it before seeing the shield, actually if you see it long enough (hitting a bug or reloading errors or something) you might be tempted to long press it to see what it means. ;)\nAlso, all the other icons have this, it's consistent.\n. You cut a big chunk, no rewrite?\nAnd you already know my opinion on clear descriptions, aka:\n- (PRO) Optionally log traffic/display network speed graph\n- Material design, with selectable theme (PRO 5 more)\n. You'll weed out some of the 1stars that have a problem with the pay for this view popping up.\nLike I said, I would like a PRO prefix, a ★ or something inside the app too, to single out features that would yield the PRO features view.\n. Oh, ok, saw your commit now. Better.\n. I did not realise it was a bug, thought you wanted it like this.\nBTW, the screenshots are with the default settings, hence on tablet (6.0) filtering is OFF while on phone (5.1.1) is ON.\nThat triggered this PR ;)\n. In my browser they ended up as: * feature * feature * feature\ninstead of:\n- feaure\n- feature\n- feature\nIs this looking ok for you: https://github.com/M66B/NetGuard/blob/6f6b761ebd952ff55583dd05d82c224980e031cb/PLAY.md ? \nNot for me at least in Firefox and Opera.\n. Oh right.\n. Not even the fix for #345?\n. Force restart - better limit it to my case || (\"Sony\".equals(Build.BRAND) && Build.VERSION.SDK_INT == Build.VERSION_CODES.LOLLIPOP_MR1) then ?\nRoute DNS - not really caring about it, hope it is helpful to someone though\nIgnore system DNS - same. I did try it in getDefaultDNS too, but it's only moving the last if (ignoresys) so I did not feel it was an improvement.\n. Force restart - just merge the first patch from this PR\nIgnore system DNS - see https://github.com/M66B/NetGuard/pull/356\n. Again, I only want forcerestart for #345 \nI made a PR #356 for ignoresysdns since, given your advice above, I thought you might want/find it useful\n. So if VPN DNS is empty you end up DNSless?\nVPN DNS value in settings will be empty, also no hint will be shown.\n. :)\n. use_defdns in XML vs usedefdns in .java might have been at fault?\n. Yet again Github search fails me  I keep forgetting that I need to grep locally since here it will miss strings. :(\n10x\n. Yes, I thought this might be an one-liner, I was wrong, without the routes tethering fails packet to tetherip uid 0 blocked\n. When does this appear? I hope not every time NetGuard reapplies settings or such, those happen a lot, specially when changing network (types), dozing, powersaving and what not.\n. Oh, on app install, now I get it.\nIt could be something yes, now this would work, imho, by either having the notification or the heads-up, maybe the settings toggle could switch between them.\n. Not merged yet?\n. To me this feels as misleading/confusing people.\n. Their (in app) activity is tracked, the sum of that data is a profile.\n. Ok, you'll answer the Google Play store questions as you see fit then. :)\n. Adds peace of mind for the user...\n. It's not misleading, it just states the way things are.\nYour data sharing is as secure as a Google Play store connection (although I did not go that far), to say a MITM, a global actor that just gathers data or such.\n. wat?\n. Not sure I follow.\nThis should just remove the +0.00/+0.00MB/day useless text from app view, the graph still works afaics.. Samsung 6.0.1 & Xperia 6.0.1\nNeither have the compound stats, BUT (if track_usage is on) have per domain stats.\nI remember this working, but on 5.1.1/5.0.2, and having track_usage off 100% of the time I thought this might be at fault.\nIn Android settings, network stats I do have per app traffic info.. > which is delivered by Android\nSo if Android delivers (per that link) the value of UNSUPPORTED as -1 then your code will just make it zero?\nWill check with that commit later today.. Got around to test this and works as expected.\nLearn one more thing, while the Android stats list all apps usage, if I sort apps by usage in NetGuard the very first app, and the only one with stats visible (aka not zero) is... NetGuard.. Yes, filtering is ON, although I'm not seeing anything different with it off, NetGuard stats get updated, but all the other apps have none (zero).\nMaybe they limited the stats to own app only? Eg. NetGuard can only see its own.. Better?. What is this exactly? . Oh, did not know that, yes it's ok.\n. I hoped it's useful ( point 2. ): https://developers.google.com/analytics/devguides/collection/android/v4/campaigns#google-play-campaigns\nalign=\"left\"\n. It is? Strange thing.\n. No, not that, the thing is as long as you don't actually have an icon there but only a notification somewhere else ( aka notification screen ), I felt this needed better wording.\n. Oh, ok, for now I only saw that behaviour: high w/ icon or low w/o icon.\nThe more I read the less I find something that mentions exactly how that is called. Notifications shade or no mention at all.\n. No bug there, from my perspective, SDK21 aka LOLLIPOP covers 5.0.x, where you had a lot of complains.\nSDK22 aka LOLLIPOP_MR1 covers 5.1.x where you had no complains (except that Note4 :P)\nYou are covering that Note4 case?\n. I'll fix this yes.\n. https://github.com/M66B/NetGuard#compatibility\n. Yeah, it sounded funny to me too. :)\n. Oh, saw it with a shopping basket at one time, indeed I did not see any info on this, so I still believed it was a $$$ feature.. ",
    "Ivan4537": "Sorry, I've been on this site for the first time, and don't quite understand how to work here.\n. I noticed a bug. After its translation into Russian of the application menu disappears button \"Invite\". Don't know what it involves.\n. With the development of your program will update the translation :)\n. No problem\n. Yes! Messages are successfully sent and delivered.\n.  Half of text of /string name=\"setting_unused\"/ not visible. \n. Thanks!\n. Here on this screenshot perfectly clear that the text is cut off. https://goo.gl/6vCb8R\nShould be: \"Разрешить сети, когда экран включен, по умолч.\"\n. Well, not scary. I think that the meaning of the menu item will still be clear. Thanks for the reply.\n. Okay, I'll try there.\n. That's right, I update on Crowdin. But why is there I did not find the text translated now on Github. And I can't find and translate this text (a tick marked the most important text that I would like to translate). It's hidden in .smali or .xml? Or you have not yet added to a translation on Crowdin?\n\n\n\n. The sentence translated, but the app itself is in English...\nAnd the words that are not in strings.xml will be available for translation ever?\n. Okay, thank you\n. ",
    "cabrerahector": "¡De nada! It's the least I can do for your wonderful work :)\n. ",
    "marco-scavuzzo": "Sorry, it's my fault. In the rush I forgot to add italian strings.xml.\nFixing now \n. you're welcome ;)\n. Of course, if you prefer so ;)\n\nIl giorno 21/nov/2015, alle ore 11:08, Marcel Bokhorst notifications@github.com ha scritto:\nThanks for the translation update!\nYou can now translate online as well and I am preferring it, since it saves me synchronization:\nhttps://crowdin.com/project/netguard/it https://crowdin.com/project/netguard/it\n—\nReply to this email directly or view it on GitHub https://github.com/M66B/NetGuard/pull/173#issuecomment-158620271.\n. I noticed it on a Nexus 7 (2013) LTE. It only showed the wifi settings and, by setting applications blocked by default of course I was not able to control their behaviour when connected with the mobile network.\n\nThe documentation says: \"The service or null if the class is not a supported system service. \"\n. I've just tried the modification on another Nexus 7 (2013) but without 3G/LTE support and there is a problem. Now also mobile network options are shown. Hence, I would say this method is not well documented. I should come up with another solution.\nSorry\n. Tested on two Nexus 7 with and without SIM card support. Now it behaves properly\n. Now it should be fine\n. Sure, I'll let you know asap\n. Seems good to me.\nThanks for fixing :)\n. Of course the workaround will not work if there's no mobile network (or the tablet is in air plane mode) and NetGuard was not previously started. So I was trying to see if there is another way around, that doesn't involve network connectivity at application start\n. Seems that getting the SIM state should be a more general solution. If it doesn't return ERROR or UNKNOWN we are sure that there is at least a sim card slot.\nAt least in Nexus 7 LTE  it always returns SIM_STATE_PUK_REQUIRED, whereas in the Nexus 7 without telephony is returns SIM_STATE_UNKNOWN.\nIf you agree, I can change this and make a pull request\n. Yes, but lets consider the following scenario:  someone installs NetGuard on a Wi-Fi connection and, for some reason, there's no mobile network at all. In this case, no mobile network icons will be shown.  Then, he/she selects \"Block all applications by default\" and starts configuring NetGuard. When he/she will switch to a mobile network connection (when available) all applications will be blocked and he/she won't be able to fix this, unless he/she disables NetGuard, terminates the application and restarts it. Only at that point, if a mobile network is available, he/she will be able to change the settings for the mobile network.\n. Really I don't know. I would have understood it if I was using a custom\nROM, but I am on an original unrooted Android 6 version.\nIl 19 dic 2015 9:45 PM, \"Marcel Bokhorst\" notifications@github.com ha\nscritto:\n\nThis is only if the feature check returns a wrong result and the\nworkaround kicks in, so I do not consider this as a big problem.\nI am wondering why the feature check returns a wrong result.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/M66B/NetGuard/pull/204#issuecomment-166022731.\n. True, I am going to fix it\n. \n",
    "ghost": "Order what?\n(Sorry, I'm just curious.)\n. Thanks.\n. Awesome, the Devil is in the details!\n. tcpiputils.com now resolves to dnslytics.com. ",
    "User99gmxat": "Marcel, you're welcome!\nCheers, Armin\nMarcel Bokhorst notifications@github.com schrieb am 15.11.2015:\n\nThank you very much!\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/M66B/NetGuard/pull/151#issuecomment-156815596\n. Your're welcoem. Another question: What do you mean exactly with 'metered Wi-Fi networks'?\n. Ok, then I did it right ;)\n. \n",
    "an0n981": "I think that worked.\n. ",
    "Primokorn": "No problem.\nEDIT: done\n. ",
    "rgarza": "Yep, i did some testing, worked fine in my Nexus 6P\n. Ok, i will check what i missed, seems to work fine for me in Emulator and phone, will check later today.\n. I found the problem, seems i missed one call in the onQueryTextChange, but now with the call to resolve the ip makes it hard to filter just by Ip address it should be allowed to filter by hostname, but since thats resolved dynamically that cannot be done in sql side, do you have any preference on how to handle?, would it be better store all data in SQLite? for easier searching? but maybe file would grow a lot.\n. ",
    "franco999": "Ok, thanks!\n. ",
    "pylerSM": "Notification when new app is installed to configure NetGuard - allow/block. I like it better to get popup notification to clik or not. \n. You can test... Just install new app to see heads up notification: http://www19.zippyshare.com/v/gW92kGq8/file.html\n. If you dont enable Heads up notification => you get normal notification\nIf you enable it => you get Heads up notification\n. yes, VPN dialog package is normal android package. If missing, VPN confirm will crash for sure.\n. I believe no vendor changed com.android.vpndialogs package name...\nBut yes. you have the truth. no root users cant remove it anyway.\n. Then we can just check for vpndialogs package\n. ",
    "kyze8439690": "Some ugly rom did remove this package for unknown reason.. ",
    "avandorp": "Done https://crowdin.com/translate/netguard/44/en-de#960\n. ",
    "gsora": "Sadly my Android skills aren't that sharp, but this is a contribution I felt was needed. \nThank you for pointing out all the flaws on my code, I'll try to correct them as soon as possible. . What about moving the entire validation path (RFC 3987 + http{s} prefix presence) to HostsTextPreference? I have a working example ready to be pushed.. The default behaviour has been restored, please see commit 647e981. Since Patterns.WEB_URL doesn't match any URI type other than HTTP, HTTPS and RTSP, the \"OK\" button wouldn't be enabled, thus preventing any  exception.. I've just noticed that, they even tell that in the documentation.\nI'll try to come up with a better regex in the next few days.. ",
    "adisib": "Other recommendations (it wont let me add everything to a review so I'll just put it here I guess?):\nLine 131: \"This notification can unfortunately not be removed\" to either \"This notification can, unfortunately, not be removed\", \"This notification unfortunately can not be removed\", or \"This notification unfortunately cannot be removed\" (unfortunately is awkwardly used).\nLine 138: \"To avoid this problem, at least temporary, close all applications and/or services which may be running in the background\" to \"To avoid this problem, at least temporarily, close all applications and/or services which may be running in the background\" (temporary to temporarily).\nLine 223: Same as 131\nLine 328: \"Conditions like 'When screen is on' are on the other hand convenient because they work automatic\" to \"Conditions like 'When screen is on' are on the other hand convenient because they work automatically\" (automatic to automatically)\nLine 396: \"Besides not being trivial to add, schedule are in my opion not a good idea\" to \"Besides not being trivial to add, schedules are in my opion not a good idea\" (schedule to schedules). You forgot to change \"any application can disabled NetGuard\" to \"any application can disable NetGuard\". ",
    "ARONbr1": "Hi there I don't know how to apply this to the application. If you could map instructions on how to do it I gratefully appreciate it. Thanks . ",
    "victor8886": "sync. ",
    "top-master": "we was not clear at first but will try to be more informative.\nReproduce Failure:\n1. install and run any ping app that does repeat ICMP requests to the same web-site/IP but every time on an other port like ping\n2. start NetGuard and block every thing except that mentioned ping app\n3. provide a valid IP to ping app and press its start button\nall done ping will start but you will see the first request gets answered but for any other request after first ping will say \"time out\" since every time the app does use an other port/icmp-id.\nanyway when we rethink this out:\nthe bug/problem in your code was that the port/id of any ICMP respond which we have an active request session for the same IP is hacked to the first port\\id which the session was created with.\nmy mistake was I thought that hack is required for security reasons.\nso to fix this we just need to remove that hack at file \"icmp.c\" in the method \"check_icmp_socket(...)\" which is the single line \"icmp->icmp_id = s->icmp.id;\"\nusing this way Ping/ICMP works and we do not even need you to pull from the repository which we only forked to fix ICMP and make a pull request.\nwe can hold track and remove that single line manually.\nI think the reason you did not understand what my code does is that I have saved memory two time's and made code unreadable by doing so:\nI mean first I have saved one single byte per session by making stop a three-state Boolean which's third state marks that the session did got it's answer an can be reused.\nSecond's I did save memory by the actual reuse of old and answered sessions.. I have started the ping app but the active ICMP session count was mostly 15 or 14 and just few times 16 which makes this same when not less then the reuse or create idea. this means I think there are just 15 file descriptors used by that ping monster. 15 will only be the case if someone does run that ping app else it will be zero I do not think that anyone will run that app and try to use net beside it and leave that in background.\nbut may be they use this or any other ping app to test a web-site IP someday.\nanyway it would be bad when this or any other ping app just prints \"time out\" when the firewall/NetGuard is active, leaving this as is will help no one since no one will run ping in background. I currently do combine NetGuard with a VPN which does use only one L2TP connection to simulate HTTPS sessions.\nand did find out that problem in NetGuard side as we was testing the ICMP of our VPN side anyway will now continue on that VPN side and leave NetGuard side for now. but the ICMP session count by me when not running that app is zero and if there is an app that does use ping it will for sure not try to kill the server with as many Ping requests as it can like this one.\nanyway what we mean is usually there are just few requests (4 by default) made and all to same port which will only use one file descriptor so there seems no change at all or could someone show us any app that does act like this ICMP based app without being meant to test site/net and without having bug then we agree with you. while was reading at SoftEtherVPN #516 thought that may be I should mention that you can use my contribution under any license of your choice. ",
    "DandelionSprout": "Yes, I can confirm that 'nb' is Norwegian Bokmål (which is the most used written version of Norwegian by far), and that the translation shows up in the APK. 👍 . ",
    "XieEDeHeiShou": "\nI see no need to rearrange code.\n\nOk, no rearrange any more.\n\nWhy only a non null attributes for context?\n\nThat was performed by Replace action.. I'd like 'to add NonNull/Nullable annotations manually to each method, then I see some methods only accept one Context parameter, so I replaced them.\n\nAdding documentation is fine, but it needs to be single line comments, not comment blocks. I am aware that the convention is to use comment blocks, but IMHO they take too much space and I like to see as much as possible source code on one screen.\n\nBlock document could shown when use Quick documentation action, while single line/ multiline comments could not. Have a try on collapse document by default ?\n\n. Should I delete unused methods and/or member fileds?. This suppress the IDE (Android studio) from warning WeakerAccess.\nFor example: a method is decleared with public but only used by the class itself. In this situation, that method prefer to be private.\nIn this project, all classes laies under the same package, these methods should be default, package-private or private but public.. ",
    "genodeftest": "Is there any other way to get automated backups of NetGuard? Having to click through the GUI for each and every application to create a backup raises the barrier for automated backups unnecessarily.. > There is an export for this. When needed, please continue this discussion on XDA.\nDone: https://forum.xda-developers.com/android/apps-games/app-netguard-root-firewall-t3233012/post78919463#post78919463. ",
    "smarek": "Lint rules got more strict, with options turned off, you can see those errors, but won't prevent you from building the application. I was able to run the app with previous gradle version (2.9), with 2.10 it failed due to Lint results.\n. No doubts about that, currently there are few errors, specifically NewApi (SinkholeService.java:268) and StrictFormatInvalid (ActivityForward.java:63), others are just warnings\n. "
}