{
    "JohnAlbin": "Good catch, Peter! But doesn't that mean that all IEMobile browsers are matching against their corresponding \"IE\" (desktop) conditions as well? Should we be testing all the deskop conditions against !IEMobile ?\nI've opened another pull request that explores that. https://github.com/malarkey/320andup/pull/4\n. There is a IE Mobile 6. But no IE Mobile 8. http://en.wikipedia.org/wiki/Internet_Explorer_Mobile\n. Which means we want Mobile IE 6 to be caught by the \"if lt IE 7\" rule. And since there is no Mobile IE 8, that rule doesn't need a !IEMobile either.  So… the d465e8c commit isn't needed.\nI just pushed a commit that reverts the unneeded change. (Side note: wish I could rebase, but who knows how github would handle that in this pull request.)\n. Forgot to make the changes in the Multiple linked stylesheets directory, so I just pushed 31b93df.\n. ",
    "peterwilsoncc": "I think you're right, I'll close the other request. \nI'm not sure if IE6 & IE8 need the !IEMobile as IE Mobile doesn't/won't exist for these browsers; the next planned version of IE Mobile will be numbered 9 -- can someone confirm this?\n. ",
    "restless": "This issue is only paritally true. Media-queries work properly, the problem is with css attribute selectors that doesn't. \nThis is caused by respond.js. See: https://github.com/scottjehl/Respond/issues/36 (there is a pull request that solves the issue). Closing.\n. ",
    "glencampbell": "Just for further info on this – i noticed after posting, this issue (or something like it) had been posted before, and respond.js was the culprit...\nI took the new repsond.src.js code and it solves the problem. But it then breaks selectivizr nth-child, etc.\n. ",
    "focustheme": "Actually it resides in js/libs and js/mylibs. I think the duplication is an error, I usually  keep the js/libs one. If you want to use it, link the js file in your html. More info: http://unstoppablerobotninja.com/entry/fluid-images/\n. ",
    "luksurious": "Somehow missed the same problem in the body declaration (~ line 157)\n. ",
    "malarkey": "Thanks. Fixed in the (almost ready) version 3.\n. Thanks. Fixed in the (almost ready) version 3.\n. Thanks. Fixed in the (almost ready) version 3.\n. Thanks. Fixed in the (almost ready) version 3.\n. Thanks. This is fixed in the (almost ready) version 3.\n. Thanks. Yes, this is a LESS issue. Personally, I simply remove the Opera line from my own sites. Not perfect, but hey.\n. Thanks. The X-UA-Compatible meta tag’s been removed in the (almost ready) version 3.\n. Hey Jina,\nIt looks like you’ve canned my LESS directory. Can you make a new pull request that simply adds SASS and SCSS directories and leaves LESS in place?\nLove\nAndy\n. Hey Jina,\nI’m ready to merge in your Sass folders, but it says “This pull request cannot be automatically merged.” \nHmmm…\n. Hey. \nCan you please edit this request, removing the first two and leave:\n.mixin replacements for various rules inside buttons.less\nThanks,\nAndy\n. You and me both Koy. This Github thing is all new to me.\n. Thank-you very much. I spotted this yesterday and fixed it in my local version. Pushing now.\n. I think the best solution is actually to remove [if (gt IEMobile 7)|!(IEMobile)]><!<![endif] and the other Mobile Boilerplate conditionals. They’re an edge case I’m sure we can live without. I’ll remove them from the next iteration. \n. I think I’ll stick with the HTML5 Boilerplate approach of:\nwindow.jQuery || document.write('<script src=\"js/jquery-1.7.2.min.js\"><\\/script>')\n\n. @jina I intend to merge your files, but Github says “This pull request cannot be automatically merged.” I know. I’m a moron. What should I do?\n. I made you admin (I think).\n. Thanks for the kind comment.\n\nIndenting is a personal choice I suppose. I know non-indenting makes it easier for some, it’s just not something I’ve ever done. Maybe I just like that clean left edge. Typical designer!\n. Jina is a Sass indenting kinda girl. I’m a straight down the edge kinda LESS guy.\n. Thanks for pointing that out. I’ve added the fix manually.\n.",
    "iDGS": "Oh, and as a total noob hereabouts, I meant to mention my appreciation for github's 404 page, which is a genuine laugh riot! (But you already knew that.)\n. ",
    "martinbean": "Cool. Look forward to it! The grouping of styles otherwise is logical and helped me immensely organising my own style sheets, even if they don't use 320 and Up.\n. It's preferable to drop the protocol, as in some browsers requesting securing content from a non-secure URL causes, \"This page contains both secure and non-secure items. Do you wish to proceed?\" prompts on page load.\nThe preferable solution would be to either use a localhost (where your web pages would then be accessible via HTTP), or serve a copy of jQuery on your machine when jQuery's not available over HTTP, with something like:\nhtml\n<script>window.jQuery || document.write('<script src=\"js/vendor/jquery-1.7.2.min.js\"><\\/script>')</script>\nWhich is what's used in the HMTL5 Boilerplate.\n. ",
    "matt-bailey": "Hi, I've just noticed this as well. I'm just wondering if the Opera '3/2' pixel ratio in the media query should in fact be '1.5'? I assume it's the '/' that's causing the syntax error anyway...\n. Thanks, I think I spotted that as well although it wasn't throwing up an error. All in all I'm loving 320andup though, fantastic resource!\n. Sorry, spoke too soon - I changed it back to '3/2' and I'm getting the LESS compiler error again.\nAs a test I started with a clean .less file with the following code:\n@media only screen and (-webkit-min-device-pixel-ratio: 1.5),\nonly screen and (-o-min-device-pixel-ratio: 3/2),\nonly screen and (min-device-pixel-ratio: 1.5) {}\nThis code returned the following error:\nParseError: Syntax Error on line 1 in ... style.less:1:0\n1 @media only screen and (-webkit-min-device-pixel-ratio: 1.5),\nonly screen and (-o-min-device-pixel-ratio: 3/2),\nonly screen and (min-device-pixel-ratio: 1.5) {}[0m\nAny ideas?\n. Thanks for pointing that out. Fingers crossed for a fix...\n. ",
    "stareat": "Youre right and there are some errors more e.g. in line 302 (missing a bracket):\nReplace: .font-size(12; with: .font-size(12);\n. You're right, but its an issue with LESS choking on @media only screen and (-o-min-device-pixel-ratio: 3/2) {} and it's mentioned already in an issue: https://github.com/cloudhead/less.js/issues/578\nI'll add a comment also!\n. ",
    "jina": "Eep! Sorry, I had converted everything for myself and forgot to leave it behind since I initially didn't know it was gonna be pulled in. I'll fix it when it get home (in an hour or so). Thanks!\n. Gah my finger slipped (on IPhone). Didn't mean to hit close. Reopening.\n. I went through again to make sure changes you made are reflected here. Let me know if you have any questions.\n. Does this pull request not have all my commits in it or is it just the initial commits? Let me know, so I know if I need to try again on maybe another branch or something.\n. Hrm. Okay, I'll see what I can do. It's probably because it was edited after the pull request was made.\n. I'll try closing the pull request and then opening a new one?\n. Thanks, @kuzeko. @malarkey I noticed this too. Do you have any thoughts on how to resolve this? I was thinking maybe it's as simple as the first one not being a reversed conditional comment, but I wasn't sure if you had a particular reason it was done this way? :)\n. :+1:\n. Hi @JairusKhan — That's awesome that you did this.\nWe actually already had an official Sass version in the works (which is now added to the official repository). Please feel free to check that out (and add contribute any feedback/edits if you have any) to those versions.\nThanks so much!\n. Hey Andy, were there any issues with this?\nAlso I noticed someone else submitted a SCSS + Compass version, but I already have that included here… in case you're confused if what he did is different. :)\n. Hrm. Do you mind giving me temporary access to the repository and then I can try to help you manually merge it in? I won't touch any of your less files or main files; I'll just be adding my new ones in.\n. :+1:\n. Oh, wow, great catch! All fixed now, thanks!\n. No, OCD is good! :)\n. - Agreed on the reordering (makes total sense).\n- As for the shorthand values, that depends. I think the intent of this mixin is created to allow you to pass anything in here (maybe you have something totally different in each corner…), and this way seems to try to have better compatibility. But if we're not caring about certain browser versions (like Firefox 3.6), maybe that doesn't matter. @malarkey — thoughts?\n- Agreed that the commas are a bit weird.\n. I want to see what @malarkey thinks on this before I make any changes, just in case he had a particular reason for doing it this way. :)\n. Hey, I liked indenting even before I used Sass! :-D\nI have to admit, for nested classes, it's trickier in the LESS files to see where the nesting begins and ends due to the lack of indention — but it's nothing a reformat can't fix. :)\n. For LESS, .clearfix { @include clearfix; } is not necessary because the .clearfix mixin already exists, which behaves as a class as well.\nFor the Sass files, I added that line as a convenience in the Compass versions of the files because in Sass, mixins do not equal classes, and I noticed Andy's templates use a clearfix class in the markup. I figured it'd be helpful, but it was not really necessary.\nI can add those in the other Sass files, too, if it helps, but my preference would be to lose the class all together and rely on extended placeholder selectors. :)\n. Makes sense. I'll add them once I get a chance. Thanks! :-)\n. I believe you are looking in the Compass versions, in which +rounded is not necessary because +border-radius already exists in Compass. :)\n. Hrm, okay I will look into that. When I noticed Andy was calling out a particular corner rather than all corners, I opted for Compass'es mixins instead of Andy's so it'd be less repetitive code. Perhaps I accidentally ported some of that over to the non-Compass files. Will fix once I get a chance to look at it. Thanks!\n. Hi @chrisdl — is this change needed? The current ordering matches the ordering below, and the clockwise ordering that is commonly used in CSS, but I'm happy to hear your thoughts on why it should be changed. :)\n. Oh, whoops, I misread this. It's actually in the right order. Guess the ones below should be reordered. :) My bad.\n. ",
    "koycarraway": "Hey Andy, \nSure thing. I am rather new to the ins-and-outs of pull requests so I might need to quick pointer on how/where to edit/update this. Just tried to update the commit range, but dont see that it did anything...\nThanks,\nKoy\n. ",
    "FrancescoRizzi": "Well, guess I was wrong. I did learn about pull requests and sent you one for this small issue. Didn't know that would automatically open a new separate issue, sorry. It did as #34 - gonna close this one down\n. I agree with martinbean's comments, of course. I guess that's what I meant by \"Not sure if these are scenarios you are targeting\". Perhaps index.html could have the protocol prefix, while example.html could be without?\nOR clearly indicate to the user that the pages are setup to be served by a web server (and may require tweaking otherwise).\nOR we could use http instead of https (which should get us around the \"secure/unsecure content\" browser warning - I did a quick check and that seems fine for Chrome, but would be worth checking in other browsers as well, of course.\nThoughts? Thanks\n. ",
    "kuzeko": "Naive option would be the merging the two at the end, like this:\n<!--[if (gt IEMobile 7)|!(IEMobile)&( gt IE 8)]><!--><!--<![endif]-->\n. Lazy solution but effective, :+1:\n. ",
    "mikekelly": "\nwin.\n. ",
    "Sulcalibur": "Sorry to be all OCD on it, but I thought it better to quickly mention it. Thanks for the great work by the way :)\n. ",
    "drublic": "Changing the border-radius-mixin to take the four values according to the specs order makes sense here. +1 on including it.\nThe rest of the commit is discussable to my mind:\nI'd suggest to write the webkit-version of border-radius as shortcut too as suggested with Mozilla's and the spec'd version.\nI am not sure why the values should be separated by a comma. This is not a standard thing. Am I missing something here?\nApart from that I wonder if it's necessary to include the webkit- and moz-prefixed version of this property at all or if it could rater be dropped. border-radius in its unprefixed version is supported in every major browser on desktop and mobile. Only browser to slightly worry about should be Firefox 3.6.\nI guess the support for this is a whole other discussion.\nMy suggestion for this PR is to fix the mixin's output before merging.\n. I guess you're right with \"why not support them\". It's mostly two loc and that's totally acceptable.\nApart from that combining the webkit-prefixed properties feels better for me.\n. Well, this seems to be an issue in Safari 4. I wouldn't care too much about this version. I mean there are not that much users for Safari 4 anymore (4.0: 0.22%, 4.1: 0.16% according to StatsCounter) and border-radius degradates gracefully.\n. Any more thoughts on this? @jina Wanna merge it in somehow?\n. ",
    "chrisdl": "You are correct, the commas are a mistake by me. Glad we got that established ;)\nhttp://caniuse.com/border-radius\n-moz- is good for 3.6 and older but it degrades fairly gracefully (or so I hear from html5please). And webkit it only really needed for about 5% of users (safari 4.0 and below).\nI reckon, why not support it? \n. I would combine for webkit but I got scared by this article on webkit for safari needing it specified in non shorthand: http://csswizardry.com/2010/03/a-quick-note-on-border-radius/\n... thoughts? \n. Thanks for all the input. I've learn't a lot about border-radius throughout this discussion. I think I will let Malarkey decide how he wants the -webkit- prefixing to be done and just leave the pull-request as is (with the split -webkit-), but as drublic states a shorthand implementation of webkit would probably be fine.\n. Makes sense @jina . I ended up removing the -webkit- prefix for border-radius in my development version, but I can't remember why for the life of me.\n. 1. guessing nothing will happen here. off to the graveyard with thee.\n. ",
    "vladdu": "Sure, it's your prerogative :-) The SASS files are indented, so I thought it was just a miss for the LESS ones.\n. ",
    "iNerdier": "It's an iOS thing, rather than a 320 thing. Arguably it's a bug in mobile safari but there are possible reasons for it happening, i.e. keeping the same relative position on screen, regardless of size. There have been bug reports of it I believe but there's not a great deal you can do about it (or there wasn't last time I checked).\nA bit more information here: http://filamentgroup.com/examples/iosScaleBug/\n. ",
    "zakkain": "Apparently its caused by initial-scale=1.0\nhttps://github.com/h5bp/html5-boilerplate/issues/824\n. ",
    "DavidLewendon": "ok so i was being a total donut as win less was trying to compile EACH .less file instead of just doing the 320andup. Sorry for wasting your time peeps. :0(\n. ",
    "deadlyhifi": "I see. I only noticed it because if you swap the stylesheet within 320andup.html to <link rel=\"stylesheet\" href=\"css/320andup-scss.css\"> to use the compiled stylesheet the base colour list doesn't display properly. Adding the clearfix and recompiling fixed it.\nhttps://github.com/malarkey/320andup/blob/master/320andup.html#L30\n. I mean within the actual use of the mixins.\ne.g. https://github.com/malarkey/320andup/blob/master/scss/_buttons.scss#L33 creates a top right 4px rounded corner where it should be on all corners.\nThis occurs on a few buttons, and also on the wells within _texture.scss.\n. Thats alright, thanks for doing all the porting in the first place.\n. ",
    "davidyell": "+1.\nJust fixed this myself.\n. ",
    "stowball": "Microsoft have offered a solution to the viewport bug. I've described it here: http://mattstow.com/responsive-design-in-ie10-on-windows-phone-8.html#update-2013015\nBasically, they want us to continue using \n@-ms-viewport{\n    width: device-width;\n}\nand then using a script immediately after the CSS to modify the viewport for IE 10.0 only\nif (navigator.userAgent.match(/IEMobile\\/10\\.0/)) {\n    var msViewportStyle = document.createElement(\"style\");\n    msViewportStyle.appendChild(\n        document.createTextNode(\"@-ms-viewport{width:auto!important}\")\n    );\n    document.getElementsByTagName(\"head\")[0].appendChild(msViewportStyle);\n}\n. ",
    "frabenanti": "Same problem as here: https://github.com/malarkey/320andup/pull/58\nI'm sorry.\n. ",
    "rowanu": "+1\nI really like the look of this framework, but it's :frowning: that it's had no love since way-back-when.\n. "
}