{
    "meandmax": "Updated readme with the snippet of this commit manuelly in order to be at the right position.\nThx\n. Hey @arcxyz,\nthank you very much for the change request. I think I had a similar issue in the chrome emulator a few days ago. Can you explain me the bug a bit more specific just to understand if it`s the same problem (stuttering slider animation because too few move events ... )?\nAre you sure it works if you put event.preventDefault() in the onTouchmove function? In the discussion above they talking about adding preventDefault in the onTouchstart function and as I remember I had it in the first time also in the onTouchstart function.\nI will check this for HTC Desire and Samsung Galaxy s2. Did you check if the preventDefault solves the issue on a real device? Please tell me with which device you tested the bugfix.\nI'll be in touch again soon\ncheers Max\n. Hey @arcxyz,\nthank you for your engagement! Honestly I didn´t change anything in the touchevent logic, but I`m very happy that it works now for you. As I can see, browser transitions are not supported in Android 2.x ... therefore it works on some devices but I can´t guarantee it for now. I will double check on which devices it works as expected and then I will put them in the documentation.\nThanks again\ncheers Max\n. Hey @barisunver,\nfor now an interval option is not implemented, because I want to keep the slider as lean as possible and I thought something like an interval is not really often needed in this kind of sliders. \nI think mostly interval is used by classic image slideshows, however if there are enough people who really need this feature I would think about implementing it. \nShouldn`t be too much effort anyways. Do you actually have a use case where you need exactly this feature?\ncheers Max\n. Thanks @caiotarifa for the codepen and the instructions how it can be done for now.\nI think I will implementiert this feature when Im back home in 10 days and will let you know.\n@barisunver, for now you have to do it like @caiotarifa did it.\nThanks\nMax\n. Hey @imrefazekas,\nthank you very much for the pull-request. I will merge the corrections into the master.\ncheers Max\n. I have added your changes and released the new version to npm.\nThanks\nMax\n. Hey @OVes,\nI can't check if it works, because I'm not at home for the next 9 days but if there is a problem I will fix it asap.\nIf anybody else can help ... I would appreciate it.\nThanks\nMax\n. Hello @OVes,\nsorry for the delayed feedback ... I was on holidays. So I checked your problem and for me everything is fine ... I just didn`t document it. sorry. Now I updated the documentation and the example in the demo folder.\n``` js\n        'use strict';\n    var $elements = $('.js_simple');\n\n    $(function() {\n        $elements.lory({\n            infinite: 1\n        });\n\n        $elements.data().lory.slideTo(4);\n        // $elements.data().lory.prev();\n        // $elements.data().lory.next();\n    });\n\n```\nIf you have a better idea than adding the function to the jQuery data object, feel free to make a pull request.\nI hope this will help you.\ncheers Max\n. Hey @sleeman,\nyes you can, but not via the options of the slider. \nYou can set the slider width and the witdth of each slide via CSS and adjust them with mediaqueries for your different screen sizes.\nYou can have a look in the app.css of the demo folder, there I think I do exactly want you want to do.\ncheers Max\n. I will look at your issues when Im back home on friday, otherwise you could do a pull request. ;-)\nCheers Max\n. Hey @TrySound,\nI was on holidays and didn`t bring my laptop. Just came home, thanks for the pull request, I double checked your changes and there are looking fine!\nNext time a bit more patience! ;-)\ncheers Max\n. Have you tried this:\nhttps://github.com/karma-runner/karma/issues/993\nor \nhttps://github.com/ramda/ramda/issues/468\ncheers Max\n. Hey @kubosho,\nthought about that feature a couple of times and was just waiting if someone really needs it. So I will implement it, because I think as well that this is a basic option.\ncheers Max\n. Hey @kubosho,\nyeah! I really appreciate that! Just back from Portugal and already lots of work to do! If you need help, just ask, I would implement the feature at the weekend if you have not started yet!\ncheers Max\n. Hey @TrySound,\nWould be interesting if you could implement your on pager module and using the hooks and the public api from lory for the state updates. What do you think about that?\nI think that would be the right way for these kind of features, what do you think about that?\ncheers Max\n. Hey @TrySound,\ncould you explain what you mean? You have some default callback functions (hooks) where you can set what should be executed e.g. before slide -> there you could register a callback of your dotPager that before or after slide the dotPager should be executed. \nLook into the defaultOptions object.\nThen we need to add a function to get the current index and we need a function to actually count how many slides the slider have.\nI think with these additional functions you would be able to build the dotPager, what do you think? What I really try to prevent is to integrate all features into lory! There has to be a way to keep the slider as lean as possible while it is still extendable.\nWhat´s your thoughts about that?\ncheers Max\n. Hey @TrySound,\nI added the function returnIndex to the public api. If I would add the callback \"afterSlide\" to the options would that allow implementing a dotpager independent of lory?\ncheers Max\n. Oh nice! Do you think you could put it on Github that everybody can see how you made it?\nthanks @davidchase \n. Hey @TrySound,\nthanks for the feature request!\nI do not think that this is a good idea. I showed in my examples how to make slides responsive via css mediaqueries, and I really don`t like the approach to do everything in JavaScript just because I can.\nI think this the job can and should be done only in CSS and not in JavaScript.\nThanks, Max!\n. Hey @kubosho,\nIm nearly finished with reviewing your request! Thank you very much for your engagement. I will checkout your pull request in the evening, doing some last tests! Looking forward to merge it!\ncheers and thanks a lot!\nMax\n. Hey @kubosho,\nI merged your pull-request and found afterwards a bug. The center slide isnt centered correctly. It seems to be that I can`t reopen this request, so could you please make a new request.\nThank you\nMax\n. Im not sure why we need to add classes like \"js_current\" or \"js_clone\". Could you explain me for which purpose did you add them and also the function setCurrentSelector.\nIf you make a new pull-request I will look into it.\ncheers Max\n. For positioning maybe something like this:\njs\n(slides[index].offsetLeft - (frameWidth / 2) + (slides[index].clientWidth / 2)) * -1\ninstead of:\njs\nslides[nextIndex].offsetLeft * -1\ncheers Max\n. Thanks a lot @kubosho, it`s getting better! Still the slide is not centered correctly and I was also wondering why it is necessary to use centerMode in combination with infinite.\nI really think I have to rewrite a couple of things to get this feature up and running without infinite while keeping the current size of the slider.\ncheers Max\n. Hey @TrySound,\nthank you very much for the optimisations, looks pretty good!\ncheers Max\n. I don`t have IE9 in the current browser matrix ... does it work? :)\ncheers Max\n. Thanks for reporting it. I added IE9 to supported Browsers.\nHave a nice week\ncheers Max\n. Hey @SiamKreative,\nthis feature is currently not supported, because I didn`t want to handle styling in my JavaScript. \nBut if you want to set a own width of the slides dependent on the browser width you can always listen to the resize event and call lory.reset() afterwards which would re-initialize lory with the current widths of the slide elements.\nMaybe this is a little Add-on. I really try to keep lory as lightweight as possible! The way to go would be  to use the callbacks in the options and the public-api. If you need something that you can actually implement this, just tell me.\ncheers Max\n. Yes I understood you. I didnt add a width to the demo css because its always different. But you are right that I need to mention that you have to specify a width for the \"li\" element.\nThanks for the advice!\ncheers Max\n. Hey @enzy,\nsorry for the late answer! Do you still have a problem with percentage width?\ncheers Max\n. A alright, sorry for the late support! I will try to implement this feature!\ncheers Max\n. Thank you @iandoe for updating the readme! \n. Hey @Cordazar,\nthank you very much for putting a lot of effort into lory to implement this feature. I found a bug and will analyse it in the evening. Rewind and infinite doesn`t work like it should be in the other examples. Now you can click a couple of times on the next arrow element and nothing happens.\nI think this has something to do with the count of the slides. The maxOffset is already reached but the maxIndex not, which results in clicking on the slide as long as the maxIndex is reached until rewind or infinite is triggered.\nI will check this later, maybe you have already an idea how to fix this.\ncheers Max\n. Could you give me some arguments why do you need these dynamic class names?\ncheers Max\n. @davidchase, still an issue after merging this: https://github.com/meandmax/lory/pull/336\nPlease check ... :)\n. done!\n. The only problem that I see with es6, babel and modules is that it gets more than a kb bigger in the minified version. Reason for that is the boilerplate code from babel +  webpack. \n@TrySound: I do like Gulp but with lory I don`t think Gulp makes a heavy difference, so I would rather stay with grunt until all other issues or problems are solved ... :D\nStill thinking about it ...\nHave a good week! Max\n. Any suggestions on my latest changes?\nhttps://github.com/meandmax/lory/tree/feature/es6/\ncheers Max\n. Please try to build this in your integration or as a plugin as said in the pull request comments.\nThank you very much!\ncheers Max\n. Hello @keithws,\nsorry for answering a little bit late on your pull requests. To keep lory as small as possible it is important for me to try building these kind of features around the public api e.g. as a plugin. I will build a pager plugin on my own to show you how I think it should be done. Same for this feature ... I think what you want to do can be achieved with a few lines of code by using the public api.\nThank you very much for contributing, I will write a contribution guide as soon as possible to avoid this for the future.\ncheers Max\n. Hello @keithws,\nsorry for answering a little bit late on your pull requests. To keep lory as small as possible it is important for me to try building these kind of features around the public api e.g. as a plugin. I will build a pager plugin on my own to show you how I think it should be done. I think we will need a public function which gives you the length of the slides. Then by calling .returnIndex you can set the active pager element.\nThank you very much for contributing, I will write a contribution guide as soon as possible to avoid this for the future.\ncheers Max\n. Hello @sabeurthabti,\nin my opinion is this not the purpose of lory and I already thought about this quite a lot. I think to translate lory in react, you actually have to write lory from the scratch new. lory is for the use cases where you not want or you can`t use react.\nIf you need a slider which works actually with react, have a look at this:\nhttps://github.com/akiran/react-slick\nThanks anyways, cheers\nMax\n. Hey @baptooo,\nthank you very much for your pr.\nYou can do this by counting the slides that you have when you initialize lory and compare them via instance.returnIndex always on \"lory.after.slide\" and than set the flag in your integration. There is no need to put this feature in the library.\nThank you\ncheers Max\n. @Dangoo,\nI removed all eventlisteners, and as far as I can see all listeners are gone. Hope this helped.\nthx Max\n. @Dangoo,\nI removed all eventlisteners, and as far as I can see all listeners are gone. Hope this helped.\nthx Max\n. Is the classlist topic fixed?  Than we can close this issue.\ncheers Max\n. @nring,\nI close this issue with the assumption that the classlist shim works fine.\ncheers Max\n. Hey @nring,\nthank you for contributing to lory. This issue is already adressed, so I will close this one for now.\nFor next time please also read what I mentioned to @levito about semantic release and commit messages. This is very important in order that we can merge and actually automatically build new releases.\nhttps://github.com/meandmax/lory/pull/90\nWill be online in the next couple of days :)\ncheers Max\n. Hey @levito,\nthe solution looks good to me, just remove the version because this works in lory over semantic-release which means you have to write proper commit messages as described in the following resources:\nhttps://github.com/semantic-release/semantic-release\nhttps://github.com/angular/angular.js/blob/master/CONTRIBUTING.md\nI also updated to babel 6 ... finally, so would be nice if you rebase your master first before making a pull request or I will rebase it afterwards.\nThanks anyways\nMax\n. Changed your commit-messages in order that semantic-release works as expected. And pushed your changes in a seperate branch.\nhttps://github.com/meandmax/lory/pull/92\ncheers Max\n. ptal @ZauberNerd @TrySound @KingHenne \nhttps://github.com/meandmax/lory/tree/revert-babel6\nI have not thought about that this is actually a breaking change, sorry ;-) ...\nFor the reason that Babel6 is currently a big mess I made a step back to good old Babel5 and also pinned down all other dependencies to their fixed versions.\nHave a nice weekend!\nMax\n. @TrySound I will wait until the Babel6 fixing flood is over. At least I need a solution that will not break the UMD wrapper and will work as a default in all common js environments.\n. As I discussed with @ZauberNerd and a couple of other lory users, we will keep the changes with Babel6 and for the future I will be more careful with breaking changes.\nHave a nice weekend!\nMax\n. As I discussed with @ZauberNerd and a couple of other lory user, we will keep the changes with Babel6 and for the future I will be more careful with breaking changes.\nHave a nice weekend!\nMax\n. Hey ginsterbusch:\nin the optionsobject set the slideSpeed to 0, that should work.\nlory(sliderElement, {slideSpeed: 0});\n. This could be actually a bug caused by the update to babel6 .. Have u tried to import the module like the following: \nimport {lory} from 'lory.js'\nSorry for this breaking change! That was not my intend.\nMax\n. This issue will be fixed by\nhttps://github.com/meandmax/lory/issues/148\n. Hey @GiuTaeKim,\nI really do not give you any specifications on how to structure your css to get it up and running. Yeah I could imagine that lory has more examples with different layout variants, so feel free to either contribute.\nIf u can use other css models that work better for you, just use it. My CSS is actually just for demo purposes.\nIn my daily business I rarely use floats (just for text floating) because I destroy the box model and the content flow if I use float for layout purposes. \nAs far as I know, If I use floats for layout then the element is always repainted when rearranging elements instead of a reflow which is from a browsers perspective way cheaper.\nBut actually feel free to use what ever works best for u.\nThanks for your feedback, I appreciate it a lot.\nMax\n. thanks! +1\n. Hey @hchargois,\nyou could do this by using returnIndex and compare the value with the total length of the slides or zero! And I would do this always on \"after.lory.slide\".\nIf \"infinite\" is false, and the returned index is either 0 or the max length of your slides, then you add/remove a class which shows the active/inactive state.\nDoes this help?\n. Hey @hchargois,\nsorry for the late answer! Yes u are right so since the controls are already integrated in lory I totally understand your point. So if u want and still need this feature, make a pull-request on that.\nThanks for contributing!\nMax\n. closed in favour of #302\n. Hey @lalop \nI will look into this! Thanks for the report!\nMax\n. Babel 6 changes how it exports the default and the reason for this is actually valid es6. Everything before was incorrect behavior. So the solution here is to update the README (which I will do immediatly) and import lory as you already suggested.\nHere the discussion: http://stackoverflow.com/questions/33505992/babel-6-changes-how-it-exports-default\nSo for es5/commonjs it will be: \njs\nvar lory =  require('lory.js').lory\nAnd for es6 it will be:\njs\nimport {lory} from 'lory.js';\nAny suggestions?\nMax\n. Have a look:\nhttps://github.com/meandmax/lory/pull/150\n. Hey @tshedor,\nthanks for the help!\nAs you can see in \"saucelabs.karma.conf.js\" I already integrated this polyfill for the tests, and it worked so before I implemented async tests which actually measure the current offset of the slider or am I doing anything wrong?\n```\n   files: [\n            'dist/lory.js',\n            'test/lory.test.js',\n            'demo/app.css',\n            'http://cdnjs.cloudflare.com/ajax/libs/classlist/2014.01.31/classList.min.js',\n        {\n            pattern: 'test/*.html'\n        }\n    ],\n\n```\nThanks a lot for investing some time!\nMax\n. And actually there are just 7 tests which fail in the IE9, the rest works so far. If there would be a problem with classlist, then all tests in IE9 would fail or what do you think?\nMax\n. I will give it a shot!\n. https://github.com/meandmax/lory/pull/153\ndeactivated the tests in IE9 temp. ... if anybody has an idea, feel free!\nMax\n. didn`t work! ...\n. There is a typo in in the following lines:\n<button type=\"button\" class=\"js-school-tabs-slider-prev js_prev\"><</button>\n <button type=\"button\" class=\"js-school-tabs-slider-next js_next\">></button>\nshould be this:\n<button type=\"button\" class=\"js-school-tabs-slider-prev js_prev\"></button>\n <button type=\"button\" class=\"js-school-tabs-slider-next js_next\"></button>\nI query the buttons based on the outer js_slider so it normally should work.\nhttps://github.com/meandmax/lory/blob/master/src/lory.js#L227-L228\nIf u still have problems, send me your source and I will have a look.\ncheers Max\n. I will look into that asap, sorry for the late answer ... might be a bug.\n. https://github.com/jsdelivr/jsdelivr/pull/10714\n. It`s also in the docs! Thanks for the heads up ;-)\n. because of:\nhttps://github.com/meandmax/lory/blob/master/src/lory.js#L247\n. - the css demo files shouldn't be in lory\n- to navigate to a specific file pleas use slideTo with the index.\ncheers Max\n. Updated all dependencies! Please tell me if everything works fine now!\n. As I said! Of course you can :+1: its open source ;)\n. Hey @jbanety,\nif u set the width of your js_slider class to 100% and remove the overflow: hidden from your js_frame class you should get the same result. Like this:\nBut thanks for contributing!\n\n. initialize lory when the DOM is fully loaded, then this shouldn't be a problem, right?\ncheers Max\n. Its in the readme, I don't know the exact versions which are support but IE10 and with polyfill IE9 is also supported.\nMax\n. Do u still have this problem, seems nobody else had this? If so, please give a bit more description and details/screenshots ..\n. Hey @ght \n👍  Could you just change your commit msg to fix:Destroy cloned slides if infinite is set otherwise semantic-release does not know what to do ...\nThanks for contributing!\nMax\n. thx for contributing!\n. Hey @riotcku,\nThanks for the adjustment, I think I wrote my feedback a little confusing. If we call it rewindOnResize I think the default should be true because this is the current default, it rewinds on resize. And then please remove the ! from here:\nhttps://github.com/meandmax/lory/pull/312/commits/c6afac5cf4c264856cea42afce3b66ee0e716ade#diff-b9ae7b7c349009633969d97d3d11587fR282\nThen the semantic and the syntax is correct, sorry for not communicating this right.\nAnd could you just change your commit msg to something like feat: add option to turn rewindOnResize off otherwise semantic-release does not know what to do + please rebase on the current master.\nsee here:\nhttps://github.com/semantic-release/semantic-release\nand:\nhttps://github.com/angular/angular.js/blob/master/CONTRIBUTING.md#commit\nThanks for contributing!\nMax\n. obsolete by #401\n. Hey @nstanard \nAfter merging this: https://github.com/meandmax/lory/pull/312 + if u set your rewind to false that should not happen anymore, right?\nCheers Max\n. Are u sure that this is an issue? I retested this in the demo and could not find that this is an issue, the index is also if infinite as expected.\nNevertheless, Instead of fixing the output, I think I need to get the indeces straight. What do u think having the index based on 1 instead of 0 in normal mode?\n\n. Is not available for lory, lory is a lot lighter than slick. So if you nedd a lot more configuration, lory is probably not the right slider for this.\ncheers Max\n. Hey @dduskim,\nLGTM, just change the commit msg to something like: fix: PERCENTAGE WIDTH bugfix on iOS safari ... that semantic-release can do the release.\nMax\n. You still need a way to inject jQuery, right?\n. #383\n. Does my recently merged pull-request help?\nCheers Max\n. obsolete by #401\n. I already updated the version of bower to the current one. The current dist files are up to date and with rewindOnResize like here: \nhttps://github.com/meandmax/lory/blob/master/dist/lory.js#L370\nMaybe Bower is doing something strange. As I updated the bower version a couple of days ago could you re-install lory and see if there are still old distribution files?\nThanks Max\n. I think this is fixed now ;)!\n. Thanks for your contribution @i-like-robots, as @Cordazar already mentioned it feels also strange to me to make this change, but if there are enough votes against using spread I would reconsider this.\n. closing because no votes. fixes #323\n. Please rebase with master and remove the last of your commits, since somebody else made the arrow changes which is already merged into master.\nThanks!\n. npm run dev starts the server with nodemon so if u change config files e.g. webpack.config.js the server restarts.\nhttps://github.com/meandmax/lory/blob/master/package.json#L91\nhttps://github.com/meandmax/lory/blob/master/package.json#L96\nThere is also a npm run karma-local which runs the tests with the local browser launchers.\nI think we should make the changes the other way around. The commands in the readme are the newer ones .\nSo I suggest adjusting npm start to npm run dev and npm run karma to npm run karma-local.\nThanks anyways!\n. 👍  Thx\n. Fixes  #448\n. Really good idea! Thank you @nstanard \n. @UTurista Could someone give me an update on this? If this is still an issue please rebase to the current master and make sure it works. Then I will merge this asap! And Im very sorry for the late response, time to do some housework here. :)\nIf this is not an issue anymore please close this.\n@andrejpavlovic we need the dist files in the npm package.. @jordic Thank you for contributing! Could you give me an update on this? Could you fix the tests if you are sure that they are wrong? Also we need to build the files in every PR (yarn run build). And Im very sorry for the late response, time to do some housework here.\nIf this is not an issue anymore please close this.. Thank you for contributing! \n@drewfranklin If this is not an anymore an issue for you please close. If it is so please rebase to master and also build dist files (yarn run build). With yarn run demo you can check if the slider still works as expected in all other scenarios.\nAnd Im very sorry for the late response, time to do some housework here.. @ibrokemycomputer I would really appreciate it if you want to help/contribute. The reason I did not fix this issue yet is, that for now I do not have a way to make this work for all cases. \nAlso to me it is not even clear what should lory return in the case mentioned above (12 or 14)? When you have 4 slides visible which index is the currentIndex?\nCheers,\nMax. @RSeidelsohn As you modified your fork with changes specifically for your need ... this should not be merged anyways, correct?. @danielj41 I will checkout this branch, build dist files and then merge it.\nPlease keep http://commitizen.github.io/cz-cli/ in mind, otherwise the auto build/deployment with semantic-release wont work.\nThanks for contributing and sorry for the late answer!\n. in favor of https://github.com/meandmax/lory/pull/717\n@danielj41 thanks for contributing!. Thank you for taking care @Benjamin-Dobell, this is overdue for a while. @sansey Thank you for contributing!\n\n[ ] Please rebase to master \n[ ] Please to yarn run build to build dist files before commiting and yarn run demo to double check\n[ ] Also please consider our commit convention that the deployment works correctly!\nhttps://github.com/semantic-release/semantic-release\n\nCheers Max. I think this is fixed by https://github.com/meandmax/lory/pull/733\nThank you for contributing :). Thank you very much vor contributing! Please align your commits to https://github.com/angular/angular.js/blob/master/CONTRIBUTING.md#commit, otherwise semantic release doesnt know what to do.. Nice work! I will check it out and test if everything works as expected. Please align your commits to https://github.com/angular/angular.js/blob/master/CONTRIBUTING.md#commit, otherwise semantic release doesnt know what to do.. \n@lacedon Did you try this out with the examples in the index file because it seems to me that this does not work at all?. @kaylabranch thanks for contributing, I adjusted the commit message and merged your PR after testing. cheers!. @tylik1 most of them are from greenkeeper, I will take a look at the other PRs in the next couple of days! Thanks for heads up. @tylik1 should work now as I gave it a version in package.json. I don`t see this going into the core of lory.js Any other opinions?\n\n[ ] Please rebase to master\n[ ] Please build dist files with yarn run build\n[ ] Please double check if everything works with yarn run demo\n[ ] Please add example to show on website.\n\nThanks Max. @nkudr Thank you for contributing!\nI think we agree that this is special need that should not be implemented in the core of lory.js, therefore I will close this one.\nCheers Max. @dada95 Still an issue? Tried it with your provided options and works fine for me.\nOtherwise please close :). I do not think that this is a suitable library for angular, react or similiar frameworks .... Hey @kenmaclord,\nI do not see this happen in the lory core because it makes the slider more complex. Simplicity is one of the main reasons for lory and if you need something more sophisticated, there are a ton of other solutions out there offering lazy loading.\nCheers,\nMax. @tylik1 that would be the way to go. There are not plans to implement a more easy way of addling slides dynamically for now.. @Saturate added you to contributors, thanks for offering help!\n. For future pull-requests please keep in mind that the deployment won`t work if the commit messages are not in the right format.\nCheck this out: http://commitizen.github.io/cz-cli/. I merge this now, but again need to add an empty trigger commit to the master to trigger a build. Please keep in mind that if you do your commits use either https://github.com/commitizen/cz-cli or just do it manually. Check out this: https://github.com/angular/angular.js/blob/master/DEVELOPERS.md#commits\ncheers. @thomasboulongne Thank you for contributing!\n\n[ ] Please rebase to master\n[ ] Please follow the commit convention for semantic release (https://github.com/semantic-release/semantic-release)\n\nCheers Max\n. Could you please give more context, or is this not an issue anymore? Because if I take your options and paste them into one of the sliders in index.html it works just fine.\nThanks!\nCheers, Max. https://github.com/meandmax/lory/blob/master/src/lory.js#L466\nI think that is already done, anyways thank you for contributing.. Can be closed because prevent default was removed because of other issues and because it is not needed.\nThanks for the issue.. @Mahdimeraji07 Thank you for contributing!\n\n[ ] Please rebase to master\n[ ] Please follow the commit convention\n[ ] Please check if tests are really wrong, your change should have done nothing to the tests because you introduced basically a new feature.\n\nOtherwise, please close this PR.. -> https://github.com/semantic-release/semantic-release\ncheckout commit message format.. Hey @Zeladin,\nseems that nobody else had an issue like this. I will close this issue for now, but feel free to provide a generic example with your problem and we will have a look.\nThank you\nCheers Max. Tried it out and its not needed as far as I can see. https://github.com/meandmax/lory/pull/731. Thank you for contributing!\nI think for usecases like this you should use the API instead, keeps the core functionality lean and I see no problem doing this with the exposed api.\nCheers Max. check this out: https://codepen.io/anon/pen/wXRJre?editors=0010\nseems to work for me, please close if it works for you now as well.\ncheers Max. Same here, could you rebase and build files, than I would rebase this.. @gglnx Could you also make a build with current master? Then I would merge this.. Sorry for the late answer: I would say to not have breaking changes, default should be false. And I would name this rewindOnResize to be consistent\n. This line is not needed in my opinion. \n. Or keep it and change SO voting system assures that the best answers are prominently visible. to The Stack Overflow voting system assures that the best answers are prominently visible.\nI needed a minute to understand what you meant with SO thats the reason for the change.\n. Breaks sliders with multiple slides to scroll because you translate to the wrong slide if you hardly set this to 1. ",
    "arcxyz": "Finally, I was able to reproduce on the android emulator the same behaviour that I get with a Nexus S, changing the translate3d with a translateX \n\n(you cannot complete the scroll)\nIf you put the preventDefault in the onTouchstart function it will affect to click events. Check this link:\nhttps://developer.mozilla.org/en-US/docs/Web/Guide/Events/Touch_events#Handling_clicks\nWith this bugfix I get it working for Nexus S. But I've also tested with a Galaxy S, Galaxy Mini and HTC Wildfire and does not work at all, but this is probably related by the lack of support of 3d transforms on android 2.2 and 2.3.\nDo not merge, tomorrow I will try to get it working on these other devices.\n. It is working great now for Galaxy Mini, Galaxy S and HTC Wildfire. Could you check it with your HTC Desire or Galaxy S2?\nhttp://arcxyz.github.io/fix-android-touchmove/\n. ",
    "caiotarifa": "I'd appreciate this feature. :+1: \nFor now, it can be done with a setInterval, no? Like this:\n``` javascript\nvar slider, sliderElement;\nsliderElement = document.querySelector('.js_simple');\nslider = lory(sliderElement, {\n  infinite: 1\n});\nsetInterval(function () {\n  slider.next();\n}, 3000 + 300); // Interval + Transition\n```\nDemo: http://codepen.io/caio/pen/mygGRa\n. Is there any resolution about his?\n. As the @Cordazar said, I wouldn't want follow the pattern that the plugin requires me.\nI believe this is an easy feature to implement and don't encumber in loss performance or increased file size.\nSo, what about? :)\n. ",
    "JacobDB": "Did you end up baking this in to the core, or no?\n. ",
    "andreasvirkus": "Is it in the plans still?. @nstanard I'd like this issue to be reopened. Using Lory with Webpack and vue-ssr-webpack-plugin.\nAs you can see, the error occurs in the distribution file (lory.js/dist/lory.js):\n```\nevents.js:182\n      throw er; // Unhandled 'error' event\n      ^\nTypeError: Cannot read property 'CustomEvent' of undefined\n    at Object. (/project/node_modules/lory.js/dist/lory.js:724:32)\n    at Object.defineProperty.value (/project/node_modules/lory.js/dist/lory.js:772:31)\n    at webpack_require (/project/node_modules/lory.js/dist/lory.js:30:30)\n    at Object.NativeCustomEvent (/project/node_modules/lory.js/dist/lory.js:696:21)\n    at webpack_require (/project/node_modules/lory.js/dist/lory.js:30:30)\n    at Object.defineProperty.value (/project/node_modules/lory.js/dist/lory.js:78:23)\n    at webpack_require (/project/node_modules/lory.js/dist/lory.js:30:30)\n    at Object.defineProperty.value (/project/node_modules/lory.js/dist/lory.js:57:19)\n    at webpack_require (/project/node_modules/lory.js/dist/lory.js:30:30)\n    at /project/node_modules/lory.js/dist/lory.js:50:18\nnpm ERR! code ELIFECYCLE\nnpm ERR! errno 1\nnpm ERR! @ start: babel-node --presets es2015,stage-0 --use_strict server.js\nnpm ERR! Exit status 1\nnpm ERR! \nnpm ERR! Failed at the @ start script.\nnpm ERR! This is probably not a problem with npm. There is likely additional logging output above.\n```\nEdit: Also tried setting modules: false in my .babelrc, but that didn't help either (as suggested by @chaucerbao).. ",
    "erperejildo": "+1 for this feature. ",
    "TrySound": "And you can remove version field, bower use git tags.\n. ASAP!\n. @meandmax  Up!\n. @meandmax Sorry :) I thought you use mobile.\n. Thanks, will try.\n. @meandmax  What is hooks?\n. @meandmax  I think you need to move functions outside of lory constructor for optimization.\n. @meandmax How to init pager for every instance calling just API?\nIn martin I realized hooks as a function calling before init callback.\n. @meandmax I need fluid slider, but not fixed. Do you have idea how to make it?\n. Thanks, @Cordazar!\n. @meandmax Yes, I tried it on my virtual machine. It works fine without transitions.\n. @meandmax es6 looks good. I don't use webpack.\n. Gulp forever :)))\n. :+1: \n. @meandmax What's wrong with babel6?\n. @meandmax Try rollup. Much smaller then webpack loader. Supports any output format\n. ",
    "kubosho": "Thanks to reply @meandmax. I looking forward to implementing centerMode option.\n. Hi, @meandmax.\nI trying to implement centerMode now, because my current work needed immediately centerMode option.\nIf implement centerMode completed, I will sent Pull Request.\nThanks.\n. @meandmax \nI implement centerMode completed. I'm going to send Pull Request tomorrow (JST).\n. Hi, @meandmax.\nThanks a lot for your code review, and I resolved code.\nThanks.\n. @meandmax \nDidn't fix following bugs, sorry. I fix bug \"center slide isn't centered correctly\" as soon.\nhttps://github.com/meandmax/lory/pull/16#issuecomment-94311486\n. @meandmax \nThanks for advice, and change code at https://github.com/meandmax/lory/blob/master/src/lory.js#L315.\nbefore:\njs\nvar nextOffset = limitOffset(slides[nextIndex].offsetLeft * -1);\nafter:\n``` js\nvar nextOffset = limitOffset(slides[nextIndex].offsetLeft * -1);\nif (options.centerMode) {\n    nextOffset = limitOffset((slides[index].offsetLeft - (frameWidth / 2) + (slides[index].clientWidth / 2)) * -1);\n}\n```\nresult:\n\nIt looks buggy. I continue to fix bug.\n. @meandmax \nI fixed \"center slide isn't centered correctly\" bug to c9b9f4dc. I guess it worked.\n\n. @meandmax \nI removed current function to c631d4b9 because I felt it unnecessary, and should not casually add function to public API.\n. @meandmax \nI fixed \"slide is not centered correctly\" to 2e64c964b17a:\n\njsfiddle: https://jsfiddle.net/Lm8L8r51/11/embedded/result/\n\nI really think I have to rewrite a couple of things to get this feature up and running without infinite while keeping the current size of the slider.\n\nWhich of the following is closest in meaning?\n1. delete code to https://github.com/kubosho/lory/blob/feat/center-mode/src/lory.js#L198-L200\n2.  http://codepen.io/kubosho_/pen/yNLNEe the look like be rewritten\n. ",
    "shshaw": "Would also need to consider how the paging would function with the slidesToScroll option. Should the number of dots correspond to the total number of slides, or to the number of 'pages' (total / slidesToScroll)? I'd expect the latter. \n. I just tested it on IE9 as well and the demos seem to be working as expected, minus transitions. :+1: \n. ",
    "davidchase": "I was able to create a pager, that works with multiple instances of lory on a page..\n+1 for keeping the slider simple and providing hooks and returnIndex @meandmax \n. @Cordazar i loaded it up in my chrome browser on my iphone in incognito tab and same as before.. the swipe behavior isn't on par with the arrow keys on either side of the slider..\nSo when you swipe the demo slides they jump/snap to the next or previous, however if you use the arrows the transitions are smooth like expected\n. @meandmax checked it out on google chrome and safari looks great 👍 \n. ",
    "nstanard": "How to make a dot pager with Lory.js\nhttp://codepen.io/nstanard/pen/jrwymd\nhttp://codepen.io/nstanard/pen/EgvVpV\n. I'll work on this if it's alright!\n. Please isolate the issue. ^^\ncodepen.io\n. @DCKT Please provide a link to a demo on codepen.io so we can take a look at what issue you are having.\n. I'm a little confused why a hack is needed to make the carousel full width @acenkus. \nhttp://www.lovelyskin.com/skin-specialists-omaha \nThe site above has lory setup although there is only a single slide so it doesn't actually function at the moment. But it is full width and I promise it's lory.js expanding the full client width.\n. Please re-open with an example if you are having issues with this still.. Hey @slavikse,\nAre you able to provide a link to that example?. @slavikse If you can provide a link to a demo with a reproducible issue please open a new issue. I do believe font size 0 missing is what would cause this.. Hey @andersonfelix,\nThis is possible but please direct your question to stack overflow for the time being. Please post the SO link in the gitter channel as well.. Yea I have multiple iOS devices but have not seen this issue. I have noticed a rewind issue as I mentioned in #318. What device are you using specifically @jtree5757? Also, can you screen record the issue?\n. Please open another issue with a demo and more information on your device if you find this is still an issue. . Note: the rewind option causes the jump to the first slide to actually animate.\n. @meandmax What events should cause the slider to rewind? I know resize causes it to rewind if that option is not set to false. However, on my iPhone 5 simply scrolling down the page causes the rewind to happen. \n. @meandmax Okay I understand why this is happening now. My iPhone 5 is firing a resize event because of the URL bar that hides and shows on scroll up and down. I guess I'll just have to set all my sliders to rewind false. Close this issue whenever you get a chance. 👍\n. I agree I feel the index values should be the same. I'm rather busy at the moment but if nobody else gets to it I am planning to open multiple pull requests with updates I would like to see.\n. Infinite and non-infinite sliders report a different index. Since this isn't a breaking issue and a developer can offset as they need I'm going to close this for now. I do want to make the index returned from the API the same for both. I'd probably propose starting at the 0 index for both.\nAs @Dangoo mentioned though I think that the slideTo also needs to be more consistent for passing 0 or 1 index counting. I know I was putting together a demo with slideTo and was surprised I was passing the +1 pattern into the input.. You can create your own dot pager with the provided events people.... No need to bloat the project with stuff you can add on your own.\n. \"have quite a few standardized options to pass through\" \nWhere does it end? Honestly... the thing I love about this slider is how minimal it is. I'm not a main contributor to this project so I don't have much weight to throw around but still.... programming isn't about having standardized options provided all the time. It's about understanding how things work and being able to adjust them the way you want. I think there is a gitter chat for this project and if anybody has any questions they can refer to that.\nThe story of every slider I've ever seen started with... \"well what about this feature...?\" and it just keeps going. I've gone through so many in my few years as a developer and this is my favorite by far. The documentation is rather clear and although I would change a few small things if I wanted to be super nitpicky it's not worth it. I have been able to program most anything I need or want with this. \nThe more features you add the more problems you get.\n. If you open a PR and they accept it I cannot stand in the way. However, I think lory.js is fine without it and adding it simply because designers don't want to take the time to learn how to code is not a good reason.\n. @yoanmalie, @jeebseven: http://kenwheeler.github.io/slick/\nHave fun.\n. http://codepen.io/nstanard/pen/jrwymd\nHave fun\n. @yoanmalie Why are you charged with maintaining sites if you don't use JS? You should have enough knowledge to setup API/Event calls to add and remove a class.\n. What bugs? Please be specific.\nThe example I provided didn't have click events on the list items and so clicking them didn't do anything. If you want that too then it's a few lines of code more.\nFirst example with only visual feedback: http://codepen.io/nstanard/pen/jrwymd\nSecond example with click events on the list items using the public API method to slide to the index: http://codepen.io/nstanard/pen/EgvVpV\nAny issues you see you can mention and I'll be glad to fix but that's a working example in about 38 lines of code. I'm not arguing about anything @yoanmalie. This project is fantastic and doesn't need this feature. I have provided two examples now on how to add this functionality yourself using the provided public API and custom events.\n. http://codepen.io/nstanard/pen/kkvXao?editors=1010\nhttp://codepen.io/nstanard/pen/yaKxzK?editors=0010\nYou have slides to scroll set to 4 with 9 slides... I don't believe the example you provide is an issue. \nIt slides four at a time as it should. Perhaps I'm not understanding what you are trying to point out?\n. @haggen Thoughts?\n. @liam-potter Can you put together an example on codepen? I'm totally willing to help but I'm not following the description provided.\n. Thank you for providing an example. I will take a closer look tomorrow.\n. I fell off the face of the earth for a while. But I'm back now. I apologize for the lack of activity. I'll have to start slotting out time to work through issues on this project. However, I'm of the mindset right now that I'd rather start on Lory 2.0. We'll see how this plays out over the next few months.. @haggen Hey that looks great! It's always nice to be able to use a smaller sized piece of JS to get what you need. ;). @rtyshyk \nhttps://codepen.io/anon/pen/WOddPy\nI do not see any issues with the slider in the link above. In the link you provided (currently) you're using slidesToScroll: 1 with 4 visible slides. That is not the intended use of the slider features.. @i-like-robots I'm tempted to close this but would like to know more about conservative Babel setups that you mention. I know that I'm always using build tools with Babel and never really had any issues importing Lory. Can you walk me through an example of an environment with Babel where object spread would break and not transpile?. I would be happy to add that as well.\nI wanted to talk to you about something too though. Would you have some time to chat on gitter?\ntopic: I propose the resize/rewind event sends out a before and after custom event. Right now that \"breaks\" the custom dots I have added to the example.\n. #323 Fixed with an example to the demo site. \nThe requested changes were made. @meandmax\n. Added a resize event as well to reset the dots instead of the proposal I made. @meandmax \n. Here is a working example with rewindOnResize set to false.\nhttp://codepen.io/nstanard/pen/amVwvR?editors=1010\nI think it's mentioned in the docs somewhere that infinite doesn't work with some other options.\n. Yea that's true, it only calls out rewind. I have a couple other changes I want to make myself to the rewind functionality so I'll try to take a look at that too.\n. Lol - I wasn't looking at the README at first. I had the demo index.html file open and wasn't paying close attention to what file I was reading. Opening up a PR now with a README update.\n. I don't have time right now to finish this example and give you all the details. But first thing I would mention is to avoid setTimeout and setInterval and instead use RAF.\nhttp://codepen.io/nstanard/pen/kkvXao?editors=1010\nI have provided a link to a stack overflow post explaining RAF and how to throttle it to get what you want. I then called the lory JS API method next() to have it go to the next one. This will only work well for when infinite is set to true. \nAlso note - the slider will reset to the first slide on window resize and the dot index will be incorrect because there is no resize event setup right now to reset the dots as well. This should get you started though.\n. I am working right now and don't have much time to finish the example with pause functionality. However, I suggest you fork the example and try to solve that part yourself!\nThe issues you mentioned can be solved with some simple math.\nhttp://codepen.io/nstanard/pen/yaKxzK?editors=0010\n. @jackbarham I've provided an example with autoplay. What are you having trouble with? Do you have a link?\n. There are a lot of examples on the demo site currently and I will probably be adding more in the future. I'm closing this for now but an autoplay example will find it's way to the demo page eventually.. @ericorruption Closing because no reply.. Not currently. I'd argue that from a user-experience  perspective fading isn't as good also. Thoughts? Why are you looking for a fade over a slide?\n. Well, responsive sliders (IMO) should have touch (tablet) interaction. When a user uses their finger to slide to previous or next slides and the slider doesn't move left or right - that's very odd to me. I understand that touch interaction can be turned off and not every site wants it. I also understand it's a common feature among other sliders. However, even the term 'slider' implies movement. \nThe basic reason though for why I feel fade is bad UX comes down to the touch interaction. If I use my finger to try to navigate a slider I expect it to move left or right and not fade. \n. Also... You don't need very much code to create your own pure JavaScript fadein/fadeout carousel.\nHere are multiple examples that you can take a look at to get the functionality you want.\nSimple fadein/fadeout carousel:\n- https://www.christianheilmann.com/2015/04/08/keeping-it-simple-coding-a-carousel/\nMake it have images that are responsive:\n- http://www.fredparke.com/blog/css-padding-trick-responsive-intrinsic-ratios\nThere ya go. This issue can be closed because this slider doesn't need this feature. What you want is a simple carousel.\n@meandmax Close whenever you get a chance. ;)\n. I define a slider differently in my head than a carousel/image gallery. I feel it's better to differentiate between those things rather than trying to create one project that fits all needs. @linnett \n. Also, if you are using WebPack and ES2015 ( you should be 😄 ) then it's super easy to create your own extensible classes and differentiate between these types of features. \n. I don't feel this is really needed but... Next time you want something like that you can pull the project down and add it, then open a PR. ;)\nhttps://github.com/meandmax/lory/pull/447\n. Ah I see. I'll switch that around.\n. Alright I took a minute and switched that around. @meandmax \n. I could be wrong but I think it's using a numeric value because you can have multiple slides to show. I believe you would use the same value for infinite and multiple slides to show in that case. Like in this example:\nhttp://codepen.io/nstanard/pen/yaKxzK\n. You would probably want to use variable width mode.\n. Seems like you realize that this isn't an option currently ;)\n. Oops sorry. I removed it all 😬 \n. How's that @meandmax ?\n. Can you turn that into a working demo using codepen.io?\n. Yea.... as far as I can tell that's an issue. I changed your example a little. Button instead of timer. But I don't have time to dig in deeper.\nhttp://codepen.io/nstanard/pen/wzOyNN?editors=1010\n. PR #507 will clear that up in the docs.. Will be taking a closer look at using lory with rollup as soon as I am able.. @mahish I am not the owner of this resource and I would not feel comfortable merging in anything without first talking to Max. I am simply a humble servant ;)\nThat being said.... I will take a look at the work you've done and see if it's worth incorporating into the project. . Hey @SukhKalsi,\nAre you able to pass in rewindOnResize as false through the options? I know some devices change the view size on scroll and if a resize event fires on the page the sliders will go back to the first slide by default.. @motoringcouk Please open your own issue ticket with a demo link highlighting the issue you are wanting to present.. The original description is a feature, not a bug. Closing this..  The use of the keyword default should be appropriate in this case but I appreciate you taking the time to contribute and open a PR @kimarre!\nhttp://kangax.github.io/compat-table/es5/#test-Object/array_literal_extensions_Reserved_words_as_property_names. If this is a priority for you I would suggest opening a PR with your proposed changes. I'd be happy to take a look and assist getting it merged and approved. I don't imagine it's a big priority though on the list of thing s to do.. Closing for now. Again, you are welcome to open a PR for this.. http://codepen.io/nstanard/pen/eBLXJJ\nIf you've got time go ahead and open a PR with the fix. ;]. When you reach out and open an issue please provide an isolated example and a link.. This is almost for sure a setup issue. Please ping me via Gitter chat and I'll be happy to take a look.. @jordic Can you provide an example of when the DOM is not ready for init? I would imagine you are doing any needed dynamic DOM manipulation first, then calling to initialize the slider.. @curtisblackwell If you provide an isolated example I will re-open this. . Although the sliders are not functional due to only having one slide. I built this skin specialists website using Lory and that text is part of the slide.\nhttp://www.lovelyskin.com/skin-specialists-omaha. \n. Closing this issue. If you need 1:1 help I'd be happy to assist.. @andosteinmetz This slider has a few different features and in an attempt to make them work together the code needs to know how many slides are visible for the infinite feature.. @drewfranklin Can you provide an example of how you are using infinite alongside slidesToScroll?. @drewfranklin \nI guess I imagine this could behave in two different ways. Using your example:\nOption 1\nThe user clicks the next arrow once, showing them images 5-8, then clicks again causing the slider to only navigate the remaining slides and results in the display of images 7-10. \nOption 2\nThe user clicks the next arrow once, showing them images 5-8, then clicks again causing the slider to \"wrap around\" and display images 9, 10, 1, and 2. \nWhich option are you imagining would be the correct behavior? If I were to implement this feature I would go with option 1 (If I'm understanding your comments I think that's how you feel too). But I would love to hear your thoughts on the subject.. Webpack syntax issue, closing this.. @lukearmstrong \n\ndoesn't move to the correct position.\n\nThat's the reason the frame has white-space nowrap. If you would like text to wrap you need to create your own containers inside the slide and define widths and such.\nhttp://www.lovelyskin.com/skin-specialists-omaha\nCheck out the banner on the top of the page under the header. It's actually a lory slider with only one slide. It's completely responsive and has text wrapping.. Yea if you can show me a link I'm feeling confident I can get you what you want with the text wrapping and correct positioning.. It does come without, I suggest taking the file and including it directly into your project. Then you can import it without concern. But I will try to recreate this scenario soon.. @RSeidelsohn First, thank you for providing so much detail, a link, and opening a PR. I'll take a look at this tonight.. @RSeidelsohn Again, thank you for opening this. Will take a look soon.. @tkjaergaard I'll need to pull this down and see what you got goin on. It may get closed as I am starting the planning phase for Lory.js 2.0.. @benmerckx Thank you for opening a PR. I like this idea! I will need to pull it down and test it though. ;). @tvler I'm a little unsure about this. Would you not simply order the slides in the order you want them to display?\nThoughts?. @danielj41 I'll have to go through and test this. I was hoping to talk to you about why you need/want this feature though. Seems to me ordering the slides in the order you want them to display is pretty standard. Is there a scenario you are having to program for that is causing you to want this feature?\nI am also thinking you could turn off the rewind option when you init the slider and add your own resize event that calls slideTo for the index you want to be the first to display. I don't want to block such a simple addition to the project, however, I will first want to talk to you about your use case that requires this.. That makes a lot of sense! I'll try to look closer at this sometime this week. Again, thank you for opening a PR and contributing. . Oops, yea you can open a PR for that. ;). @Ficik You're importing the source file... not the distribution file... So basically you're importing the file intended for local environment development. . @SteveQ88 I'm closing this for now. But I will be testing out lory with Rollup an other build tools in the near future. If I find that this is really an issue I will re-open it.. @mciastek \n\non mobile devices, because normal scrolling (and hiding browser's top bar) triggers resize event\n\nThe reason some mobile devices fire a resize event is because of the URL bar that animates into view. This does not mean that all mobile devices behave this way.. \nThe last feature Max has added is an option to turn rewind on resize off. You can use that and add your own rewind behavior on top of the slider.. @rougiain \nWill have to look into this. In the next few months I will be working on Lory 2.0. My plan is to go through all existing features and options and smooth them all out. I will see about adding this to the feature planning I put together but in the end will side with whatever decision Max makes on this requested feature.. @Benjamin-Dobell Thank you for opening a PR. I will pull this down and take a look tonight.. @jackbrewer Thank you for providing a link to a reduced test case. I greatly appreciate that and I will take a look at this in the evening today. I will get back to you with what I find.. Please provide more detail and a working example of what you are trying to accomplish. (A plunkr or a jsfiddle). @Madeck You can do anything you want with this slider. You just have to style things yourself and assign CSS properties to make it happen.. Closing this because an isolated example was not provided.. Max is a busy guy. If you'd like to help, I would be happy to help you pick a topic to work on. Keep in mind that the intention of this project is NOT to be an \"everything out of the box\" slider. This is a minimalist slider. . Also, i'm closing this. :P. #621. There are resize events firing when you scroll the page and the browser hides and shows the url bar. This is a known issue. . #621, already looking into merging that one. Closing this one.. I can assist you in forking the project and making this change if you would like but I personally want to focus on other issues in the near future. . You can provide an example in the Gitter channel and I'd be happy to help you with this. . @jacobjuul \n\nThat's actually a carousel with only one slide. I can help you with building out slides with text if you need.\n. Did you want the jquery version of lory? . I'll be honest...... I'm not a huge fan of the vertical slide option. At least.... right now. I would need to pull this down and really play with it to +1 it. You might be able to twist my arm with some direct messaging though. ;). @nkudr Hey, first.... Thanks for contributing. \nI'm just wondering how you feel about the slideSpeed option that already exists? Would it not be better to have an option for slide speed and an option for swipe speed? (If you really want to differentiate between the two speeds.) Thoughts?. My goal as a contributor of this project has always been to keep it simple. There are a lot of features slick offers that add to the size of the resource when you use it in a project. If you take a stab at forking this project and making this enhancement I will assist you as best I can. Vertical sliding and adaptive heights seem to be more than minimal features IMO. But again, i'm happy to help you fork it and make changes.. @christoph-bessei thank you for your contribution to this issue - closing it. @sumitmann If you can provide an example/demo of what you are having trouble with people can better assist you in helping with the solution.. Thank you for providing an example! I will take a look at this and see if I can assist in your goals.. Here is a working example: https://codepen.io/nstanard/pen/jrwymd - If you have any more questions please feel free to ask on Stack Overflow or Gitter chat. . @LukasDrgon ooooo interesting. @guilhermepedroso The \"js_simple\" class is not added to the prereq HTML on purpose. That's because custom classes can be added manually or through the options: https://github.com/meandmax/lory/pull/708/files#diff-eacf331f0ffc35d4b482f1d15a887d3bR37\n. @sebbdk 😍 Thank you for your contributions. I always love when we can prevent the size of the project from growing.. I haven't tried to do this so I don't currently have an answer for you. Most likely doing this without changing the Lory code would require preventing the sliding events if on the first or last slide. I imagine this would only be desired if the slider is NOT infinite. If you want to try to accomplish this and link to an example/demo I can assist you in trying to accomplish this without a Lory code change. I imagine this could be added to the core functionality though. Might even be a good reason for you to open a PR with the change. ;) ;) ;). @soluml Providing a link to an example of what you are trying to do allows us to help you faster with better feedback. Please provide a demo of what you are having trouble with and we can assist you. Also - Stack Overflow and Gitter are great places to ask questions about general use.. The examples are simply a starting point. I dont think anything is preventing the use of buttons in the implementation of the sliders. Keyboard control can also be added in combination with the api methods available. If you take a stab at providing an example I can assist in helping. . Closing this and will test #480 as well. However, @mahish I am not the owner of this resource and I would not feel comfortable merging in anything without first talking to Max. I am simply a humble servant ;). You get to decide what class names you use for your sliders. The options allow you to override the defaults. Please use Stack Overflow or Gitter to request general assistance with the slider. . @rustam87 Can you please create a demo/example of what you are trying to accomplish that shows the issue you are facing. I will take a look at it and provide feedback. I have not run into this issue before. . Please link a demo/example and I can take a look. . Closing issues that are general help requests + have solutions provided. Thank you for your contributions. . Please create a demo/example and link to it in your comment. (or ask on Stack Overflow). Please put together a demo/example and put a link in the comment. (perhaps a github repo that I can download and test - or simply a codepen link) \nedit: I'll be closing issues like these over the next few days if there is no response.. I'm not sure that is the expected behavior. slidesToScroll is an option available and it's default value is 1. That example is going to snap to 1 slide at a time. That's actually not a bug.. Can you please put together an example/demo and link it. (maybe make a github repo that I can download and test.)\nedit: I'll be closing issues like these over the next few days if there is no response.. I'm emulating a windows device using chrome responsive mode. I'm not able to reproduce this issue. Are you able to create a gif/video like you did with the other issue? (#751). I'm unable to reproduce this - I do not have a windows 10 touch device available to me. If somebody can provide more information or if I can get my hands on a windows tablet I will look into this. . Please ask questions like these in Gitter or on Stack Overflow. . Thank you for your input. I would like to get back to work on this project and really appreciate the feedback. . 354 -> 357? I'll remove just want to make sure\n. ",
    "Cordazar": "@TrySound Lory has since been updated to work with responsive slides.\n. @SiamKreative Here it is used on a live-site http://www.expressen.se/geo/mats-larsson/tjejerna-som-surfar-mot-normerna--hittar-gladjen-pa-vagorna/\n. @SiamKreative \nYou can also check the official page, http://meandmax.github.io/lory, and the examples for fluid sliders: \n- Single element - Percentage width [infinite]\n- Single element - Percentage width [rewind]\n. @meandmax \nSorry for not answering sooner but there've been alot to do at work these last weeks before vacation.\nI've updated my PR with a different solution and tested so that things seem to work in my environment. \n. Rebased against lory master branch so this can be merged now.\n. One thing could be if you wanted to keep a bem-style naming scheme and not use extra js-classes for the slideshow.\n. I'm looking into this a bit more. If I find something I'll make a PR.\n. @davidchase Could you please try this with the current demo page and see if PR #37 helped?\n. :+1: Looks very good to me :)\n. @meandmax I'm all for ES6 and babel. Haven't used webpack though so I can't say either way, modules I do like though.\n. It would require updates to lory itself. Currently everything is calculated based on widths.\n. That example works in my Firefox 50.\n. Feels like a strange thing to do. 👎 \n. spelling of destroy()\n. spelling of destroy\n. ",
    "SiamKreative": "@Cordazar Can you please point me to a working example with fluid slider? I'm struggling to get this working.\nI don't want to define a media query for each device width... I just want my slider to be 100% of the parent element.\n. Thanks for getting back to me :)\nBecause I was unable to find documentation about fluid sliders, I decided to look around for another library agnostic script and I found http://wd.dizaina.net/en/scripts/peppermint/. It honestly suits me better as there's no additional work required to get it working with fluid sliders.\nStill, I will check out your example to see how easy it easy to implement.\n. I'm not sure you understood me correctly. I meant that Lory didn't work with PREREQUISITED HTML & PREREQUISTED CSS STYLES:\n\nI had to manually specify a width in pixels for the <li> elements. This is what you're doing in your stylesheet [app.css)(http://meandmax.github.io/lory/demo/app.css) line 199. If the width is required for the script to work, then perhaps it would be a good idea to mention it in the documentation :)\n. ",
    "enzy": "Debugged:\nslidesWidth and frameWidth are the same number and then maxOffset = 0\n. I have switched to another slider instead...\n. ",
    "icetee": "+1\n. ",
    "fde31": "OK. I've added this myself and made a PR in #32.\n. ouch. Sorry for that oversight weird typos should be fixed now.\n. ",
    "ryanrain": "In the meantime, I've gone ahead and used Keith's modified version. Thanks and happy holidays!\n. i lied!\ni ended up writing some very quick and dirty code using the api to get this working in a hurry for a friend. \nbut @meandmax i too would love to see a plugin example. cheers!\n. ",
    "rchrd2": "👍 For having auto-play being a built-in feature. \n. ",
    "tech4him1": "@keithws Would you mind if I go ahead and use your code to make a plugin/example?. How does this look: Automatic Lory Slider on CodePen?  Let me know if you think I should change anything (timer variable safety, code clarity, etc.), and then @keithws or I can make a PR for the docs.\nJust a note: I couldn't put the initialization code in a before.lory.init or after.lory.init handler, because the slider variable has not been returned yet from the Lory function call.  If a copy of the lory object (including prev, next, and slideTo) was available in either of those event callbacks, that init code could be cleaned up. Do you think that is worth adding?. ",
    "keithws": "@tech4him1 I'd love to see a autoscroll plugin/example. Feel free to use any of my code in this branch.. ",
    "midudev": "Hi there! I'm working on a wrapper here: https://github.com/miduga/react-lory\nIt's still a alpha, but it's usable on most cases if you want the slider to be responsive and slide one to one. 👍  Feedback is welcomed!\n. ",
    "baptooo": "Hello @meandmax,\nthank you for your answer but it appears that I needed this feature because I have a RWD slider\nthat will show a different amount of slides for each breakpoints (3 : desktop, 2 : tablet, 1 : mobile)\nBy the way, I did the calculation in my integration and it appears to work properly with \"loryInstance.returnIndex()\"\nThank  you very much !\n. ",
    "rjoo": "Any chance this can be reopened?\nCalling destroy on a lory instance doesn't actually remove the inline styles. Unless I'm missing something. Example:\ntransition-duration: 0ms; transform: translate3d(-435px, 0px, 0px); transition-timing-function: ease;\n. After actually looking in the source, I confirmed the suspicion that nothing removes the added styles in the destroy method.\nAdding a simple method and calling it when destroyed seems to take care of it.\n```\nfunction untranslate () {\n    const style = slideContainer && slideContainer.style;\nif (style) {\n    style[prefixes.transition + 'TimingFunction'] = null;\n    style[prefixes.transition + 'Duration'] = null;\n    style[prefixes.transform] = null;\n}\n\n}\n// ...\nfunction destroy () {\n    dispatchSliderEvent('before', 'destroy');\nuntranslate();\n// ...\n\n``\n. There is noon.lory.destroyevent being fired. It'sbefore.lory.destroyandafter.lory.destroy`. Might need an update to the docs.\n. ",
    "nring": "Correction to Original report - the shim now works fine, no errors are reported. I was seeing errors due to something wrong on my end.\nHowever functionality is still broken. On your demo page, none of the examples work. Though the \"Showing Events\" example still displays dispatched events.\n. Added pull request #89. The build failed, I'm not sure if it's because of my code changes or the automated babel updates. The tests were passing locally. Please advise\n. Yup looks good - I wanted to wait to test the updated version before closing myself. Thanks for the quick update.\n. The newest (1.6.7) no longer works in IE9 again. Locally I'm seeing a \"Symbol is undefined\" error on line where lory is initialized. On the demo site, I see a different error saying \"Unable to get value of the property 'contains': object is null or undefined.\" 1.6.6 shows the same errors.\nShall I create a new issue or can you reopen this one? \ncc @levito \n. ",
    "levito": "Hi @meandmax,\nI just rebased on upstream and removed the version number from the package.json. I needed to add it so I can npm-install my fork. My bad it landed in the PR.\nCheers\nVeit\n. Thanks a lot, Max!\n. ",
    "unstubbable": "+1\n. I'd prefer the previous approach with separate karma config files. You could just add the check to your .travis.yml to execute the sauce labs test script.\n. ",
    "ska-cz": "+1 \nAuto resize handler also cause \"issues\" on mobile devices, where resize is triggered when browser url bar is hidden/showed by scrolling.\nWould be also great to have an option to prevent reset() on vertical resize.\n. ",
    "ZauberNerd": "LGTM.\nBut this is again a breaking change ;)\nSee more about how to annotate breaking changes in the Angular commit style guide lines here: https://docs.google.com/document/d/1QrDFcIiPjSLDn3EL15IJygNPiHORgU1_OOAqWjiDU5Y/edit#heading=h.gbbngquhe0qa\n. ",
    "ginsterbusch": "Guess I wasnt specific enough: How would I do that when the object is already instantiated? \nThe use case is rather simple: You've got a bunch of images, and on click you get an overlay, that displays the image plus HTML content (eg. caption or a bigger descriptional text block).\nThink of it in terms of a fancy, responsive lightbox thingy.\nSo when the user closes that overlay, and then goes on to click on a totally different image, you'd normally get the (unwanted) effect of the overlay opening and the slideshow still spinning. And that is what my question is actually about: Is it possible to instantly switch to a specific slide AFTER script initialization?\nThat basically would mean changing options on the fly (which is what an API is supposed to do or help to achieve).\ncu, w0lf.\n. @Yimiprod well, it's pretty simple: I'm rolling my own (framework-agnostic, API-exposing, etc. slideshow script), as there aint not slideshow / carousel scripts around, that offer this much flexibility ;)\ncu, w0lf.\n. ",
    "Yimiprod": "I know it has been closed but wan't an anwser too.\nSince the options are extended, we can't do trick like change the option.slideSpeed to 0 then revert it back to normal speed.\n. ",
    "hchargois": "Hi,\nI thought about doing it this way but:\n1) This doesn't work when slidesToScroll > 1. And there's no easy fix such as adding the number of slidesToScroll to the returnIndex or something, because returnIndex is inherently broken at the end of the carousel (after the last slide action that slides to the complete end of the carousel, returnIndex is the same as the previous slide). For this to work well and easy enough, the API should have something such as atStart and atEnd that returns the corresponding truth values.\n2) It's a bit complicated for a feature I think is elementary. I understand that you want people to use the API to extend the functionality but since controls were deemed so common that they were built into lory (they could have been left to the user to build with the API instead), then those controls should be powerful enough to cover such a common \"enabled/disabled styling\" use case. In my opinion it's just as useful as setting an \"active\" class to the current slide.\n. ",
    "maximerabot": "Any updates about this features? Can we now hide controls when they are not \"active\"?. ",
    "lalop": "The error come from the import.\nWith import {lory} from 'lory.js'; it works\n. I'm not sure if it's the readme that needs to be updated or the export;\n. That sounds good for me\n. thank you\n. ",
    "tshedor": "@meandmax IE 9 doesn't support classList. This polyfill did the trick.\n. Depending on how much you value IE9 support, you could replace the problem lines with classList-less functions. \nI've got some experience with this and can open a PR if that'd be easier.\n. Yeah, that's a good point - they would all fail if it was classList. I'll try this in a VM.\n. All seven of those tests include the waitForTransitionEnd callback - I wonder if it's having a hard time with the && in done && done()?\n. ",
    "leonardofaria": "@aderaaij could you post your example?\n. ",
    "aderaaij": "@leonardofaria I'll set up a demo asap, will report back!\n. ",
    "riotcku": "I have a similar issue, but a simpler one. \nWhen I use returnIndex() at the last slide (length - 1) with the rewind option as true, I get the wrong index, specifically it returns the index of the previous slide. If this is a separate bug from this issue, please let me know and I'll make a separate issue.\n. @meandmax @aderaaij Figured the bug out.\nThis is because Lory uses an offset for calculation of the next index. HTML adds 4px margin between every element that are inline-block with whitespace. This causes this conditional statement\njs\nif (slides[nextIndex].offsetLeft <= maxOffset) {\n    index = nextIndex;\n}\nto not fire, not updating the index.\nSolution is either using CSS (One simple workaround could be a selector of non-first-child that applies margin-left: -4px) or a more permanent solution would be for Lory to not use offset as its counter for index.\n. @pieplu Yup, 4px is the magic number for most sites because the unicode whitespace width is .25em and 16px is the default font-size. \nfont-size: 0 on the parent is a good fix that gets around this but browsers nowadays have a minimum font size! So this fix is not reliable as well.\nIn my personal case, solution was to use the CSS3 white-space-collapsing property but this is because I don't need to worry about non-css3 supporting browsers. \nThe best fix would be to solve for this in Lory instead of CSS methods.. I made an option to change this behavior in this PR: https://github.com/meandmax/lory/pull/312\n. Read my answer on https://github.com/meandmax/lory/issues/197\nI believe your problem is related, and I have a solution up there.\n. I think detecting last slides by index should apply to non-infinite items as well.\n. @meandmax addressed feedback!\n. ",
    "pieplu": "\nSolution is either using CSS (One simple workaround could be a selector of non-first-child that applies margin-left: -4px) or a more permanent solution would be for Lory to not use offset as its counter for index.\n\n@riotcku \nOr a font-size:0 on the parent? The 4px depends of the font-size. ",
    "mikemaccana": "Same here. I'm just hacking it for now - long term it would be better to move away from inline-block completely - slides aren't really blocks inside a line of characters - and just use grid, now most people are on an evergreen browser.\n// HACK\n// 1050 highlights last item but no rewind\n// 1025 doesn't highlight last item\n// See https://github.com/meandmax/lory/issues/197\nconst FIX_BUG = 1040\n\nconst maxOffset = Math.round(slidesWidth - frameWidth) + FIX_BUG;.\n",
    "Mobius1": "Make sure you add both the prev and next buttons otherwise it won't work.\n. ",
    "ndyakov": "@meandmax I see that travis failed for some reason. \nCan you assist with that when you have some spare time?\n. ",
    "davehax": "Hi Jinkwon,\nRecently for a project i modified the distributed \"Lory.js\" file to maintain the current slide index on window resize. Unfortunately i'm unsure on how to contribute this to the source files.\nHere are the relevant functions:\n``` javascript\nfunction reset(persistIndex) {\n    var _options5 = options;\n    var infinite = _options5.infinite;\n    var ease = persistIndex === true ? null : _options5.ease;\n    var rewindSpeed = persistIndex === true ? 0 : _options5.rewindSpeed;\nslidesWidth = slideContainer.getBoundingClientRect().width || slideContainer.offsetWidth;\nframeWidth = frame.getBoundingClientRect().width || frame.offsetWidth;\n\nif (frameWidth === slidesWidth) {\n    slidesWidth = slides.reduce(function (previousValue, slide) {\n        return previousValue + slide.getBoundingClientRect().width || slide.offsetWidth;\n    }, 0);\n}\n\nif (persistIndex !== true) {\n    index = 0;\n}\n\nif (infinite) {\n    translate(slides[index + infinite].offsetLeft * -1, 0, null);\n\n    index = index + infinite;\n    position.x = slides[index].offsetLeft * -1;\n} else {\n    translate(slides[index].offsetLeft * -1, rewindSpeed, ease);\n    position.x = slides[index].offsetLeft * -1;\n}\n\n}\n```\n``` javascript\nfunction onResize(event) {\n    reset(true);\ndispatchSliderEvent('on', 'resize', {\n    event: event\n});\n\n}\n```\n. ",
    "dduskim": "👍 \n. @meandmax I changed that, thanks.\nDewey (@dduskim)\n. ",
    "rekateka": "I only just noticed this behaviour, not by actually, well, resizing the browser window but instead by scrolling/swiping up and down a page in Safari on an iPad, causing the address bar (and subsequently the window) to resize. That might be a little be confusing for the user so I have a not-so-elegant solution for now:\n``` javascript\nconst carousel = document.querySelectorAll('.carousel')[0];\nlet activeSlide = 0;\nconst loryInstance = lory(carousel, {\n  infinite: 1,\n  enableMouseEvents: true\n});\ncarousel.addEventListener('after.lory.slide', () => {\n  activeSlide = loryInstance.returnIndex();\n});\ncarousel.addEventListener('on.lory.resize', () => {\n   loryInstance.slideTo(activeSlide); //the default slide duration makes the transition back to the active slide very obvious\n});\n```\nIdeally it'd be great if this behaviour could be disabled altogether or trigger the reset only when the browser width changes, not both.\n. Hmm, just saw https://github.com/meandmax/lory/pull/312. @meandmax, let me know if I should close this PR if the other gets resolved sooner. Thanks!\n. ",
    "acenkus": "To make lory full screen I just wrote this hack... But maybe we can add option to 100% width by parent container?\n```javascript\nvar lory_slides_width = function(e) {\n    var lory_slide = document.querySelectorAll('.js_slide'),\n    w = window.innerWidth || document.documentElement.clientWidth || document.body.clientWidth;\nfor (var i = 0; i < lory_slide.length; i++) {\n    lory_slide[i].style.width = w + 'px';\n}\n\n};\n```. ",
    "veganista": "I'm having a bit of trouble with 100% width slides.\nIt keeps snapping back on release.\nI've put together a fiddle here: https://jsfiddle.net/eaoobsw3/1/\nEdit: After looking a little more, it looks like setting .slides to block, instead of 100% inline-block kind of fixes it: https://jsfiddle.net/eaoobsw3/2/. ",
    "peterrattew": "The second fiddle is still broke for me and shows a part of the second slide but if you set padding to 0 on .slides then it works fine.. ",
    "nlemoine": "Ok, I figured out I had to set display:block on the carousel__slides item.\n. ",
    "ineghi": "The missing font-size: 0; on the .frame class causes wrong calculations. \n. ",
    "gmenih341": "Had the same problem. My issue was that I didn't add DOMContentLoaded listener, and init lory in there. After doing that, it was properly positioned.. ",
    "slavikse": "@nstanard that was a long time ago. I suspect it was a newline (enter) between inline elements.. ",
    "kbytin": "Not a carousel, but thumbs as navigation https://gist.github.com/kbytin/a19324c30d9fb4612420a7a7f99a1b5a. ",
    "ght": "Builds fine locally, fails on Travis-CI with the notice \"Make sure the SAUCE_USERNAME and SAUCE_ACCESS_KEY environment variables are set.\"\nIf I did something wrong, please let me know how to fix it.\n. Renamed and rebased onto master.\n. ReservedWords cannot be used as Identifiers, but are fine as IdentifierNames.\nSince the LiteralPropertyName token in ObjectInitializer lists IdentifierName and not Identifier as rhs, I do not think this change is neccessary.. Please prefix your commit message with fix: so semantic-release can figure out how to increment the version number.. This is a complicated way of doing the same as:\njs\nsetTimeout(reset, 0);. ",
    "LKuechler": "Thanks for answering. :)\nThe only Problem with the infinite slider ist that the first slide does not have the same indexing number as it has when it is a none-infinite slider.\nThe index is not consistent between normal and infinite slider.\nThe normal slider starts counting at 0 and the infinite one at 1.\nI think starting the count at 0 makes the most sense. In the most use cases i will need the index number to access a different array of elements.\n. ",
    "Dangoo": "Hey @meandmax,\nany news on this topic?\nI'd go with the proposal of @LKuechler.\nCurrently the mapping is as follows which is pretty annoying:\n```\nconst slides = [0,1,2,3,4,5];\n// In default setting without \"infinite\" the indexes remain the same\nconst afterInit = {\n    0: 0,\n    1: 1,\n    2: 2,\n    3: 3,\n    4: 4,\n    5: 5\n}\n// With \"infinite\" set to 1 the indexes look like that:\nconst afterInit = {\n    0: 5,\n    1: 0,\n    2: 1,\n    3: 2,\n    4: 3,\n    5: 4,\n    6: 0\n}\n``\n. I'm not quite sure, if the provided solution solves all problems. When it comes tolory.slideTo()` it has to be able to handle that too.\nSo before merge this pull request the \"-1 pattern\" should become integrated not only for output, but for input methods such as lory.slideTo() too.\n. ",
    "JeffWeim": "I'm wondering the same. The issue was closed before anyone showed a working example...\n. ",
    "Sokol-ua": "+100 for dots\n. ",
    "jennifer-sevenval": "apparently working on one\n. I'm gonna make a pullrequest within the week :)\n. Absolutely, but maybe not everybody knows how, but want to use the slider anyways.\nTL;DR\nIn my opinion a great slider is one where you can 1. have a well documented api - which is here better then nothing but far from perfect - 2. you can extend it by your own code (check), and last but not least: have quite a few standardized options to pass through - like those mouse-click events. If it's about not \"bloating\" the project, you, I or anybody else can write this bubble navigation, autostart function, whatever as a plugin - if that is more likeminded. \n. > The more features you add the more problems you get.\nI'm with you - totally - as a programmer. But as a user you can say - well may this slider is not for me if I need a dot pagination and cannot program it myself. Or whatever. Or you can at least be modular and say - well if you need a dot pagination then enable it - or just get it from that place and enable this js after lory.js has loaded. For sure you have to maintain more but as stated here it is an enhancement. The thing I love about lory is its flexibility to be whatever you want it to be. But by adding new features you do not have to break those flexibility. \nAbout the documentation. Well yes the Readme is rather clear which options you have and what you can do with the api and a bit of \" well that does that thing\" \nBut for me there shall have been a bit more, whilst I was developing the dot navigation and also an autostart option - where every designer I know is after it - I have had to take a deeper look into the code to understand what really was happening - and yes the in-code documentation is very well written, even if the codestyle with those asterisks is quite new to me ^^\n. @nstanard well jQuery dependencies. Not for me :)\n. ",
    "yoanmalie": "I would use Lory instead Slick.js. But the dot pager is the only thing is missing here to replace Slick in my workflow.\n+1 For this Feature request.\n. Hey,\n@nstanard, i don't know how to do this. I don't code JS.\nBTW, i agree with @jeebseven. Feel free to put your PR and let's see if the plugin creator would accept this.\n. @nstanard  Slick Require JQuery, Slick is oversized for most of my projects. Slick is 5.8 × heavier.\nPlease, be relevant.\n. Wow. That escalated quickly. ᕕ( ᐛ )ᕗ\n@nstanard You should have enough knowledge to ensure that your example works correctly and also, avoid bugs. Before \"arguing\" that i should to know JS.\ni repeat: please, be relevant.\nThe fact that i can't code JS doesn't mean i can't use a libs or whatever.\nLibs are made to save times and allow lot peoples to use them easily.\nAs @jeebseven said,\n\nA great slider is one where you can:\n1. Have a well documented api ;\n2. You can extend it by your own code ;\n3. Have quite a few standardized options to pass through.\n\nThe third point is why i'm here. IMO dot pager are sandardized for a slider like Prev and Next buttons.\n. ",
    "JanssenRodrigues": "Still not possible? @meandmax . ",
    "TynesideGroup": "I do believe this is an issue, having come across it myself today.\nEDIT - please see below comment.\n. http://codepen.io/anon/pen/EgpwLJ\nGiven a starting state of slides 1, 2 and 3 being visible:\n- The first swipe correctly shows slides 4, 5 and 1. The expected behaviour when swiping again would be to show 2, 3 and 4. Instead it resets to 1, 2 and 3 (and it is no longer possible to swipe).\n- If you start again and swipe in the opposite direction it correctly shows 3, 4 and 5. Swiping again correctly shows 5, 1 and 2. The expected behaviour when swiping once more would be to show 2, 3 and 4 but instead it resets to 3, 4 and 5 (it is still possible to swipe).\nPlease ignore my earlier comment.\n. With regards to my earlier comment (I've removed it as it wasn't clear), this was only applicable if the user was using infinite: 3 and slidesToScroll: 1 - this appears to work fine.\nThe actual issue is as I have detailed in the above codepen - i.e. using infinite: 3 and slidesToScroll: 3 when the actual number of slides is not divisible by 3.\n. ",
    "andrewbanchich": "@nstanard any updates on this issue? i can't get infinite to work at all. it will loop infinitely, but no matter what number i set it to, it only displays one image at a time.. ",
    "haggen": "I've moved on to a new solution I've developed myself. My needs was of only a subset of the features generally available in carousels and sliders, also I didn't have to support older browsers so I thought it was a good fit. https://codepen.io/haggen/pen/PzJvaB. ",
    "yaypaul": "Hi @nstanard,\nLove Lory, it's so buttery smooth.\nHowever, I am having the same issue as is documented above. If infinite and slides to scroll are set, but the slide set is not a multiple of the slides to scroll then the infinite breaks.\nExamples;\n16 slides - Infinite/StS 3:  16/3 = 5.33 and breaks\n52 slides - Infinite/StS 8: 52/8 = 6.5 and breaks\nDo you have any ETA on a fix for this in 1.0 or a release date for 2.0 planned?\nThe smoothness of Lory is unbeatable, but we'd like to move more than one slide at a time.. ",
    "johannpinson": "Hello @meandmax \nI see a regression with your commit.\nNow, I can't use this setup:\njs\n{\n  infinite: 4,\n  slideToScroll: 1,\n}\nSince you make some calculations like index + (infinite * 2) !== slides.length\nand not index + (slideToScroll * 2) !== slides.length for example, whatever my config, it force to slide many by many (4 by 4 in my setup) except for the slide translation if my slider doesn't contain a multiple of 4.\nI try with the previous version (2.4.4) and it reworks again.\nIn the setup, it may need a bypass like infinite >= slideToScroll and so force the value + add a log to the user?\nThanks,. ",
    "tooltonix": "Works for me fine... thanks\n. ",
    "thomasboulongne": "Already done in #146 \n. It happens when Lory cannot measure the elements on init, are the frame and the slides displayed? It happened to me when I initialized the slider on a display: none element. ",
    "nadeemkhedr": "I know this is referenced in #138 but the answer there works well with slider that shows 1 item at a time, but for sliders that shows multiple items the case is different\nyou could be at slide 1 of 4 and next would be disabled because all of the 4 are shown\n. Able to solve if the number of slides visible at a time is known, closing the issue for now\n. ",
    "patrick-mcdougle": "I don't think the travis failure is related to this change.\n. Oh, so the tests were broken because I didn't build the dist file?\n. ",
    "felipearosemena": "@meandmax Is this option documented? I tried to look in the docs or gh site and couldn't find a ref to rewindOnResize.. I was able to address part of the issue on mobile by adding the following into the onResize function in the plugin:\n```\nfunction onResize (event) {\n    if(window.innerWidth == wWidth) {\n        return;\n    } else {\n        wWidth = window.innerWidth;\n    }\n\n    reset();\n\n    dispatchSliderEvent('on', 'resize', {\n        event\n    });\n}\n\nand defined `wWidth` at the top near `lory`'s definition:\n    let index   = 0;\n    let options = {};\n    let wWidth  = window.innerWidth;\n``\n. @floatingdino @mciastek  I was able to address part of the issue on mobile by adding the following into theonResize` function in the plugin:\n```\nfunction onResize (event) {\n    if(window.innerWidth == wWidth) {\n        return;\n    } else {\n        wWidth = window.innerWidth;\n    }\n\n    reset();\n\n    dispatchSliderEvent('on', 'resize', {\n        event\n    });\n}\n\n```\nand defined wWidth at the top near lory's definition:\nlet index   = 0;\n    let options = {};\n    let wWidth  = window.innerWidth;\n@meandmax Would this be something that should be merged into the repo?. ",
    "Teun87": "I'm still experiencing problems in IOS and rewindOnResize doesn't seem to work either (together with the bullet-example from the Lory website and infinite: 1). Can anybody help me?\n. So quick! Thanks for your great help.\nTeun\n. I've got it set up in my project, but there are a few errors left:\n- When the first after.lory.slide event is triggered the active-class for a bullet skips the second one. It probably has something to do with 0- and 1-based arrays. \n- Same category as the previous point: the last bullet never gets the active-class and when it continues playing the 1st slide is set as 2nd bullet (with active class).\n- I've set up a slider with multiple slides (avatars) visible at the same time (6 to be precise). This causes problems in the bullet navigation. Normally I would change the options-object and set 'infinite' to '6' but this isn't fixing the problem.\nCan you adjust your example in a way that the above bugs are fixed?\nAlso it would be great to see an working example with a pause function when hovering over the slider.\nRegards,\nTeun\n. I've got it almost working, even on mobile with touch events. Though, on IOS the resizing of the window/extra navbar on the bottom (moving up and down on the page) is causing the slider to go back to the second slide, no matter at which slide the slider was. Any idea how to fix this? I've tried to put a touchstart-move-end eventlistener on the document, but so far I can't solve the problem with this.\nThanks for your help!\nTeun\n. This problem is still present. Please make rewindOnResize work!. ",
    "rtyshyk": "@Cordazar, it is reproducible on latest versions of google chrome (53.0.2785.101 m (64-bit)) and firefox (48.0.2)\nsee screencast  http://screencast.com/t/Kp34ABDd\n. ",
    "benni3005": "In the meantime I saw, that you did that in the master branch. But the tag was created before you did that, so https://github.com/meandmax/lory/blob/v2.2.0/dist/lory.js does not contain the rewindOnResize option. I think you just have to release a 2.2.1, so Bower can recognize the update.\nBenni\n. It does. Thank you 👍 \n. ",
    "i-like-robots": "Simply in setups where a user is using a preset for a ratified or draft version of the spec, E.G. es2015, es2016 or even es2017.\nBecause object spread is still at the draft stage (hopefully it will make it into es2018) it requires configuring a specific plugin or using a draft stage preset. But, not everybody is willing or has the know-how to setup such forward-looking build process.\nIn my day-to-day work we're still using the ES2015 preset because we have a large team and the JS landscape is very confusing to many people. We don't want to daunt or frustrate devs by shifting to uncertain ground every few months, even if it's not fashionable!\n. ",
    "gustavopch": "It's written in the docs that infinite doesn't combine with rewind. So having infinite enabled but setting rewindOnResize to false shouldn't be a problem, right? Because it would exactly avoid rewind.\n. ",
    "benjibee": "This is still an issue on our site. I've done some tooling around to no avail. It's not mentioned above, but it's also really evident on mobile, and looks quite janky!. ",
    "jackbarham": "An autoplay version would be awesome - I'm struggling to get it working. Pause on hover would also be nice to have, but autoplay would be great :)\n. ",
    "katiasmet": "@nstanard Hi! It would still be great if you added this feature or example 👍 . ",
    "linnett": "Interested to know your reasons behind why do you feel that it's a bad UX. Sliders like Slick use fade as an option - I think it's pretty common. \n. @nstanard I'm aware of how simple and quick it is to do this but it's just nice to have 1 carousel that fits all - but thanks for the tips \n. ",
    "psi-4ward": "Oh! Interesting, thanks for the Info!\n. +1. ",
    "SukhKalsi": "Hmm not sure how that helps? Lory seems to always position the slides to the hard edge (either left or right depending on direction) \n. Ha I guess so! So I suppose this is a feature request. What is the effort level required to get this in?\n. @nstanard As requested buddy...\nhttp://codepen.io/anon/pen/dpAdrO\n. I've noticed that this affects all touch screen devices. Affected on iOS (iPad & iPhone) and on Android (Chrome, and no doubt Android browsers too).\nAny update as to whether this will be picked up? Almost been 2 weeks now since I have raised this yet there has been no acknowledgment of the issue.. ",
    "curtisblackwell": "Any plans for this yet?. I figured out a way to accomplish this using CSS.\nLet's say you want 3 slides displayed at a time. Each slide is 200px, and there's a 20px gutter b/w slides.\n```scss\n$slideWidth: 200px;\n$slideGutter: 20px;\n.frame {\n  width: ($slideWidth * 3) + ($slideGutter * 2);\n}\n.slide {\n  transform: translateX($slideWidth + $slideGutter);\n  width: $slideWidth;\n\n.slide {\n    margin-left: $slideGutter;\n  }\n}\n```\n\njs\nlory(slider, { infinite: 3 });\nIt's not ideal, b/c it doesn't work w/o infinite (can't focus on last two), but it'll do for now on this project.. ",
    "Sandstedt": "I manage to use some of you css @curtisblackwell but solved it a little different.\ncss\n.slide {\n  width: 60vw;\n  transform: translateX(33.333%); // center slide\n  margin-left:10px;\n  margin-right:10px;\n}. ",
    "octojoerg": "Any way to center slides if you don't know how much slides you have?. ",
    "wesleyhf": "+1. ",
    "deckchairlabs": "I'm having similar issues.\nError: Couldn't find preset \"stage-0\" relative to directory \"/project-dir/node_modules/lory.js\"\nSo I added babel-preset-stage-0 as a dev dependency. Now the error I'm getting is the following.\nError: It looks like your Babel configuration specifies a module transformer. Please disable it. See https://github.com/rollup/rollup-plugin-babel#configuring-babel for more information\nAbbreviated .babelrc\n```\n{\n  \"presets\": [\n    [\"latest\", {\n      \"es2015\": {\n        \"modules\": false\n      }\n    }]\n  ],\n  \"plugins\": [\n    [\"transform-react-jsx\", { \"pragma\": \"h\" }],\n    \"transform-object-rest-spread\",\n    \"external-helpers\"\n  ]\n}\n```. ",
    "Benjamin-Dobell": "Not using Babel here, just rollup, I get:\n<PROJECT PATH>/node_modules/lory.js/src/lory.js: Unexpected token (214:19) in <PROJECT PATH>/node_modules/lory.js/src/lory.js\n  return binding.open(pathModule._makeLong(path), stringToFlags(flags), mode);\nWill investigate and report back.. Oh right, whoops. Looks like I need Babel, ES7 spread operators in use. Hrm.. Okay, yeah jsnext:main is set incorrectly in package.json. jsnext:main does not refer to ES6/ES7 code. It must be valid ES5 with the exception of module syntax. Looks like it's been renamed to pkg.module though:\nhttps://github.com/rollup/rollup/wiki/pkg.module. ",
    "mahish": "Im still getting this error:(. @nstanard So I investigated this issue.\nEdits in lory.js package:\n\nFirst step is to create a new property in package.json of lory.js package → module (as @Benjamin-Dobell already posted). For now, it has to point to ./src/lory.js since there is no es module bundle in ./dist\nthe package should .npmnignore the .babelrc in the package. That's the reason why @deckchairlabs is getting the error of missing preset. Because babel is looking for it in the lory.js folder. (for sake of investigation of this issue I simply deleted it from node_modules/lory.js/.babelrc)\n\nBoth of these points can be commited instantly, I believe.\nEdits in my project's files:\n\nInstall https://babeljs.io/docs/plugins/transform-object-rest-spread/ because of: https://github.com/meandmax/lory/blob/d5f66bdfb46fe5d79a0cf631db3d2d564ce3c056/src/lory.js#L238\nMake sure to have installed rollup plugins: https://github.com/rollup/rollup-plugin-node-resolve, https://github.com/rollup/rollup-plugin-commonjs (because of custom-event package). So the result rollup plugin settings is:\nplugins: [\n  rollupNodeResolve(),\n  rollupBabel({\n    // exclude: 'node_modules/**', // Notice, how I commented it out!\n  }),\n  rollupCommonjs(),\n  rollupUglify(),\n],\n\nAnother edits in lory.js package:\n\nEventually, I made it to succesfull compilation. However, I kept getting runtime error of missing definition of global: https://github.com/meandmax/lory/blob/d5f66bdfb46fe5d79a0cf631db3d2d564ce3c056/src/utils/detect-prefixes.js#L40 \nSo I changed it to: \nconst computedStyle = window.getComputedStyle(el) || global.getComputedStyle(el);\nhasTranslate3d = !!computedStyle.getPropertyValue(transform);\n\nAfter this, It has started to work. Uf:)\nIn general, I find the whole package overcomplicated (yarn, webpack, many other packages). From \"minimalistic slider written in vanilla JavaScript\" I dont expect to have jquery version (there so many jquery sliders out there!) and tons of (even dev) dependecies. \nSo I decided to try to migrate the project from webpack to rollup (because you can export to es module with rollup, and it is much more \"minimalistic\" than webpack). Just for fun & to learn. Lets see if i can make it.. It was easier than expected, here it is: https://github.com/mahish/lory/tree/build-with-rollup . I deleted all packages. Then installed via npm:\n\"scripts\": {\n    \"start\": \"npm install && npm run dev\",\n    \"dev\": \"rollup -c -w -m inline\",\n    \"build\": \"rollup -c && rollup -c rollup.config.min.js\"\n  },\n\"devDependencies\": {\n    \"babel-core\": \"6.26.0\",\n    \"babel-plugin-transform-object-rest-spread\": \"6.26.0\",\n    \"babel-preset-env\": \"^1.6.1\",\n    \"eslint\": \"^4.18.1\",\n    \"eslint-config-standard\": \"^11.0.0\",\n    \"eslint-plugin-promise\": \"^3.6.0\",\n    \"eslint-plugin-standard\": \"^3.0.1\",\n    \"rollup\": \"^0.56.2\",\n    \"rollup-plugin-babel\": \"^3.0.3\",\n    \"rollup-plugin-commonjs\": \"^8.3.0\",\n    \"rollup-plugin-node-resolve\": \"^3.0.3\",\n    \"rollup-plugin-uglify\": \"^3.0.0\"\n  },\n  \"dependencies\": {\n    \"custom-event\": \"^1.0.1\"\n  },\n  \"browserslist\": [\n    \"last 2 versions\",\n    \"> 3%\",\n    \"ie 10-11\"\n  ]\nSo basically, testing environement is missing, which Ive never done before. I might try it tmrw. Or at least provide some simple working example (tested it in my project and it is working). However, the package is much more minimalistic now and does the job. \nAnyway I would be happy if anyone can try it out. Copy the ./dist/lory.module.js (for es module) or ./dist/lory.min.js (umd) to your projects and let me know!. @nstanard any update on this? I did some effort here:). Ok, I will create an example next week. However, the scenario is when you want to have controls within each slide item.. @nstanard Hey, I prepared the working example. https://codepen.io/mahish/pen/BZEONg . Here is \n\n. @mikemaccana Sadly, it is an old issue without any interest to fix it. I ve offered a resolution of the problem, no answer yet. https://github.com/meandmax/lory/issues/480. ",
    "Eugeno": "Had the same error. Thx to @mahish for decision! @nstanard, pay attention to this.. ",
    "bgreater": "So using the NPM version of lory I was able to get it compiled correctly with rollup. I'm using Babel and and the rollup-plugin-commonjs plugin. which allows me to import lory as a commonjs module. \nExample rollup settings\n...\nplugins: [\n          rollupCommonjs(\n            {\n              include: [\n                'node_modules/lory.js/**',\n              ]\n            }\n          )\n...\nExample usage\n```\nimport lory from 'lory.js';\ndocument.addEventListener('DOMContentLoaded', function () {\n  var multiSlides = document.querySelector('.js_slider');\n  // Have to use lory.lory b/c the default export is an object.\n  lory.lory(multiSlides, {\n      slidesToScroll: 5\n  });\n});\n```. ",
    "averest": "I have exactly the same problem. Passing rewindOnResize: false doesn't fix the issue. Can anybody copy that?. Does anybody have a fix for this. Would be highly appreciated... ;). ",
    "moklick": "We could fix it with options { infinite: false, rewindOnResize: false }. rewindOnResize doesn't work when infinite is true. So it's important to set it to false.. ",
    "marcelalburg": "👍 . ",
    "motoringcouk": "I have a similar issue to this, which is triggered when i remove/add elements to the slider. I'm calling lory like this:\nvar slider = document.querySelector('.buying-mobile__container');\nvar inst = lory(slider, {\n             infinite: false,\n             rewindOnResize: false,\n             rewind: true\n});\nand calling inst.setup(); when i have finished updating the dom.\nany help would be appreciated.. ",
    "graciano": "Is there more to be done in this PR or the project is no longer being maintained?. ",
    "boneyfantaseas": "I'd love to see this pull request resolved as I encounter this issue currently on building an index/total display.. ",
    "andrejpavlovic": "Ideally the dist files should not be part of the pull request.... ",
    "Insasse": "Would you reroll the patch against latest version please?. I have a similiar problem with my slider, the slider seems to randomly skipping 2-3 slides, the slidesToScroll is set to 1, though.. ",
    "UTurista": "I checked the current version (2.5.1) and the error was still present.. ",
    "jordic": "Seems like some of your tests are also wrong :). yup! Absolutly. ",
    "drewfranklin": "Hey @andosteinmetz,\nInfinite can be set to false or number of visible slides. So I believe you would want { infinite: 1 } instead of { infinite: true }. Although shifting this into a feature request. I was thinking about this, and trying to think of possible scenarios where you want infinite and slidesToScroll to be different values. I couldn't think of any, but maybe it was built this way for a use case that I am not thinking of.\nIf there is not a use case maybe infinite should be a boolean value and then the number of visible slides is based on slidesToScroll?. @nstanard I am trying to use something like the attached screenshot.  A thumbnail slider that controls a main image. The goal with infinite is to help users quickly get to any image to see the product. If there are 10 images of the product, and someone is at the last image, and wants to see the first, they could just cycle back around as opposed to clicking back 3 times.\n\n. @nstanard \nI agree I think option 1 make more sense to me intuitively.\nOption 1\nThe only potential issue I see with issue 1 is that once you get to 7-10 what happens when you hit the left side back button? Does it go back to 5-8 or 2-6? Implementation wise I think either solution could get somewhat cumbersome keeping track of state. At least that is what ran into when I went down that path (only very superficially though).\nOption 2\nThe pull request implements this behavior. So when the slider gets to 9,10,1,2 on the next button press it moves 2 to 1-4, and then on back it goes to 7-10 and then on subsequent back buttons it goes to 2-6 and then to 1-4. This seemed the simplest way to deal with it, but I don't necessarily believe that the easiest way to implement should be how it is implemented, but I figured the simplest solution would be most likely to get merged as to not break anything else.. ",
    "andosteinmetz": "Thanks @drewfranklin! That fixes my immediate issue. \nTo me, it seems natural for them to be three separate values: infinite (boolean), slidesToScroll, and slidesVisible, though I haven't looked too carefully into the code to see how the 'infinite' value is being used.... This would be a nice feature. In the meantime, you could implement it yourself using the before.lory.slide event with something like:\n```\n\n\n\n\n\n\n\n\n\nvar slideContainer;\n\nfunction lazyLoadSlideshowImage(e){\n    var nextElement = slideContainer.childNodes[e.detail.nextSlide];\n    var image = nextElement.childNodes[0];        // or some more reliable way of getting the next image\n    if( image.src === ''){\n      image.src = image.dataset.src;\n    }\n}\n\ndocument.addEventListener('DOMContentLoaded', function () {\n  slideContainer = document.getElementById('my-slider');\n  slideContainer.addEventListener('before.lory.slide', lazyLoadSlideshowImage);\n}\n\n```. ",
    "MRokas": "from what I see, this is caused by webpack, by passing wrong global value.. @Gastonite - you forgot to mention it requires npm i -D imports-loader;. ",
    "Gastonite": "changing the import by\nimport { lory } from 'imports-loader?global=>window!lory.js';\nseems to do the trick =). ",
    "lukearmstrong": "I saw your post on a previous issue about using text, mine looked fine when it loaded the first slide, but the carousel doesn't move to the correct position when selecting the next slide.\nI'll have to come up with a link to demo this if you think that would be useful.. ",
    "heinja": "Thanks! I've struggled with this issue for hours until I found this post and change my e.detail.currentslide to e.detail.index specifically for before.lory.slide.. ",
    "membla": "Also when infinite is true, the wrong values are returned – the elements added for wrapping are included in the index and currentslide.. ",
    "VangelisAlSghir": "Also when infinite is false, still wrong values are returned. NextSlide shows -1 on \"next\" click. . ",
    "dimaip": "This is a major bummer for me, I need to hide prev and next links when they are inactive, and I don't know how to do it if I can't rely on correct index.\nFor now I have to keep track of index manually: https://github.com/psmb/PsmbDistr/blob/master/Packages/Sites/Sfi.Site/Frontend/js/init.lory.js#L49. ",
    "richardtoner": "What is the status of this bug?\nWe've identified the returnIndex error in a number of our use cases, so just want to check whether this is something we should look to fix on our side or wait for a fix?. ",
    "Saturate": "Hey @richardtoner feel free to create a PR, as this seem to have been stalled!. This has been answered, closing it. . Tried to reproduce it, but I can't. If it's still a problem feel free to open this again. If you can create a example on jsfiddle or any other online editor.\nThanks!. You could just add a EventListener to the slide with an ID, this would work I guess?  . Seems like it's not and issue and the solution has been provided, so I'll close this. If you feel this is a mistake please open it again. Thanks!. @johjacb this has been fixed in #715. @meandmax this looks good to merge, it could seem that you are busy. Do you need some help maintaining this repo?. Hey @MrSlide thanks for the PR! Unfortunately there are some conflicts, due to other updates that must be fixed. It seems like all that's needed is a new build , but none the less it's needed.\nThanks!. Hi @MrSlide it still conflicts for me :-(. ",
    "cmoeser": "Experiencing this issue as well. 'active' class never gets added to last slide. . @RSeidelsohn Awesome! Thanks so much!. ",
    "RSeidelsohn": "@cmoeser : You might want to give my fork lory-lesara a try. It solves the issue for me.. @meandmax Well, it should return 14. And for this I created the fork of lory, named lory-lesara (I work for a company named Lesara where we use this fork). I add this functionality as a feature, so in order to enable it, you have to pass an additional parameter. If you don't, the code behaves exactly as the original lory does. It is just an additional feature for users that have varying numbers of slides (i.e. not always exact multiples of the visible slides) and want the arrows to disappear when the last slide has been reached.. Hi, meandmax,\nit might be preferable for other users facing the same issue to have my change merged, especially since per default it doesn't change any behaviour but only if an additional parameter is added, and I might not update my fork as it does what I need, as you already stated. But I am fine with it, sure.\nBest regards,\nRoman.. ",
    "ibrokemycomputer": "@RSeidelsohn Thank you so much for that. We are on a time crunch and you saved the day. \n@meandmax I have to mention, you tagged this as \"help wanted\" and the help was provided. Does the fork conflict with this repo or is it something you can pull in? \nThe bandwidth cost of importing lory vs other sliders (swiper, slick - to name a couple) makes it extremely attractive to RAIL/network performance-oriented developers. It would be nice to consider your library stable and active so our agency can confidently use it in production environments. If you still are actively seeking help please let me know, I would be glad to look into some of the issues.. ",
    "tvler": "This could be called initialIndex or anything else if we come up with a better name.. ",
    "danielj41": "Sure, that's a reasonable question.\nWe're using lory to display photos of a product. See this screenshot:\n\nThis product comes in multiple colors, which can be selected with the dropdown menu. When this dropdown state changes, we store the new state in the url with replaceState.\nIf the user reloads the page, we want to show the first image that corresponds to the selected color. See this screenshot:\n\nYou can try this page yourself. View it on a mobile device (or a window narrower than 600px).\nWe did try using slideTo, as suggested. However, I couldn't find a way to temporarily disable the sliding animation. It looked odd to animate away from the first image as soon as the page loaded.\n. ",
    "qkevinto": "@nstanard, have you had a chance to look into this PR? This is a feature I would find useful as well. 😀. ",
    "Ficik": "I've just hit into same problem when bundling with rollup + babel from npm. \nimport {lori} from \"lori.js/src/lori.js\" complains about \"custom-event\" being external dependency and fails in runtime with  Cannot read property 'CustomEvent' of undefined\ncustom-event should be dependency not devDependency. ",
    "chaucerbao": "I ran into this issue while using only Babel (no webpack nor Browserify) with babel-preset-env.\nI believe the problem is with the code injected to transform module syntax (the umd), where global was being resolved to undefined when it should have been resolved to window in the browser.\nDisabling the transformation fixed it for me.\n{\n  presets: [\n    ['env', { modules: false }]\n  ]\n}\nI know this solution may not work for you because you actually need module imports, but this worked for my situation, and may be a step to finding the deeper issue.. That goes into the Babel config file, wherever you might have it (.babelrc or package.json).. ",
    "davidrhoden": "chaucerbao: where do you put the code you pasted to disable the transformation?. ",
    "MartinMuzatko": "I can confirm, I'm also requiring the dist file. Also, it complained about stage-0 being not preset.\nUsing modules: false does not work:\njs\nERROR in ./src/main.js\nModule build failed: ReferenceError: [BABEL] /Users/martinmuzatko/dev/github/s-s-f.de/src/main.js: Using removed Babel 5 option: base.modules - Use the corresponding module transform plugin in the `plugins` option. Check out http://babeljs.io/docs/plugins/#modules\n    at Logger.error (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-core/lib/transformation/file/logger.js:41:11)\n    at OptionManager.mergeOptions (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-core/lib/transformation/file/options/option-manager.js:220:20)\n    at OptionManager.init (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-core/lib/transformation/file/options/option-manager.js:368:12)\n    at File.initOptions (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-core/lib/transformation/file/index.js:212:65)\n    at new File (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-core/lib/transformation/file/index.js:135:24)\n    at Pipeline.transform (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-core/lib/transformation/pipeline.js:46:16)\n    at transpile (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-loader/lib/index.js:46:20)\n    at Object.module.exports (/Users/martinmuzatko/dev/github/s-s-f.de/node_modules/babel-loader/lib/index.js:163:20). ",
    "opr": "Also suffering from this dreadful issue\n```\nimport {lory} from '../../../vendor/lory/lory.min.js';\nexport default class TestimonialSlider {\nconstructor() {\n    document.addEventListener('DOMContentLoaded', () => {\n       let testimonialPanel = document.getElementsByClassName('testimonial-slider');\n\n       if(testimonialPanel.length > 0) {\n           lory(testimonialPanel, {});\n       }\n    });\n}\n\n}\n```\nUncaught TypeError: Cannot read property 'CustomEvent' of undefined\n    at Object.eval (lory.min.js?9bd3:1)\n    at Object.defineProperty.value (lory.min.js?9bd3:1)\n    at t (lory.min.js?9bd3:1)\n    at Object.i (lory.min.js?9bd3:1)\n    at t (lory.min.js?9bd3:1)\n    at Object.defineProperty.value (lory.min.js?9bd3:1)\n    at t (lory.min.js?9bd3:1)\n    at Object.defineProperty.value (lory.min.js?9bd3:1)\n    at t (lory.min.js?9bd3:1)\n    at eval (lory.min.js?9bd3:1). ",
    "Oliv": "Hello there, \nimporting dist version fails with babel : \nUncaught TypeError: Cannot read property 'CustomEvent' of undefined\n    at Object.<anonymous> (lory.js:775)\n    at Object.defineProperty.value (lory.js:823)\n    at __webpack_require__ (lory.js:37)\n    at Object.NativeCustomEvent (lory.js:744)\n    at __webpack_require__ (lory.js:37)\n    at Object.defineProperty.value (lory.js:95)\n    at __webpack_require__ (lory.js:37)\n    at Object.defineProperty.value (lory.js:66)\n    at __webpack_require__ (lory.js:37)\n    at lory.js:58\n(anonymous) @ lory.js:775\nObject.defineProperty.value @ lory.js:823\n__webpack_require__ @ lory.js:37\nNativeCustomEvent @ lory.js:744\n__webpack_require__ @ lory.js:37\nObject.defineProperty.value @ lory.js:95\n__webpack_require__ @ lory.js:37\nObject.defineProperty.value @ lory.js:66\n__webpack_require__ @ lory.js:37\n(anonymous) @ lory.js:58\n(anonymous) @ lory.js:60\nwebpackUniversalModuleDefinition @ lory.js:10\n(anonymous) @ lory.js:16\n(anonymous) @ lory.js:939\ninitModule @ app.js:42\nrequire @ app.js:59\nexpanded @ app.js:34\n(anonymous) @ page.definitions.js:26\ninitModule @ app.js:42\nrequire @ app.js:59\nexpanded @ app.js:34\n(anonymous) @ app.js:12\ninitModule @ app.js:42\nrequire @ app.js:59\nexpanded @ app.js:34\n(anonymous) @ index.js:3\ninitModule @ app.js:42\nrequire @ app.js:59\n(anonymous) @ (index):21\nThe solution I found is to npm i custom-event in my project, then import it before importing lory\nimport CustomEvent from 'custom-event';\nimport { lory } from 'lory.js/src/lory.js';\nStill not clean, but works.\nRegards. ",
    "mciastek": "It's caused by reset method in resize event callback. First of all, I would like to set if I want slider to reset after resize. Secondly, it would be better to listen to orientationchange on mobile devices, because normal scrolling (and hiding browser's top bar) triggers resize event.\n@meandmax Is that library still maintained?. ",
    "VitorLuizC": "@nstanard\nThis issue should be reopen because rewindOnResize should not be used with infinite: true which is my current implementation. Also, this reset not fires the 'after.lory.slide' event.. ",
    "jimmaaay": "I know this is an old thread but I had a similar issue and thought my solution might be useful to someone else with the issue\n```javascript\nimport { lory } from 'lory.js';\nimport isEqual from 'lodash.isequal';\nconst carousel = document.querySelector('.home-box__carousel');\nif (carousel != null) {\nconst options = [\n    {\n      breakpoint: null,\n      settings: {\n        infinite: 1,\n      },\n    },\n    {\n      breakpoint: '(min-width: 43.75em)',\n      settings: {\n        infinite: 2,\n      },\n    },\n    {\n      breakpoint: '(min-width: 75em)',\n      settings: {\n        infinite: 4,\n      },\n    },\n  ];\nconst getValidOption = () => {\n    return options.reduce((ret, obj) => {\n      if (obj.breakpoint == null || ret === false || window.matchMedia(obj.breakpoint).matches) return obj.settings;\n      return ret;\n    }, false);\n  }\nlet carouselOptions = getValidOption();\nconst loryCarousel = lory(carousel, carouselOptions);\ncarousel.addEventListener('on.lory.resize', () => {\n    const newOptions = getValidOption();\n    if (isEqual(carouselOptions, newOptions)) return;\n    carouselOptions = newOptions;\n    loryCarousel.setup();\n  });\n}\n```\n```\n.js_slide{ \n  width: 100%;\n}\n@media (min-width:43.75em) {\n.js_slide{ \n    width: 50%;\n  }\n}\n@media (min-width:75em) {\n.js_slide{ \n    width: 25%;\n  }\n}\n```. ",
    "hernimen": "any news?. ",
    "darith27": "Any updates on this feature?. ",
    "justerest": "This object is created when  Lory initializes.\njavascript\nconst slider = lory(element);\nslider.next();. ",
    "tournevis": "Hi, \nI'm having the same issue with non-infinite slider\n@jackbrewer The last slide, never get the 'active' class, so that's why in the first case you can't get back on first slide cause to lory.js the first slide is still active. \n@nstanard  did you find any clue that will orientate us ?  😀. ",
    "luksladky": "It causes the condition for updating index in the slide() method. The offsetLeft is slightly higher that the maxOffset (by 3px in my case). I don't know why is this happening though.\nif (slides[nextIndex].offsetLeft <= maxOffset) {\n                        index = nextIndex;\n                    }\n. ",
    "maxkliu26": "I encountered the same error and it seems that the issue is caused by the following codes (where the maxOffset is smaller than the offsetLeft, resulting the class 'active' isn't updated)\nif (slides[nextIndex].offsetLeft <= maxOffset) {\n  index = nextIndex;\n}\nCurrently my workaround is to \"change\" the width of the frame based on the calculated breakpoints and the width of my card in my css file. That's\n.slider .frame {\n   width: 315px; / this is the width of my card. /\n}\n/ 662px is calculated based on the width of my cards and associated margins /\n@media only screen and (min-width: 662px) {\n    .slider .frame {\n        width: 630px; \n    }\n}\n...\nSo far, i found the only drawback is that the spacing might be a bit \"off\" when users swipe the last card in some viewports but at least the user experience would be better, since users could swipe back now. Hopefully it helps and if there is any better approach or solution, feel free to suggest here. :). ",
    "hyshka": "Same thing is happening for me, except I've also noted it happens only on larger screens. I suspect it's something to do with how I'm position the slider so will report back if I find anything out.. Ok @Madeck I'm not sure if you will have the same issue but for me I needed to set display: block; on the ul.slides element and then on the individual slides (li) make sure I'm not setting the font-size or adding white-space: normal;.\nHere's some of my code:\n```\n.slider-frame {\n  position: relative;\n  overflow: hidden;\n  font-size: 0;\n  line-height: 0;\n  white-space: nowrap;\n}\n.slider-slides {\n  display: block;\n  padding: 0;\n\nli {\n    position: relative;\n    display: inline-block;\n    font-size: inherit;\n    margin: 0;\n    vertical-align: top;\n    width: 100%;\n  }\n}\n\n```. ",
    "mxdvl": "Yes, but I’ve decided to use another library, because I need to have text that wraps on the slides. Thanks @hyshka.. ",
    "lleukkun": "Any opinions? Without this Lory is quite unusable on mobile for me and isn't that good on desktop either when resizing windows and using \"infinite\". This is a direct fix for #433 and mitigates #682 so it doesn't result in unusable mobile experience, at least when using infinite.. ",
    "andyrue": "This fix worked great. Thanks. Hope to see it merged and published to official soon.. ",
    "garygreen": "I'm struggling to understand the whole rewindOnResize option. Why is the slide reset to the first slide when you resize the window? It seems bizzare to even be an option to me. Surely you would expect to remain on the same slide when you resize the window, not jump around. Never seen any other carousel implement such functionality. ",
    "gitsilvan": "@garygreen I am wondering about the same. How do you get rid of this functionality?. You can turn off the initial slide animation by disabling all transitions on the lory element via CSS first and enabling them again after lory was initialized.\nYou could for example add a no-animations class and remove it after lory was initialized.\nCSS:\n.no-animations * {\n    transition: none;\n}\nAnd then add in your JS (before initializing lory!):\ndocument.addEventListener('after.lory.init', function() { yourLoryElement.classList.remove('no-animations'); });\n. ",
    "lacedon": "Actualy, no, I didn't. But I'm using it on my project as vertical and as horizontal slider, and there is no any problem.\nI'll try to check it and to fix my commits tomorrow.. Pull request was redone here: #693.. @meandmax\n\n@lacedon Did you try this out with the examples in the index file because it seems to me that this does not work at all?\n\nI've looked index file today and there are no any errors.\nBefore it I called npm run build, so files were updated.. ",
    "kaylabranch": "@meandmax Wonderful! I appreciate you taking a look & merging it in!. @odiumediae - if you have the time, why don't you write up some better documentation/examples?\nNot a fan of people whining about issues with these little open-source projects. Make a PR and contribute why don't ya.. ",
    "jacobjuul": "+1. @amirhakbari what features in regards to rtl are you looking for?. @s3rgiosan updated, please let me know how it works out for you.. @meandmax I'd be happy to help as well. @soluml can you provide us with a jsbin or fiddle?. Couldn't this be something like classNameDisabledCtrl ? (instead of having two variables). ",
    "majioa": "Ok, is seems lory isn't supporting babel-loader, so workaround is here: https://github.com/gaearon/react-hot-loader/issues/133. Not exactly, any one working. ",
    "cameronbraid": "setTimeout(()=>lory.next(), 1000);\nor it you want it to stop automatically calling next during touch interaction or mouseover  use something like the following :\n```\n stopAutoTimer() {\n    clearInterval(this.timeout)\n  },\nresetAutoTimer() {\n    this.stopAutoTimer()\n    this.timeout = setInterval(()=>this.next(), 2000)\n  },\nsubscribeTo('on.lory.touchstart', ()=>this.stopAutoTimer());\nsubscribeTo('on.lory.touchend',  ()=>this.resetAutoTimer());\nsubscribeTo('mouseover',  ()=>this.stopAutoTimer());\nsubscribeTo('mouseout',  ()=>this.resetAutoTimer());\nthis.resetAutoTimer()\n```. ",
    "nkudr": "@nstanard I thought about this approach. It may be suitable in some cases. But in my case (which has inspired me to make this pull request) custom speed (more slow) is needed only when next() is invoked by SetInterval when user doesn't interact with the slider. So I've preferred more flexible solution.. ",
    "pedroreartes": "I have the same issue with angularjs  version. ",
    "dsktschy": "Please try to set transition-delay: 1ms to the slides container (.js_slides) element.. ",
    "kyleaffolder": "@dsktschy Thanks so much! That resolves the issue I was experiencing! I appreciate the help and guidance.. ",
    "jveens": "I also came across this bug - of note is that I only experienced it on a retina screen. Setting the transition delay fixed it for me as well. . ",
    "shelldandy": "please use stack overflow for questions. ",
    "sumitmann": "Yes I could, but i wanted an event which get triggered only when there is no dragging. With current version of 'lory' if i add a click event listener to do some stuff then it'll get triggered every time i click and drag mouse on slider.. ",
    "christoph-bessei": "I had the same problem and solved it with the following code:\njavascript\n    LORY_CLASS_NAME_FRAME_ELEMENT.addEventListener('click', function (e) {\n      if (!e.defaultPrevented) {\n        // This is a real click, because lory has called e.preventDefault();\n        // This happens in https://github.com/meandmax/lory/blob/81de415866d0e8723928a909a05c624341c93eba/src/lory.js#L538\n        // You have to set enableMouseEvents = true for this to work\n      } else {\n        // This is a drag/move event\n      }\n    });\nImportant\nYou have to add your event listener after you initiated lory. Otherwise your event handler is called, before lory can call e.preventDefault();. ",
    "valdrinkoshi": "Actually, looks like it's enough to wait for the next animation frame before invoking lory.. ",
    "wambarroto": "well, i've already fix this problem myself. I'm inspired by vue-lory in vue-admin-master\nfirst i create a lory component (lory.vue) like this\n<template>\n    <div class=\"slider js_slider\">\n        <div class=\"frame js_frame\">\n            <ul class=\"slides js_slides\">\n                <slot name=\"item\"></slot>\n            </ul>\n        </div>\n        <slot name=\"actions\"></slot>\n    </div>\n</template>\nand the script\n```\n\nimport { lory } from 'lory.js'</p>\n<p>export default {\n    props: {\n        options: {\n            type: Object,\n            default: () =&gt; ({\n                enableMouseEvents: true,\n            })\n        }\n    },</p>\n<pre><code>data () {\n    return {\n        slider: null\n    }\n},\n\nmounted () {\n    this.slider = lory(this.$el, this.options)\n},\n\nbeforeDestroy () {\n    this.slider.destroy()\n}\n</code></pre>\n<p>}\n\n```\nalso the css\n```\n\n/<em><em>\n</em> (optional) define here the style definitions which should be applied on the slider container\n</em> e.g. width including further controls like arrows etc.\n*/\n.slider {</p>\n<pre><code>.frame {\n    /**\n    * (optional) wrapper width, specifies width of the slider frame.\n    */\n    width: 100%;\n\n    position: relative;\n    font-size: 0;\n    line-height: 0;\n    overflow: hidden;\n    white-space: nowrap;\n}\n\n.slides {\n    width: 100%;\n    display: inline-block;\n}\n\nli {\n    position: relative;\n    display: inline-block;\n\n    /**\n    * (optional) if the content inside the slide element has a defined size.\n    */\n    width: 100%;\n\n    position: relative;\n    display: inline-block;\n    text-align: center;\n    font-size: 15px;\n    line-height: 30px;\n}\n\n.prev, .next {\n    position: absolute;\n    top: 50%;\n    margin-top: -25px;\n    display: block;\n    cursor: pointer;\n}\n\n.next {\n    right: 0;\n}\n\n.prev {\n    left: 0;\n}\n\n.next svg, .prev svg {\n    width: 25px;\n}\n\n&amp;.js_rewind {\n    .frame li {\n        margin-right: 10px;\n    }\n}\n</code></pre>\n<p>}\n\nthen i call this lory in vue component that need lory like this\n\n\n\n\n\n```\n. Well, it create the lory, but it's not slide the image by button. May it can give some help. ",
    "joergsteinhauer": "~~same here!~~\nHad the same problem, but it was solved as I removed the width: 100% and added display: inline-block from/to parent container... just do it like in the example CSS. ",
    "johjacb": "@yshterev could you post your code solution? thanks!. ",
    "tylik1": "any update on this? Seems to be a common task. Probably the most basic answer is to destroy slider, then reinitiate with new set of slides, and then navigate to the last slide, if needed. . ",
    "amirhakbari": "hi dear\nplease add right-to-left property in slider config,  like slick that\nsupport rtl  just add :rtl: true\" in config\ntank you so much\nOn Fri, Mar 16, 2018 at 6:05 PM, Jacob Juul Christiansen \nnotifications@github.com wrote:\n\n@amirhakbari https://github.com/amirhakbari what features in regards to\nrtl are you looking for?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/meandmax/lory/issues/714#issuecomment-373732376, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/AgW7GId-rS0ILqGReBI-WPU4HqlW3S_yks5te83IgaJpZM4QooQf\n.\n\n\n-- \nFront-End Developer @Ibartar.com Since 2016\nhttp://i http://www.ahakbari.irbartar.com\n. ",
    "madmadi": "I've made a new PR for it. #728 . My commit rejected by Travis, I think you should change the tests, because of wrong onResize function call in mobile browsers, it will revoke on mobile touch/scroll event.. I decide to comment that line because I got preventDefault is not a function in some situations and after that, It was a better Lory. I tested it out in a real app.. ",
    "sebbdk": "I hit this issue as well, so i looked into it.\nRather than adding a fix in lory, i suggest doing this from the implementers styles.\nSomething like this:\nhtml[dir=\"rtl\"] .myframeclass { direction: ltr; }\nhtml[dir=\"rtl\"] .myframeclass .myframes { direction: rtl; }\nBrowsers handle rtl and position differently, but the above works in all browsers.\nThe alternative is to bloat the js source with detection code or external libraries, and normalization code.\nIn contrast to the two lines of css above. :). ",
    "heinrichson": "Lets get this for improved scrolling performance. ",
    "praneybehl": "Can this pull request be merged? The browser console keeps throwing Violation warnings and they also reflect on google analytics \n\n. ",
    "s3rgiosan": "@jacobjuul can you update the dist files in your branch? I want to use your fix via npm.. @jacobjuul worked like a charm. Thanks 👍 . ",
    "MrSlide": "Hi @Saturate \nI just resolved all the conflicts. @Saturate I fixed the merge conflicts again, only the dist files are conflicting, this will happen every time something is merged with the master branch but can easily be fixed by just creating a new build.. ",
    "jameskraus": "Anyone have a decent example for lory?. ",
    "soluml": "Looks to be caused by slidesWidth and frameWidth returning as 0's in slide() even though they appear to be set correctly in reset().  Not sure why that is yet.. For anyone out there running into this issue, this seems to address the issue:\nLORY_ELEMENT.addEventListener('after.lory.init', () => {\n      setTimeout(() => {\n        window.dispatchEvent(new Event('resize'));\n      }, 0);\n    });\nIt's a pretty gross hack, but works if you're in a pinch.. ",
    "trusktr": "I had to use this hack today. First time trying Lory. I also had to make sure prev/next buttons are disabled during animation, otherwise clicking them too fast breaks the animation.. ",
    "ram-you": "+1, only when \"touch\" is enabled. Have to make test if device touch is enabled.. A link  to help undestand the problem:\nhttps://developers.google.com/web/updates/2017/01/scrolling-intervention. ",
    "hamburger123456": "works for me thx \ngreat job meandmax. ",
    "zauni": "@meandmax could you please release a new version to get this fix with npm? Thanks :). ",
    "gglnx": "Done :). @meandmax Rebased and rebuilded :). @meandmax Ready.. It's more flexible, particularly in BEM context: next-button--disabled && prev-button--disabled.. ",
    "danieljb": "Canceling the mousedown event on slides with images works for me:\nslide.addEventListener('mousedown', function (event) {\n  event.preventDefault();\n});. ",
    "sblanchon": "thanks @danieljb , i used draggable=\"false\" ondragstart=\"return false\" on <a>, <picture>, <img> when this 3 tags are used inside my slide. \nThis is working on IE11, Firefox and Chrome, and \"dragging\" functionality is still OK.. ",
    "davidglezz": "\nI slide to slide 130, but when I release my finger, it returns to 190, the next of the first (220), the expected behavior is to stay at 130 or the nearest one when I release my finger.. To reproduce the problem\nGo to http://loryjs.github.io/lory/ from a Windows 10 touch device (tablet or laptop with touch screen) and try using the slider using your finger.\nObviously using the previously said browsers: Chrome and Edge. "
}