{
    "Mechazawa": "Yes, Greesemonkey or Tampermonkey is required\n. Bump the version number then I'll pull it\n. It could be used as a heuristic way of finding if fuckfuckadblock is being loaded because fuckadblock doesn't do type checking.\nFuckAdblock.js\njs\nvar fns = this._var.event[(detected===true?'detected':'notDetected')];\nfor(var i in fns) {\n    if(this._options.debug === true) {\n        this._log('emitEvent', 'Call function '+(parseInt(i)+1)+'/'+fns.length);\n    }\n    if(fns.hasOwnProperty(i)) {\n        fns[i]();\n    }\n}\nFindFuckFuckAdblockIfPatched\njs\nFuckAdBlock.onDetected(\"beep\");\ntry {\n    FuckAdBlock.emitEvent(true);\n    console.log(\"fuckfuckadblock detected!\");\n} catch(e) {\n    FuckAdBlock.clearEvent();\n}\nBut then again there are other ways of checking if fuckfuckadblock is loaded.\n. Try installing it using Tampermonkey\n. @5Strogino How was the userscript installed? Using Tampermonkey or Greasemonkey?\n. It doesn't seem like the first link uses fuckadblock.js. The second link does not seem to be using fuckfuckadblock.js either. Try whitelisting their advert.js.\n. > A simple userscript that acts like FuckAdBlock.js (A well known adblock detector) but always says that no adblock was detected.\n. FuckFuckAdblock only blocks adblock detection using fuckadblock\n. Yeah, the whole opening g it as the raw file isn't very obvious. Thanks for the heads up!\n. does window.fuckAdBlock exist?\n. I'll have a look at this. I've not encountered this yet. Could you give me a link to a website that uses a packed version of FuckAdblock to test it?\n. Thanks!\n. Merged\n. They don't seem to use FuckFuckAdblock and instead made their own thing. Whitelisting /js/adnetwork.js should do the trick.\n``` html\nAdblock Check\n\n \njQuery(document).ready(checkAds());</p>\n<p>function checkAds() {\n    if (document.getElementById('ad-etarget') != undefined) {\n        document.write(\"<script>_gaq.push(['_trackEvent', 'Adblock', 'Unblocked', 'false',,true]);</sc\" + \"ript>\");\n    } else {\n        document.write(\"<script>_gaq.push(['_trackEvent', 'Adblock', 'Blocked', 'true',,true]);</sc\" + \"ript>\");\n    }\n}\n\nEnd Adblock Check\n``\n. It does not look likenews.nationalgeographic.com` uses FuckAdBlock.js and it thus not supported.\n\nA simple userscript that acts like FuckAdBlock.js (A well known adblock detector) but always says that no adblock was detected.\n. Does not use FuckAdblock.js\n. @sominlee74 Does the script work after the merge?\n. This repo is just a reference implimentation of a technique to counter FuckAdBlock.js. It doesn't look like http://moonbit.co.in is using FuckadBlock.js and is thus not supported.\n. This script is only a reference implimentation for bypassing fuckadblock.js and is not a general purpose anti-anti-adblocker. So I'll not be implementing any other anti-anti-adblockers.\n. Forbes doesn't use FuckAdblock. This repo is just an implementation for bypassing one specific anti-adblocker. \n\n```\n\n\nwindow.location.toString()\n<< \"http://www.forbes.com/home_europe/\"\nwindow.fuckAdblock\n<< undefined\n```\n. good idea since this is a reference implementation.\n\n\n-------- Original message --------From: \"Robert A. Heiler\" notifications@github.com Date: 30/11/2016  17:32  (GMT+01:00) To: Mechazawa/FuckFuckAdblock FuckFuckAdblock@noreply.github.com Subject: [Mechazawa/FuckFuckAdblock] Links (#27) \nNot sure if you want to add this but perhaps the main readme could also show some other links to similar projects - it may help people who want to know more about those trying to bypass adblockers in general. (I only found this project here via links from reddit btw, not even via google search or another search engine.)\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n{\"api_version\":\"1.0\",\"publisher\":{\"api_key\":\"05dde50f1d1a384dd78767c55493e4bb\",\"name\":\"GitHub\"},\"entity\":{\"external_key\":\"github/Mechazawa/FuckFuckAdblock\",\"title\":\"Mechazawa/FuckFuckAdblock\",\"subtitle\":\"GitHub repository\",\"main_image_url\":\"https://cloud.githubusercontent.com/assets/143418/17495839/a5054eac-5d88-11e6-95fc-7290892c7bb5.png\",\"avatar_image_url\":\"https://cloud.githubusercontent.com/assets/143418/15842166/7c72db34-2c0b-11e6-9aed-b52498112777.png\",\"action\":{\"name\":\"Open in GitHub\",\"url\":\"https://github.com/Mechazawa/FuckFuckAdblock\"}},\"updates\":{\"snippets\":[{\"icon\":\"DESCRIPTION\",\"message\":\"Links (#27)\"}],\"action\":{\"name\":\"View Issue\",\"url\":\"https://github.com/Mechazawa/FuckFuckAdblock/issues/27\"}}}. ",
    "Fordi": "Heh.  How about adding:\nemitEvent: function () {\n    if (Object.keys(Array.prototype).length) { \n        throw new Error(\"Hey, look, I'm FuckAdblock and I was written by a total n00b!\"); \n    }\n    /* ... */\nShould throw 'em off.\n. ",
    "SERVCUBED": "The first site uses the class name 'blockAdBlock' instead of 'FuckAdBlock,' which causes this script to not work. \nThe second site doesn't use FuckAdBlock. It uses a script with the URL https://chekalskiy.ru/adblock-detection/advert.js to set a variable to show an adblocker isn't enabled. Most adblockers block this URL because it contains the word 'advert.'\n. ",
    "CptSpaceToaster": "Installed locally: \n\nStill detected here: http://fuckadblock.sitexw.fr/\n\nWould you rather continue this issue?  or start anew?\n. I installed via Tampermonkey, it now functions as expected.\n. ",
    "5Strogino": "Yeah. I used this script via Tampermonkey.\nSo. I though that script is more powerful and can be used on different sites. I did not know what this script only avoids his brother FuckAdBlock script and nothing else.\n. ",
    "lundell": "NP, thanks for the script. :)\n. ",
    "NuxRo": "Hi,\nWhat is that and how do I check?\n(I'm not a coder)\n. Yes, it exists.\n. ",
    "RevanProdigalKnight": "When Firefox is open, press F12 or CtrlShiftI to open the Developer Tools. Then go to the Console tab, or press Esc to open the split console. Once in the console tab/split console, you can click the bar at the bottom and start typing, at which point Firefox will start to autocomplete options. If you type any portion of window.fuckAdBlock and the autocomplete pops up with it, then it exists. Otherwise, it does not exist, and there may be a problem with your installation of it.\n. Okay, messing around in the console on sitexw.fr with FuckFuckAdblock installed, it looks like it's actually working, but for some reason the callbacks aren't executing when it does the check....\nAfter manually setting resetOnEnd to false and setting the listener functions again, it came up green with the \"Adblock not detected\" message.\n. ",
    "shepelevstas": "Still not working on the test page https://fuckadblock.sitexw.fr/. ",
    "majatu": "for example in firefox view-source:http://vod.apollocdn.cc/video/92739f78a8cf9f79/iframe at the end of html source\n. ",
    "Kioshi": "Oh, thanks i will do that.\n. ",
    "WaKeMaTTa": "I did make the pull request for you.\n. It works for me on http://moonbit.co.in/\n. Commented this live because variable self is defined twice.\n. ",
    "sominlee74": "@Mechazawa Hi. The current code is working well for me. Thanks.\n. ",
    "AGritsevich": "@Mechazawa, ok. thank you.\n. ",
    "ylluminarious": "+1. @DaanBiesterbos You're not wrong. Ads are helpful in making money for the vast majority. It is self-evident and no one is arguing against it. But I, as my own person, have a right to block any content on my computer that I do not want to see. Even if it's on someone else's website.\nSure, maybe that hurts the economy somewhat. Maybe it makes life a bit harder for some people. But maybe I don't want to see smut just because it makes someone money. Maybe I don't care about any products when I'm trying to work and earn a living myself. Maybe I don't like the invasive nature of most ads which collect undue information about me and my system.\nIf I am that way, I am totally within my rights. If I purchased a newspaper in real life and hired someone to tear out all the ads for me before I read it, that is also within my rights. Maybe it hurts some businesses. But I have a right to not see ads on my own purchased newspaper (or device).\nIf you don't like that, fine. You're also within your rights. But people who use adblockers are in the minority anyway. Most people see ads whether they like it or not. If I were on the receiving end of an adblocker, I wouldn't like it but I would also be sympathetic to them. At the end of the day, this is why people need to diversify their income sources. If you're so reliant on ads that it cripples your business when people block them, you need another way to make money with your service. If you can't do that, then you honestly need to rethink your business model. This doesn't just apply to ads anyway; this is just a generally good principle for businesses to follow.\nI wish you a wonderful day as well.. ",
    "sitexw": "+1. ",
    "AxDSan": "+1. ",
    "DaanBiesterbos": "Everyone loves to get stuff for free. It is funny how people miss the point of why they get stuff for free. Do not get me wrong, I am all for legislations, and getting rid of spam. Which is indirectly already happening because search engines are bitch slapping spammy websites down the search results. But within reason there should be some acceptable middle ground. Writing interesting content? Costs money. Marketing? Costs money.  Hiring developers and maintaining a website? Costs a lot money.  So considering all ads as spam is morally wrong. Consider them as a trade off for all a lot of stuff you get for free while browsing the internet. Because where do you think the revenue will come from if it not from advertisements? No company will spend money if there is nothing to gain. How would a world without ads look like? I guess waaaaay more articles that exist only to convince you to buy some product.  Now I prefer to ignore a few ads over wasting my time reading articles half way just to conclude that this is yet another empty article written to convince me to do a particular thing. You already see it happening.  At least some ad is easy to ignore.\nMy personal view on this? If you don' t like ads, than don' t use the website. Spammers are already being targeted heavily and luckely have no bright future on the web. But the websites you are enjoying are investing more than you realize in the stuff you are consuming for free. Yet you are not giving anything back. Claiming otherwise is naive and selfish. You don' t need to take my word for it. Everyone should realize that the ability to earn money is essential is this world. Very little comes for free. I challenge you to think about how the internet would work without ads.  Where will the money come from? \nI am glad this plugin does not work. Because websites should at least be able to measure how many people are not paying and are entitled to make business decisions based on numbers. Don' t forget, it is their website. Not yours. Is the website no longer free to use? Than don' t complain either. You are part of the reason why. \nI wish you all a wonderful day none the less.. I agree with you. And you are right. I completely agree that everybody has a right to choose whether they want to see ads. I am not saying I don' t like it when people don' t see ads. I am worried about the consequences, and there will be consequences when accurate information is no longer profitable.\nThere is always someone making money. Directly, indirectly it does not matter. What matters is the intent of the authors of that content. No employee is going to write about the competition because they know that their product is much better, perhaps cheaper as well.\nI do truly believe that most do underestimate the long term results of this. I love freedom, and I love to get accurate, unbiased (as much as possible) information. I worked for large and small companies. Which is why I am worried. I love the whole content marketing idea. But it works becaus competition challenge other websites to deliver relevant and mostly accurate information. And from my angle, you are much better off reading a blog from some industry expert than relying on the SEO optimized bulk that large companies will give you. Rolling out of their highly optimized content factory at whatever department. Time is money. And even if the content is relevant and interesting. It is always written with a certain intent. They want -you- to do something with it. Revenue trumps accuracy. Leaving out important information is not lying. Plain and simple. Is there a better alternative? Or a free solution that would do the job? Nope. Generally you won' t hear about it from them.\nIt is the future of the internet I am worried about. The reliability of what you see and read. Nothing is free, although sometimes it looks that way. There are exceptions but in most cases..... Investments must lead to revenue or you have no business. So who is earning money if you don' t see ads?\nWho would invest large amounts of money in the website when there  is nothing to gain from providing accurate information.  And in the end, who would you trust more? A big organisation giving you their solution. Or a website that gives you more options and gives you relevant and unbiased information from other angles? Running a website and writing quality content is expensive. Very expensive. I am not talking about yet another wordpress website. I am talking about small and midsize companies. High traffic websites, serious server and software development costs and competent employees that work on websites that earn revenue by providing better information. What would happen to those companies?\nEither their services won' t be free anymore, they would turn to affliate marketing impacting the subjects they write about or they will disappear don't you agree?  (or perhaps sold and turned into some marketing channel)\nTo me ads like are taxes. Nobody likes them. Some might get away with avoiding them. But if everybody would do it.................  So yeah hiding them is your right. But it is ignorant to expect companies to deliver high quality and unbiased information for free.  I highly doubt anyone \"likes\"  to see advertisements.. ",
    "Fifoo": "Github isn't a website for political discussion I think. But in this case: Advertisements are manipulative, they go in from an angle of \"we need to manipulate people to buy our stuff\". In an optimal situation people decide they need something and then look up where to best buy it either by research or by word to mouth. Ads treat people like dumb mindless animals, which is contradicting the individualist narrative of the whole free-society story. It's the perfect example of people saying the one thing and doing the exact opposite hoping that no large enough quantity of people are going to catch on. You want to compete in quality, not in how good you are at getting a herd of people to fall for your marketing.\nThe advertisement thought tries to foster mindless consumption instead of trying to progress reasonable autonomous premeditated purchases, it's all without shame or sense of responsibility. \nJust because Ads are pretty much the only way for small websites to run \"for free\" doesn't mean that it's fine, it just means that there is an urgent need to come up with an actual alternative. Aslong that is the case, I am fine with reserving my right to not look at flashy ads that try to make me wanna buy things I definitely don't need and definitely will never buy. (I might even decide to never buy something based just on the fact that they do internet advertising). "
}