{
    "mrn3": "+1\nI noticed this problem too\n. +1\n. I would love this feature too - is anyone working on it?\n. ",
    "nickw": "Yep, agreed.\n. Yeah that looks great.\n. @dennisharrison Cool - what's the thinking behind storing the history in a collection rather than just using the browser API? Have you done anything around actually swiping to go back? If so, does it actually slide the page at all? Or just immediately go back?\n. @dennisharrison any help we can get would be much appreciated! I'm definitely open to trying GSAP.\n. @dennisharrison sounds good. For some background:\nI haven't done any 'scientific' testing around frame rates or anything, but in my experience most of the animations are pretty smooth using CSS animations, the problem seems to be mostly with transitioning between routes using _uihooks - especially when a route relies on data from the server to be rendered. \nFor instance, the routes in https://github.com/meteoric/demo seem to slide back and forth pretty smoothly, but the templates are all static content. \nMost of the complaints seem to come from https://github.com/meteoric/meteorhunt and https://github.com/meteoric/contacts where the routes are dynamic and the transitions can get pretty laggy. My assumption is that it is caused by Meteor and/or iron:router loading data at the same time the routes are being animated.\n. ionNavView is responsible for sliding the \"pages\": https://github.com/meteoric/meteor-ionic/blob/master/components/ionNavView/ionNavView.js#L29\nionNavBar handles animating/fading the titles and buttons: https://github.com/meteoric/meteor-ionic/blob/master/components/ionNavBar/ionNavBar.js#L27\nBoth of these just add/remove CSS classes from the elements, the CSS framework does the heavy lifting: https://github.com/meteoric/ionic-sass/blob/master/stylesheets/_transitions.scss\n. This post might have some good info for us:\nAnimating the Mobile Web\n. @dennisharrison awesome - looking forward to it!\n. I think we can narrow this down to three issues:\n1. Flickering\nA known issue: http://nathanhoad.net/how-to-stop-css-animation-flicker-in-webkit. Adding this CSS seems to fix it, but I'd like to get a second pair of eyes on it:\n.view {\n  -webkit-backface-visibility: hidden;\n  -webkit-transform-style: preserve-3d;\n  backface-visibility: hidden;\n  transform-style: preserve-3d;\n}\n2. Jittery / staggered transitions\nI've been able to confirm that the occasional choppy or staggering transitions are definitely caused by Iron Router's waitOn and data. If the data property loads immediately, the transition is seamless, but if there's any delay at all, the initial view will transition out, then there will be a noticeable delay before the new view transitions in.\nI'm looking into implementing template-level subscriptions, which appears to fix the issue, but this technique doesn't play well with block helpers. We may have to wait for the official template-level subscriptions or this PR to be released.\n3. Low frame rate\nI think this is primarily on Android. Not sure what the solution is yet.\n. @dennisharrison re: # 3 it's my understanding that CSS animations are almost always going to be more performant (especially on mobile platforms) than JS-based animations, so while I'm skeptical, I'm certainly open to give it a try (I also don't have any better ideas at the moment). \nSo if either GSAP or Velocity fix the animation issues definitively I don't have a problem including them with this package.\n. > Can you merge the PR from Digilord to fix up the data binding for the position of header buttons if it hasn't been fixed in 1.13?\nI'm not sure which PR that is - can you link to it?\n\nAlso I notice someone saying that 1.13 is not working them on iOS and Android? Is that reproducible on your side?\n\nNope, working fine for me - you have a link?\n. > Can you merge the PR from Digilord to fix up the data binding for the position of header buttons if it hasn't been fixed in 1.13?\nAh I see it now, that issue was fixed a while back.\n\nAlso I notice someone saying that 1.13 is not working them on iOS and Android? Is that reproducible on your side?\n\nOk yeah that's #78, I've heard it's an issue for several users but I can't reproduce. For some reason it isn't finding the Cordova plugin com.ionic.keyboard/1.0.3 - which definitely existed at one point. Upgrading the dependency to 1.0.4 should fix it.\n\nWe also added in hammer.js for gesture control (went through 6 methods before finding something simple and worthwhile), but I want your input on that before trying to package up for meteoric.\n\nLet's move that discussion to #2 \nLet me know when you think you'll have a chance to create a PR for animations. If it's not going to be today I'd like to go ahead and push a new release to Atmosphere to fix some of these other issues.\nThanks!\n. Potential 3rd party component to utilize: http://owlgraphic.com/owlcarousel/\n. Ended up using https://github.com/kenwheeler/slick/\n. Yeah it's as close as I think I can get it in Meteor. The basic API is:\n{{#ionSlideBox}}\n  {{#ionSlide}}Slide 1{{/ionSlide}}\n  {{#ionSlide}}Slide 2{{/ionSlide}}\n  {{#ionSlide}}Slide 3{{/ionSlide}}\n{{/ionSlideBox}}\nThe available options you can pass to ionSlideBox are:\n- doesContinue\n- autoPlay\n- slideInterval\n- showPager\nThere's also an onSlideChanged event that you can listen to in your parent template:\nTemplate.tutorial.events({\n  'onSlideChanged': function(event, template) {\n    Session.set('currentSlideIndex', event.index);\n  }\n});\n. Well I think we want to mimic Ionic's native-inspired design, which we get for free by including their CSS framework, so I'm not sure sweetalert really buys us anything. But thanks for the suggestion.\nIf anyone's interested in implementing this component themselves, take a look at the action sheet component to see how a similar component is implemented.\n. Ah right, it's in 0.1.17 on Atmosphere. Closing this.\n. It should be pretty straightforward unless something is broken. What isn't working for you specifically?\n. Ah right, contacts comes from the route: https://github.com/meteoric/contacts/blob/master/both/router.js#L10\n. Correct. The current ionList and ionItem components are just HTML wrappers right now.\n. Awesome work @koolaid1551 - really excited to see this get implemented.\n\nusing slip.js\n\nWell we're already using snap.js and slick.js, so slip.js seems like a good choice :)\n\nI am currently relying on a few classes to be apart of each list '.list' and list items '.item-content'. I am hoping to find a cleaner way of accomplishing this(potentially create a few more components)\n\nHmm yeah that does seem less than ideal. Maybe take a look at how Ionic is doing it, I think they are automatically detecting and adding those classes.\n\nTo show hidden options I believe I am going to have to modify slip.js to reveal options beneath a list item.\n\nCan you clarify what you mean by \"hidden options\"?\n\nhttps://github.com/koolaid1551/contacts\n\nOne small bug I noticed here is that when I drop an item after reordering my click registers and navigates to the item's routes.\nBut yeah, this seems like a great start. Let me know when you think it's ready for a PR and take a closer look at it.\n. @jorjordandan sounds good - go for it!\n. Initial implementation in: https://github.com/meteoric/meteor-ionic/commit/015341d0192408578708dccf80dc86345d1d1e61\n. @ccorcos do the example apps help in the meantime? If not, I'll try to write something up tonight or tomorrow:\nhttps://github.com/meteoric/contacts\nhttps://github.com/meteoric/meteorhunt\n. Ok guys, here's something quick I whipped up: https://github.com/meteoric/meteor-ionic/blob/master/GUIDE.md\nLet me know if it's helpful at all, and what else you'd like to see.\n. @rjakobsson can you add a new issue for this? I'm not sure how it's happening since we're grabbing the backUrl directly from the template options, and falling back to history.back() see the code here. If you can post some code in that issue that would be awesome.\n. @benstr wow looks great\n. Thanks @Slava \n. Possibly, but it might make things harder to maintain / understand. I'm fine with leaving it as-is for now, but feel free to suggest some solutions.\n. Hmm that's strange, no idea what that would be. What does the --debug option do exactly? What version of the package is getting installed on Modulus?\n. @maabed any luck with this? I deployed my first meteor-ionic app to Modulus last night and didn't experience this.\n. Hmm, what version is specified in your .meteor/versions file?\n. Update: I was able to get a Nexus 4 running Lollipop for testing. Here's what I've found:\nThe Contacts example and Meteor Hunt are both pretty laggy when it comes to navigation transitions and modal transitions.\nThe Demo App seems pretty good.\nI think the difference is that the Demo app has mostly static templates/data, while the other two examples are using real data.\n. I pushed some minor improvements related to Android animations earlier this week (but haven't released a new version on atmosphere yet). Also @dennisharrison is working on some general animation-related performance issues in: https://github.com/meteoric/meteor-ionic/issues/4.\nI'm not sure exactly why it's so much slower on Android (although I've noticed everything on Android is pretty clunky compared to iOS), but I'm confident we'll be able to get it fixed.\n. @dennisharrison ok great, thanks for the update. \nIf I get time I'm going to experiment with using -webkit-transform-style: preserve-3d; to get rid of the flicker. \nIn general, I'd love to be able to solve these issues with standard HTML/JS techniques like requestAnimationFrame as opposed to adding a large dependencies like GSAP, but at this point whatever works is good enough for me.\n. Did some digging on my own this weekend and updated here: https://github.com/meteoric/meteor-ionic/issues/4#issuecomment-73446896\n. Here's a graphic that explains why we can't rely on URLs to set the current tab but instead have to use a Session variable. Notice the active tab for each of the routes:\n\n. I'm not sure I understand the question, you should be able to put a menu on only one side like this:\n{{#ionBody}}\n  {{#ionSideMenuContainer}}\n    {{#ionSideMenus}}\n      {{#ionSideMenu}}\n        side menu content\n      {{/ionSideMenu}}\n    {{/ionSideMenus}}\n    {{#ionSideMenuContent}}\n      // your apps content, tabs, headers, etc:\n      {{> yield}}\n    {{/ionSideMenuContent}}\n  {{/ionSideMenuContainer}}\n{{/ionBody}}\nLet me know if that doesn't work.\n. Can you explain what you mean by \"having two side menus\"?\n. Ah I see what you mean. We're using Snap.js under the hood, so I'm not sure if that's just the way it works, or if we have to set a configuration variable, or what. Feel free to take a look at their docs, otherwise I'll take a look in the next few days.\n. Hey guys,\nI just added this commit which allows you to pass a side option to the ionSideMenuContainer component like so:\n{{#ionSideMenuContainer side=\"left\"}}\nor\n{{#ionSideMenuContainer side=\"right\"}}\nor\n{{#ionSideMenuContainer side=\"both\"}}\nand it will take care of disabling the correct side for you.\n. Hmm yeah I haven't tried to do this yet. I think because of the way iron:router works, you'll have to configure a loading template, and then perhaps do your IonLoading calls in the rendered and destroyed callbacks of that template.\n\nAlso, can you guys refactor so that we don't have to send an object into the show method? That way we can just do IonLoading.show(). Currently, doing that will throw an error because the delay property is not found.\n\nYeah, good call. Can you open a second issue for that?\n. I've realized that using iron:router's waitOn and data features don't fit well with the way mobile routes are supposed to animate. iron:router takes a very traditional, server-side approach to rendering templates (wait until all the data is loaded, then render), whereas mobile apps and modern web apps take a more fine-grained approach and render pieces as needed (see Sacha's blog post on template-level subscriptions).\nI've implemented a pattern in the meteoric example apps (see this commit in the contacts app) that works much better by allowing the template to be rendered an animated to immediately (no choppiness) while showing a loading spinner and loading the data on demand. \nOnce template-level subscriptions are supported in the Meteor core, I can remove a lot of the boilerplate from this pattern, but in the meantime I wouldn't recommend using waitOn with meteor-ionic.\n. Thanks Robin!\nYes, you should get that functionality \"out of the box\" with no extra work in the latest version of meteor-ionic. Let me know if that is not the case.\n. Hmm, I'd be open to a PR for this, but I personally don't have a use for this functionality. One of my primary motivations for building meteoric was to be able to build \"cross platform UIs\" that look appropriate on Android as well as iOS.\n. > If a title is always left-aligned, it assumes that Androids don't ever have a top-left button? Or if they do, then there's no title? How would you advise?\nFor now the left button will just show up to the left of the title (like the back buttons do).\n\nFacebook pushes all buttons to the right. Interesting.\n\nYeah, I haven't tackled the \"all buttons on the right\" feature for Android yet. It's on my todo list.\n. Yeah that's what we're doing now actually, but it seems like it's more common for Android apps to have all the buttons on the right (except for back buttons and hamburger menus).\nHere's an app I'm working on right now:\n\nAnd here's the Meteor Hunt app on Android:\n\nI think in the Meteor Hunt case, it would be better if the search icon was on the right.\n. Yeah that would be amazing!\n. Yeah I think that looks good! Have you tested this new version?\n. We are currently using the SASS versions of the Ionic framework that can be customized using SASS variables, as opposed to the static/minified CSS versions which would require you to manually overwrite CSS rules. It looks like your suggestion is using static CSS?\n. The advantage to using the SASS version is that you can customize the output of the SASS using variables rather than overriding / duplicating CSS. e.g. with one line of code $positive: #2196F3; you can change the color of dozens of UI elements.\n. Do you have an ionHeaderBar or ionNavBar in your layout?\n. Ah that's not currently possible. Personally I prefer to allow the platform to determine the tab location (Android on top, iOS on bottom), but I'm open to a PR that allows more flexibility.\n. Ah interesting. We could create an ionButton component pretty easily. Or, I've been putting all global event handlers on the ionBody element, so we could add your listener there. Are there any downsides you can think of to either approach?\n. Works for, feel free to create a PR for this. I may not get to it until this weekend.\n. Ah I see you added it with the multi-modal PR. Looking at that now…\n. Closed in https://github.com/meteoric/meteor-ionic/pull/38\n. Hmm that's a bummer. The only thing I can think of would be to make myCustomHelper into its own template and move myCustomProperty there. Hopefully someone with more knowledge can chime in with a more Meteor-like approach.\n. @benstr @spencercarli can you guys take a quick look and see if this was one of your PRs? \n. @dancering I just published 0.1.11, let me know if you are still experiencing this after updating.\n. Ah good question, haven't had that usecase myself yet.\nWe are currently skipping transitions when using tab navigation, we just set IonNavigation.skipTransitions = true; in a click handler:\nhttps://github.com/meteoric/meteor-ionic/blob/master/components/ionTab/ionTab.js#L25\nI think you could do the same in your sidemenu.\n. Yeah I think we'd just need a resize listener (probably attached to ionBody) that manually opens the side menu once the viewport reaches a certain width.\n. Yeah, I'd love to see someone create a PR for this as I can definitely see how it would be useful. I don't have the time/need to do it myself right now, but may be able to in a few weeks. Here are some thoughts I have:\n- It should definitely hide the corresponding \"hamburger\" button when the window is wide enough to expose the sidemenu.\n- I think this could be implemented in either ionBody or ionSidemenuContainer\n- It would be great if it could work on both the left and the right side\n- Maybe it should disable snap.js altogether when wide enough and override the CSS, rather than trying to fight with snap.js\n. Yeah I think ionSidemenuContainer is best if possible. I'd prefer not to pollute ionBody more than necessary.\n. I don't think so. I probably won't work on it until I need it for an app.\n. Yeah, that's actually a really good example of a simple component that can easily be re-created in meteor - so I went ahead and did it :) Let me know if this works out for you: http://cl.ly/0W2P0A3l3o2U. I think the code is actually a lot cleaner and more flexible than the Angular code, too.\n. The way ionic works is that the ionContent component has to know about which components are above or below it. If you use the built-in ionTabs, ionHeaderBar, ionFooterBar, etc components, the ionContent component will automatically have the necessary has-tabs, has-header, etc classes.\nSo in your case, you can either use the ionTabs component, or just add the necessary class to your ionContent like so:\n{{#ionContent class=\"has-tabs-top\"}}\n. Nope not really. I just try to mimic the Ionic APIs as close as possible and ideally not add any custom CSS. You can look at the way I implemented ionActionSheet to see how ionPopup might be implemented. For the slidebox I was probably just going to look for a good 3rd party plugin to include the way I did for the side menu stuff.\n. @dcsan have you seen #5? Or is this statement in reaction to #5?\n. @dcsan sorry I was confusing snap.js with slick.js :)\nTo get around snap.js dragging, you can also add a data-snap-ignore attribute to any element or container.\n. No, it's not the desired behavior. We are constantly fighting with meteor over the this.data property inside templates. I'll just need to sit down and figure out a global fix for this in all the components. However it's very strange that I haven't yet experienced this issue once in any of my apps or demos.\n. Thanks for the reproduction:) I just pushed something that should fix it - let me know!\nSent from my iPhone\n\nOn Jan 31, 2015, at 12:51 PM, Encontrando a Meteor notifications@github.com wrote:\nThanks for the reply @nickw\nI'm using Meteor 1.0.3.1 and I tested this on Chrome 40.0.2214.94 (64-bit) and Firefox 37.0a2 (2015-01-21)\nI created this repo to reproduce the issue: https://github.com/findingmeteor/minimal-meteroic\nI hope it helps\n—\nReply to this email directly or view it on GitHub.\n. This is expected behavior and is an issue with the way Meteor handles assets in packages. See the disclaimer here: https://github.com/meteoric/ionic-sass#installation\n\nYou need to add the following packages along with meteor-ionic to get the correct styling:\nmeteor add fourseven:scss\nmeteor add meteoric:ionic-sass\nWe are using Ionic's CSS framework, which is written in SASS, so Stylus or Less aren't options.\n. Yeah, this is an issue with fourseven:scss https://github.com/fourseven/meteor-scss/issues/60\n. @dcsan I'm not sure what stylus has to do with it? We need to stick to whatever preprocessor Ionic is using so we don't have to convert the files. I think there are other, possibly better, SCSS solutions for Meteor. Feel free to investigate. I haven't hit this issue yet, so I haven't tried to fix it yet myself. Alternatively you could just manually put all the scss files in your app for the time being.\n. > it's a smooth sailing alternative to using the hot mess of sass compilers\nWell, so is Less ;) Which is why I was wondering why Stylus kept entering the discussion. But yes, I absolutely agree that we need to figure out better, cleaner SCSS support.\n\nso how do you avoid these issues?\n\nSince I haven't experienced them myself, I'm not sure yet.\n. @dcsan yeah the demo app has an example, I think you're just missing ionSideMenuContainer.\n. #31 and #27 seem to be related to this, but I'm totally stumped on what's causing it and am unable to reproduce.\n. Yeah I haven't published a new version yet, will do ASAP.\n. There's a few things going on here:\n1. has-badge is a CSS class, not a style option:\n   {{#ionTabs style=\"ios has-badge\"}} should be {{#ionTabs style=\"ios\" class=\"has-badge\"}}\n2. I think badge=\"{{badgeCountHelper}}\" should be badgeNumber=\"{{badgeCountHelper}}\"\n3. badge-style=\"badge-assertive\" hasn't been implemented yet, but probably needs to be.\n. Yes, the entire Ionic CSS framework is bundled up into the meteoric:ionic-sass package:\nmeteor add fourseven:scss\nmeteor add meteoric:ionic-sass\n. Hi Chris,\nCan you give me some background on this? Is drag-content something from Ionic? What is the expected behavior?\nThanks,\nNick\n. Ok guys, you can now pass a dragContent option to ionSideMenuContainer like so:\n{{#ionSideMenuContainer dragContent=false}}\n. Yeah I noticed that too in one of my projects, I had to add this CSS:\n.tab-item {\n  // Ionic bug, needed to position badges:\n  position: relative;\n}\nHowever I just looked and Ionic has this CSS rule:\n.tab-item.has-badge {\n  position: relative;\n}\nSo I think we should automatically add the has-badge class in meteor-ionic if you pass a badgeCount option.\n. I'm very curious to why this is happening in the first place. My understanding was that this.data in a template callback referred to the options passed to the template (e.g. {{> myTemplate option=\"value\"}}) - and it appears it is most of the time - but sometimes this.data also refers to iron:router's data property?\n. Nah I gotcha - and will most likely merge this - I just felt like there was an underlying issue we are missing and this is just a temporary fix. Hoping somebody with deeper meteor knowledge can weigh in. I may post an issue on the meteor and iron router repos. \nSent from my iPhone\n\nOn Jan 27, 2015, at 5:22 PM, D. Allen Morrigan notifications@github.com wrote:\nFrom the testing I did if this.data was null the error would occur. So checking for existence helped get rid of the error.\n—\nReply to this email directly or view it on GitHub.\n. Unintentionally fixed this in adccb0a988bc1bc978618b1bc0ef052641e8c09c\n. You would probably do it the way you would a normal checkbox, just use a template helper to save the state and toggle the checked attribute.\n. Yeah, that should work. \n\n@benstr any thoughts on this?\n. The entire purpose of ionNavBar is to dynamically display titles and buttons based on routes. If you want a static bar you will want to use a ionHeaderBar.\n. Closing this in lieu of #60 \n. Ah yeah I haven't come across that use case myself, so haven't implemented it. For now I would probably just throw something in the rendered callback of that template that hides the header:\nTemplate.myTemplate.rendered = function () {\n  $('.bar-header').hide();\n  $('.content').removeClass('has-header');\n}\nThen you might have to reset them when you leave:\nTemplate.myTemplate.destroyed = function () {\n  $('.bar-header').show();\n  $('.content').addClass('has-header');\n}\nI'll see if it's easy enough to add this to the core.\n. No, we're not using Ionic's scrollView.js functionality, we're just using -webkit-overflow-scrolling: touch; for now.\n. Yeah I've noticed this particularly in modals. I believe it's something to do with native keyboards, and Ionic has a Cordova plugin that will probably fix it: https://github.com/driftyco/ionic-plugins-keyboard.\n. I don't think this has anything to do with Meteor 1.0.3.1, it sounds like 2.0 version of fourseven:scss has possibly changed the way it handles import paths. For now we only support the 1.x version of fourseven:scss.\n. I'm not sure this will be possible to do dynamically since we can't currently read the current status bar style in order to revert to it.\nInstead, I think it might be better to just provide callbacks for IonModal.show() and IonModal.hide() and allow devs to change the status bar style themselves.\n. This was fixed over the weekend but I haven't pushed a new version to Atmosphere yet. I'll plan on doing that today, but in the meantime you can symlink the repo into your packages directory if you want.\n. Yeah, it is a dependency in meteoric:ionic-sass, I have an issue open to remove the dependency: https://github.com/meteoric/ionic-sass/issues/1\n. Here ya go: https://github.com/meteoric/demo\n. :)\n. Check the version of meteoric:ionic in the .meteor/versions file. It sounds like they have an old version.\n. Yes, we do that so you can customize the framework using scss variables as intended.\n. Looks like we can use document.addEventListener('backbutton', function(event){});\n. Yep, thanks @maersu !\n. Hmm that's strange, I haven't encountered that yet myself. Does this happen in the Contacts app as well? Or in Ionic's docs?\n. Hmm, I'm not sure why it's not finding 1.0.3 of this plugin: https://github.com/driftyco/ionic-plugins-keyboard\n. @maersu no, others are experiencing the issue too. It looks like v1.0.3 got removed for some reason. I'll be pushing 0.1.14 today that will depend on ionic-keyboard 1.0.4\n. Ok guys, v 0.1.14 has been published.\n. We're currently achieving this same functionality in an app by just changing/animation the scrollTop property of the relevant content area.\n. Hey @dcsan - thanks for the PR. However, I like to stay away from ids as there are too many possibilities of conflicts. You could accomplish the same thing by passing a class like messages-container - that's what we're doing in our app. Either way, I plan on implementing a feature to allow you to pass any attributes (id's, data- attributes, etc) to all meteor-ionic components (https://github.com/meteoric/meteor-ionic/issues/60) that would accomplish the same thing. If it's ok with you I will close this and defer to #60.\n. Ok cool, closing for now…\n. Ah no I haven't. For now I just manually pass a text attribute to ionNavBackButton and set the back text manually. This seems to work fine 90% of the time.\nI think the component we'd want to replicate is the ionicHistory service. It looks like @dennisharrison may have started something here: https://github.com/meteoric/meteor-ionic/issues/3#issuecomment-74607917\n. We (Differential) are using it on a large client project right now and haven't run into any issues with it yet. The client is very happy with how \"native\" it feels and is now converting another app from Bootstrap to Meteor-Ionic.\n. You can do that, you'll just want to use a standard Meteor event handler and toggle it there:\n'click .hide-footer': function (event, template) {\n  $('.footer-bar').hide();\n  Session.set('hasFooterBar', false);\n},\n'click .show-footer': function (event, template) {\n  $('.footer-bar').show();\n  Session.set('hasFooterBar', true);\n}\n. Swipe cards won't be a part of meteor-ionic unless they become a part of official Ionic. My recommendation would be to use https://github.com/gajus/swing - it should integrate with Meteor just fine.\n. Oops, yeah it looks like PR #73 from @fpoirier1 forgot to allow passing a custom barClass. @fpoirier1 would you be available to add that as a new PR?\n@rizkysyazuli in the meantime you can do something like this:\n{{#ionModal customTemplate=true}}\n  <div class=\"bar bar-header bar-energized\">\n    <h2 class=\"title\">Products</h2>\n  </div>\n  <div class=\"content has-header overflow-scroll\">\n    ...\n  </div>\n{{/ionModal}}\nAlso I believe focusFirstInput is now true by default, so you can save a few keystrokes on that.\n. Hmm are you running the latest version (0.1.14)?\n. Can you post your template code?\n. Yeah, that's very strange, I'd definitely be interested in seeing your code. My bitbucket username is nickwientge.\n. > Hmm are you running the latest version (0.1.14)?\n\nyep. just updated. still the same. if you need me to provide any other info. just let me know.\n\nYour app is showing 0.1.12 in .meteor/versions - I updated it and it works fine.\n\n. Nice looking app btw :)\n. Yeah, I'm not sure why Ionic uses a custom attribute on the parent element like that, you can just add title-left, title-center, or title-right classes directly to the <h1> element itself.\n. Which version of meteor-ionic are you running? Can you post a screenshot or some template code?\n. Hmm, is that in Chrome's emulator? The content area is supposed to shrink to make room for the keyboard, that is expected. However I'm not sure why you aren't seeing a keyboard?\n. > It's like the whole app is resized for the keyboard to appear under it's container.\nCorrect, that's the intended behavior. Without that the entire web view gets pushed up off the screen, pushing your fixed headers and other content out of view. This technique keeps everything in place, but shrinks the size of the viewport. This is the way Ionic and native apps work as well.\nHowever I've only recently implemented this feature, and have only tested it on forms inside of modals - and only on iOS, so perhaps you've discovered a bug that I haven't.\nI'm still not 100% clear on the issue you are experiencing. In the second screenshot why is the device smaller? Where is the keyboard?\n. Hmm, can you break these out into 2 separate issues - since they appear to be unrelated?\nHere's how I'm understanding it:\nIssue # 1: iOS inputs don't scroll into view if they are below the keyboard\nThis seems like a quick fix using setTimeout\nIssue # 2: Android keyboard pushes the entire UI out of view\nThis seems like an issue of just getting the Cordova settings right or something. Have you looked to make sure it's not an issues with the Ionic Cordova Keyboard plugin? There seems to be several open issues related to Android there.\n. @elGusto @lispur I was just testing Android and experienced this myself. I disabled all the keyboard detection stuff on Android and it seems to work fine, so maybe it was only necessary on iOS.\n. Yeah, that Hackpad is the way to go. I haven't tried it yet myself though.\n. Interesting, we're having a similar issue with Chrome not repainting our UI when using HTML5 video elements and WebRTC calls. Seems like they might be related. We'll dig into it this week.\n. You should be able to do something similar to #83 \n. Right, that's what the Session variable is responsible for. In your case I think you would need to toggle Session.set('hasTabs', false); and Session.set('hasTabs', true);\n. Wow great work! I'll do some testing and get it merged in ASAP. Thanks!\n. Yeah, my thinking was that this way users could bring their own version of Ionic - or use a different preprocessor - if they wanted. Might revisit this later based on user feedback.\n. @wrannaman No, I haven't seen that yet. Will try to test soon.\n. Yeah we don't necessarily have a 1:1 mapping between Ionic components due to various differences between Meteor and Angular. You'll want to check the list of components before attempting to implement one: https://github.com/meteoric/meteor-ionic/tree/master/components\nFor what you're trying to do you can just use iron:router regions inside your templates: https://github.com/meteoric/meteorhunt/blob/master/client/templates/products/productsShow.html#L3-L15\n. Yes, just add data-keyboard-attach to the element: https://github.com/meteoric/meteor-ionic/blob/master/components/ionKeyboard/ionKeyboard.js#L50\n. Unfortunately not until I get around to implementing #60. In the meantime here's what I'm doing in my app:\n<div class=\"bar bar-footer bar-stable\" data-keyboard-attach>\n  <form class=\"item-input-wrapper form-send-message\">\n    <input type=\"text\" placeholder=\"Enter Message…\" name=\"message\">\n    <button class=\"button button-positive button-clear\" type=\"submit\">Send</button>\n  </form>\n</div>\n. Ive seen that on Android from time to time, not sure what is causing it yet though. Here's a good place to look: https://github.com/meteoric/meteor-ionic/blob/master/components/ionHeaderBar/ionHeaderBar.js#L20\n. @dcsan see the note under Installation in the ionic-sass README: https://github.com/meteoric/ionic-sass#installation. This is a limitation of fourseven:scss and Meteor in general.\n. Good question. I think you can call Session.set('ionNavDirection', 'back'); before calling Router.go() and that should work. Let me know if not.\n. I realize this is ugly, but did you try:\nSession.set('ionNavDirection', 'back');\nMeteor.setTimeout(function() {\n  Router.go('wherever');\n}, 100);\n. @PolGuixe so does that work?\n. Obviously we need a real solution here, but in the meantime can't you just manually do what's being done in the event handler?\nhttps://github.com/meteoric/meteor-ionic/blob/c190e8cd67d6180a44357eed871bd115ea008a85/components/ionBody/ionBody.js#L61\n$('[data-nav-container]').addClass('nav-view-direction-back');\n$('[data-navbar-container]').addClass('nav-bar-direction-back');\n. Yeah, creating a meteor-specific version of this is definitely on my TODO list. In the meantime you might want to check out: https://github.com/ccorcos/meteor-icon-splash-maker\n. I'm not going to try to tackle it right now, and it's probably out of the scope of this specific repo.\n. This is more of a general Meteor/Iron Router question that should probably be posted to Stack Overflow or forums.meteor.com\n. @bastiRe I was experiencing that exact problem until I implemented https://github.com/meteoric/meteor-ionic/commit/55085b3800912542b41992326bd51ac468068acd. But I don't think that commit is on Atmosphere yet. Can you try cloning this repo into your packages directly and let me know if you still experience the problem?\n. Thanks @dcsan. I actually started using this pattern in other components: https://github.com/meteoric/meteor-ionic/blob/master/components/ionModal/ionModal.js#L66 - perhaps we should stick with that?\n. Yeah I guess I didn't consider that when porting it over. I think we can just remove this conditional: https://github.com/meteoric/meteor-ionic/blob/master/components/ionPopover/ionPopover.js#L74.\n. @MFQ that looks correct. Have you tried running meteor update to make sure you have the latest versions of all the meteoric packages?\n. Hmm yeah I think those are included in the Meteor core, not sure there's much we can do about that. You might want to ask on https://forums.meteor.com/\n. Are you experiencing any specific issues?\n. Yeah CSS seems like the way to go. I'm thinking you could override the bottom value of this:\nhttps://github.com/meteoric/ionic-sass/blob/master/stylesheets/_scaffolding.scss#L29\nto be the height of the ad. That way any footers or tabs you add will be positioned above the ad automatically by Ionic.\n. _appId:this.appId should be _appId=this.appId\n. This seems like an iron:router issue, not a meteoric issue. But to confirm, have you tried not using an ionItem and instead just doing an <a class=\"item\" href=\"{{pathFor 'module.show' _id=this._id  _appId=this.appId}}\">{{name}}</a>.\n. @benstr any thoughts on this?\n. Looks great, thanks!\n. You can also add data-ion-menu-close to links: https://github.com/meteoric/meteor-ionic/blob/c190e8cd67d6180a44357eed871bd115ea008a85/components/ionBody/ionBody.js#L87\n. Oh, so does Ionic always close the side menu when you click links? If so I think we should definitely mimic that behavior.\n. PR in the works: https://github.com/meteoric/meteor-ionic/pull/291/\n. This is definitely something I want to figure out, but I haven't looked at it enough to even know where to start. I think the basic idea is that we need to be able to tell iron router to render routes into different regions.\n. I haven't had that issue, but it seems like it's an issue with Ionic's CSS, not our Meteor implementation. I would probably post this on the Ionic repo.\n. This is more of a general Meteor discussion / suggestion, I don't think it's  related to meteor-ionic.\n\nOn Mar 22, 2015, at 2:20 PM, evc notifications@github.com wrote:\nwhy this closed without reply\n—\nReply to this email directly or view it on GitHub.\n. That's just a limitation in the way Meteor/iron:router route animations work. I don't know of any workaround yet.\n. Guys, I don't have time to look at this right now, but it should be pretty easy to troubleshoot / diagnose:\n\n1- Clone the repo into your app's packages directory:\n$ cd yourApp/packages\n$ git clone https://github.com/meteoric/meteor-ionic.git meteoric:meteor-ionic\n2- Try removing the com.ionic.keyboard dependency (https://github.com/meteoric/meteor-ionic/blob/master/package.js#L8-L10). What happens?\n3- Add com.ionic.keyboard back in, and try removing these lines: https://github.com/meteoric/meteor-ionic/blob/master/components/ionKeyboard/ionKeyboard.js#L47-L49. What happens?\n. Well, removing com.ionic.keyboard is only a temporary fix. com.ionic.keyboard is necessary for the UI and keyboard to interact the way users are accustomed to native apps behaving (specifically retaining fixed headers and footer when the keyboard is open as opposed to pushing the entire UI offscreen).\nI probably won't have time to fix this until I work on an Android app that experiences this issue. In the meantime hopefully someone can step up and figure out why com.ionic.keyboard isn't playing nicely with Android.\n. You probably just need to override this line: https://github.com/meteoric/ionic-sass/blob/master/stylesheets/_scaffolding.scss#L25\n. @bastiRe do you have any thoughts on this?\n@perusopersonale does myTemplate exist when you are calling IonPopup.show()?\n. @sircharleswatson nope, doesn't look like that's currently possible, but maybe @bastiRe can confirm?\n. @sircharleswatson absolutely!\n. If it's just CSS then you'd just need to add their CSS to your project. Did you try it and run into issues?\n. Hi @txs, we're just using https://github.com/jakiestfu/Snap.js/ for side menus. You'll want to check their docs to see if they support this.\n. Here's where snap.js gets initialized: https://github.com/meteoric/meteor-ionic/blob/master/components/ionSideMenuContainer/ionSideMenuContainer.js#L14-L36\nYou can't currently pass any other options to it, but that should be pretty trivial to implement if you'd like to submit a PR. Alternatively you might be able to grab the element out of the DOM and apply options retroactively - not sure if snap.js supports that or not though.\n. Yes, it is possible, but neither Ionic or Meteoric offer anything in the way of help. You'll just have to write your own custom component with your own custom JS and CSS.\n. I think you can just pass a custom class to the ionTab:\n{{> ionTab class=\"my-tab\"}}\nAnd then attach an event handler in your template like normal:\n'click .my-custom-tab': function(event, template) {\n}\n. You will want to open the modal using this method: https://github.com/meteoric/meteor-ionic/blob/master/components/ionModal/ionModal.js#L11\n. @ecuanaso I'm not exactly sure what you're trying to accomplish, but I'm pretty sure you don't need any of this code:\n```\nthis.template = Template[profile];\n    var view = Blaze.renderWithData(this.template, data, $('.ionic-body').get(0));\nif (!this.view[profile]) {\n  this.view[profile] = [view];\n} else {\n  this.view[profile].push(view);\n}\n\nthis.views.push(profile);\n\nvar $modalBackdrop = $(view.firstNode());\n\nif (this.views.length === 1) {\n  $modalBackdrop.addClass('active');\n}\n\nvar $modalEl = $modalBackdrop.find('.modal').eq(0);\n$modalEl.addClass(this.enterClasses.join(' '));\n\n$modalEl.on(this.transitionEndEvent, function () {\n  $('body').addClass('modal-open');\n  $modalEl.removeClass(this.enterClasses.join(' ')).removeClass(this.enterActiveClass).off('webkitAnimationEnd');\n}.bind(this));\n\nMeteor.setTimeout(function () {\n  $modalEl.addClass(this.enterActiveClass);\n}.bind(this), 10);\n\n```\nIt should be as simple as:\nTemplate.ionTabs.events({\n  'click .profile-modal' : function(profile, data){\n    IonModal.open('nameOfExistingTemplate');\n  }\n});\n. ion-refresher hasn't been implemented. You can either open a PR to implement it, or use an existing pull to refresh plugin:\nhttps://github.com/jordansinger/hook.js/\nhttps://github.com/visiongeist/pull-to-refresh-js\nhttps://github.com/apeatling/web-pull-to-refresh/\n. > Is the way is works is that you have imported all the css for the ionic framework. And then you are using Blaze templates and helper files to add and remove classes from the elements to correspond to the correct function? So basically it is just about dropping in the native ionic css, and then just adding and removing classes at appropriate times?\nTypically, yes. But I believe ion-refresher relies on Ionic's ion-scroll component, which is a customized version of Zynga Scroller. This allows Ionic to perform custom scrolling functionality - such as pull to refresh, among others.\nSo for this component we will probably need to find an off-the-shelf pull to refresh component, and then figure out how to get it to work with Ionic's CSS. This is what we did for the ionSideMenu and ionSlideBox.\nHere's the relevant CSS we'll want to try to use: https://github.com/meteoric/ionic-sass/blob/master/stylesheets/_scaffolding.scss#L181-L259\n. @sferoze I would definitely be open to us implementing both ion-scroll and ion-refresher, but I assume that will be quite involved. If you have the bandwidth then definitely feel free to tackle this. Otherwise I was thinking an off-the-shelf plugin would be quicker.\n. It has rubber band scrolling when running on the device, it's not needed or desirable on the desktop.\n. @aaronthorp Have you tested this on an iOS device yet? When I originally implemented this there was a bug in iOS where if you animated the scroll right after focusing an input, the keyboard cursor wouldn't update its position and would be displayed outside of the form field.\n. The scrolling is handled using this CSS on an .overflow-scroll element. There's no special scrolling functionality, so you should be able to listen to the even normally.\n. Hmm maybe we don't. Maybe there could be memory leaks though if we keep re-initializing the plugin?\n. Sounds good, PRs are always welcome!\n. > But is still ugly see the images being in a list in the transition.\nI'm not sure exactly what you mean by this, but I assume it's a FOUC type situation? In that case maybe you just need to add a preloader to that route?\n. Nice, very helpful.\n. I assume you mean while testing on the device or simulator? If so, there are remote debugging options for both iOS and Android\n. Yes, you can pass href instead of path: https://github.com/meteoric/meteor-ionic/blob/master/components/ionTab/ionTab.js#L26\n. The style=\"android\" is what is putting them on the top. I don't think it's currently possible to put android style tabs on the bottom in meteor-ionic, I think from a design/UX perspective that would be potentially confusing to Android users anyway.\n. It may just a CSS/display issue, I've used that plugin in a meteoric project with no issues.\n. Only a few of the ionContent options have been implemented at this time. You can see all of them in the source code: https://github.com/meteoric/meteor-ionic/blob/master/components/ionContent/ionContent.js.\nAs for why your viewport is too large, I'm not sure, I've never experienced that myself. Perhaps something inside the viewport has a large fixed width?\n. Unfortunately it's heavily dependent on iron:router - or more specifically iron:layout. We make heavy use of contentFor regions. I would like to remove this dependency, so I'm open to a PR.\n. Yes, this is a known issue with Meteor that will be solved in an upcoming update.\n. This is a known issue with Meteor that will be solved in an upcoming update.\n. Actually I think you just need to use an HTML5 number input: <input type=\"number\">\n. Probably because the headerButtonRight region is rendered outside of your template? Try adding the event handler in your layout.\n. Sorry, I think this is outside the scope of meteoric.\n. I believe this is the same issue: https://github.com/meteoric/meteor-ionic/issues/50\n. You shouldn't have to add or change anything. IS it possible you have some other CSS rules causing the gap?\n. Hmm, there's something wrong there. The header should be behind the status bar, not under it. You might be missing a wrapper div or something, can you post your template and layout code somewhere?\n. What is framing? I'm pretty sure ionBody has to be the root element: https://github.com/meteoric/meteor-ionic/blob/master/GUIDE.md#ionbody\n. We're using Slick.js, you might want to take a look at their docs: https://github.com/kenwheeler/slick/\n. This is great - thanks!\n. I think you can just set this to false: https://github.com/meteoric/meteor-ionic/blob/master/components/ionTab/ionTab.js#L9\n. There shouldn't be any issues with Meteoric+jQuery, Meteoric makes extensive use of jQuery internally.\n. Not sure, I would need to see some docs on how Ionic View works internally.\n. I'm assuming this feature requires bundling an angular-ionic app to Ionic's servers - so probably not possible with Meteor.\n. You should be able to pass an animation name to your ionNavView as you can see in the source. The animations you can use are in the sass: _animations.scss.\n{{#ionNavView animation=\"slide-in-up\"}}\n{{/ionNavView}}\n. Yes this requires a bit of custom CSS. Here's what I've done in the past:\n```\n.bar-footer {\n  .item-input-wrapper {\n    background: none;\n    padding: 0;\n  }\n.button-clear {\n    width: 60px;\n  }\n.button-block {\n    margin: 0;\n  }\n}\n```\n<div class=\"bar bar-footer bar-stable has-tabs\" data-keyboard-attach>\n      <form class=\"item-input-wrapper form-send-message\">\n        <input type=\"text\" placeholder=\"Enter Message…\" name=\"message\">\n        <button class=\"button button-positive button-clear\" type=\"submit\">Send</button>\n      </form>\n    </div>\n. This is most likely related to one of the outstanding Android keyboard bugs e.g. https://github.com/meteoric/meteor-ionic/issues/130\n. I don't have any plans to attempt a 1.0 upgrade right now. \"Swipe to go back\" in particular will be quite difficult to implement and will probably require a custom router (or a heavily modified version of an existing router). I'm also much more interested in React and React Native right now, but if my interest returns to Ionic I will definitely look at upgrading.\n. Unfortunately this needs to rely on Session since tabs aren't necessarily tied to routes. e.g. take a look at the behavior of the tabs in http://meteorhunt.meteor.com/ (especially the profile tab).\n. In a mobile app the tab bar represents overall sections of the app, not individual screens. So in the Meteor Hunt example when I click on the \"profile\" tab I am in the \"profile section\" of the app and that tab should stay highlighted until I choose another tab. From a user's profile I can navigate to individual posts that a user has voted on. If the tabs were tied to routes, the highlighted tab would change when I navigated to the post detail route.\n. I think we just need to implement the hardware back button: https://github.com/meteoric/meteor-ionic/issues/71\n. Well technically the back button shouldn't change the tabs. Each tab should have it's own navigation stack. At least that's the way it works on iOS.\n. You don't need the ion- part when specifying the icon like this.\n. @train860 this would require some way of caching the data and the template which is currently outside the scope of this project.\n. @maxzzznz Tabs are working fine here: http://meteorhunt.meteor.com/ - which is using the latest versions of all the packages.\n. App.icons are for specifying the icon(s) that shows up on a device's homescreen - not the icons within your app's UI. To add addition UI icons you would just need to use CSS as usual.\n. @elGusto I'm open to refactoring to allow multiple routers, but I don't have any time right now to contribute unfortunately. Also, if there are clear advantages to Flow Router over Iron Router I'm open to just switching them out as well.\n. It's probably something to do with the way iron:router generates routes. What are the listItems objects exactly? Check out: https://github.com/iron-meteor/iron-router/blob/devel/Guide.md#path-and-link-template-helpers\n. That's right, anything inside of {{#contentFor \"headerButtonRight\"}} will be pulled out of your template and injected into the layout, so you'll need to attach events on the layout.\n. @elie222 can you fix the conflicts on this? Once you do I'll merge this in and release the latest version. Thanks!\n. @elie222 it looks like the Popups section of the docs has some issues (maybe caused by a previous merge):\n\n. Actually it looks like the last paragraph and code block should be a part of the Modals section above.\n. @yokas this is a general Meteor question and isn't specifically related to meteoric. A simple Google search for \"meteor local storage\" returns several useful results, including: https://forums.meteor.com/t/meteor-mobile-app-local-storage/2646\n. For now you should be able to manually set Session.set('ionTab.current').\n. On a device <input type=\"date\"> will trigger the native datepicker, which is I believe is why Ionic doesn't include their own. I also don't think we want to include any components in meteoric that aren't in Ionic.\n. We'd also need to figure out how to handle rendering into regions:\nhttps://github.com/meteoric/meteor-ionic/blob/master/components/ionNavBar/ionNavBar.html#L3-L5\n. From the README:\n\nIt aims to be a complete port of Ionic’s Angular directives to Meteor Blaze templates.\n\nIonic components are Angular directives. Meteoric attempts to replicate Ionic's Angular directives using Blaze templates.\nSo instead of:\n<ion-content>\n  <p>Your content here</p>\n</ion-content>\nYou would write:\n{{#ionContent}}\n  <p>Your content here</p>\n{{/ionContent}}\n. Hi @mervynteo this seems like something specific to your CSS, but feel free to reopen if you are still experiencing this.\n. Unfortunately there isn't, but I hope to add some in the future. However most of the components are pretty small and you can usually take a peak in them to see what methods are available to you.\n. Well that blank space is supposed to be underneath the status bar (clock, battery, etc). I can't remember for sure, but I thought that was just a Cordova setting that was on by default in Meteor.\n. Hmm I've never had to explicitly set that option in any of my apps - it always just worked.\n. Ah, actually it appears I have these settings in my default mobile-config.js\n. None of the components in the http://ionicframework.com/docs/components/ list require any Meteoric integration - they are just static CSS components and are all already included along with the https://github.com/meteoric/ionic-sass package.\n. Unfortunately there's no built-in way, it has to be done manually.\n. Yeah that shouldn't be checked, I wasn't aware Ionic had that functionality.\n. This is a known issue with Meteor that will be solved in an upcoming update.\n. I haven't tried yet. I'm wondering if the upgraded Cordova in Meteor 1.2 (meteor update --release METEOR@1.2-rc.7) will fix this?\n. I think this is the appropriate behavior. Switching tabs should also set up a new \"navigation stack\". There shouldn't be anything to \"go back\" to after switching tabs.\n. Published!\n. I haven't looked that them closely yet, but as long as they are just CSS themes I don't see any reason why they wouldn't.\n. Hi @jorjordandan, is there any reason we couldn't call the attribute just id?\n. @jorjordandan maybe we should also bump the ionic-sass dependency in this package so users don't end up with an old version of the CSS?\n. Oh you're right, I think I deliberately didn't specify a dependency on ionic-sass so that users could bring their own version if they wished (compiled CSS, a LESS version, etc). So maybe it's OK as is.\n. Ah good call.\n. @jorjordandan this is looking good, but I noticed in my testing (https://github.com/meteoric/demo/blob/master/client/templates/spinner/spinner.html) that the Android spinner doesn't animate. Any ideas?\n. Not sure if the below error is related:\nReferenceError: $element is not defined\n    at start (ionSpinner.js:445)\n    at init (ionSpinner.js:440)\n    at Template.ionSpinner.rendered (ionSpinner.js:422)\n    at template.js:116\n    at Function.Template._withTemplateInstanceFunc (template.js:437)\n    at fireCallbacks (template.js:112)\n    at null.<anonymous> (template.js:205)\n    at view.js:104\n    at Object.Blaze._withCurrentView (view.js:523)\n    at view.js:103\n. In Ionic the body doesn't scroll. There's a dedicated div for scrolling content that has the classes .content.overflow-scroll. You'll want to monitor the scroll event on that div.\n. Looks great @jorjordandan! Would you be able to update the README and check off these components? Also if you have time, it'd be great to add this to the demo.\n. It doesn't require any JavaScript, just HTML and CSS:\nhttp://ionicframework.com/docs/components/#toggle\n. > Having a navigation view pull up from the bottom like a modal is a key need for 'popping up' an item to work with. The standard modal can't be used because we need more customizability over the content, header buttons and transitions.\nYou'll still want to use a \"modal\" as opposed to a navigation transition. \"nav transitions and directions for up/down\" aren't really a valid use case on mobile - transitions are always left to right - so those won't ever be added. \nInstead I would suggest you either:\n1. Use the existing modal component with the customTemplate options like so:\n{{#ionModal customTemplate=true}}\n// Any HTML you want goes here\n{{/ionModal}}\n1. Create your own component and just copy over the pieces of https://github.com/meteoric/meteor-ionic/blob/master/components/ionModal/ionModal.js and https://github.com/meteoric/meteor-ionic/blob/master/components/ionModal/ionModal.html that you need.\n. > I'm wondering if it's possible to have a modal that can then have navigation left/right transitions within it.\nThat would be a great feature to have, but I don't think that's something that can easily be done with iron:router. We'd need some kind of nested routing functionality. You could create multiple screens within a modal that just get swapped out independent of routes - just using a Session var or something to track the current screen - basically like tabs.\n. We are including the fastclick dependency as part of meteor-ionic: https://github.com/meteoric/meteor-ionic/blob/master/package.js#L17\nI would try to confirm that the package is indeed part of your project and that the necessary JavaScript is being loaded.\n. Hmm yeah that shouldn't be happening. It's possible something isn't set up correctly. Is there any code you can post? Have you followed the basic structure of the example apps like Meteor Hunt?\n. I don't think it would be a trivial migration, and I personally don't have plans tackling it now that Meteor has good support for Angular.\n. I'm not officially abandoning this project (yet), but I'm not using it personally, and wouldn't recommend it for anything more \"serious\" than a prototype or MVP. For users that don't want to use Angular, there are React alternatives such as http://reapp.io/.\n. @pors No, I haven't seen anything else for Blaze. Personally I haven't found Blaze to scale well with an app's complexity, and it doesn't seem to be a priority for MDG, so I think React or Angular are the way to go moving forward.\n. Meteoric is great for rapid prototyping and simple apps, but I'm no longer maintaining this package and am recommending official Angular Ionic for serious, production apps.\n. It is possible to use Bootstrap and Ionic together, but not recommended. They are both trying to do similar things so you will probably get lots of conflicts.\n. Sorry about that, I just updated the README.\n. @danlg you can probably just fork the project and remove these lines: https://github.com/meteoric/meteor-ionic/blob/master/package.js#L8-L10\nThen install the package from your fork.\n. Thanks for adding docs! The only thing bugging me is the urlFor option. Maybe instead we have both path and url options, an we can infer which IR method to use based on that?\n. Probably don't want to leave these in.\n. Well I think it's the \"option\" concept that is bothering me, and I'm hoping we can choose the correct \"option\" for the user rather than forcing them to:\npath='item.detail' -> use pathFor\nor:\nurl='item.detail' -> use urlFor\nDoes that make sense?\n. Can you explain what this is doing?\n. Should we be committing this file?\n. Should this inline CSS be here?\n. Gotcha, let's remove that then. I'll try to get all the packages updated and synced up ASAP.\n. @jorjordandan It looks like data[k][x] is undefined here - any thoughts? I assume this component can just be used like {{> ionSpinner}}? Or does it need extra params?\n. @jorjordandan Ah I see now you have to pass an icon attribute. There's a few issues with this PR I'd like to see fixed before we release a new version:\n1. We should default to ios if no icon attribute is passed.\n2. There is too much \"state in the DOM\". We shouldn't be setting id attributes on the element and then using that to determine the type. The type should be stored internally on the component. In general id attributes are a bad idea since they have to be unique.\n3. This is probably related to the above, but here's what happens when I try to put one of each on a page:\n   \n. @jorjordandan this is a smaller issue, but:\n1. Please use 2 spaces instead of tabs for indentation.\n. This still seems really fragile to me. Is it not possible to get this.icon or this.data.icon here?\n. Yeah, we're doing that in other components as well (e.g. https://github.com/meteoric/meteor-ionic/blob/master/components/ionModal/ionModal.js#L83-L90 https://github.com/meteoric/meteor-ionic/blob/master/components/ionModal/ionModal.js#L83-L90) so I think it'd make sense to keep following that pattern here.\n\nOn Aug 27, 2015, at 2:53 PM, jorjordandan notifications@github.com wrote:\nIn components/ionSpinner/ionSpinner.js https://github.com/meteoric/meteor-ionic/pull/293#discussion_r38150926:\n\n\nrc: 'repeatCount',\nsw: 'stroke-width',\nt: 'transform',\nv: 'values'\n};\n  +\nvar SPIN_ANIMATION = {\nv: '0,32,32;360,32,32',\nan: 'transform',\ntype: 'rotate',\nrc: INDEFINITE,\ndur: DURATION\n};\n  +\n//get icon name and element from blaze template\nvar iconName = this.firstNode.className.split(' ').pop();\n  it is, but if no icon is passed, the this.data.icon doesn't exist, and you can't set the default value in the helper because the data is read only .... aaaand as I was typing this I realized I could just set the default in the rendered callback... doh!\n\n\nThe icon name still has to go into the class list for the css to be applied though. I'll do that now..\n—\nReply to this email directly or view it on GitHub https://github.com/meteoric/meteor-ionic/pull/293/files#r38150926.\n. \n",
    "rclai": "+1\n. Wouldn't this Meteor integration of Hammer.js be good for this?\n. Regarding number 2, these functions from this package might be able to help with getting the template instance from inside a content block. As a matter of fact, I just realized how incredibly useful that entire package is.\n. @dennisharrison, are you going to use this package as mentioned in #2 to implement the hammer.js stuff?\n. Would it be a long way off if I suggested using Sweet Alert?\nhttps://github.com/t4t5/sweetalert\n. No problem.\n. Yes, I had a feeling it was performance-related.\n. The loading template using rendered and destroyed to do the show and hide worked great.\n. In subscriptions function, aren't you supposed to do this.subscribe()?\n. If a title is always left-aligned, it assumes that Androids don't ever have a top-left button? Or if they do, then there's no title? How would you advise?\n. Oh wait, I guess according to your article here:\nhttps://medium.com/space-camp/cross-platform-uis-for-mobile-meteor-apps-6f12b583b205\nFacebook pushes all buttons to the right. Interesting.\n. Oh you know what I noticed. So when I looked at the android Gmail and maps app, I noticed they have a left aligned menu button and the title is actually aligned left too but right next to the menu button. Check it out. \n. Performance-wise, putting the event handler on ionBody is better since we get to leverage the efficiency of event delegation and it's easier on the memory.\nAlso, I found out that the .activated class is an alias to the .active class. There's like 140 occurrences of it on the Ionic style sheet. What a waste of file size, what were they thinking?\n. I should've created a new branch so I could've submitted it separately.\n. Sweet, thanks.\n. Turns out this is a meteor bug: https://github.com/meteor/meteor/issues/3540\nYou're off the hook hehe. \n. Perhaps making it router agnostic is more palatable?\n. @nickw, let me know what you think of this idea and whether I should keep going at it when you have the time :smile: \n. Thanks for the feedback guys.\n. @arunoda, that sounds like a great idea, but I can't envision how to do that since there is router logic in different components. Can you show me a small example?\n. Ah okay, sounds good. I'll give that a try.\n. Oh wow, router-layer might just be the answer. I'll check it out later.\n. @nicolaslopezj, are we able to use the Layout template to render things into regions to tackle the issue that @nickw mentioned for this?\nGiven that it is {{> yield \"regionName\"}}, how does that translate in Router Layer.\n. If you have multiple modals open, and you press Escape, all modals are going to close because the keyup is going to be triggered on all modals. By adding that line of code, you're able to close one modal at a time when pressing Escape.\n. Yeah, that is going to change, thanks.\n. ",
    "vieko": "hammer.js is an excellent call.\n. ",
    "dennisharrison": "@nickw We have history working as long as routes are hit via userHistory.goToUrl(\"/your/url/here\").  Just added this today and we have more work on documentation and and option for event snagging on  tags wherever they are if the domain is the same.  But, now this way at least goBack() is much more sane than window.history.back().\nSample implementation:\nhttps://github.com/dennisharrison/mapp-skeletor/blob/master/app/packages/user-history/client/history.coffee\nInterested?  Only been using it for a few hours but we're happy with the results so far.\n. I would suggest GSAP for this - more than willing to help!\n. @nickw \nOK, let's do this first for the side menu animation since we'll be touching that this week anyway.  Then you can comment and we can figure the best refactor methodology.\n. @nikw \nInteresting.  Can you link the line that kicks off the animation you see the choppiness with?  I'll do a quick test with GSAP there first to see if there is any real gain.\n. After some profiling it looks like the css 3d translation of the parent element of a container full of 3d translated (to get them hardware accelerated) causes the blinking I'm seeing.  If we take that class off the child elements before doing the translate of the parent element (say sliding) then I don't see the 'jitter'.  Working on making the toggle work without autoform and then can submit a pull request showing the difference for you to test. \n. 1. Great - this fixes it without re-classing anything.  I'll toss that helper method out and use this instead!\n2. This is an interesting problem, https://github.com/meteor/meteor/pull/3546 looks like the solution for it though.\n3. I don't want to stray from your goals for this project, and create wasted time where we implement two separate solutions to this.  Let's pick a method you want to go for and I'll concentrate there.\n. @nickw You're correct.  Except on Android (which is pretty odd!), which handles redraw very poorly.  GSAP and Velocity have performance parity with CSS transitions now in almost every case, but the performance on Android is better.  I wish I understood why, since that shouldn't be the case.  \nLet's try and fix it without anything else first.  On the road today but I'll finally be able to give this a day tomorrow.\nHave you run into this one?\nhttp://stackoverflow.com/questions/10014461/why-does-enabling-hardware-acceleration-in-css3-slow-down-performance\n. @nickw \nI've spent the last two days with this.  We can do it with CSS, pull request coming - but I'm doing all this with 1.11 and Android still isn't as smooth as iOS, but I think that's just going to be the case.\nCan you merge the PR from Digilord to fix up the data binding for the position of header buttons if it hasn't been fixed in 1.13?\nAlso I notice someone saying that 1.13 is not working them on iOS and Android?  Is that reproducible on your side?\nThanks again for such an awesome package! :)\nI'll try to update and then merge all changes and see where we are.  We also added in hammer.js for gesture control (went through 6 methods before finding something simple and worthwhile), but I want your input on that before trying to package up for meteoric.  It requires a little bit of manual setup in the template.  I'm not sure of the overhead of doing it on 'everything' so I think we should figure out a way of conditionally turning it on an element or not, but it seems like events are getting gobbled up by being in the helpers inside of the templates.  I'll start an issue with a link to example code once we get the css and layout changes in.\nAlso - just for anyone who runs across this issue in the future:\nRead this first:\nhttp://greensock.com/css-performance\nCheck this out to see a method for alleviating the majority of the issues the author mentions with CSS draw times:\nhttp://codepen.io/paulirish/full/9712e8fb6a451e0ee7393d01e7f59f53/\nTL;DR version:\nhttps://developers.google.com/web/fundamentals/look-and-feel/animations/css-vs-javascript?hl=en\n. I just saw the issue about 1.13 and mobile when browsing for this one on the laptop.  Looks like it's likely a non-issue.\nI can't find the PR off-hand.  Hey @digilord do you have that available?\nIn the meantime here is the change that mattered.\nhttps://github.com/digilord/meteor-ionic/commit/dd3248035b0dd1d5469c3386cd32cf499c19a4fd\n. @nickw Go ahead and push release today, headed into Valentines Day territory here :)\n. Coming soon, promise.\nI'm going to update meteor-ionic after implementing more hammerjs gestures and refactoring some stuff on the sample project I'm using to learn all this - and then send along the PR for the css changes to animations.\nI've been playing with hammerjs and gsap to handle the menu slide animation based on finger placement and rewind the animation, etc.  Feels more native that way.  I still think the package should stay default css though to not bring in that dependency.\n. @rclai No I manually included hammer and the jquery plugin. Like this\nLatest updates on everything has me see'ing much better Android performance.  Also - Meteor Template based subscriptions is a huge help here.  Display a spinner until template subscriptions are ready. Template subscription and Template conditional\nOverall, I'm very happy with performance since this change.\n. @guilhermedecampo haha, thanks :)\nGood question, and I wish I was good enough to give you a less anecdotal answer than \"everything works better and faster with template based subscriptions.\"  It's hugely helped the Android animation performance, among other issues - such as extra items in collections for short amounts of time due to subscriptions not being explicit enough before render.\n. @nickw \nChecking in on this issue - letting you know the flickering is pretty trivial to fix a number of ways.  The Android animation performance can be solved with using GSAP or the like.  I've been sidetracked from this with implementing file upload management and Froala inside a sample meteor-ionic project.\nhttps://github.com/dennisharrison/mapp-skeletor\nThis isn't ready for public consumption by a long shot, but I'll be putting the performance css and js animation tweaks in here first - have meteor-ionic as a local package currently.  I'm aiming to get you the pull request to make the flickering stop and smooth the animations this week coming up.\n. @nickw \nI agree with you on not adding dependencies: I think in this case the positives outweigh the negatives of dragging along that extra dep.\nYou could use requestAnimationFrame but there are GSAP & Velocity packages which shave off a lot of the rough edges, there is a lot of work done here.  If you wanted to pick one over the other and use their jQuery animate() compatible plugin then a user of meteor-ionic could swap them out on a whim as they both feature API parity for jQuery animate().\nI need GSAP for other things in the mobile projects that velocity won't handle - so this would be a boon to me personally :)\nMoving rest of this to #4 \n. @digilord & @dancering\nWould also love to see this implemented. In Ionic when using this it renders the menu differently than the 'slide out' method in that it doesn't push the content over and the toggle no longer functions. For tablets and desktop this would be a great help. It's actually rendered to the left or right of the content instead of starting in the same space as the slide animation. \nI haven't spent enough time to understand how @nickw would really want to implement this in meteoric, but am willing to help. \n. @nikw I think it should disable snap.js of the element when this happens (and re-enable on resize) and then override the CSS.  I'll dig into this in particular when I'm working on visual stuff this week.\nionSidemenuContainer makes the most sense - right?\n. This should help anyone looking to get started on this:\nThis on your template .rendered() method.\njavascript\nTracker.autorun(function() {\n  if (Session.get('width') >= 768) {\n    IonSideMenu.snapper.disable();\n    return Session.set('_showWhenSideMenuOpen', true);\n  } else {\n    IonSideMenu.snapper.enable();\n    return Session.set('_showWhenSideMenuOpen', false);\n  }\n});\nWith similar CSS to this.\n``` css\n@media (min-width: 770px) {\n  .ionic-body {\n    position: absolute;\n    overflow: visible;\n    max-width: 768px;\n    margin-left: auto;\n    margin-right: auto;\n  }\n.snap-content {\n    margin-left: 266px;\n    max-width: 502px;\n  }\n  .snap-content .menu-toggle-icon {\n    display: none;\n  }\n.snap-drawer-left {\n    position: absolute;\n  }\n  .snap-drawer-left .bar {\n    width: 266px;\n    right: auto;\n    left: auto;\n  }\n}\n@media (min-width: 1026px) {\n  .ionic-body {\n    max-width: 1024px;\n  }\n.snap-content {\n    max-width: 758px;\n  }\n}\n``\n. We have.menu-toggle-icon` class on the menu button and hide it when the css swaps everything around to keep the menu open.\n. This is still happening w/ 0.1.12\n. @nickw I agree on passing that around explicitly.\n. ",
    "teknologist": "Can't wait.\nRight now, performance on Android, on a flagship device, is horrible. On an iPhone 5 it is a lot better.\nOn pure Ionic, it is very nice!\nIn fact, back in December pure Ionic was very laggy too. Then they implemented AngularJS views caching and it started feeling native.\nMore infos here: http://forum.ionicframework.com/t/please-help-test-angular-1-3-improved-transitions-cached-views-etc/12528\n. Hi @joshua1,\nHave you checked this : \nhttps://meteor.hackpad.com/Building-Meteor-app-with-Crosswalk-kHKh4DzGxFQ\n?\nI am going to give it a try at a later stage. Let me know if you test it.\nCrosswalk bins have been updated since that post, so check the latest webviews in the Intel directory.\n. ",
    "guilhermedecampo": "Hey @dennisharrison if you have iron-router in your app.. why not just use the hooks they already implement like the waitOn for subscriptions?\nobs: forked your app to get some profit! haha\n. Awesome @dennisharrison, thanks for your time!\n. hey @zleman1593 can you make a gist of your template?\nWould be easier to understand what is going on :smile: \n. What is missing to make this happen?\n. awesome! Thanks for that! @jorjordandan !!\n. Any news on this? I'm having the error. :disappointed: \n. @aaronthorp could you find a way to fix this open/closes select boxes on iOS?\nIt's making me crazy. :stuck_out_tongue_closed_eyes: \n. Don't know @nickw about the memory leaks.\nBut maybe we can just check if the element indeed is there?\nI can make a pull request! ;)\n. Hey @nickw, in the end I was using it wrong :disappointed:\nI don't receive the error anymore. \nBut is still ugly see the images being in a list in the transition.\nWill try to find a solution for that.\nDo you have a clue?\n. Could not find any reason on profile tab that explains why isActive is not tied to routes.\nCan you be more specific?\n. Yes you are right! \nI'm having a problem with the hardware button in android which doesn't change the tabs active class.\nMaybe we can fix this in another way? Do you have any thoughts about this?\nThanks for the explanation :+1: \n. How can we start doing something like in Blaze?\nhttps://github.com/driftyco/ionic/blob/master/js/angular/directive/collectionRepeat.js#L2\n. ",
    "zleman1593": "Hey @guilhermedecampo and  @dennisharrison.  I am using the latest version of meteor iconic with template based subscriptions using subscription manager.  This has not yielded any improvement in Android animation performance.  It still flickers and looks laggy. What else do I need to do to fix this?  Are we waiting on a PR?   Thanks. \n. True for me on a galaxy S4. Any idea why this is the case? Not a problem on any of my ios devices. \n. ",
    "mikeconstable": "+1. I'm short on skills to contribute, would be keen to test this component.\n. Thanks - looks promising. I'll take a look when I get back to that part of my app.\n. I managed to workaround this a couple of days back by manually changing the version from 1.0.3 to 1.0.4 in the star.json file in the .meteor/local/build folder in my app. Problem went away after that. \nWelcome the update @nickw mentioned though.\n. ",
    "richpowell": "is the api the same as ionics? Im having trouble implementing this\n. Thank you, It works on the phone, but not in the ios simulator.\n. I should have read the code fully.. of course it was at the bottom :)\nnow that i include that \"popover-backdrop\" into the href element class on the template, the thing disappears on the click.. no need to change the code i dont think.. \nthanks for the info.\n. My footer is getting overlayed by the served ad.  Is there a way to reposition the footer or view so footer is moved up since ads are shown in the bottom.\nMaybe this can me easily done in with css?\n. I have a app.scss and I've tried overriding with \n.ionic-body {\n    bottom:50px;\n}\nand\nbody,\n.ionic-body {\n    bottom:50px;\n}\nneither of which works for me. am I missing something in the css?\n. So after a bit of hacking. If I include this in my app.scss file I get a area for ads to show in the bottom.\nbody, .ionic-body{\n   position:absolute;\n    margin-bottom:25px;\n}\nHowever, when clicking on the tab icon and going to the that tabs screen, the tab at bottom is off a bit in its shift. and I notice that its down a few more pixels that the main view.  Is there something different in the tabs vs tab main view(i think i saw nick mention this somewhere in the code)?\nIm 99% sure I can customize the views for different apps by breaking this out into different\n@media screen for the various devices. \nMy code follows the tabs demo..\n. I added a custom css file. and used the styling below.  Then I added admob as a bottom banner.\nHeres the main template also. So you can see where I added the id to which elements.  Not sure about the TAB view its been a while since I played with this. \n\n{{#ionHeaderBar class=\"bar bar-header bar-assertive\"}} \nSALEZY\n\n                 {{> ionIcon icon='more'}}   \n\n{{/ionHeaderBar}}\n{{#ionContent class=\"calm\"}}\n\n\n{{content}}\n\n\n{{/ionContent}}\n{{#ionFooterBar}}\n\nPress Me\n\n{{/ionFooterBar}}\n\n/* iPhone Portrait */\n@media screen and (max-device-width: 480px) and (orientation:portrait) {\nadpadding{\nbottom:50px;\nheight:60px;\n\n}\n} \n/* iPhone Landscape */\n@media screen and (max-device-width: 480px) and (orientation:landscape) {\nadpadding{\nbottom:50px;\nheight:60px;\n\n}\n}\n/* iPad Portrait */\n@media screen and (min-device-width: 481px) and (orientation:portrait) {\nadpadding{\nbottom:90px;\nheight:60px;\n\n}\n}\n/* iPad Landscape */\n@media screen and (min-device-width: 481px) and (orientation:landscape) {\nadpadding{\nbottom:90px;\nheight:60px;\n\n}\n}\n. ",
    "bwhitty": "I tested it out last night, looks good at least on the web so far.\n. I've seen this on Android 5.x as well.\n. ",
    "elGusto": "Why let only a few options of slick to be overriden ?\nIt would be nice to have access to it's full api.\n. Or without velocity for people who don't use it:\nTemplate:\n{{#ionView}}\n    {{#ionContent}}\n       <div class=\"scroll-bottom-wrapper\">\n          {{#each items}}\n               // your stuff\n          {{/each}}\n       </div>\n    {{/ionContent}}\n {{/ionView}}\nTemplate.rendered function:\n```\n  //scroll to bottom when page is rendered\n  $('div.scroll-bottom-wrapper').scrollTop($('div.scroll-bottom-wrapper')[0].scrollHeight);\n//blaze uihooks\n  this.find('.scroll-bottom-wrapper'')._uihooks = {\n     insertElement: function (node, next) {\n        $(node).insertBefore(next);\n        var scrollDiv = $('div.scroll-bottom-wrapper')[0];\n        $('div.scroll-bottom-wrapper').scrollTop($('div.scroll-bottom-wrapper')[0].scrollHeight);\n     } \n  }\n```\nCSS for the wrapper div is like in comment above.\nOf course you can put your own animations to make things B-E-A-utiful.\n. I'm running meteor-ionic@0.1.14 (changed to 15 for the kicks)\nHere with the keyboard closed:\n\nKeyboard opened:\n\nYou can see in the screenshot that the height of the view div is adjusted already when the keyboard is opened, so the bottom css that is attached to the content div is not needed anymore (in my case).\nEverything was ok until today when meteor updated my cordova plugins (I think).\n. I am testing my app on a physical device and inspecting with chrome's device inspection tool. The screen that you see is a mirror of my phone's.\nIt's like the whole app is resized for the keyboard to appear under it's container. The blank space that you see, is the bottom offset and my content div's height is reduced to 0px\n. I am out for the moment, but I will research the issue and come back with more explanations asap.\nThanks a lot for the support, it's really appreciated.\n. There is a lot of problems with the current implementation of the keyboard (like re attaching the focusin listeners on each keyboard.show - remove them on hide?)\nI have been trying to port the ionic keyboard.js but it's taking a lot of time...\nHere are the problems I have right now with a really simple app:\nOn the IOS simulator:\nIf the input that is clicked on is already correctly positioned (above the zone where the keyboard appears), then everything is fine: the input is focused, keyboard appears and I can type and see what I type.\nIf the input is positioned where the keyboard appears:\nThe input is not focused (typing won't write anything inside it), therefore it is not scrolled back into view and clicking in the content of the app doesn't make the keyboard disappear (possibly a bug of the simulator, it was fine at some point).\nOn my android device\nAlready, there will be differences on the adjustment of the viewport depending if the cordova \"Fullscreen\" preference is set to true. By default, setting \"Fullscreen\" to true will cause the viewport not to resize when the softKeyboard appears, it will overlay the app container. Setting it to false will make the app container resize. I didn't find any solution to check for supporting both possibilities.\nThen having the \"Fullscreen\" preference set to false (it is the default value when building if not set), this happens:\n\n\nThe content div is squeezed up because the bottom offset of the size of the keyboard height like I tried to explain in the previous comments.\nReading through the ionic code, I noticed that they were delaying some operations because of this viewport change delay, but all in all, it is pretty confusing because the behaviour of the app changes depending on things out of my reach (sometimes all is good with ios).\nBut my biggest concern is that no one else seems to be experiencing the problems listed above. So I created a simple app repo with the exact code I have problems with: https://github.com/elGusto/kbtest\n. I have started to do that in this branch https://github.com/elGusto/meteor-ionic/tree/flow-integration\nI am at the point where I don't have any more errors with my app, but I am not using all of the templates meteoric is offering, so there is some work to do still.\nI then defined my layout like so:\n``` html\n\n  {{#ionBody}}\n    {{#ionSideMenuContainer side=\"right\"}}\n      {{#ionSideMenus}}\n        {{> sideMenuMobile}}\n      {{/ionSideMenus}}\n      {{#ionSideMenuContent}}\n        {{> ionNavBar}}\n    {{#ionNavView}}\n      {{> Template.dynamic template=main}}\n    {{/ionNavView}}\n  {{/ionSideMenuContent}}\n{{/ionSideMenuContainer}}\n\n{{/ionBody}}\n\n```\nAnd then you can do some stuff like this in the router:\njavascript\nappRoutes.route('/', {\n  name: 'home',\n  action: function() {\n    FlowLayout.render(layout, {\n      headerTitle: 'homeTitle',\n      headerButtonRight: 'menuButtonMobile',\n      headerButtonLeft: '',\n      main: 'homeMobile'\n    });\n  }\n});\n. This is really not something that can be merged like that. \nI don't think @nickw would like to let go of the iron router integration just to replace it by flow (and then the next popular router). We should restructure the package, either to make two seperate packages, one for IR, the other for FR, either we redesign to have a core package with pluggable router integretion packages (which would be the best imo in the case of new (or from MDG) router).\n. @nickw what do you think ?\nI'm happy to help with the refactoring, if you have some specific ideas let me know. I'll start working on this soon.\n. Just saw this today https://github.com/nicolaslopezj/meteor-router-layer.\nPrepare for Meteoric with router-layer on the way.\n. Do you have a fix for this ? I forked and applied the patch (https://github.com/driftyco/ionic/commit/11232d4) but the radios are not working still.\nBefore I had incoherent behavior like in this issue: https://github.com/driftyco/ionic/issues/4347\nThe fix corrects the behavior but now, my radio buttons are not working. I can select an option in a group, but modifications are not reflected.\nDo you still experience the problem ? If not, how did you fix this issue ?\n. ",
    "omeid": "Compatibility with upstream ionic. I think.\n. There is #221. @sircharleswatson.\n. :+1: Specially if one wants to use fast-render.\n. Ping. Any progress here?\n. I didn't ask for this pull request to be merged. Progress can be talks about the design. :)\nAnd you're right, restructuring to have different routers in their packages seems to be the way to go, it will also be inline with how MDG is planning to go with useraccounts, meteor-useraccounts/core#308.\n. Please don't drop Iron Router integration. \nBeside breaking current Meteoric projects it will also make switching non-meteoric Iron:router based projects much harder.\nThe advantage of routers over each other is also pretty subjective and case specific.\nI think MDG is working on an \"official\" router,or there is at least talks about it, so then there would be changes yet again...\nI think it is best to make the router handling modular similar to useraccounts approach as linked in my previous comment.\n. Card is just a css only component, just use it. :)\n. CSS only components can be used as is, those with JavaScript part has been mostly ported from AngularJS to Blaze or microjs libraries. \n. As flow-router doesn't provides these methods natively, the current option seems to be @arillo's meteor-flow-router-helpers.\n. ",
    "Jooshuys": "@nickw you mentioned that in Meteor when using the Slick package, 'onSlideChanged' can be used to capture a slide changed event of a carousel. I'm using the same package and the following code doesn't trigger at all:\nTemplate.Examples.events({\n    'onSlideChanged': function (event, template) {\n        console.log(\"changed\");\n    }\n});\nI'm starting my carousel with this code:\n$('#carousel').slick({\n    autoplay: true,\n    fade: true,\n    autoplaySpeed: 6000,\n    speed: 2000\n});\nAny idea what I'm doing wrong?\n. ",
    "sircharleswatson": "It looks like this component is ready? Can we update the atmosphere package so I can use it? :)\n. Thanks @nickw . I'm loving working with Meteoric so far!\n. @dancering That's sort of what I was thinking. I was more thinking of sliding across the nav and having the page switch. yours is sliding across the page and having the nav switch. It's probably pretty much the same though :P\nI came up with a different solution but I'd still like to see what you've done.\n. @perusopersonale Thanks for asking this question! I could not figure out for the longest time what I was doing wrong. But I realized that it was because I was trying to do it similar to how the IonModal works.\n. @nickw or anyone else... Is there a way to pass a data object to the popup to show certain data in the template?\n. If not, I was actually just getting ready to try to implement the feature. I need it for an app I'm working on :)\nI can add a PR when it's ready if that is something that would be welcome\n. @Kiv I got it mostly working but the code was pretty messy. I never got a chance to finish and clean it up unfortunately. and then i think I deleted the repository from my computer (and all local changes :/ ) Sorry!\n. I had this issue too just now. I had to give my  tag the button class and then it moved back to the right side\nEdit:\nMore specifically, here is my code\n{{#contentFor \"headerButtonRight\"}}\n      {{#if currentUser}}\n        <button class=\"button button-clear\" data-ion-modal=\"_cart\"><span class=\"badge badge-dark\">{{itemsInCart}}</span></button>\n      {{else}}\n        <a href=\"{{pathFor 'settings'}}\" class=\"button button-clear\">Sign In</a>\n      {{/if}}\n{{/contentFor}}\n. @sferoze glad you got it! i think it was just the button class that was important. I needed to use pathFor on mine which is why I used the anchor tag.\n. @elGusto I'd love to see this integrated with meteoric.\n. ",
    "rlech": "hey nick. can you describe how you used the ionList and ionItems in your example apps? I´ve read the example app code and tried to do create a simple list but its not working for me like in your contacts app.\n. ah ok its working for me now. I was just confused because you iterate for each \"contacts\" in your template but I could not find any helper with that name. I´m right that you dont used a helper for {{#each contacts}} and contacts is just the name of the collection (collections.js)? \n. nice thx. dont have seen this before that this is possible with routes. cool.\nok so lists are working with meteoric but not the advanced list stuff right? (like swipe to delete etc)\n. ok I keep an eye on it ;) nice work dude\n. this looks interesting. please give us an information if this works with meteoric.\n. add\nmeteor add cfs:standard-packages\nmeteor add cfs:gridfs\ndeclare collection\nvar imageStore = new FS.Store.GridFS(\"images\");\nImages = new FS.Collection(\"images\", {\nstores: [imageStore]\n});\ntemplate.js\nTemplate.template.events({\n  'change .upload': function(event, template) {\n    FS.Utility.eachFile(event, function(file) {\n      Images.insert(file, function (err, fileObj) {\n        if (err){\n          // handle error\n        } else {\n            // handle success depending what you need to do\n          var userId = Meteor.userId();\n          var imagesURL = {\n            \"profile.image\": \"/cfs/files/images/\" + fileObj._id\n          };\n          Meteor.users.update(userId, {$set: imagesURL});\n        }\n      });\n    });\n  }...\n});\ntemplate.html\n    \npublish collection via\nMeteor.publish(\"images\", function(){\n  return Images.find();\n});\niron:router code\nRouter.route('/profile',{\n  waitOn: function () {\n    return Meteor.subscribe('images')\n  },\n  action: function () {\n    if (this.ready())\n      this.render('Profile');\n    else\n      this.render('Loading');\n  }\n});\nin template get image via\n<img src=\"{{currentUser.profile.image}}\">\nalso note that bug, its not working on mobile devices (ios/android) so you have to download the stuff from the server. no idea how to fix this.: https://github.com/CollectionFS/Meteor-CollectionFS/issues/425#issuecomment-105708992\n. why not using testflight?\n. +1\n. ",
    "rizkysyazuli": "do you have an example for lists with dividers?\n. Hmm. Funny. It doesn't seem to respect the customTemplate option. The \"custom\" markup is still wrapped inside the default markup. Now i'm seeing two headers.\nHere's the HTML output:\n```\n\n\n\n\n\n\n<div class=\"bar bar-header bar-energized\">\n    <h2 class=\"title\">Find Products</h2>\n</div>\n<div class=\"content has-header overflow-scroll\">\n  ...\n</div>\n\n\n\n```\n. yep. just updated. still the same. if you need me to provide any other info. just let me know.\n. Here you go. It's a product finder app. This part of the app is mostly taken from your example contact app.\n``` html\n\n{{#ionModal customTemplate=true}}\n    <div class=\"bar bar-header bar-energized\">\n        <button data-dismiss=\"modal\" class=\"button button-icon\"><i class=\"icon ion-ios-close-empty\"></i></button>\n        <h2 class=\"title\">Find Products</h2>\n    </div>\n    <div class=\"content has-header overflow-scroll\">\n\n        <div class=\"list\">\n            <div class=\"item item-input-inset\">\n                <label class=\"item-input-wrapper\">\n                    <i class=\"icon ion-search placeholder-icon\"></i>\n                    <input type=\"text\" placeholder=\"Search\" value=\"{{searchQuery}}\">\n                </label>\n            </div>\n\n            {{#each products}}\n                {{#ionItem path=\"trackerDetail\" buttonRight=true class=\"item-icon-right item-thumbnail-left\"}}\n                    <img src=\"{{image}}\" alt=\"\">\n                    <h2 class=\"energized\">{{title}}</h2>\n                    <p>Origin: {{origin.city}}, {{origin.country}}</p>\n\n                    <i class=\"icon ion-chevron-right energized\"></i>\n                {{/ionItem}}\n            {{/each}}\n        </div>\n\n    </div>\n{{/ionModal}}\n\n\n```\nHere's the output:\n\nI can also give you the source code access if you need it. I have it on Bitbucket. just tell me your username.\n. Done, check your Bitbucket inbox.\nThe latest stuff is in the develop branch. Not much stuff right now. So it should be easy to look around. The product finder templates is in client/templates/tracker folder.\nBtw, a bit OOT. When running on iOS simulator, there's an extra space in the header bar. Hope you don't mind having a look at this as well.\nThx a lot!\n\n. the interface is all ionic. so i have to thanks the ionic team for that.\nanyway, all good now. didn't know why it didn't update before. thx again for taking the time.\n. same here. is it on Atmosphere yet?\nanother thing to note. keyup event is not triggering as well. i have a live search form inside a modal just like the Meteor Hunt demo. i have to trigger the event using a button to make it work.\n. ",
    "MacNCheeze": "I started to build out this functionality, so far I added the left/right editable buttons and reorder capabilities using slip.js(https://github.com/pornel/slip).  You can preview what I have so far on http://meteoric-contacts-list.meteor.com/\nFor reordering:\n-I added an order attribute in the database, this will require you to sort your collections\n-You'll have to pass the collection as a parameter in the ionList component \n-I am currently relying on a few classes to be apart of each list '.list' and list items '.item-content'.  I am hoping to find a cleaner way of accomplishing this(potentially  create a few more components)\nhttps://github.com/koolaid1551/contacts/commit/02e5d39ff07ddaf82183efed2a30083665cdb554#diff-70eb3c2b2e74bea5660d5b941ef44fa8\nHere's my modified repositories:\nhttps://github.com/MacNCheeze/meteor-ionic\nhttps://github.com/MacNCheeze/contacts\nLet me know if you have some other ideas how to better accomplish this.  To show hidden options I believe I am going to have to modify slip.js to reveal options beneath a list item. \n. @nickw by hidden options I mean when you swipe left you can reveal additional actions underneath each item.  For example if you check out the ionic lists(http://ionicframework.com/docs/api/directive/ionList/) you can swipe left and Edit and Share buttons appear.\n. @guilhermedecampo @gregheth \nI originally built these for a prototype I was building, ultimately we decided to use angular with meteor, solely because there were a few angular libraries that we wanted to use.  This has caused me to use the Ionic framework directly and has caused my work on the list feature stop for the time being.\nOn the other hand reordering should still be working, as well as the toggling of actions on the left and right side. I was just going to clean up my code and see if there was a better way of implementing lists before submitting a pull request.  Feel free to use my code as a starting point and submit a pull request as I am not sure when I can finish my work.\nPlease check out my modified repositories, to see how I implemented it:\nhttps://github.com/MacNCheeze/meteor-ionic\nhttps://github.com/MacNCheeze/contacts\nAlso feel free to check out the working demo http://meteoric-contacts-list.meteor.com/\nIf you have any specific questions related directly to my code I'd be more than happy to try an answer them :)\n. ",
    "timbrandin": "This is awesome! +1\n. So we're just missing the swipe to edit/delete thing now right?\n. I guess this (being able to open and show fullscreen pictures/videos with zoom) is the reason why we want the ion-scroll: https://www.youtube.com/watch?t=168&v=UTcx-lqnzrE\n. Doesn't seem to work for both horizontal and vertical scroll at the same\ntime, is that a feature or an issue?\n. Great! :)\n. I don't even think you need to include the jquery package these days, I mostly use jquery from the instance like this:\nTemplate.tpl.events({\n  'click .btn': function(event, instance) {\n    instance.$('.class').toggleClass('active');\n  }\n});\nTemplate.tpl.helpers({\n  helper: function() {\n    var instance = Template.instance();\n    instance.$('.class').addClass('active');\n  }\n});\nTemplate.tpl.onCreated(function() {\n  var instance = this;\n  instance.$('.slick').slick();\n});\n. Wow, cool Lai!\nI can't wait until we also make meteoric framework agnostic (react or\nblaze) ;)\n2015-07-27 17:34 GMT+02:00 timothyarmes notifications@github.com:\n\n@rcmai that's excellent.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/pull/221#issuecomment-125247312\n.\n\n\nCheers,\n// Tim Brandin @timbrandin https://twitter.com/#!/timbrandin\nhttp://timbrandin.com\nhttp://studiointeract.com\n. Would be nice with something extensible! For example the dates could be enabled/disabled or set in a different color depending on some collection data etc.\n. ",
    "gregheth": "+1\nHow can I help?\n. Thanks for the software update!  Just what I needed.\n(I am new to Github. I want to update the Meteoric documentation for this.  Where is the recommended procedure to do this?  A \"pull request\" I think. )\n. In the ionSideMenuContainer directive you put   side=\"left\"\n{{#ionSideMenuContainer side=\"left\"}}\n. ",
    "zhongwus": "Is there any way that we can use edit and delete function without Angular? @MacNCheeze @nickw \n. ",
    "xpluscal": "+1\n. +1\n. +1\n. +1\n. +!\n. @bryantpatterson How did you monitor the scrolling content?\n. Hey @daniel,\nare you using iron-router to get to the blog post?\nIn this case you probably have the _id as a parameter available. It is accessible in your modals-template via:\njavascript\nTemplate.yourTemplate.helpers({\n    collection: function () {\n        return Collection.findOne({_id: Router.current().params._id});  \n    },\n})\nHope this helps\n. As far as I can see, this is the default behavior for modals in ionic on\nbigger screens. So this is rather something about ionic than meteor-ionic.\nOn Di., 6. Okt. 2015 at 23:25, kevohagan notifications@github.com wrote:\n\nI also found this problem\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/328#issuecomment-146006519\n.\n. +1\n. Since @nickw kind of discontinued this repo, is there anybody willing to help implementing this?\n. @nickw Do you see any alternatives to React as a cross-platform-ui-framework?\nAngular might be a choice now but I don't see any Integration for Ionic V2 coming up.\n. Same here\n\nmeteorjs3000 notifications@github.com schrieb am Do., 26. Nov. 2015 22:37:\n\nOMG, I built entire apps using meteor-ionic, but now I need to use an\nionic package that will continue to be maintained.\nI know neither Angular nor React, which one should I learn if I want to\ncontinue using an actively-maintained Ionic package? Is there another UI\nsimilar to Ionic that will be better supported by Meteor's ecosystems?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/340#issuecomment-159996514\n.\n. @malixsys : Do you know more about this? This is still tied to angular isn't it?\n. @malixsys \nWell, I guess this is more of a personal choice.\nI prefer working with Blaze since it feels a lot more natural to work with in Meteor to me. \n\nThat’s what made this package so promising.\n\nOn 22 Jan 2016, at 22:41, Martin Alix notifications@github.com wrote:\nDepends what you mean by \"tied\" but yes...\nhttp://blog.ionic.io/angular-2-ionic http://blog.ionic.io/angular-2-ionic\nIs this a bad thing??\n—\nReply to this email directly or view it on GitHub https://github.com/meteoric/meteor-ionic/issues/340#issuecomment-174059719.\n. \n",
    "jorjordandan": "@nickw Hey Nick, I want to try to see if I can get this sortable-deletable functionality into a state where I could submit a PR. My plan is to add an additional template called ionListButton? I was thinking I'd like the syntax to look like (inside the ionItem):\n```\n  {{#ionListButton action=\"delete\" side=\"left\"}}\n      {{>ionIcon icon=\"close-circled\"}} \n   {{/ionListButton}}\n{{#ionListButton action=\"reorder\" side=\"right\"}}\n      {{>ionIcon icon=\"drag\"}}\n    {{/ionListButton}} \n```\nThis would also allow for a single button to do both actions, e.g. \n{{#ionListButton action=\"reorder delete\" side=\"left\"}} //etc.\nthe side argument specifies which side you are toggling.\nThis is pretty well in line with how the ionic framework does it. I was planning on keeping the data-ion-list toggle on the buttons to trigger the delete/reorder states:\n<button class=\"button button-clear\" data-ion-list-toggle=\"left\">{{> ionIcon icon='ios-trash-outline'}}   \n </button>\nNo need for classes on the list item, etc... Do you think that would be a good way to do this? \nI've created a fresh fork of meteor-ionic and pulled all @MacNCheeze's code in. I'll even test it before I submit a PR this time... haha\n. @richagoel You need to be using a meteor-ionic package that supports deleting first. If you are using the latest version of the package from github, then you can follow the guide here. If you aren't using the latest version, you should clone the latest version into your package folder in your project, and add it from there. \n. You can't just use the latest version of the meteoric package - you have to use the actual package from github. The changes to add sort and delete have been added recently and the changes haven't been published to the meteor package system yet. That's why you need to use the package from git hub, and use it locally in your project.\n. Just needs to be wrapped in an afterFlush likely.\nTemplate.slideBox.rendered = function() {\n   Tracker.afterFlush(function(){\n      IonSideMenu.snapper.disable();\n  }\n};\n. Should be fixed by #269, can't replicate with the console anymore.\n. I had this twice, meteor update fixed both times.\n. I think the issue probably comes from the fact that you're using a meteor wrapper for the telerik plugin instead of regular cordova. I can't wait to be able to use WKWebviews for meteoric either, but there are probably a few wrinkles to be ironed out in both those repos. I even tried to write my own WKWebview wrapper, but got stuck at some authentication issues.... Good luck!\n. It works fine, but it's not css only.. a bit of javascript is needed to add the has-input class ... this works:\n$('.item-floating-label>input').on('keyup', function(){\n  $(this).val() ? $(this).prev().addClass('has-input') : $(this).prev().removeClass('has-input'); \n});\n. After I'm signed in the sliding works fine - probably has something to do with the useraccounts:ionic package.. I'll keep exploring....\n. for those who hit this issue I used useraccounts:ionic@=1.12.0 and that fixed it right up. I'll file an issue in their repo, but leave this open for a bit in case anyone else has the same problem.\nEDIT: 1.12.1 also works fine.\n. I thought there might be confusion with the id that's used for the path helper ( _id) .... wanted to be more explicit about which id we were talking about. But it's not really intuitive is it? I tried passing the id through an id attribute before I checked the docs, so I guess it would have been nice if that had just worked. \n. I'm going to revert that readme, I wasn't thinking about the fact that meteoric-sass is it's own package\n. Probably a good idea, since without css the spinners take up the whole page. There was no dependency listed for meteoric:ionic-sass in the package.js or versions.json - the only place I found a reference was in the guide. Did you just mean I should specify the version in the guide? Or are you adding the dependency some way that I'm not familiar with? \n. Okay I'll take care of those issues as soon as possible, thanks for the feedback!\n. Changed <div> to <i> element which fixed display issue, and matches the ionIcon tags anyways.\n. The android spinner was set up differently. All set now!\n. added the ability to pass \"both\" to the [data-ion-list-toggle] in a button, which will show the hidden buttons on both sides of the list, so that you can sort and delete at the same time.\n. Demo repo at http://reorderable_contacts.meteor.com/\n. Absolutely, thanks! I'll do both asap.\n. Hmm good question. The question actually probably belongs at the meteoric:ionic-sass github repo since that's where the scss files come from. This repo doesn't include the actual scss files. Maybe repost the question there...\n. Yeah, I think I noticed that as well. I'll submit a PR to fix it.\n. It's a bit more complicated that I thought. The issue is caused by the commit you mentioned, but when there is data from the router, then there are two contentFor blocks: one in the template, and one in the ionView. \nThe second contentFor (which turns out to be the one from the ionView template) cancels out the first, and that's why the data always overrides the parameter. To fix this, I need to figure out how to tell if a contentFor block already has any content, so I can create a condition in the ionView template. I don't know how to do that. but I'm working on it...\n. The easiest way to set up the example applications is just to clone their repos or download the zip files from their repositories, for instance the contacts repo is here. Then just run meteor. You may have to run meteor update if you get an error when you try to start them.\n. @judsonbsilva this is a pretty common problem - in my experience, just running meteor update fixes the issue. \n. No - just is there because I needed it for testing. Thought I would leave it in until the new ionic stylesheets were merged into ionic-sass, so you (or anyone) could easily verify that it's working correctly, without downloading an extra package etc.\n. it is, but if no icon is passed, the this.data.icon doesn't exist, and you can't set the default value in the helper because the data is read only .... aaaand as I was typing this I realized I could just set the default in the rendered callback... doh!\nThe icon name still has to go into the class list for the css to be applied though. I'll do that now..\n. ",
    "richagoel": "I tried to embed changes to my code you have specified in diff MacNCheeze/contacts@02e5d39#diff-70eb3c2b2e74bea5660d5b941ef44fa8, but my delete button on top left does not work. It is not showing minus circles on the list. Means nothing happens when I click trash button. Please help me out what can be that I am missing.\nI do not need reordering so I just edited contacts.html file and js file to return collection. Please help me out. \n. @jorjordandan Thanks for the response. I have already added the latest versions of the packages you have mentioned. And I have changed the code for delete button as you told in guide. But now I am getting the error \nException in queued task: http://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:2979:24\nhttp://localhost:3000/packages/spacebars.js?7bafbe05ec09b6bbb6a3b276537e4995ab298a2f:72:41\nhttp://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:1865:22\n_withTemplateInstanceFunc@http://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:3476:16\nhttp://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:1864:54\n_withCurrentView@http://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:2197:16\nSpacebars.include:anonymous@http://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:1863:34\n_compute@http://localhost:3000/packages/tracker.js?6d0890939291d9780f7e2607ee3af3e7f98a3d9c:327:36\nComputation@http://localhost:3000/packages/tracker.js?6d0890939291d9780f7e2607ee3af3e7f98a3d9c:243:18\nautorun@http://localhost:3000/packages/tracker.js?6d0890939291d9780f7e2607ee3af3e7f98a3d9c:566:34\nautorun@http://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:1875:29\nhttp://localhost:3000/packages/spacebars.js?7bafbe05ec09b6bbb6a3b276537e4995ab298a2f:71:17\nfireCallbacks@http://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:1941:20\nnonreactive@http://localhost:3000/packages/tracker.js?6d0890939291d9780f7e2607ee3af3e7f98a3d9c:593:13\nhttp://localhost:3000/packages/blaze.js?a5c324925e5f6e800a4c618d71caf2848b53bf51:1938:24 .......\nAnd no list is coming on the screen. Only header is coming. \nPlease help.\n. ",
    "aesmon": "I am using HammerJS, came across some quick examples and ended up with this - http://imgur.com/me2IPuQ\nNot sure if this already exists and I'm wasting my time or would others get some use out of it as well?\n. Haven't experienced this issue and couldn't reproduce on Meteor@1.2.1\n@JoeyAndres Awesome repo, just checked it out. \n. @JoeyAndres I know it may be an off-topic, but since it seems you are actively working with Ionic and Meteor mobile development, have you experienced disappearing items when showing/hiding the keyboard? I find it to be quite a problem that I keep experiencing over and over. The item is exactly there, but is not rendered anymore, when I focus the \"invisible\" input then it will show up again. It looks like Uiwebview limitation in regards to CSS, but I fail to see any consistent pattern with this happening. Seems like padding on elements will cause it most often. Is it a common issue? This is the first hybrid app I am developing.\n. @JoeyAndres Thanks for the input. It might have been the UiWebView limitation. I have given Meteor 1.3 beta a spin and WkWebView eliminated these rendering problems for me. Have you tried it yet? \n. I believe the design goal was translating what's in the Ionic framework and the core most important features. Since this package is no longer maintained I would simply create a local copy and modify it to your liking. That is what I am doing right now and had to fix a lot of issues with keyboard/input on top of adding my own features to these items. I don't see anything wrong with that, I am passing a data-action argument to my ionItem template to open actionSheet which I extended to show user profile.\n. I believe this package is no longer maintained. Seems that people are migrating towards React, not sure what the next big thing will be, I found reapp to be a bit buggy.\nAtm I'm just extending Meteoric Ionic features on my local project\n. ",
    "kartikTT": "@aesmon did you end up finishing that implementation? Would be very useful!\n. ",
    "vertangelx": "Amazing work integrating ionic into Meteor! \nI'm moving over to Ionic and would love to be able to use <ion-scroll> with a feature to automatically scroll to the bottom as more items get added inside <ion-scroll>.\n. I decided to start learning Angular as the Ionic framework appears to be the best for developing cross-platform apps. \nEven though React seems so cool. And Angular2's arrival will cause some rewriting of code. Will love to have more people's opinions on how we should proceed from here.\n. ",
    "miri-am": "+1\n. ",
    "markdowney": "+1\n. ",
    "macroramesh6": "+2\n. ",
    "jeangui": "+1\n. sorry I didn't see there was one example in the demo application.\n. ",
    "sprestel-github": "+1\n. ",
    "fishdude": "+1\n. +1 on this. \n. ",
    "mkimmet": "+1\n. This looks like it might be the problem with ionic-sass, checkout the installation section on the ionic-sass readme:\nhttps://github.com/meteoric/ionic-sass\nIt references two other issues which might help:\nhttps://github.com/meteor/meteor/issues/2606\nhttps://github.com/meteor/meteor/issues/2796\n. ",
    "phoue": "+1\n. I find a solution, using the webkitTransitionEnd. When the transition start, stop scrolling immediately, and after the transition done, resume the scrolling. Here is my code:\n'webkitTransitionEnd .view':function (event, template) { \n            //console.log('transition end'); \n            $('.overflow-scroll').css('-webkit-overflow-scrolling', 'touch');/* lets it scroll lazy /\n            $('.overflow-scroll').css('overflow-y', 'scroll');\n        },\n   'click .my-flag' : function(event, template) { // .my-flag could be a tags or any other ...\n          // console.log('transition start');\n           $('.overflow-scroll').css('-webkit-overflow-scrolling', 'auto'); / stop scrolling immediately */\n           $('.overflow-scroll').css('overflow-y', 'hidden');\n  }\n. ",
    "rafaelcorreiapoli": "+1\n. The CSS worked fine but the ionic-material package also comes with a js (to apply ink effects, etc) that requires Angular, so it does not work with Meteor =( How to solve this ?\n. +1!!\n. When I open on the browser it works\n\n. ",
    "ghost": "+100 :)\n.  Would be nice to have!\n. Perfect. Everything is working great. Thanks.\n. @xpluscal This is how I am handling it in a messaging app I have running on iOS. As a hobbyist developer, I can't guarantee this is the proper way to do this, but it works. The first line scrolls to the bottom upon render, and everything from this.find on handles scrolling on each additional message, similar to the Messages app on iOS.\nThe uihooks portion came from Discover Meteor's Animations chapter (https://book.discovermeteor.com/chapter/animations) which is behind the paywall unfortunately.\njavascript\nTemplate.messagesIndex.onRendered(function () {\n  // Auto scroll logic\n  $('.content.overflow-scroll').scrollTop($('.content.overflow-scroll')[0].scrollHeight);\n  this.find('#messages-list')._uihooks = {\n    insertElement: function (node, next) {\n     $(node).insertBefore(next);\n     var scrollDiv = $('.content.overflow-scroll')[0];\n     $('.content.overflow-scroll').scrollTop($('.content.overflow-scroll')[0].scrollHeight);\n    }\n  };\n});\n. ",
    "lonehacker": "+1\nAny idea what it would take to implement this? I'm not new to javascript development, but I've very little idea about how meteoric works. \n. From the README in the link -\nThe angular services ionicMaterialInk and ionicMaterialMotion are used to activate animations\nYou'll probably need to port these out of Angular somehow to use with meteoric\n. ",
    "timothyarmes": "\n100 too!\n. @elGusto Just wondering if you'd started working on a refactoring?\n. @rcmai that's excellent.\n. Hmm, it seems that disconnecting the hardware keyboard 'solves' the issue. \n\nThx.\n. ",
    "sjt-mbed": "+1.\n. ",
    "elie222": "+1\n. My issue is not being able to do a horizontal scroll on a custom div\n. Thanks a lot for the super quick responses\n. You could use Javascript to find which item is top of the list on screen when the user navigates away from the page, save it as a query in the route and then use it if it exists when the user navigates back to the page. \n. Save it as a query parameter *\n. Slight mistake. ionItem does work the same way as on this line:\nhttps://github.com/meteoric/meteor-ionic/blob/master/components/ionItem/ionItem.js#L75\nThe real issue seems to be with the guide that says to use path as follows:\n{{#ionItem path=\"item.detail\" _id=\"\" data=\"\" query=\"\" hash=\"\" class=\"\"}}...{{/ionItem}}\nThe problem with this is that _id on this line isn't used to build the path, the parentData _id field is.\n. Made a pull request to fix this here: https://github.com/meteoric/meteor-ionic/pull/230\n. There was a breaking change. I'd try changing your code to work with the\nnew syntax\nOn 10 Sep 2015 11:38 am, \"MaX\" notifications@github.com wrote:\n\n@nickw https://github.com/nickw Thanks for responding Nick. Yes you are\nright they are working fine in your meteorhunt example, nevertheless my\ntabs are only working when I change Template.currentData() back to\nTemplate.parentData(1) like it was and I don't really understand why.\nI also had a look at this \"Meteor data context reference\" page\nhttps://docs.google.com/spreadsheets/d/14DTa0096y7cA1wkbUXUo_lLPwHJji0ft14_9EnArhsM/edit#gid=0\nbut I do not understand yet why this change prevented my tabs from\nworking, I guess I will have to investigate more.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/215#issuecomment-139168466\n.\n. Could you post the code that you're trying to use that isn't working? For me it works fine without hardcoding. And Line 46 might well need to be fixed too, but it's working fine for me as it is.\n. So the other parentData line doesn't need to be changed?\nOn 5 Jul 2015 12:47 am, \"totorokk\" notifications@github.com wrote:\nEmbarrassing but I found it was a local function in the same .js file\nprevent the file to be properly loaded. After removing that function,\neverything works just fine now.\nAgain, thanks a lot for the fix!\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/pull/230#issuecomment-118557090\n.\n. It makes sense that that line should also be switched. The platform used\nreally shouldn't make a difference. It does work for me as is, although I'm\nnot 100 percent sure why. I'll check tomorrow what happens if I change it\nto currentData\nOn 5 Jul 2015 1:15 am, \"totorokk\" notifications@github.com wrote:\nhmm... I was using currentData() in Line 46 when I said \"everything works\njust fine\". After I switched back to parentData(1), one click on the tab\nonly does the routing, and a 2nd click on the same tab is needed to switch\nit to active. Refreshing the page would also remove active from the tab.\nSo I think Line 46 might still need a fix.\nThis is tested with chrome dev tool in both ios and android devices, not\nwith emulators though. And you said you didn't have similar issue?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/pull/230#issuecomment-118557936\n.\n. I made the pull request. See here:\nhttps://github.com/meteoric/meteor-ionic/pull/233\n\nFor me it was working either way. Not sure why though. Seems like currentData() is what it's supposed to be.\n. Fixed the conflict\n. @nickw this branch was never merged\n. Yup. Was a merge fail. Should be good now.\n. Okay! Sloppy work by me! Will look at it again tomorrow\nOn 10 Aug 2015 11:38 pm, \"Nick Wientge\" notifications@github.com wrote:\n\nActually it looks like the last paragraph and code block should be a part\nof the Modals section above.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/pull/233#issuecomment-129599192\n.\n. I think it should be alright now\n. This is how the meteorhunt and contacts demos do it:\n\nTemplate.usersShow.rendered = function () {\n  this.autorun(function () {\n    if (!this.subscription.ready()) {\n      IonLoading.show();\n    } else {\n      IonLoading.hide();\n    }\n  }.bind(this));\n};\n. I'm running the app in a browser\n. My code looks something like this:\n<div class=\"item item-avatar\">\n        <img src=\"/some-image.png\">\n        <h2>John Smith</h2>\n        <p>Some text</p>\n    </div>\nGoing to the image url in the browser loads the correct image.\n. No idea what happened. Images are now showing. After restarting my computer things are magically working again.\n. ",
    "iwoork": "+1\n. ",
    "lucnat": "+1\n. Same problem here. Inputs seem to be a big issue... Also got slight problems with inputs on under iOS. \n. Oh...my bad. It works now, thanks!\n. ",
    "JoeyAndres": "To those who care, ionScroll is now implemented in https://github.com/JoeyAndres/meteor-ionic/commit/e4d51bc043ed5a225533f83d59096971d7c9982c or jandres:ionic@0.1.42\nSee http://jandres-ionic.meteor.com/scroll for demo\nAll paremeters except onScroll/onZoom won't work. This is because I don't see iscroll having .off for events, and I don't want that kind of memory leak even though the chance of changing events is small. I have forked iscroll and have begun \"gulpifying\" it. It is ancient and needs massive re-engineering.\n. @timbrandin Ill push a fix. This just a single param to iscroll lib.\n. @timbrandin This is actually a feature in ionic, which is called \"locking\". It defaults to true. Set it to false,\nhandlebars\n{{#ionScroll direction=\"xy\" zooming=true locking=false}}\n  <img src=\"map.png\">\n{{/ionScroll}}\nAgain, all parameters except event parameters (onscroll, onzoom) are not implemented atm.\n. ionInfiniteScroll is now implemented in my fork in my fork. See demo here:\nhttp://jandres-ionic.meteor.com/lists/ionInfinitescroll (I suggest go to mobile mode for a more pleasant experience).\nDocumentation here (it's very primitive so you have to look for it under blaze section in sidebar):\nhttp://meteoric-doc.meteor.com/\n. A little late but, In your scss file:\nscss\n.ion-slide {\n  overflow-y: scroll;\n}\n. @mordka Take a look at http://iron-meteor.github.io/iron-router/#inheriting-from-route-controllers\n. For once, this.data is read-only and shouldn't be written on:\n\nThis property provides access to the data context at the top level of the template. It is updated each time the >template is re-rendered. Access is read-only and non-reactive.\nIt would makes sense that if no data context is given, then this would be a null.\n\nI'll refactor and post a fix here (and push it on my local fork).\n. @aesmon Got a notification. Thanks man. Really appreciate it.\n. @aesmon I have created meteoric mobile website that utilized the use of keyboard heavily, but have not come across this problem. We have yet to release it to android/apple appstore though, just mobile browser.\n. @aesmon Nope. TBH, I'm only interested with the \"better testing integration\" or just testing in general. Which are external packages/modules like chimp.js, velocity, etc. Last time I checked, chimp.js have a primitive implementation of multi browser testing (hardcoded to 2). I'm just hoping that this can be truly variable next time.\n. This is solved in my fork jandres:ionic v0.1.41. See my demo. To do so, simply:\nhtml\n{{#ionContent hasBouncing=false}}\n            <div class=\"padding\">\n                <h1>Such Ironic</h1>\n                <h2>Very meteor</h2>\n                <h3>Much blaze</h3>\n                <img src=\"doge.jpeg\" style=\"width: 100%;\"/>\n            </div>\n{{/ionContent}}\nThat's it. It automatically detects if {{#ionSideMenuContainer}} is one of its ancestor and if so, applies the hasBouncing flag. Otherwise, it just ignores it.\nTODO: Make this platform specific like in angular ionic.\n. ",
    "ccorcos": "+1\nWay to go with this project by the way, this is amazing! I'd love to help, but I'm kind of stuck right now because I'm not sure how you get all that animation!\n. They do a little bit, but it would be super helpful just to have some kind of guide that helps me understand the design of this project. I don't know much about block helpers {{#iconic-something}} and it seems those are used everywhere.\n. To answer your question, a 1-2 page guide would be enormously helpful ;) \n. Thats what I wanted to hear :+1: \n. Looking at the demo projects, I realize your guide says to add those dependancies but never meteoric:ionic. lol. you may want to add that...\n. What the hell. I was wrong... must have missed it!\n. ",
    "Evrei": "+1 to guide\n. ",
    "niallobrien": "This is pretty awesome. At first I was thinking that surely the styles would be enough, but you quickly realise that there's a lot more to a native feeling app than just the styles. Your demos are very responsive which is great. Eagerly awaiting more directive conversions & docs.\n. ",
    "benstr": "@nickw great start on the guide. I like how you explained Blaze blocks really well by contrasting them to inclusions. \nI just built a similar package to meteor-ionic but for Material Design (not a public project yet, it was for client work). Looking forward to contributing. Will be building a meteoric app this weekend and will record my development then circle back and make a step-by-step how-to. Bug me next Tuesday if you do not see anything, haha\n. @hettema my optimism always gets the best of me. LOL\nI got the bones started, check it out, meteoric-projects. \n. Thanks @nickw. PRs totally welcome by anyone. I just closed on two large projects. With my new schedule I will probably release one chapter a week.\n. I agree with @nickw as a general template we should keep things as simple as possible so more people can adopt and maintain it.\n. In my Meteor projects (mostly enterprise, SEO is not an issue) I have three guidelines on this subject. \n1. All parameters need to be passed as a query.\n2. If a parameter must be baked into the route then the parameter must always take a \"sub-level\" position, as opposed to a \"top-level\" position when compared with other routes on the same level..\nWrong: products/123\nCorrect: products/details/123\n3. Any route related Sessions are set in IR action:\n. @rclai I am glad you have it fixed. @nickw I followed your suggestion and I still get the loader stuck on the page.\nController\nProjectsController = AppController.extend({\n  subscriptions: function() {\n    return Meteor.subscribe('gcProjectsMyIndex');\n  },\n  data: function() {\n    return {\n      projectsIndex: Projects.find({},{sort:{jobNumber:-1}})\n    };\n  },\n  action: function() {\n    if (this.ready()) {\n      this.render('projectsIndex');\n    } else {\n      this.render('loading');\n    }\n  }\n});\nLoading HTML\n<template name=\"loading\">\n</template>\nLoading Logic\nTemplate.loading.rendered = function() {\n  IonLoading.show({delay: 50});\n};\nTemplate.loading.destroyed = function() {\n  IonLoading.hide();\n};\n. @rclai I do not see it, am I missing somthing?\nhttps://github.com/EventedMind/iron-router/blob/devel/Guide.md#the-subscriptions-option\n. https://github.com/meteoric/meteor-ionic/pull/26\n. @nickw how do things look?\n. @nickw is this what you were thinking?  You guys can edit the Guide as you want. Added probably more than needed.\n. Just manually tested.\n. @nickw we should probably make a develop branch. This would allow the public to contribute in a safer way. \n. PR #30 \n. @nickw my last PR did not get pushed to atmosphere yet I believe.\n. Sorry about that guys, I usually add Lo-Dash without thinking. This time it bit me because underscore is not as magical. I will make sure not to make the mistake again on this framework :)\n. Yeah that should. I will look into this. In the meantime try calling route=, you do not need path since you are not including additional route params.\n{{#ionItem route=\"iTrackStores\" buttonRight=true class=\"item-icon-right\"}}\n  iTrack {{>ionIcon icon=\"ios-arrow-forward\" class=\"assertive\"}}\n{{/ionItem}}\nmore info under Guide.md\n. It works fine for me. Can you verify the package version is version: \"0.1.12\"?\nWe were having this issue in version: \"0.1.10\" and since has been fixed.\n. You are right, you cannot pass spacebars into another spacebars but you can pass a template helper or a key from this. In your case this would work.\n{{#ionItem path=path iconLeft=true iconRight=true}}\nHere is what happened... \nAnything wrapped in \" \"  is considered a literal string. If it does not have the parentheses then the template will look for javascript to provide the string dynamically.\nP.S. Here is a Template Helper example...\nTemplate.mainMenu.helpers({\n  pathUrl: function(){\n    return \"/\"+this.path\n  }\n});\n{{#ionList}}\n  {{#each menus}}\n    {{#ionItem path=pathUrl iconLeft=true iconRight=true}}\n      {{> ionIcon icon=\"ios-checkmark\" class=\"positive\"}}\n      {{title}}\n      {{> ionIcon icon=\"ios-arrow-right\"}}\n    {{/ionItem}}\n  {{/each}}\n{{/ionList}}\n. @linhkurt good to hear. Please close this issue.\n. You mean this? https://github.com/meteoric/demo\n. hahahaha\n. I am using it for a nationwide enterprise iPad app right now. Client is very happy and I enjoyed using it.\n. @linhkurt do you have a repo I can look at? From your code above I still see : instead of = for assigning context.\n. I can take care of that, on my todo for today @codebreach. Will update this thread.\n. @codebreach version 0.2.0 has been pushed to atmosphere\n. @aesmon is correct. Closing this issue.\n. Try wrapping your view in a subReady if statement.\n{{#if Template.subscriptionsReady}}\n {{#ionView}}\n    {{#ionContent}}\n        {{#ionList}}\n            <div>\n              {{#each shops}}\n                    {{> shopItem}}\n              {{/each}}\n            </div>\n        {{/ionList}}\n    {{/ionContent}}\n  {{/ionView}}\n{{/if}}\n. oops haha\n. Hmm so somthing like\nhrefType=\"url\" -or- hrefType=\"path\" ?\nWhat should be the default is one is not specified?\n. Nice! ok will do.\n. ",
    "rjakobsson": "One thing I just noticed is that the backUrl in a nav view is set only when you specify some kind of data in the \"data\" parameter in your router setting. If you don't set data, it won't work.\n. @nickw Yes I'll do that. \n. @rohanray I'm guessing that @nickw is referring to the upcoming Meteor 1.2 update, which should allow for custom operations at build, see https://quip.com/RXFlAk9Rc2xI . \n. ",
    "hettema": "@benstr Bugging you as requested. I need all the step-by-steps I can get my hands on ;)\n. Thanks @nickw, I haven't gotten this to work yet but I'll report back with any progress I make. \n. ",
    "everywhereis": "@benstr dude, that looks awesome!\n. ",
    "joshua1": "@benstr I am interested in your package based on material design. can you please make it available or provide pointers as to how you had it done\n. @nickw this will be really nice to have. were you able to check this. Thanks\n. @nickw any response?\n. ",
    "Slava": "As far as I understand you can license your work under MIT and you should mention the libraries you use in your LICENSE file.\n. ",
    "maabed": "@nickw Works fine when deploy using with debug option in both modules.io or meteor.com servers\nmeteor deploy xxx.meteor.com --debug\nAny advice?\n. Yes its really strange,  the debug flag don't minify the app files and the package version is 0.1.7\n. ",
    "umairsiddique": "I'm also experiencing it on my local development project. \n. Wow. For some reason it was stuck at 0.1.0. I added the package hardly an hour ago. I upgraded it to 0.1.11 by running \"meteor update meteoric:ionic\" and it's working fine. Thanks a lot.\n. ",
    "PolGuixe": "I have a OnePlus One running the Meteor Hunt and the Contacts application and I can say that it is laggy as well. \n. Same problem here but the button is the one generated by {{> quicForm...}}\n. It didn't work.\nIn my case I want to trigger it from one of the AutorForm.hooks\nHere is the code: \n```\nAutoForm.hooks({\n  'user-categories-form': {\n    onSuccess: function (operation, result, template) {\n      Session.set('ionNavDirection', 'back');\n      Meteor.setTimeout(function () {\n        Router.go('/settings');\n      }, 100);\n    },\nonError: function (operation, error, template) {\n  alert(error);\n}\n\n}\n});\n```\n. It doesn't :(\n. Ok, that works!  Many thanks!\nLet us know when there will be a more \"elegant\" solution. \nI´ll paste the working code as a reference: \n```\nAutoForm.hooks({\n  'user-categories-form': {\n    onSuccess: function (operation, result, template) {\n      $('[data-nav-container]').addClass('nav-view-direction-back');\n      $('[data-navbar-container]').addClass('nav-bar-direction-back');\n      Router.go('/settings');\n    },\nonError: function (operation, error, template) {\n  alert(error);\n}\n\n}\n});\n```\n. Same problem here.\n. @nickw Will this be fixed in a coming release? \n. ",
    "davidwoody": "Something like this should work - https://github.com/meteoric/meteor-ionic/commit/093ae320f874c9ddd7867048a299b05a5df83559\n. ",
    "geritol": "https://github.com/meteoric/demo\n. Tried your code too, but for me this makes the same thing happen. I have two side menus. My code is prety much the same exept i used {{#ionSideMenu side=\"left\"}}.\n. that both sides are active. \nexample (working with drag only) here:\nhttp://meteoric-sidemenu-test.meteor.com/ \n. code here:\nhttps://github.com/geritol/meteoric-sidemenu-test \n. Working here too. \nThanks!\n. ionNavBar in the layout.\n. ok, thanks!\n. https://github.com/driftyco/ionic/issues/957\n. Thanks! Seems working.\nis there a way to add it to eg. a footer created like this?\n{{#ionFooterBar class=\"bar-light\"}}\n{{/ionFooterBar}}\n. Thanks fot the quick answer!\n. Not working. What i do for know is that I call .click() on a button with the proper attribute.\n. Not saying this is the best option but here is what I used:\nYour nav button (you can hide it optionally)\njavascript\n<a href=\"/\" id=\"backToMain\" class=\"button button-clear\" data-nav-direction=\"back\">\n{{> ionIcon icon=\"ios-arrow-back\"}}\n</a>\nAnd then do this when you want to go back:\njavascript\n  $('#backToMain').click()\n. Man... If you think so, then use it so!\nRead the readme. -->\n\"I'm not a fan of trying to force-fit Angular into Meteor, so I wanted to see if I could rewrite Ionic specifically for Meteor.\"\n. Or you can use other layout template for routes with side menu. So you don't have to deal with opening closing, enabling disabling it.\n. ",
    "jaskinn": "There seems to be a default setting ('disable: 'none'), that you can set to whichever side you want. ie disable: 'right' - taken from the Snap.js documentation.\n. It seems that the click event doesn't register.\n. +1\n. +1\n. I think this is a good work around.\n. ",
    "dancering": "Try this:\nTemplate.nameXXX.rendered = function () {\n    IonSideMenu.snapper.settings({disable: 'right'});\n};\nIt's working for me.\n. All is working again. Thanks!\n. This code in Template.nameXXXX.rendered will do it:\n```\nSession.set('width', $('.snap-drawers').width());\n$(window).resize(function() {\n    Session.set('width', $('.snap-drawers').width());\n});\nTracker.autorun(function () {\n    if (Session.get('width') >= 768) {\n        $('.snap-content').css('-webkit-transform', 'translate3d(266px, 0px, 0px)');\n    } else {\n        $('.snap-content').css('-webkit-transform', 'translate3d(0px, 0px, 0px)');\n    }\n});\n```\n. Try this code on your rendered function:\nIonSideMenu.snapper.settings({disable: 'right'});\n. I have attached screen to show you how it works. IonSideMenu has to be available on the console. Can you list the packages that are you using?\n\n. Good to know it's working.\n@MFQ Please close the issue. Thx.\n. If you are thinking in something like this I can explain how to do it.\n\n. For event access to currentSlide I use the trigger 'onSlideChanged' from the component:\nslides = [\"Timeline\", \"Activity\", \"Messages\"];\nTemplate.sample.rendered = function () {\n  Session.set('title', slides[0]);\n};\nTemplate.sample.helpers({\n  title: function () {\n    return Session.get('title');\n  },\n  slide: function (idx) {\n    return slides[idx];\n  }\n});\nTemplate.sample.events({\n  'onSlideChanged': function (slide) {\n    Session.set('title', slides[slide.index]);\n  }\n});\nThe rest it's just CSS customized.\nThe template looks like this:\n<template name=\"sample\">\n{{> ionNavBar class=\"test positive-bg\"}}\n{{#contentFor \"headerTitle\"}}\n<h1 class=\"title\">{{title}}</h1>\n{{/contentFor}}\n{{#ionView class=\"test\"}}\n{{#ionContent class=\"header\"}}\n{{#ionSlideBox}}\n{{#ionSlide class=\"light-bg\"}}\n{{#ionPane}}\n<p>Content for {{slide 0}}</p>\n{{/ionPane}}\n{{/ionSlide}}\n{{#ionSlide class=\"light-bg\"}}\n{{#ionPane}}\n<p>Content for {{slide 1}}</p>\n{{/ionPane}}\n{{/ionSlide}}\n{{#ionSlide class=\"light-bg\"}}\n{{#ionPane}}\n<p>Content for {{slide 2}}</p>\n{{/ionPane}}\n{{/ionSlide}}\n{{/ionSlideBox}}\n{{/ionContent}}\n{{/ionView}}\n</template>\nYou can use same idea just putting all ionSlideBox inside #contentFor \"headerTitle\" and play with CSS\n. ",
    "weijian19391": "Hi all! \nI've tried to disable the side menu on certain templates, but the code \nTemplate.nameXXX.rendered = function () {\n    IonSideMenu.snapper.settings({disable: 'right'});\n}; \nis not working for me. Can i know if there's a newer api for doing that? \n. ",
    "AnkitTheCoder": "I am seeing the same issue as @benstr. While using the iron-router's default loading hook, the app never goes to the index page, but rather gets stuck on loading template. The only difference in terms of the code, from what Ben has posted, is that I am not explicitly using the this.ready() call. I am relying on iron-router calling the loading template, since my templates uses waitOn. \nI too am using rendered and destroyed within the loading template. I am seeing this more prominently when using trying on mobile app (using meteor run ios-device command).\nAny suggestions/ideas on how to fix this?\n. ",
    "aunz": "Yes it's correct, I am using the static CSS. I presume users shouldn't need to toil away the CSS much. If they need to change any rule, they can always override in a new CSS file? cheers\n. ",
    "fpoirier1": "This worked for me.\n```\n{{#contentFor region=\"headerTitle\" data=this}}\n    {{_id}}  won't show up \n{{/contentFor}}\n{{#ionView}}\n    {{#ionContent}}\n       {{_id}}  shows up \n    {{/ionContent}}\n{{/ionView}}\n```\n. Does issue # 1 has been fixed? \n\nIssue # 1: iOS inputs don't scroll into view if they are below the keyboard\n. Putting data-ion-menu-close on every link of the app wouldn't be an optimal solution for this. I was talking about something similar to this https://github.com/driftyco/ionic/blob/master/js/angular/directive/sideMenuContent.js#L63.\n. Pretty sure it is because the .fullscreen class is missing. See screenshot from Safari Web Inspector :\n\n\n. There you go. Thanks a lot for your help!\n```\n\n  {{#framing}}\n    {{#ionBody}}\n  {{> ionNavBar class=\"bar-dark\"}}\n\n  {{#ionNavView}}\n    {{> yield}}\n  {{/ionNavView}}\n\n  {{#if currentUser}}\n    {{#ionTabs class=\"tabs-striped tabs-color-royal tabs-icon-only\"}}\n      {{> ionTab icon=\"calendar\"}}\n      {{> ionTab icon=\"chatbubble\"}}\n      {{> ionTab icon=\"person\"}}\n    {{/ionTabs}}\n  {{/if}}\n\n{{/ionBody}}\n\n{{/framing}}\n\n```\n<template name=\"profileView\">\n  {{#ionView class=classes}}\n    {{#ionContent class=\"padding\"}}\n      {{>profileCard user=user class=\"padding-bottom\" orientation=\"vertical\"}}\n      {{>profileTabs user=user}}\n    {{/ionContent}}\n  {{/ionView}}\n</template>\n. ",
    "Batmunkh": "Awesome let me try it out.\n. Great this worked like a charm. Appreciate the fast response.\n. Thanks a lot.\n. I don't know about the Ionic Docs but it also happens in the Contacts app as well. I'm using iphone 4s with ios 8.1\n. ",
    "MrMegamind": "where do i find this file ? i am using ubuntu\nif i change the local project .meteor folder then it doesnt as the file gets overwriten on each compile. please suggest path\n. ",
    "thomers": "Same question - where to include this, to avoid the slide-in animation?\n. Note - I put it into each menu list item: \n<a class=\"item item-icon-left\" href=\"{{pathFor route='home'}}\" onClick=\"IonNavigation.skipTransitions = true; return true;\" data-ion-menu-close>\nBut this seems a bit redundant - maybe this should be put into a ionSideMenu option?)\n. ",
    "krishnaff": "Anyone knows how to globally disable all IonNavigation transitions?\n. Hello, \nI need some help in reactively adding/removing slides in ionSlideBox.\nThe functionality I'm trying to get at is something like this:\nUser can add one or more 'products'. Each product-entry is a slide. Once all these slides(products) are added, the data is finally saved. \nSo to start with, there's only 1 slide in ionSlideBox. User clicks 'plus' button and one more slide is added. \n```\n{{#ionView}}\n    {{#ionContent}}\n      {{#ionSlideBox}}\n          {{#each dynamicSlides}}\n            {{#ionSlide}}\n               Product #{{count}}\n               {{! form to accept productInfo }}\n            {{/ionSlide}}\n          {{/each}}\n      {{/ionSlideBox}}\n    {{/ionContent}}\n  {{/ionView}}  \nSession.setDefault('slideCounter', 1);\nTemplate.addProductList.helpers({\n  dynamicSlides: function() {\n    var counter = Session.get('slideCounter');\n    TempData.insert({\"count\": counter, \"productInfo\": {} });\n    return TempData.find();\n  }\n});\nTemplate.plusButton.events({\n  'click button#add-one-more': function() {\n    Session.set('slideCounter', Session.get('slideCounter') + 1);\n    TempData.insert({\"count\": Session.get('slideCounter'), \"productInfo\": {} });\n  }\n})\n```\nBut the extra slides are NOT added reactively to ionSlideBox. The view simply shows the default - \"Product #1\", although more slides (products) are getting added.\nI know something's wrong here, but I'm unable to figure it out what. Any help/pointers would be really appreciated. \nAlso, how does one use the $ionicSlideBoxDelegate equivalent methods in Meteor?\nSpecifically how/where can we use the previous(), next(), stop() etc in Meteor?\nThanks.\n. OK. after further reading into ionic-angular docs, looks like this is the answer whenever the scope changes - \n$ionicSlideBoxDelegate.update()\nWhat is the Meteor equivalent of $ionicSlideBoxDelegate.update() ?\nThank you.\n. Did anyone figure out a fix for this please? \nI realized, if you run with meteor run ios-device --production, the iOS statusbar works perfectly i.e., has the same color as the app header bar.\nBut the real problem still, is that the entire header section disappears over the top whenever the keyboard is in focus. Even the input gets pushed too far high and an empty white area is seen above the keyboard.\n. Hey @danlg \nWith Meteor 1.3, it works fine. The last version of meteoric:ionic 0.2.0 seems to fix the header going out of screen issue. The keyboard has become a lot more composed and predictable with WKWebview in 1.3.\nBut there are minor issues with the keyboard, I don't have a concrete fix, but here's what I'm doing:\nWhen keyboard shows up, and if its messing up elements above it, or creating extra space above it:\nMake sure the view is scrollable. Add 'overflow-scroll' class to ionContent if necessary. \nWhen keyboard hides but leaves behind empty space:\nJust doing $(\".content.overflow-scroll\").css(\"bottom\", \"0px\") is messing up selection picker views somewhere else in the app, so had to handle it only when the Keyboard is visible - \n```\nwindow.addEventListener('native.keyboardhide', keyboardShowHandler);\nfunction keyboardShowHandler(e){\n    Meteor.setTimeout(function(){\n         if (!cordova.plugins.Keyboard.isVisible) {\n            $(\".content.overflow-scroll\").css(\"bottom\", \"0px\")\n        }\n    }, 300)\n}\n```\nNative keyboard Left-Right Arrows on iOS - moving from field to field using these arrows sometimes makes a weird jump. I realised <form></form> around the input fields is necessary to ensure these arrows behave properly.\n. Hello @woniesong92, were you able to get this working? \n. Any info on this please? \nUsing {{> ionSpinner icon=\"ios\"}} as a template works. \nBut you can't obviously do something like \nIonSpinner.show() and IonSpinner.hide() with it. \nIs there some way of making IonModal use any of the spinners available? Thanks.\n. ",
    "digilord": "One of the things you need to take into account is that the .snap-content slides over so any items that are to the right when the side menu is open are off screen.\nI used\n``` coffeescript\nTemplate.layout.rendered = () ->\n  Session.set('width', $('.snap-drawers').width())\n$(window).resize () ->\n    Session.set('width', $('.snap-drawers').width())\nTracker.autorun () ->\n    if Session.get('width') >= 768\n      $('.snap-content').css('-webkit-transform', 'translate3d(266px, 0px, 0px)')\n      width = $('.snap-content').width() - 266\n      $('.snap-content').css('width', \"#{width}px\")\n      Session.set('_showWhenSideMenuOpen', false)\n    else\n      $('.snap-content').css('-webkit-transform', 'translate3d(0px, 0px, 0px)')\n      $('.snap-content').css('width', \"100%\")\n      Session.set('_showWhenSideMenuOpen', true)\n```\nIf you have a right side menu things don't work very well. I built on the possible solution provided by @dancering. I would also very much like to see this feature in the package.\n. Has there been any movement on this?\n. Is anyone sorting this out?\n. @dcsan https://github.com/meteoric/demo/blob/master/client/layout.html shows a great example of using the sideMenus code.\n. From the testing I did if this.data was null the error would occur. So checking for existence helped get rid of the error. \n. This is not resolved in the current version on Atmosphere.\n. This file sets up the editor so that it has some sane defaults. I add it to all my projects. It's ok to discard it if you don't feel it should be in the repo.\n. ",
    "personasio": "Quick question, how do i use the ionSideMenuContainer to create a slide menu?\n. ",
    "c316": "For some reason the button still works, which causes a shadow of a right menu to appear (even if I disable the button). I use the @digilord solution and added an id to menu button. \nThen added this code in the events (had to make sure it wasn't disable for the below to work)\n'click #menu_button': function() {\n    if(Session.equals('_showWhenSideMenuOpen', false)){\n        console.log(\"Should work\");\n        IonSideMenu.snapper.open('left');\n    }else{\n        console.log(\"not true\");\n    }\n}\n. Thanks, that is what I was looking for. \n. I'm trying to use deeplinking and the https://github.com/EddyVerbruggen/Custom-URL-scheme cordova plugin to get my app to recognize the deeplink domain. Something like\nmygreatapp://path?query_string\nHowever, the only thing that is happening is that the app is being launched, from there I'm not sure how to get the app to connect the path and query string to the correct route. \nAnyone have any insight that might help? \n. ",
    "dcsan": "FWIW slick.js doesn't seem to work within a meteoric app. I'm still looking into what other options there maybe - has anyone else got a carousel working with this?\nit maybe that whatever events ionic is preventDefaulg-ing will stop any carousel from working, and not sure where to look to prevent these being prevented.\n. indeed the file:\n'.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/ionic'\ndoesnt exist in this new app. i'm not sure where this was meant to be generated from. can i just leave this out? the app seems to be styled now.\n. btw i also removed the package that was failing, not sure where the pinned dependency is coming from.\n. this is still a nightmare\n```\nmeteor-app> meteor update\nThis project is already at Meteor 1.0.3.1, the latest release.\n=> Errors while upgrading packages:           \nWhile checking for fourseven:scss@1.2.3:\nerror: No compatible build found\nmeteor-app> meteor add fourseven:scss\nfourseven:scss without a version constraint has already been added.\nmeteor-app> meteor add meteoric:ionic-sass\nmeteoric:ionic-sass without a version constraint has already been added.\nmeteor-app> \nmeteor-app> meteor update\nThis project is already at Meteor 1.0.3.1, the latest release.\n=> Errors while upgrading packages:           \nWhile checking for fourseven:scss@1.2.3:\nerror: No compatible build found\n```\n. I still get the problem below.\nand there's no working workaround.\nmeteor add fourseven:scss@=2.0.0-beta_1\nhangs. maybe that's a temporary problem with the package server, but removing the = on older versions will install the package, but then I still can't meteor update\nhttps://github.com/fourseven/meteor-scss/issues/60\ni wonder how much work to convert those scss files to stylus, so we have a working css preproc? \nIt seems a shame all this great work on meteoric is blocked by a messed up version of a legacy css compiler.\n```\n\nmeteor update\nThis project is already at Meteor 1.0.3.1, the latest release.\n=> Errors while upgrading packages:           \n\nWhile checking for fourseven:scss@1.2.3:\nerror: No compatible build found\nmeteor-app> cat .meteor/versions\naccounts-base@1.1.3\naccounts-password@1.0.6\naldeed:autoform@4.2.0\naldeed:collection2@2.3.1\naldeed:simple-schema@1.1.0\nanti:fake@0.4.1\napplication-configuration@1.0.4\nautopublish@1.0.2\nautoupdate@1.1.5\nbase64@1.0.2\nbinary-heap@1.0.2\nblaze@2.0.4\nblaze-tools@1.0.2\nboilerplate-generator@1.0.2\ncallback-hook@1.0.2\ncheck@1.0.4\ncoffeescript@1.0.5\nddp@1.0.14\ndeps@1.0.6\nejson@1.0.5\nemail@1.0.5\nfastclick@1.0.2\nfollower-livedata@1.0.3\nfourseven:scss@1.0.0\ngeojson-utils@1.0.2\nhtml-tools@1.0.3\nhtmljs@1.0.3\nhttp@1.0.10\nid-map@1.0.2\ninsecure@1.0.2\niron:controller@1.0.7\niron:core@1.0.7\niron:dynamic-template@1.0.7\niron:layout@1.0.7\niron:location@1.0.7\niron:middleware-stack@1.0.7\niron:router@1.0.7\niron:url@1.0.7\njquery@1.11.3\njson@1.0.2\nlaunch-screen@1.0.1\nless@1.0.12\nlivedata@1.0.12\nlocalstorage@1.0.2\nlogging@1.0.6\nmatb33:collection-hooks@0.7.9\nmeteor@1.1.4\nmeteor-platform@1.2.1\nmeteoric:autoform-ionic@0.1.4\nmeteoric:ionic@0.1.13\nmeteoric:ionic-sass@0.1.7\nmeteoric:ionicons-sass@0.1.5\nminifiers@1.1.3\nminimongo@1.0.6\nmobile-status-bar@1.0.2\nmongo@1.0.11\nmquandalle:jade@0.4.1\nmrt:moment@2.6.0\nnatestrauser:font-awesome@4.2.0_1\nnpm-bcrypt@0.7.7\nobserve-sequence@1.0.4\nordered-dict@1.0.2\npercolate:velocityjs@1.1.0\nrandom@1.0.2\nreactive-dict@1.0.5\nreactive-var@1.0.4\nreload@1.1.2\nretry@1.0.2\nroutepolicy@1.0.4\nservice-configuration@1.0.3\nsession@1.0.5\nsha@1.0.2\nsoftwarerero:accounts-t9n@1.0.6\nspacebars@1.0.5\nspacebars-compiler@1.0.4\nsrp@1.0.2\nstylus@1.0.6\ntemplating@1.0.11\ntracker@1.0.5\nui@1.0.5\nunderscore@1.0.2\nurl@1.0.3\nuseraccounts:core@1.4.1\nuseraccounts:ionic@1.4.1\nwebapp@1.1.6\nwebapp-hashing@1.0.2\nwizonesolutions:underscore-string@1.0.0\nzimme:iron-router-active@1.0.1\n```\nand also\n```\ncat .meteor/packages \nMeteor packages used by this project, one per line.\nCheck this file (and the other files in this directory) into your repository.\n\n'meteor add' and 'meteor remove' will edit this file for you,\nbut you can also edit it by hand.\nmeteor-platform\nautopublish\ninsecure\ncoffeescript\nstylus\nmquandalle:jade\niron:router\nian:accounts-ui-bootstrap-3\ntwbs:bootstrap\npercolate:velocityjs\nnatestrauser:font-awesome\nfastclick\nreactive-var\ntinytest\ndcsan:dclib\ndcsan:ribot\ndcsan:streamer\naccounts-password\nfourseven:scss\nzimme:iron-router-active\nanti:fake\nmatb33:collection-hooks\naldeed:collection2\naldeed:autoform\nmeteoric:ionic-sass\nmeteoric:ionicons-sass\nmeteoric:ionic\nmeteoric:autoform-ionic\nuseraccounts:ionic\n```\nFWIW this problem prevented meteoric running on someone's machine with an indecipherable error message, see https://github.com/meteoric/meteor-ionic/issues/69\n. > I'm not sure what stylus has to do with it? \nit's a smooth sailing alternative to using the hot mess of sass compilers. libsass or ruby and compass.\ni imagine it wouldn't be a big deal to convert ionic scss once, but agree that keeping in sync with ionic upstream would be a burden.\nso how do you avoid these issues? in my experience it's a complete blocker for a clean install of meteoric atm. and i don't mean if you need to customize the files - just to get the app to boot.\ni only have experience of a few machines with meteoric, but ALL of them have problems with sass, from at best the compiler not running, to downgrading meteoric itself and blocking meteor update \nin terms of other scss the fourseven package has waay the most downloads. \nhttps://atmospherejs.com/?q=scss\npossibly cos its a dep for some other bootstrap package?\ninterestingly the ian:bootstrap is now using stylus. I thought bootstrap was still stuck with sass?\nhttps://github.com/ianmartorell/meteor-accounts-ui-bootstrap-3/blob/master/package.js\n. just to recap what i tried:\ntaking the ionic markup example:\n``` xml\n\n Center content \n\n\n Left menu \n\n\n Right menu \n\n\n\n```\nand converting to your Template tags like:\n```\n\n  {{#ionBody}}\n{{#ionSideMenus}}\n\n  {{#ionSideMenuContent}}\n    side content\n  {{#ionSideMenuContent}}\n\n  {{#ionSideMenu side='left'}}\n  left\n  {{/ionSideMenu }}\n\n  {{#ionSideMenu side='right'}}\n  right\n  {{/ionSideMenu }}\n\n\n{{/ionSideMenus}}\n\n{{/ionBody}}\n\n```\nnote this is in the apps main layout (no yield yet for content area)\nI left the JS alone hoping that maybe this would help that.\nhowever what i see is this:\n\nunless sideMenus are still work in progress?\n. @Mantak whats your question?\n. related links\nhttps://github.com/driftyco/ionic/blob/master/js/angular/service/scrollDelegate.js#L2\nhttp://forum.ionicframework.com/t/how-to-make-the-sccollbar-of-content-element-scroll-down-to-the-bottom-automatically/393/3\n. got it. for anyone else I had to do this\nmake sure the ionList has a targetable tag (I guess you could nest another div but performance blah)\n```\nstream {\n// these are required for autoscrolling\n  width 100%\n  height 100%\n  overflow scroll\n}\n```\nand then code using velocityJS\n``` js\n    $('#streamFooter').velocity('scroll',\n      {\n        duration: 500\n        easing: \"easeinout\"\n        offset: 500    # offset on the target div only\n        container: $(\"#stream\")\n      }\n    )\n```\n``` jade\n  +ionView\n+ionContent\n\n  +ionList(id='stream')\n    each messages\n      +ionItem(id=\"{{timestamp}}\")\n        {{> UI.dynamic template=template data=messageObject}}\n\n    +ionItem\n      #streamFooter\n        br\n        p ....\n        hr\n\n```\nstreamFooter is the target item velocity will scroll to.\n@nickw maybe we can make a \"tips\" or wiki for these type of things?\n. you mean use a selector like $(\".messages-class\") ?\nin the case of an ionic list that should work as there should only be one in the DOM at a time, but i prefer to use IDs recently as i've been moving to more multiple instances of a Template in my current \"widget like\" app design. sometimes i'm generating an ID per container.\nI could also just embed a container within the list too, and then no IDs need to get passed around...\nanyway #60 looks like a much more robust approach, keen to see how you work it out! meantime i'm running from a fork anyway.\n. yeh ive seen a lot of other graphic glitches, eg like below - which is screenshot from an android phone.\ni think ionic is causing with how all the ionContent or ionView is going into a div, \nwhich is then scrollable\ndifferent from just the page being scrollable\nthats how they get the full-page transitions\nbut the browser doesnt handle it too well...\nnot sure what ways around that. for every benefit (fancy page transitions) theres a drawback (janky performance and glitching)\nperhaps the android native scrolling will help this?\nhttp://forum.ionicframework.com/t/native-scrolling-android-testers-wanted/17059\n\n. i'm just seeing it in chrome when emulating. but i see it most of the time.\n. I imagine this is a meteoric thing rather than ionic. \nit does happen 100% of the time for me tho\nandroid device:\n\nswitch to an apple device and no problem\n\ntoggling emulation back to an android device, the problem immediately reappears\n\ndisable emulation, and no problem\n\n. digging around this a bit\n+ionNavBackButton(path=\"home\" text='home')\nshould use this:\n<template name=\"ionNavBackButton\">\n  <button class=\"{{classes}}\">\n    {{> ionIcon icon=icon}}\n    {{#unless isAndroid}}\n      <span class=\"back-text\">\n        {{text}}\n      </span>\n    {{/unless}}\n  </button>\n</template>\nwhere    <span class=\"back-text\">\nOK i \n```\n.nav-bar-transition-android {\n.title,\n  .button,\n  .back-text {\n```\nthe last line is what's missing\nhowever it seems with sass i can't work on a symlinked version of a fork of the repo.\n=> Errors prevented startup:                  \nWhile building the application:\n   /Users/dc/dev/shumi/chatu/app/client/layouts/ionic/app.scss:12:9: Scss compiler error: file to\n   import not found or unreadable:\n   .meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/_ionic\n   Current dir: /Users/dc/dev/shumi/chatu/app/client/layouts/ionic/\n=> Your application has errors. Waiting for file change.\n^C                                          \n. this is cos the app has this in it:\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/_ionic';\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionicons-sass/_ionicons';\nI assume this is the right way to do it, i think i found those lines in one of the demo apps.\nit seems very weird/fragile, in that the CSS paths are hardwired into the app itself, and not somehow inside the package.\n. so it seems its the title bar\n<h1 class=\"title title-entering title-left title-active\" style=\"left: 15px; right: 15px;\">lost</h1>\non\n```\nIonHeaderBar = {\n  alignTitle: function () {\n    var align = this.alignTitle || 'center';\n    var $title = this.$('.title');\n// if (Platform.isAndroid() && !this.alignTitle) {\n//   $title.addClass('title-left');\n//   return;\n// }\n\n```\nif i take out android specific code there, we always get a centered title, which is better than the crunched up one. maybe this.alignTitle is not getting set somewhere?\n. before:\n\nafter\n\n. that looks good. coffescript has default args and also the ?= operator...\n. looks like this:\n\n. thanks guys!\n. @AlexFrazer did you get this working nicely? i'm trying to disentangle the angular stuff from the ionic docs to have a clear way to try other transitions\nhttp://ionicframework.com/docs/api/directive/ionNavView/\nshould ionNavView be used instead of a plain ionView ?\nand the transition is added on the target view you are transitioning to?\n. ",
    "maersu": "@dcsan I have a working carousel with http://www.owlcarousel.owlgraphic.com/\nIs your problem, that the carousel doesn't work with dragging/touch? Snapper.js captures all \"touchToDrag\" events\nYou can disable this with\nTemplate.appLayout.rendered = function () {\n    IonSideMenu.snapper.settings({touchToDrag: false});\n};\n. Disable one site:\n{{#ionSideMenuContainer side=\"left\"}}\n                {{#ionSideMenus}}\n...\nSuppress swipe:\njavascript\nTemplate.templateName.rendered = function () {\n    IonSideMenu.snapper.settings({touchToDrag: false});\n};\n. @idmontie do you have the problem too? if I'am the only one it's maybe related to my system. \n. hi @nickw,\nAmazing. Works like a charm, now! \nThanks a lot.\n. @jamgold for different SideMenuContent you can use IronRouter regions\n(not tested)\n. ",
    "findingmeteor": "If this.data is null you get:\nException from Tracker afterFlush function: Cannot read property 'alignTitle' of null\nTypeError: Cannot read property 'alignTitle' of null\n    at IonHeaderBar.alignTitle (http://localhost:3000/packages/meteoric_ionic.js?8d5f600e2a0f01e224c5ba01fd90c6247c7be240:1252:26)\n    at Template.ionNavBar.rendered (http://localhost:3000/packages/meteoric_ionic.js?8d5f600e2a0f01e224c5ba01fd90c6247c7be240:1936:27)\n    at null.<anonymous> (http://localhost:3000/packages/blaze.js?efa68f65e67544b5a05509804bf97e2c91ce75eb:3008:21)\n    at http://localhost:3000/packages/blaze.js?efa68f65e67544b5a05509804bf97e2c91ce75eb:1733:14\n    at Object.Blaze._withCurrentView (http://localhost:3000/packages/blaze.js?efa68f65e67544b5a05509804bf97e2c91ce75eb:2043:12)\n    at http://localhost:3000/packages/blaze.js?efa68f65e67544b5a05509804bf97e2c91ce75eb:1732:15\n    at Tracker.flush (http://localhost:3000/packages/tracker.js?517c8fe8ed6408951a30941e64a5383a7174bcfa:448:11)\nA workaround to prevent the TypeError is using ionNavBar with alignTitle:\n{{> ionNavBar alignTitle=\"something\"}}\nIs this the desired behaviour?\n. Thanks for the reply @nickw\nI'm using Meteor 1.0.3.1 and I tested this on Chrome 40.0.2214.94 (64-bit) and Firefox 37.0a2 (2015-01-21) \nI created this repo to reproduce the issue: https://github.com/findingmeteor/minimal-meteroic\nI hope it helps\n. Awesome! Works great for me (I cloned the repo inside the packages directory to do the test).\nThanks @nickw !\n. ",
    "fourseven": "Hi all,\nThis is my fault - I tried to release a fourseven:scss@1.2.3 version but got stuck when the meteor supplied build boxes failed to build node-sass (requires GCC newer than the 4.4 that the linux boxes are running). I've released the linux versions of 1.2.3 via two EC2 ubuntu boxes now, since I have control of the build tools there.\nYou shouldn't have to pin to version 1.0.0 anymore @nickw - let me know if this isn't the case.\n- Mathew\n. ",
    "kaushik1979": "The import paths are wrong. If you navigate to the .meteor/.../ directory, the scss files start with _. Replace your imports with the following and it should work.\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/_ionic';\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionicons-sass/_ionicons';\n. I did that and after that checked for the correct filename. The one in the build folder had slightly different name (started with underscore instead). \n. ",
    "muvic08": "@kaushik1979, I tried you solution with no luck.\n. There is a solution to \"file to import not found or unreadable\" error at readme of https://github.com/meteoric/ionic-sass project. \n\"NOTE: Due to a current limitation of the Meteor packaging system, the above path may not exist the first time you run your Meteor app after installing this package. This will cause an error saying the file to import was not found. This may also occur if you run meteor reset. Restarting your app should fix this problem. See meteor/meteor#2606 and meteor/meteor#2796 for more info.\"\n. scss parser must be escaping the \"_\" because it works with or without underscore (at least for me)\n. ",
    "danielemeschiari": "Hi,\nit's an <ion-side-menu-content> attribute\nhttp://ionicframework.com/docs/api/directive/ionSideMenuContent/\n. ",
    "northcoders-chris": "Yes, I tried to use it like this {{#ionSideMenu drag-content=\"false\"}}\n. Awesome Nick! Much appreciated, great package!\n. If you remember give us a shout when you release the version to atmosphere with the fix, I'll keep trying, thanks!\n. ",
    "LeCoupa": "Yes, I also tried url but I still have the same error. What I did for the moment is to use a simple href but that's not dynamic. :/\nhandlebars\n{{#ionItem href=\"/itrack/stores\" buttonRight=true class=\"item-icon-right\"}}\n  iTrack {{>ionIcon icon=\"ios-arrow-forward\" class=\"assertive\"}}\n{{/ionItem}}\n. Thank you, I don't know why but it was using 0.1.10.\n. Alright, thank you!\n. ",
    "rohanray": "Hi @nickw, first of all thanks a lot for this wonderful package!\nI have a use case where in I need to hide the nav-bar. I used your suggestion and it just works perfectly fine. May be you can include it in the meteoric package. One use case is 'splash screen' on app loading wherein a splash image is displayed on the whole screen with probably a loading icon. This is my use case indeed :) but I think it can be a common use case for a lot of apps.\n. As of today, use this link .\n. I still see this issue even after upgrading to meteor 1.1.0.3:\n```\ngit@erecaho-gitlab:~/erecaho-build/gitlab-vd-master-source$ meteor build .\nErrors prevented bundling:\nWhile building the application:\n/home/git/erecaho-build/gitlab-vd-master-source/client/stylesheets/app.scss:2:9:\nScss compiler error: file to import not found or unreadable:\n.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/ionic\nCurrent dir:\n/home/git/erecaho-build/gitlab-vd-master-source/client/stylesheets/\ngit@erecaho-gitlab:~/erecaho-build/gitlab-vd-master-source$ meteor update\ngitlab-vd-master-source: updated to Meteor 1.1.0.3.\nChanges to your project's package version selections from updating package\nversions:\naldeed:collection2       upgraded from 2.3.3 to 2.5.0\nless                     removed from your project\nmatb33:collection-hooks  upgraded from 0.7.13 to 0.7.14\nmeteoric:ionic           upgraded from 0.1.17 to 0.1.19\nuseraccounts:core        upgraded from 1.11.1 to 1.12.3\nuseraccounts:ionic       upgraded from 1.11.1 to 1.12.3\ngit@erecaho-gitlab:~/erecaho-build/gitlab-vd-master-source$ meteor build .\nErrors prevented bundling:\nWhile building the application:\n/home/git/erecaho-build/gitlab-vd-master-source/client/stylesheets/app.scss:2:9:\nScss compiler error: file to import not found or unreadable:\n.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/ionic\nCurrent dir:\n/home/git/erecaho-build/gitlab-vd-master-source/client/stylesheets/\n```\n. @rjakobsson Thanks for the info! As of now, I have moved all meteoric related assets viz. meteoric_ionic-sass & meteoric_ionicons-sass inside my own project. In /client/styles/app. scss I have changed the import as below:\n@import '../ionic/meteoric_ionic-sass/ionic';\n@import '../ionic/meteoric_ionicons-sass/ionicons';\nThis is a workaround while I await for the upgrade. Not sure, if the meteoric package too needs an upgrade to run with Meteor 1.2.\n. Hi, @jagzviruz I will try to share my code today probably on Meteorpad. \n. Hi @jagzviruz I have created a Meteorpad @ http://meteorpad.com/pad/bn38rssH3CLdJbAaY/Ionic%20Floating%20Label However, I think Meteorpad still does not support scss and hence, the app is not working as expected. Perhaps, you can download it and run it locally. Please rename style.css to style.scss. Please let me know if you need additional details. Thanks a lot in advance!\n. Hi @nickw, please can you have  a look  into this? Let me know if you need more details. \n. @jorjordandan It's working flawless now. Thanks a lot!\n. @SaverioCaminiti I think meteoric was designed to use Ionic without using Angluar. So not sure if that would be a valid solution for meteoric unless I'm missing something.\n. +1\n. ",
    "linhkurt": "Thank you very much benstr, it works like a charm.\nNow I understand more about how it works.\n. Setting title-center on \"< h1> \"element on Android does not work. It always attach title-left eventually.\nhttps://github.com/meteoric/meteor-ionic/blob/master/components/ionHeaderBar/ionHeaderBar.js#L6\n\nif (Platform.isAndroid() && !this.alignTitle) {\n      $title.addClass('title-left');\n      return;\n    }\n\n\n. \npositionTitle: function () {\n    var $title = this.$('.title');\n    var $leftButton = $('.button.pull-left');\n\n$leftButton always returned null (length=0), that's why the margin for $title is set to 0 and overlaps the back button, any idea why it's null?\n. Sorry for not mentioning that I have tried _appId=this.appId before posting this issue, but it didnot work.\nFor example I have an object author(_id, name) \nand a route Router.route('author', {path:'/author/:author_id'})\nAnd I do this:\n\n{{#each authors}} \n        {{#ionItem path='author' author_id:this._id  iconRight=true}}\n            {{> ionIcon icon=\"ios-checkmark\" class=\"positive\"}}\n            {{name}}\n            {{> ionIcon icon=\"ios-arrow-right\"}}\n          {{/ionItem}}  \n {{/each}}\n\nThe problem is it does not work if the parameter name in the route is different from the object attribute name. Why?\nIf I change the route to Router.route('author', {path:'/author/:_id'}) then it works.\n. @nickw  i would like to re-open this issue since I cannot get it working when parameter's name in the Route and in the template are different.\nPlease help!\n. Hi nickw,\nI have tried using a href and it worked even when parameter names are different.\n. yeah, they say that this is iron-router issue. To by-pass this, make sure ionItem in the right context, otherwise, create a fake context for it, like:\nYou have post={post_id, post_message, post_author, ....}, \nand  router.map('/post/:post_id','post.detail'); \nThen you can do:\n\n{{#with post}}\n{{#ionItem path=\"post.detail\"}}...{{/ionItem}}\n{{/with}}\n\nionItem will automatically pickup post_id for you. It isn't necessarily named \"_id\", it can be whatever_id as long as you put ionItem in the right context with the right path.\n. ",
    "rgoomar": "In the README it describes dependencies and the SASS files are the styles.\nhttps://github.com/meteoric/meteor-ionic#dependencies\n. ",
    "idmontie": "@nickw I'm guessing by the commits, you've already noticed there is no 1.0.3 release anymore.  It should be 1.0.4. https://github.com/driftyco/ionic-plugins-keyboard/releases\n. @maersu Yes, I have the same problem right now:\n$ meteor run ios\nError while running for mobile platforms: Error running                            \n/.meteor/packages/meteor-tool/.1.0.40.l6r7jf++os.osx.x86_64+web.browser+web.cordova/meteor-tool-os.osx.x86_64/tools/cordova-scripts/cordova.sh\nError: version not found: 1.0.3 : com.ionic.keyboard/1.0.3\n@nickw Great to hear! :smiley: \n. ",
    "markclayton": "Looks like meteor:ionic@0.1.17 is still configured to depend on cordova:com.ionic.keyboard@1.0.3. Forcing back down to version meteoric:ionic@0.1.14 didn't solve the problem this time. \n. Ah that's very relieving. Thanks nickw and timbrandln for clearing this up for me. I'm still fairly new to meteor and absolutely love it. Once again thanks guys. \n. ",
    "gwendall": "Just bumped into the same issue. See https://github.com/meteoric/meteor-ionic/pull/243\n. Had the same problem - it was likely due to conflicting event handlers for the show and hide transitions. I fixed it in https://github.com/gwendall/meteor-ionic/blob/master/components/ionModal/ionModal.js\n. Fixed here: https://github.com/meteoric/meteor-ionic/pull/251\n. @nickw I am doing some more improvements on http://github.com/gwendall/meteor-ionic, let me know when you want to merge it.\n. Around the same idea, I would like to have different page transitions than the slide left/right on certain routes. I guess I will have to do that by adding / removing classes on the [data-nav-container] element whenever I enter those routes, but that would be handy to have a way to configure that. Maybe by passing an attribute to the #ionView block helper included in those routes templates. Thoughts?\n. See here.\n. You can pass whatever data your want to modals through [data] attributes. For example, this will make the variable doc = \"x\" available to the modal template:\nhtml\n<a class=\"select-user\" data-ion-modal=\"AddContact\" data-doc=\"x\"/>\n. ",
    "hoittr": "Can confirm. Ran into the same bug.\n. ",
    "Loschcode": "Ran into it, anyone has a solution here ?\n. Well i'm interested in this too.\n. My bad, the system works, I had a problem and the two IonLoading were processed after the IonLoading.hide() within the lifecycle.\n. Well it's not working on Android whatsoever, took me the night to figure that out, ok for the duplicate issue\n. ",
    "lispur": "To ease your mind I am having those issues too. I have been watching this to see how resolves. If you need me to do anything to help I would be willing to do anything that I can.\n. ",
    "Tarang": "If it helps this sorted the issue out for us (on Android):\n.content.overflow-scroll {\nbottom: 0px !important;\n}\nThe keyboard seems to intentionally add some displacement to the div but this should cancel it out.\nIt does feel a bit unnatural though. Native apps have some movement behind the keyboard.\n. I didn't see the keyboard sliding issues but there's another one to add:\nScroll bars:  they shouldn't be visible like on a UIWebView. They show up when you scroll then hide when you don't similar to the OS X default behaviour.\n. @1nsaneinc I might want to point out if you run the app using meteor run ios the status bar issue isn't there. So its not likely that the status bar issue is a meteoric issue.\n. @1nsaneinc Could you check if the behaviour is different if you use meteor run ios.\nI've discerned the behaviour is different (More details here: https://github.com/practicalmeteor/meteor-wkwebview/issues/1)\n. @1nsaneinc Not sure what to do about the keyboard issue but there is a quick fix (that forces it not to move) still feels un natural:\n.content.overflow-scroll { bottom: 0px !important; }\n. @1nsaneinc If you have content over a page long does yours show scroll bars when you scroll?\n. Actually there's a problem here. e.preventDefault seems to stop Meteor app events from firing\n. ",
    "torayeff": "@Tarang thanks. That works on ios and android, just have checked on physical devices.\n. @fpoirier1 this works for me for android and ios:\n.content.overflow-scroll {\nbottom: 0px !important;\n}\n. @ecuanaso Try adding this to your css:\n.content.overflow-scroll {\nbottom: 0px !important;\n}\nhttps://github.com/meteoric/meteor-ionic/issues/89\n. It was silly CSS bug, I forgot to add:\n```\n.long-text{\n  width: 100%;\n  height: 100%;\n  overflow: scrol;l\n}\n```\n. ",
    "danielfbm": "@torayeff this fix works, but sometimes the input could be displayed behind the keyboard on iOS, which is not very nice. Also I want to make sure that it only does that for android and only when the keyboard is open so I changed to this css\ncss\nbody.keyboard-open .platform-android .content.overflow-scroll {\n  bottom: 0px !important;\n}\n@fpoirier1 for issue #1 I fixed using the solution proposed here https://groups.google.com/forum/#!topic/phonegap/whWeynhFfHQ with touchstart event on input fields. The downside is that even when users are scrolling it will force focus in the field, but this is a price that I am willing to pay for now.\n. I also noticed that this fix for Platform.isAndroid is still not in the latest release of the package on atmosphere.\nI will explain what I did in my project to fix the issue in iOS and Android:\nFor iOS, sometimes even when the keyboard is already not visible, the screen still doesn't change, and the style=\"bottom: 260px;\" for example is not removed. It is a hard issue to reproduce, but it happens once in a while. (I believe it has to do with hotcode push and cordova plugins), and so I added some validation with setTimeout on input blur to double check and remove the attribute if the keyboard is not present (not pretty but seems to be working).\nAnother issue is that sometimes when the keyboard shows up the input focus event is not fired, maybe not related but it might help some people that might be looking for this. I implemented according to this post to fix:  https://groups.google.com/forum/#!topic/phonegap/whWeynhFfHQ\non Android I implemented the suggested fix using css as commented here https://github.com/meteoric/meteor-ionic/issues/89  but only specifically when the keyboard is open: \ncss\nbody.keyboard-open .platform-android .content.overflow-scroll {\n  bottom: 0px !important;\n}\nHopes this helps.\n. ",
    "crapthings": "Can't compile crosswalk with meteor, i've tried solve that on hackpad with crosswalk from v8.x to v12.x all failed, wish that will work on 1.0.4 with upgraded cordova.\n. ",
    "jamgold": "@maersu  Brilliant, thanks\n. I was able to fix it by changing Platform in ionBody.js like so\n```\n// http://docs.phonegap.com/en/1.0.0/phonegap_device_device.md.html\nPlatform = {\n  isIOS: function () {\n    if(Meteor.isCordova)\n    {\n        // console.log('isIOS',device);\n        return device.platform == 'iOS';\n    }\n    else return (!!navigator.userAgent.match(/iPad/i) || !!navigator.userAgent.match(/iPhone/i) || !!navigator.userAgent.match(/iPod/i))\n           || Session.get('platformOverride') === 'iOS';\n  },\nisAndroid: function () {\n    if(Meteor.isCordova)\n    {\n        // console.log('isAndroid',device);\n        return device.platform == 'Android';\n    }\n    else return navigator.userAgent.indexOf('Android') > 0\n           || Session.get('platformOverride') === 'Android';\n  }\n};\n```\n. Turns out these are warnings only and code should run without this fix. Besides, MDG code is full of references to navigator.userAgent and will throw a plethora of these warnings\n. ",
    "connor-baer": "Thanks, that hides the tabbar. \nHowever, ionView does not adjust to take over the extra space at the bottom. It leaves an empty rectangle, although it sets the tabbar's display: none.\nFor now I'll go back to using different layouts. Would be nice to have an easy implementation of this though.\n(Unfortunately I have no suggestions on how to do it, I'm quite new to coding.)\n. Perfect! That does it. Thanks so much. \n. Have a look at #74. \n. Have a look at #74.\n. ",
    "bastiRe": "Alright, let me know if there's something I need to fix before you can merge it in.\n. Works. Thanks for the tip.\n. @perusopersonale What exactly happens when you call your ionPopup with templateName? It works fine for me.\nConcerning your first problem I also encountered this and I'll investigate if there's a workaround, but for now you can only have one popup at once. \n. ",
    "lorensr": "I see, well for feedback – I sent a list of commands needed to a friend who\nis starting an iconic app to try to convince him that it would be easy to\nuse meteor for his project, and the list could have been half as long if\nthere was just one thing to add. Also, I'm guessing there are people who\ndon't read the Guide.md or skip past the top part to get to usage examples,\nand they at first just install meteoric:ionic and have trouble getting it\nto work.\nOn Sun, Mar 1, 2015 at 5:41 PM, Nick Wientge notifications@github.com\nwrote:\n\nYeah, my thinking was that this way users could bring their own version of\nIonic - or use a different preprocessor - if they wanted. Might revisit\nthis later based on user feedback.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/96#issuecomment-76647157\n.\n. Because of this line:\n\nhttps://github.com/meteoric/meteor-ionic/blob/master/components/ionActionSheet/ionActionSheet.js#L29\nI needed a div on the page with .ionic-body class (also needed height 100%)\n. ",
    "wrannaman": "@nickw are you also getting the keyboard covering the input field if they are near the bottom of the page? \n. ",
    "aaronthorp": "yeah definately a bug, having major dramas with keyboard and focusing on input elements at the moment :(\n. Here is a video demo of the frustration, it seems according to some console.log output that the select gets focus and fires the focus event but more often than not immediately fires the blur event for the same element, not sure why or how, maybe that helps with the debugging?\nVersions: iOS 8.3, Meteor 1.1.0.2\nhttps://dl.dropboxusercontent.com/u/106020176/MeteoricFrustrating.m4v\nfor some debugging, i added the following to my template events: \nGLOBAL_FOCUS = 0;\nTemplate.staff_login.events({\n  \"focus select\": function(e, t) {\n    console.log(\"Focus Event\");\n    GLOBAL_FOCUS = new Date().getTime();\n  },\n  \"blur select\": function(e, t) {\n    var showTime = new Date().getTime() - GLOBAL_FOCUS;\n    console.log(\"Blur Event\");\n    console.log(\"Element Show Time:\", showTime+\"ms\");\n  },\n  ...\n});\nand the XCode output is as follows:\n2015-04-17 12:14:31.076 ThinkPortal[337:26821] Focus Event\n2015-04-17 12:14:31.077 ThinkPortal[337:26821] Keyboard Open 260\n2015-04-17 12:14:31.452 ThinkPortal[337:26821] Blur Event\n2015-04-17 12:14:31.453 ThinkPortal[337:26821] Element Show Time: 371ms\n2015-04-17 12:14:31.453 ThinkPortal[337:26821] Keyboard Closed\n2015-04-17 12:14:33.431 ThinkPortal[337:26821] Focus Event\n2015-04-17 12:14:33.431 ThinkPortal[337:26821] Keyboard Open 260\n2015-04-17 12:14:33.819 ThinkPortal[337:26821] Blur Event\n2015-04-17 12:14:33.820 ThinkPortal[337:26821] Element Show Time: 386ms\n2015-04-17 12:14:33.820 ThinkPortal[337:26821] Keyboard Closed\n2015-04-17 12:14:34.748 ThinkPortal[337:26821] Focus Event\n2015-04-17 12:14:34.748 ThinkPortal[337:26821] Keyboard Open 260\n2015-04-17 12:14:35.139 ThinkPortal[337:26821] Blur Event\n2015-04-17 12:14:35.139 ThinkPortal[337:26821] Element Show Time: 387ms\n2015-04-17 12:14:35.140 ThinkPortal[337:26821] Keyboard Closed\n2015-04-17 12:14:35.879 ThinkPortal[337:26821] Focus Event\n2015-04-17 12:14:35.879 ThinkPortal[337:26821] Keyboard Open 260\n2015-04-17 12:14:36.270 ThinkPortal[337:26821] Blur Event\n2015-04-17 12:14:36.271 ThinkPortal[337:26821] Element Show Time: 390ms\n2015-04-17 12:14:36.272 ThinkPortal[337:26821] Keyboard Closed\n2015-04-17 12:14:37.469 ThinkPortal[337:26821] Keyboard Open 260\n2015-04-17 12:14:37.761 ThinkPortal[337:26821] Focus Event\n2015-04-17 12:14:40.475 ThinkPortal[337:26821] Blur Event\n2015-04-17 12:14:40.476 ThinkPortal[337:26821] Element Show Time: 2984ms\n2015-04-17 12:14:40.477 ThinkPortal[337:26821] Keyboard Closed\nThe last event in that list of 2.9sec actually staying open...\n. Quick update to get it temporarily working for anyone who needs it, in the blur event, add the following to refire the focus event on the current element if it closed quickly:\nif (showTime < 500)\n  $(e.currentTarget).focus();\n. Yeah still does this, and found other bugs so I closed the request for the\nmoment and just using ensbledScroll at the moment.\nIt still opens then immediately closes for select boxes tho, same as the\noriginal code, not sure how to fix that issue :(\nOn Thursday, April 9, 2015, Nick Wientge notifications@github.com wrote:\n\n@aaronthorp https://github.com/aaronthorp Have you tested this on an\niOS device yet? When I originally implemented this there was a bug in iOS\nwhere if you animated the scroll right after focusing an input, the\nkeyboard cursor wouldn't update its position and would be displayed outside\nof the form field.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/pull/143#issuecomment-90956919.\n\n\n\nAaron\n\n\nPLEASE NOTE: If this email message is received by other than the named\naddressee(s), then the recipient is requested immediately to notify us and\ndelete the email from the recipient's computer memory and to destroy all\nhard and other copies of it.  This document may contain personal\ninformation. Unauthorised retention or use of such information may be in\nbreach of the Privacy Act 1988. Please check attachments for viruses.\n. ",
    "woniesong92": "Thank you so much. @nickw this helped me tremendously too. So can you add any angular directive using data-*?\n. +1 I am also curious about email verification flow\n. +1, is there any update on this?\n. This was because of a subtle problem. When you use an accounts package, it works on the simulator or your browser. However, if you want it to work on your mobile device, you need a server. When you run Meteor specify server like this:\nmeteor run ios-device --mobile-server=someapp.meteor.com\n. #246, #184 are referring to the same problem.\n. It has this instead:\n@import '../../.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/_ionic';\n@import '../../.meteor/local/build/programs/server/assets/packages/meteoric_ionicons-sass/_ionicons';\nIt seems when you run meteor reset the build folder gets removed, and ionic no longer finds the relevant assets?\n. Tl;dr: cordova.plugins.Keyboard.disableScroll(true); does not work. When the input field is at the bottom, the entire screen will be scrolled down. Is there anyway to prevent this from happening?\n. I temporarily disabled keyboard suggestions from my device to see if they were the only peoblem to the jitterish app behaviors. It turns out there are problems with transitions and scrolls as well. Please check out the following two videos:\nRunning on iOS: http://youtu.be/dxfhS0C6hpo3\nRunning on Android: https://youtu.be/u0ebeev2fcE3\nDo you have any insight for me?\n. ",
    "andrerfneves": "Yup that works. Cheers @connor-baer \n. ",
    "aldeed": "See also http://crater.io/posts/QHNZzJNKzuxhK2mxE\nMight be able to get a group to work on this, @nickw \n. Closed because it's done? Or not doing?\n. OK, I agree. Just curious.\n. ",
    "Tyga76": "Hi,\ni actually got the same issue from this weekend after I did an update..weird right. It was working perfectly previously. \nThankfully its not just me..I built different apks, deleted my server app completely and redeployed. Nothing worked. I remember meteoric was updated during the meteor update.\n. I just saw a bug #89 fix to do with android keyboard committed 3 days ago. I suspect that fix created the current bug.\n. ",
    "mjesuele": "When encountering this problem, is there a good way to figure out what the missing path is or what in my code is depending on it?\nEDIT: Nevermind, searching the project for ionItem was sufficient.\n. ",
    "cyprien-pixngraph": "Thanks for this question, help me too !\n. ",
    "MFQ": "its has done something different now my left hand side menu is shown on full screen \n. How you are creating side menu ? \nthis how I am doing going it\nhttps://gist.github.com/MFQ/dadc8f2baf744dc62de0\n. @nickw I have tired \"meteor update\" and I have removed \"meteoric:ionic-sass\" and then added it again but still no success. \n. @dancering I have tried your approach but I am getting this error\nException from Tracker afterFlush function: Can't find variable: IonSideMenu\nI guess IonSideMenu is not access in my rendered function, this how I am implementing my rendered function. \nTemplate.mobileLayout.rendered = function () {\n   IonSideMenu.snapper.settings({disable: 'right'});\n};\n. @dancering i can't access IonSideMenu at my browser console \n. ",
    "wal-nadeem": "@MFQ any update. are you able to get it fix?\n. ",
    "RobGordon406": "Thanks dancering\nTemplate.layout.rendered = function () {\n     IonSideMenu.snapper.settings({disable: 'right'});\n};\nSolved the issue with a blank menu on the RHS\nCheers\n. ```\n      {{#contentFor \"headerButtonRight\"}}\n          {{>button}}     \n        {{/contentFor}}\n <template name=\"button\">\n         <div class=\"button icon-right ion-chevron-right\">\n                <a href=\"{{pathFor 'prices'}}\" class=\"tab-item {{isActiveRoute regex='prices'}}\">\n                        Prices\n                </a>\n        </div>\n  </template>\n\n```\nThis provides a button on the right hand side - but the pathFor doesn't work\n. Thank you so much\nI'd given up!\nTyped on a tiny keyboard. \n\nOn 9 Oct 2015, at 1:17 pm, codeHatcher notifications@github.com wrote:\n@jaskinn, you need to listen to the click event in Template.layout.event instead of Template.button.event which you are likely doing. #229 explains this a little bit. Happened to me just now as well.\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "LaPelle": "You can open and close the side menu with a JS function easily by using IonSideMenu.snapper.open('left') to open the left side menu and IonSideMenu.snapper.close() to close the side menus.\n. ",
    "kylepierce": "Any update on this?\n. Any update on this @sferoze? This would be a great addition to this wonderful package. \n. iOS 9 has issue with css ~ sibling selector. Can be replaced with the + selector\n. ",
    "vko-online": "why this closed without reply\n. i think meteor + angular-ionic is more comfortable, than meteor + ionic + jquery\n. ",
    "olddevyg": "Nevermind, I just found where I was wrong in my waitOn subscriptions which lead to this weird issue. Everything works well :).\n. ",
    "flake": "@insaneinc01 \nHave you figured out Meteor equivalent of $ionicSlideBoxDelegate.update() or .next()???\nI am trying to change slide on click event but no luck yet!\n. @insaneinc01 \nI found a solution for change slide event with \"slick\"\n$('.ion-slide-box').slick('slickGoTo', index); // index of the slide to show :)\n. @danielfbm Thank you for your solution it fixed the keyboard problem on android. Great\n. ",
    "arekom": "Hi @ansarizafar can you take a look at this https://github.com/meteoric/meteor-ionic/issues/89? Maybe that will help you out.\n. Hi @txs i'm not sure if this issue was open by mistake (since its the same as the https://github.com/meteoric/meteor-ionic/issues/134) :) But to help you out quickly, did you took a look at this and this - dragger? You can just set up \"draggable\" element that will listen for swipe. As @nickw told you meteoric is using snap.js for all of this. Let me know if you need any help :)\n. Hey! Well you have a lot of options there :) there is https://github.com/zachsoft/Ionic-Material package (requires bower or play around with raw CSS) or you can use one of many meteor packages from atmosphere just search for material.\n. Hi @athenawisdoms  you can try to do <input type=\"text\" pattern=\"\\d*\">. This will cause numeric keyboard to show up.\n. ",
    "ansarizafar": "@arekom #89 does not provide any solution. I am looking for urgent help, I can't even login to my production app from android because of this issue.\n. It seems that there is no solution to this problem. If I abandon meteor-ionic, then please suggest which mobile ui framework I should use for my app.\n. ",
    "alexiri": "This is also a show-stopper for me.\n. ",
    "glemiere": "I have exactly the same problem. I tryed to use meteor add cordova:com.ionic.keyboard@1.0.4 with cordova.plugins.Keyboard.disableScroll(true); and it didn't work.\nWhen I try to console.log(cordova.plugins.Keyboard.disableScroll(true)); : the result is \"undefined\".\nI also tryed to implement this file https://github.com/meteoric/meteor-ionic/blob/master/components/ionKeyboard/ionKeyboard.js. But it didn't work too.\nI really don't know how to solve this problem... If I find a solution, i'll come back to give it to you.\n. Awesome ! Removing com.ionic.keyboard dependency worked very well for me !\nThank you !\n. ",
    "anggaranc": "I also found same problem\n. I add plugin cordova:com.ionic.keyboard\ntry this but the content scroll to top on android\njavascript\n  window.addEventListener('native.keyboardshow', keyboardShowHandler);\n  function keyboardShowHandler(e){\n    $('.content.overflow-scroll').each(function (index, el) {\n      // $(el).data('ionkeyboard.bottom', $(el).css('bottom'));\n      $(el).css({bottom: 0});\n    });\n  }\n. ",
    "carnec": "Had the same problem, removing com.ionic.keyboard dependency fixed it!\n. ",
    "DenLilleMand": "So i read what u guys said, and i removed the  meteoric:ionic(was i supposed to do that?),\ni removed the dependency for the com.ionic.keyboard after having pulled it into my packages folder, but i can't run my application because of the missing:\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/ionic';\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionicons-sass/ionicons';\nEDIT:  I restarted phpstorm, and then it worked, leaveing in the package meteoric:ionic. It feels kind of weird though, that i have the ionic in packages, and at the same time through my package  system. Shouldn't these 2 conflict somehow? or am i missing some meteor geniality ?\n. ",
    "sferoze": "@DenLilleMand I had the same issue with the css files not being found after cloning the package into my packages directory. I went into the path and copied the folder directly into the same folder as the stylesheets and used this import:\n@import 'meteoric_ionicons-sass/ionicons';\n@import 'meteoric_ionic-sass/ionic';\n. I tried adding the css folder from the link directly into my client my client/stylesheets folder and it did not seem to work. \n. I've been trying the 3rd party libraries you listed but they don't seem to work with ionic. I might be doing something wrong? Can you verify if you have gotten them to work with ionic? \nI think the ionicView is interfering with how the 3rd party libraries implement pull to refresh. I will update if I figure out how to implement pull to refresh with your ionic package. \n. Tried all 3 packages and could not get it to work. \nI will look into opening a PR to implement it. \n. I think we should edit the TODO list and uncheck\n-  ion-refresher (not necessary with Meteor)\n. @nickw I want to see if I can implement ion-refresher by myself and then post a pull request to integrate into the package. \nCan you help me understand how this package works to convert the native ionic framework which uses angular to using Meteor Blaze?\nI looked at the code in this package a bit. Is the way is works is that you have imported all the css for the ionic framework. And then you are using Blaze templates and helper files to add and remove classes from the elements to correspond to the correct function?\nSo basically it is just about dropping in the native ionic css, and then just adding and removing classes at appropriate times? \nIf not can you give me the general idea of how this package works to allow the ionic framework shown here: https://github.com/driftyco/ionic to be converted to this package?\n. If you help me understand how this framework works, I will help with other components on the TODO list.\n. I took a look at Zynga Scroller. Do we want to integrate this package? Should I integrate ion-scroll and then ion-refresher? since one depends on the other?\nOr do you recommend finding another package?\n. Ah this is true, rubber band scrolling works on the device. thank you. \n. I got it to work with slightly different syntax. \nHere is what worked:\n{{#contentFor \"headerButtonRight\"}}\n    <button class=\"button button-clear\" data-ion-modal=\"_contactsNew\">{{> ionIcon icon=\"ios-loop-strong\"}}</button>\n{{/contentFor}}\n. actually sorry i need to test on the device. I bet it slides up like normal on the device without the backdrop. \n. it works as expected in the simulator! Perfect this framework is so awesome! \n. ",
    "jonmc12": "@nickw I was debugging this issue today, running the package locally does resolve the bug as reported.  I don't have to remove the com.iconic.keyboard dependency.  The changes in https://github.com/meteoric/meteor-ionic/commit/55085b3800912542b41992326bd51ac468068acd alone seem to resolve once the android app is rebuilt.\nHowever, when I tried to remove the local plugin, and install normally (remotely) via meteoric:ionic@0.1.17 in package.js, I see the following code when I debug:\n\nYou can see its missing that conditional for Platform.isAndroid().  I first installed the meteoric:iconic in early April, your commit was on March 6th.  The last time version was bumped in package.js was March 3rd.  So, I'm assuming when I install remote, I'm pulling that version from 3/3.\nNot sure I understand why its not pulling in latest code from remote, but, perhaps re-publishing and/or bumping package version # would resolve the problem that folks are seeing on this thread.  In meantime, I'm using local package install.\n. ",
    "pedrocatre": "Thanks @nickw and @jonmc12\nRemoving the if (Platform.isAndroid()) worked for me as well. It is good enough for now.\n. +1\n(Amazing work btw! Really appreciate it.)\n. ",
    "Poliuk": "Had the same issue, I removed the  com.ionic.keyboard dependency and it fixed the problem\n. ",
    "bjesus": "@danielfbm's solution fixed it for me. seems like a gentler fix than removing the com.ionic.keyboard dependency \n. ",
    "benjick": "@danielfbm's solution works great on Android, thank you. Anyone found a solution for iOS?\n. What about {{#if currentUser}}?\n. Wow, just encountered this same error. Thanks for the fix! Hoping for a release soon!\n. Why not use mongodb that's shipped with Meteor? \n. ",
    "spotla": "I have tried below solution, it worked for me.  \nionKeyboard.js #L47-L49 (https://github.com/meteoric/meteor-ionic/blob/master/components/ionKeyboard/ionKeyboard.js#L47-L49) has code to return if platform is Android.  I have changed that code to scroll to focused element\nvar keyboardHeight = event.keyboardHeight;\n  if (Platform.isAndroid()) {\n    scrollToFocusedElement(null, keyboardHeight);\n    return;\n  }\n@nickw -  Please let us know if this solution would cause any possible breaks.\n. ",
    "perusopersonale": "There was an error in mytemplate that's why it wasn't working, sorry...\n. Ok, now I think I've understood what was happening.\nmy template is not a simple HtmlRaw but there is also a Blaze.view\nso:\nTemplate[options.templateName].renderFunction().value is returning undefined\nbecause:\nTemplate[options.templateName].renderFunction() is in my case an array, with a Blaze.View and HtmlRaw \n. I think template body in IonPopup it's not supported #132 \n. ",
    "ericoe": "I'd like to do the following pattern: \nconfirm. \n    if yes, then do something. \n       alert to report if something bad happened\nHere is the code:\nIonPopup.confirm({\n            title: 'Title 1',\n            template: 'Body 1',\n            onOk: function()\n            {\n                // do something\n                IonPopup.alert({title:'title 2', template:'body 2' });\n            }\n        });\nThis does not work... apparently shared state gets ripped up between calls. If I put in a \"setTimeOut()\" hack I can make the pattern work. Any advice on how to resolve the problem of showing 2 different popups in rapid time sequence?\n. roll your own... and on a related note, you might check: juliancwirko:s-alert\n. ",
    "qdsang": "@nickw  @ericoe If you want to pop two, how to solve?\n. ",
    "Kiv": "@sircharleswatson Did you end up implementing a way to pass a data object to IonPopup? I also need this feature :)\n. ",
    "jstoup111": "Does anyone have some ideas on how to handle this? None of my event handlers are working.\n. ```\nTemplate.ionPopup.events({\n})\n```\nShould work\n. ",
    "enrq": "I am also interested on this...\n. Thanks for the reply Nick, will give it a try later!\n. ",
    "rafa93br": "Please tell me guys if you have an answer... I am also looking for this\n. ",
    "juno249": "that's pretty cool when we can use ionic-material with Meteor. How we can do it?\n. ",
    "txs": "Thanks... I think I'll find another package for the floating slide menu.... thanks for the help out\nSincerely,\nAndy\n. I came back to use this mend  do you know how to apply the effect  like material  design...  The hover menu or perspective page view \n. I actually write my own so that the side drag is possible!\nOn Sat, Aug 29, 2015 at 2:38 AM, Nick Wientge notifications@github.com\nwrote:\n\nHere's where snap.js gets initialized:\nhttps://github.com/meteoric/meteor-ionic/blob/master/components/ionSideMenuContainer/ionSideMenuContainer.js#L14-L36\nYou can't currently pass any other options to it, but that should be\npretty trivial to implement if you'd like to submit a PR. Alternatively you\nmight be able to grab the element out of the DOM and apply options\nretroactively - not sure if snap.js supports that or not though.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/135#issuecomment-135856397\n.\n. @elGusto Is your package still use iron layout? I use Blaze layout and have the issue that not support for contentFor. What's your layout choice?\n. @nicolaslopezj  Hope that solution be a general solution\n. @elGusto  sorry it's my problem that didn't ditch contentFor and I change it! Awesome! Do you think we should publish a package call elgusto:meteoric-ionic-flow \nDo you have any idea to ditch Iron completely? Cause my project still have iron dependency that's really annoyingㄡ\n. Here's the package https://atmospherejs.com/wecare/ionic-flow\n. @danlg wecare is using this package in production. Sorry for the miss-leading doc. It's working with the flowrouter perfectly! Enjoy using it. Thanks\n. Yes  you have to include  them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" notifications@github.com wrote:\n@txs https://github.com/txs Is the NavBar component working ? It seems\nthat BlazeLayout is not rendering dynamic templates if they are not\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n.\n. Since everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\nYes  you have to include  them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" notifications@github.com wrote:\n\n@txs https://github.com/txs Is the NavBar component working ? It seems\nthat BlazeLayout is not rendering dynamic templates if they are not\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n.\n. I'll take a look\nOn Jan 30, 2016 11:53 PM, \"verdavaine\" notifications@github.com wrote:\n\nNavBar dynamic templates are rendered if doing this:\n\n{{#ionBody}}\n\n{{> Template.dynamic template=headerButtonLeft}}\n{{> Template.dynamic template=headerTitle}}\n{{> Template.dynamic template=headerButtonRight}}\n\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\ninstead of\n\n{{#ionBody}}\n{{> ionNavBar class=\"bar-positive\"}}\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\nbut the result is not good as ionNavBar.js is not used anymore\n2016-01-30 15:45 GMT+01:00 txs notifications@github.com:\n\nSince everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\n\nYes you have to include them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" notifications@github.com\nwrote:\n\n@txs https://github.com/txs Is the NavBar component working ? It\nseems\nthat BlazeLayout is not rendering dynamic templates if they are not\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\n<\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177195583\n.\n\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177198591\n.\n. OK Ic your problem. That's a handlebar issue. If you only  pass a class\nthen the navbar will only  pass your class var. But some inherited value\npassing in the background  will  not be passing.  What you should  do is\nlike this {{ionNavBar NavThis}} and write the helper var self =this;\nself.class =\" someclass \"; return  self;  . Hope that should  work\nOn Jan 31, 2016 12:04 AM, \"txshon\" txshon@gmail.com wrote:\nI'll take a look\nOn Jan 30, 2016 11:53 PM, \"verdavaine\" notifications@github.com wrote:\n\nNavBar dynamic templates are rendered if doing this:\n\n{{#ionBody}}\n\n{{> Template.dynamic template=headerButtonLeft}}\n{{> Template.dynamic template=headerTitle}}\n{{> Template.dynamic template=headerButtonRight}}\n\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\ninstead of\n\n{{#ionBody}}\n{{> ionNavBar class=\"bar-positive\"}}\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\nbut the result is not good as ionNavBar.js is not used anymore\n2016-01-30 15:45 GMT+01:00 txs notifications@github.com:\n\nSince everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\n\nYes you have to include them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" notifications@github.com\nwrote:\n\n@txs https://github.com/txs Is the NavBar component working ? It\nseems\nthat BlazeLayout is not rendering dynamic templates if they are not\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\n<\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177195583\n.\n\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177198591\n.\n. No problem  hope you  like it.  BTW does it work?\nOn Jan 31, 2016 12:13 AM, \"verdavaine\" notifications@github.com wrote:\n\nThank u for your quick answer !\nSent with MailTrack\n<\nhttps://mailtrack.io/install?source=signature&lang=en&referral=paul75011@gmail.com&idSignature=22\n2016-01-30 16:11 GMT+01:00 txs notifications@github.com:\n\nOK Ic your problem. That's a handlebar issue. If you only pass a class\nthen the navbar will only pass your class var. But some inherited value\npassing in the background will not be passing. What you should do is\nlike this {{ionNavBar NavThis}} and write the helper var self =this;\nself.class =\" someclass \"; return self; . Hope that should work\nOn Jan 31, 2016 12:04 AM, \"txshon\" txshon@gmail.com wrote:\n\nI'll take a look\nOn Jan 30, 2016 11:53 PM, \"verdavaine\" notifications@github.com\nwrote:\n\nNavBar dynamic templates are rendered if doing this:\n\n{{#ionBody}}\n\n{{> Template.dynamic template=headerButtonLeft}}\n{{> Template.dynamic template=headerTitle}}\n{{> Template.dynamic template=headerButtonRight}}\n\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\ninstead of\n\n{{#ionBody}}\n{{> ionNavBar class=\"bar-positive\"}}\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\nbut the result is not good as ionNavBar.js is not used anymore\n2016-01-30 15:45 GMT+01:00 txs notifications@github.com:\n\nSince everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\n\nYes you have to include them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" notifications@github.com\nwrote:\n\n@txs https://github.com/txs Is the NavBar component working ?\nIt\nseems\nthat BlazeLayout is not rendering dynamic templates if they are\nnot\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n\n\n\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177195583\n\n\n\n.\n\n—\nReply to this email directly or view it on GitHub\n<\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177198591\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177202082\n.\n\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177202725\n.\n. Also  you can  go to the facebook  meteor.js group for social  too\nOn Jan 31, 2016 12:16 AM, \"txshon\" txshon@gmail.com wrote:\nNo problem  hope you  like it.  BTW does it work?\nOn Jan 31, 2016 12:13 AM, \"verdavaine\" notifications@github.com wrote:\n\nThank u for your quick answer !\nSent with MailTrack\n<\nhttps://mailtrack.io/install?source=signature&lang=en&referral=paul75011@gmail.com&idSignature=22\n2016-01-30 16:11 GMT+01:00 txs notifications@github.com:\n\nOK Ic your problem. That's a handlebar issue. If you only pass a class\nthen the navbar will only pass your class var. But some inherited value\npassing in the background will not be passing. What you should do is\nlike this {{ionNavBar NavThis}} and write the helper var self =this;\nself.class =\" someclass \"; return self; . Hope that should work\nOn Jan 31, 2016 12:04 AM, \"txshon\" txshon@gmail.com wrote:\n\nI'll take a look\nOn Jan 30, 2016 11:53 PM, \"verdavaine\" notifications@github.com\nwrote:\n\nNavBar dynamic templates are rendered if doing this:\n\n{{#ionBody}}\n\n{{> Template.dynamic template=headerButtonLeft}}\n{{> Template.dynamic template=headerTitle}}\n{{> Template.dynamic template=headerButtonRight}}\n\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\ninstead of\n\n{{#ionBody}}\n{{> ionNavBar class=\"bar-positive\"}}\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\nbut the result is not good as ionNavBar.js is not used anymore\n2016-01-30 15:45 GMT+01:00 txs notifications@github.com:\n\nSince everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\n\nYes you have to include them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" <notifications@github.com\n\n\nwrote:\n\n\n\n@txs https://github.com/txs Is the NavBar component working\n? It\nseems\nthat BlazeLayout is not rendering dynamic templates if they are\nnot\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n\n\n\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177195583\n\n\n\n.\n\n—\nReply to this email directly or view it on GitHub\n<\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177198591\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177202082\n.\n\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177202725\n.\n. \n\n",
    "hassanakhtar": "Any updates on this? Or if someone can tell me how to apply snap.js options on the meteoric sideMenu??\n. It worked @nickw, thanks.\n. Hi @josiahgoff  I am facing the same issue.. Any luck on this?\n. So any alternative you used or just dropped the idea? :smiley: \n. ",
    "ecuanaso": "Hey nickw, what goes inside the click event to actually open up the modal? \nThis is only what you have...\n'click .my-custom-tab': function(event, template) {\n}\n. Ok thanks for the reply. Here's what I have, I changed the templateName into 'profile'. I'm trying to open a   profile template inside the modal. However it didn't work.\n```\nTemplate.ionTabs.events({\n'click .profile-modal' : function(profile, data){\n    this.template = Template[profile];\n    var view = Blaze.renderWithData(this.template, data, $('.ionic-body').get(0));\nif (!this.view[profile]) {\n  this.view[profile] = [view];\n} else {\n  this.view[profile].push(view);\n}\n\nthis.views.push(profile);\n\nvar $modalBackdrop = $(view.firstNode());\n\nif (this.views.length === 1) {\n  $modalBackdrop.addClass('active');\n}\n\nvar $modalEl = $modalBackdrop.find('.modal').eq(0);\n$modalEl.addClass(this.enterClasses.join(' '));\n\n$modalEl.on(this.transitionEndEvent, function () {\n  $('body').addClass('modal-open');\n  $modalEl.removeClass(this.enterClasses.join(' ')).removeClass(this.enterActiveClass).off('webkitAnimationEnd');\n}.bind(this));\n\nMeteor.setTimeout(function () {\n  $modalEl.addClass(this.enterActiveClass);\n}.bind(this), 10);\n\n} \n  });\n```\n. Anybody out there that can identify what I'm doing wrong in my code? Thanks\n. Ok what you just posted worked for me. Thanks alot!\n. ",
    "sasikanth513": "+1 for this, this would be a great addition\n. @woniesong92 hey In android keyboard is pushing the view up by default or you have done any changes to make it work? Can you help here #307 \n. ",
    "AlexFrazer": "{{>ionNavBackButton icon=\"ios-arrow-right\" path=\"nextScreen\"}} perhaps?\n. ah, sorry bout that, just got it to work using that.\n. I have the same problem, usually have to restart it a few times and it works.\n. +1\n. I only really see a few places in this whole repository that rely on Iron Router. Worst come to worst, just do some template type checking or something\n. ",
    "davidsun3000": "You can use \n{{> ionTab icon=\"ios-plus-empty\" class=\"button button-clear pull-right button-positive\" path=\"***\"}}\n. ",
    "codeHatcher": "@jaskinn, you need to listen to the click event in Template.layout.event instead of Template.button.event which you are likely doing. #229 explains this a little bit. Happened to me just now as well.\n. Oh man, I just spent a couple hours on this not realizing this was the case.\n. Turns out #229 was my problem. This might be good mentioning. I see technically mention it here https://github.com/meteoric/meteor-ionic/blob/master/GUIDE.md#templates but because the ramifications are non-obvious and a pattern many may not be use to it's potentially worth clarifying.\n. ",
    "tekknikk": "stupid easy solution.  for each slide you want to scroll, wrap the slide content in a div and style it with:\noverflow-y: scroll;\nheight:100%;\n. +1 on the love\n. ",
    "vinodb2806": "Hello,\nI want to add some animation or speed time in IonModai.open('templateName'); so please suggest me here. As I am using meteor in our application.\nThanks in advance.\n. ",
    "Anwain": "+1 same problem here\n. ",
    "jamielob": "If you add a no-header class to your ionContent, this should remove the space for you.\nFor example: \n{{#ionContent class=\"no-header\"}}\n. This looks to be fixed in the latest version on GitHub for me, but not yet in the version on Atmosphere. \n@nickw - Any chance you can push the latest version onto Atmosphere so I can test?\n. ",
    "aguegu": "I have the same issue with @sclausen . It is quite annoying.\nThe problem is with the raw mongodb objectID object. \n. ",
    "Koosmann": "+1, the opening animation for modal isn't working for me either (the closing one is though).\n. ",
    "nramirez": "It uses https://github.com/kenwheeler/slick/ so you can use its methods, e.g. to slide next you can do $('.ion-slide-box').slick('slickNext');\n. @verdavaine You can use slickGoTo to accomplish what you want, this way: \n$('.ion-slide-box')[0].slick.slickGoTo(toIndex);\n. @verdavaine Nice! :+1: \n. ",
    "verdavaine": "Thank u for your answer.\nI accomplish it this way : $('.ion-slide-box').slick('goTo', toIndex)\n. @txs  Is the NavBar component working ?  It seems that BlazeLayout is not rendering dynamic  templates if they are not directly included inside the layout template.\n. NavBar dynamic templates are rendered  if doing this:\n\n  {{#ionBody}}\n      \n        {{> Template.dynamic template=headerButtonLeft}}\n        {{> Template.dynamic template=headerTitle}}\n        {{> Template.dynamic template=headerButtonRight}}\n      \n    {{#ionNavView}}\n      {{> Template.dynamic template=main}}\n    {{/ionNavView}}\n  {{/ionBody}}\n\ninstead of\n\n  {{#ionBody}}\n    {{> ionNavBar class=\"bar-positive\"}}\n    {{#ionNavView}}\n      {{> Template.dynamic template=main}}\n    {{/ionNavView}}\n  {{/ionBody}}\n\nbut the result is not good as ionNavBar.js is not used anymore\n2016-01-30 15:45 GMT+01:00 txs notifications@github.com:\n\nSince everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\n\nYes you have to include them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" notifications@github.com wrote:\n\n@txs https://github.com/txs Is the NavBar component working ? It\nseems\nthat BlazeLayout is not rendering dynamic templates if they are not\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\n<\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n.\n\n\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177195583\n.\n. Thank u for your quick answer !\n\nSent with MailTrack\nhttps://mailtrack.io/install?source=signature&lang=en&referral=paul75011@gmail.com&idSignature=22\n2016-01-30 16:11 GMT+01:00 txs notifications@github.com:\n\nOK Ic your problem. That's a handlebar issue. If you only pass a class\nthen the navbar will only pass your class var. But some inherited value\npassing in the background will not be passing. What you should do is\nlike this {{ionNavBar NavThis}} and write the helper var self =this;\nself.class =\" someclass \"; return self; . Hope that should work\nOn Jan 31, 2016 12:04 AM, \"txshon\" txshon@gmail.com wrote:\n\nI'll take a look\nOn Jan 30, 2016 11:53 PM, \"verdavaine\" notifications@github.com wrote:\n\nNavBar dynamic templates are rendered if doing this:\n\n{{#ionBody}}\n\n{{> Template.dynamic template=headerButtonLeft}}\n{{> Template.dynamic template=headerTitle}}\n{{> Template.dynamic template=headerButtonRight}}\n\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\ninstead of\n\n{{#ionBody}}\n{{> ionNavBar class=\"bar-positive\"}}\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\nbut the result is not good as ionNavBar.js is not used anymore\n2016-01-30 15:45 GMT+01:00 txs notifications@github.com:\n\nSince everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\n\nYes you have to include them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" notifications@github.com\nwrote:\n\n@txs https://github.com/txs Is the NavBar component working ? It\nseems\nthat BlazeLayout is not rendering dynamic templates if they are not\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177195583\n\n.\n\n—\nReply to this email directly or view it on GitHub\n<\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177198591\n.\n\n\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177202082\n.\n. Yes it works ! Thanks a lot\n\n2016-01-30 16:17 GMT+01:00 txs notifications@github.com:\n\nAlso you can go to the facebook meteor.js group for social too\nOn Jan 31, 2016 12:16 AM, \"txshon\" txshon@gmail.com wrote:\n\nNo problem hope you like it. BTW does it work?\nOn Jan 31, 2016 12:13 AM, \"verdavaine\" notifications@github.com wrote:\n\nThank u for your quick answer !\nSent with MailTrack\n<\nhttps://mailtrack.io/install?source=signature&lang=en&referral=paul75011@gmail.com&idSignature=22\n2016-01-30 16:11 GMT+01:00 txs notifications@github.com:\n\nOK Ic your problem. That's a handlebar issue. If you only pass a class\nthen the navbar will only pass your class var. But some inherited\nvalue\npassing in the background will not be passing. What you should do is\nlike this {{ionNavBar NavThis}} and write the helper var self =this;\nself.class =\" someclass \"; return self; . Hope that should work\nOn Jan 31, 2016 12:04 AM, \"txshon\" txshon@gmail.com wrote:\n\nI'll take a look\nOn Jan 30, 2016 11:53 PM, \"verdavaine\" notifications@github.com\nwrote:\n\nNavBar dynamic templates are rendered if doing this:\n\n{{#ionBody}}\n\n{{> Template.dynamic template=headerButtonLeft}}\n{{> Template.dynamic template=headerTitle}}\n{{> Template.dynamic template=headerButtonRight}}\n\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\ninstead of\n\n{{#ionBody}}\n{{> ionNavBar class=\"bar-positive\"}}\n{{#ionNavView}}\n{{> Template.dynamic template=main}}\n{{/ionNavView}}\n{{/ionBody}}\n\nbut the result is not good as ionNavBar.js is not used anymore\n2016-01-30 15:45 GMT+01:00 txs notifications@github.com:\n\nSince everyone's layout is different\nOn Jan 30, 2016 11:43 PM, \"txshon\" txshon@gmail.com wrote:\n\nYes you have to include them\nOn Jan 30, 2016 11:39 PM, \"verdavaine\" <\nnotifications@github.com\n\n\nwrote:\n\n\n\n@txs https://github.com/txs Is the NavBar component working\n? It\nseems\nthat BlazeLayout is not rendering dynamic templates if they\nare\nnot\ndirectly included inside the layout template.\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177193619\n\n\n\n\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177195583\n\n\n\n\n.\n\n—\nReply to this email directly or view it on GitHub\n<\n\n\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177198591\n\n\n\n.\n\n\n—\nReply to this email directly or view it on GitHub\n<\n\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177202082\n\n.\n\n—\nReply to this email directly or view it on GitHub\n<\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177202725\n.\n\n\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/199#issuecomment-177205077\n.\n. \n",
    "tombaaaaa": "I keep getting the same error\n. ",
    "nicholasalanbrown": "@nickw agreed, I get this error using the Atmosphere package. Can you push an update?\n. Found the answer here:\nhttps://github.com/meteoric/meteor-ionic/issues/173\nThis should really be called out somewhere more explicitly...\n. Not sure what change in Meteor/another package made this necessary, but this fixed it for me:\nif (Meteor.isCordova) {\n  document.addEventListener(\"deviceready\", function() {\n    StatusBar.overlaysWebView(true);\n    StatusBar.styleLightContent();\n  }, false);\n}\n. Ah, that makes sense. Thanks!\n. Never mind, found your answer here:\nhttps://github.com/meteoric/meteor-ionic/issues/74\nSorry!\n. For a little more context, here's what I have in my client-side settings:\nMeteor.startup(function() {\n    if (Meteor.isCordova) {\n        /*cordova.plugins.Keyboard.disableScroll(true);*/\n        cordova.plugins.Keyboard.hideKeyboardAccessoryBar(true);\n        document.addEventListener(\"deviceready\", function() {\n            StatusBar.overlaysWebView(true);\n            StatusBar.styleLightContent();\n        }, false);\n    }\n});\nI've also tried it with uncommenting the disable native scrolling setting as suggested in some of the Ionic forums to no avail\nAnd here is my template code:\n<template name=\"practice\">\n    {{#contentFor \"headerTitle\"}}\n        <div class=\"level-coin text-center h-center\">\n            <h3>{{currentLevel}}</h3>\n        </div>\n    {{/contentFor}}\n    {{#contentFor \"headerButtonLeft\"}}\n        <div class=\"save-exit v-center\">\n            {{>ionNavBackButton}}</div>\n    {{/contentFor}}\n    {{#contentFor \"headerButtonRight\"}}\n        <div class=\"button button-clear pull-right v-center\">\n            <h3 class=\"level-progress\">{{xp}} / {{levelMax}} FP</h3></div>\n    {{/contentFor}}\n    {{#ionView}}\n        <div class=\"blue-stripes\">\n            {{#ionContent}}\n                <div class=\"padding\">\n                    <progress max=\"{{levelMax}}\" value=\"{{levelProgress}}\" data-levelRemaining=\"{{levelRemaining}}\"> </progress>\n                    <div class=\"card-container col text-center\">\n                        {{#momentum plugin='card-to-right' }}\n                            {{#each cards}}\n                                <div class=\"card  {{#if isFirst}}card-active{{else}}card-next{{/if}}\">\n                                    <div class=\"flipper\">\n                                        <div class=\"front\">\n                                            <h2>{{prefixForeign}}</h2>\n                                            <h2>{{foreign}}</h2>\n                                            <audio id=\"pronounce{{number}}\" src=\"/audio/{{language}}/{{number}}.mp3\" type=\"audio/mpeg\"></audio>\n                                            <!--<i data-foreign=\"{{number}}\" class=\"fa fa-volume-up fa-2x\"></i>-->\n                                            {{> ionIcon icon='volume-medium'}}\n                                        </div>\n                                        <div class=\"back\">\n                                            <h2>{{prefixEnglish}}</h2>\n                                            <h2>{{english}}</h2>\n                                            {{#momentum plugin='fade-score' }}\n                                                {{#if correct}}\n                                                    {{> ionIcon icon='checkmark-circled' class=\"score-icon correct\"}}\n                                                {{/if}}\n                                                {{#if incorrect}}\n                                                    {{> ionIcon icon='close-circled' class=\"score-icon incorrect\"}}\n                                                {{/if}}\n                                            {{/momentum}}\n                                        </div>\n                                    </div>\n                                </div>\n                            {{/each}}\n                        {{/momentum}}\n                    </div>\n                </div>\n                <div class=\"padding-2x\">\n                    <form>\n                        <div class=\"list\">\n                            <label class=\"item item-input translate-input\">\n                                <input type=\"text\" placeholder=\"Type a translation...\" id=\"answer\" autocomplete=\"off\" autocorrect=\"off\" autocapitalize=\"off\" spellcheck=\"false\">\n                            </label>\n                        </div>\n                    </form>\n                </div>\n            {{/ionContent}}\n        </div>\n    {{/ionView}}\n</template>\n. Digging further, it turns out that when I tap into the input, the keyboard comes up but the focus doesn't actually go the input field. Then I drag and scroll up, and need to tap into the field a second time to get focus. Then when I text, the div above magically reappears. \nI'm testing on the Simulator right now but will experiment with a physical device soon to see if it's an issue there as well.\nI'm not completely clear on how you've integrated Ionic - when they make bug fixes and updates, to you need to rework your package to match?\n. I think I figured it out - I was using -webkit-backface-visibility: hidden to enable a card flip animation but apparently it's a bit buggy on iOS. I'm not sure if these issues are more prevalent in Ionic but I see lots of older issues with -webkit-backface-visibility and flickering animations related to the keyboard on iOS.\n. ",
    "baconmania": "Same symptoms here. I get the same stack trace, but navigation still works via my ionNavBackButton.\n. My issue turned out to be at this line: https://github.com/meteoric/meteor-ionic/blob/d3de1c4f356aad10bf7edccf8960509f11c99611/components/ionNavBackButton/ionNavBackButton.js#L43\nI was passing a path attribute on my {{> ionNavBackButton }} which was slightly wrong. I was passing somePath/, where I needed to pass somePath, so backRoute was undefined. If you do Object.keys(Router.routes), you can see the exact names of the available routes.\n. ",
    "austingayler": "is there a reason for this? it's only ever documented that the link should be set via \"path\"\n. ",
    "wolasss": "Well, for anyone else experiencing the problem: \nThe problem is caused by google maps plugin applying background-color opacity of 0 to map and every parent. But because of .snap-drawers div's being absolute elements, they get in front of the actual google map div and are visible. Simple css workaround for now: \n```\n.gmaps_cdv.snapjs-left .snap-drawers, .gmaps_cdv.snapjs-right .snap-drawers {\n    display: block;\n}\n.gmaps_cdv .snap-drawers {\n    display: none;\n}\n```\n. Well, after some testing, this workaround is not a very good idea. For instance, autorun computation on subscriptionsReady can be called twice one after another, and then IonLoading.show() is called twice very quickly, and IonLoading.view is not created yet. IMO, The best option would be to set up some flag in show method, or debounce whole function\n. ",
    "Noveltysa": "The css workaround did not work for my case: \"google autocomplete search result list does not work(i.e. the list is not selectable) when wrapped in any ionic view\"\n. ",
    "tomwasd": "Very new to ionic and meteor-ionic but this seems to work:\n$('[data-nav-container]').addClass('nav-view-direction-back');\n$('[data-navbar-container]').addClass('nav-bar-direction-back');\nwindow.history.back();\n. ",
    "nabiltntn": "you have to add manually these packages :\nfourseven:scss\nmeteoric:ionic-sass\nmeteoric:ionicons-sass\n. you have to add manually these packages :\nfourseven:scss\nmeteoric:ionic-sass\nmeteoric:ionicons-sass\n. ",
    "tmikoss": "The only option known to me would be to pre-launch meteor as part of your build script (see the part about BUILDPACK_PRELAUNCH_METEOR in https://github.com/AdmitHub/meteor-buildpack-horse/blob/master/bin/compile ). But in my experience this process is slow and prone to random failures :/\nI've taken to simply pre-compiling the SCSS files to CSS on dev machine and checking those into source control. If you have https://rubygems.org/gems/sass/ installed and are not customising the SCSS variables:\nsass ./.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/_ionic.scss > ./client/stylesheets/_ionic.css\nsass ./.meteor/local/build/programs/server/assets/packages/meteoric_ionicons-sass/_ionicons.scss > ./client/stylesheets/_ionicons.css\nrm -r ./.sass-cache\nStill, eagerly awaiting a proper solution!\n. ",
    "srounce": "@nabiltntn I think you have misunderstood.\n\nOn 20 May 2015, at 23:00, nabiltntn notifications@github.com wrote:\nyou have to add manually these packages :\nfourseven:scss\nmeteoric:ionic-sass\nmeteoric:ionicons-sass\n—\nReply to this email directly or view it on GitHub https://github.com/meteoric/meteor-ionic/issues/166#issuecomment-104052298.\n. \n",
    "caio-ribeiro-pereira": "I had a similar issue but with a different context, in my case I needed to setup Codeship CI and I couldn't because sass was not importing the ionic stylesheet. So I create a little workaround to avoid sass compilation during the CI, I just removed all stylesheets before running the test with this command:\nbash\nbash -c \"rm client/stylesheets/application.scss\" && meteor --test --once\n. ",
    "premesh": "nvm figured it out :)\n. ",
    "harlyluyar": "i have the same issue, but it is with Todos list example, not with meteorinic.\nNo idea what's wrong\n. ",
    "anderson916": "I have the same question. It is better to disable dragging of the side menu div.\n. ",
    "nskoro": "Anyone have a solution for disabling drag content?\n. ",
    "kfatehi": "I had this issue too, it was due to my status bar cordova configuration:\nI changed the overlay option as such and it resolved the footer getting cut and the header having extra space\njs\nif (Meteor.isCordova) {\n  document.addEventListener(\"deviceready\", function() {\n    StatusBar.overlaysWebView(true);\n    StatusBar.styleLightContent();\n  }, false);\n}\n. ",
    "odesey": "Thanks, I will research and share my findings here.\n. Ok I figured this out.\nIn order to add a callback to the slideBox slides do the following:\n```\n Template.slideBox.onRendered(function () {\n  $('.ion-slide-box').on('swipe', function(event, slick, direction){\n    console.log(direction);\n  });\n$('.ion-slide-box').on('beforeChange', function(event, slick, currentSlide, nextSlide){\n    console.log(nextSlide);\n   });\n }) \n```\nYou can also call:\n$('.ion-slide-box').slick('slickCurrentSlide') //current slide index, great for showing and hiding links\nand\n$('.ion-slide-box').slick('slickPrev') // previous slide\n  $('.ion-slide-box').slick('slickNext') //next slide\nCan we update to documentation and add this to it?\nThanks for pointing me in the right direction.\n. Have you tried calling .unslick() then .slick() on the parent element of the list of objects as they are updated? Also what about the .slickAdd() method, have you tried that?\n. ",
    "harryward": "Thanks that seemed to work for me.. using dynamic data and offsetting the 'contact' you are viewing based on what slide your on.\nhttp://xvolve.meteor.com/\n. ",
    "neil-s": "Tried calling .unslick() and then .slick().\nTried using a regular div rather than a slidebox, and calling .slick() then .unslick() and then .slick().\nWhat finally worked was simply using a regular div, and then hooking into the Meteor DOM insertion process as below:\n```\n if (Meteor.isClient) {\n     Template.browse.onRendered(function () {\n         $('.carousel').slick({\n            dots: false,\n            arrows: false,\n            infinite: false\n        });\n    this.find('.carousel')._uihooks = {\n        insertElement: function (node, next) {\n            $('.carousel').slick('slickAdd', $(node));\n        }\n    }\n});\n\n}\n```\n. ",
    "ninjasun": "hello, I have the same issue. Whit that code how do you can pass each slide to the template?\n. ",
    "lucavandro": "Hi! Have you tried adding 'pull-left' class to your button? \nI mean something like that:\n{{#contentFor \"headerButtonLeft\"}}\n    <button class=\"button pull-left button-clear\" data-ion-modal=\"_contactsNew\">{{> ionIcon icon=\"ios-plus-empty\"}}</button>\n {{/contentFor}}\n. Try this \n``` sh\nmeteor remove fourseven:scss\nmeteor remove meteoric:ionicons-sass\nmeteor add fourseven:scss@2.0.0\nmeteor add meteoric:ionic-sass\nmeteor add meteoric:ionicons-sass\nmeteor add meteoric:ionic\n```\n. ",
    "dgellow": "In the javascript file for your template, you can specify the following:\njs\nTemplate.ionicLayout.rendered = function() {\n  IonSideMenu.snapper.settings({disable: 'right'});\n};\n. ",
    "lj222kj": "Hey!\nDid you come up with a good way to place ads? Am looking into integrating ads myself in one of my meteoric apps but i'm not entirely sure how to solve it. \n. Has this \"issue\" been addressed yet? \n. Hi! This is most likely relevant to the changes with iron router found here.\nMeteor add ejson\nshould do the trick :+1: \n. ",
    "kevingzhang": "newCount is variable.\nIn your js code, using Template.yourTemplateName.helpers to set newsCount to a value.\n. ",
    "asidiali": "Looks like it changed, I got it working by doing transition=\"slide-in-up\" on the ionNavView\n. ",
    "garyfoo": "Hey @adamsidiali, could you drop more tips on how you get it working? I'm new in Meteoric development and I can't still seem to figure out how transitions work. Am I suppose to configure anything?\n. ",
    "gottib": "Hi @adamsidiali and @gfmr90 , can one of you drop some more detailed information about customizing or configuring on transitions? I would really appreciate this.\n. I got it:\nangular.module('visidoo').config(function($ionicConfigProvider) {\n    $ionicConfigProvider.views.transition('none');\n});\nhttp://ionicframework.com/docs/api/provider/$ionicConfigProvider/#views.transition\n. ",
    "sebastianconcept": "Maybe is keyboard-attach related?\nI've found this:\nhttp://stackoverflow.com/questions/25328701/ionic-angularjs-phonegap-keyboard-issue-with-ios\nAnd BTW I have this same major issue for iOS =(\n. ",
    "alexandesigner": "Check for https://github.com/meteoric/meteor-ionic/issues/130\n. ",
    "cosio55": "+1 \n\nOn 25/05/2015, at 8:28, Alex Frazer notifications@github.com wrote:\n+1\n—\nReply to this email directly or view it on GitHub https://github.com/meteoric/meteor-ionic/issues/198#issuecomment-105231710.\n. - 1\nEl 17/08/2015, a las 4:18 p.m., Michael Trachtman notifications@github.com escribió:\n+1!\n—\nReply to this email directly or view it on GitHub.\n. Thank you @pors this resolved it for the moment!\n. With this fix I have a new error, now the last two inputs don't scroll correctly into the view as you can see on the images, is there anyway to fix this? Thanks in advance!\n\n\n\n\n\n. Have you tried pressing ⌘K to toggle the keyboard on the simulator?\n. Actually after reviewing my code this error appears after I open and close a modal and move to another route... Sorry about that, but the error is still there, the code for the modal is a little large but here it is, maybe someone can help me find where the error might be:\n\n<template name=\"_producto\">\n{{#ionModal customTemplate=true}}\n      <div class=\"bar bar-header bar-stable\">\n        <h2 class=\"title\">{{#with producto}}{{nombre}}{{/with}}</h2>\n        <button data-dismiss=\"modal\" class=\"button button-icon\"><i class=\"icon ion-ios-close-empty\"></i></button>\n      </div>\n      <div class=\"content has-header has-footer overflow-scroll\">\n          {{#with producto}}\n            <img src=\"{{imagen}}\" class=\"imagenDetalleProducto\">\n          {{tituloNav}}\n          <div class=\"row infoProductoRow\">\n            <div class=\"col col-67\">{{nombre}}</div>\n            <div class=\"col col-center infoProductoPrecio\">{{formatoDinero precio}}</div>\n          </div>\n          <div class=\"row infoProductoContador\">\n            <div class=\"col col-33 contadorMenos\">-</div>\n            <div class=\"col \">{{ contadorProducto }}</div>\n            <div class=\"col contadorMas\">+</div>\n          </div>\n          <div class=\"row infoProductoTamano\">\n            <div class=\"col col-50 textoTamano\">Tamaño: </div>\n            <div class=\"col tamanoProducto\">{{tamano}}</div>\n          </div>\n          <div class=\"descripcionDetalleProducto\">{{descripcion}}</div>\n            {{/with}}\n          </div>\n        {{#ionFooterBar class=\"bar-balanced botonAgregarProducto\"}}\n      {{#with producto}}\n      <h1 class=\"title\" id=\"botonProducto\" data-id=\"{{_id}}\">AGREGAR {{ contadorProducto }} AL CARRITO</h1>\n      {{/with}}\n   {{/ionFooterBar}}\n  {{/ionModal}}\n</template>\n```\nTemplate._producto.helpers({\n  contadorProducto: function () {\n    return Session.get(\"contadorProducto\");\n  },\n  producto: function () {\n    var template = Template.instance();\n    return Productos.findOne({_id: template.data.id});\n  }\n});\nTemplate._producto.rendered = function () {\n  Session.set(\"contadorProducto\", 1);\n  var diaActual = moment().isoWeekday();\n  var horaActual = moment().hour();\n  var minutoActual = moment().minute();\n  var configuracion = Configuracion.findOne({});\nif(configuracion){\n    var horariosOperacion = configuracion.horariosOperacion;\n  }\nvar horariosOperacionHoy = _.filter(horariosOperacion,\n    function(horario){\n      return horario.dia == diaActual;\n    });\nvar horarios = [];\n\n_.each(horariosOperacionHoy, function(horario){\n  var valoresHoraEmpieza = horario.horaEmpieza.split(':');\n  var valoresHoraTermina = horario.horaTermina.split(':');\n  var horaEmpieza = moment().set({'hour': valoresHoraEmpieza[0], 'minute': valoresHoraEmpieza[1],'second':0});\n  horaEmpieza.subtract(1,'minute');\n  var horaTermina = moment().set({'hour': valoresHoraTermina[0], 'minute': valoresHoraTermina[1],'second':0});\n  horaTermina.add(1,'minute');\n  horarios.push({\n    empieza: horaEmpieza,\n    termina: horaTermina\n  });\n});\n\nvar horarioAbierto = _.find(horarios, function(horario){\n  return moment().isBetween(horario.empieza, horario.termina);\n});\n\nif(horarioAbierto){\n  Session.set('abiertoOCerrado','abierto')\n}else{\n  Session.set('abiertoOCerrado','cerrado')\n}\n\n};\nTemplate._producto.events({\n  'click .contadorMenos': function () {\n    if(Session.get(\"contadorProducto\") <= 1){\n      Session.set(\"contadorProducto\", 1);\n    }else{\n      Session.set(\"contadorProducto\", Session.get(\"contadorProducto\") - 1);\n    }\n  },\n  'click .contadorMas': function () {\n    Session.set(\"contadorProducto\", Session.get(\"contadorProducto\") + 1);\n  },\n  'click .botonAgregarProducto': function () {\n    Session.set('agregandoProducto',true);\n    IonModal.close();\n    //IonLoading.show();\n    if(Session.get('abiertoOCerrado')=='cerrado'){\n      //IonLoading.hide();\n      IonModal.close();\n      Session.set('agregandoProducto',false);\n      swal('','VNO se encuentra cerrado por el momento, por favor vuelve más tarde.','info');\n    }else{\n      var template = Template.instance();\n      var idProducto = template.data.id;\n      var cantidadProducto = Session.get(\"contadorProducto\");\n      var carrito = CarritoUsuario.findOne({idUsuario: Meteor.userId()});\n      var idCedis = carrito.idCedis;\n      //Checamos si hay suficientes productos\n      var producto = Productos.findOne({\n        _id: idProducto,\n        stock: { $elemMatch: { idCedis: idCedis, cantidad: { $gte: cantidadProducto } } }\n      });\n  if(producto === undefined || producto.length == 0){\n    //IonLoading.hide();\n    IonModal.close();\n    Session.set('agregandoProducto',false);\n    swal({   title: \"Poco stock\",   text: \"Selecciona menos cantidad de este producto y vuelve a intentarlo.\",   timer: 2000,   showConfirmButton: false, type:\"warning\" });\n  }else{\n    Meteor.call(\"agregarProductos\", idProducto, cantidadProducto, idCedis, function(err,res){\n      if(!err){\n        swal({\n          title: \"Producto agregado\",\n          text: \"Agregamos tu(s) producto(s) al carrito.\",\n          timer: 1500,\n          showConfirmButton: false,\n          closeOnCancel: true,\n          closeOnConfirm: true,\n          type:\"success\"\n        });\n        //IonLoading.hide();\n        IonModal.close();\n        Session.set('agregandoProducto',false);\n        setTimeout(\n          function(){\n            $('.barraAbajoOrden').addClass('animated tada');\n            $('.barraAbajoOrden').one('webkitAnimationEnd mozAnimationEnd MSAnimationEnd oanimationend animationend', function(){\n              if($('.barraAbajoOrden').hasClass('animated')){\n                //$('.barraAbajoOrden').removeClass('animated tada');\n              }\n            });\n          },\n          2000);\n        }else{\n          //IonLoading.hide();\n          IonModal.close();\n          Session.set('agregandoProducto',false);\n          swal({   title: \"No pudimos agregar el producto al carrito\",   text: \"Por favor vuelve a intentarlo.\",   timer: 2000,   showConfirmButton: false, type:\"error\" });\n        }\n      });\n    }\n}\n\n\n}\n\n});\n```\n. Yes, I made everything, the problem I’m having is with that specific Cordova plugin, that’s what I need help with.\n\nOn 21/10/2015, at 3:01 p.m., Mark Pors notifications@github.com wrote:\nOK, that's good to know. We are using meteoric for an MVP now, but will have to plan for something else later on then.\nWhat are you using personally for mobile (cordova powered) apps based on Meteor? Is there anything for Blaze that you know?\n—\nReply to this email directly or view it on GitHub https://github.com/meteoric/meteor-ionic/issues/340#issuecomment-150009084.\n. \n",
    "1nsaneinc": "+1\nWaiting desperately for 1.0.0!\n. @Tarang I have attached a comparison, running the app on an iPhone 5.\n\n. @Tarang Tried meteor run ios\nThe status bar issue isn't there. But the keypad still pushes the whole screen over the top.\n\n. ",
    "Sivli-Embir": ":+1: \n. This seems to be my core problem: https://github.com/iron-meteor/iron-router/issues/890 not sure what to do about it as of yet. IMO route/id1 and route/id2 are diff routes even if if they share a template and they should at least animate on change.\n. Actually this may be a pure local memory issue, in chrome window.performance.memory.totalJSHeapSize is returning 33100000. \n. This is a memory issue, apologies. \n. ",
    "rcarter": "+1\n. ",
    "MartinBucko": "+1\n. ",
    "liaujianjie": "+1\nThe use of flow-router can fix ionTabs's reliance on routes causes a ionNavBackButton to navigate between tabs. If meteoric uses flow-router, we can assign a unique identifier to every ionTabs stack where tab states can be saved as url parameters instead.\nThis also isolates ionTabs from the ionNavigation stack (I'm not sure if this is desired) and reduces the need for stuff like this.\n. +1\n. HTML\n{{#ionTabs style=\"android\" class=\"tabs-background-light tabs-color-mycolor\"}}\nCSS\n.tabs-color-mycolor > .tabs {\n    background-color: #123456; /* put your colour here */\n}\n. ",
    "achtan": ":+1: \n. +1\n. it helpt! thx\n. ",
    "dalerka": "+1 for switching to Flow-Router (or making it router-agnostic) as we don't know when MDG will roll out their official router and if it will be better or not. \n. Just in case, the option of creating a Router-layer package (to allow using various routers) is discussed here.\nIf someone has the necessary skills to build such a package, please take the lead.\n. Can someone update about the main road blocks to switching to Flow-router or supporting it via the Router-layer?\n. Apologies if this is not the proper place to mention, but...\nJust in case, the option of creating a Router-layer package (to allow using various routers) is discussed here. So, if someone has the necessary skills to build such a package, please take the lead.\n. ",
    "nicolaslopezj": "I started a router-layer project\nhttps://github.com/nicolaslopezj/meteor-router-layer\n. I started a router-layer project\nhttps://github.com/nicolaslopezj/meteor-router-layer\n. {{> yield \"regionName\"}} currently is not interpreted in Router Layer, only {{> yield }} works\n. ",
    "sakulstra": ":+1: \n. ",
    "StorytellerCZ": "@txs Thanks!\n. #199\n. ",
    "danlg": "@txs do you consider this issue \"Adding compatibility with flow-router?\" #199 now closed with the package  ionic-flow https://atmospherejs.com/wecare/ionic-flow. I can see that the docs mention \" Tabs (requires iron:router integration)\" . Is is a typo leftover from the previous meteor-ionic implementation ? Or is there still some leftover or instability issue? Do you think it is good enough for production use ? Thanks\n. Did you manage to make it work with meteor 1.3 which ships WKWebview by default ?\n. @pors which view are you using UIWebView or WKWebview  ? if WKWebview, which implementation, there are so many forks for meteor and none of them is working out-of the-box for me... thanks\n. ",
    "sweetticket": "+1\n. ",
    "leonsim": "I'm getting the same problem as @insaneinc01 \n. ",
    "juzpermsky": "Hello! \nDid you solved this problem? I faced with the same difficulties. I use meteor-ionic and iron-router.\nAnd my sadness is that there is no animation during page transitions between URLs like viewObject/:_id1 and viewObject/:_id2. If you found decision, please help!\n. ",
    "jkrup": "I'm trying to do the same thing right now, all I know is that there's IonSideMenu.snapper.on('open') and ...on('close') and you can do IonBackdrop.retain(), but that takes up the whole screen rather than just the not side-menu section. Looks like it'l take a bit of hacking to get it working :(\n. ",
    "Vaqxin": "Totally missed that. I was seriously wondering what the issue was. Updated GUIDE and submitted PR. Thanks!\n. ",
    "peterhasenstab": "+1\n. ",
    "don-smith": "I just added the packages to a new project on OS X and didn't run into this.\n. ",
    "maxzzznz": "My tabs do not work anymore since the following changes in meteoric components/ionTab/ionTab.js (v0.1.18 and v0.1.19):\nhttps://github.com/meteoric/meteor-ionic/commit/8dd6d43e7586bb37a2294827b993d552c0776538#diff-88fffa912ec2f704c11c2f679f4ef5ee\nand\nhttps://github.com/meteoric/meteor-ionic/commit/8437b552d972729f5e85b83e6f2118876c88aec2#diff-88fffa912ec2f704c11c2f679f4ef5ee\nSince these changes the tabs always appears unselected, and clicking on each tab has no effect anymore.\nMy routes for each tabs look like this:\nRouter.route('/app/alerts/:_id', {\n    name: 'alertsTab',\n    layoutTemplate: 'tabsLayout',\n    data: function() { return Trackers.findOne(this.params._id); }\n});\nAny advice to fix this problem would be greatly appreciated :)\n. @nickw Thanks for responding Nick. Yes you are right they are working fine in your meteorhunt example, nevertheless my tabs are only working when I change Template.currentData() back to Template.parentData(1) like it was and I don't really understand why.\nI also had a look at this \"Meteor data context reference\" page\nhttps://docs.google.com/spreadsheets/d/14DTa0096y7cA1wkbUXUo_lLPwHJji0ft14_9EnArhsM/edit#gid=0\nbut I do not understand yet why this change prevented my tabs from working, I guess I will have to investigate more.\n. ",
    "jon-grangien": "Hi. I don't know if there's a better solution, but I was able to do it for my scenario by calling IonSideMenu.snapper.disable(). Disabling the snapper only actually disables the drag functionality for the side bar, but if you do it as you're routing to a page that doesn't have the header button for it, it's inaccessible.\nSo I'm making an app where a logged out user only has access to a login page and a signup page. I don't want a sidebar available here. The layout template is called appLayout, and in its js file:\njavascript\nTemplate.appLayout.rendered = function () {\n  if ((Router.current().route.getName() === 'signup') ||\n     (Router.current().route.getName() === 'login')) {\n    // console.log(\"turning off side menu\");\n    IonSideMenu.snapper.disable();\n  }\n};\nsignup and login are the templates and route names for the two pages a logged out user gets.\nAlso where I'm handling the logout functionality:\njavascript\nMeteor.logout(function(error) {\n  if(error) {\n      //display error\n      console.log(\"logout error: \" + error);\n  } else {\n      IonSideMenu.snapper.disable(); //disable side bar\n      Router.go('/login');\n  }\n});\nThis disables the side bar as the login and signup pages are loaded.\nAnd then, because the page the router routes to as a user is logged in (and should start being able to access the side bar) is called tasks, I enable it again for this page. It's now enabled for any other page the user would go to except when logging back out to the login/signup pages. The if-statement isn't necessary here\njavascript\nTemplate.tasks.rendered = function () {\n  if (Router.current().route.getName() === 'tasks') {\n    // console.log(\"turning on side menu\");\n    IonSideMenu.snapper.enable();\n  }\n};\nI should probably add an if-statement that checks if it's disabled first before enabling it there.\nThat works, anyway. My code is at https://github.com/codingInSpace/getbusy\n. ",
    "t3db0t": "If you look at my repo (https://github.com/t3db0t/Meteoric-Mobile-Starter-Project) and compare it to the Contacts example, you'll see that they are effectively identical except mine has the tabs in the layout. I even tried adding tabs to the Contacts example and it still worked, of course.\nSo it seems like my project is somehow missing some kind of core element. The Contacts example has more packages installed, but none of them would seem to be relevant (i.e. zimme:active-route or autoforms).\nWhat gives?\n. Figured it on on the Meteor forums—the Router path is /star/:id when it needed to be /star/:_id...\n. ",
    "mordka": "I think this is real security concern when using modals to render restricted data.\nRoutes can be secured properly but modals has to re-authenticate using method call when they gets created. Anyone knows the clean solution for that?\n. ",
    "yhyuan": "Hi \ntry to change the template name to layout. It seems the layout template is used to render the buttons. \nTemplate.layout.events({\n  'click [data-action=logOut]': function(event, template) {\n      console.log(\"entered signout\");\n    Meteor.logout();\n    Router.go(\"/\");\n  }\n});\n. ",
    "jupiterkenji": "I renamed it to 'layout' but it doesn't seem to be recognised and I got: Uncaught TypeError: Cannot read property 'events' of undefined. Any clue/s?\n. ",
    "totorokk": "Thanks for the fix! \nI think Line 46 also needs a modification (in order to switch on-off the icons) to: \nif(route && route.path(Template.currentData()) === ionTabCurrent){\nBTW, could you release version 0.1.18 (or the latest version) please? When I add the package locally, I had to hard-code _id = \"123456\" instead of _id=teamId + template helpers, otherwise _id is null (similar for path and title). With the previous release version (0.1.17), template helpers worked. So I thought it might be a file loading order problem. Please correct me and/or show me the right way to do this if I'm wrong.\n. Embarrassing but I found it was a local function in the same .js file prevent the file to be properly loaded. After removing that function, everything works just fine now. \nAgain, thanks a lot for the fix! \n. hmm... I was using currentData() in Line 46 when I said \"everything works just fine\". After I switched back to parentData(1), one click on the tab only does the routing, and a 2nd click on the same tab is needed to switch it to active. Refreshing the page would also remove active from the tab. So I think Line 46 might still need a fix. \nThis is tested with chrome dev tool in both ios and android devices, not with emulators though. And you said you didn't have similar issue?\n. I added some console logs in ionTabs.js Line 38 and Line 45 if blocks and found the following:\nIn my case, with just 1 click on the tab, the if check in Line 38 always fails and the Line 45 if is relied upon to set the tab to active, and then I'm facing the parentData() issue. This happened with both 'non-complex' paths like '/post' and 'complex' ones like '/post/:_id'.\nTo be more detailed, say I have \njavascript\n// parentData() in Line 46\n// {{> ionTab title='Post' path='post'}}\n// Route 'post': {path: 'post/:_id'}\n- 1st click on the Post tab: this.data is 'post', and ionTabCurrent is /post/123456, the Line 38 iffails and Line 46 doesn't work, so the tab is not active at this time.\n- 2nd click on the Post tab: both this.data and ionTabCurrent is 'post' and Line 38 passes. Tab is then set to active. \nSo in my case, the Line 46 fix is necessary to allow 1-click switching-on. Maybe in your case Line 38 passes with 1 click and it never goes to Line 45?\n. Thanks!\n. ",
    "yokas": "Can I use mongodb as a persistent db in ios ?\nI'm creating an ios app which needs store data locally\n. ",
    "fselcukcan": "seems import files are existent with different names such as dirs are;\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/_ionic';\n but not:\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/ionic';\n. ",
    "rafaelquintanilha": "Meteor.startup(function() {\n  if ( Meteor.isCordova ) {\n    document.addEventListener(\"backbutton\", function() {\n        // do stuff\n    }, false);\n  }\n}\n. ",
    "josiahgoff": "I should add that I also tried Selectize instead of Select2 and had the same results.\n. Unfortunately, no. I wasn't able to figure it out 😞\n. After Meteor 1.2 came out I started rebuilding with Angular + Ionic (for other reasons), though I haven't tested the modals yet so I don't know if that fixed it. I'll keep you posted.\n. ",
    "ouya99": "I open a screen with a  navbackbutton:\n{{#contentFor \"headerButtonLeft\"}}\n    {{#if gotolist}}\n        {{>ionNavBackButton path='tabs.list' }}\n    {{/if}}\non returning from the settings screen with the latter backbutton, the Session.get('ionTab.current') I use to manually set the tab and determine status gets manipulated to \"/tabs/list\" whereas I need it to be \"tabs.list\" (iron router path). My browser path is \"/tabs/list\" but nowhere in my code do I set ionTab.current to other version. I assume it must be set internally when pressing the navbackbutton. \nCan I change this?\n. I tried to add your solution and pasted this code in a seperate js file - so to override the IonHeaderBar.\nYet it does seem to be called.... did you repackage the whole meteoric and install under packages to fix this?\nIonHeaderBar = {\n  alignTitle: function () {\n    var $title = this.$('.title');\n    console.log('ionHeaderBar call');\nif ( $title.hasClass('title-center') || $title.hasClass('title-left') || $title.hasClass('title-right') ) {\n  return;\n} else {\n  if (Platform.isAndroid()) {\n    $title.addClass('title-left');\n  } else {\n    $title.addClass('title-center');\n  }\n}\n},\npositionTitle: function () {\n    var $title = this.$('.title');\n    var $leftButton = $('.button.pull-left');\n    var $rightButton = $('.button.pull-right');\n```\n// Find out which button is wider,\n// use that to offset the title on both sides\nvar leftButtonWidth = 0;\nvar rightButtonWidth = 0;\nif ($leftButton.length) {\n  $leftButton.each(function(index, element){\n    leftButtonWidth += $(element).outerWidth();\n  });\n}\nif ($rightButton.length) {\n  $rightButton.each(function(index, element){\n    rightButtonWidth += $(element).outerWidth();\n  });\n}\n// If we're on Android, we only care about the left button\nvar margin;\nif (Platform.isAndroid()) {\n  margin = leftButtonWidth;\n} else {\n  margin = Math.max(leftButtonWidth, rightButtonWidth);\n}\n$title.css('left', margin);\n$title.css('right', margin);\n```\n}\n};\n. I tested it some more. It is only the tabs that are reacting differently\nI did a clean checkout of demo project (meteoric) and then \"meteor update\" and then \"meteor run android-device\". i get the following and I cannot open the tabs section. others work fine.\nWhen clicking on Tabs from the demo list I get output : Exception from Tracker recompute function: see below\nAlexanders-Air:demo alexander$ meteor run android-device\n[[[[[ ~/Dev/web/demo ]]]]]                    \n=> Started proxy.\n=> Started MongoDB.                           \nWARNING: You are testing your app on a remote device. For the mobile app to be able to connect to the local server, make sure your device is on the same network, and that the network configuration allows\n         clients to talk to each other (no client isolation).\n=> Started your app.                          \n=> App running at: http://localhost:3000/\nI20151015-23:27:05.521(2)? * You've set up some data subscriptions with Meteor.publish(), but\nI20151015-23:27:05.523(2)? * you still have autopublish turned on. Because autopublish is still\nI20151015-23:27:05.524(2)? * on, your Meteor.publish() calls won't have much effect. All data\nI20151015-23:27:05.524(2)? * will still be sent to all clients.\nI20151015-23:27:05.524(2)? *\nI20151015-23:27:05.524(2)? * Turn off autopublish by removing the autopublish package:\nI20151015-23:27:05.525(2)? *\nI20151015-23:27:05.525(2)? *   $ meteor remove autopublish\nI20151015-23:27:05.525(2)? *\nI20151015-23:27:05.525(2)? * .. and make sure you have Meteor.publish() and Meteor.subscribe() calls\nI20151015-23:27:05.526(2)? ** for each collection that you want clients to see.\nI20151015-23:27:05.526(2)?\n=> Started app on Android Device.\nI20151015-23:27:21.630(2) (android:http://meteor.local/:93) XMLHttpRequest cannot load http://10.0.2.2:3000/sockjs/info?cb=zeypvdmg8p. No 'Access-Control-Allow-Origin' header is present on the requested resource. Origin 'http://meteor.local' is therefore not allowed access.\nI20151015-23:27:23.754(2) (android:http://meteor.local/:0) XMLHttpRequest cannot load http://10.0.2.2:3000/sockjs/info?cb=bndawdpenl. No 'Access-Control-Allow-Origin' header is present on the requested resource. Origin 'http://meteor.local' is therefore not allowed access.\nI20151015-23:27:23.847(2) (android:http://meteor.local/:0) XMLHttpRequest cannot load http://10.0.2.2:3000/sockjs/info?cb=hb0nwa8nxp. No 'Access-Control-Allow-Origin' header is present on the requested resource. Origin 'http://meteor.local' is therefore not allowed access.\nI20151015-23:27:29.829(2) (android:http://meteor.local/:0) XMLHttpRequest cannot load http://10.0.2.2:3000/sockjs/info?cb=tvdb5_xcdy. No 'Access-Control-Allow-Origin' header is present on the requested resource. Origin 'http://meteor.local' is therefore not allowed access.\nI20151015-23:27:32.478(2) (android:http://meteor.local/plugins/cordova-plugin-console/www/console-via-logger.js:173) Exception from Tracker recompute function:\nI20151015-23:27:40.531(2) (android:http://meteor.local/tabs/one:0) XMLHttpRequest cannot load http://10.0.2.2:3000/sockjs/info?cb=spqytu1e0m. No 'Access-Control-Allow-Origin' header is present on the requested resource. Origin 'http://meteor.local' is therefore not allowed access.\n. you should check out the meteor-ionic demo project and launch it. all meteor.com hosts have been closed\n. ",
    "EbuOgden": "Did u try press Command + K when opened keyboard ? Or in iOS Simulator bar, click; Hardware/Keyboard/Toggle Software Keyboard\n. ",
    "arunoda": "How about moving all router specific logic into a separate file. Then if we need to work on a new router, then it's just changing that file.\n. I mean we can create a set of methods like isActive() and abstract the router related logic. Then, when we need to add a support for a new router, simply change the isActive() code and we don't need to change anything inside the ionic logic related codebase. \n. @nickw for that we can simply use Meteor's dynamic templates. I think that works for both routers.\nOr if that's not possible, we can build two templates. One for IR and one for BlazeLayout (from Flow).\nOtherwise we can simply use BlazeLayout in both flow and IR.\n. There is no meteorhacks:flow-router@2.0.0.\nIt should be kadira:flow-router@2.0.0.\nI think we can drop meteorhacks:flow-router at all.\n. ",
    "b1rdex": "Oh I was right.\nException from Tracker afterFlush function: Cannot read property 'disable' of null\nTypeError: Cannot read property 'disable' of null\n    at Template.slideBox.rendered (http://meteor-ionic.meteor.com/e6d29bcba1263281831527494bd4ad7b567747ac.js:227:70)\n    at null.<anonymous> (http://meteor-ionic.meteor.com/e6d29bcba1263281831527494bd4ad7b567747ac.js:64:31265)\n    at http://meteor-ionic.meteor.com/e6d29bcba1263281831527494bd4ad7b567747ac.js:64:17258\n    at Object.l._withCurrentView (http://meteor-ionic.meteor.com/e6d29bcba1263281831527494bd4ad7b567747ac.js:64:21048)\n    at http://meteor-ionic.meteor.com/e6d29bcba1263281831527494bd4ad7b567747ac.js:64:17226\n    at n.flush (http://meteor-ionic.meteor.com/e6d29bcba1263281831527494bd4ad7b567747ac.js:15:2798)\nOpen that page and open js console.\n. Quick solution — replace Template.slideBox.rendered with\n``` javascript\nTemplate.slideBox.rendered = function tryDisableSnapper() {\n  if (IonSideMenu.snapper === null) {\n    setTimeout(tryDisableSnapper, 100);\n} else {\n    IonSideMenu.snapper.disable();\n  }\n}\n```\nHope you will include better solution to slideBox component.\n. ",
    "jinsongmu": "what's in your app.scss? \nmake sure it look something like this\n@import '.meteor/local/build/programs/server/assets/packages/meteoric_ionic-sass/ionic';\n@import 'http://code.ionicframework.com/ionicons/2.0.1/css/ionicons.min.css';\n. ",
    "descartes1": "Can confirm this for modal. Modal won't close with comment.\n. ",
    "abhishekbatra": "A suggested workaround:\nThe  above scenario would occur if the following code for including a back button is present only in a layout template:\n{{#contentFor \"headerButtonLeft\"}}\n        {{>ionNavBackButton}}\n    {{/contentFor}}\nInstead, include this code in all the individual tab templates.\n. Closed, but still adding something that I use:\n``` javascript\n'click .selector': function(event, instance) {\n        var templateName = \"modalTemplate\";\n        var currentData = {'ion-modal': \"modalTemplate\"};\n        _.extend(currentData, Template.currentData());\n    IonModal.open(templateName, currentData);\n}\n\n```\n. ",
    "myktra": "+1!\n. ",
    "Jehu": "+1\n. ",
    "jagzviruz": "the has-input class on the parent of the label triggers the effect. Please share a sample of your implementation.\n. ",
    "SaverioCaminiti": "There is an alternative solution that uses ng-class to control the has-input class on your input-label, like this:\n<label class=\"item item-input item-floating-label\">\n  <span class=\"input-label\" ng-class=\"{'has-input': username}\">Choose a username</span>\n  <input type=\"text\" placeholder=\"Choose a username\" ng-model=\"username\">\n</label>\n. ",
    "arnoldgamboa": "So techinically all ionic components can be used here?\nSent from iPhone\nOn Mon, Aug 24, 2015 at 4:17 AM -0700, \"omeid\" notifications@github.com wrote:\nCard is just a css only component, just use it. :)\n—\nReply to this email directly or view it on GitHub.\n. ",
    "MichaelJCole": "Nice!  Thanks Nick!\n. https://github.com/meteoric/meteorhunt/blob/master/client/stylesheets/_app-variables.scss#L2\nLoad gun.  Shoot foot.\n. ",
    "kjetilge": "I found out that the atNavButtoncomes back if i have\n{{#contentFor \"headerButtonRight\"}}\n      {{> atNavButton}}\n    {{/contentFor}}\non every rendered template\n. ",
    "giggioz": "+1\n. ",
    "rahul-sdei": "did you find any solution for this?\n. ",
    "Roshdy": "+1. ",
    "da314pc": "if your still using it:\nthese methods were removed from cordova android:\n\"native.keyboardshow\" & \"native.keyboardhide\",\nso these lines of code won't get triggered:\nhttps://github.com/meteoric/meteor-ionic/blob/93a2d4e48342b7c8ea5670ef76adc9056e133a0f/components/ionKeyboard/ionKeyboard.js#L45-L92\nTry removing this from your config.xml\n \n\n\nAlso update your ionic keyboard to: ionic-plugin-keyboard@2.2.1. remove the cordova plugin keyboard from your config.xml. ",
    "daveeel": "seems only template helper works. \nsuppose I have a helper named \"_homeTitle\" returning correct i18n value. Then I could write:\njade\n+ionTab title=_homeTitle path=\"homeRoute\" iconOff=\"ios-home-outline\" iconOn=\"ios-home\" class=\"tab-item-positive\"\nThat works but very inconvenient...\n. +1\n. You have to make 'badgeCount' a template helper function name which returns the number.\nAttribute value like {{badgeCount}} won't expanded\nThat means ... badgeNumber=badgeCount\n. ",
    "logankoester": "+1\n. ",
    "PareshSolankiMI": "title=(_ 'home')\nsimple \n. ",
    "JanAhrend": "Thank you for this! For some reason I assumed I had to create the meteor project first locally. I think I read it in some meteoric tutorial.\nThis is \"fixed\" then. Maybe we can add that to the Getting Started guide? \n. ",
    "daniel": "Yes, I am. Thanks, I'll try that.\n. ",
    "djedi": "What is the + selector?\n. ",
    "skirunman": "Interested in this as well. Seems like Ionic supports use of IonSpinners with IonLoading https://github.com/driftyco/ionic/blob/master/js/angular/service/loading.js#L57\n. ",
    "rokanost": "Got the same issue with paths, using \"href\" now instead\n. that did not fix the issue\n. ",
    "gerwinbrunner": "I do have the same problem, are there any solutions for it?\n. Anyone?\n. ",
    "anjanjanj": "This is for ionItem, but I ended up making hacky helpers like this:\ngetThreadDetailPath: function() {\n  return Router.routes.threadDetail.path({_id: this._id});\n}\nThen using href in my #each\n{{#each threads}}\n  {{#ionItem href=getThreadDetailPath buttonRight=true avatar=false class=\"item-icon-right\"}}\n    <h2>{{title}}</h2>\n    <p>{{createdAt}}</p>\n    {{> ionIcon icon=\"ios-arrow-forward\" class=\"positive\"}}\n  {{/ionItem}}\n{{/each}}\n. ",
    "pors": "Workaround that seems to work (hack):\nAdd a class to the modal:\nhtml\n  {{#ionModal customTemplate=true class=\"search-box\"}}\nthat adds some top margin:\ncss\n.search-box {\n    margin-top: 20px;\n}\n. Might be related to https://github.com/driftyco/ionic/issues/4402\n. I have the same issue (also on iOS 9). When the keyboard is open the content div is as follows:\nhtml\n<div class=\"content padding overflow-scroll has-header\" style=\"bottom: 302px;\">\nWhen I close the keyboard it is:\nhtml\n<div class=\"content padding overflow-scroll has-header\" style=\"bottom: 260px;\">\nThis fix, found in issue #89, works for me:\ncss\n.content.overflow-scroll.has-header {\n    bottom: 0px !important;\n}\nBut it is a hack of course.\n. @danlg I had this issue on iOS, and I use the default choice in Xcode, which is \"blank\".\nIt works will all recent version of Meteor.\n. I don't know how you load the images but maybe this is the cause?\nhttps://github.com/meteor/meteor/issues/4560\nOn Sunday, October 4, 2015, Eliezer notifications@github.com wrote:\n\nI've got no idea why, but images in my ionic app have stopped showing. If\nI go to the browser, I see the html is correct and if I go to the url of\nthe app, the image loads up.\nWhat's really strange is that it just suddenly stopped working. I went\nback a few commits on git and the images still don't load even though I'm\npositive that they did in the past. Any ideas why this could be happening\nor how to fix it?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/324.\n. Hi @nickw, does that mean that there is no maintainer for this package anymore? My guess is that most Meteor users don't want to go the Angular way (Blaze and React seem the most popular).\n. OK, that's good to know. We are using meteoric for an MVP now, but will have to plan for something else later on then.\nWhat are you using personally for mobile (cordova powered) apps based on Meteor? Is there anything for Blaze that you know?\n. @nickw cool thanks, time to learn React :)\n. I have the same situation, and I played a bit around with reapp. My conclusion is that it is still far from ready for production. It would be cool if there would be a react-ionic library, but what I found so far is very basic.\n\nWhat we are doing now is porting our app slowly to react, but keeping ionic. So step by step we port one of the components in meteor-ionic to a react version of it. All the stuff we don't need we won't implement (yet).\nIt's not that difficult and the meteor-ionic package is a great starting point for implementing a react-ionic version of it.\n. For anyone who is interested (and prefers React over Blaze), I created a port of Meteoric for React, see https://github.com/pors/reactionic/. It should be quite easy to port your apps as I tried to keep it as much as possible in line with Meteoric. Let me know if I can help!\nDemo is here: http://pors.github.io/reactionic/#demo\n. ",
    "william-bratches": "Having the same issue with keyboard blocking inputs on a page similar to yours- removing the ionic package and displaying the page fixes the problem, but then adding the meteoric-ionic framework again recreates this problem. It's definitely a problem with meteoric-ionic.\n. Figured out the source of the issue on my end. In components/ionKeyboard.js, there's a function call that actually disables keyboard scrolling on startup.\nMeteor.startup(function () {\n  if (Meteor.isCordova) {\n    IonKeyboard.disableScroll();\n  }\n});\nI wrote a custom implementation of meteoric-ionic that simply comments out this line, and it fixed the issue for me. The IonKeyboard object is attached to the window object, so if you want to save yourself the trouble of creating your own custom package, you can probably just call \"this.IonKeyboard.enableScroll()\" in a Meteor.onRendered call or something similar. \nI'm curious as to why this is here in the first place - is the intended behavior for us to enable scrolling in our own startup function? Might want to include some documentation that references this behavior. \n. ",
    "KristerV": "apparently even if a package is updated it's dependencies arent.. https://github.com/meteor/meteor/issues/5270\nwhich is strange.\n. ",
    "bgrayburn": "sorry I forgot to add this behavior only happens after bundling. Doesn't happen with meteor run or meteor run --production\n. Solved. in production mode, because all the js is in one big file, any fatal error stops the code, resulting in iron router showing it's default page. This sucks, but is a result of meteor, nothing to do with this project.\n. ",
    "kevohagan": "I also found this problem\n. ",
    "grissproject": "I have the same issue on Android 4.0.4. I've tested on Android 4.4.4, 5.0 and iOS and it's working fine. So, seems like it is a <= 4.1.2 issue.\n. I've been able to fix this by adding the 'overflow-scroll' class in the menu content div:\n{{#ionSideMenu side=\"right\"}}\n      <div class=\"bar bar-header bar-dark\">\n        <h1 class=\"title\">Menu</h1>\n      </div>\n      <div class=\"content has-header overflow-scroll\">\n        <div class=\"list menu-list\">\n          <div class=\"item item-icon-left\" data-action=\"menu-home\">\n            <i class=\"icon ion-android-apps dark\"></i> Home\n          </div>\n          ....\nThis works as long as the menu content does not overflow the screen size, otherwise the click event is not fired.\nThe same happens for the main content and the modal content, the click events are not fired if the content overflows the screen size. This is fixed when a transition is executed over the content, so if you are using {{#ionNavView}} for your content your events will work. For the modal content, I am showing the content with a VelocityJS effect so that the transition will make my events work.\nAs we mentioned before, this only happens on Android <= 4.1.2.\n. ",
    "gbhatnag": "Thanks for the quick response.  I'm wondering if it's possible to have a modal that can then have navigation left/right transitions within it.  On mobile, a modal is more like a total screen takeover.  We have a process where we want to pull an item up, go through a workflow on it using various routes/navViews and then dismiss it.\nI'll take a look at the second option for creating our own component, thanks.\n. That's what I figured.  We're just using a regular route to get to a view that looks like a modal and then going from there.  The direction that things sweep in/out, up/down is something we may try to tweak further down the road.\n. Things are very basic right now.  I haven't looked at Meteor Hunt, but have been following the Guide and code for the demo of all components.\nHere are a few files that I'm working with -- https://gist.github.com/gbhatnag/15892feb6004ad6b6eeb\nHope there's something simple I'm missing that'll get the navigation transitions working as expected.  I'll take a closer look at Meteor Hunt as well -- the tabs there are working as expected.\n. Any word on this?  Can't seem to find any differences between Meteor Hunt code and what I've got that would relate to this.  Could the @Router.onBeforeAction requireLogin in my routes cause the swiping on every single view?  Can't see much else that's different...\nHere's the list of packages my project uses -- maybe there's a conflict somewhere?\nhttps://gist.github.com/gbhatnag/d8e81706fbeac8933f60\n. Looks like this has to do with the loading template I am using in-between routes.  I define the loading template in the controller that handles all routes for this app:\n...\nthis.AgentController = this.TicketableController.extend({\n  loadingTemplate: 'ionicLoading',\n  ...\n});\nI don't see any code that triggers the loading spinner when waiting for data to come through in the Meteor Hunt app (i.e. /trending, /recent).  Could you point me to when & how you're loading that spinner?  I think if I replace my current loadingTemplate with just a simple spinner instead of an entire layout, it should do the trick...\n. ",
    "chansdad": "This still is an issue .. I am just not able to get this to work ..\n\nI have the main template tabs and in that \n```\n\n    {{#ionTabs style=\"ios\" class=\"has-badge\"}}\n{{> ionTab title=\"alerts\" path=\"useralerts\" badgeNumber=\"{{useralertcount}}\" iconOff=\"android-notifications-off\" iconOn=\"android-notifications\" class=\"tab-item-positive\"}}\n{{/ionTabs}}\n\n\n```\nand  i made the helper function useralertcount  as \n```\nTemplate.tabs.helpers({\n 'useralertcount': function () {\n        return Useralerts.find({}).count();\n    }\n});\n```\nwhy is it that i am seeing the curly's and not hte actual badge count? Appreciate the help. . ",
    "meteorjs3000": "OMG, I built entire apps using meteor-ionic, but now I need to switch to an ionic package that will continue to be maintained.\nI know neither Angular nor React, which one should I learn if I want to continue using an actively-maintained Ionic package? Is there another UI similar to Ionic that will be better supported by Meteor's ecosystems?\n. ",
    "glrodasz": "I just check this library and looks like a good alternative to use a cross-framework for mobile. https://github.com/nobutakaoshiro/meteor-framework7-ios-material\n. ",
    "jetstreamin": "I was looking at Reapp but its in Alpha and also Aurelia.io\nOn Mon, Nov 30, 2015, 13:32 Guillermo Rodas notifications@github.com\nwrote:\n\nI just check this library and looks like a good alternative to use a\ncross-framework for mobile.\nhttps://github.com/nobutakaoshiro/meteor-framework7-ios-material\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/340#issuecomment-160734489\n.\n. \n",
    "malixsys": "Don't worry: https://atmospherejs.com/barbatus/ionic2-meteor\n. @xpluscal Depends what you mean by \"tied\" but yes...\nhttp://blog.ionic.io/angular-2-ionic\nIs this a bad thing??\n. ",
    "JackAdams": "This was working fine for me in Meteor 1.2.1, then, after some seemingly minor and unrelated changes, that error started popping up in the browser console.\n@ClarenceL thanks for the tip about passing a dummy variable to ionNavBar.  That fixed it for me too, although, like you say, it feels like just masking the real issue.\n. ",
    "ClarenceL": "Now you can nest IonPopups within each other, and close individual popups\n``` coffeescript\nTODO: form to submit email\nIonPopup.show({\n  title: 'Forgotten Password'\n  template: ...\n  cssClass: 'popup-wide popup-forgot-password'\n  buttons: [{\n    text: 'Cancel'\n    type: 'button-default'\n    onTap: ( ev, t) ->\n      return true;\n  },\n  {\n    text: 'Submit'\n    type: 'button-positive'\n    onTap: ( ev, t ) ->\n\n      resetEmail = $('#forgot_password_container .forgotten-password-email').val()\n\n      unless resetEmail?.length\n        subPopup = IonPopup.show(\n          template: 'You must enter an email'\n          buttons: [{\n            text: 'Ok'\n            type: 'button-default'\n            onTap: (ev) ->\n              subPopup.close()\n          }]\n        )\n\n```\n. ",
    "gentunian": "Hey @aesmon , I agree, this is no longer maintained and I didn't realize that.\n. ",
    "cedla": "The problem is the same as #292. A pull request has been submitted, but it still hasn't been merge yet.\nFor now, there a 2 little tricks you can do:\n- you can add the title-left CSS class to your title:\njs\n<h1 class=\"title title-left\">My Awesome Title</h1>\n- or you can do it in Javascript, with this hack:\njs\nTemplate.ionNavBar.onCreated(function () {\n    this.alignTitle = 'left';\n});\n. ",
    "DanielDornhardt": "Hello @der-ede , can you please explain to me what the issue is with meteor-ionic / ionic and iOS 9.1? What's the general issue? Because we're running on Meteoric as well and that would of course be a bad thing(tm).\n. Hi @der-ede, thanks for responding so quickly.\nI was a bit confused why Meteoric shouldn't work at all with iOS 9.1 anymore to be honest - because it's (almost) all just HTML + CSS in the end, isn't it? At least from the meteoric side of things...\nSo there had to be a pretty fundamental shift like a new incompatible browser engine in 9.1 or something like this, which would then probably break all recent ionic apps, not only meteoric apps, or so my thoughts went.\n+1 to always test on real devices too, we also had some differences appear already between emulator and real devices, especially for things to do with native keyboard handling I think.\nThanks and best wishes!\n. ",
    "1seck": "Hello,\nWe are tracking down the error right now.\nBut since we found out that the demo app of meteoric is running correctly\nin 9.1 it is probably a bug on our side.\nSeems like one has to be very precise about the structure of ionView,\nionNavview, ionContent and such and also it would be advisable to deploy to\nthe iPhone during the development process and not only to test on\nemulator/browser.\nAm Donnerstag, 10. Dezember 2015 schrieb Daniel Dornhardt :\n\nHello @der-ede https://github.com/der-ede , can you please explain to\nme what the issue is with meteor-ionic / ionic and iOS 9.1? What's the\ngeneral issue? Because we're running on Meteoric as well and that would of\ncourse be a bad thing(tm).\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/issues/362#issuecomment-163543571\n.\n. @DanielDornhardt, a fundamental shift can also be having to trust into/rely on staff as opposed to developing everything by oneself :)\n. \n",
    "codebreach": "Can you push a new version with this change, I am not sure how I can depend on this in my project. Removing and readding meteor-ionic does NOT get me this commit.\n. ping?\n. gacias\nOn Sat, Jan 9, 2016 at 8:05 AM Ben Strahan notifications@github.com wrote:\n\n@codebreach https://github.com/codebreach version 0.2.0 has been pushed\nto atmosphere\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/meteoric/meteor-ionic/pull/364#issuecomment-170182797\n.\n. \n",
    "PArch": "miss options.navButtons\n. ",
    "iuraya": "Hi,\nI'm also experiencing this issue. I've tried wrapping my code with the subscriptionReady but doesn't work. In my case the problem occurs inside the 'ionSideMenuContent' block but not inside the 'ionSideMenus'\nAny workaround?\nThanks\n. ",
    "mervynteo": "@iuraya unfortunately, I suspect that the error is because the package is now deprecated, Many of its Blaze dependent components now affect the way items are being inserted into lists. I have ripped out the package entirely. \n. ",
    "terenceng2010": "In my case, remove ionNavView from the master layout solve the issue. I don't need the transition animation.\ni think the bug is in the source code of it: (Line 31~49)\nhttps://github.com/meteoric/meteor-ionic/blob/master/components/ionNavView/ionNavView.js\nI also find that @JoeyAndres do some change on his fork, maybe you want would like to try it.\nhttps://github.com/meteoric124/meteoric/blob/69a85179c852686ff977802a1b3c361b7c916ef3/components/ionNavView/ionNavView.js\n. "
}