{
    "mhoofman": "I modified the wp-cconfig-sample.php and stripped out the references to MySQL to reduce confusion since we use Postgres.\nAlso, updated the README with the section of wp-config.php to edit with the output of heroku config.\nHope that clears things up.\n. Oddly it looks like the version of PHP used by Heroku does not have JPG support for GD. Apparently imagejpeg() requires GD with JPG support. You could try to use a different image format for the header.\n\n. Not that I'm aware of. I google'd and found this. Not sure if that will work in your case or not.\n. You could try the Amazon S3 plugin.\nI have not tried this myself so YMMV.\n. I'm not sure what the web.config file is...\nDo you mean wp-config.php?\n. Leaving the web.config mystery unsolved for now.\n. > I can probably just pull your master again without that hiccup and update it if you need me to.\nCould we do that? I'd like to keep the history clean if possible.\n. Thanks for finding this. I added back in the original commit that set up the database environment. Again, thanks! \n. The best approach would be to:\n\nrun it locally to update the plugin and then push?\n. Using MAMP. Have not tried this but looks like a quick and easy way to install WordPress locally.\n. > Does it mean we need to do the updates locally and then push it to heroku?\n\nYes. This is the same as issue #12. More details on this requirement has been added to the readme.\n. Plugins are required to be installed locally then pushed to Heroku. The readme has been updated to address this requirement\nSimilar issues #14, #15.\n. Refer to Steve's article.\n. I'd like to keep custom plugins that aren't essential to Heroku functionality outside this repo.\n. Added WP Read-Only (6aafff0b9433953f003d1ce2f5d90dd185c92195).\n. The best way to install plugins is to install locally, commit, and then push out to Heroku.\n. Make sure to have an AWS S3 account with credentials setup.\n. This addon is dependent on an account registration?\n. Hey xyu,\nThe goal for this project is to keep it as bare-bones as possible. I include only essential or near-essential plugins required to have WP running in Heroku. JetPack looks like a cool plugin but doesn't qualify as an essential.\n. Hey ibroadfo,\nThis commit kills the wp-config-sample.php. The environment-based database credentials were removed. Could you re-submit without changing this file?\n. Theme causing casing errors.\n. I'm not able to reproduce the issue with loading static assets. The default installation appears to serve from the correct path without having to modify the WP_SITEURL in the config. Am I missing something?\n. Thanks for the pull request. However, I do not want to integrate vendor specific plugins into the project if there are other good alternatives available. This way, people can choose their own email service vendor and include the plugin in their own project.\n. Thanks for the pull request. This README is getting kinda large. Time for a wiki methinks.\n. 1.  I like the idea of using a submodule for plugins that have a maintained git repo on github. However, at the bare minimum there has to be clear instructions as part of the initial setup to initialize and update submodules. By default, AFAIK, a clone of the project will not pull in the submodule's source. This would require additional steps.\n2. This is a viable core plugin and can be merged.\n3. 21c8d2f, clears out Heroku specfic changes to wp-config-sample.php\n4. The sample file looks to be broken in the final commit, 50a980e.\nAlso re: 5370600, the gitignore is cleared in a step on the README. Keep that in mind when adding files to the gitignore. The step in the README would have to change.\n. Please make updates from the latest version of repository. This commit was an update from WP 3.5.2 -> 3.7.1. The repo is currently on 3.6.1.\n. Thanks for the pull request. After a fresh install I get the below error:\n\nThe failing query appears to be recently added to the file: wp-admin/includes/upgrade.php. Is the SQL something that can be fixed?\n. :+1: \n. Good catch. Thanks for the fix. :beer:\n. Added plugin to the repo. This appears to be the de facto plugin for HTTPS so I agree it makes sense to include.\n. Any reason to not use what looks like SendGrid's official plugin?\n. There should be more detail on how to get SendGrid configured once activated. I started a shell Wiki entry here. \n. Closed. See @rposborne comment.\n. I'm getting these errors again after a fresh install:\nWordPress database error: [ERROR: syntax error at or near \"a\" LINE 1: DELETE a, b FROM wp_options a, wp_options b WHERE ^]\nDELETE a, b FROM wp_options a, wp_options b WHERE a.option_name LIKE '\\_transient\\_%' AND a.option_name NOT LIKE '\\_transient\\_timeout\\_%' AND b.option_name = CONCAT( '_transient_timeout_', SUBSTRING( a.option_name, 12 ) ) AND b.option_value < 1391893245\nWordPress database error: [ERROR: syntax error at or near \"a\" LINE 1: DELETE a, b FROM wp_options a, wp_options b WHERE ^]\nDELETE a, b FROM wp_options a, wp_options b WHERE a.option_name LIKE '\\_site\\_transient\\_%' AND a.option_name NOT LIKE '\\_site\\_transient\\_timeout\\_%' AND b.option_name = CONCAT( '_site_transient_timeout_', SUBSTRING( a.option_name, 17 ) ) AND b.option_value < 1391893245\nEverything else seems to work fine.\n. May be a temporary Heroku service error. Python/Flask users experiencing a similar issue: http://stackoverflow.com/questions/22800071/push-rejected-invalid-add-on-specification-buildpacks-must-inform-addons-as-a. Keep any eye on Heroku's status page (Nothing reported yet).\n. I'm getting these timeout errors:\n2014-05-01T01:13:24.374478+00:00 app[web.1]: [Thu May 01 01:13:24.335016 2014] [proxy_fcgi:error] [pid 52:tid 139908692125440] (70007)The timeout specified has expired: [client 10.147.157.74:38061] AH01075: Error dispatching request to :14311:\n2014-05-01T01:13:25.374696+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"NOTICE: PHP message: PHP Warning:  Missing argument 3 for wpsql_result(), called in /app/wp-content/pg4wp/core.php(32) : eval()'d code on line 755 and defined in /app/wp-content/pg4wp/driver_pgsql.php on line 58\"\n2014-05-01T01:13:25.374705+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"NOTICE: PHP message: PHP Warning:  pg_fetch_result() expects parameter 1 to be resource, boolean given in /app/wp-content/pg4wp/driver_pgsql.php on line 59\"\n2014-05-01T01:13:25.374707+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"NOTICE: PHP message: PHP Warning:  pg_query(): Query failed: ERROR:  missing FROM-clause entry for table \"session\"\"\n2014-05-01T01:13:25.374709+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"LINE 1: SELECT @@SESSION.sql_mode\"\n2014-05-01T01:13:25.374711+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"                 ^ in /app/wp-content/pg4wp/driver_pgsql.php on line 133\"\nThis may or may not have to do with Heroku recently changing to a new PHP build pack. You can change to the legacy build pack by setting: heroku config:set BUILDPACK_URL=https://github.com/heroku/heroku-buildpack-php#legacy. This gets past the timeout errors but creates an entire slew of new errors when setting up a WP fresh install. Here is one of several database errors:\nWordPress database error: [ERROR: could not read block 7 in file \"base/54780/12684\": read only 0 of 8192 bytes]\nCREATE TABLE wp_users ( ID bigint(20) unsigned NOT NULL auto_increment, user_login varchar(60) NOT NULL default '', user_pass varchar(64) NOT NULL default '', user_nicename varchar(50) NOT NULL default '', user_email varchar(100) NOT NULL default '', user_url varchar(100) NOT NULL default '', user_registered datetime NOT NULL default '0000-00-00 00:00:00', user_activation_key varchar(60) NOT NULL default '', user_status int(11) NOT NULL default '0', display_name varchar(250) NOT NULL default '', PRIMARY KEY (ID), KEY user_login_key (user_login), KEY user_nicename (user_nicename) ) DEFAULT CHARACTER SET utf\n. Thanks for the update. It looks like the new pg4wp upgrade is working to an extent. However, I'm getting this error on a fresh install:\n\n. I've experienced the same in testing the PR for v3.9: #79. \n. Make sure you're using the legacy build pack.\nOn Aug 30, 2014 1:57 PM, \"Declan Cook\" notifications@github.com wrote:\n\nIs there a fix for this? I tried to follow this setup today and I am\ngetting the same errors in my logs.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mhoofman/wordpress-heroku/issues/80#issuecomment-53965602\n.\n. Make sure that it rebuilds the repo with the legacy build pack. You may have to make an empty commit,\n\ngit commit --allow-empty -m \"empty commit\"\ngit push heroku production:master\n. Getting these errors after a fresh install,\n\n. Sorta. :sweat: \n. :thumbsup: \n. :+1: \n. This seems to be a problem with the PHP legacy build pack. Launching Apache is throwing an error on the libssl version. Its likely that a later version of libssl is installed on the Heroku instance.\nhttpd: Syntax error on line 57 of /app/apache/conf/httpd.conf: Cannot load \n/app/apache/modules/libphp5.so into server: libssl.so.0.9.8: cannot open shared object file: No such file or directory\n. Okay, so I have clean installs working now.\nI believe the legacy PHP buildpack is currently having issues with libssl so I have the project now configured on Heroku's latest default PHP buildpack. This is ultimately what it should be using anyway.\nA small change was needed in pg4wp in order for it to work correctly. WP detects the PHP version and will decide which database driver to use. If the version is greater than or equal to 5.5 then it will use mysqli. Pg4wp only replaces commands for mysql_*. I removed the version check so that it will now use mysql_* and properly replace it with postgres processed queries.\nPlease test out this fix in the branch: https://github.com/mhoofman/wordpress-heroku/tree/fix_pg4wp\nSoon I would like to completely remove pg4wp and switch the project to use mysql since there are now good mysql addons available.\n. Should be resolved with PR #90.\n. This didn't fix the problem for #89.\nDid f96d36a9072605472ef162ae6c9c837152386696 fix or cause issues with running WordPress locally?\n. This does appear to fix deploy on the default PHP heroku buildpack. It prevents the use of mysqli commands with a later version of PHP.\n. Updated. :sunglasses: \n. :+1: \n. I don't have MAMP to test this but the env var should be settable as described in the previous revision of the wiki instructions:\nhttps://github.com/mhoofman/wordpress-heroku/wiki/Setting-Up-a-Local-Environment-on-Mac-OS-X/4dd0970fbf9a2d7a983c32a51e62b4ce20261d3a\nCould you verify that you're not able to set this env var as described? If you can, could you please re-add that part of the instructions back to the wiki? This should only be specific to users who would like to use MAMP so it shouldn't be necessary to modify the wp-config.php file.\n. Thank you!\n. ",
    "evolve2k": "Cheers thanks for that. Very clear now. \nGreat work!\n. ",
    "fbjork": "Ok, thanks. Is there any plugin that allows static asset storage on S3 or in the database?\nGiven Heroku's filesystem i'm limited to adding static logos etc via git.\nOn Nov 29, 2011, at 7:51, Matt Hoofmanreply@reply.github.com wrote:\n\nOddly it looks like the version of PHP used by Heroku does not have JPG support for GD. Apparently imagejpeg() requires GD with JPG support. You could try to use a different image format for the header.\n\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/mhoofman/wordpress-heroku/issues/2#issuecomment-2932300\n. Yeah, that's the one I use, but it only works for post images etc.\n. \n",
    "mattyb": "It looks like heroku has imagemagick installed.  This plugin worked as soon as I activated & enabled it: http://wordpress.org/extend/plugins/imagemagick-engine/\n. ",
    "reedlaw": "I just tried out that plugin and it fails:\nimagecreatefromstring(): No JPEG support in this PHP build in /app/www/wp-includes/media.php on line 258 Warning: \n. ",
    "dwaynemac": "that plugin seem's not be updated, is this still an issue?\n. ",
    "lurraca": "I tried with Amazon S3 Uploads plugin and files are not getting uploaded. I actually configured a wordpress installation using MAMP and the plugin is working fine on my local env but not Heroku.\n. ",
    "joaomilho": "Any update on this issue?\n. ",
    "wesbos": "web.config is the windows version of a htaccess file, not sure why you would have one for heroku\n. ",
    "javanvg": "Same issue on our end. Not sure why but the system hangs on saving or editing content. :(\n. ",
    "askehansen": "Same issue for me\n. ",
    "joshrtay": "I'm still getting a maxClient error. Any thoughts?\n. 2013-11-13T22:28:31.743113+00:00 app[web.1]: [Wed Nov 13 22:28:30 2013] [error] server reached MaxClients setting, consider raising the MaxClients setting\n. +1\n. I am able to upload images. I agree with @khbites - I think its related to the GD library.\n. ",
    "justindthomas": "Sorry about the Facebook add then revert - I forgot about that. I added to the master branch on accident and then reverted it.\nI can probably just pull your master again without that hiccup and update it if you need me to.\n. I'll resubmit.\n. ",
    "gaaady": "I'm not coming from the PHP world.\nWhat is the quickest way to run it locally on osx?\n. I added these instructions to the Readme.\nhttps://github.com/mhoofman/wordpress-heroku/pull/13\n. ",
    "mauriciobomfim": "Hi, \nI've just executed the recipe below, and now I can install plugins on heroku instance:\nhttp://hakre.wordpress.com/2012/05/20/php-on-heroku-again\nYou only need execute the topics \"Compile PHP zlib extension for Heroku\" and \"Installing PHP zlib extension for Heroku\"\nCheers,\nMauricio\n. ",
    "andrewmunsell": "Remember, if you install anything on your instance from the Wordpress Admin Panel (plugins or themes) it'll be deleted once you push a new version to Heroku or restart your Dyno... The filesystem is ephemeral.\n. If you're referring to installing plugins in the dashboard, no it will not. You always need to download and extract the plugin locally into wp-plugins, commit it to your Git repository, and then push it to Heroku.\n. ",
    "louy2": "@andrewmunsell Will pull then push resolve this?\n. @andrewmunsell So that's the case! Thank you so much! Seems I wasted quite a little time on getting zlib support. \n. ",
    "murilopolese": "@louy2, I didn't try this one yet but seems the solution http://hakre.wordpress.com/2012/05/20/php-on-heroku-again/\n. ",
    "hanchang": "+1 I'm having the exact same issue, any help would be much appreciated!\n. ",
    "siddhuwarrier": "Hi,\nYou need to have your Postgres server running. If you're on a Mac, installing PostgresApp and starting it up (you'll see a little elephant on the top right-hand corner of your screen).\nHTH,\nSid\n. ",
    "SteveArnold5": "I had the same problem.  I wrote about it here: http://www.stevearnold5.com/?p=16.  I hope it helps.\n. I understand.  Thanks for the reply.\n. ",
    "baileyspace": "Hi, I ran through the steps in Steve's article and I'm still getting the error. My postgres settings in the config file look like this:\n$db = parse_url($_ENV[\"postgres://username:password@localhost:5432/mydatabase\"]);\nIs that the correct formation? Anything else that might be tripping me up?\n. ",
    "kintso": "Hi @SteveArnold5,\nThe URL you provided points to an error. Could you please share how you did it?\n. ",
    "jiang925": "I run my heroku-wordpress locally on a Raspberry Pi. I inject environment variables using PHP's www.conf file. I see people complaints about having this issue on Mac as well. The solution should be the same. Replace the $_ENV on the $db line with getenv.\nI wrote about the whole process, with environment variable injection as well in here: http://blog.jiang925.com/2015/06/01/run-heroku-version-of-wordpress-locally-on-raspberry-pi-fixed-cant-select-database-problem/.\nI forked this project to get it to work: https://github.com/jiang925/wordpress-heroku. Once I figure out how to get pull request to work, I'll submit a pull request. \n. Check this blog out. It fixes the \"Can't select database problem on WordPress on Heroku\".\nhttp://blog.jiang925.com/2015/06/01/run-heroku-version-of-wordpress-locally-on-raspberry-pi-fixed-cant-select-database-problem/\n. Check this blog out. It fixes the \"Can't select database problem on WordPress on Heroku\".\nhttp://blog.jiang925.com/2015/06/01/run-heroku-version-of-wordpress-locally-on-raspberry-pi-fixed-cant-select-database-problem/\n. @ibroadfo Rebooted the server. I don't remember exactly what I did. In essence:\nchange this line in wp-config.php\n$db = parse_url($_ENV[\"DATABASE_URL\"]);\nto\n$db = parse_url(getenv(\"DATABASE_URL\"));\n. ",
    "leods92": "I'm having the same problem. I guess we would need to change php.ini's timeout value but that is not possible with Heroku or is it? :/\n. ",
    "ryw": "Anyone get this to work? Just tried to install CoreControl plugin based on this post and was able to get a different error, but still no dice :(\n. I'm seeing same thing :(\n. FYI I replaced line 18 w/ full URL, which you can get from running heroku config\n$db = parse_url('postgres://user:pass@ec2-xxx.compute-1.amazonaws.com:5432/xxx');\nNo idea why this works tho :) PHP loses access to ENV variable?\n. Interesting that mine was down too when I hit the URL, and came back a minute later...\n. Seems like the PHP app needs a way to automatically reconnect like how in Rails database.yml one can set reconnect: true and the app magically works \"better\".\n. Thanks for idea @joshuawalker — just implemented that on my attempt, so far so good.\n. ",
    "pepito2k": "I'm running into the same issue, it seems to be heroku blocking server-to-server connections.\n. ",
    "joelcuevas": "Same here. CoreControl didn't help.\n. ",
    "raywu": "I'm getting a site_inaccessible error and I'm new to Wordpress.org after I tried Core-Control\nError Details: The Jetpack server was unable to communicate with your site [IXR -32300: transport error: http_request_failed Operation timed out after 15132 milliseconds with 0 out of -1 bytes received]\nThe xmlrpc.php is at the root directory. I tried to modify the .htaccess according to this post but it crashed the host: http://wordpress.org/support/topic/plugin-jetpack-site_inaccessible-1\nAnyone has a fix for this? I read that the key is to allow Heroku to free up xmlrpc.php with SecFilterRemove disabled in .htaccess.\n. ",
    "xyu": "I don't think this is possible using the free tier from Heroku. On my instance I'm seeing the following logs:\n2013-06-03T13:15:21.391493+00:00 heroku[router]: at=info method=HEAD path=/wp-admin/admin.php?page=jetpack&action=register&_wpnonce=XXXXXXXXXX host=www.xyu.io fwd=\"24.61.130.200\" dyno=web.1 connect=1ms service=16488ms status=200 bytes=0\n2013-06-03T13:15:21.511473+00:00 heroku[router]: at=info method=POST path=/xmlrpc.php?for=jetpack host=www.xyu.io fwd=\"72.232.7.14\" dyno=web.1 connect=13ms service=15066ms status=200 bytes=207\n2013-06-03T13:15:21.810721+00:00 app[web.1]: 10.68.182.136 - - [03/Jun/2013:13:15:04 +0000] \"HEAD /wp-admin/admin.php?page=jetpack&action=register&_wpnonce=XXXXXXXXXX HTTP/1.1\" 200 -\n2013-06-03T13:15:21.810721+00:00 app[web.1]: 10.241.82.47 - - [03/Jun/2013:13:15:21 +0000] \"POST /xmlrpc.php?for=jetpack HTTP/1.1\" 200 207\nWhich seems to indicate the register call is hitting the web dyno which keeps the connection open and requests that jetpack servers hit the XML-RPC endpoint, which it does. However because there's only one dyno the XML-RPC is queued behind the initial register call and thus never completes / times out.\nIt does not seem to be possible to enable jetpack without at least 2 web dynos running.\n. So the problem was the concurrent connections issue and Core-Control was not actually needed. Above is a pull request to add the Jetpack plugin and reconfigure the web dyno to accept up to 8 concurrent connections. This fixes the issues with connecting Jetpack and also makes the site more performant to boot.\n. ",
    "mbikovitsky": "Sorry, couldn't reproduce this - everything seems to be fine. Check it out: http://young-frost-5848.herokuapp.com/.\nUsername is admin and password is 1234.\nI'm using WordPress from reedlaw's repository (version 3.4.1).\n. Seems to work here as well.\n. ",
    "ErikFontanel": "Tantan-s3 is okay for most poeple, but it saves the files on a temporary location on the heroku server. So some plugins don't like that, so you better use WP Read Only which surpasses the temporary caching.\n. ",
    "stilist": "+1 for WP Read Only\n. ",
    "mkdizajn": "Great addition to this repo!\n. ",
    "kumo": "In the end I discovered that the problem was the port number. I don't know if 5552 is non-standard, but I had to add it to DB_HOST to get it to work.\n. ",
    "cesardv": "@andyjbas \nDid you ever get your issue figured out?\n. lol OK. I was just giving this repo a try to attempt to hack together a small obituary site for a friend that passed away... I wasn't sure if this repo actually worked anymore with heroku... I doubt it since it's been so long since it's been updated.\n. ",
    "andyjbas": "I can't even remember what I was working on at the time of posting this. Let's assume all is good :). \n. ",
    "joshuawalker": "Try explicitly defining your DB host and port in wp-config. On line 31, replace\n$db[\"host\"]\nwith\n'youramazonec2url.com:port'\nwhich you can find by logging into Heroku Postgres. For me, line 31 looks now:\ndefine('DB_HOST', 'ec2-54-243-238-144.compute-1.amazonaws.com:5432');\nI was also experiencing this issue, but this fix seems to working well for me (touch wood!).\n. Thanks for that, @ryw - seems like a more reliable fix.\n. Also experienced the issues again. Just tinkering, I changed the pg4wp plugin driver file to open a persistent, always open connection to the DB: on line 90, pg_connect to pg_pconnect. I don't actually know if this does or will do anything, but it functions at the moment...\nShould be said that  pconnect isn't suitable for heavy-load websites: http://www.manticmoo.com/articles/jeff/programming/postgresql/difference-between-pg_connect-and-pg_pconnect.php\n. Haven't experienced any connection issues thus far - will report back here if they come back.\n. @catspaw Have you tried pg_pconnect? I haven't experienced any connection issues since changing it.\n. ",
    "catspaw": "Thanks for your reply, joshuawalker.\nI've made the changes and will wait a few hours to see if when everything goes to \"sleep\" again, it continues to work.\n. No problems since!  Awesome -- thanks.\n. Problem occurred again this morning, despite the fix above. :/\n. Database errors again this morning. :(\n. ",
    "markrickert": "An I right in assuming that this somehow has to do with Heroku\nspinning down the apache process when there's no active connections to\nthe site for a while?\n. Try running heroku addons:add sendgrid:starter and sending email again.\nYou can see the sendgrid documentation here: https://devcenter.heroku.com/articles/sendgrid\n. You might have to use this plugin and check the documentation on how to get your username and password. It's worth a shot!\n. Aren't those settings in the wp core? Its not usually a great idea to modify the wordpress core files. Well... i take that back... it's never a good idea to modify the core files.\n. ",
    "gugol2": "My wordpress site has been running on heroku for longer than a year...\nNow I have tried to migrate my heroku wordpress to a simple hosting php+postgresql and I get this error all the time \"Error establishing a database connection\".\nAny clues or help to fix it?\n:)\nI solved in the end... I had a typo error in my wp-config.php.\nIf anybody interested I set it like so:\n// * Heroku Postgres settings - from Heroku Environment * //\n//$db = parse_url($_ENV[\"DATABASE_URL\"]);\n// * MySQL settings - You can get this info from your web host * //\n/* The name of the database for WordPress /\ndefine('DB_NAME', \"dbname\");\n/* MySQL database username /\ndefine('DB_USER', \"dbuser\");\n/* MySQL database password /\ndefine('DB_PASSWORD', \"dbuserpassword\");\n/* MySQL hostname /\ndefine('DB_HOST', \"localhost\");\n/* Database Charset to use in creating database tables. /\ndefine('DB_CHARSET', 'utf8');\n/* The Database Collate type. Don't change this if in doubt. /\ndefine('DB_COLLATE', '');\n. ",
    "sirtimbly": "Same issue. Basically, since moving data from MySQL to PostgresSQL is such a huge pain, there is no way to transition from a classic wordpress install to wordpress since the importer is broken.\nUPDATE: SOLVED!\nTo fix this issue: \n1. Add the file you wish to import into your /wp-content/uploads/ directory structure and use the current year/month like \"/wp-content/uploads/2013/01/blogname.wordpress.2013-01-10.xml_.txt (make sure to change the file extension) this is where wordpress would have uploaded the file).\n2. Commit and push this new file to Heroku.\n3. Disable the Wordpress Read Only(WPRO) plugin.\n4. Run the import like normal.\n5. Re-enable the WPRO plugin.\n. I wish I could find the same service for video.\n. ",
    "jayvansantos": "You're the man. Thanks.\n. I fixed the issue a while ago but after editing some categories, at the same time, about 20. It now gives me application errors. Editing multiple posts and changing their categories will break everything.\n. ",
    "jaxzin": "This still doesn't work for me. It fails to import any of the Media, leaving the site in a broken state.\n. Relates to #16 and includes an updated README section with a step-by-step distillation of the instructions found there or linked from that issue.\n. ",
    "lcdvirgo": "Thanks a lot sirtimbly! Deactivate WPro solved the problem when I was trying to import dummy XML wordpress content. Thanks again!\n. ",
    "lonnon": "Elegant solution to an annoying problem. Thank you.\n. ",
    "koheipo": "Thank you! \n. ",
    "tobrien": "Sounds like a disconnect or a misunderstanding of how Heroku works.\nRunning Wordpress on Heroku with this wordpress-heroku distribution is a\nbit of a hack, it works, but you have to remember one thing:\n1. Changes to the filesystem on Heroku don't persist across deploys\nForget you have access to the filesystem.   Pretend you don't have access\nto the running filesystem and that you have to update the source whenever\nyou need to change anything in wp-content.   This means that everything has\nto happen in Git.   It also means that you can't upload attachments unless\nyou configure them to be backed by S3, and that there are a whole class of\nplugins that need to screw around with the filesystem that you won't have\nacccess to.\nHope this helps\nTim\nOn Thu, Jan 31, 2013 at 5:45 AM, burakkilic notifications@github.comwrote:\n\nHi;\nI download some plugins from Wordpress to my blog(not to my local). It was\nworking perfect. But some hours later, I see that they are gone from\nfilesystem. Nothing happens to DB but the plug in files. Why it happens?\n—\nReply to this email directly or view it on GitHubhttps://github.com/mhoofman/wordpress-heroku/issues/31.\n. \n",
    "burakkilic": "I see. So I should do eveything in my local Wordpress installation, but the DB is single on heroku. Than I should push it to the production. Am I right? Do you know another good way?\n. ",
    "kristoffernolgren": "I had this problem with an invalid bucket-name.\n. Thanks! I did though, it's visible in dashboard.heroku.com (also before I added the plugin, I just got a server error (because of missing username/password-parameters).\n. If I added the settings that is:\n```\n// Set to use PHP's mail()\n//$phpmailer->IsMail();\n// Over ride and set to use SMTP. Set enviromental variables.\n$phpmailer->IsSMTP();\n$phpmailer->SMTPAuth = true; // enable SMTP authentication\n$phpmailer->Port = 25; // set the SMTP server port\n$phpmailer->Host = 'smtp.sendgrid.net'; // SMTP server\n$phpmailer->Username = $_ENV[\"SENDGRID_USERNAME\"]; // SMTP server username\n$phpmailer->Password = $_ENV[\"SENDGRID_PASSWORD\"]; // SMTP server password\n$phpmailer->From = $bloginfo = get_bloginfo( 'admin_email', 'raw' );\n$phpmailer->FromName = $bloginfo = get_bloginfo( 'name', 'raw' );\n$phpmailer->Sender = $bloginfo = get_bloginfo( 'admin_email', 'raw' );\n//$phpmailer->AddReplyTo($bloginfo = get_bloginfo( 'admin_email', 'raw' );, $bloginfo = get_bloginfo( 'name', 'raw' ););\n```\n. ",
    "liujimj": "I'm seeing a similar issue, but I've confirmed my S3 setup (for example, I can upload media to S3 and then insert it directly into pages). However, putting images into a gallery and then saving leaves an empty gallery when I try to edit it again; the images also don't show up on the page.\n. So on further reflection, the NextGen gallery plugin doesn't work either, because it tries to write locally.\nI'm aware that I can run MAMP locally get the plugin and galleries running, but is there a better solution? Seems odd to split content editing (gallery vs. posts/pages) between local and production, unless there's a good way to sync the local PostGres to prod.\n. ",
    "mdoerneman": "I have also confirmed my S3 setup. Is there no solution to this?\n. It looks like it may be a compatibility issue with Postgresql for Wordpress:\nhttp://wordpress.org/support/topic/possible-nextgen-gallery-compatibility-issue\n. ",
    "dz0rg": "I have the same problem, I think it's because of a bad PostgreSQL query. When I click on the \"create gallery\" button, I get the following error in the logs:\nWordPress database error ERROR:  column p.id does not exist\\nLINE 1: SELECT p.id FROM wp_posts AS p  WHERE p.post_date > '2013-03...\\n               ^ for query SELECT p.id FROM wp_posts AS p  WHERE p.post_date > '2013-03-24 16:12:24' AND p.post_type = 'post' AND p.post_status = 'publish'  ORDER BY p.post_date ASC LIMIT 1\nTo solve this problem, I replaced p.id by p.ID in the file \"wp-includes/link-template.php\" at line 1177. The query is now valid, but I get a second error with the query below:\nWordPress database error ERROR:  function field(bigint, integer, integer) does not exist\\nLINE 1: ... AND (wp_posts.post_status = 'inherit')  ORDER BY FIELD( wp_...\\n                                                             ^\\nHINT:  No function matches the given name and argument types. You might need to add explicit type casts. for query SELECT   wp_posts.ID FROM wp_posts  WHERE 1=1  AND wp_posts.ID IN (563,562) AND (wp_posts.post_mime_type LIKE 'image/%')  AND wp_posts.post_type = 'attachment' AND (wp_posts.post_status = 'inherit')  ORDER BY FIELD( wp_posts.ID, 563,562 ) LIMIT 0, 2 made by require('wp-blog-header.php'), require_once('wp-includes/template-loader.php'), include('/themes/twentyten/page.php'), get_template_part, locate_template, load_template, require('/themes/twentyten/loop-page.php'), the_content, apply_filters('the_content'), call_user_func_array, do_shortcode, preg_replace_callback, do_\nIt seems that PostgreSQL does not recognize the ORDER BY FIELD. I did not find in the code where is the declaration of this query.\n. ",
    "ericgj": "I don't know if it's related but I saw similar problems not using NextGen but the plain WP gallery + Cloudinary. The problem was solved for me by fixing the syntax of the gallery shortcode. What it generates by default is something like\n[gallery ids=\"1,2,3,4,5\"]\nwhereas it should be\n[gallery include=\"1,2,3,4,5\"]\nOnce I made this change the galleries seemed fine. Don't know if this is a bug in this version of wordpress or what.\n. No memory of this, sorry...!  But it looks like it would be in the \"text\" or \"source\" view of the WP editor.\n. @scottsd  I don't agree with making that change to the default wp-config, not everyone is going to want to set up a local environment, others will use MAMP, etc. Basically I changed it as a last resort :wink: and would welcome someone who knows apache saying there's a better way.\n. Great plugin, thanks for that @scottsd, exactly what I needed. I don't have an opinion whether it should be bundled here, but maybe at least should have a mention in the readme. \n. PHP is a mystery to me in general, but given that error message did you check your PHP installation?  It may simply be the postgres extension needs to be enabled in php.ini  (un-comment the extension=pdo_pgsql.so line).  You may also need to install it first, check your package manager (for instance Debian has apt-get install php5-pgsql).\nIf this fixes it, or however you resolve it, could you add it to the instructions so it will save the next person some head-banging?\n. ",
    "bruno-rodrigues": "@ericgj Where did you made the changes to fix this \"ids\"vs \"include\" issue?\n. What I want is to change from ids to include programmatically, I already did it manually on \"text tab\".\n. ",
    "miken": "@ericgj That solution of switching from ids to include worked for me too.\n. ",
    "cR0Ckr0x": "I have this same problem, but using Gallery field from Advanced Custom Fields PRO.\nThis is what I get:\nWordPress database error: [ERRORE: la funzione field(bigint, integer) non esiste LINE 1: ... wp_posts.post_status <> 'auto-draft')) ORDER BY FIELD( wp_... ^ HINT: Nessuna funzione trovata con nome e tipi di argomenti forniti. Potrebbe essere necessario convertire i tipi esplicitamente.]\nSELECT wp_posts.* FROM wp_posts WHERE 1=1 AND wp_posts.ID IN (902) AND wp_posts.post_type = 'attachment' AND ((wp_posts.post_status <> 'trash' AND wp_posts.post_status <> 'auto-draft')) ORDER BY FIELD( wp_posts.ID, 902 )\nHow can I solve this?\nAt least where is located the query, so I can attempt to modify it directly and test if it works?\nAny help will be greatly appreciated! 👍 . ",
    "scottsd": "It would be great to remove the part with \"Change the first line of your wp-config.php...\"\nand just have the default wp-config changed to use the if () done by Eric.\nIt won't affect anything and makes it run almost out of the box locally.\n. @mhoofman To enable the plugin, you need an account, same as S3.\n. ",
    "bigtiger": "@markrickert You probably aren't interested in this anymore but you were correct. SendGrid is the way to go here and I just submitted Pull Request #65 based on your recommendation after getting it to work on my wordpress-heroku install.\nThanks,\nJim\n. I've experienced this error before. But, I'm not sure if I'll be able to get you to a full recovery because of a bit of config that needs to be done inside of the WP admin.\nIf you interrogate heroku config you should see SENDGRID_PASSWORD and SENDGRID_USERNAME.\nOn the WP dashboard you need to configure sendgrid by adding the heroku config username and password.\n\nLet me know if there is anything else I can do.\n. @joshrtay Are you able to upload images?\n. Closing this issue in favor of discussion on Pull Request #62 \n. Found a solution. See: https://github.com/yandod/heroku-libraries/tree/master/php/mbstring\nPut the file mbstring.so in the root of your repo. Rename example-php.ini to php.ini and also place that in the root of your repo. On the next push your Heroku hosted WP instance will have Multibyte support. If that ever becomes a problem for you.\nh/t https://scripticon.herokuapp.com/getting-wp-typography-working-on-heroku/\n. Closed without a pull request because the culprit is a theme or plugin I've installed which is not a part of wordpress-heroku. @mhoofman You may consider adding it because it was a showstopper for me once I did run into it. I would happily submit a PR if needed.\n. ",
    "ghost": "Hopefully someone can help me. Even though I added SendGrid to my app before pushing my master to Heroku, when I created the admin user account, the confirmation email wasn't sent. So when I attempt to login to WP it says my password is incorrect. If I try to reset the password I get a notice from WP saying that the host has disabled the mail() function. \nAll I have to go on in my web log is this:\nWARNING: [pool www] child 48 said into stderr: \"sh: -t: not found\"\nI can access my SendGrid dashboard from my Heroku app dashboard, so I'm kinda stuck! Anyone experience this before? Thanks.\n. I was and am having the same issue but I've figured out that it has to do with the use of single quotes used in the options panel of my current theme. The options aren't saved to the file system but rather to the wp_options table in the Postgres database. If any single quotes exist in the form fields the save operation halts and never completes although my theme states that the save was successful.\nI first noticed this when I initially installed the theme. My theme uses Google Fonts and there was a font included and tagged 'Open Sans'. Only once I realized that I should remove the single quotes in the field would it ever actually save.\nSince then it has continued to saved each change until today. Now I'm trying to save my Google Analytics code inside a multiline text box. Here's the scrtip.\n\n  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n  ga('create', '############', 'auto');\n  ga('send', 'pageview');\n\nThe settings no longer save and I'm trying to find a way to escape the single quotes.\nAny ideas.\n. ",
    "ibroadfo": "Oops, sorry.\ncorrected PR incoming.\n. so this is down to the mysql-specific syntax used to delete from multiple tables at once; it's also used in wp-admin/includes/schema.php and only seems to have been added in 3.7.\nI'll see about pg-ifying it tomorrow.\n. That's all the broken deletes fixed; I successfully installed from scratch and upgrades seem to be working fine too.\n\n:)\n$ export TESTAPP=testing-heroku-wordpress-77; heroku create $TESTAPP;heroku addons:add heroku-postgresql:dev -a $TESTAPP;heroku git:remote -a $TESTAPP -r $TESTAPP;git push $TESTAPP production:master;heroku open -a $TESTAPP\n. apologies, i forgot to check this. fresh installs seem to succeed again now.\nif i forget again in future, i hereby promise to airmail you 1 (one) hot or cold beverage of your choice.\n. plugins can just be downloaded directly and extracted into the plugins directory; there's no need to run a local web server. :)\n. again, you can do that manually, but\n- be careful not to override heroku-specific stuff\n- wp updates do get published here too; see e.g. #70 \n. ugh, sorry i forgot all about this when i merged 3.9 into master. closing as borked.\n. fresh installs work ✅\nupgrades work ✅\n. I think I put this pr together before the new php announcement, yeah. Ugh.\nMy live install is still on the legacy build pack, I'll look into what's\nincompatible today.\nOn Thursday, 1 May 2014, Matt Hoofman notifications@github.com wrote:\n\nI'm getting these timeout errors:\n2014-05-01T01:13:24.374478+00:00 app[web.1]: [Thu May 01 01:13:24.335016 2014] [proxy_fcgi:error] pid 52:tid 139908692125440The timeout specified has expired: [client 10.147.157.74:38061] AH01075: Error dispatching request to :14311:\n2014-05-01T01:13:25.374696+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"NOTICE: PHP message: PHP Warning:  Missing argument 3 for wpsql_result(), called in /app/wp-content/pg4wp/core.php(32) : eval()'d code on line 755 and defined in /app/wp-content/pg4wp/driver_pgsql.php on line 58\"\n2014-05-01T01:13:25.374705+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"NOTICE: PHP message: PHP Warning:  pg_fetch_result() expects parameter 1 to be resource, boolean given in /app/wp-content/pg4wp/driver_pgsql.php on line 59\"\n2014-05-01T01:13:25.374707+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"NOTICE: PHP message: PHP Warning:  pg_query(): Query failed: ERROR:  missing FROM-clause entry for table \"session\"\"\n2014-05-01T01:13:25.374709+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"LINE 1: SELECT @@SESSION.sql_mode\"\n2014-05-01T01:13:25.374711+00:00 app[web.1]: [01-May-2014 01:13:24] WARNING: [pool www] child 49 said into stderr: \"                 ^ in /app/wp-content/pg4wp/driver_pgsql.php on line 133\"\nThis may or may not have to do with Heroku recently changing to a new PHP\nbuild packhttps://blog.heroku.com/archives/2014/4/29/introducing_the_new_php_on_heroku.\nYou can change to the legacy build pack by setting: heroku config:set\nBUILDPACK_URL=https://github.com/heroku/heroku-buildpack-php#legacy. This\ngets past the timeout errors but creates an entire slew of new errors when\nsetting up a WP fresh install. Here is one of several database errors:\nWordPress database error: [ERROR: could not read block 7 in file \"base/54780/12684\": read only 0 of 8192 bytes]\nCREATE TABLE wp_users ( ID bigint(20) unsigned NOT NULL auto_increment, user_login varchar(60) NOT NULL default '', user_pass varchar(64) NOT NULL default '', user_nicename varchar(50) NOT NULL default '', user_email varchar(100) NOT NULL default '', user_url varchar(100) NOT NULL default '', user_registered datetime NOT NULL default '0000-00-00 00:00:00', user_activation_key varchar(60) NOT NULL default '', user_status int(11) NOT NULL default '0', display_name varchar(250) NOT NULL default '', PRIMARY KEY (ID), KEY user_login_key (user_login), KEY user_nicename (user_nicename) ) DEFAULT CHARACTER SET utf\n\nReply to this email directly or view it on GitHubhttps://github.com/mhoofman/wordpress-heroku/pull/79#issuecomment-41871399\n.\n. ugh, sorry; i've not had a chance to look at this again yet.\n\ninvestigating now\n. so this seems to be a general problem with pg4wp on 3.9:\nhttp://wordpress.org/support/topic/not-working-with-39\nhttp://wordpress.org/support/topic/not-working-with-39-44\nI sort of expected it to be fixed by now, but the plugin's author seems to have gone dark; i'll carry on digging!\n. @dzuelke thanks, i've updated that\n. @mhoofman big apologies, i haven't had time to get back around to this for ages. the pg4wp update notification from @dzuelke coincided with some other things i was doing, so i'll hopefully make progress in the next couple of hours.\n. the pg4wp update broke fresh installs by trying to access the template1 db; fixed now\n. @mhoofman so with the legacy buildpack and fixed pg4wp things seem to be back on track (finally!); now we just need to hope that 4.0 doesn't come out this month…\n. weird, that should have been fixed by dd8e48e; investigating.\n. wfm:\n``\nmorefresh ibroadfo$ git clone https://github.com/ibroadfo/wordpress-heroku\nCloning into 'wordpress-heroku'...\nremote: Counting objects: 5999, done.\nremote: Compressing objects: 100% (2937/2937), done.\nremote: Total 5999 (delta 2977), reused 5972 (delta 2959)\nReceiving objects: 100% (5999/5999), 17.17 MiB | 3.16 MiB/s, done.\nResolving deltas: 100% (2977/2977), done.\nChecking connectivity... done.\nmorefresh ibroadfo$ cd wordpress-heroku/\nwordpress-heroku ibroadfo$ git checkout WP3.9 \nBranch WP3.9 set up to track remote branch WP3.9 from origin.\nSwitched to a new branch 'WP3.9'\nwordpress-heroku ibroadfo$ heroku create\nCreating still-mountain-8752... done, stack is cedar\nhttp://still-mountain-8752.herokuapp.com/ | git@heroku.com:still-mountain-8752.git\nGit remote heroku added\nwordpress-heroku ibroadfo$ heroku addons:add heroku-postgresql:dev\nAdding heroku-postgresql:dev on still-mountain-8752... done, v4 (free)\nAttached as HEROKU_POSTGRESQL_SILVER_URL\nDatabase has been created and is available\n ! This database is empty. If upgrading, you can transfer\n ! data from another database with pgbackups:restore.\nUseheroku addons:docs heroku-postgresql` to view documentation.\nwordpress-heroku ibroadfo$ heroku config:set BUILDPACK_URL=https://github.com/heroku/heroku-buildpack-php#legacy\nSetting config vars and restarting still-mountain-8752... done, v5\nBUILDPACK_URL: https://github.com/heroku/heroku-buildpack-php#legacy\nwordpress-heroku ibroadfo$ git push heroku WP3.9:master\nInitializing repository, done.\nCounting objects: 5999, done.\nDelta compression using up to 4 threads.\nCompressing objects: 100% (2919/2919), done.\nWriting objects: 100% (5999/5999), 17.17 MiB | 363.00 KiB/s, done.\nTotal 5999 (delta 2977), reused 5999 (delta 2977)\n-----> Fetching custom git buildpack... done\n-----> PHP (Legacy) app detected\n !     Your application is utilizing Heroku's legacy PHP support.\n       For more info, visit: https://devcenter.heroku.com/categories/php\n-----> Bundling mcrypt version 2.5.8\n-----> Bundling Apache version 2.2.25\n-----> Bundling PHP version 5.3.27\n-----> Discovering process types\n       Procfile declares types        -> (none)\n       Default types for PHP (Legacy) -> web\n-----> Compressing... done, 30.1MB\n-----> Launching... done, v6\n       http://still-mountain-8752.herokuapp.com/ deployed to Heroku\nTo git@heroku.com:still-mountain-8752.git\n * [new branch]      WP3.9 -> master\nwordpress-heroku ibroadfo$ heroku open\nOpening still-mountain-8752... done\n```\n. ",
    "szechyjs": "run heroku logs after navigating to the broken post and post the output here\n. postgres is case sensitive when it comes to column names in the SQL queries. change p.id to p.ID and things should work.\nI had to make the following change to my site, looking at the error yours may be originating from your current theme.\n```\ndiff --git a/wp-includes/link-template.php b/wp-includes/link-template.php\nindex de76f45..0e5a4e1 100644\n--- a/wp-includes/link-template.php\n+++ b/wp-includes/link-template.php\n@@ -1174,7 +1174,7 @@ function get_adjacent_post( $in_same_cat = false, $excluded_categories = '', $pr\n    $where = apply_filters( \"get_{$adjacent}post_where\", $wpdb->prepare(\"WHERE p.post_date $op %s AND p.post_type = %s AND p.post_status = 'publish' $posts_in_ex_cats_sql\", $current_post_date, $post->post_type), $in_same_cat, $excluded_categories );\n    $sort  = apply_filters( \"get{$adjacent}_post_sort\", \"ORDER BY p.post_date $order LIMIT 1\" );\n\n$query = \"SELECT p.id FROM $wpdb->posts AS p $join $where $sort\";\n$query = \"SELECT p.ID FROM $wpdb->posts AS p $join $where $sort\";\n    $query_key = 'adjacent_post_' . md5($query);\n    $result = wp_cache_get($query_key, 'counts');\n    if ( false !== $result ) {\n```\n\nI would definitely try a new theme, it definitely has several errors in it.\nPHP Fatal error:  Call to undefined function mb_strlen() in /app/www/wp-content/themes/read-v1-9/functions.php on line 656\n. The only way to change wordpress hosted on heroku is through your git repository. If you want to add a plugin, simply download the zip file and extract it to your plugins directory in your local repo. Commit the changes and push it back to heroku.\n. download the plugin zip file and extract it to the plugins directory, commit and push.\n. ",
    "benbull": "2013-07-09T08:09:01.480953+00:00 app[web.1]: 10.10.102.212 - - [09/Jul/2013:08:09:00 +0000] \"GET /?p=1 HTTP/1.1\" 200 4462\n2013-07-09T08:09:01.480953+00:00 app[web.1]: [Tue Jul 09 08:09:00 2013] [error] [client 10.10.102.212] WordPress database error ERROR:  column p.id does not exist\\nLINE 1: SELECT p.id FROM wp_posts AS p  WHERE p.post_date < '2013-07...\\n               ^ for query SELECT p.id FROM wp_posts AS p  WHERE p.post_date < '2013-07-08 15:31:43' AND p.post_type = 'post' AND p.post_status = 'publish'  ORDER BY p.post_date DESC LIMIT 1 made by require('wp-blog-header.php'), require_once('wp-includes/template-loader.php'), include('/themes/read-v1-9/single-post.php'), get_template_part, locate_template, load_template, require('/themes/read-v1-9/post-nosidebar.php'), get_header, locate_template, load_template, require_once('/themes/read-v1-9/header.php'), wp_head, do_action('wp_head'), call_user_func_array, adjacent_posts_rel_link_wp_head, adjacent_posts_rel_link, get_adjacent_post_rel_link, get_adjacent_post, referer: http://intense-dusk-9556.herokuapp.com/\n2013-07-09T08:09:01.480953+00:00 app[web.1]: [Tue Jul 09 08:09:00 2013] [error] [client 10.10.102.212] WordPress database error ERROR:  column p.id does not exist\\nLINE 1: SELECT p.id FROM wp_posts AS p  WHERE p.post_date > '2013-07...\\n               ^ for query SELECT p.id FROM wp_posts AS p  WHERE p.post_date > '2013-07-08 15:31:43' AND p.post_type = 'post' AND p.post_status = 'publish'  ORDER BY p.post_date ASC LIMIT 1 made by require('wp-blog-header.php'), require_once('wp-includes/template-loader.php'), include('/themes/read-v1-9/single-post.php'), get_template_part, locate_template, load_template, require('/themes/read-v1-9/post-nosidebar.php'), get_header, locate_template, load_template, require_once('/themes/read-v1-9/header.php'), wp_head, do_action('wp_head'), call_user_func_array, adjacent_posts_rel_link_wp_head, adjacent_posts_rel_link, get_adjacent_post_rel_link, get_adjacent_post, referer: http://intense-dusk-9556.herokuapp.com/\n2013-07-09T08:09:01.480953+00:00 app[web.1]: [Tue Jul 09 08:09:00 2013] [error] [client 10.10.102.212] PHP Fatal error:  Call to undefined function mb_strlen() in /app/www/wp-content/themes/read-v1-9/functions.php on line 656, referer: http://intense-dusk-9556.herokuapp.com/\nLooks like a theme error?\n. ",
    "leotulipan": "I think this is related to PHP and the GD library?\nThis buildpack https://github.com/mchung/heroku-buildpack-wordpress actually recompiles php. But they use mysql, not postgres.\nI will try out if this fixes things for me in the near future and report back\n. ",
    "abhigenie92": "I am still facing this issue. Any ideas?\n. ",
    "jhjguxin": "Sorry, It's an mistake.\n. ",
    "paulftw": "Fixed this by updating the .htaccess file\n. ",
    "itsthatguy": "+1\n. @mhoofman for me: it doesn't work. it kills wordpress, until you remove it.\n. ",
    "charliel5p": "Hi, I am also trying to install buddypress. I successfully activated the plugin, but everytime I am going to do something (e.g. create a group, comment, etc...) I receive a message \"There was an error saving group details, please try again.\". I am lost here. Anyone can help me out here?\nThanks!\n. ",
    "willyedoo": "Hi Charlie i had the same problem and i think it's about the postgres sql system as this plugins are developped in mysql i finally swichted to this https://github.com/xyu/wordpress-heroku\n. ",
    "bhgames": "+1\n. ",
    "Pasta": "same here\n. ",
    "seb0zz": "Same here\n. ",
    "enriquemorenotent": "How about updating Wordpress version?\n. ",
    "julianguyen": "I have the wordpress running on heroku but I can't set access the servers to update or add features to wordpress from the admin panel.\n. ",
    "newlarry": "I don't think this is possible, b/c wordpress doesn't have direct access to the filesystem on Heroku. For plugins and themes you would need to extract them yourself into your working copy and then push to heroku. I could be wrong.\n. ",
    "quantumpotato": "My plugins need to install other plugins, so I need a local copy working.\n. ",
    "matthewswallace": "So in theory I should be able to update WP locally and then push to heroku or is it best to pull from your repo when you preform the update ?\n. ",
    "srinidhigs": "@lucianojmf Were you able to figure out the issue? I am facing a similar situation.\nMy site address is different from the wordpress address and hence the issue\n . ",
    "joewils": "@quantumpotato The docs should read \"add this folder to the htdocs folder\" not htaccess.\nOn my system I would deploy wordpress-heroku to this path: MacintoshHD/Applications/MAMP/htdocs/\n. This document has some good pointers on working with MAMP and WordPress: http://codex.wordpress.org/Installing_WordPress_Locally_on_Your_Mac_With_MAMP\n. ",
    "alliejanoch": "Looks like Heroku has fixed the issue. Thanks.\n. ",
    "erik-helleren": "It was me being a noob.  I had to \n```\napt-get install php5-pgsql\n```\n. ",
    "Bodhisattva2-0": "Add this to htaccess\n```\n\nRewriteEngine On\nRewriteBase /\nRewriteRule ^index.php$ - [L]\nRewriteCond %{REQUEST_FILENAME} !-f\nRewriteCond %{REQUEST_FILENAME} !-d\nRewriteRule . /index.php [L]\n\n```\n. ",
    "Pcushing": "Perfect. Much appreciated!\n. ",
    "ddimitriou": "I have tried all the above but the error persists.\nI am getting the warning : NOTICE: PHP message: PHP Warning:  pg_query(): Query failed: ERROR:  missing FROM-clause entry for table \"session\"\nI'm no WP expert, but from what I get, this error is coming from user defined variable @SESSION which is properly defined in MySQL but not in PG.\nEDIT: I have found out that despite the warnings, running it on local machine it works just fine. However on Heroku cloud and new build packI keep getting H12 errors (timeouts).\nEDIT2: https://github.com/xyu/heroku-wp has integrated the new heroku buildpack with nginx and mysql. I am in process of upgrading to, since the guy who wrote PG4WP is at large...\n. ",
    "dzuelke": "There is an update out now for PG4WP that addresses the 3.9 incompatibilities: https://wordpress.org/plugins/postgresql-for-wordpress/changelog/\n. ",
    "Decad": "Is there a fix for this? I tried to follow this setup today and I am getting the same errors in my logs.\n. I am using:\nheroku config:set BUILDPACK_URL=https://github.com/heroku/heroku-buildpack-php#legacy\n. That worked thanks\n. ",
    "theolampert": "@crickw I was able to get this working, you need to follow the heroku docs for adding a domain name.  After those steps you should be able to change both the site url and wordpress url and everything will work. You can also edit these values directly in postgresql by finding the table wp_options and entering your desired site and wordpress url, no need to delete and reinstall the entire app.\n. @nkadithya31 did you follow these two steps?\n$ heroku addons:add heroku-postgresql:dev\n$ heroku pg:promote HEROKU_POSTGRESQL_COLOR\nwhere COLOR is the output of the first command.\n. @nkadithya31 ah ok, you should take a look at this https://github.com/xyu/heroku-wp, HHVM and mysql with clearDB instead of postgresql.\n. ",
    "rafriki": "heroku doesn't let you save to filesystem, you will need to install the theme on localhost and then push to heroku\n. ",
    "nathanclark": "I have the same issue.\n. ",
    "34r7h": "Me too\n.  +1 for sql. this fix works tho! thx!\n. ",
    "andysprout": "I just did a clean install using the same fix I did to get this working on locally using MAMP, I removed the if(test_localhosts()) test on line 47 of wp-content/db.config and it also seemed to work without using the legacy build pack.\n. To be honest I'm not a wordpress expert, so I don't fully understand the implications of the WP_USE_EXT_MYSQL setting, I just read the source of version 4.0 and it looked like this would fix the errors I was getting when running locally with MAMP, then after reading https://discussion.heroku.com/t/solved-php-legacy-buildpack/580/5 it seemed related, so I gave it a go and it seems to have fixed #89 \n. without f96d36a I was not able to run locally with MAMP, I tested this fix a few hours ago and was able to deploy to a fresh heroku app, but I only tested without the legacy build pack.\n. ",
    "adithyakhamithkar": "I did try that and also contacted heroku, as I was using hhvm instead of php and hhvm does not support postgresql.\n. ",
    "igorauad": "@meowist how did you solve this? I am having the same problem and the above link posted by @jiang925 appears to be unavailable. Thanks\n. Thanks, @jiang925 . I believe it worked, but now I am stuck again at:\nOne or more database tables are unavailable. The database may need to be repaired.\n. Ok, I found the silly mistake. I had not payed attention to the PHP version. I was using PHP 7.0.10 on MAMP. Only when I actually looked into the logs, I noticed that it is not compatible. Switching to PHP 5.6.25 on MAMP solved the problem.\n. This caused a bit of a headache when trying to run locally on OS X with MAMP 4.0.5, which by default uses PHP 7.0.10. It would be nice to have this fix.\n. I can confirm this works. Thank you very much, @kirstywilliams \n. ",
    "tkisme": "agree\n. ",
    "ryanburnette": "This doesn't sound like an issue in this repo exactly. I generally use WordPress HTTPS to solve this.\nDid you ever work this out?\n. ",
    "BachirC": "This is the right answer. This issue should be closed :). ",
    "pschlenker": "I'm getting these same errors, and I'm running WordPress 4.2.2 also.\n. ",
    "getaaron": "From the WordPress 4.2.2 release notes:\n\nWordPress versions 4.2 and earlier are affected by a critical cross-site scripting vulnerability, which could enable anonymous users to compromise a site. WordPress 4.2.2 includes a comprehensive fix for this issue.\n. \n",
    "manishnagdewani96170": "How can I set version 4.2.2,please let me know..\n. @avishai Did you got update for 4.2 ? Let me know.\n. ",
    "leifg": "I guess this has to do with the non-maintained pg4wp plugin. A potential fix could be this:\nhttps://wordpress.org/support/topic/upgrade-to-wp421-fail\n. ",
    "OKNoah": "This seems to happen when a post is in two categories at once. It doesn't happen on my local install, which uses MySQL though.\n. I fixed this by changing part of wp-config.php. Originally (line 18):\n// ** Heroku Postgres settings - from Heroku Environment ** //\n$db = parse_url( $_ENV[\"DATABASE_URL\"] );\nFix:\n// ** Heroku Postgres settings - from Heroku Environment ** //\n$db = parse_url( getenv(\"DATABASE_URL\") );\nIs there a reason all the other environment variables use getenv() but the database uses $_ENV?\nSide note: I also added two more environment variables to the app and put the in wp-config.php like this,\ndefine('WP_HOME',               getenv('WP_HOME'));\ndefine('WP_SITEURL',            getenv('WP_SITEURL'));\nThese are then set to http://localhost/ in my .env file, and to my sites live domain on Heroku. This prevents Wordpress from redirecting to whatever URL values are in the database. \n. ",
    "tikh": "Looks like only migrated scheduled articles were affected and there are no problems with new ones. \n. ",
    "jmeiss": "Found it!\nMy bad, I've updated PostgreSQL for WordPress (PG4WP) but I shouldn't have replaced it.\n. ",
    "sslash": "Why was this closed? I am getting the same error. ",
    "cwindolf": "Hey -- for anybody that reads this, I'm not using this repo anymore. Just vanilla wordpress, and using an AWS RDS for MySQL. pretty slow but not bad w caching\n. ",
    "robksawyer": ":+1: \nWhen I try to update the core, I get sent to an about.php page that fails to load.\n. ",
    "larson004": "As someone who is not familiar with php. Took me quite sometime to figure this out.. ",
    "kyawmoehaynes": "+1\n. ",
    "curtisstpierre": "same issue here\n. ",
    "macminiosx": "please try my repository.\nhttps://github.com/macminiosx/wordpress-ja-pg4wp2-heroku\n. ",
    "cbanowsky": "+1\n. ",
    "kirstywilliams": "Any solution found for this?\n. Problem: The problem is with PG4WP.\nSolution: Replace with this. Remember to copy db.php into wp-content.\nConfirmed working.\n. ",
    "lifenautjoe": "No, this is because Heroku machines are ephemeral, meaning any plugin or theme you install in the machine will dissapear after a while. If you want to persist your themes or plugins do it on the repository and then deploy. . ",
    "ladydanger": "Hey mate, I know this is late and you’ve most likely already found a solution, but I stumbled on your issue when looking to add ssl today on my wordpress blog hosted with heroku.\nThis worked for me with no redirects.  I'm using Automated Certificate Management on Heroku that was released last month though so not using the ssl plugin and I’ve made changes directly to the files.\nIn the wp-config.php file add the following just above the /* That's all, stop editing! Happy blogging. */ line.\ndefine('FORCE_SSL_ADMIN', true);\n// in some setups HTTP_X_FORWARDED_PROTO might contain \n// a comma-separated list e.g. http,https\n// so check for https existence\nif (strpos($_SERVER['HTTP_X_FORWARDED_PROTO'], 'https') !== false)\n       $_SERVER['HTTPS']='on';\nAnd in the .htcaccess file add this below <IfModule mod_rewrite.c> and above RewriteEngine On.\nRewriteEngine On\nRewriteCond %{HTTP:X-Forwarded-Proto} !https\nRewriteRule ^.*$ https://%{SERVER_NAME}%{REQUEST_URI} [R,L]\nThen push to production.. ",
    "rutchkiwi": "Thanks @ladydanger that sorted it out for me too!. ",
    "snood1205": "That's a heroku issue, not a wordpress issue. \n. ",
    "lenoxramsey": "@kirstywilliams this isn't working for me. I've followed your instructions and copied db.php to wp-content folder and still same issue ... unable to update to 4.6.1+\nIt goes through the process and appears to update but when I click on other admin links in wp, I get 'page isn’t working' error message by browser.. ",
    "shannonio": "I am also currently getting this issue. I updated PG4WP and copied db.php. No luck. . ",
    "Qlipoth": "Hello! please explain me how to update wordpress? Do you use composer?. ",
    "PhilippHeuer": "This project was last updated 2 years ago, it seems pretty dead.\nYou might want to take a look at my project - which already uses WP 4.7.2. There is also a tutorial on how to update wordpress in the wiki.\nhttps://github.com/PhilippHeuer/wordpress-heroku. Forking the repository isn't really an option for a purchased theme. I would still prefer if you asked such questions in my repo -> https://github.com/PhilippHeuer/wordpress-heroku because there isn't really a relation to mhoofman's project.\nYou don't need to push your theme to github/a github fork, since heroku is also hosting the repository. You can just add it now and push your update to heroku - i will update the wiki with an example today (which pushes to heroku only - so your theme stays private).\nEDIT: Added the instructions to the wiki, just ask if anything is unclear.. ",
    "whitleyblaine": "@PhilippHeuer Hey I installed your version and it looks great, but I really need to know how to use themes I've purchased. The wiki page just says \"to-do\" under custom theme installation... any help would be VERY much appreciated.. i've already pushed to heroku .. can i add one in now? i just figured if it was really that simple, he would have already written it in the WIKI. see:\nhttps://github.com/PhilippHeuer/wordpress-heroku/wiki/WordPress---Plugins---Themes. ",
    "tsykoduk": "@whitleyblaine personally I would fork the repo, add the theme in, and then push your fork to Heroku. You can still cherry pick the updates into your fork. . No - you'll need to add the theme to your fork and then push that to Heroku. . ",
    "crisamdegracia": "this is just useless, we need to git push heroku master every plugin, update and theme!! thanks by the way, yeah its free.\n  . see it live >> http://pedrolifeandweb.herokuapp.com/\nstep 1: git clone it\nstep 2: cd to its directory \nstep 3: create your own branch and cd to your branch\nstep 4:  heroku login then heroku create \nstep 5: here's a tricky part. you must change the name of the url that heroku has given you like this (hamlet-adobo-2323.herokuapp.com) to your desired name. like (awesomeSite.herokuapp.com before you git push heroku origin - if not. you will having error if you wish to change it in the future. this issue is  just i cant solve with its remote breaking.. maybe you can but what i am telling you now is the easy part.  so here we go.\nheroku apps:rename -a [previousname] [newname]\nexample:\nheroku apps:rename -a hamlet-adobo-2323        awesomeSite\nthen voila you have a nice name on your site url there.\nstep 6: update your remote (just notice where did i get those naming from the start okay?)\nheroku git:remote --app awesomeSite  \nstep 7:  Create a database\nheroku addons:create heroku-postgresql\nafter creating ... from the next original instruction of mhoofman which the pg:promote.. it didnt work i for me if you have unverified heroku account or no installed postgresql on your machine.. so this is the trick\nopen wp-config.php \n$db = parse_url($_ENV[\"DATABASE-URL\"]);\n//  MySQL settings - You can get this info from your web host  //\n/* The name of the database for WordPress /\ndefine('DB_NAME', trim($db[\"dbname\"],\"/\"));\n/* MySQL database username /\ndefine('DB_USER', $db[\"dbuser\"]);\n/* MySQL database password /\ndefine('DB_PASSWORD', $db[\"pass\"]);\n/* MySQL hostname /\ndefine('DB_HOST', $db[\"host\"]);\n/* Database Charset to use in creating database tables. /\ndefine('DB_CHARSET', 'utf8');\n/* The Database Collate type. Don't change this if in doubt. /\ndefine('DB_COLLATE', '');\nlook for those . then goto your heroku account, look for the postgresql setting\nlook for the values there to fill on those codes above .. like this below .. \nfor the environment variable look for your main setting (not postgres) theres a URL there just like below..\n$db = parse_url($_ENV[\"postgres://mit123231lqspkb:ea1858easd12312d515cd48a33e0671a587f8a50634d0bd58f@ec2-54-227-250-33.compute-1.amazonaws.com:5432/d8asd23219r\"]);\n//  MySQL settings - You can get this info from your web host  //\n/* The name of the database for WordPress /\ndefine('DB_NAME', trim($db[\"d87tnfm9ck9n9r\"],\"/\"));\n/* MySQL database username /\ndefine('DB_USER', $db[\"asdhjkashjsd\"]);\n/* MySQL database password /\ndefine('DB_PASSWORD', $db[\"e2j3hkh12hkjhkj1h23123jkh23hkj3hjkh\"]);\n/* MySQL hostname /\ndefine('DB_HOST', $db[\"ec2-54-227-250-33.compute-1.amazonaws.com:4586\"]);\n(LOOKCAREFULLY HERE.. its a host value and a port value ..)\n/* Database Charset to use in creating database tables. /\ndefine('DB_CHARSET', 'utf8');\n/* The Database Collate type. Don't change this if in doubt. /\ndefine('DB_COLLATE', '');\nstep 8. git add .  (add everything to git)\nstep 9: we add everything to heroku.\ngit push heroku master \nstep 10: visit your awesomeSite.herokuapp.com  << then name the wordpress , leave the  fields blank just put a site title, password auto regen. \nSTEP 11 : DO NOT UPDATE ANYTHING inside heroku wordpress itself .. it will break your site.. you can only update plugin and installed themes (im not sure if they all work) from your local file then push it to heroku .. the themes that initially created by default will only work.  i hope this helps!\n. ",
    "ElNinjaGaiden": "Any solution to this? I'm having the same issue. ",
    "thismahbub": "position: relative; ( position: fixed is doing some problem.)\n. "
}