{
    "ThomasArdal": "A little more info about the node version problem. The error returned when deploying is:\nremote: Node.js versions available on the platform are: 0.6.17, 0.6.20, 0.8.19, 0.8.2.\nremote: No available node.js version matches application's version constraint of '0.10.x'.\nAccording to this tweet: https://twitter.com/guayan/status/323549326687219712 it looks like Azure should support 0.10.x.\n. Looks like you are missing some code in bullet 3?\n. Great. Did you have time to verify it?\n. Great news! The website now successfully deployed. But the service doesn't really work:\nhttp://modernie.azurewebsites.net/?url=http%3A%2F%2Fwww.bing.com\n. Weird. I have switched to the v4 branch and pushed it to azure. Same error.\n. Works on a new website! Thanks a lot. Any plans to merge the v4 branch to master?\n. Cool.\n. ",
    "molant": "Hi @ThomasArdal,\nHave you tried the following:\n- replace all the setImmediate with process.nextTick\n- replace the nodeversion in package.json to 0.8.x\n- add a web.config and in the handlers section put something like this:\n<add name=\"iisnode\" path=\"lib\\service.js\" verb=\"*\" modules=\"iisnode\"/>\nI'll verify this later this week but just in case you want to try it yourself before then :)\n. I forgot to add the symbol so GitHub will interpret it as code. Check now\n. Yep, I just verified.\nThis is the web.config you need to use:\nXML\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<configuration>\n    <system.webServer>\n        <handlers>\n            <add name=\"iisnode\" path=\"lib/service.js\" verb=\"*\" modules=\"iisnode\"/>\n        </handlers>\n        <rewrite>\n            <rules>\n                <rule name=\"DynamicContent\">\n                    <match url=\"/*\" />\n                    <action type=\"Rewrite\" url=\"lib/service.js\"/>\n                </rule>\n            </rules>\n        </rewrite>\n    </system.webServer>\n</configuration>\n. Give a try to the branch v4. I have it running on an instance now.\n. Can you try creating a new azure website just in case there are some files that have not been deployed correctly?\nCheck that:\n- There is a app.js in the root\n- web.config points to that app.js\n- The requires of app.js point to ./lib/checks/\nFYI, I'm using Git to deploy in an Azure Website\n. Once we've  implemented some of the new features we have planned :)\n. People haven't asked about this feature so for now it has been prioritized by others. Is this something you are looking for? Could you please talk a bit about your scenario?\n. @dmethvin can you ask them to try with the latest version in the master branch? Maybe with the proxy settings this is solved for them.\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. Closed in dac428492eb898090ed4bb8d17a9c0214674151e\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. For now is to accept a POST request that will have all the required content (HTML, CSS, JS). If we have all that content preloaded we don't care if there are paths that the scanner cannot reach.\n. This is already implemented in vNext so closing\n. Implemented in vNext so closing\n. Fixed in e59d67fcec06d649fd5c824578a53d76f67c3bdc\n. Closed in dac428492eb898090ed4bb8d17a9c0214674151e\n. Closed in dac428492eb898090ed4bb8d17a9c0214674151e\n. Closed in dac428492eb898090ed4bb8d17a9c0214674151e\n. Closing this issue. They are in v0.4 and although I have a working version there are lots of changes going on with breaking changes so better wait for now.\n. Latest version is running in the 0.10.xx versions\n. SWF object is created dynamically and the plugin free test doesn't check for SWF but for other plugins like Java\n. @dmethvin what do you think? Should we add this test? Should we flag script tags at the beginning that are for tracking purposes? If not, how do we avoid them?\n. We should add defer attributes too then\nOn Tue, May 20, 2014 at 6:43 PM, Dave Methvin notifications@github.comwrote:\n\nNote to self, we should look for async attributes and not warn about\nthose being ahead of CSS, see\nhttps://www.igvita.com/2014/05/20/script-injected-async-scripts-considered-harmful/for examples of when it's useful.\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/20#issuecomment-43703817\n.\n. Not planning on doing this for now. Closing\n. In previous versions the scanner only analyzed the JS files that were in the same domain. If they were in another (or even a subdomain) the JS were ignored. This could be a bug introduced in the new version.\nDo we want to go back to the previous model and thus not analyze all the files or do we want to have a whitelist of approved domains for this?\n. Yes, it is possible :)\n. The problem with the validator is that we are only allowed 1 scan per second and the public scan could potentially have more. Also the local version of the validator doesn't run on azure so I'm not sure what to do about this... @dmethvin any suggestion?\n\nhttp://validator.w3.org/docs/api.html\nNote: If you wish to call the validator programmatically for a batch of documents, please make sure that your script will sleep for at least 1 second between requests. The Markup Validation service is a free, public service for all, your respect is appreciated. thanks.\n. I don't think Azure supports Perl: http://validator.w3.org/docs/install.html\nWe could make the check to be configurable so users running it locally can\nhave the output, but I don't know how that will fit in http://modern.ie\nOn Tue, Oct 15, 2013 at 1:17 AM, Dave Methvin notifications@github.comwrote:\n\nI'm not sure how our Azure server is configured, but could we host the\nvalidator on some other box and then call it privately? Or does that just\npush the problem somewhere else?\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/22#issuecomment-26316550\n.\n. @bbodenmiller thanks for the link!\n\nWe could have a separate instance running the perl code and we query that one. Maybe we can have a version of the tests that points to the W3C endpoint in this branch (I already have that running locally) and point to the other endpoint in production.\n. Thanks!\n. This should be fixed with #7 \nI have it working locally finally with CSSLint and that website returns the unprefixed version as missing :)\n. Fixed in vNext\n. We access kraken for the image size test. Unless you have an account with\nKraken and want to check this. you can delete test\n(lib\\checks\\check-image-compression.js)\niecvlist is accessed to download the list of known websites that need to be\nrendered in compatibility mode. Because your website is also internal you\ncan remove it too (lib\\checks\\check-compatlist.js).\nThis should solve your problems. We will update the code to make sure this\ntests don't break the execution when there isn't internet connectivity.\nThanks for reporting the issues!\nOn Sun, Nov 3, 2013 at 3:26 PM, homebrandcola notifications@github.comwrote:\n\nI've been trying to setup an offline code scanner to can internal web\nresources. However whenever I try to scan an internal URL the application\ncrashes with the following dump in the console:\nC:\\Users\\Public\\browser\\modern.IE-static-code-scan-master>node app.js\nServer started on port 1337\nTo scan a private url go to http://localhost:1337/ and follow the\ninstructions\nC:\\Users\\Public\\browser\\modern.IE-static-code-scan-master\\node_modules\\promised-\nio\\promise.js:242\nthrow error;\n^\nError: connect ETIMEDOUT\nat errnoException (net.js:901:11)\nat Object.afterConnect as oncomplete\nLooking at Wireshark I can see my machine trying to access the following\nonline resources:\napi.kraken.io\niecvlist.microsoft.com\nWhich it cannot.\nIf I connect the machine to the Internet and scan a publicly accessibly\nURL the scanner works, but when I am connected to the corporate network (to\naccess internal URLs, and where I have no Internet access) the scanner\ncrashes.\nI might be able to get access to the resources through the corporate\nproxy, but how would I configure the scanner to use a proxy with a username\nand password?\nThanks, Tim.\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/26\n.\n. Do you have a full url of the resource it is trying to access?\nI don't know what that url is about so I'm wondering if the page is\nreferencing that website via a JS or CSS files...\n\nOn Tue, Nov 12, 2013 at 7:37 PM, scheblein notifications@github.com wrote:\n\nLooking at Wireshark, now it's looking for:\ncds171.sea9.msecn.net\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/26#issuecomment-28360953\n.\n. The compatibility list is used in plugin-free because for reliability reasons. There is already a list of websites IE knows require plugins so we do the check against it. If it passes then we try to figure out if there is a plugin in the page. Plugins can be created dynamically via JS and we cannot detect that so we need to use that list.\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. Unfortunately https://github.com/mikeal/request doesn't support that type of urls so we cannot fix this\n. We'll do the change in our side then\n. Fixed in Next\n. I don't know exactly how we should do this. For detection SPA in general I would go for the second options and look for # o #!. We could also add a check for know libraries for SPA like Angular.\n\nThe problem is how to flag this. Should the tests be aware if they are analyzing a SPA and not throw any error or should we just run an extra test saying if it is a SPA and then the UI will take care of that? Shouldn't we then give more information to the UI as to what test don't apply to SPA?\nI think I would go for:\n- Adding a test call SPA or something similar\n- Add an extra field to the test that do not apply for SPA. Maybe if we want to do it in a generic way this could be the name of the test they depend on so the UI knows if it should ignore this test or not. Maybe something like:\nappliesIf: ['spa:false']\nWhat do you think? Maybe I'm complicating things too much...\n. That is why we also check for # and #! in the links.\nI said Angular just as an example but there are many other libraries that are only meant for SPA. Also if you have any pattern that will help us recognize SPA please share it with us :)\n. After talking with @vlaine we figured out the problem was related to issue #26 \nTo solve this particular issue we need to support a proxy to access external resources. Closing this and opening issue #32 for better tracking\n. This has been fixed by @naokikimura :)\n. I think that a search for roletype or any of the aria attributes should be ok for this tests, at least for a first version and start the conversation.\nWhat do you think?\n. We are already checking for the most common libraries, maybe we can do\nsomething and assume if jQuery UI is present (or any other that supports\naria) then it is OK. I guess the order will be HTML search > JS libraries >\nwarning\nOn Fri, Jan 17, 2014 at 12:39 PM, Dave Methvin notifications@github.comwrote:\n\nWould a warning be given if we didn't find any aria attributes? That could\ngive a lot of false positives. For example, most of the jQuery UI widgets\nsupport aria and will insert them when the markup is enhanced at runtime.\nBut you wouldn't see that in a static scan.\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/34#issuecomment-32644240\n.\n. So the current version in vNext detects the Aria tags only, I've done a bit of research and I've found this post from 2009 about libraries that support Aria: http://blog.paciellogroup.com/2009/07/wai-aria-implementation-in-javascript-ui-libraries/\n\n@dmethvin  should we try the library detection even though they might not be using those controls? We should also try to update the list of libraries.\n. If it is something more or less stable then I would push to vNext, if it is testing then I would create another branch :)\n-----Original Message-----\nFrom: \"Dave Methvin\" notifications@github.com\nSent: ‎1/‎22/‎2014 20:07\nTo: \"InternetExplorer/modern.IE-static-code-scan\" modern.IE-static-code-scan@noreply.github.com\nCc: \"Anton Molleda\" amolleda@gmail.com\nSubject: Re: [modern.IE-static-code-scan] Accessibility: Detect use of ARIAtags (#34)\nI'd be interested in seeing what this generates on a few sites. I have a feeling we will see a lot of noise so we may want to reorganize the output somehow. \nWe should definitely take another look at the libraries. Should I do updates in vNext?\n—\nReply to this email directly or view it on GitHub.\n. The problem with #22 is that we don't know if it is going to hit the main website. Also if you are in an intranet you don't want to send your HTML to an external webservice (and I haven't found any HTML validator in JS).\nI think we should implement this ourselves. Maybe we can assume that if the image is a gif (even a png?) then it doesn't need to have an alt?\nAnother alternative is to download all the images of the website, get their sizes and do another guess, but that is going to slow down the process a lot and I'm not sure it is worth it.\n. OK, looking at the tags is easy and I have it working locally.\nThe problem with Perl is making it work on Azure. The scanner uses azure\nwebsites but that most likely will not work so we will have to use a\ncloudapp. I tried to make the validator locally with IIS but couldn't\nfigure how to make it work, the only windows instructions are for Apache\nand there were several modules and dependencies to install manually :S\nOn Fri, Jan 17, 2014 at 12:35 PM, Dave Methvin notifications@github.comwrote:\n\nTechnically we should be able to run the validator locally, it looks to be\nwritten in Perl and the license is permissive. [image: :smiley_cat:] We'd\nstill have the issue of filtering and formatting the output though, and if\nwe just want to look for ALT tags it's overkill.\nReally, according to the W3C all image tags should have an ALT. If it's\njust decoration and not content then it should be specified as a background\nin CSS. So we shouldn't need to download any of the images, just look at\nthe tags.\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/36#issuecomment-32643985\n.\n. Implemented in vNext\n. Actually #7 is already fixed in vNext. We have the parser used in CSSLint working now :)\nI think that most of the accessibility issues with hover are done via JS. We could:\n- Look for common menu libraries that we know have issues with hover and then highlight those automatically (we should be able to use some RegEx for that)\n- Try to identify the patterns for hover. Maybe we can start with some like $().hover() (and the mouse ones) and depending of the amount of code in the handlers do our best guess? Don't think we will be able to do something like this easily via regex so maybe we will need to add something like ESLint?\n. I added ESLint support in a local branch a while ago (in the 0.1.0 times).\nI don't think it will take too long to update it. The only problem is that\nit is not stable yet and they are doing quite a few changes every day...\nMaybe we can start with the regex and then migrate to ESLint once they lock\ntheir API and make it more robust?\n\nOn Fri, Jan 17, 2014 at 12:43 PM, Dave Methvin notifications@github.comwrote:\n\nHmm, this just might work. I think we should explore a regex solution even\nthough it might not catch everything, just because it could be done quickly\nand the ESLint one would be a much bigger step. If we're going ESLint,\nthough, it does give us a huge amount of functionality.\nI'm thinking we could just look for something like\n/\"'[\"']/ and warn that whatever they're\ntrying to do with mouse pointer actions won't be visible to touch users.\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/37#issuecomment-32644492\n.\n. yes, master is synced with vNext but www.modern.ie hasn't been updated yet. I don't think I have an ETA for the next deployment :-/\nI don't think the format changed from the previous version so it shouldn't be breaking (unless having new tests is the root of the problem). Can you make a diff from the 2 versions? \n. This is the expected behavior. Updates because of patches are \"safer\" and do not include new features so the possibility of breaking changes is smaller.\n. This should be fixed now. Took a look with @dstorey and remove a bunch. We might remove a few more if we decide to not check for Android 2.x\n. Fixed via 21d71c82c4fd790bad26c9a475a0779bc21e796e\n. I just downloaded in a clean install the latest version (after merging vNext into master) and although there are some tests that fail (probably because they have been removed from the CV List) I don't see your error. @pfremm can you download the latest version and check if you still have the same issue?\n\nThanks!\n. This has been deployed and it is working with @mbmccormick's website:\nhttp://modern.ie/en-us/report#http%3A%2F%2Fmbmccormick.com\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. This is fixed in http://dev.modern.ie/tools/staticscan/\nThanks\n. The css prefixes test has been updated and a bunch have been removed in the development branch. We are still adding some prefixes for webkit because of the large amount of android phones running old versions\n. Hello @ypae,\nif you download the current version and execute it you can see what information will be sent before hitting the \"send\" button to get the advice. Basically is a JSON with the name of the test, the status (passed or failed), and some more information that could be relevant (missing prefixes, filenames, line numbers, etc.). I believe the website url is not send.\n. This is a duplicate of #56, closing this ticket.\n. A bit more of information? What website where you trying to scan? Is it a\nclean install with the modules up-to-date?\nOn Wed, Sep 17, 2014 at 10:32 PM, Bung notifications@github.com wrote:\n\n```[root@localhost modern.IE-static-code-scan]# node app.js\nServer started on port 1337\nTo scan a private url go to http://localhost:1337/ and follow the\ninstructions\nTypeError: Cannot read property 'domain' of undefined\nat addCompatSites\n(/root/modern.IE-static-code-scan/lib/checks/compatlist.js:113:120)\nat /root/modern.IE-static-code-scan/lib/checks/compatlist.js:136:17\nat Parser.\n(/root/modern.IE-static-code-scan/node_modules/xml2js/lib/xml2js.js:384:20)\nat Parser.emit (events.js:95:17)\nat Object.onclosetag\n(/root/modern.IE-static-code-scan/node_modules/xml2js/lib/xml2js.js:348:26)\nat emit\n(/root/modern.IE-static-code-scan/node_modules/xml2js/node_modules/sax/lib/sax.js:615:33)\nat emitNode\n(/root/modern.IE-static-code-scan/node_modules/xml2js/node_modules/sax/lib/sax.js:620:3)\nat closeTag\n(/root/modern.IE-static-code-scan/node_modules/xml2js/node_modules/sax/lib/sax.js:861:5)\nat Object.write\n(/root/modern.IE-static-code-scan/node_modules/xml2js/node_modules/sax/lib/sax.js:1294:29)\nat Parser.exports.Parser.Parser.parseString\n(/root/modern.IE-static-code-scan/node_modules/xml2js/lib/xml2js.js:403:31)\nat Parser.parseString\n(/root/modern.IE-static-code-scan/node_modules/xml2js/lib/xml2js.js:6:61)\n[root@localhost modern.IE-static-code-scan]# tail\n/root/modern.IE-static-code-scan/npm-debug.log\n5990 error If you need help, you may report this log at:\n5990 error http://github.com/isaacs/npm/issues\nhttps://github.com/isaacs/npm/issues\n5990 error or email it to:\n5990 error npm-@googlegroups.com\n5991 error System Linux 3.14.17-100.fc19.x86_64\n5992 error command \"node\" \"/usr/bin/npm\" \"install\"\n5993 error cwd /root/modern.IE-static-code-scan\n5994 error node -v v0.10.30\n5995 error npm -v 1.3.6\n5996 verbose exit [ 1, true ]```\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/67\n.\n. Glad it worked :)\nClosing then.\n. I think the easiest way to analyze this in \"mobile mode\" will be to let the user change the user agent at the moment of the request. The problem is we will have to pass that value to all the parts where the scanner is doing requests (some servers also check the UA for assets and static content...).\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. Yes, project is still alive but there are other things on the top of my todo list. Sorry about the delay.\n\nThanks!\n. Thanks\n. This is the static scan tool. We are using browser stack to take screenshots of the website for the browser screenshots\n. Can you please point me to the page where it says the static code scan takes screenshots so I can talk to the right people?\nThanks!\n-----Original Message-----\nFrom: \"OKNoah\" notifications@github.com\nSent: ‎2/‎10/‎2015 11:20 PM\nTo: \"InternetExplorer/modern.IE-static-code-scan\" modern.IE-static-code-scan@noreply.github.com\nCc: \"Anton Molleda\" amolleda@gmail.com\nSubject: Re: [modern.IE-static-code-scan] Does this take screenshots? (#76)\nI see you closed this but the copy on the website is the same.\n—\nReply to this email directly or view it on GitHub.\n. Nope, pretty busy with some other projects with hard deadlines. I do accept PR though... :)\n. Thanks!\n. That's an issue in the page. There is only the code for the static code. The screenshot service uses BrowserStack if you are interested.\n-----Original Message-----\nFrom: \"macbook pro\" notifications@github.com\nSent: ‎2/‎28/‎2015 12:14 AM\nTo: \"InternetExplorer/modern.IE-static-code-scan\" modern.IE-static-code-scan@noreply.github.com\nSubject: [modern.IE-static-code-scan] where's the code for screen capture?(#81)\nI clicked on the link on page https://www.modern.ie/en-us/screenshots and it brings me here.\n—\nReply to this email directly or view it on GitHub.\n. OK, I've tried with 0.10.36 and it is working. The problems when doing npm install are probably because of jsdom (at least I saw some errors in that package right now). I don't think we are using it so I should probably remove that dependency. I'll test with 0.12.x see what happens\n. Yup, looks like an issue with 0.12.0\nCan you downgrade to 0.10.36 in the meantime?\n. Closing and tracking via #83 \n. Looks like you've past this issue and now you are seeing the issue with node 0.12.\nI'm closing this now.\n. There is already an issue reporting this and the workaround at the moment is to downgrade to 0.10.36. The scanner doesn't work at the moment with node 0.12\n-----Original Message-----\nFrom: \"sarwarcse\" notifications@github.com\nSent: ‎3/‎17/‎2015 7:35 AM\nTo: \"InternetExplorer/modern.IE-static-code-scan\" modern.IE-static-code-scan@noreply.github.com\nSubject: [modern.IE-static-code-scan] How can I solve this? Any suggetion  r(#85)\nTo scan a private url go to http://localhost:1337/ and follow the instructions\n_http_outgoing.js:333\nthrow new Error('\"name\" and \"value\" are required for setHeader().');\n^\nError: \"name\" and \"value\" are required for setHeader().\nat ClientRequest.OutgoingMessage.setHeader (_http_outgoing.js:333:11)\nat new ClientRequest (_http_client.js:101:14)\nat Object.exports.request (http.js:49:10)\nat Request.start (E:\\mordern\\modern.IE-static-code-scan-master\\node_modules\\\nrequest\\request.js:583:30)\nat Request.end (E:\\mordern\\modern.IE-static-code-scan-master\\node_modules\\re\nquest\\request.js:1237:28)\nat E:\\mordern\\modern.IE-static-code-scan-master\\node_modules\\request\\request\n.js:413:12\nat process._tickCallback (node.js:355:11)\n—\nReply to this email directly or view it on GitHub.\n. See #83 \n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. Are you using any type of authentication with IIS (ntlm for example)?\nIs the error 500 the result of scanning your website or does it actually have a problem?\nIf you try scanning another website (www.bing.com for example), does it work?\nHave you tried using http://127.0.0.1/index.html?\n-----Original Message-----\nFrom: \"DisposableHero\" notifications@github.com\nSent: ‎3/‎23/‎2015 6:30 AM\nTo: \"InternetExplorer/modern.IE-static-code-scan\" modern.IE-static-code-scan@noreply.github.com\nSubject: [modern.IE-static-code-scan] 'offline' not working within local (#87)\nHello,\nI'm trying to get the modern.ie code project to work 'offline' within my local environment. I setup a local URL as http://localhost:1339/index.html. I've setup a test page simply as http://localhost:1339/test1/test1.html. I've set the /lib directory as the root folder within IIS and the other directories as Virtual Directories (may not be necessary).\nmaster branch: I get 500 error on scan report result on the modern.ie site. \nvNext branch: I get empty scan report results on modern.ie site. \nI've tried in IE9 and IE11. \nI've tried changing the HTTP to HTTPS in the form post \nAny help would be appreciated. Thanks.\n—\nReply to this email directly or view it on GitHub.\n. You are using node 0.12. This is a known issue (see other issues). The work around for now is to use 0.10.36.\nThanks!\n-----Original Message-----\nFrom: \"DisposableHero\" notifications@github.com\nSent: ‎3/‎24/‎2015 6:31 AM\nTo: \"InternetExplorer/modern.IE-static-code-scan\" modern.IE-static-code-scan@noreply.github.com\nCc: \"Anton Molleda\" amolleda@gmail.com\nSubject: Re: [modern.IE-static-code-scan] 'offline' not working within local(#87)\nThanks for response molant. I'm using Windows 7 Enterprise with IIS 6 with Anonymous Authentication enabled. For 'www.bing.com' I get error 'Failed: 0' alert along with Error: \"name\" and \"value\" for setHeader(). Same errors with any local static test pages such as http://localhost:1339/test1/test1.html. \n—\nReply to this email directly or view it on GitHub.\n. @dharmeshqk does the website you are trying to scan require authentication like NTLM? That could be the issue\n. This was already solved a while ago. Thanks for the PR\n. Are you having problems with the version in dev.modern.ie or this one?\nIs there URL publicly accessible?\nIf it isn't or it is behind a password it will not work with the public scanner.\n-----Original Message-----\nFrom: \"smich73\" notifications@github.com\nSent: ‎8/‎6/‎2015 4:50 AM\nTo: \"MicrosoftEdge/static-code-scan\" static-code-scan@noreply.github.com\nSubject: [static-code-scan] url not working (#93)\nI have just tried to site scanner but it doesn't work with my url.\nI don't want to share the url publically but please reach out to me on this.\nWhen I try it I see the message:\nWe encountered an error with this URL.\nTry the following options:\n•Enter your domain name only\n•Use a destination URL if the original URL you entered redirects to it\n•Download the offline version to analyze pages that are behind a firewall or require a user to authenticate to access\nThanks\n—\nReply to this email directly or view it on GitHub.\n. OK, thanks. I'll take a look as soon as I have some available time.\n. You can download the scanner and run it locally to get more info about why it crashes. That should be faster than waiting for me to have some free time to look at it.\n. @smich73 stop looking. The issue is not in the scanner but in the website. Change should be deployed in the next few days. The local copy works without any issue\n. tests are completely out of date so this is (unfortunately) expected.\nIf you run node app.js it should work as expected\n. Fixed via 45bba60dca3d41c1daa3baacbc4c2e196e7d1b0a\n. @senglin yes, we've changed the site infrastructure and this feature is not enabled yet. It will be added soon. In the meantime you can read the JSON and guess what the issues are. If you need help doing some of the mapping let me know!\n. @senglin don't know yet. It just got added to the backlog and need to prioritize against other things we are doing in the website. Hopefully in the next few weeks but can't guarantee anything\n. Not until probably December.\nThe JSON file shouldn't be too complicated to decipher. It should contain a list with all the tests that have been launched with their results. Each test should have:\n- name of the test\n- passed or not\n- extra information to identify the issue (files and line numbers usually)\nIf you have any issue with any of the fields I can help you in the meantime.\n. BTW, we have added CLI support to get the results via the command line. You can use this feature in the meantime https://github.com/MicrosoftEdge/static-code-scan/#cli \n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. nice @m-gagne, do you mind doing a PR for this?\nThanks a lot!\n. Yup, need to find time to fix them: https://github.com/MicrosoftEdge/static-code-scan/issues/95\n. If I remember correctly I used the minified and unminified versions of jQuery for a bunch of versions (I think that starting from 1.4.0).\n. Fixed via 45bba60dca3d41c1daa3baacbc4c2e196e7d1b0a\n. @m-gagne thanks a lot!\n. I think we should still have the auth tests (and probably improve them) for when NTLM support is added. That is going to change significantly how resources are downloaded and a few things could go wrong...\n. We are ignoring files with known names and domains in here: https://github.com/MicrosoftEdge/static-code-scan/blob/master/lib/checks/check-browser-detection.js#L34\nI think that we are also scanning for files in the same domain only, but not 100% sure.\nFeel free to do a PR!\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. Duplicate of https://github.com/MicrosoftEdge/static-code-scan/issues/96\n. It is in the backlog but at the moment there are items with a higher priority. The JSON file shouldn't be too complicated to read. If you have any question until we release this feature let me know.\n. Thanks!\n. Duplicate of #96 \n. The instructions to run the CLI are in https://github.com/MicrosoftEdge/static-code-scan/blob/master/README.md#cli\ninstead of running node app.js you run static-code-scan\nThe gif in the instructions hopefully make it clear.\n. Try running node bin\\static-code-scan.js from the root of the project.\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. Thanks!\n. Thanks\n. Thanks!\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. @farzanefarahan this is not the place to ask for support. I recommend you to send a tweet to @MSEdgeDev\n. This project is deprecated and no longer maintained. Please check sonar if you need a similar tool but more flexible and modern.. ",
    "scheblein": "Any luck on integrating NTLM?\n. Yes, this is definitely something I'm looking for. I work for a large company with several thousands of internal websites. IE is the default browser and we limp by with compatibility view enabled for intranet zone. That doesn't seem to be working anymore with IE11. I want to run this tool on a known list of internal websites to check for IE11 compatibility. We then can focus resources on the ones which fail hardest, rather than having to functionally test thousands of websites. Most everything is authenticated via NTLM, if not Kerberos.\n. Still getting a timeout message after deleting those two .js files you referenced. I'm also behind a corporate firewall and can't send any internal data outside the firewall.\n. Looking at Wireshark, now it's looking for:\ncds171.sea9.msecn.net\n. With your note, I realized that check-pluginfree.js was the check that was still trying to go external. cds171.sea9.msecn.net must be a server for the IE compatibility list. It was interesting to see that check-pluginfree.js used the compatibility list.\nBecause i figure being plugin free is important, i went ahead and downloaded the two versions of compatibility lists, stored them locally on the node.js server, lo and behold, everything is working now except check-image-compression.js (which i don't need anyway). I wonder why check-pluginfree.js is using the IE compatibility list? \nIf a version of check-pluginfree.js could be forked that doesn't use the IE compatibility list, I'd be happy to test it. \n. ",
    "dmethvin": "Spent some time debugging this issue with Manish Kumar Sharma. It looks to me that the NTLM support could be just one of the hurdles we're facing. His IT-managed system seems to be blocking these requests, they are getting a 502 when we try to monitor via Fiddler. It might be helpful to create a testbed inside Microsoft that uses the company VPN setup to see exactly what needs to be configured. I also wonder if we could just use some sort of COM-driven proxy based on IE that could relay the requests, rather than trying to reimplement all the NTLM and honoring of proxy settings inside node.\n. Interesting idea.Would it be possible maybe to use the MHTML format that IE uses when you use \"File/Save as/Web Archive (single file)\" perhaps? That would automagically fix all the URL references inside the HTML and CSS files so we could just unpack and scan them. Not sure if there's an existing MHT file reader for node. \n. Given the amount of work required on the developer's part (either manual or via a build process) this is not something we should bug people about.\n. Do you mean we should look for script that is loaded by injecting <script> tags after the document is ready? Perhaps these could be detected with [mutation observers](http://msdn.microsoft.com/en-us/library/ie/dn265032(v=vs.85).aspx) which are supported in IE11 but the static code scan does not run the scripts.\nOr do you mean, \"check that code follows the best practice of putting script tags at the end of the body\"? That is a good general practice, but there are exceptions so we'd need to determine whether giving this message would cause more confusion than help.\n. I think it would be hard to do this. The iecompat scan could do it easier\nsince it runs the code. But like you say we would need to identify all the\ntracking scripts which would be a big job.\nOn Nov 29, 2013 4:10 PM, \"Anton Molleda\" notifications@github.com wrote:\n\n@dmethvin https://github.com/dmethvin what do you think? Should we add\nthis test? Should we flag script tags at the beginning that are for\ntracking purposes? If not, how do we avoid them?\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/20#issuecomment-29537787\n.\n. Looking at this, I am thinking we could warn about scripts that are included before the CSS in the head, or excessive numbers of scripts included in the head. I'll take a look at some possibilities. This will require some extra sections in the report.\n. Note to self, we should look for async attributes and not warn about those being ahead of CSS, see https://www.igvita.com/2014/05/20/script-injected-async-scripts-considered-harmful/ for examples of when it's useful.\n. Hmmm, okay, then it probably needs to be investigated further. The only way this should have happened is if the person was using local copies of the scripts, and I don't know if they were.\n. I'm not sure how our Azure server is configured, but could we host the validator on some other box and then call it privately? Or does that just push the problem somewhere else?\n. I've added a unit test here but haven't changed anything in the detection. The test \"passes\" but since not all of the features are detected you get a warning. I can think of at least two ways to handle this. \n- Have the front-end report not warn if any of the three are present, since there is at least some indication the author knows what they are doing. In this case there is already a DNS prefetch.\n- Detect if the page has links other than fragments, only warn if $(\"a\").not(\"[href^='#']\") has something. Add a new singlePageApp flag to the results so we can tweak this detection as needed without changes to the front-end.\n\n@molant what are your thoughts?\n. I think it depends on how fancy our detects get. For now the only one that I think we need to avoid a warning with is this one.\nI like the idea of some type of global flags, because we could either detect them once in the scanner or have these be passed in from the UI for other things if we wanted. So in the future we might want a \"I don't care about IE6/7/8 compatibility\" flag for example.\n. We have a way to run the code already, with the Sauce Labs scan that you can run. It injects Compat Inspector into the page and spins up a Sauce instance to run it. I'm on a plane and the SW toolbar injection is hosing modern.IE, but I think it's called something like \"Check for features no longer supported by Modern.IE\" in a tab once you've finished the regular scan. It could be better exposed.\nEven with that scan, however, we are just letting the app/page spin up and fire window.onload, then waiting a few more seconds and ajaxing back the results of our hooks on various behaviors. It's much more difficult to drive the app in a way that creates meaningful interactions.  Someone who really wanted to do that for a page/project should look into Browserswarm.com, since it's more like app-specific unit or functional tests. \nJust a warning about trying to build further advice based on these two scans. Developers (me included) tend to be somewhat OCD and don't want to see \"warnings\" or even \"notes\" that they think are misguided for their needs. That's what this ticket is about, but more opinionated tips  like \"you have 'too many' DOM elements in your page\" are probably going to anger and annoy someone who needs that many elements and has worked to reduce their impacts. \nI'd be glad to leave this as-is and say that SPAs are outside the scope of what we're trying to do, thus not all the advice may apply. I had just hoped we could find some simple proxy for many SPAs to reduce irrelevant advice for those situations.\n. As far as doing this for specific tips, I don't think it's practical. The color is orange meaning \"suggested enhancement\" and not an error. \nI think a better solution for this is to add more granularity about the advice and a way to opt out of particular advice, but that is a general feature and I'lve opened #29 for it.\n. Would a warning be given if we didn't find any aria attributes? That could give a lot of false positives. For example, most of the jQuery UI widgets support aria and will insert them when the markup is enhanced at runtime. But you wouldn't see that in a static scan.\n. I'd be interested in seeing what this generates on a few sites. I have a feeling we will see a lot of noise so we may want to reorganize the output somehow. \nWe should definitely take another look at the libraries. Should I do updates in vNext?\n. Reward for the work seems low. We would only be able to detect videos embedded in markup via HTML5 tag. Many if not most videos are embedded dynamically since they often want to only fallback to HTML5 if a more robust Flash player isn't available.\n. Technically we should be able to run the validator locally, it looks to be written in Perl and the license is permissive. :smiley_cat: We'd still have the issue of filtering and formatting the output though, and if we just want to look for ALT tags it's overkill.\nReally, according to the W3C all image tags should have an ALT. If it's just decoration and not content then it should be specified as a background in CSS. So we shouldn't need to download any of the images, just look at the tags.\n. Hmm, this just might work. I think we should explore a regex solution even though it might not catch everything, just because it could be done quickly and the ESLint one would be a much bigger step. If we're going ESLint, though, it does give us a huge amount of functionality.\nI'm thinking we could just look for something like /[\"'](hover|mouseenter|mouseover)[\"']/ and warn that whatever they're trying to do with mouse pointer actions won't be visible to touch users.\n. There are a lot of places where it would be perfectly valid to have :hover styles but the page could still be very touch friendly. A message about this runs the risk of being very noisy for no reason and annoying the people who use the scan.\n. Well I can say I've never seen a page like that, ever. It does seem to be in Edge mode. The page is being served with doctype \"image/svg+xml\". It's definitely not a case the scanner is designed to detect, it's mainly intended to find bad HTML practices in older versions of IE that might prevent good operation in IE11. I tried seeing what older versions of IE did with the site but they don't seem to like the URL there because of the non-ASCII characters, even in punycode. \n. Agreed on your proposed resolution. I think we should just let people know it's not the use case for which the tool was designed and leave it at that. \n. Landed a fix in vNext at 456e52d1e972688dca8c10c4487e53664dbf8408 , and decided to simply pass the test since its a pretty unusual edge case.\n. What site did you try to scan?\n. The scan seems to work for me, are you still seeing the problem?\n\n. Oh, the local scan. Most likely the local scan needs to be updated, I'll look into it. You should be able to scan your site fine from http://modern.ie in the meantime, and that scan will be more up to date.\n. @molant it looks like master has been synced with vNext, is that what is deployed to the modern.IE site now?\n. Looks like this has been fixed.\n. These types of micro-optimizations usually don't have much of an impact on performance. Did you have some profiler info showing them to be a perf bottleneck?\n. Looking at this jsperf it seems like the difference between for-loop-basic and for-loop-cached is just a little over 1 percent. That's using Chrome which is probably the closest to node's V8 engine.\n. I think you meant to link to this article? in that article, written in 2011, it also says \"These are micro-optimizations and will only be noticed in performance-critical operations.\" In the jsperf I referenced it says \"Interestingly, it would seem that current 2012 browsers have all optimized their Javascript engines for basic for and while loop syntax. This means we can probably abandon all the 'trick' loops (that used to run faster) and just go with whatever loop syntax we find the most readable.\" I find the current form of most of these loops to be more readable.\n. The syntax is correct either way, since both node.js and JSHint have checked it. It is a question of whether it makes the code better in some way. I think these changes make the code harder to read, and the jsperf above shows that they don't change performance in any useful way.\nPlease do create a different pull request with the hasOwnProperty change, since that is a bug and is not related to the rest of this pull request.\n. We've discussed trying to add some sort of accessibility tool. The Webaim.org site is an interesting scan, but it does generate a pretty scary display for most non-trivial pages. But would it be better to send people there, rather than trying to re-implement it in this scan?\n. See also #35 and #37 for proposed accessibility additions.\n. I think this goes beyond the scope of this particular scanner. Again I think all of these are good ideas and agree completely with your comments about semantic markup. We just want to avoid creating too many judgmental tests.\n. Great bug report! Although IE10 users technically still need the meta tags, they are a shrinking group and cluttering the HTML with meta tags is not such a good idea anyway. I'll take a look at this.\n. This is assigned to an internal tracker since it's not in the scanner code.\n. Is there a reason to use object rather than iframe for embedding HTML? TBH I haven't seen people use object for that so I wonder what you are gaining by  it.\n. Closed due to inactivity, please add feeback if you'd like us to take this further.\n. Are you seeing the same as #40 shows in a screen shot? I am not sure the local scan and server have been completely synced.\n. We can't reproduce here so I think it should be fixed. If you are still seeing a problem, can you click the link on the local scan page and send us the JSON that it is sending to the server?\n. Seems to be working now.\n. This is probably #26\n. This should be fixed in vNext when that lands, see 478ef80a53ffc1f215247b895ed9f1a4b5a938dd and #47. @molant can those be synced soon?\n. Did you npm install?\n. https://github.com/InternetExplorer/modern.IE-static-code-scan#installation-and-configuration\n. It should be fixed by #109, I meant to reference this ticket in the PR.\n. Since new releases have happened, I'll just reference this ticket with a new PR.\n. ",
    "admdrew": "Would definitely like to see this! At the moment, this is the main hurdle I'm facing implementing this for my company's internal sites.\n. ",
    "luizen": "I have exactly the same requirements as @scheblein and would love to have this working. :-)\n. It can be fixed by following the recommendation in the following commit:\nhttps://github.com/InternetExplorer/modern.IE-static-code-scan/commit/3ca22edbc48aa504c46a725546906293ec6dd99a\nIn short, changing from HTTP to HTTPS in index.html. I tested here and it worked.\n. It can be fixed by following the recommendation in the following commit:\nhttps://github.com/InternetExplorer/modern.IE-static-code-scan/commit/3ca22edbc48aa504c46a725546906293ec6dd99a\nIn short, changing from HTTP to HTTPS in index.html. I tested here and it worked.\n. It can be fixed by following the recommendation in the following commit:\nhttps://github.com/InternetExplorer/modern.IE-static-code-scan/commit/3ca22edbc48aa504c46a725546906293ec6dd99a\nIn short, changing from HTTP to HTTPS in index.html. I tested here and it worked.\n. It can be fixed by following the recommendation in the following commit:\nhttps://github.com/InternetExplorer/modern.IE-static-code-scan/commit/3ca22edbc48aa504c46a725546906293ec6dd99a\nIn short, changing from HTTP to HTTPS in index.html. I tested here and it worked.\n. I believe not. Node runs on Mac and the scanner itself is just javascript. \nAlso, it works on Chrome and FFX on Windows, so it should work on the Mac.\n. ",
    "marknoble": "Agreed.  I've updated my site to address the other issues in the test.\nThe failed \"touch\" test doesn't really offer much in the way of direction.\nI've tested my site with a variety of touch-screen devices and have added aria-haspopup=\"true\" where CSS hover is used for a few of the menus.  In my case, tapping on the menu item that has the hover menu just takes you to a page with a more static set of menu options (not relying on hover) so the \"touch\" failure isn't really a failure in my case.\nThe rest of the site seems to work as expected with the default handling of pinching to zoom and scrolling by touch.\n...so I feel that the \"touch\" failure is giving a bad result in my case, but I think this would be corrected if it offered more info about what elements are resulting in that false result so developers can assess impacts of addressing them on their site.\n. > Try to find an heuristic to see if there are hover menus or not. Maybe we can look for the most popular menu libraries.\nJust to help, I'm a fan of implementing hover menus by using the CSS :hover selector and setting the visibility of a DIV that contains the menu... so that'd be at least one approach to hover menus that it'd probably be wise to check.\nI do use the :hover selector to change the style of elements that are not menus as well though, so it would probably be necessary to check for the use of the :hover selector in conjunction with the setting of visibility on the child menu element.\n. I thought I followed the instructions, but I wasn't able to get \"static-code-scan\" to work in PowerShell or the command prompt.\n...I was able to get it to work via browser - until I got to the part where the results button doesn't work.\nAny ideas how to get the CLI working in PowerShell or the command prompt in Windows?  Might be good to note it in the ReadMe since apparently there's a missing step. :)\n. I'm using 2.2.0 and also getting an error.\nHere's the static-code-scan result.\njslibs                                                                        │    ×\n────────────────────────────────────────────────────────────────────────────────┴──────────\n  [\n    {\n      \"name\": \"jQuery\",\n      \"needsUpdate\": true,\n      \"minVersion\": \"1.6.4\",\n      \"version\": \"2.2.0\",\n      \"url\": \"//ajax.aspnetcdn.com/ajax/jQuery/jquery-2.2.0.min.js\",\n      \"lineNumber\": 9\n    }\n  ]\nI can't find the string \"1.6.4\" anywhere in my code so... wondering where that's coming from.\n. ",
    "franmomu": "Sorry for not explaining myself, I meant the second one, as far as I knew it was a best practice. I didn't know about exceptions so maybe this would fit better in a section about performance advises more than coding problems.\n. Sorry, I just mentioned it because someone told me (he seemed to take very seriously the tool in order to pass without errors) and it is allowed by the W3C, but I don't know why someone would use object to embed HTML.\n. ",
    "bbodenmiller": "Others have successfully run Perl on Azure \n. ",
    "homebrandcola": "Hi,\nI came across a similar thing.\nThe files I removed to allow the scan were the following:\ncheck-compatlist.js\ncheck-image-compression.js\ncheck-pluginfree.js\ncompatlist.js\nLooking at some of the code, they were just retrieving XML files from the web. It might be an option to allow them to be downloaded and read from file instead of URL - not ideal as they would be updated etc, but for those stuck behind a series of firewalls and proxies it could be handy.\nCheers, Tim.\n. ",
    "Uzzol772": "thanks\n. i can't upgread \n. ",
    "am11": "@molant, (for reference to convince them) I looked into the RFC 3986 and it does mention that \"//\" should get resolved as default scheme, section 5.4:\n\n\"//g\" = \"http://g\"\n\nThanks.\n. Mac's Safari doesn't support this though, while IE does. :)\n. Thanks!\n. ",
    "docluv": "This could be something to provide SPA guidance. I am not well versed in aria tags, but could there be something there that could be leveraged as a meta data sort of thing on a link to indicated what it going on? Maybe the google SEO META tag, which is not actually required, but can be used to change the hash fragment indicator.\n. I think you would need to add a manual flag to indicate a SPA. Just detecting a framework does not a SPA make. Angular ‘can do spa’, but typically it is not a SPA. Plus what are you going to do about the SPAs that don’t use one of the large frameworks. For example mine ☺\nIf Google uses the escape_fragement technique I think it says a lot about how hard it is to detect a SPA.\nChris Love\nFrom: Anton Molleda [mailto:notifications@github.com]\nSent: Tuesday, February 4, 2014 9:56 PM\nTo: InternetExplorer/modern.IE-static-code-scan\nCc: chris love\nSubject: Re: [modern.IE-static-code-scan] Avoid some tips for single-page apps (#29)\nI don't know exactly how we should do this. For detection SPA in general I would go for the second options and look for # o #!. We could also add a check for know libraries for SPA like Angular.\nThe problem is how to flag this. Should the tests be aware if they are analyzing a SPA and not throw any error or should we just run an extra test saying if it is a SPA and then the UI will take care of that? Shouldn't we then give more information to the UI as to what test don't apply to SPA?\nI think I would go for:\n-   Adding a test call SPA or something similar\n-   Add an extra field to the test that do not apply for SPA. Maybe if we want to do it in a generic way this could be the name of the test they depend on so the UI knows if it should ignore this test or not. Maybe something like:\nappliesIf: ['spa:false']\nWhat do you think? Maybe I'm complicating things too much...\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/29#issuecomment-34133264.\n. I have been playing with extending the tool some this weekend. The main issue I am seeing is the tool cannot execute the application. It just requests files and reads them as text. We can scan for text patterns, evaluate the headers, but not execute the application.\nFor example I setup a test to determine if there were too many DOM elements. Several pages I know are bloated passed the test because they add elements via AJAX. The extra elements were not added in the scan tool because the scripts were not executed.\nI don’t have a lot of nodejs experience, in fact this is just about it, but we need a way to actually execute the application, spa or not. I am looking at using phantomJS, but have more research to do. As I caution my clients, phantom is not an actual browser end users use, so it is not 100% accurate as far as what would actually happen in a real browser. AJAX applications are very dependent on real interactions.\nIf anyone has any ideas let me know. I am very interested in solving this issue.\nChris Love\nFrom: Anton Molleda [mailto:notifications@github.com]\nSent: Wednesday, February 5, 2014 3:06 PM\nTo: InternetExplorer/modern.IE-static-code-scan\nCc: chris love\nSubject: Re: [modern.IE-static-code-scan] Avoid some tips for single-page apps (#29)\nThat is why we also check for # and #! in the links.\nI said Angular just as an example but there are many other libraries that are only meant for SPA. Also if you have any pattern that will help us recognize SPA please share it with us :)\n—\nReply to this email directly or view it on GitHubhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/29#issuecomment-34231775.\n. for SPA too many elements is a common issue, they bloat memory footprints and cause css to be sluggish. The test is actually from the YSlow rules, so I don't think too many would justifiably complain.\nBut the bigger point is you really can't provide much insight for modern applications without doing some form of execution. The SauceLabs info is ok, but not thorough enough for me. I tend to push it more than most others :) \n. ",
    "alexandre-works": "Hi guys,\nI am new here, hope I can help and not saying something stupid (I probably will heheh), so I am sorry in advance :)\nI do really have my doubts if Flip ahead browsing and Prerender + prefetch , should ever be more then an alert, independently of the type of the website. This techniques have lots of potencial, but giving an alert with the current copy gives the idea that is something that should be used, and i don't think so. There are so many situations that it doesn't apply (SPA for instance), or is not a good idea. I see now some frameworks using Flip ahead browsing that makes no sense whatsoever!  \nMaybe an alert with a good copy, telling that this technics exist and they can improve the sites in some situations would be enough.   \nI am just \"afraid\" that when we try to push these technics we may do more bad then good.\nPS: At my work i had to explain why i had these alerts on awwwards and why we were not using it! It's a good thing of corse, but sometimes the pressure over the developers, and not well informed develops may start using these without knowing what the hell they are doing.\ncheers\n. Hi,\nProbably  I didn't explain myself properly. I agree with you that for a proper accessibility scan, users should go for instance Webaim.org. Accessibility scan is quite complicated and it would be confuse to implement that here.\nMy point was an example of something that we could get some ideas. We would not be looking for specifics regarding accessibility. The idea was to show somehow how the html was writing, and if had any semantic meaning.\nEX:\n are a block element but no semantic meaning! to have a  instead of a  is diferente, and a screen reader (at least the old ones) would read it differently. and the way that may be translated to an image that somehow shows that if you are or aren't using semantic html.\n1- http://take.ms/XfVy9\nIn here i can have showing in the browser exactly the same design. No problem at all... but they are totally deferent in a semantic way. \n2- http://take.ms/flzzb\nthis is more or less what a screen reader would reed it. Just showing the non semantic way with no spaces, all in the same line, would show that this is not ok.\nI hope I did explain better this time. I am not suggesting at all accessible testing, but I used a specific thing to suggest this idea \nCheers\n. ",
    "vlaine": "\nOpen the compatlist file (lib\\checks\\compatlist.js) and locate the following variables\n     var compatListUrlIE10 = \"https://iecvlist.microsoft.com/ie10/1152921505002013023/iecompatviewlist.xml\",\n      compatListUrlIE9 = \"http://ie9cvlist.ie.microsoft.com/ie9CompatViewList.xml\", \nDownload the 2 xml files associated with those variables (iecompatviewlist.xml and ie9CompatViewList.xml)\nHost the 2 files on your localhost or on your intranet \nIn the compatlist file, change the compatListUrlIE10 and compatListUrlIE9 variables value to point where you hosted the xml files\n. \n",
    "dotnetCarpenter": "That's odd IDN should be fully supported in IE for years.\nDo you think the mime type is wrong? I haven't thought about it. Right now, it's just the default Apache is configured to.\nOn a side note, here's a little primer on the relationship between HTML, CSS and SVG. http://docs.webplatform.org/wiki/svg/tutorials/smarter_svg_deploy\n. you can try the translated name http://xn--demgtigevikinger-wob.dk/prototype/v0.3/\n. Well, the mime type is correct. Though it hasn't been fully registered at IANA.\nI think the resolution for this issue would be to add a flag to modern.IE-static-code-scan when it encounters SVG, that it shouldn't give the default suggestions. As they (the suggestions) are likely to spread more misinformation.\nIn regard to my concern about performance in IE. I think it's invalid.\n. ",
    "brenopolanski": "My site: http://brenopolanski.com/\n. I will conduct a new test.\n. When i click in \"Create Report\":\n\nremains so:\n\n. Ok thanks :+1: \n. I will send some pull requests :D\n. Hi,  a better pattern for for loops is to cache the length of the array (or collection), this is a micro-optimization and in my opinion is most syntactically correct.\nArticle of Stoyan Stefanov: The Essentials of Writing High Quality JavaScript\n. Sorry by the link :)\nIn your opinion, syntactically correct code would that be? \nfor (var i = 0; i < myarray.length; i++) {\n               // do something with myarray[i]\n        }\nAlready that current 2012 browsers have all optimized their Javascript engines for basic!\n. thanks @dmethvin :)\n. ",
    "st3w4rt": "I've configured local scan today but I'm also getting the same 500 error issue. The site I was to scan is not accessible outside the firewall so I am unable to use modern.ie\n. ",
    "iecompattest": "\n. \n. \n. \n. \n. \n. \n. ",
    "objectivelabs": "I believe it is different from #40. What I see is exactly the same as hitting this URL http://www.modern.ie/en-us?vsn=6d\nas if no data was passed. No error, but also no results. \n. ",
    "maheshdasari": "This issue again seems to be occurring now, the results are shown as empty . Please suggest\n\n. ",
    "pfremm": "I did try this on my work laptop that was behind a proxy, but I also get the same result on my personal macbook pro with a fresh install of nodejs and grunt.  At work I had Windows 7.\nIf I removed the test from the checks directory the rest of the tests do run without issue.  Just unsure what is going on specifically for the compatibility_test.js test case.\n. I just tried the download zip again on my mac and I still get the same error.\n. Did you try with a clean install of node?  Originally I was use the macports version, but I just downloaded the package right from nodejs.org and I still get the same error.\n. ",
    "davidkassa": "similar error:\nC:\\TEMP\\modern.IE-static-code-scan>node app.js\nServer started on port 1337\nTo scan a private url go to http://localhost:1337/ and follow the instructions\nRequest for http://localhost/ig_res/Default/ig_shared.css returned null\nRequest for http://localhost/ig_res/Default/ig_dataGrid.css returned null\nC:\\TEMP\\modern.IE-static-code-scan\\lib\\checks\\check-compatlist.js:34\n        return this[0].attribs['http-equiv'].toLowerCase() === 'x-ua-compatibl\n                      ^\nTypeError: Cannot read property 'attribs' of undefined\n    at Object. (C:\\TEMP\\modern.IE-static-code-scan\\lib\\checks\\check-c\nompatlist.js:34:23)\n    at filterFn (C:\\TEMP\\modern.IE-static-code-scan\\node_modules\\cheerio\\lib\\api\n\\traversing.js:289:20)\n    at Function.filter (C:\\TEMP\\modern.IE-static-code-scan\\node_modules\\cheerio\\\nnode_modules\\lodash\\dist\\lodash.js:3150:15)\n    at exports.filter (C:\\TEMP\\modern.IE-static-code-scan\\node_modules\\cheerio\\l\nib\\api\\traversing.js:299:17)\n    at Object.initiate as check\n    at C:\\TEMP\\modern.IE-static-code-scan\\app.js:166:41\n    at Array.forEach (native)\n    at C:\\TEMP\\modern.IE-static-code-scan\\app.js:164:15\n    at process._tickCallback (node.js:415:13)\n. ",
    "texaspacm": "I just installed on PC and got the same error.\n. ",
    "mbmccormick": "For reference, my website http://mbmccormick.com does have a Windows 8.1 pinned tile, as defined at http://mbmccormick.com/browserconfig.xml, however the http://www.modern.ie/en-us/report website reports that it does not, because http://mbmccormick.com/browserConfig.xml results in a HTTP 404.\n. ",
    "mems": "I'm totally agree with you. Prefixes are used for support CSS features as experiments. Adding all prefixes available for all browsers versions is not consistent in addition to grow heavier the file size, only for very small percentage of market share of old browsers\n. ",
    "kuyky01": "Hi all,\nI have the same problem in my environment. I have reviewed index.html code, and the action for  Create Report button is set to http://www.modern.ie/report/local:\n\n\n\n\nAditionally, check-compatlist.js has an error on code, so I have commented the code block to get it working:\n//  TODO: The compat tag may not be recognized if it is \"too far down\" the page; detect this.\n//    var compatTag = website.$('meta[http-equiv]').filter(function(){\n//        return this[0].attrib['http-equiv'].toLowerCase() === 'x-ua-compatible';\n//    });\n//    if (compatTag.length > 0) {\n//        if (compatTag[0].attribs.content) {\n//            var mode = compatTag[0].attribs.content.toLowerCase();\n//            if (mode.indexOf(\"edge\") === -1) {\n//                test.passed = false;\n//                test.data = { source: 'tag', mode: mode};\n//                deferred.resolve(test);\n//                return deferred.promise;\n//            }\n//        }\n//    }\nAny help will be appreciated.\nThanks!\n. @nsbingham Thank you for your reply. I have changed the code for call over HTTPS, but still having the issue :(\nMay be the root cause of the problem the JSON format? Are there a way to upload returned JSON?\nthanks in advance.\n. Hi all.\nDoes someone successfully created a report from local execution? If yes, could send me a compressed file with the modern.IE-static-code-scan-master folder code that is running locally? \nOur environment is configured as follow (over Windows Server 2008 R2)\npython-2.7.8 (https://www.python.org/ftp/python/2.7.8/python-2.7.8.msi)\nnode-v0.10.29-x86 (http://nodejs.org/dist/v0.10.29/node-v0.10.29-x86.msi)\nGit-1.9.4-preview20140611 (https://github.com/msysgit/msysgit/releases/download/Git-1.9.4-preview20140611/Git-1.9.4-preview20140611.exe)\nmodern.IE-static-code-scan-master (https://github.com/InternetExplorer/modern.IE-static-code-scan/archive/master.zip)\nAny help or update will be appreciated.\nThanks in advance.\n. ",
    "nsbingham": "@kuyky01 To view the report on the site, you can switch the URL from using the HTTP protocol to HTTPS. You can see the change in pull request #62. I can't help with the check-compatlist.js issue.\n. ",
    "bung87": "thanks for replying,after re-install the module and  npm update everything works fine.\n. ",
    "PunkChameleon": "Is this project still alive?\n. @molant No problem! Completely understand. Submitted some similar ones in Static.IE as well if that helps. Thanks!\n. ",
    "YuichiNukiyama": "I quoted HTML5 Specification from the following page.\nhttp://www.w3.org/TR/html5/embedded-content-0.html#general-guidelines\n. ",
    "OKNoah": "I see you closed this but the copy on the website is the same.\n. @molant Same one you linked to above: https://www.modern.ie/en-us/screenshots\n\nSpartan browser use case right here I guess.\n. ",
    "gregwhitworth": "Any updates on this?\n. ",
    "jbottigliero": "Thanks!\n. ",
    "MikeFromSwe": "Version 0.10.36 as suggested in \nhttps://github.com/InternetExplorer/modern.IE-static-code-scan/issues/82\nworked.\n. ",
    "Sarkie": "Can upgrade all the packages but express and its new middleware will need to be looked at.\n. ",
    "sarwarcse": "I am getting this error when i run npm install, any suggestion?\nconfigure error\ngyp ERR! stack Error: Can't find Python executable \"python\", you can set the PYT\nHON env variable.\ngyp ERR! stack     at failNoPython (C:\\Program Files\\nodejs\\node_modules\\npm\\nod\ne_modules\\node-gyp\\lib\\configure.js:103:14)\ngyp ERR! stack     at C:\\Program Files\\nodejs\\node_modules\\npm\\node_modules\\node\n-gyp\\lib\\configure.js:64:11\ngyp ERR! stack     at FSReqWrap.oncomplete (evalmachine.:99:15)\ngyp ERR! System Windows_NT 6.3.9600\ngyp ERR! command \"node\" \"C:\\Program Files\\nodejs\\node_modules\\npm\\node_modu\nles\\node-gyp\\bin\\node-gyp.js\" \"rebuild\"\ngyp ERR! cwd E:\\mordern\\modern.IE-static-code-scan-master\\node_modules\\jsdom\\nod\ne_modules\\contextify\ngyp ERR! node -v v0.12.0\ngyp ERR! node-gyp -v v1.0.2\ngyp ERR! not ok\nnpm WARN optional dep failed, continuing contextify@0.1.13\nnpm ERR! registry error parsing json\n. Thanks Molant.. it solved..\n. ",
    "DisposableHero": "Thanks for response molant. I'm using Windows 7 Enterprise with IIS 6 with Anonymous Authentication enabled. For 'www.bing.com' I get error 'Failed: 0' alert along with Error: \"name\" and \"value\" for setHeader(). Same errors with any local static test pages such as http://localhost:1339/test1/test1.html. \n. Yes, that fixed it. Thanks!\n. ",
    "dharmeshqk": "I am not able to scan an application, node has been successfully installed. later I installed npm. It still shows me 500 just after entering url usename and password\nPFA Screen shot of RESULT shown on cmd\n. Sorry could not send screen shot due to security issue. \n{ [Error: connect TIMEDOUT]\n. Failded: 500\n{ \"cause\":{\"code\":\"ETIMEDOUT\", errno:ETIMEDOUT, syscall:connect}\nisOpertionable:true,\"code\":ETIMEDOUT,errno:ETIMEDOUT,syscall:connect}\n. @molant : We will check with Server support team  whether we are using any authentication like NTLM or any other. By time, can you guide what is work around for that. Thanks!!\n. ",
    "smich73": "Hi Anton\nThe URL is publically accessible with no password.\nI didn't want to post it live for business reason.\nAddress is:\nhttp://www.skyscanner.net/\nDoesn't seem to work at all - not in the link below either\nthanks\nSimon\nDate: Thu, 6 Aug 2015 06:02:44 -0700\nFrom: notifications@github.com\nTo: static-code-scan@noreply.github.com\nCC: simon.michael@live.co.uk\nSubject: Re: [static-code-scan] url not working (#93)\nAre you having problems with the version in dev.modern.ie or this one?\nIs there URL publicly accessible?\nIf it isn't or it is behind a password it will not work with the public scanner.\n-----Original Message-----\nFrom: \"smich73\" notifications@github.com\nSent: ‎8/‎6/‎2015 4:50 AM\nTo: \"MicrosoftEdge/static-code-scan\" static-code-scan@noreply.github.com\nSubject: [static-code-scan] url not working (#93)\nI have just tried to site scanner but it doesn't work with my url.\nI don't want to share the url publically but please reach out to me on this.\nWhen I try it I see the message:\nWe encountered an error with this URL.\nTry the following options:\n•Enter your domain name only\n•Use a destination URL if the original URL you entered redirects to it\n•Download the offline version to analyze pages that are behind a firewall or require a user to authenticate to access\nThanks\n—\nReply to this email directly or view it on GitHub.\n—\nReply to this email directly or view it on GitHub.\n. Thank you Anton.\nI work for MS UK and this is one of my partners.\nDo you have an eta on when we will know more info on this as i have a potential meeting with the client ina few weeks time\nThanks \n\nOn 6 Aug 2015, at 18:23, Anton Molleda notifications@github.com wrote:\nOK, thanks. I'll take a look as soon as I have some available time.\n—\nReply to this email directly or view it on GitHub.\n. Ok thanks, will try that and let you know any feedback\nOn 6 Aug 2015, at 20:50, Anton Molleda notifications@github.com wrote:\nYou can download the scanner and run it locally to get more info about why it crashes. That should be faster than waiting for me to have some free time to look at it.\n—\nReply to this email directly or view it on GitHub.\n. Perfect - thanks very much\n\nSent from my Windows Phone\n\nFrom: Anton Molledamailto:notifications@github.com\nSent: ‎07/‎08/‎2015 18:26\nTo: MicrosoftEdge/static-code-scanmailto:static-code-scan@noreply.github.com\nCc: smich73mailto:simon.michael@live.co.uk\nSubject: Re: [static-code-scan] scanner doesn't get results for www.skyscanner.com (#93)\n@smich73 stop looking. The issue is not in the scanner but in the website. Change should be deployed in the next few days. The local copy works without any issue\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/MicrosoftEdge/static-code-scan/issues/93#issuecomment-128772322\n. ",
    "timothya": "https://github.com/MicrosoftEdge/static-code-scan/blob/master/lib/checks/check-accessibility-alt.js#L24\nThe code explicitly looks for images with empty alt attributes.\n. ",
    "senglin": "Thanks for the quick response, @molant. I was looking at the hosted validator on dev.modern.ie and noticed that the client-side now selects certain output based on the generated json.\nDo you know when this feature would be enabled? I need to plan accordingly.\n. Thanks, @molant. Cool feature.\n. ",
    "swadeworx": "Any possibility of moving the priority of this up in the backlog? Or, possibly providing the mapping here?\nI need to provide this tool to our developers so they can check their apps internally. Without a usable report, this tool does me no good!\n. ",
    "m-gagne": "After some more testing, the issue is the minified version of bootstrap.js that places everything on one line, it works fine against the normal (non-minified) version of bootstrap.js\n. Not a perfect fix, but this would likely do the trick (limit between 0 and 200 characters):\n/(?:jquery[,)].{0,200}=\")(\\d+.\\d+)(..*?)\"/gi\n. Happy to submit a PR, however seems like the unit tests are broken?\n```\nRunning \"nodeunit:all\" (nodeunit) task\nTesting altImg_test.js.F..\n\n\nAltImg - Empty alt attribute\nMessage: http://localhost:1338/altImg-2.html passed: true !== false\nError: true == false\nat C:\\Users\\marcg\\Code\\static-code-scan\\test\\altImg_test.js:47:22\n```\n. Would you happen to know a source file that was used to test that particular regex? Just want to make sure my fix will still work :)\n. From what I can see in the code, they would need a rewrite, as they are not testing any actual production code, simply mimicking a basic auth server. We can revert the PR for this and comment out the code, but it didn't really do anything anyways.\n. Ok, this will be more than a file whitelist as the filename is specific to the site, would it be ok to do a header check? The file in question contains \"Adobe Visitor API for JavaScript version: 1.5\" so I could build a regex that looks for \"Adobe Visitor API for JavaScript version: \\d.\\d\"\n. \n\n",
    "ghost": "You guys can't just put a form on the page that we can paste the results into?\n. ",
    "jdalton": "Rock, the table isn't super pretty but gets the job done and the cli name could be shortened to taste.\n. ",
    "reddysainathn": "This is what happening with me,can you please guide me to run the test with CLI,if there is anything that I can follow to setup.\nI have done npm install and node app.js is working fine ,but I need CLI to work.\n\nThank You.\n. Thank you\n. ",
    "japyha": "Upgrades . "
}