{
    "mikepenz": "@Moddus thanks. i really missed this one. i even included the info how to add the snapshot repository to your build.gradle :D\n. @gabrielemariotti thanks for the pull-request. You can also add the description file to your lib. if a user uses the AboutLibraries library and uses your library it will auto-detect your description file and will auto-show your library. the user won't have to define it in the creation of the activity.\n. @gabrielemariotti just change \"define_int_cardslib\" to \"define_cardslib\" and add it to your lib\n. @gabrielemariotti i just released version 2.0.0 of AboutLibraries with a really important change. Definition files have changed a bit. I had an unfound typo \"libray\" instead of \"library\". The README is updated, so please change this in case you've already added the definition file to your library.\n. @lyio thanks for the pullrequest. merged.\n. @lyio awesome! The preferred way is still that those definition files are included in the seperate libs itself. It makes the usage of this lib easier, because you wouldn't have to define those libs (they are auto detected) but it's also possible to include them here. and perhaps move them to the specific libs at a later time. \nYou can create a new pull-request if you like. thanks for your help.\n(The only difference between the definition file included in external libs like AnimatedGridView is that you have to remove the __int_  from the define string in the definition file)\n. @lyio thank you so much for those new libs. will add them to the wiki\n. @lyio you can create a tools folder within the DEV folder. if you let me know how to use i can also write a wiki page\n. @lyio thank you so much. if you need any change in the AboutLibraries lib let me know. i'll do my best\n. @lyio oh interesting :D I'm always open for improvements. Just make a pull-request or let me know here. \n. @lyio ah ok thanks for this commit. i think i'll add an option (via bundle) to set the licensetext as dialog (will be defaulT) thank you\n. @lyio once again thanks for this script. i've improved it (just added a few comments and a missing element) and pushed it to this repo again.\nI'Ve also created a small tool to create such definition files. Here's a link: http://def-builder.mikepenz.com/\n. @vernazza the google play services are special. Only few libs offer such an method. It is also really difficult to get the lib to automatically fetch the license info. It would need some kind of reflection and i think this isn't the best idea.\nYou can submit a definition file if you like?\n. I close this one, as it isn't possible. \n. I would recommend that you use the fragment and create an activity for it. So you can handle padding etc on your own. \n. @frostymarvelous thanks.\n. @scottyab if you manually add the definition-file to your projects you don't have to add those libs in the BUNDLE_LIBS param. The aboutLibraries lib will auto-detect them and show them. This is also the case for libs which contain the file by default. Just remove their identifier from your BUNDLE_LIBS param and everything should be fine.\nPlease let me know if this solves your issue.\n. @krossovochkin yeah it is that way by design. in a perfect world it should not be required to add the BUNLDE_LIBS as long as each lib you use includes the definition file. (aboutLibraries auto-detects them all) If you've added them it will auto-detect them so it's working already. (there's also a difference between internal end normal definition files but yeah no need to care for)\nOn a side note. Perhaps you can provide a pull request of the defintion files either to the library original library or to aboutLibraries library? \n. @krossovochkin create a pull request for both is a bad idea. as soon as the original lib contains the definition file i have to delete the definition file from the lib so it will handle it correct (it can't find out if it's exact the same lib)\nyeah the will show twice. so it is possible to add a check on the id but it's not said that those files will have the same idea. \n. @krossovochkin ok thanks :). if they don't include it. i will add the definition file to the aboutLibraries lib itself.\n. @krossovochkin you used this tool: http://def-builder.mikepenz.com/ to create the files?\n. @scottyab just as a quick info. I added a check in the v3.0.0 (which is currently in the DEV branch) which prevents this error.\n. @krossovochkin theming should work as expected. I think the main issue you get is that the cards itself are not dark. so the activity itself has a light background and the cards are light. Right now those don'T use styles and they don't react to light or dark.\nIf you really need a dark theme you can fork this repo and try use styles for the views and add a dark theme.\nI think i've defined all colors in the colors.xml you can overwrite those colors if you like :)\n. (in your project)\n. Oh thanks for this issue. Never had a problem with long names. I will look into this. Thanks\n. - thanks for the contribution\n. @nhaarman thank you so much\n. @destil this is already done. A library creator just have to add the so called definition file to his project and AboutLibraries will autodetect it and will show it. The current issue is, that some library devs refuse to include the file because they don't like ressources in their lib, or they don't see the idea behind the whole concept.\nfor the libs which are included in the AboutLibraries library itself it is currently not possible to detect the libs. I've searched for a way to do this, but was not able to find anything until now.\n. @michaelcarrano sounds pretty awesome. you are right. If the internal definition files are extended with the package name it should work. :+1: \n. @michaelcarrano if it's ok for you i'll check your source and will try to include some functionality into this lib. i'll add your project to the description afterwards. \nI already got some ideas how this could work :)\n. @michaelcarrano so autoDetect functionality is now in the DEV branch: https://github.com/mikepenz/AboutLibraries/tree/dev you can check it out already in the v3.0.0 SNAPSHOT release (just a few libs are supported til now)\n. @michaelcarrano great! thanks :)\nyeah you are right, this is definitely something which takes some time. I've created a small util for my users so they can create the definition file and hopefully create a merge request.\nyou can find this tool here: http://def-builder.mikepenz.com\ni got a different idea. -> create a db (a real database including a simple RESTful API) and frontend interface so moderators (or people who have the right) can add new libraries so everyone can use the information. in a next step it would be amazing to get in contact with the creator of http://android-arsenal.com/ and join forces\n. This one is in v3.0.0\n. @thunsaker thanks for the pull-request. Can you please remove Android-ViewPagerIndicator because it's already in AboutLibraries library: androidviewpagerindicator\nThanks :)\n. @thunsaker oh i just saw you already used the classPath setting. Perhaps i should rename it. For the autoDetect feature to work it must be a specific class under this packagename which can be detected via reflection. I'll merge and add them later. \nJust that you know for the future: \"com.squareup.timessquare\" need to be \"com.squareup.timessquare. MonthView\" as example. It can be any class. As far as i know it's not possible to check for packagenames via reflection.\nThanks for your help!\nThose libs will be in the next version :)\n. @wmora Thanks for the pull-request. \n. already fixed by PR\n. thanks\n. @kashban v3.0.3 with your patch is building right now. will publish it on maven afterwards. should be available in 1-3hours. \nCheers :)\n. @krschultz thanks should be in version 3.0.4 which will be available within the next 1-2 weeks\n. @kashban probably it would be better to name the license and the file to license_cc30_strings.xml\nIs easier to use in the libs. I think cc_by_3_0 could be a bit confusing\n. @kashban can you update your pull-request? thanks :)\n. Thank you so much\n. v3.0.4 should be available in 2 hours :D it was pushed to maven already\n. this would be done already. but i got some issues with the new build-tools and the appCompat library. \ncan't build anymore ^^ :/\n. @ChrisMCMine thanks. will release an updated version 4.0.2 soon\n. oops forgot about the milestone. \nIt's not on my prio list right now. But if someone got some time ;) I'm always happy about a pull-request\n. @ThomasdenH i'm not quite sure why it is not enough to create a custom .xml for this and add it to your application? During build time you know which libraries are included? \n. @ThomasdenH ah ok i see. so adding a whole entry (lib + description etc...) or just replacing specific stuff (like license)?\n. @ThomasdenH if you don't use the default activity or fragment you can do this already. I will check how fast i can add functionality to modify information based on the app_id ;). \n. @ThomasdenH i'm not quite sure. i will have to try it, and run lint checks. \n. Hmmm that's strange. i think i had this same problem with the sample app. Perhaps i just add the libs which are used within the AboutLibraries library as dependency to the instructions. thanks\n. @yoavst thanks for the info. :)\n. Great pull-request. \nBut it would be better to split it up in two separate pull requests. \nA question. Why do you need the statusbar / navigationbar coloring by code? Is it not enough to do it via styles?\n. @yoavst no problem. thanks. \n. @yoavst thanks. i will try to write a small script to extract all the compatible libs from the res files. would be a bit much work to always update it manually :D\n. @johnjohndoe thank you so much\n. @johnjohndoe thanks for the info. i always miss to update the WIKI you're right. \nWhy there's only 4.3.6 on maven, i tried to publish a version yesterday, but maven was slow. I will try it again today. so it should be on maven after that.\n. Created new release. \nMaven release is still missing, because it won't allow me to update the lib\n. @johnjohndoe you mean i should add a release for each previous release. Yeah will be much work but should be possible.\nWas able to release to maven yesterday. It seams that maven-central (or the oss.sonyatype) has some performance issues in the last few weeks, so sometimes i can't release a new version\n. @johnjohndoe it's working again. so it's fine :)\n. @johnjohndoe i haven't had the time to go through all commits and create releases for previous versions.\n. @johnjohndoe added tags for all versions starting with 3.x.x\n. @johnjohndoe yeah i've changed the package name and the version number to reflect this changes. Previous users can still depend on the old version. \nIs there a cause why you or someone else wouldn't be able to update to target SDK version 21, but still need to update to the latest AboutLibraries library version?\n. @johnjohndoe ah yeah i see. \nPerhaps a different release on a different branch would help, but would require some work. Perhaps it is better to just use the previous version, which had most functionality already.\n. @johnjohndoe yeah you are right. The v3.X.X versions are still without the support libraries. So all people who don't use v21 as target shall use this version. \n. @johnjohndoe thanks. \n. @johnjohndoe yeah you are probably right. Should be something for v5.x because it will break current implementations.\nthanks you so much for all the time and effort you spend for this project!\n. They are now deprecated. and the builder should be used.\n. The problem with this version was that i merged a wrong contribution of androidannotations. which was marked as internal which means it always thought that it was included. \nFixed this issue with a version in 4.x \n. This is the specific commit fixing this issue:\nhttps://github.com/mikepenz/AboutLibraries/commit/4bf7969fa851abf869df13d6d87035cf3d1d6088\n. So created a new branch with the v3.x.x versions and fixed this issue. I've also added all new libraries from the current v4.x.x version and the cc30 license.\nhttps://github.com/mikepenz/AboutLibraries/commit/1d40c91945cc7ba0ab36294ee4d2452388745585\nThe changes are under com.tundem.aboutlibraries:3.0.5\n. @johnjohndoe yeah you are right. my only intention was to get it working for those people again. \nBut you are right i updated the target version. really forgot about it. \nJust thought i will add them so people on previous versions will also get those updates. \nA different question. You've done pretty much already for this project. Are you interested in getting a contributor?\n. @johnjohndoe thanks again. I've rewritten this commit and split it up. i also uploaded a new version to maven with buildSdkTools 20 instead of 21. i had to update the buildTools to be able to upload the lib. Should be fine now :)\n. Thanks :)\nOk will keep it in mind for future updates :D i think it's ok for today. \n. For me its shown in the releases view:\nhttps://github.com/mikepenz/AboutLibraries/releases/tag/v3.0.5\n. Thanks :)\n. @johnjohndoe seems correct. Will try it at home today with the newer version. Perhaps debugging will show me what's wrong. \nYou tried already to do a clean build?\n. It's really strange. I can't reproduce it with the current master and the jackson definition (which i added to the internal libs)\n. Found the exception. \nIf a specific library does not contain a website i won't set the onClickListener. So it will use the onClickListener of the view of the previous holder element. \nHere's my fix:\njava\n//Define onClickListener\nif (!TextUtils.isEmpty(library.getAuthorWebsite())) {\n    holder.libraryCreator.setOnClickListener(new OnClickListener() {@Override\n        public void onClick(View view) {\n            //do the logic\n        }\n    });\n} else {\n    //reset the onClickListener for this listelement\n    holder.libraryCreator.setOnClickListener(null);\n}\n. @johnjohndoe so it's in v3.1.0 for you and v4.4.0 ;)\n. Thanks :)\n. @johnjohndoe the repository link is just information right now. You don't have to use the pre built activity or fragment, and i thought it is useful to create a definition file which contains all useful information. Including the repositoryLink, because probably someone will create a custom activity using this link too. \n. @johnjohndoe seems that i missed the AndroidManifest declaration for this activity in the legacy branch. Will add it and upload a new version. Thanks for the info.\n. @johnjohndoe no problem. Just missed the AndroidManifest declaration ;)\n. Without any further details i can't say what's wrong. \nso you've added donottranslate.xml?\nor are do you mean materialnavigationdrawer and qcircledesigntemplate? \nwhat's the content of those?\n. @yoavst ok looks ok. should be detected. you can also try to add define_int_... so it should be detected automatically. \nYou've also cleaned the project. (just in case)?\n. @yoavst really strange. Have you implemented following line, as stated in the README:\njava\nbundle.putStringArray(Libs.BUNDLE_FIELDS, Libs.toStringArray(R.string.class.getFields()));\n. @yoavst so it was this one :) \n. @johnjohndoe interesting. just defining the archiveBaseName wouldn't change this. It would also require the POM_ARTIFACT_ID=library to be changed to aboutlibraries.\nWould it bring any other advantages?\n. @yoavst thanks. This issue is just a reminder for myself to implement it :D \n. @yoavst thanks for the idea. I think this is a great idea. But i think it's cleaner to create a helper which returns the ready to use adapter. So you can simply use it with your RecyclerView or something like this. \nOr you just create an empty area where you set the fragment :D this would also work xD\n. @Shajeel-Afzal  I don't use Eclipse anymore and i strongly recommend to use Android Studio instead of Eclipse. \nYou can try a reimport. \nHaven't changed anything which could cause this issue. Just updated some internal stuff and added new features, and updated the gradle build tools\n. @Shajeel-Afzal a different question. Why you need to use the library as project? Just download the .jar from maven and use this one?\n. @diogobernardino thank you\n. @johnjohndoe yeah you are right, right now i had no idea how to get the real version number during runtime. once i thought it would be great to get it from the AndroidManifest, but all my tries failed. \nI've seen this repository (i saw that you contributed to it so i stared it) and it's really interesting. And you are right it would be great if those versions are fetched either from the build.gradle or from the pom.xml. \n@RobertFischer has a different approach to generate a report (as far as i've seen) and you can use this information. \nI hope i can somehow combine the idea behind AboutLibraries and add the version functionality (or even the general definition file generation (who knows :D)) from a gradle plugin. \n. @johnjohndoe yeah you are right, this would be the best solution. I'll take a look at it in the next few days. Would be awesome if i can get it working this way. \nThanks\n. @johnjohndoe not yet\n. I am open for an PR for this. I will close this now as it is not planned from my side. \n. @Rainer-Lang right now the colors can be configured by adding a colors.xml to your application and set the different colors to custom values:\n``` xml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n Theme colors \n#536dfe\n#3f51b5\n#ff4081\n#ECECEC\n<!-- AboutLibraries DEFAULT colors -->\n<color name=\"about_libraries_card\">#FAFAFA</color>\n<color name=\"about_libraries_title_openSource\">#212121</color>\n<color name=\"about_libraries_text_openSource\">#727272</color>\n<color name=\"about_libraries_dividerDark_openSource\">#AAA</color>\n<color name=\"about_libraries_dividerLight_openSource\">#DADADA</color>\n\n<!-- AboutLibraries SAMPLE DARK colors -->\n<!--\n<color name=\"theme_window_background\">#303030</color>\n<color name=\"about_libraries_card\">#666666</color>\n<color name=\"about_libraries_title_openSource\">#ffffffff</color>\n<color name=\"about_libraries_text_openSource\">#DEDEDE</color>\n<color name=\"about_libraries_dividerDark_openSource\">#303030</color>\n<color name=\"about_libraries_dividerLight_openSource\">#303030</color>\n-->\n\n\n```\n. The original colors are from here: http://www.materialpalette.com/blue/pink\n. It's now in the wiki ;)\nhttps://github.com/mikepenz/AboutLibraries/wiki/HOWTO:-Style\n. Fixed in v4.5.6\n. I forgot to release the newest v4.5.5 on maven. this is done now. Should be live soon.\n. you can send an e-mail with the xml too :D \nor copy and pasting it as issue. \n. thanks i'll add them ;)\n. Yeah i've looked over the 5 new libraries, they seem accurate. I'm still not sure if it's required or necessary to include the google support libraries, but it's nice to have a definition file for those. In fact they won't be auto-detected, and you have to pass them in the builder.\njava\n.withLibraries(\"AppCompat\", \"GooglePlayServices\")\nTalking about the second change. I see your point, but the fix you've provided is not correct. The ViewHolder itself should be static that's fine. The issue is somewhere else. \nThe problem is in the onBindViewHolder method\nTo be correct it's in this part of the method.\n``` java\n//Set License or Version Text\n            if (TextUtils.isEmpty(library.getLibraryVersion()) && library.getLicense() != null && TextUtils.isEmpty(library.getLicense().getLicenseName()) || (!showVersion && !showLicense)) {\n                holder.libraryBottomDivider.setVisibility(View.GONE);\n                holder.libraryBottomContainer.setVisibility(View.GONE);\n            } else {\n                holder.libraryBottomDivider.setVisibility(View.VISIBLE);\n                holder.libraryBottomContainer.setVisibility(View.VISIBLE);\n            if (!TextUtils.isEmpty(library.getLibraryVersion()) && showVersion) {\n                holder.libraryVersion.setText(library.getLibraryVersion());\n            }\n            if (library.getLicense() != null && !TextUtils.isEmpty(library.getLicense().getLicenseName()) && showLicense) {\n                holder.libraryLicense.setText(library.getLicense().getLicenseName());\n            }\n        }\n\n```\nas you can see, i check if the version is not empty, if it is i won't set the new text. I have to add an else block like this:\njava\nelse {\n   holder.libraryVersion.setText(\"\");\n}\nCan you please split up the pull request so it's just about the new libraries. I'll include the fix for the other issue later today.\n. @jkane001 can you modify the pull request? so i can include half of it ;)\nyeah you are right, totally missed that you've also included the classPath. \nsorry for the misunderstanding.\nyeah you are right!. \nthe only possibility to include the version would be to write a gradle plugin which would include the version within the definition file or something like this. i've also spent a lot of time for this one already. and yeah. at the moment i'm afraid i have not the time to do something like this. \nThanks a lot!\n. @jkane001 ok thanks ;)\ni'm still not really sure how to handle those libs. somehow the aosp libs are \"normal\" in each app :D\n. Thanks again ;)\n. because it's html ;) \ntry <br />\n. You've set your content as resource?\n. You've wrapped the whole thing within a CDATA tag?\nxml\n<string name=\"aboutLibraries_description_special3_text\">\n        <![CDATA[\n        <i>Version 1.1.0</i><br />\n        - Something nice ;)<br />\n        - Something awesome<br />\n        <br />\n        <i>Version 1.0.0</i><br />\n        - Something new ;)<br />\n        - Oo text :D]]>\n    </string>\n. @Rainer-Lang changing the text-size within the dialog would require you to change the AlertDialog style for the theme you use with the AboutLibraries library\n. @Rainer-Lang please just use context.getString() \nfor the moment i won't add those additional methods :D\n. @Rainer-Lang i use the default theme here. so this is used from the style you use. if you need a different style here please try to overwrite the dialog theme.\n. @Rainer-Lang is this really required?\n. @RubenGees thanks. \nCLOSE :D\n. @Rainer-Lang oh i see ;). \n. @Shajeel-Afzal i can open the site. still not working for you?\n. @Shajeel-Afzal strange. you can use the source which is in teh github repo too :D it's a simple html site with javascript:\nhttps://github.com/mikepenz/AboutLibraries/tree/master/DEV/definition-file-builder\n. @Shajeel-Afzal no it does not generate any files. the libraries are detected by their definition files, or if the lib can detect a class which is in the classpath. i assume there is still any reference to the picasso lib. perhaps a library is using picasso as dependency?\n. @Shajeel-Afzal the def-builder is just a helper creating definition files. you can then do a pull-request here. \n. @Shajeel-Afzal the wiki has some more information about this topic\n. @jkane001 thanks ;)\n. @cyroxis thanks. sorry for the late merge. was a bit busy with the MaterialDrawer library\n. @theenderer yea thos would probably be a good idea. thanks\n. @wKovacs64 thanks\n. @alorma will be fixed in the next version ;)\n. @theenderer what happens? it will stop to auto-detect. This is because the classpaths of the libs are changing. so i can't autodetect. You should still be able to just manually set the used libraries in the builder. \n.withLibraries(\"activeandroid\", \"caldroid\") should do the trick\n. @theenderer any luck?\n. @theenderer you will have to exclude each single lib so proguard would not change their package names. but i think this is unnecessary.\n. @Rainer-Lang because the text is to long :/ and it will show 2 lines. no idea how to change this\n. @Rainer-Lang the padding is now lowered. It will still cut it off on smaller devices\n. @wintersandroid i have to update all the libs for the new support libraries because they have changed many things, please use the previous version for now, until i was able to update.\n. :D x2 \n. @alorma any real advantage of this?\n. @alorma solved ;)\n. @Gordey this is not AboutLibraries specific. I also assume that you should use getSupportActionBar() Not sure which PreferenceActivity you use. (I think there's also an support version)\n. @jmpascal thanks will be in v4.7.0\n. @ppamorim you were to fast :D just released it to maven central. it needs to sync now. please wait 10-45 minutes longer ;) \n. @ppamorim yeah :D \nThat's true, but for now i like maven central :P\n. @ppamorim just in case :D v2.7.1 is synced to maven central and it can be used now ;)\n. @alorma interesting one ;). looks nice. thanks\n. @alorma but can't be merged. can you merge my changes back first.\n. @RubenGees thanks\n. @RubenGees yeah i just saw that you set the classPath value wrong, so it won't automatically show up. \nThe classPath value should be a specific class which is inside the library. Like org.apmem.tools.layouts.FlowLayout for the android-flowlayout library\nsorry that i missed this\n. @RubenGees it can be. but should one which is one of the Main classes so the chance is very low that it will be removed\n. @shayousefi thank you. I will try to take a deeper look and solve it. Thanks for the report\n. @shayousefi seems to be an Android specific Memory leak. no variables or anything which could leak the context. \n. @shayousefi if someone has a more specific info it would be great. but as far as i can say from the code side it looks fine.\n. @shayousefi thank you ;)\n. thank you ;)\n. hey. thank you so much. Please do the advised modifications ;). thanks\n. @nanopc great ;)\nthank you so much\n. @Fentin you are totally right. Thank you so much\n. @RubenGees seems correct this time ;). \nThank you so much again ;)\n. @wKovacs64 not sure how much work it is. but can you do this on the develop branch? so i can stay with git flow ;) also please for the second merge request\n. @wKovacs64 thank you so much\n. @jpmassena looks great. please submit them on the develop branch\n. @jpmassena thanks\n. @jpmassena ok seems i will have to remove this merge again. as you merged the master into the develop branch. which should not be done. \n. fixed it: https://github.com/mikepenz/AboutLibraries/commit/a9e27e1e588187505001d9922dca3c4100935800\n. @ilmetu i am not sure what this has to do with the AboutLibraries project? It already is possible to create a fragment from it?\n. @wKovacs64 you are awesome :) thanks!\n. @wKovacs64 and even on the develop branch :P\n. @Aqua-Ye it's on mavenCentral and on jitpack\n. thanks\n. thanks\n. @MartinNemec next time pls on the develop branch. \n. thanks\n. thanks\n. @jgindin thanks\n. after i tried everything\nperhaps this weekend\n. @jgindin ok published :D\n. haha :D thanks. and on the master ^^ :D noone sees the develop branch\n. @Fentin can you please do the changes on the develop branch? (all 4 :D) if it's faster for you it's ok if you combine all 4 in one pull request. thanks\n. @Fentin thanks a lot!\n. @jgindin thanks. looks good. \n. @jgindin it would be great if you could create the pr on the develop branch\n. @jgindin for this please. i use git flow so develop is the branch for development ;)\ni changed the default branch already so it should not happen anymore then :D\nNo problem ;). Thank you\n. @stleusc this are 2 different topics. \nabout the theme. no a library can'T just use the theme of another app. you will have to provide the specified attrs so the theme is working. if you set them in your theme it's fine. https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/styles.xml#L13\nStill this is not as easy as it seems :D\n. @jgindin it would be easier if you revert the changes on the develop branch. and just cherry pick the single change. merging this pull request would be the same as me merging the master into develop which is not a good thing ;)\n. @jgindin to simplify the whole thing i will just cherry pick the change from your branch. for the next time ;). pull the develop branch first and then merge or commit the changes ;)\n. @wKovacs64 thank you so much\n. @wKovacs64 and a second time :)\n. @wKovacs64 and a third time :D\n. @jayakanthang this library does not contain the com.fima.cardsui project. just the sample project.\nit seems you did not setup the lib with the gradle dependency for your project?\n. https://github.com/mikepenz/AboutLibraries#using-maven\n. @FabianTerhorst now you added 2 more libs. please modify the classpath for them too. \nthanks :)\n. Thank you so much\n. @wKovacs64 thanks\n. @andreaszielke if you click on the license name inside the AboutLibraries library it will display the license text. is this false?\n. it is a property and has to be activated separately\nYou can find it in the Manifest Activity\n. @Mek0n i can not automatically detect libs via the Classpath autodetector if the packagename's and classes are altered. It will work for libraries which contain the definition file in it. but this is not the case for most libraries. \nSo as an alternative fix you just can define which libraries to show. but you will have to do this manually. \n. @Mek0n i can't prove it but i have the feeling the empty <string name=\"define_PDFJet\"/> is removed by proguard. Can you try to just add some content to it?\n. @Mek0n can you add it manually via code to make sure it is in and it just can't find it via the normal way?\n. @Mek0n thanks :)\n. @JordanGout you can hook in any functionality you want. \nThere is the LibsConfiguration which allows you to set any listener for it:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java\nUse it like:\njava\nLibsConfiguration.getInstance().setListener(...)\nYou are looking for this: onExtraClicked. Return false if you have consumed the event\n. @JordanGout no problem ;)\n. @JordanGout it seems fine. Just one thing. The classpaths you have defined should point to an class which can be instantiated. Else it's not really easy for the lib to make sure a specific lib exists. (I use this to see if the class which is written can be found and if yes i'll automatically add the lib) \nCan you please change it to point to a real class? I will do a quick check on something i just had in mind. i'll let you know if it worked ;)\n. @JordanGout ok the idea i had seems to be not possible. :/ \n. @JordanGout looks great :) thank you\n. @vanniktech if the auto detection does not work you can also just enable it via the builder. withLibraries(\"facebook\") perhaps the classpath is wrong and should be changed? you can open a pull request if you like to ;)\n. @bskim45 thanks \n. @wKovacs64 thanks\n. Thanks\n. thanks once again :)\n. @bauerj which version of the AboutLibraries do you use? Do you use proguard? \n. @bauerj ah i see. this definition file was updated 9 days ago. i will publish an update later today. which will fix this issue ;)\n. @bauerj latest version already published to maven central. should be available in the next 30 minutes ;)\nthanks ;)\n. @vanniktech thanks for the pull request. but i can't merge as this will break the caching of the auto detected libs. \nCan you retry if it works for you without this change? to make sure it does not listen for the cache just count up the versionCode of your app\n. the pull request is no fix. it just disables the cache which remembers the auto detected libs. this only happens once per versionCode (to make it faster) \nso if you change definition files (or update the lib) you will have to remove app data or count the version up that new libs are detected\n. @vanniktech i looked over the code and it should do exactly what i wrote above. it works for you just with the change (the pullrequest) and no other changes?\n. @vanniktech just checked. somehow the FacebookSdk class is not inside the lib itself. It will work if i change it to: com.facebook.FacebookSdkVersion\n. @JordanGout thanks :D had activated auto renew. Strange that it did not inform me. \nWill be live gain within a few hours (after the domain renewal was processed)\n. @JordanGout do you have obfuscating activated? perhaps the class i use to check if it is there changed: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_gson_strings.xml#L12 ? \n. Will it work if you pass the fields via the builder? \njava\n.withFields(R.string.class.getFields())\n. @JordanGout interesting so it should understand that it's on the classpath :/. i will have to debug this issue\n. @JordanGout without int the libraries are detected because the AboutLibraries thinks those are included in the lib itself.\nhmmm i will take a clsoer look\n. @JordanGout all of them are detected here. (can't test crashlytics as this is a different repo)\nI have a small feature included which will improve performance after the first start which remembers libs found for a specific app version. Can you count up the current versionCode of your app?\n. and another thanks :D\n. @vanniktech you are right. i have not yet released it on maven central. have done this now. will take ~30 minutes to sync. \n. @vanniktech as of maven central it's there: http://search.maven.org/#artifactdetails%7Ccom.mikepenz%7Caboutlibraries%7C5.2.1%7Caar\n. haha :D that's a small one. already done this locally. but yeah :D thanks\n. @vanniktech there is an internal cache which keeps the libraries which were detected via the auto detection per versionCode so you will have to count up. If you do this it will show up. \nIf you enable proguard and packagenames of libraries are altered the auto detection won't work for libs which are included in this repository. It will only work for libraries which include the definition file itself (like MaterialDrawer, etc...) This is because the only thing i have found working was to check for a specific Class of a lib to check if it is there. \nIn this case i recommend you to just provide those libs manually. Which shouldn't be to much extra work.\n. @javiersantos ;)\n. Are you sure this makes sense and will show up? This is just a IDEA plugin which will help you during your development process, but it won't do much for the real app you release? As far as i understand it those are just annotations?\n. @AngleV great\n. @RubenGees interesting. on my phone it adds \"...\" to cut the name of the library. two lines is no option\n. hmm could be something similar\n. @RubenGees is this still a topic for you?\n. yeah i have not really found what could cause the problem as it works in some cases. and in your case not. really weird\n. thanks for the PR  will check it ;)\n. thanks\n. thanks\n. The classpath of jsoup is not complete. i will improve this. for now just manually add jsoup as library you use :D\n. @randombyte-developer yeah i have not yet released a new version. as mentioned just add it manually at the moment via the builder. \njava\nnew LibsBuilder().withLibraries(\"jsoup\") ...\n. support and appcompat are not auto detected at the moment. they are used by most devs. i am not sure if they really need to be mentioned all the time..\n. @bezineb5 the online version? http://def-builder.mikepenz.com/\n. @bezineb5 ok thanks for reporting. fixed it\n. @RubenGees as far as i can see it looks fine. also you do not need this library_introduction_classPath for an internal lib. \nthe lib is used in the project, and proguard isn't messing something up?\n. ah ok. haha. just saw that it looked at the fixed version of the definition file :D sure that i can't find an issue :P\n. @vanniktech those are your libraries. right? you can also include the definition file directly within your lib. As done in my libs: https://github.com/mikepenz/MaterialDrawer/blob/develop/library/src/main/res/values/library_materialdrawer_strings.xml\n. Your have to remove _int from the first line define string.\nNiklas Baudy notifications@github.com schrieb am Fr., 18. Sep. 2015 08:25:\n\n@mikepenz https://github.com/mikepenz yup they are my libraries. Thanks\nfor the advice. I just pushed it with\nvanniktech/VNTNumberPickerPreference@7c2736f\nhttps://github.com/vanniktech/VNTNumberPickerPreference/commit/7c2736f5b42a32e30becca1dd58dd8efa35a5391\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/pull/154#issuecomment-141356181\n.\n. Take a look at the sample of the MaterialDrawer I sent\n\nMike Penz mikepenz@gmail.com schrieb am Fr., 18. Sep. 2015 08:30:\n\nYour have to remove _int from the first line define string.\nNiklas Baudy notifications@github.com schrieb am Fr., 18. Sep. 2015\n08:25:\n\n@mikepenz https://github.com/mikepenz yup they are my libraries.\nThanks for the advice. I just pushed it with\nvanniktech/VNTNumberPickerPreference@7c2736f\nhttps://github.com/vanniktech/VNTNumberPickerPreference/commit/7c2736f5b42a32e30becca1dd58dd8efa35a5391\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/pull/154#issuecomment-141356181\n.\n. please try\n\n\ngradle\n-keep class .R\n-keep class **.R$* {\n    <fields>;\n}\n. but adding\njava\n.withFields(R.string.class.getFields())\nto the builder should do the trick at least\n. does this fix the problem?\njava\n.withFields(R.string.class.getFields())\nif yes i recommend this as solution. \n. @RubenGees ah i see. yeah makes sense that it does not work for most libs, as those devs are to lazy to include the definition file inside their lib. proguard modifies the packagename and classes so the autodetect feature is not working for libs where the definition file is included inside the AboutLibraries. It works for libs like the MaterialDrawer which has the definition file inside the lib itself. \nYou have 2 options. \n- Exclude the class which is used to autodetect from obfuscating\n- Manually define and add those libs\n- (not really a solution) hope that those devs add the definition file to their libs :D\nsorry there are no other solutions\n. @RubenGees just set withAutoDetect(false) this will just disable the autodetection via the classpath. MaterialDrawer etc will still work\n. no problem. sorry that this is not possible via the autodetection. but gradle removes everything which would allow me to detect an lib.\n. @RubenGees yes. but i really do not have the time to do this\n. @fchauveau thanks\n. @fchauveau oh just saw you did it on the wrong branch. the main branch is develop not dev\n. thank you so much ;)\n. @AngleV i think this is no AboutLibraries issue as those just provide the fragment. \nAnd sorry i do not have a real idea why this happens\n. added will be in v5.2.4 as soon as it is released\n. thanks\n. @rubengees sorry for the late response. i've improved the initialization of the fragment and libs loading will be in v5.2.6\n. added in v5.2.6 thanks\n. @eling13 not sure where you used this, but this is no part of the library, only in the sample app.\nThe library uses the following dimension for the libraryName:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listitem_opensource.xml#L33\n. @AngleV does it write out something in the log?\n. @AngleV just tried your code within the sample application and it works. Could you please debug it or provide a small sample app so i can reproduce this issue?\n. @AngleV oh really? what was the issue?\n. ah ok ;)\n. @wKovacs64 thank you\n. @AngleV you can't directly access this. i will add you 2 new methods to hook into the view creation of the HeaderView and normal library card view (of the RecyclerView)\n. @AngleV was waiting for this release for the other issue to be fixed :D (https://github.com/mikepenz/AboutLibraries/issues/166) but as you mentioned it already works i will release now ;)\n. @AngleV i hope the listener is working for you as i hope to. But it will allow you to access the view containing the description. So you should also be able to overwrite this behavior\n. @AngleV no this is the wrong one. this will allow you to modify the whole ui. but the description is part of the header. \nSo you have to use the LibsRecyclerViewListener https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L112 for the LibsRecyclerViewAdapter.HeaderViewHolder\nJust a description why you get this exception above:\nYou return null as view for the fragment, so it will crash. You should return the view again. So the method is meant that you modify the view and then return it so this view will then be returned in the onCreateView method.\n. @AngleV right ;). \nThe onBindViewHolder method is called after a specific item was created inside the Adapter of the RecyclerView\nThe HeaderViewHolder has the descriptionTextView\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/ui/adapter/LibsRecyclerViewAdapter.java#L464\n. @MAndretti sorry but i stay with API Level 10, as many devs still support apps down to API 10. \nAs an additional note most apps also come with the appcompat-v7 library which has the support-v4 as dependency, so those also support the v4.Fragment. \nWhat usecase do you have that you can't use v4 fragmet?\n. @MAndretti next update will fix it for you ;) \nThere is now a method .supportFragment() which will return the v4 fragment, \nand the .fragment() method which will return the normal fragment\n. @MAndretti i can check in 10hours. Seems weird. Tested the .supportFragment() which is an exact copy just with the different fragment type and this works :/\n. just tried it:\n``` java\n    LibsFragment fragment = new LibsBuilder()\n            .withAboutIconShown(true)\n            .withAnimations(false)\n            .withExcludedLibraries(\"NineOldAndroids\", \"gson\")\n            .withAboutVersionShown(true)\n            .withAboutDescription(\"some text\")\n            .fragment();\n\n    FragmentManager fragmentManager = getFragmentManager();\n    fragmentManager.beginTransaction().replace(R.id.frame_container, fragment).commit();\n\n```\ndoes not crash for me\n. @MAndretti no log output? can you debug?\n. @MAndretti i can add a null check. But i do not know why this field is null. \nWhat's the device / emulator. And which Android version?\n. @MAndretti the old version also does not use the AsynchTask to load the libs after the view was created. this will cause some lag\n. @MAndretti i have changed some things. Could you please try to run the new source?\n. @MAndretti with the latest source. The animation is a normal DefaultItemAnimator and the list is shown after the data is loaded. No more optimization possible here. \n. will release a new version with the fixes later today\n. @wKovacs64 thank you. \n. @georgeherby you can either create a normal v4 fragment or a support lib fragment. For the support lib fragment you will have to use the supportFragment() method ;)\n. At the moment you build LibsFragment with the .fragment(); method\nThere is a different fragment type provided by the support library. and you can build this one with .supportFragment() and this will return a LibsSupportFragment \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/MIGRATION.md#v526---v530\n. @georgeherby you already updated to the last version? if you do not have the latest version you probably have still the old methods\n. No problem \n;)\n. @WonderCsabo thanks\n. @manjunathc23 thanks ;). \n. merged :D\n. @manjunathc23 there was no such listener until now.\nThanks to @PDDStudio  there is now a new callback which allows you to hook in for this task\n. maven central will needs about 15 to 30 minutes to sync, afterwards it will be available ;). \nThe sample includes a small code snippet how to use it ;). \nI hope it works, as you expect it to work ;). \nBest,\nMike\n. ;)\n. @markusressel hi. you can do this already. Just define a listener via the LibsConfiguration (in your Activtiy, or a CustomApplication) \nThere is a sample with such a listener in the sample application. Look here:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/sample/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L155\n(You can implement the interface, or just extend the impl of the listener (if you do not want all methods to be overwritten) \n. @markusressel no problem ;) let me know if you need something else. \n. @markusressel many things are \"documented\" via the sample application ;). Makes far more sense for me, because it allows me to showcase things, and to test them (and document them via the app) in once. \nBut i see that some things could be improved ;). \nIn fact the requirement of the description can be eliminated. If there is a listener. \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/ui/adapter/LibsRecyclerViewAdapter.java#L104\nThanks\n. @MFlisar this is already possible. You can simply add a project to the lib by creating ressources like this one:\n``` xml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n<string name=\"define_ItsATest\">year;owner</string>\n<string name=\"library_ItsATest_author\">Mike Penz</string>\n<string name=\"library_ItsATest_authorWebsite\">http://mikepenz.com/</string>\n<string name=\"library_ItsATest_libraryName\">It is a test</string>\n<string name=\"library_ItsATest_libraryDescription\">\n    <![CDATA[\n        Just a test\n    ]]>\n</string>\n<string name=\"library_ItsATest_isOpenSource\">true</string>\n<string name=\"library_ItsATest_repositoryLink\">http://itsatest.com</string>\n<!-- Custom variables section -->\n<string name=\"library_ItsATest_owner\">Mike Penz</string>\n<string name=\"library_ItsATest_year\">2014</string>\n\n\n```\nJust replace ItsATest with something new per library. And it will display it ;)\n. @iLexiconn you are the author of that lib?\n. @iLexiconn you can also add this definition file to your library, so it will automatically show up for people using the AboutLibraries. I do the same for my libs:\nhttps://github.com/mikepenz/MaterialDrawer/blob/develop/library/src/main/res/values/library_materialdrawer_strings.xml\njust change define_int_magisterjava to define_magisterjava\n. ah ok i see. then thanks for your contribution. will be in the next version\n. @dexion good idea. I'll probably add the Iconics-core as dependency to the AboutLibraries, so this is also possible.\n. @dexion ok that's a problem with Android-Iconics if i apply the icon fonts, i will create new spans on the text. As the Html.fromText() already created the spans, i will overwrite them. That will be a more complex task. will look into it.\n. @dexion ok this issue is now also fixed in v5.3.6\n. thx\n. +1\n. @victorlapin they are excluded of the auto detection by default. this is intended. You can simply add them with the withLibraries as you already did. \n. @Aqua-Ye could you please add a screenshot too?\n. @Aqua-Ye fixed in v5.5.2\n. @sparkitny just checked. There is a definition file for otto. and using .withLibraries(\"Otto\") should work. Perhaps .withLibraries(\"otto\") (if this works I have to check if everything is done case insensitiv) \nDo you see other libraries?\n. @sparkitny it just doesn't show up on your emulator? ok that's weird. Shouldn't make a difference. Perhaps the built in caching of auto detected libraries gets active here. \nRegarding easy-content-providers. There is not yet a definition file for this library. \nYou can easily create new definition files with this easy web tool:\nhttp://def-builder.mikepenz.com/\nAll files are in here if you want to find one:\nhttps://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values\n. @sparkitny perhaps instant run issue?\n. @androideveloper the MaterialDrawer has the definition file included within the lib:\nhttps://github.com/mikepenz/MaterialDrawer/blob/develop/library/src/main/res/values/library_materialdrawer_strings.xml\nThe key is materialdrawer \nAs far as I see there is no ckchangelog yet as definition file:\nhttps://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values\nI think the ckchangelog contains the definition file within the lib itself:\nhttps://github.com/cketti/ckChangeLog/blob/master/ckChangeLog/src/main/res/values/ckChangeLog_strings.xml\n. @androideveloper yes this is. Because auto scan just tries to detect libs which do not contain the library definition file within the library. \nMy libs (and some others) contain the definition file within the lib, so they are faster detected.\nYou can exclude them. (I assume you do not directly use the Android-Iconics and the FastAdapter those two are dependencies of the AboutLibraries and the MaterialDrawer (just their core's so they do not add many methods)\n. @androideveloper it's fine ;) \n. @TomasKypta thanks\n. @zishanj you can't align the text, center is default\nYou could copy this layout to your project (keep the name) and change the gravity of the description to left\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listheader_opensource.xml#L86\n. @Oyashirox I have planned to update all my libs later today.\nYou might want to exclude the support libs from my libs for the moment\n. @Oyashirox fixed in latest version\n. @kprathap23 no there isn't you could only overwrite the layout which is used for the cards\n. Copy this to your project https://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/res/layout/card_library.xml (keep the name) and change the text sizes\n. are you sure you used v5.5.7? because this was solved with v5.5.7\nit was removed with this commit \nhttps://github.com/mikepenz/AboutLibraries/commit/e85cf88df83d16e2233ca8b0ba561fc808e4eafa#diff-74ebc293b001224b4282dc8d2cc372d0L74\nno more additional reference in the code\n. #195 \n. fixed in v5.6.0\n. @andrebcmarinho you just checked out this project without any modifications? I can compile it and it works on my machine. \nIf you build the project from the terminal, just scroll up and find the lines where it states ERROR for the javadoc. So you can simply fix those lines there.\n. @andrebcmarinho sorry I do not support jitpack. Please use the published dependency on jCenter or mavenCentral. The released artifacts on jCenter and mavenCentral are also signed so you can be sure they were released by me\n. @jaredsburrows at the moment there are only definition files for the play services and for the general support libraries\nhttps://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values\nFor the other ones we will first need to add the definition files like:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_googleplayservices_strings.xml\nor \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_supportlibrary_strings.xml\n. @jaredsburrows yes exactly. You can also use this tool: http://def-builder.mikepenz.com/ if you want to. \n. @jaredsburrows thank you so much. Next time I would prefer split up pull request, per change. So it is easier to check what changed and what to merge. \nI also checked all changes. For retrofit2 the classPath needs a change, and for the support libraries I would prefer to not have the classPath defined, as it would otherwise automatically show the lib within the about activity, and I am not sure if this is the prefered solution for most. What do you think?\n. @jaredsburrows oh this is now in conflict with the merge of the ci pull request. \n. @jaredsburrows fine so far. only issue now is that the classPaths should be a specific class which the AboutLibrary can try to instantiate. Will change it on my side. Thank you. \n. @jaredsburrows oops I meant the classPath. the classPath name may be a bit missleading, as you correctly defined a classPath, but as far as my research has found, there is no possibility to just check via a packagename if it exists. The only way is to try to instantiate a class\n. @jaredsburrows TravisCI is already enabled for the MaterialDrawer and for the FastAdapter. I can also enable it for the AboutLibraries ;) \nEDIT: enabled it\n. merged. Thank you so much\n. @jaredsburrows should also change as soon as the master was built. I prefer the develop as default branch as I work with git-flow and I want pull-requests on develop\n. @jaredsburrows no I think it's fine if it always shows the current stable branch which is the master\n. Ok great ;). Thank you so much!\n. @jaredsburrows I think it's fine if there's only one for the complete package\n. v5.6.1\n. @rubengees sorry can't merge. Your PR fails the travis-ci build. Your change must not contain a ' inside the xml ;)  Please update, so I can merge it in ;)\nThanks\n. @rubengees yeah probably would help ;)\n. @NateShoffner looks good. thanks\n. @javiersantos what have you changed, as you write it was working already?\nThe \n.withFields(R.string.class.getFields())\nPart is really important. \n. @javiersantos perhaps those apps don't have proguard enabled? or they do not define an applicationId inside the build.gradle (which would both block the auto detecting of the R class) \nAlso you might need to update the current versioncode of the app as the AboutLibraries caches the auto detected libraries for each version, after the first launch\n. @jgindin I assume your theme has a translucent StatusBar You might want to use a default AboutLibraries theme and just alter the primaryColor \n. See the following for the default themes. \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/styles.xml\n. @ofirmiron closed again?\n. @jaredsburrows is it running in debug without proguard?\nI am pretty sure it is caused by proguard because of this\nDefault is not a constant in com.mikepenz.aboutlibraries.d at\nI am not pro in proguard, but normally the default configuration does not really cause such an issue. \nYou might be able to keep the enum with the following:\nproguard\n-keep public enum com.mikepenz.aboutlibraries.Libs$** {\n    **[] $VALUES;\n    public *;\n}\nand probably also:\nproguard\n-keep public enum com.mikepenz.aboutlibraries.LibTaskExecutor$** {\n    **[] $VALUES;\n    public *;\n}\nSee here:\nhttp://stackoverflow.com/a/6286534/325479\n. @jaredsburrows oh weird. perhaps a device or modified android os specific issue somewhere. Hard to tell.\n. Thanks\n. @Jawnnypoo oh thank you\n. Looks fine now. Thanks\n. There's no api to do so. It should be possible if you use https://github.com/chrisjenx/Calligraphy\n. If you need complete custom style you could just use the Libs class and just fetch the information of the libs. Then you can fill your own RecyclerView with the information\n. Just use the following method it will prepare all the library for you and return them as list:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/Libs.java#L146\n. @lawloretienne yeah here's what the library does:\nAboutLibraries builds around the concept of \"defintion\"-files (basically a defined naming pattern for strings split up in different files) So in general the library only knows about the libs which were added as definition file. (You can find a full list here: https://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values)\nThe next thing is that it distinguishes between intern and extern library definition files. That means definition files which are included in the libs themself. Those are easy to detect and display (This happens for a few, like my libraries). The others can't be auto detected that easily, and it will try this via a \"class\" specified in the definition file. If it can init the class the lib is there. (this also is not possible if proguard renames the classes) So all those which do not include the info, or can't be auto detected can either miss the definition file in the lib or just fall out from the above, so you can also define with the method I sent you above to include them manually via their identifier.\n. @lawloretienne so since there is no definition file, you need to create such an file (you can use the online tool for this) and add it to your project (or even better create a pull request so it will be included in the AboutLibraries)\nYes correctly. Just use the identifier of those libs:\nThe identifier is always the string after \"define_int_\" or \"define_\"\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_actionbarsherlock_strings.xml#L4\nBest,\nMike\n. @lawloretienne you can't exclude libraries which have the definition inside the lib itself because it is a fact that those are included. But could probably be revisited. \nIf you show versions they are in most cases outdated as I can't fetch this info directly from the lib and has to be included in the definition file. Normally I choose not to display the version but the license. \nOh your change looks nice. ;). \n. Thank you :)\n. @caman9119 you can via the LibsConfiguration \nCreate an instance and define a LibsListener\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L34\nWhich allows you to listen for the ExtraButton click event:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L194\n. @Mansourali you can retrieve a Fragment. Otherwhise you could extract the logic to get just a Adapter from here: \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsFragmentCompat.java\n. @Mansourali if you can use a fragment you can just build it via the LibsBuilder. if you really need a view, you will have to check out the source of the LibsFragmentCompat and extract the logic to get the exact same view. \nAs an alternative you can use the adapter method of the LibsBuilder to get the adapter which you can then set on any RecyclerView \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L473\n. @austynmahoney you might want to open a PR for this\n. I don't have this on my TODO if you really want it four your project, I would really love to merge in a Pull Request. Thanks\n. @austynmahoney I already had a look at it a week ago, but it isn't as easy as it sounds in the first place :/\n. I still will close this for now as it is no issue, and will might make a great addition if you find some time to provide it someday. (Going over all issues right now from my libs, have to do this to keep overview)\n. @irobotman I'm sorry for that. But not at all related to this library. \n. https://github.com/mikepenz/AboutLibraries/issues/216\nPlease search for an answer on Stackoverflow I can not change anything regarding this. \n. @kiezkicker I am not sure what your issue is? You do not have libraries and just want the upper area? Or what do you want to achieve?\nDo you use proguard? Do you pass the fields from your R variable? (have you defined an applicationId in your gradle?)\n. @kiezkicker if it is already size == 0 in that place you pasted here. The preparation inside the Libs calss resulted in 0 libraries.\nThat can be due to the fact that you have defined an applicationId in your build.gradle. So it is not able to automatically detect the R class. \nIf this is the case you have to provide the R fields here:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L70\nAlso keep in mind that the AboutLibraries caches the found libraries per version in the SharedPreferences so if there were none found once (and you add the R fields now) it will still return size 0\n(https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/Libs.java#L204)\n. @xiaobailong24 there is the method supportFragment()\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L544\n. @fncapps do you overwrite any dimensions or any styles from the AboutLibraries?\n. @fncapps your CustomTheme also has to be correct, if this one is not with DarkToolbar the ActivityStyle can't change everything for you\n. @fncapps ok great at least this works. \nBut you explicitly set the background color so?\nThe padding is set here: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/fragment_opensource.xml#L9 (the same for all sides but the bottom)\nAnd no other padding anywhere. So it has to be the same on both sides. (As of the code) \n. @fncapps you can hook into the ui creation with the LibsConfiguration \nIf you put the following (before) creating the AboutLibraries it will remove the scrollbar\n``` java\nLibsConfiguration.getInstance().setUiListener(new LibsConfiguration.LibsUIListener() {\n            @Override\n            public View preOnCreateView(View view) {\n                return view;\n            }\n        @Override\n        public View postOnCreateView(View view) {\n            RecyclerView rv = ((RecyclerView) view.findViewById(com.mikepenz.aboutlibraries.R.id.cardListView));\n            rv.setVerticalScrollBarEnabled(false);\n            rv.setHorizontalScrollBarEnabled(false);\n            return view;\n        }\n    });\n\n```\n. @WoogieNoogie which odd issues are you talking about?\n. SugarORM is not showing up because it has a wrong classPath here:\nhttps://github.com/mikepenz/AboutLibraries/pull/221/files#diff-2e6006abc2fa8c46012f43afc41c259aR16\nDidn't see it before. \nThe problem is that I have to try to init the class to find out if a specific library is included. So therefor I introduced the classPath. It may has a bit a wrong name. \nAs an alternative the files can be included in the libs themself just having the define_ prefix. This will tell the aboutlibs that the library is used and that the resource comes from the library and not from the AboutLibraries. \nSo in case of SugarOrm it should be like:\nhttps://github.com/mikepenz/AboutLibraries/pull/221/files#diff-2e6006abc2fa8c46012f43afc41c259aR16\ncom.orm.SugarApp\n. Yes correctly. There is no way I have found which allows me to check for a specific package to exist\n. @WoogieNoogie sieht gut aus. Oh sorry that was the wrong language. Looks fine ;)\n. @WoogieNoogie Oh sorry that was the wrong language. Looks fine ;)\n. Thank you for the PR. \nCould you also please add the custom variables:\nhttps://github.com/mikepenz/AboutLibraries/blob/742af897d06987e26f5903545dec0446b50b4886/library/src/main/res/values/library_caldroid_strings.xml#L17\nAnd the \"year;owner\" definition inside the define tag. \nhttps://github.com/mikepenz/AboutLibraries/blob/742af897d06987e26f5903545dec0446b50b4886/library/src/main/res/values/library_caldroid_strings.xml#L4\nso the placeholders are replaced for the MIT license?\n. No hurry. I will merge later today, when I am at home\n. @MSF-Jarvis thanky ou\n. thank you\n. @Rainer-Lang please add the definition file to the Android Iconics. To the specific font:\nhttps://github.com/mikepenz/Android-Iconics\n(don't forget to remove the \"_int\" from the define part)\n. please put this file in the icon font library\n. thanks\n. thank you\n. @androideveloper sorry I can'T merge this as it has many more commits included than necessary. How have you done the PR?\n. Please also tell me where I can find the MaterialDrawer and the AboutLibraries used in this app. Downloaded it and can'T find it?\n. @androideveloper seems like you had an old fork or so because the pr contains many commits from the past. I will close it and add the app manually in this case\n. @MSF-Jarvis just saw that this is your library. You can include this file into your library, with a single change. Change define_int_apprate to define_apprate. So it will automatically show up as soon as someone uses your lib.\nYou should also add the repositoryLink for it\n. @MSF-Jarvis it makes more sense for you if it's in your library, as you can keep it up2date with your library getting updated. and it will show up automatically inside the aboutlibs\n. thanks\n. @CeJienAJPC there is only the method supportFragment() \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L544\nDo you really need the normal \"non\" support v4 fragment?\n. If you want a normal Fragment use the following:\nhttps://github.com/mikepenz/AboutLibraries/blob/742af897d06987e26f5903545dec0446b50b4886/library/src/main/java/com/mikepenz/aboutlibraries/LibsCompat.java\n. @CeJienAJPC if you use the fragment from the LibsBuilder it doesn't use the theme as this makes no sense. \nThe fragment is embedded in your activity so you should define the activity style on your own.\nIf you can't use a AboutLibraries style as your activity style you should add the AboutLibrary style attributes to your theme:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/styles.xml#L14\n. You can define a LibsListener as shown here:\nhttps://github.com/mikepenz/AboutLibraries/blob/72bbacaa001febf93c24199eef766b91c50834dd/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L76\nDefined here:\nhttps://github.com/mikepenz/AboutLibraries/blob/72bbacaa001febf93c24199eef766b91c50834dd/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L133\nand when the bottom is clicked the callback here:\nhttps://github.com/mikepenz/AboutLibraries/blob/72bbacaa001febf93c24199eef766b91c50834dd/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L150\nWhich comes with the Library object which contains the url\n. Either from here from the Library object:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/entity/Library.java#L87\nor here:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/entity/Library.java#L111\ndepending on which information is defined or available for a specific library. \n. thanks\n. @SuSandiWai do you use the AboutLibraries as fragment? If yes, the Toolbar is not controlled via this theme. Toolbars need their own theme to be applied. As shown here: https://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/res/layout/activity_main.xml#L12\n. For this you should use the following method withActivityStyle(Libs.ActivityStyle libraryStyle) https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L347\nAnd you provide the libraryStyle you need\n. @SuSandiWai this is not possible.\nYou can either provide custom definition files for all the libs you use and include the repo link in the general description. \nOr you just use the Libs object and it's API to build your own view showing the used libraries.\nIf you choose the later you need the following method to get the library objects for your application:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsFragmentCompat.java#L185\n. @SuSandiWai I am not quite sure what you mean? Some libraries are not displayed or what's the issue? \nDo you use proguard: https://github.com/mikepenz/AboutLibraries#proguard ?\nDo you have a custom applicationId set or anything which may prevent the automatic R field detection. \nYou may provide the R fields programatically like this:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L64\nIf you obfuscate code it may can't auto-detect libs so you then have to define them:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L91\nPassing their identifiers. A list of all included definition files is here: https://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values \nThe identifier is the part after the define_int_\nFor example here: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_alexei_strings.xml#L4\n. @Jawnnypoo if you still need to do something like this programatically. There is always the possibility by providing a LibsUiListener \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L414\nWhich allows you to hook into the view creation for the fragment. Allowing you to access the RecyclerView\n. No problem ;). Thank you \n. @Rainer-Lang what do you define in your LibsConfiguration?\n. @Rainer-Lang please provide the information how you define and create your LibsBuilder and what you configure via the LibsConfiguration\n. @Rainer-Lang any updates?\n. I am not able to see anything which could leak the context inside the LibsActivity nothing static defined neither anything else which could cause this. \nThe same for all other classes nothing which could hold the context is kept static. \n. @ankitbatra11 do you use the LibsConfiguration too?\n. @ronaldsmartin thank you for your closer look and research. I will try to eliminate this and make additional checks. \n. Could you please retry with the latest version. I changed something. But I was not really able to reproduce the leak with the sample app\n@Rainer-Lang @ronaldsmartin \n. @ronaldsmartin hmm weird. was never able to reproduce it with the sample on my Nexus 6P :/\nthank you\n. @ronaldsmartin oh ok I see. What I don't get is, why the leak still occurs even if I set the Context to null, so the task does no longer reference the context there. \nBut fine :D If android is not happy with setting it to null. Let's go with the ApplicationContext. \nYes please open the PR ;). So it is visible that you found the fix ;)\n. Should be solved thanks to @ronaldsmartin (https://github.com/mikepenz/AboutLibraries/commit/166752cfcfb9bbeb438f3bbc584ce040163d65f2) in the next release\n. @ronaldsmartin will release the update later today.\nYeah for the Context I have added this: https://github.com/mikepenz/AboutLibraries/commit/d74a73b2649e48c563a5da6affe440cdddeeb221#diff-9cd1826525cb325600b1ae16c978cc2eR128 but seems to be not enough\n. @Anty0 the latest commit already improved this, but you could be right that something else is adding to this issue. \nThank you for adding this here.\n. @7172 could you please be a bit more specific? What's the issue?\n. Perhaps related to this: https://github.com/mikepenz/AboutLibraries/issues/236#issuecomment-235877082\n. @long-greg-c thank you very much\n. @ankitbatra11 any additional details about your setup? Do you use the LibsConfiguration?\n. Seems to be related to: https://github.com/mikepenz/AboutLibraries/issues/238\n. @Namnodorel that can happen if the license was changed by time, or the user who added the lib choose the wrong library. Please create a pull request and update the library if it's license was changed. \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_jsoup_strings.xml#L19\n. @Namnodorel thank you\n. @axelrindle have you tried the id with the \".\" (dots) in the name? I haven't yet had such a library and I am not sure if it will work\n. thanks.\n. but you didn't push :D seems to not yet be up\n. I can't see the change in the diff. \n. thanks\n. thanks :)\n. @rubengees I don't think it needs to be added as library. But you can still create the definition file for your application and just have it displayed in your app. \n. @Rainer-Lang thanks. \n. @Rainer-Lang oops merged accidently and had to revert again. please make the pull request on the develop branch\n. @Z3r0byte I removed some methods with the latest release as I stopped supporting minSdk 10. New minSdk is 14. As the MaterialDrawer is based on the FastAdapter it requires both to play with each other. ;)\n. thanks :)\n. Looks good :)\nthanks\n. @jaredsburrows no not really, as I don't want to force all users of the lib to go with a not obfuscated R class. \nThose people can still use the lib without the proguard rule and define the libs manually. \nSorry\n. thank you\n. Oh ok thanks.\n. You can when using the LibsConfiguration and providing a LibsUIListener and LibsRecyclerViewListener which will allow you to hook into the view creation\n. @bskim45 thank you\n. thank you\n. @mddanishansari the AboutLibrary activity will have the color you define. You can see the implementation here: \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/ui/LibsActivity.java#L72\nThe Colors object takes int colors:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/util/Colors.java#L14\nYou provide a ressource which wont work\n. Yes you are right. :O\nPlease just use the android default way of setting the window background:\nhttp://stackoverflow.com/a/11441392/325479\n. You can't directly add them with the above method. Either you add a definition file as for all other libs. Or you use just the Adapter of the AboutLibs which will allow you to add your own LibraryItem by manually creating one and adding it to the list\n. thank you\n. Thanks\n. @xsota this should not be necessary as this is done automatically via the ManifestMerger as noted by @FabianTerhorst \nhow do you include the library in your project? \n. @xsota anything else then this? i use the AboutLibraries in many applications and never had to add the Activity to the manifest. \nYou can check out the same in this applicatoin: https://github.com/mikepenz/wallsplash-android\n. @Namnodorel you can quickly and simple add libraries to your project by adding the definition file. That's the easiest thing. \nThe problem of those being not detected. I can only autodetect libraries which have the classPath defined in there definition file. Proguard may also prevent autodetection, which would require you to add the libraries manually. \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L106\nAs of the solution when you add manual libraries and you want them to show up, no matter of what happens. \nJust define the xml like this:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_aboutlibraries_strings.xml#L4\n(remove the \"_int\" after \"define\") This will result those libraries to show up all the time\n. great. thanks\n. The only solution would be to copy and paste the layouts for those items to your project:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listheader_opensource.xml\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listitem_opensource.xml\nand modify the color's for these texts. \nThe build will automatically overwrite the layouts from the library when the apk is created\n. thank you\n. @alvarlagerlof great. thanks\n. @guntherhoppe if the library is not able to automatically (via reflection) get the R fields of your application it won't be able to show the libs. \nYou will have to pass the libs then in like this:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L81\n. Awesome :)\n. That can be done for example with the LibsUIListener \nhttps://github.com/mikepenz/AboutLibraries/blob/54abd1254c71beb856533ac68146e19c6529404b/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L121\nJust hook into the view creation (so after postOnCreateView)  there you are able to access the parent view which hosts the RecyclerView\njava\n(RecyclerView) view.findViewById(R.id.cardListView). https://github.com/mikepenz/AboutLibraries/issues/270#issuecomment-260693576. @mmokrzycki oh yes I missed this part (as most people just have proguard without obfuscating) the problem is auto detection either works via the xml or via a class file which it tries to find. As those class files have a different name after proguard there is no solution to automatically detect those libs, rather than just defining their identifiers. \nIn general the whole list can be found here on github. \nhttps://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values. @DanStout oh yes you are right. those two lines have to be switched. Thanks for the info. I will release an update with the change. . thanks. @CeJienAJPC I think this would be solved if you create the listeners as static inner class within the class. or as a seperate class. if it's an annonymous inner class it will have the context which will be leaked . thank you :). @marconealberto interesting. the text of the element itself has a weight of 5 and the lib creator name a weight of 2:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listitem_opensource.xml#L27\nYou can overwrite this layout for your project if you want to change some things. @IonutNegru87 thanks for answering. @IonutNegru87 please use a theme without the ActionBar so either you define that it has no actionbar or you use the Theme.AppCompat.NoActionBar theme for the aboutLibs activity. @1sm3t there is no solution to remove the click listener at all. You can prevent the default behaviour though. \nSo for this case you just use the LibsConfiguration and define the Listener then you implement all methods and return true (which means the event was consumed)\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/ui/item/LibraryItem.java#L136. @thisisPratzz what do you mean? you want to overwrite the defined values? or you want to add your own libraries?. you can just add your own definition files to the project to add additional projects. . Like this one: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_aboutlibraries_strings.xml\n. @caman9119 you can add this one on your own :) Just add a LibsUIListener and hook into the view creation after it was done: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L131\nhttps://github.com/mikepenz/AboutLibraries/blob/54abd1254c71beb856533ac68146e19c6529404b/library/src/main/java/com/mikepenz/aboutlibraries/LibsFragmentCompat.java#L91\nThere are also other listeners you could use. \n. @Scrounger something is related to your code as it crashes with your activity\nCaused by: java.io.NotSerializableException: .Activties.OpenSourceLicenseActivity. @Scrounger so you want to have a divider between the items? or a divider in the card? \nYou can already adjust the design of the card by either overwriting the xml of one item\nCopy and paste this in and adjust hte xml:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listitem_opensource.xml\nor you hook into the view generation with the LibsConfiguration via: \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L240. @Rainer-Lang do you want to open a PR with the libs still missing?. @NajeraP95 this works in the sample app with the following code:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L69\nJust try it out. Just add this to your application as layout with the name activity_opensource.xml and it will automatically overwrite the layout included in the library\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/activity_opensource.xml. @roman-ku 3-4 seconds seems really long. doesn't take so long on any phone I ever tested it on :)\nhave you also disabled auto detection?\n. withAutoDetect(false) . will just not try to find libs via the class defined in the definition file. Libraries which include the definition files (Like FastAdapter, ...) will still show up. \n. please open a PR and update the definition files of those libs. I tried them and they work fine. @roman-ku the with exclude and the other methods are all case sensitive. . @roman-ku as for most libraries you can just find it out in its string file:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_circleimageview_strings.xml#L3\n(the name after \"define_int_\") Libraries which include the definition file are not included in the values folder so you have to check out the definition for those in their ressources. (Excluding is no documented feature as it is not great to exclude libraries which you have in your project) \nhttps://github.com/mikepenz/Android-Iconics/blob/develop/library-core/src/main/res/values/library_androidiconics_strings.xml#L19\nhttps://github.com/mikepenz/FastAdapter/blob/develop/library-core/src/main/res/values/library_fastadapter_strings.xml#L4. @roman-ku the FastAdapter is powering the list of the AboutLibraries as it is so lightweight I included it to simplify my live, and also to make things re-useable. \nAs of the Android-Iconics. I had many requests of people wanting to use icons in the descriptions and buttons of the AboutLibraries. So I included the supprot for it (just the core)\nAnd as those 2 libs are from me anyway. :D Go ahead and exclude them. I don't want to force people in showing the license even if it is just a lightweight sub-dependency :D. @kalyandechiraju please fix the PR:\nApostrophe not preceded by \\. @kalyandechiraju oh sorry seems not to be related to your PR. You can hook into the view creation via the LibsConfiguration and access everything you want to. with this listener you have access to the whole view: \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L131\nThank you . @odin- yeah something like this. a different solution would simply be for you to use the Fragment and handle the activity around on your own. Either use your own activity or base on this one:\nhttps://github.com/mikepenz/AboutLibraries/blob/54abd1254c71beb856533ac68146e19c6529404b/library/src/main/java/com/mikepenz/aboutlibraries/ui/LibsActivity.java. @odin- you can also do a PR by adding these ;)\nYou can use this handy online tool to do it\nhttp://def-builder.mikepenz.com/\neverything is described in the README. Now it's happy. AWESOME JOB 👍 . Thank you very much :)\nI have found an issue:\nhttps://github.com/mikepenz/AboutLibraries/pull/299/files#diff-bb9726e2506b837700f7962e581dc44fR17\nThis won't work. I have looked, but found that the lib is not really open source. So we can't link to a direct class of the library. (Java does only allow you to check if a class exists, not if a package is there)\nIt should be like this:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_okhttp_strings.xml#L12\nLinking a specific class\n. @odin- oh :D I was following the repo link inside the description, and this repo did not contain the source for the httpclient. \nSorry for the confusion. \nCould you still please fix the classPath? It should be the path to a specific class existing in the lib, so auto-detection works (sadly there is no fast way to check if a package exists, so it has to check if the class exists)\nNah doesn't matter. It's a PR that's fine ;). the result counts! 👍 \n. @odin- as the library is an internal version, it will only automatically show up if the classpath matches. So if the auto detection can find the class. \nThis is a little bit \"expensive\" so I will keep the found libs as shared pref per application version. you may want to count it up to re-run the auto detection. @odin- theoretically you can also disable auto detection, and just provide the identifiers of the libs you want to show. Then no \"auto-detection\" is required. which is many times faster. No. \nYou would simply use the LibsBuilder and do the following:\nDisable auto detection here:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L130\nYou pass the identifiers here:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L108. @bematthias why don't you just define libs you want to use manually in both cases? Explicit definition of libs is anyways faster \nIn general it was not designed to be used multiple times, and optimized for single fragment / activity usage to be faster in this case. @mddanishansari  please open a PR with only the one commit and change. Great. correct this time. But nice try :D I will move it to the bottom of the list :P. @Rainer-Lang well they miss the \"_int\" :P. fixed in v5.9.3. @guntherhoppe please update to the latest version and try again. @guntherhoppe gradle allows you to exclude dependencies of libs\nhttp://stackoverflow.com/a/36103326/325479. @illuzor you can exclude specific dependencies of used libraries (you then just have to define them manually with the version you want) \nhttp://stackoverflow.com/a/21765656/325479. but beside this. thank you for the PR. . @Aqua-Ye no not (yet). You can stay on the previous version which didn't have the loader, only new definitions were added but no bugfixes or so. new release is coming soon. @joshfriend thank you very much. Also thank you for fixing the wiki. @odin- thank you. (until a new release is out, you can simply exclude the support libs from the aboutLibraries) . @matmedev have you looked if they are included in the lib, just not auto detected?\nhttps://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values\nIf they are not there. Just create a definition file like the ones already included. Here is a nice website helping you. https://def-builder.mikepenz.com/ and include it in your app. \n(it would be awesome if you could then also open a PR adding those missing libs to the AboutLibraries). @matmedev they look very good thanks. if libraries are added into the AboutLibraries. the _int after define is required here: https://github.com/mikepenz/AboutLibraries/pull/316/files#diff-280db18cd776ac1a27308243479c117dR4 otherwise those libs would show up for everyone automatically. (sample here: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_actionbarsherlock_strings.xml#L4)\nAnd the classpath should define a specific class (java sadly does not allow to check for a package if it exists)\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_actionbarsherlock_strings.xml#L17\nthank you. Very nice Thank you. * found the issue, the license file had wrong namings. Until I pushed an update to the library you can already fix it for your project by simply adding the following to your strings.xml \n```xml\n License section \nGlide License\nhttps://github.com/bumptech/glide/blob/master/LICENSE\nLicense for everything not in third_party and not otherwise marked:\nCopyright 2014 Google, Inc. All rights reserved.\nRedistribution and use in source and binary forms, with or without modification, are\npermitted provided that the following conditions are met:\n\n\nRedistributions of source code must retain the above copyright notice, this list of\n         conditions and the following disclaimer.\n\n\nRedistributions in binary form must reproduce the above copyright notice, this list\n         of conditions and the following disclaimer in the documentation and/or other materials\n         provided with the distribution.\n\n\nTHIS SOFTWARE IS PROVIDED BY GOOGLE, INC. ``AS IS\\'\\' AND ANY EXPRESS OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL GOOGLE, INC. OR\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\nThe views and conclusions contained in the software and documentation are those of the\nauthors and should not be interpreted as representing official policies, either expressed\nor implied, of Google, Inc.\n\nLicense for third_party/disklrucache:\nCopyright 2012 Jake Wharton\nCopyright 2011 The Android Open Source Project\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\nhttp://www.apache.org/licenses/LICENSE-2.0\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\nLicense for third_party/gif_decoder:\nCopyright © 2013 Xcellent Creations, Inc.\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nLicense for third_party/gif_encoder/AnimatedGifEncoder.java and\nthird_party/gif_encoder/LZWEncoder.java:\nNo copyright asserted on the source code of this class. May be used for any\npurpose, however, refer to the Unisys LZW patent for restrictions on use of\nthe associated LZWEncoder class. Please forward any corrections to\nkweiner@fmsware.com.\n\nLicense for third_party/gif_encoder/NeuQuant.java\nCopyright © 1994 Anthony Dekker\nNEUQUANT Neural-Net quantization algorithm by Anthony Dekker, 1994. See\n\"Kohonen neural networks for optimal colour quantization\" in \"Network:\nComputation in Neural Systems\" Vol. 5 (1994) pp 351-367. for a discussion of\nthe algorithm.\nAny party obtaining a copy of these files from the author, directly or\nindirectly, is granted, free of charge, a full and unrestricted irrevocable,\nworld-wide, paid up, royalty-free, nonexclusive right and license to deal in\nthis software and documentation files (the \"Software\"), including without\nlimitation the rights to use, copy, modify, merge, publish, distribute,\nsublicense, and/or sell copies of the Software, and to permit persons who\nreceive copies from any such party to do so, with the only requirement being\nthat this copyright notice remain intact.\n``. @m-rm you are welcome\n. Thanks @Javanshir fixed it: https://github.com/mikepenz/AboutLibraries/commit/869a5d79390dbed47781df87b3b8671bb3f01b4c. @m-rm thanks for the report. I'll have a look. @m-rm does this license have aDescription`? (Which one is it?) \nAs of the code it should open. Thanks. Found the cause and fixed it :). @JSierawski awesome. thank you very much. @JSierawski thank you. I have added 2 comments to the PR. @JSierawski sorry I was traveling. I'll check it. @fmt-Println-MKO can you please also provide the definition file you used for \"android_job\"? \nOr what would you expect to see? . @fmt-Println-MKO hmmm I can not reproduce this issue. I tried it with the sample application, and it shows up quite fine. \nIs there something in your project which possibly deletes / removes these resources?\n. you can run and check the sample app it will show up. \nIt's really weird. I copy pasted your provided code, and it worked. thanks. Please let me know if you find something. \n. @fmt-Println-MKO I'll close this until further details are provided :). https://github.com/mikepenz/AboutLibraries/wiki/HOWTODEV:-Include-in-your-library. @kylealanr oh that's true, if the versions do not have an API change, then you simply can overwrite the version to use. \nlike that (adjust to the fastadapter name) \ngradle\nconfigurations.all {\n    resolutionStrategy.force \"com.android.support:support-v4:${versions.supportLib}\"\n}\nIf there it's a version with API change I have to provide an update. (I am planing to do this sometimes this week). @TheGlow666 closed again?. @AllanWang you should be able to simply update it :). The wiki is very old. Maybe I just delete it otherwise :D. Looks fine so far. Please report after you tested :). . Thank you very much. @rubengees thank you very much :). Looks nice as far as I can tell. @rubengees but wouldn't this also remove the strings of the libs themself? So do you add them manually to your project in addition?. It can't as those are loaded during the runtime. So this means your definition still keeps the resources. \n@AllanWang I do not think there is anything I can do about this, or the lib can do about it. . The only thing which can be maybe done in the future is to split up the core, and move all libraries to a different module. So you can either use the module with all the resources, or you manually add the resources you want. @rubengees just drag&drop the apk onto Android Studio 3.0, it has a really cool visualisation, and also shows the contained resources. well I can't do anything about external libraries. \nThe only reason the R class has to be kept is for the auto-detection. You can enable proguard, don't add the rule, and just manually set which libraries needs to show up. @rubengees already writing the README update :). https://github.com/mikepenz/AboutLibraries/blob/develop/README.md#proguard\nThank you @rubengees & @AllanWang . @AllanWang looks really nice :). Great work. @AllanWang please open a PR and add it to the list of projects using this lib :). @AllanWang thank you very much. \nI really appraciate the effort you did to sort them alphabetically, but I'd prefer the chronological order, as I'd like to \"reward\" devs who came first 👍 ;)\nPlese revert the sorting as of this reason ;). @AllanWang merged ;). @zTrap that'S awesome! :) . It's so sad that not more devs do this. \nAdded your lib here:\nhttps://github.com/mikepenz/AboutLibraries/wiki/Compatible-Libs#libs-which-are-natively-supported. hmm I see some definitions where updated :D. @AllanWang why is there a merge conflict necessary? Can't you just sync your develop with mine (by pulling from my remote) prior to doing changes? Otherwise you might want to fork newly :D. @AllanWang no, no conflict :D just mentioned it as the commit and branch graph will look funny :D . Ah don't worry. It's fine :) thank you very much. @StefMa well the main idea was that the developer includes the string in his library, and the aboutlibraries will find that automatically. As this did not happen to frequently most definition files got included in this lib.\nThese contain the classPath which allows me to check if a class exists or not, if it is there the lib is included ---> proguard will preven this. \nIn the worst case you can still define the libs you want to see during creation of the LibsBuilder. @StefMa exactly the only difference you have to make ist to remove the int \nI do the same for example herE: https://github.com/mikepenz/FastAdapter/blob/develop/library-core/src/main/res/values/library_fastadapter_strings.xml\nYes it looks correct as of how it looks. \nwell the define_int or define_ string is used by the AboutLibraries library to check if the resource is coming from the  AboutLibraries itself, so it is not yet allowed to show it, only if the classPath results in a result. \nif the define_ is found without the int it know that the resource is coming from a library and directly shows it without further checks\n. I will have to look at it, but can't do this right now. \nDo you have anything in the build which might remove the resource file?. @StefMa can you please try if: \nproguard\n-keepclasseswithmembers class **.R$* {\n    public static final int define_*;\n    public static final int library_*;\n}\nwould be enough too?. You are welcome :) \nThanks for integrating it ;). @markusressel and you did not have the issue in old versions?. Well this color is already themed:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/ui/item/HeaderItem.java#L273\nColor id: about_libraries_text_description\nOr you should also be able to use this: about_libraries_text_description and set it in your theme. @markusressel yeah true. You can add this info to the wiki please. that would be really helpful.\nThank you very much :). @AllanWang looks good as far as I can tell. @allowthere sure you can. just exclude the support libraries of this project. https://stackoverflow.com/a/30649660/325479. @floschu you can define a LibsUIListener on the LibsConfiguration accessing the views of the AboutLibraries:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L53. @aminecmi only AboutLibs 6.x is compatible with MaterialDrawer 6.x. \nIn addition you have to use the latest support libraries 27, and support libs 27 will need compile and target 27. The error you show basically says that you have 2 MaterialDrawer libraries with different versions in your dependencies\ngradle\n./gradlew dependencies\nshould show you where. It is written in the changelog. Also the libs always try to stay on top of the support libs :)\nBut you can also just overwrite the used version with what you need:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/build.gradle#L86. that's a general thing of the support libraries. They have to match. \nas the linked thing. you can always just define which version to use. @DaveMG3 you have to use the support libraries 27 with the AboutLibraries v6.x\nIn addition make sure the used ItemAnimator version is also up to date with the support libraries 27. You can use a resolution strategy to overwrite the version with whatever you like (as long as the API's I use are not different) \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/build.gradle#L85. @dariobanfi if you want to adjust it. just copy paste this layout to your project and adjust it to your needs. Make sure it stays a ProgressBar and it's id is the same, but beside this you can adjust or style it to anything you need. @Cilenco you can use the exclude function to pass in the identifiers of the support libs:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L120\nTo get them just look them up in the definition files\nfor example support-v4: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_support_v4_strings.xml#L4\ndefine_int_support_v4 --> identifier: support_v4. @10erlosh the androidannotations definition file does not define a Class which can be checked for existence:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_androidannotations_strings.xml\nEither open a PR to adjust this, or just use it's identifier so it shows up. As shown in the sample here:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/java/com/mikepenz/aboutlibraries/sample/ExtendActivity.java#L19\nit's id is. androidannotations . Oh sorry missed you PR. the classpath needs to point to a real java class. Sadly I can not detect a package name in java. it's only possible to check for the class. \n. @10erlosh almost :D https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_actionbarsherlock_strings.xml#L17\nIt needs to be a specific class. Java sadly does not allow to check if a package exists. \nRemember that this is only working if you have no proguard. if you use obfuscation you need to use the identifiers as shown in linked sample in your issue. when proguard obfuscates then onle the ones above \n+ the libs including the definition file (so like the aboutlibs itself, ...) \n+ the ones which might prevent obfuscation \n+ the ones you defined\nyou can exclude ones you don't like. @RJFares no plans to do so :D but I am open for a PR if you love to see this feature ;) . @mmrmartin thank you very much :) \nEven though I do not advertisement it, my library IconicsDrawable can do the same :P. @nstajduhar just add the string resource file to your project and you are good to go. . Really great idea. :) thanks. @QuadTriangle so there is already a mechanism built in to use it via a shared preference, per version (so if you change version it will recheck) otherwise it will be used form the shared preferences. \nIn generell I anyways suggest to define the libraries manually (via their id) and disable the automatic detection. This will be the fastest as it does not need reflection and it will just use your list. . @QuadTriangle what'S the issue with this? no auto detect is done. that's correct. the adapter will load the libs via an async task to it is not blocking the ui, and when it's ready it will display (the async task in this case will finish quite fast, but still a tiny bit, just to not block the ui). well it is a async task. the android system defines . a lower priority for those, so it can take a short bit while until it is really starting the tasks. \nFor gathering the strings. I really love to have this done during compilation time as this would be the fastest, but I guess I'd need to wait for a PR for this. as I am currently really flooded with other libs. \n. @QuadTriangle thanks for the PR. I am not so sure if this is a good idea, there is already the LibsListener which you can attach via the LibsConfiguration\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsConfiguration.java#L195\nThis has a click listener allowing you to launch a website. (or activity, or anything else...). Oh ok I see. Could you please just for stability reasons null check the message findViewById (in case some OEM at some point decides to break dialogs, and not include the message id) . Thanks. well it would result in the same, but I prefer having it checked so it is known that this is a possibility vs just ignoring a exception. @renner-foc please create a PR with only that change.  Seems your branch was quite out of date. the library offers the license name + if the user clicks on it, it shows a popup with the license text. @EmmanuelMess you can enable this: .withLicenseShown(true)\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L72. @EmmanuelMess amazing thank you so much! I will check that asap. and will create a new release :). I think it would cause quite some overhead. currently developer can translate it by using the strings. and have them translated in their app. \nAlso there are quite many files already. updating them all will be some work :D (well at least the approving part. changing to non translateable should be just a regex replace away :D). I think with the current approach it will not be too good to have the translation in here. \nwe might have in the future a more advanced solution. like a web based translation system as you say. and a gradle plugin which will do more work during compilation time. \nBut that's not available right now. and I find no time to do it. perhaps some contributor at some time. @EmmanuelMess that never got implemented. As it is not too much of a size. But I would gladly take a PR to improve this ;) \nClosing this. Feel free to open a PR if you wanna improve this ;). Sorry for the first comment. totally got confused with the other open source project :D. Thanks again. \nWill be fixed in v6.0.5. @masahiro-ikemoto oh my god. I guess the weird caching of the github homepage fooled me. \nSorry. \nI'd definitely love to figure out where this is. As you can see I replaced all apostrophes, and surrounded it with a CDATA https://github.com/mikepenz/AboutLibraries/commit/f07cc0cca41404d98a3179d8156278e41be599e3. yep found them :(. Too bad I was only looking for --> \" \nSorry. Usually the build informed me when building it. Not really sure why it stopped :D. @masahiro-ikemoto can you have a quick look at the changes :D just to be safe before I release a new version. @masahiro-ikemoto thank you. :) will do a release after that. Thanks for reporting :). @JohannesDev kotlin actually could make a difference. Auto detection works by checking if a class which is well known is there in the app. if yes it will show up. Obfuscation or anything else which changes the possibility to detect via reflection will break it. \nThe recommended solution is anyways to define the libraries manually. as it is faster. \nYou can then also disable auto detection in general. \nIt could also be that some libraries do not have auto detection enabled (so no classPath defined) . @EmmanuelMess I am so sorry. Currently super flooded with work. will come back to it as soon as I can.. @daniel-stoneuk the class path is one of the main classes of the library. basically packagename + class name (sadly java does not allow to check for the existence of a package). This library is already included by the way :) \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_materialaboutlibrary_strings.xml. Thank you very much. You are absolutely right ;) . @nuhkoca you can use the ABoutLibraries as fragment, and embed it in your activity. This will then just be the scrolling container and the rest is up to you ;) \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java. @mueller-ma the class path is one of the main classes of the library. basically packagename + class name (sadly java does not allow to check for the existence of a package). @mueller-ma exactly :) the name for it is a bit bad in the xml as it is not the real classpath, but I sadly have no chance to detect a existence of a package. I need a specific class to check for. @kaikreuzer @mueller-ma thank you both!. @Jawnnypoo there's a reason why I have not yet updated to api or implementation the script I use to publish to maven central does not support it yet (at least it did not a few weeks ago) Changing it right now will break my release and publish process :) \nI'll adjust as soon as the publishing works ;) (and I got time to verify that it works)\n. Thank you very much!. fixed it in v6.0.8. thank you very much. Looks good. Thanks for the PR. and sorry for the super late merge... https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/LibsBuilder.java#L83. you have to call that method on your own then. (as the fields can not be auto resolved if the package does not match). as the javadoc says R.string.class.getFields() (with the R of your project) . @flocke please open a PR :). thank you. Thank you. @burakozhan tested and verified that at least the snackbar one works (the others may have no definition file available) . \nBe aware that the ABoutLibraries caches the libs for one version to speed up loading. if you added them without changing verison they won't show up, clear app data, or adjust the version number :). @JosephRoskopfOPI  @j-roskopf thanks a lot for the PR. I will review the changes and get it merged as soon as I can. currently a little bit busy.. Thanky ou very much!. remove the characters int_ of the define. \nlike:\nxml\n <string name=\"define_int_commonsio\" translatable=\"false\" />\nto\nxml\n <string name=\"define_commonsio\" translatable=\"false\" />. Looks good :D. Can you please add the support annotations to fix the build issue?. I am happy to take PRs to improve compatibility.\nThere are currently no plans to adjust this as the dependencies are not stable. Closing this as no action right now. If you'd like to open a PR. I am more than happy to check it out! :). @csensen the error looks like something else might consumed all the memory and the about libraries did not even have a tiny bit memory to replace a string. \nI am pretty sure it is not related to this library as there were no other reports. \nPlease provide more details or more resources if it turns out to be related after all. . Looks good :) \nThanks! . You use a fragment and not the activity make sure your activity style has a proper theme and the proper theme values\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/styles.xml. Thank you so much!. @arpitjindal97 why did you close it?\nSorry for taking a while to answer. . I overlooked the D-Pad PR. You can re-open. I only see one change needed:\nhttps://github.com/mikepenz/AboutLibraries/pull/401/files#diff-d092ffcfeee667a57803020011b88712R17 does not reference a class which could be identified. Did you look at this: https://github.com/mikepenz/AboutLibraries#proguard\nAlso the auto detection might not work if the libraries are obfuscated as there is no way to detect them then. In this case you need to set them up by manually defining the ids of the libs you want to show. Thank you very much @arpitjindal97 I hope I can get it merged the upcoming days. they most likely share the same classpath :/\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_volleyplus_strings.xml#L17\nany sourcefile which is not existing in volley from google but in volleyplus which can be used to identify?. java\n.withLibraries(\"crouton, actionbarsherlock\", \"showcaseview\", \"glide\")\nyou somehow missed to add '\"'  :D\ntry:\njava\n.withLibraries(\"crouton\", \"actionbarsherlock\", \"showcaseview\", \"glide\")\n. Published an update to fix this problem. \nThank you very much. you can build the Intent in the LibsBuilder and apply any launch animation you need :). Licenses are defined similar to this one: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/licence_cc40_strings.xml\nYou can create a new strings resource file with that license from lottie, ensure you have a identifier for it (the above linked file uses 'cc40' as identifier) \nand then you can use it similar to this library (which uses cc30 (as no lib uses cc40))\nhttps://github.com/mikepenz/AboutLibraries/blob/8d1a117e7b1dc9e89f3a19b3ec8bef8992eed7d4/library/src/main/res/values/library_useravatarspack_strings.xml#L18\n. Oh thank you very much. could you please open a PR?. will be in the next release, sorry did not make it into this one. Why withExcludedLibraries with an empty array?. Oh wait. I just saw it. you use aboutlibraries 2.3.0?\nTried this with the latest version of the aboutLibraries and everything works perfectly. \nPlease update to the latest release to get all the newest bugfixes. Hmm I tried with the latest version including that lib and couldn't\nreproduce it in the sample.\nNot sure. Could you modify the sample to showcase the issue please?\nOn Sun, Aug 19, 2018, 10:40 AM Gianlu notifications@github.com wrote:\n\nSomehow, I've written it wrong, I'm using version 6.1.1.\n—\nYou are receiving this because you modified the open/close state.\nReply to this email directly, view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/409#issuecomment-414112914,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ABaGiKEuVik58t2vakgRwGSXhfl7zcEVks5uSSRxgaJpZM4V5gLk\n.\n-- \nMike Penz\n\n\nMike Penz\nAndroid | Backend | Open Source\nmikepenz.com\n. Interesting idea for an enhancement. \nThis will require though that the reflection automatically finds the BuildConfig which might not work as we don't necessarily know the applicationId we could adjust the definition files, but that would result every single file to be adjusted. \nI would still hope that we can figure out a compile time approach, which would detect included libs based on the gradle file, resulting in the latest version, and would help to eliminate included resources, (only resources needed would be included as source) . @Hulcsa thank you very much. @pawegio seems to me like the generic check in the play pre-launch report has some sort of bug, trying to click something in the recyclerview which is not where it expects it :D. @ccomeaux thank you soo much!. How did the issue surface? \nI'd love to reproduce the problem first which you are fixing.. I can not reproduce this issue. Using the sample and  defining additional libraries to show up will correctly work. \nWhat exactly are you trying to do? Which libraries do not show up?. I have updated the 2 def files with non secure github links and updated the def file builder. \nI can't update all other urls though as it would require to check every single page if the https link would resolve. \nI will keep an eye on new definition files for the future to ensure the links are https. Thank you very much for the issue. I'm always happy to merge any PR to further improve this.\nI did a search and replace for GitHub links if it missed some, I'm sorry.\nSeems the ide fooled me in that case.\nOn Sat, Oct 27, 2018, 1:02 PM Jan S. notifications@github.com wrote:\n\nI am sorry but just replacing github links is not what I had in mind. You\neven missed most of the github links as you have not changed github.io\nlinks.\nTherefore I am a bit dissatisfied with your response. I extracted the http\nurls from the XML files and tested them with a little script for https\navailability for each url.\nThe following URLs are available via HTTPS and therefore should be updated:\nhttp://aidanfollestad.com/http://amlcurran.github.io/ShowcaseView/http://apache.orghttp://blog.zhanghai.me/http://chris.banes.me/http://commons.apache.org/proper/commons-csv/http://commons.apache.org/proper/commons-io/http://creativecommons.org/licenses/by/3.0/legalcodehttp://daimajia.comhttp://daimajia.com/http://developer.lge.com/http://developer.lge.com/MOBILE_HELP/index.jsp?topic=%2Flge.mobilesdk.LGQSlide.api%2Fhtml%2FDeveloping%2FDeveloping%2FDeveloping+with+LG+QSlide+SDK.htmhttp://facebook.github.io/rebound/http://fsf.org/http://gmariotti.blogspot.it/http://google.comhttp://h6ah4i.com/http://inthecheesefactory.com/blog/correct-imageview-adjustviewbounds-with-adjustable-imageview/enhttp://jakewharton.com/http://jakewharton.github.io/butterknife/http://jhy.io/http://joanzapata.com/android-iconify/http://jsoup.org/http://koush.com/http://ksoichiro.blogspot.pt/http://ksoichiro.github.io/Android-ObservableScrollView/http://libphonenumber.googlecode.com/svn/trunk/javascript/i18n/phonenumbers/demo-compiled.htmlhttp://luke.klinker.xyz/http://malinskiy.com/http://mikepenz.com/http://mixpanel.com/http://mixpanel.github.io/mixpanel-android/index.htmlhttp://nostra13android.blogspot.co.at/http://opensource.org/licenses/BSD-2-Clausehttp://opensource.org/licenses/BSD-3-Clausehttp://opensource.org/licenses/MIThttp://paymill.comhttp://roomorama.comhttp://satyan.github.io/sugar/http://scripts.sil.org/OFLhttp://site.mockito.org/http://square.github.io/http://square.github.io/dagger/http://square.github.io/okhttp/http://square.github.io/picasso/http://square.github.io/retrofit/http://stfalcon.com/http://su.chainfire.eu/http://svn.apache.org/viewvc/commons/proper/io/trunkhttp://tozny.com/http://trello.com/http://wasabeef.jp/http://www.akexorcist.com/http://www.apache.org/licenses/LICENSE-2.0http://www.apache.org/licenses/LICENSE-2.0.htmlhttp://www.avast.comhttp://www.daniel-stone.uk/http://www.devbrackets.com/http://www.eduardereza.com/http://www.facebook.com/http://www.freepik.comhttp://www.freepik.com/free-photos-vectors/peoplehttp://www.gnu.org/licenses/lgpl-3.0.en.htmlhttp://www.gotev.nethttp://www.jetbrains.orghttp://www.joanzapata.com/http://www.piwai.info/http://www.twitter.com/http://www.wix.com/amulyakhare/portfolio\n—\nYou are receiving this because you modified the open/close state.\nReply to this email directly, view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/416#issuecomment-433611032,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ABaGiHZAxgfMjUDOfGEJm9i50s-VlmOSks5upD1KgaJpZM4XeH-9\n.\n-- \nMike Penz\n\n\nMike Penz\nAndroid | Backend | Open Source\nmikepenz.com\n. Don't take me wrong. I appreciate that you used your script to provide https links. \nAfter all, this is an open source project. Feel free to open a PR to improve things. I am more than happy to merge, great additions. If you do not like the project itself you can also always fork and have your own fork with your own changes. \nI do this all in my freetime. It takes a lot of time and effort to support multiple open source projects and keep them updated. Answering issues, helping people with questions, and hopefully improving. \nAll this beside a full time job which also requires a lot of time. . @tobiasschuerg ah yes. thank you so much.. @athkalia you can theoretically use the Libs class directly and build your own fully custom UI, which will give you all the control. \nRight now the default style can be adjusted for the activity. \nYou can use withActivityTheme()\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/java/com/mikepenz/aboutlibraries/sample/ExtendActivity.java#L19\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/app/src/main/java/com/mikepenz/aboutlibraries/sample/FragmentActivity.java#L75\nSee more details here:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/java/com/mikepenz/aboutlibraries/ui/LibsActivity.java#L29\n. I'd be happy to take a PR to improve this. Perhaps having proper styles for the different components which can then be changed in people's themes. \nSorry for the late answer. The one from google uses the maven POM description info during compile time, and will generate a file which then shows up. in the past tests it missed a lot of libraries. But they do great progress so at some point it might replace this lib. \nWell some libraries might not have the classPath defined, as such it can not try to find it. \nAlso if you have proguard it won't be able to find them. \nWhich libs are missing? Which do show up? \nIf you want to make sure, disable autodetect, and show libs by providing the \"id\" of those you wanna have visible\n. If a library is not available in the definitions a PR would be highly appreciated to add the details. \nYeah as mentioned auto detect works only if it can detect the class file at runtime, anything which makes the class file being named differently, or a change in it, or missing definition of it will result in auto detection not able to detect it. \nAlso another thing which sometimes happens: The R field not being found due to a different package name. so sometimes the R fields have to passed in. (I think that is mentioned in the README tooo). Thank you so much :)\nSorry for the difficulties. . Thank you very much. That's great :). Thank you very much :D . nope. just me finding time to merge and do a release :D. Thank you very much. you can open a PR to add them similar to the LGPL license which are already provided: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/license_lgpl_2_1_strings.xml. I still would love to see a PR for it, I just closed the issue as it is not an issue at least as far as I can see. Either there will be an PR then we will add it, and if not then not :P \nI prefer keeping the issues clean to be able to keep an overview.\nSorry if that confused you. I can reopen if you prefer.\nHmmm well it highly depends on the configuration. theoretically 100% are available if the version is not shown. it always depends on the configuration in the end :/. @mbiebl I am not sure if the layout would look good with so many sections under each other. also it will make them a lot higher than before. \nBut yes you are right. the ui discussion should be on the other ticket. \nI suppose using GPL 3.0 would be in general better. if clicked and the full description is opened that would show the full name then I guess.. Right now there is a a 70% area for the title and a 30% area for the right part\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listitem_opensource.xml#L32\nand 50:50 for the bottom:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/layout/listitem_opensource.xml#L89. btw. you can also just overwrite the listitem_opensource.xml layout (this works still, at some point in the future the build tooling will prevent overwriting for resources (but at that time I will need to introduce an API to do so)) \nSo you could for example put the creator under the libraryName. have it 2 lined. and change horizontal of the container to vertical. Ok that STRING_TOO_LARGE is interesting indeed. some beautiful unnecessary limitation from android somewhere it seems :/. @mbiebl thank you so much that's great!\nI will most likely do the review + merge + release this weekend. \nSounds great :) anything to improve is always appreciated!. Thank you so much again for this PR. Thank you so much!. please add _int to the define name. or it will always show up. even if the library is not used.\n. it should say define_int_mpandroidchart\n(The int defines that this library is inside of the AboutLibraries library and should not be displayed automatically if the xml is found, only if the user chooses to show it)\n. You should also define a classPath. This is a class (the whole packagename inclusive class name) which is one of the main classes inside the library. So the AboutLibraries library can autodetect this one.\n. Should be a specific class. Best a class which will stay the same. like: io.realm.Realm\n. This requires a class which the detector tries to init. retrofit2.Utils should be fine\n. not required in this case.\n. also not necessary\n. also not necessary\n. also not necessary\n. also not necdssary\n. you have a copy paste error here. should be library_LoganSquare too\n. should be define_int_* as like here:\nhttps://github.com/WoogieNoogie/AboutLibraries/blob/19167939b4ffccb09ada141d1dd46904e96d9d53/library/src/main/res/values/library_sugarorm_strings.xml#L3\n. should be define_int_* as like here:\nhttps://github.com/WoogieNoogie/AboutLibraries/blob/19167939b4ffccb09ada141d1dd46904e96d9d53/library/src/main/res/values/library_sugarorm_strings.xml#L3\n. This should be the description of the library. not the license. \n. please escape the ' in the text as this is not allowed in android strings. \n. the classpath should reverence to a specifci class not just to a package\n. I don't think using a \".\" is a good idea. I haven't tried it to be honest. But til now there were non mit \".\"'s  :D\n. please change the classpath to reference a specific class file, as it's not possible in java to check if a package exists. Just use one of the main classes. should be fine.(the same please also for the second lib)\n. still everywhere define_int_context_menu.android and not define_int_context_menu_android\n. Just set this to the LibsActivity by default. So you can remove the nullcheck on the bottom. \n. add annotation notnull\n. remove nullcheck as proposed above\n. please add _int to the define definition. \nwithout _int those libs will always be displayed. \nIt should look like this: https://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_activeandroid_strings.xml#L4\nPlease also do this for the other 2 libs\n. I think this should be just named about_libraries_divider_description. What do you think?\n. right. but I think it makes more sense and the dark would just be obsolete\n. \"_int\" fehlt :D. oh one more thing. the identifier \"avatar_view\" does not make much sense for this lib. In addition it duplicates with the existing \"avatar_view\" library. This seems to be wrong. Well the support annotations are IDE only, So I assume this won't end up in the app?. Well then it's fine :). I guess it might be personal preference to include or not include it :). But having it in is better than not. Thank you. ",
    "gabrielemariotti": "Good to know. Thanks!\n. ",
    "lyio": "I have more if you are interested. Wanted to test the waters first ;)\n.  I also have a Python script to generate the skeleton of those files. It's rather crude and I have no idea, where to put it. \n.  Coming up tomorrow...\n. Funny you should say that... I already made a change to how you're Activity works. \n. https://github.com/lyio/AboutLibraries/commit/038ef89205fc6d63eba7028aab0cc8717f35230f\n. Just a small hacky change I needed...I don't think this is pull request material \n. ",
    "thedumbtechguy": "wow, can't believe I didn't even think of that. Anyway, I ended up using a noTitleBar theme for the activity. Makes it look better for me\n. ",
    "krossovochkin": "I faced the same issue. Deleting items, defined with manually added definition file, from BUNDLE_LIBS works for me.\n. @mikepenz yes, I can. Maybe libraries I used are specific at some vision, but I think it doesn't matter =)\nCreating pull request to your project is simpler, because you can add them faster, I think. But in this case these descriptions will be unconfirmed by libraries creators.\nI think best way is create pull requests to your library and to original libraries.\nBut the question: if the same library has description in AboutLibraries and in original library: will these descriptions be duplicated on a AboutLibraries screen?\n. @mikepenz OK, I've got it. Then I will create pull requests to original libs first :)\nThank you for answers)\n. @mikepenz yes, of course, it's awesome :)\n. Got it, thanks)\n. ",
    "michaelcarrano": "@mikepenz perhaps we can work together on this? \nI started a project called Detective Droid that automatically detects libraries used in apps on a user's device.\n. @mikepenz absolutely, not a problem. Let me know where I can help out.\n. @mikepenz I will take a closer look later at your auto detect changes in a bit.\nI'm wondering, is there a way we can combine our efforts around the libraries? I know for my project, researching the libraries is something that is very time consuming.\n. ",
    "thunsaker": "@mikepenz oop, completely skipped over that. File removed.\n. @mikepenz RE: classPath I guess I didn't understand exactly how it was to be used. Thanks for making a very useful library!\n. ",
    "kashban": "you're welcome. When will the patch be available through Maven Central?\n. @mikepenz sure, i'm always open for simplicity. I didn't know if any naming convention was used on library names, so i took the one from the CC lib page. Let it be cc30 then.\n. @mikepenz Done.\n. You're welcome. I will add more library defs when appropriate. \n. Ok, cool. I will upgrade with the next version of my app. Thanks!\n. ",
    "yoavst": "4.3 and not fixed...\n. @mikepenz another way to fix that is:\ngroovy\ncompile('com.mikepenz.aboutlibraries:library:4.3.5@aar') {\n        transitive = true\n    }\n. In my app I got dynamic theme based on the user selection, so I need to specify it using Java.\n. Sorry, I don't know how to send a pull request of specific commit.\n. that what one of the library_materialnavigationdrawer_strings.xml contains:\n``` xml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n\n Author section \nFabio Biola\nhttps://github.com/neokree\n Library section \nMaterialNavigationDrawer \nNavigation Drawer Activity with material design style and simplified methods\nhttps://github.com/neokree/MaterialNavigationDrawer/wiki\n1.1\n OpenSource section \ntrue\nhttps://github.com/neokree/MaterialNavigationDrawer\n ClassPath for autoDetect section \nit.neokree.materialnavigationdrawer\n License section \napache_2_0\n Custom variables section \n\n```\n. tried define adding with and without the int, and with and without the autodetect. but same results.\n. :/\n. should be so much hard. in intellij you can add a constructor with that paramaters, and then convert it to builder pattern.\nctrl+alt+shift+t on the constructor, then replace with builder pattern,\n. adapter is great idea since you can add custom animation ;)\n. ``` xml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n\n Author section \nLG Developers\nhttp://developer.lge.com/\n Library section \nQSlide\nLG QSlide is the feature on LG smartphones to provide an application with multi-tasking using floating window and quick execution using Notification bar.\nhttp://developer.lge.com/MOBILE_HELP/index.jsp?topic=%2Flge.mobilesdk.LGQSlide.api%2Fhtml%2FDeveloping%2FDeveloping%2FDeveloping+with+LG+QSlide+SDK.htm\n\n OpenSource section \nfalse\n License section \napache_2_0\n Custom variables section \n\n```\n``` xml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n\n Author section \nGoogle\nhttp://google.com\n Library section \nLibPhoneNumber\nGoogle\\'s common Java, C++ and Javascript library for parsing, formatting, storing and validating international phone numbers. The Java version is optimized for running on smartphones, and is used by the Android framework since 4.0 (Ice Cream Sandwich)\nhttp://libphonenumber.googlecode.com/svn/trunk/javascript/i18n/phonenumbers/demo-compiled.html\n7.0.1\n OpenSource section \ntrue\nhttps://github.com/googlei18n/libphonenumber\n ClassPath for autoDetect section \ncom.google.i18n.phonenumbers\n License section \napache_2_0\n Custom variables section \n\n```\n``` xml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n\n Author section \nAnton Malinskiy\nhttp://malinskiy.com/\n Library section \nMaterial Icons\nandroid-material-icons allows you to include any of the Material Design 1.0.1 icons by Google packed by Sergey Kupletsky in your texts, your ActionBar, and even in your EditTexts. Icons are infinitely scalable, and customizable with shadows and everything you can do on texts.\n\n1.0.1\n OpenSource section \ntrue\nhttps://github.com/Malinskiy/android-material-icons\n ClassPath for autoDetect section \ncom.malinskiy.materialicons\n License section \napache_2_0\n Custom variables section \n\n```\n``` xml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n\n Author section \nLG Developers\nhttp://developer.lge.com/\n Library section \nQCircleDesignTemplate\nThe LG QCircle design template library provides the layout designs and basic UI elements through API, enabling developers to save time designing and using repetitive tasks. The LG QCircle design template library provides various circle layouts and receives QuickCircle broadcast intents, adjusts layout position, and handles back button operation.\nhttps://github.com/LGDeveloper/QCircle-Design-Template/wiki\n\n OpenSource section \ntrue\nhttps://github.com/LGDeveloper/QCircle-Design-Template\n ClassPath for autoDetect section \ncom.lge.qcircle.template\n License section \napache_2_0\n Custom variables section \n\n```\n. ",
    "ThomasdenH": "In the instance of Google Play Services, the used license may change in future versions, and therefor should be obtained by that method. It would of course be possible to update the license with every change yourself, though, so while not necessary, it would certainly be handy.\n. I can imagine a library description being added programmatically, but it's mainly the license. Adding a new Library object to the adapter might be enough.\n. Great. Thank you.\n. ",
    "johnjohndoe": "Can you please also add the tags for releases such as v.3.0.4 listed here?\n\nMaven release is still missing, because it won't allow me to update the lib\n\nWhat do you mean by this?\n. Maybe, try jCenter.\n. Some tags are still missing in the repository, those for example v.3.0.x.\n. Adding the tags is easy and does not take much time. Take your time whenever you have some:\nsh\n$ git checkout $SOME_HASH\n$ git tag -a \"v.3.0.4\" -m \"Short changelog description.\"\n$ git checkout master\n$ git push --tags origin master\n. Some of the releases do not have any changelog summary. It would be nice if you could add them.\n. I am pretty sure there are a large number of projects which cannot update due to dependencies they use. - In my case I am working on it but at the moment I cannot.\n. I will try v.3.0.4 which appears to be the last version before you updated the support libraries to v.21.\n. Awesome!\n. :+1: \n. Good intention but please do not squash commits together that are no contextual related. The bugfix is one thing, project updates another, and library additions are worth a separate commit too. The commit 1d40c91945cc7ba0ab36294ee4d2452388745585 is way to unreadable.\nAlso you updated the target SDK in this commit which hinders people from using the library with their v.20 project. I suggest you maintain a v.3.x.x branch which stays with the v.20 and gets all bugfixes which are applied to the master branch. Additional features such as library additions are a nice benefit but not necessary.\n. Please feel free to rewrite the commit and divide it and force push the branch. I prefer a readable history over a squashed commit.\nWith regards to contributions I am fine with pull requests - but thank you for the invitation.\n. Much better :) The last two commits are not 100% clean - the separate contexts are:\n- Update Gradle plug-in to v.0.14.2. and deprecated configuration such as runProguard.\n- Update build tools to v.21.1.1.\n- Prepare new release v.3.0.5.\n. Jeap. :)\n. The tag for v.3.0.5 is missing.\n. @mikepenz OH. It sits at the wrong commit - it looks like it is the \"squashed\" commit that was there earlier. You have to delete and add it again to 0b73d68d7f3eccb4cd00045ea4703f86446c9f0e. You can best see it via gitk --all.\n. The build is clean and the installation is fresh on the device. The error occurs at runtime.\n. Can you try it with the old version. Also try it as a external definition file with the new and old release.\n. Looks good. Might be needed for other onClickListener too.\n. Understood. Thank you.\n. Works nice on Android 2.3.5 and 4.4.4. Thank you.\n. You would have to change POM_ARTIFACT_ID, that is correct.\nOther advantages: I would like to hear other people's opinion on that. I just found it disturbing when I use multiple libraries which are not named explicitly. For me it is a kind of convenience to have a named and versioned artifact rather then a technical problem. Just imagine a library.jar sits in the libs/ folder with all the other libraries - it is very hard to guess its name or even its version. - But as I said: do not take my words as best practice.\n. :+1: \n. I would highly suggest that you parse the version numbers from build.gradle at compile time instead of run time. Nobody wants to slow down her app when this can be handled beforehand.\nAnother project which deals with evaluating dependencies is Gradle View. Please have a look.\n. Any progress on this?\n. ",
    "tprochazka": "This plugin\nhttps://github.com/ben-manes/gradle-versions-plugin\nis able to detect latest version of all dependencies directly from the maven repos.\nSo the same mechanism can be used to detect libraries version.\nBut. I don't understand why this library should do this. I think that version of the library is irrelevant.\nName of the lib and author, web, licence name and url to licence is enough, I think ;-)\nI see also future problem that you are using strings.xml for the configuration, because string.xml is not compressed inside of APK because of fast access, so the library will be relative huge in the future.\n. ",
    "RobertFischer": "Hey there. I'm the author for Gradle Versions plugin. I wrote it because we needed that information for legal at $BIGCORP. Pretty much everything you need is in the pom file, assuming it's well-written. If it's not, a quick look inside jars for various well-known license file is easy to do. Theoretically, you could check for the license files at runtime, and parse out what you can from the jar file's manifest file, but the pom file approach just seemed a lot simpler.\n. ",
    "manjunathc23": "+1\n. Awesome!  Is it available in prod?\nThanks a lot for the all the support and help. \nThank you @mikepenz  @PDDStudio \nThanks!\nManju\n. Sounds good thanks!\n. Tested it works all good! Thanks @mikepenz  @PDDStudio \n. ",
    "tehfonsi": "two possible solution:\ntextView.setMovementMethod(LinkMovementMethod.getInstance());\nor\nandroid:autoLink=\"web\"\ndepends if you want to set it in your code or in xml.\ncheers\n. sweet :)\n. ",
    "Rainer-Lang": "Is it possible to add this in the README? ;-)\n. java\n.replace(\"\\n\", \"<br />\");\nDoesn't work for me - no new line.\njava\n<br>\nalso.\n. From resource and then i have some replace. \n=> i use a string\nAm 24. Feb. 2015 19:57, um 19:57, Mike Penz notifications@github.com schrieb:\n\nYou've set your content as resource?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/mikepenz/AboutLibraries/issues/65#issuecomment-75821306\n. No it's only a string. \n. Please make separate methods to set color for the buttons. Thanks. ;-)\n. @mikepenz OK. Thanks for the info.\n. I would make a button at bottom \"close\".\n. I would really prefer to have this button.\n. You have free space to the border at the left and the right. Maybe make the buttons wider.\nThe cards below are using more width.\nYou could see this also on the screenshots of your project here on github.\n. Good idea \n. @irobotman That's nothing related to this library.\n. On Wednesday when I'm back. \n. For my understanding - no. \n. Will do it. Of course. \n. Sure that you don't want to make a pr? \n. Butterknife should be, yes. Strange. \nMaybe you could provide the libs which aren't detected. \n. Please make a PR. Thanks. . I don't know which libs are inside, but I'll have a look in the next days. . @Scrounger I made a commit.. Try to increase versionCode or reset app data. . https://github.com/mikepenz/AboutLibraries/pull/297. changed. thanks. I'll look into it... . @mikepenz I know I'm fixing it. :). @rubengees Thanks for this issue.. ok - will do\n. ok - will do\n. yes of course :)\n. \n",
    "jkane001": "Ah, good call on the bug fix.\nAs far as the auto-detection, it worked for me without having to explicitly\ncall out those libraries, so I'm not sure what you mean.\nI also an not sure it's necessary to list those libraries on the about\npage, but seems better to err on the side of caution, what with Google's\npropensity toward pulling apps from the store with no warning.\nBTW, I spent some time last night looking into auto-detecting version\nnumbers, and it seems it's not really possible, so I guess that feature\nrequest is dead in the vine. :)\nThanks,\nJ\nOn Mon, Feb 16, 2015, 1:27 AM Mike Penz notifications@github.com wrote:\n\nYeah i've looked over the 5 new libraries, they seem accurate. I'm still\nnot sure if it's required or necessary to include the google support\nlibraries, but it's nice to have a definition file for those. In fact they\nwon't be auto-detected, and you have to pass them in the builder.\n.withLibraries(\"AppCompat\", \"GooglePlayServices\")\nTalking about the second change. I see your point, but the fix you've\nprovided is not correct. The ViewHolder itself should be static that's\nfine. The issue is somewhere else.\nThe problem is in the onBindViewHolder method\nTo be correct it's in this part of the method.\n//Set License or Version Text\n            if (TextUtils.isEmpty(library.getLibraryVersion()) && library.getLicense() != null && TextUtils.isEmpty(library.getLicense().getLicenseName()) || (!showVersion && !showLicense)) {\n                holder.libraryBottomDivider.setVisibility(View.GONE);\n                holder.libraryBottomContainer.setVisibility(View.GONE);\n            } else {\n                holder.libraryBottomDivider.setVisibility(View.VISIBLE);\n                holder.libraryBottomContainer.setVisibility(View.VISIBLE);\nif (!TextUtils.isEmpty(library.getLibraryVersion()) && showVersion) {\n                holder.libraryVersion.setText(library.getLibraryVersion());\n            }\n            if (library.getLicense() != null && !TextUtils.isEmpty(library.getLicense().getLicenseName()) && showLicense) {\n                holder.libraryLicense.setText(library.getLicense().getLicenseName());\n            }\n        }\nas you can see, i check if the version is not empty, if it is i won't set\nthe new text. I have to add an else block like this:\nelse {\n   holder.libraryVersion.setText(\"\");\n}\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/pull/63#issuecomment-74464939\n.\n. Creating new PR without the bug fix\n. This turns out to be a problem with my app - too many methods (http://developer.android.com/tools/building/multidex.html).\n\nI've taken care of that, and now I can add AboutLibraries successfully.\n. ",
    "rubengees": "As seen here: http://www.google.com/design/spec/components/dialogs.html#dialogs-simple-dialogs\nsimple Dialogs like those in the library shouldn't have a explicit close button.\n. Those Libraries don't show up. Any idea why?\n. Can it be any random class from the lib?\n. I hope it's correct this time... :)\n. Whoops, I saw a mistake. \n. Sorry, here is the fix https://github.com/mikepenz/AboutLibraries/pull/132\n. I looked a bit through the layouts, they seem to be correct. I think that might be an Android issue or something, it happens on no other device I have tested this against either. https://code.google.com/p/android/issues/detail?id=13895 maybe it's this bug?\n. Well, it was never a real problem, as it is really unlikely to happen, so i'll close this. I just wanted to show it if you maybe would have wanted to look for a solution.\n. Please check if I added the custom Licence for Glide correctly. I'm not so sure about that... :D\n. Ahh I found it. I created an internal file with your generator, but I needed an external one... \n. Haha sorry for this pointless Issue... :D\n. Doesn't work unfortunately...\n. Yeah. Really weird. You can look through the project if you want: https://github.com/RubenGees/Vocabletrainer\nMaybe it's some issue with the build tools or proguard itself.\n. Did you found anything about that yet? I tried it with a somehow fresh project - same problems.\n. No it doesn't. Here is a complete fresh project with minimal configuration. If you build the release, the problem occurres: https://github.com/RubenGees/AboutLibrariesTest\n. Hmm, okay I see. I'll go with the manual definition then... \nHow do I turn off the autodetection then (as it wastes processing power)? And does that affect the libs with definitions inside them?\n. Great, thank you once again!\n. Yep. There is only the compile-time based approach left.\n. Works great, thank you!\n. Oops sorry about the duplicate...\n. Whoops, didn't look out for those.\nBut fixed.\nMaybe add checks to the generator website you have?\n. I added another lib which is use, but forget to initially include in this PR.\n. I had success with this:\nproguard\n-keepclasseswithmembers class **.R$* {\n    public static final int define_*;\n}\nThis only keeps the definitions used by AboutLibraries for autodetection but no other Strings.. Hmm, no it works out of the box in my case. Maybe proguard intelligently recognizes the usage by the library? I do not use shrinkResources, but only proguard itself though.. Just tried it with shrinkResources enabled on my project, that works.. Yes, here here are the proguard rules: https://github.com/proxer/ProxerAndroid/blob/master/app/proguard-rules.pro\n\nAlso since this keeps the whole R class, I'm not sure if this will be better than the original rules\n\nI am not a proguard expert so this may be true. It did help me avoid the 65k field reference limit though,  which popped up due to another lib (I only had the rule to keep entire R from the README before).\n@mikepenz \n\nIt can't as those are loaded during the runtime.\n\nAs far as I know, proguard is able to recognize patterns of Strings when using reflection and keeps those in the resources. If that is the case, I do not know, why the define_ statements does not get keeped.... @AllanWang \nFrom the proguard documentation:\n-keepclasseswithmembers [,modifier,...] class_specification\nSpecifies classes and class members to be preserved, on the condition that all of the\nspecified class members are present. For example, you may want to keep all\napplications that have a main method, without having to list them explicitly.\nI think that means that entire R does not get keeped, but only the fields we use or specify with this rule.. I just decompiled my app and the R file is really small. I think it works the way we want to (I could be mistaken of course).. @AllanWang My pleasure :)\n@mikepenz I could send a PR if you like. . Anything left to do here for me? :slightly_smiling_face: . Okay, no problem! :+1:. Ah! Forget about those, fixed ;)\n. ",
    "Shajeel-Afzal": "Sorry not sure what is wrong but it is not opening for me :(. Thanks. \n. @mikepenz i will check. But can you please tell me how can i add new libraries? I am assuming that the solution is avaialbe on http://def-builder.mikepenz.com/ but since it is not opening atleast in my country, can you please give the solution here?\n. ",
    "jedrivisser": "Thanks, will give it a try.\n. Stating it manually works well thanks. Was hoping there was some kind of\nProguard rule to keep the information for automatic detection.\nOn 20 Apr 2015 7:09 PM, \"Mike Penz\" notifications@github.com wrote:\n\n@theenderer https://github.com/theenderer any luck?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/78#issuecomment-94511275\n.\n. Yea would not be worth it. Thanks for the responses, and the awesome\nlibrary.\nOn 20 Apr 2015 8:37 PM, \"Mike Penz\" notifications@github.com wrote:\n@theenderer https://github.com/theenderer you will have to exclude each\nsingle lib so proguard would not change their package names. but i think\nthis is unnecessary.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/78#issuecomment-94524828\n.\n. \n",
    "alorma": "Why not? Can show the icon in a big size, or use as easter egg launcher...\n:p\nOn Tue, May 19, 2015, 23:56 Mike Penz notifications@github.com wrote:\n\n@alorma https://github.com/alorma any real advantage of this?\n\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/83#issuecomment-103679474\n.\n. Ups, sorry for that, i edited from web :P\n. \n",
    "ppamorim": "You're fast too.\nJitPack is faster than me and you together. :3\n. ",
    "shayousefi": "@mikepenz Indeed it is a platform bug, so it can be ignored:\nhttps://code.google.com/p/android/issues/detail?id=173789\n. ",
    "nanopc": "Thanks to you! ;)\n. ",
    "wKovacs64": "Closing and resubmitting to develop branch.\n. Closing and resubmitting to develop branch.\n. Fixed leak in 3023566 and restored some flexibility in 89ccc8c.\n. ",
    "Aqua-Ye": "Sorry, it seems to work :)\n. @mikepenz here\n\n. The def file is already included in the library. See https://github.com/castorflex/SmoothProgressBar/blob/master/library/src/main/res/values/about_libraries_def.xml\n. 👍 . ",
    "jgindin": "When do you think you'll release a new build?\n. Would you like me to do that for this review? Or just for future? Either way works for me.\n(And, I'll take this opportunity to thank you for some great libraries!)\n. I tried that, but since there are changes on master which are not in the develop branch (such as the last commit I made, adding the libraryComparator field to LibsBuilder) it didn't work.\nI think I'm just missing something about this workflow... can you point me at some reading? I'll go figure it out and then submit a new pull request.\nSorry for the gyrations here...\n. Thanks! All taken care of!\n. ",
    "fentino": "Hi Mike, sorry!\nNow on develop.... I close the other pull request.\n. ",
    "stleusc": "Sweet... thanks!\n. ",
    "jayakanthang": "Hi, What should I do if I want to include this lib as gradle dependency?\nSent from my iPad\n\nOn 12 Jul 2015, at 6:51 pm, Mike Penz notifications@github.com wrote:\n@jayakanthang this library does not contain the com.fima.cardsui project. just the sample project.\nit seems you did not setup the lib with the gradle dependency for your project?\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "AmiableAnteater": "Hmm - I'm running the demo app on my Kitkat Device and I don't see the\nlicense name.\n@andreaszielke https://github.com/andreaszielke if you click on the\nlicense name inside the AboutLibraries library it will display the license\ntext. is this false?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/124#issuecomment-122275750\n.\n. Ah, cool. Thanks for your guidance.\nAm 17.07.2015 20:01 schrieb \"Mike Penz\" notifications@github.com:\n\nit is a property and has to be activated separately\nYou can find it in the Manifest Activity\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/124#issuecomment-122358878\n.\n. \n",
    "Mek0n": "Thanks for the quick response, I may have not made myself clear enough...\nFor example I am using PDFJet within my app so I create the following in values.\nxml\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<resources>\n    <string name=\"define_PDFJet\"/>\n    <!-- Author section -->\n    <string name=\"library_PDFJet_author\">Innovatics Inc.</string>\n    <string name=\"library_PDFJet_authorWebsite\">http://pdfjet.com/</string>\n    <!-- Library section -->\n    <string name=\"library_PDFJet_libraryName\">PDFJet</string>\n    <string name=\"library_PDFJet_libraryDescription\">The Premier Cloud and Mobile PDF library for Java and .NET</string>\n    <string name=\"library_PDFJet_libraryWebsite\">http://pdfjet.com/</string>\n    <string name=\"library_PDFJet_libraryVersion\">5.51</string>\n    <!-- OpenSource section -->\n    <string name=\"library_PDFJet_isOpenSource\">true</string>\n    <string name=\"library_PDFJet_repositoryLink\">http://pdfjet.com/</string>\n    <!-- License section -->\n    <string name=\"library_PDFJet_licenseId\">bsd_3</string>\n    <!-- Custom variables section -->\n</resources>\nwhen proguard is Not enable it shows fine, if it is the this library is not displayed.\nMany thanks\n. @mikepenz  I changed it to <string name=\"define_PDFJet\">PDFJet</string> and it still does not show.\n. @mikepenz I tried that to no avail, however I should have thought of this front the start (so sorry about all the noise)  in adding -keep class com.mikepenz.aboutlibraries.** { *; } to the proguard config, that resolves my issue.\nMany thanks for your help and great library.\n. ",
    "JordanGout": "I missed this event on the listener. Thank You.\n. I've changed the classpaths to a real class.\nI also changed the classpaths of crashlytics and facebook because there are out of date.\n. In development obfuscating is disable.\nThe Gson class didn't change (com.google.gson.Gson)\nHere my code to launch AboutLibraries :\nnew LibsBuilder()\n.withFields(R.string.class.getFields())\n.withActivityStyle(Libs.ActivityStyle.LIGHT)\n.withAutoDetect(true)\n.withAboutIconShown(true)\n.withAboutVersionShown(true)\n. I try to add library_XXX_strings.xml files without any change except define_int_XX become define_XX\nAll libraries are now present so there is a problem with detection :/\nI check (Gson, Picasso, Crashlytics, StickyHeader) classpaths everything is good. I do not use the same classpath for Facebook\n. Ok, thanks.\n. All libraries are detected with a new version code (including crashlitycs)\nThank you for this advice ;)\n. ",
    "vanniktech": "Hmm I can't find the com.facebook.FacebookSdk class. I'm using 'com.facebook.android:facebook-android-sdk:3.22.0' Is FacebookSdk only present in 4 and above?\n. I found one issue, you'll get a PR in a few moments. #134 \n. I tried it out with the sample app, so you're saying that I should just increase the versionCode and remove the 'fix'?\n. I changed the versionCode in the sample library to 521 with the facebook change and it still did not recognize the library.\n. Yes exactly. Obviously you have to add the Facebook SDK to the sample project though.\ncompile 'com.facebook.android:facebook-android-sdk:3.22.0'\n. Oh okay nice you changed it. It does work indeed now.\n. Hmm I still can't see it.\n. Hmm okay fair enough then mvnrepository has some sync issues. Anyway, thanks.\n. Well better a small and compact one than a huge one. Anyway you're welcome\n. Alright thank you very much. If I find the time, I'll add some other new libraries to this project as well.\n. Yup those are just annotations but as far as I know you still have to include their license if you use them during development. Also I think they do show up in the final dex file and don't get compiled away.\n. @mikepenz yup they are my libraries. Thanks for the advice. I just pushed it with https://github.com/vanniktech/VNTNumberPickerPreference/commit/7c2736f5b42a32e30becca1dd58dd8efa35a5391\n. Thanks.\nFixed with https://github.com/vanniktech/VNTNumberPickerPreference/commit/c43f974c4f49e96e423026f692a0537226fdfad2\n. Pushed with https://github.com/vanniktech/VNTFontListPreference/commit/1d395f69dbeaace184d5d001898dd90b6087c3b2\n. Fixed with https://github.com/vanniktech/VNTFontListPreference/commit/3bb31383463202223005a4037e055c92ab8b6188\n. ",
    "bauerj": "I'm using the current Version 5.1.1.\nAs I'm currently just doing development build, proguard is not yet enabled.\n. Thanks you :+1:\nAlso thanks for this great library :smile: \n. ",
    "AngleV": "Never mind i found another way to implement my needs\n. @mikepenz \nYes after more investigation i find out that its nothing to do with AboutLibraries.\nBut if someone implements this inside a stack fragment he will get the same effect.\nThe problem has to do with the Intent.ACTION_VIEW\njava\nIntent intent = new Intent(Intent.ACTION_VIEW, Uri.parse());\nfragment.this.startActivity(intent);\nBut i can figure out how to solve it\n. @georgeherby \nread this \nhttps://github.com/mikepenz/AboutLibraries/wiki/HOWTO:-Style#colorsxml\n. @mikepenz \nno  nothing at all !!!\n. Dear @mikepenz  sorry for the inconvenience.\nit was my bad. Your code works perfectly !\nthanks \n. honestly...two many hours of coding was the issue :D\n. awesome !\nlooking forward for the new release :D\n. You rock mate !!! :+1: \n. i am trying to implement it like this \n``` java\n.withUiListener(new LibsConfiguration.LibsUIListener() {\n                                    @Override\n                                    public View preOnCreateView(View view) {\n                                        return null;\n                                    }\n                                @Override\n                                public View postOnCreateView(View view) {\n                                    return null;\n                                }\n                            })\n\n```\nand i get i NullPointerException\nBuild version: 1.0.1 \nBuild date: 2015-11-03 00:36:20 \nCurrent date: 2015-11-02 17:37:58 \nDevice: Genymotion Samsung Galaxy S3 - 4.3 - API 18 - 720x1280 \nStack trace:  \njava.lang.NullPointerException\n    at com.mikepenz.aboutlibraries.ui.LibsFragment.onCreateView(LibsFragment.java:209)\n    at android.support.v4.app.Fragment.performCreateView(Fragment.java:1965)\n    at android.support.v4.app.FragmentManagerImpl.moveToState(FragmentManager.java:1078)\n    at android.support.v4.app.FragmentManagerImpl.moveToState(FragmentManager.java:1259)\n    at android.support.v4.app.BackStackRecord.run(BackStackRecord.java:738)\n    at android.support.v4.app.FragmentManagerImpl.execPendingActions(FragmentManager.java:1624)\n    at android.support.v4.app.FragmentManagerImpl$1.run(FragmentManager.java:517)\n    at android.os.Handler.handleCallback(Handler.java:730)\n    at android.os.Handler.dispatchMessage(Handler.java:92)\n    at android.os.Looper.loop(Looper.java:137)\n    at android.app.ActivityThread.main(ActivityThread.java:5103)\n    at java.lang.reflect.Method.\n. Yeah you are right return null it gives null and nothing more :D\nYou mean like this ??\n```\n.withLibsRecyclerViewListener(new LibsConfiguration.LibsRecyclerViewListener() {\n                                /**\n                                 * OnBindHeaderViewHolder called after the headerView was filled inside the recyclerViews onBindViewHolder method\n                                 *\n                                 * @param headerViewHolder\n                                 */\n                                @Override\n                                public void OnBindViewHolder(LibsRecyclerViewAdapter.HeaderViewHolder headerViewHolder) {\n\n                                }\n\n                                /**\n                                 * OnBindViewHolder called after the item view was filled inside the recyclerViews onBindViewHolder method\n                                 *\n                                 * @param headerViewHolder\n                                 */\n                                @Override\n                                public void OnBindViewHolder(LibsRecyclerViewAdapter.ViewHolder headerViewHolder) {\n\n                                }\n                            })\n\n```\ni think i need some sleep :|\n. Ok i got !!!\nMany thanks !!!\n. ",
    "randombyte-developer": "Thanks for replying so fast! As I can see, you fixed it right now(but it has to be pushed to maven). \n. Yeah, I did this(also with support lib and appcompat).\n. ",
    "ghost": "@AngleV thank you sir :) sorry for being a bit thick and not finding that!!\n. HI,\nI love AboutLibraries. In the past it was easy to replace V4 Fragments with\ncurrent Fragments (v11). But since last version (async task change) i am\nunable to change the source. Try to change getContext to getActivity, but\nget runtime error (in both cases). All my apps use the current/v11 fragment\nmanager. V4 fragments are not compatible with current fragment manager. The\nnew code runs smooth (sample app) but can't get it to run (in my apps).\nsome hints?\nThanks,\nMario\nMike Penz notifications@github.com schrieb am Mo., 2. Nov. 2015 22:22:\n\n@MAndretti https://github.com/MAndretti sorry but i stay with API Level\n10, as many devs still support apps down to API 10.\nAs an additional note most apps also come with the appcompat-v7 library\nwhich has the support-v4 as dependency, so those also support the\nv4.Fragment.\nWhat usecase do you have that you can't use v4 fragmet?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/170#issuecomment-153160752\n.\n. @mikepenz \ni use Linux, Android Studio 1.5 and your current lib. Error. (Google image and genymotion - different API Level).\nIf i use Windows Android Studio 1.4 and your cuurent lib, works fine (Google image - defferent API Level).\n\nif i use Linux, Android Studio 1.5 and your lib (old version). works fine. (Google image and genymotion - different API Level).\nIf i copy the latest source into my project, i get no error. But the Fragment is empty.\nI am very confused.\nAll i need is a Fragment, with transition an no scatter ...\nRegards,\nMario\n. @mikepenz \nthe crash log, ...\njava.lang.RuntimeException: An error occured while executing doInBackground()\n     at android.os.AsyncTask$3.done(AsyncTask.java:304)\n     at java.util.concurrent.FutureTask.finishCompletion(FutureTask.java:355)\n     at java.util.concurrent.FutureTask.setException(FutureTask.java:222)\n     at java.util.concurrent.FutureTask.run(FutureTask.java:242)\n     at android.os.AsyncTask$SerialExecutor$1.run(AsyncTask.java:231)\n     at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1112)\n     at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:587)\n     at java.lang.Thread.run(Thread.java:818)\n  Caused by: java.lang.NullPointerException: Attempt to read from field 'java.lang.Boolean com.mikepenz.aboutlibraries.LibsBuilder.aboutShowIcon' on a null object reference\n     at com.mikepenz.aboutlibraries.LibsFragmentCompat$LibraryTask.doInBackground(LibsFragmentCompat.java:91)\n     at com.mikepenz.aboutlibraries.LibsFragmentCompat$LibraryTask.doInBackground(LibsFragmentCompat.java:64)\n     at android.os.AsyncTask$2.call(AsyncTask.java:292)\n     at java.util.concurrent.FutureTask.run(FutureTask.java:237)\n     at android.os.AsyncTask$SerialExecutor$1.run(AsyncTask.java:231) \n     at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1112) \n     at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:587) \n     at java.lang.Thread.run(Thread.java:818)\n. @mikepenz\ndevices: Nexus 4, Nexus 5, Nexus 5x, Nexus 6, Nexus 7\nemulator: Google and Genymotion\nAndroid version: 5.0, 5.1, 5.1.1 and 6.0.0\nChipset: Intel\nOS: Linux (not OK)\nOS: Windows (OK)\nThe best result was an empty Fragment/View ...\n. @mikepenz \nThe old version (< #170) works fine ... Always ...\nRegards,\nMario\n. @mikepenz\ntest on Android 5.0, 5.1 and 6.0 (Google-Image and Genymotion) looks good. No error :)\nThe animation could be a bit smoother (at first call).\n. @mikepenz thanks for the quick response :) A bit confused what you mean? Where should i be using the supportFragment method..? \n. Hmm.. i appear to be having a bad day.. the LibsSupportFragment and SupportFragment neither can be resolved. Im using Fragments not v4 Fragments (Sorry to be a real main in the ass)\nLibsSupportFragment fragment = new LibsBuilder()\n                                        .withAutoDetect(true)\n                                        .withAboutIconShown(true)\n                                        .withActivityStyle(Libs.ActivityStyle.LIGHT_DARK_TOOLBAR)\n                                        .withAboutVersionShown(true)\n....\n.supportFragment();\n. @mikepenz Thanks you sir! As i said i thought it was something stupid! i was still on 5.2.6\n. Thanks @mikepenz however I even reproduced strings like they were in R.string.class.getFields() and then loaded again them into withFields(String.. fields). But without success.\nI had to do a hack. \nFirst I found out libs defined names (working in debug). \n/*Libs libs = new Libs(getActivity());\n                ArrayList<Library> externLibraries = libs.prepareLibraries(getActivity(), GenericsUtil.getFields(getActivity()), null, true, true);\n                for (Library lib : externLibraries) {\n                    Log.d(TAG, lib.getDefinedName());\n                }*/\nThen I added that names into withLibraries method.\nnew LibsBuilder()\n        .withAutoDetect(false)\n        .withLibraries(\n                \"AboutLibraries\",\n                \"AndroidIconics\",\n                \"fastadapter\",\n                \"gson\",\n                \"LeakCanary\",\n                \"OkHttp\",\n                \"okio\",\n                \"appcompat_v7\",\n                \"design\",\n                \"recyclerview_v7\",\n                \"support_v4\"\n        )\n        //.... ",
    "PDDStudio": "@manjunathc23 you're welcome! Hope it helps\n@mikepenz thanks for the mention and merging my pr 😆\n. ",
    "markusressel": "I will check this out in the coming days, unfortunately I don't have much time currently.\nThanks for the quick response!\n. Works great, thx.\nMaybe you should think about updating the Wiki, I found nothing about this on the GitHub Wiki (or did I miss it?). It was also confusing that I have to call .withAboutSpecial1Description(\"test\") with a valid text in addition to .withAboutSpecial1(\"bla\") before the button was showing up. If the description is necessary IMO this should be one method call with 2 arguments or the description should be optional (with a dummy text in the dialog?).\nKeep coding ;)\n. Hey,\nI tried to test this on older versions (down to 5.9.5 until I got ClassNotFoundExceptions) and it happened on all of them. I finally tried it on a new project and realized that it's a theming issue.\nWhen I use my light theme it is visible as expected:\n\nIn my themes I am overwriting your theme values for both light and dark theme. In my tests I found that you use the primaryColor for the title text. In my app this happens to be the same color as my background color so the text is rendered in the same color as the background.\nMy suggestion would be to either use a different color (like textColorPrimary) or give us the ability to set this color manually with an additional theme item.. That fixed it 👍 \nI was looking for the \"about_libraries_title_description\" value though.\n\nAnd (although I'm repeating myself) I'd like to mention that the wiki is outdated. If you don't want to update the information on there (which I can fully understand) at least put a disclaimer on the top of the pages that the info might be out of date and that the demo app has all the up to date infos (if thats the case). I was actually looking in there and found nothing about a theme value for the appName text - but as you told me now it already exists.\nThx again for this great library and your very fast response :). I did.. ",
    "MFlisar": "Thanks, that's a little easier... Still, having the ability to add an icon would be a nice to have.\n. ",
    "iLexiconn": "Yes I am. :)\n. The library is not made in an Android development environment, so I can't do it that way.\n. :)\n. ",
    "dexion": "Thanks for that! But now html markup is broken: at least <b> tag doesn't work (shown like regular text, not bold)\n. Great! Thanks!\n. ",
    "victorlapin": "ok, thanks for clarifying\n. ",
    "sparkitny": "Ok,\nit works on my android phone. With the emulator it doesn't work. Another lib I use is https://github.com/EverythingMe/easy-content-providers. Using providers-android it unfortunately doesn't show up.\n. Hi,\nnow it works perfectly. I don't know what happened to the emulator, but after a complete restart of my pc it accepted the code changes and now shows the libraries.\nThanks for this lib,\nSebastian\n. Perhaps,\nNow it works perfectly\nThanks\nAm 14.02.2016 12:33 nachm. schrieb \"Mike Penz\" notifications@github.com:\n\n@sparkitny https://github.com/sparkitny perhaps instant run issue?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/issues/187#issuecomment-183876507\n.\n. \n",
    "androideveloper": "How to include MaterialDrawer without autodetect? I can't find it's key\n. Ok, ok, thanks :) I have another question: when i disable auto_scan of used libraries, I still see all of your libs used in my app(even those that I don't use explicitly). Is this expected behavior?\n. @mikepenz Thanks! Though I haven't directly included Android-Iconics, but I use it besides use in MaterialDrawer, so I will not exclude it)) But have excluded FastAdapter and materialize ))\n. @mikepenz I have edited Read.me file and it automatically forked the project. After that I have sent pull request. If there are problems with pull request, can you please add our app line to read.me? About the app: MiniDrawer used for the main menu is from MaterialDrawer library. Open Settings -> About -> overflow icon. And you can find open source licenses there.\n. ",
    "EdwardvanRaak": "Apparently Android studio was bugging out or something because it works again after a full clean. \n. ",
    "amit47billion": "you are using lesser version of libraries version: 5.5.7 so please update support library to libraries version: 5.5.7 or higher , this error will automatically get resolved\n. ",
    "andrebcmarinho": "@mikepenz thanks for quick reply. In fact I was trying to use JitPack and here is the log: https://jitpack.io/com/github/mikepenz/AboutLibraries/v5.6.0/build.log\nI think my problem could be the same of this user (http://stackoverflow.com/questions/26552279/gradle-build-fails-with-javadoc-nullpointerexception) but I din't find any illegal characters on your method comments. That's why I was asking for your help on this issue. Thanks\n. Ok, thanks anyway.\n. ",
    "jaredsburrows": "@mikepenz Alright, I'll make a PR for the libraries that are missing. I'll just follow the exact format you have the for previous libraries?\n. Wow thanks. Will do!\n. @mikepenz Here is my PR:https://github.com/mikepenz/AboutLibraries/pull/198\nI took the time to update retrofit and okhttp.\n. I will add more after my first PR is in :)\n. @mikepenz Next time I will split up the PR.\nI have updated retrofit2.\nThe support libraries are not automatically shown in the about activity. This is why I am adding them.\n. @mikepenz Fixed. Let me know if all is well.\n. @mikepenz buildPaths or classPath? Sorry about that. Now I understand what you are asking. In the future I will make sure I have a class specified and not a package.\n. @mikepenz Thanks. Here is the PR: https://github.com/mikepenz/AboutLibraries/pull/200.\n. @mikepenz Your repo's default branch isdevelop, if you change it tomaster, the badge will change to \"passing\".\n. @mikepenz I need to change the badge's branch todevelop?\n. @mikepenz Sinceplay-services-gcm` and all other GPS libraries are close source, should we create a separate libs XML for each one?\n. @mikepenz Ok. That's fine.\n. @mikepenz After this PR, can you make a release?\n. @mikepenz This is an error I got from the Play Store. All my apps are proguarded, I can not reproduce this issue. I'll try adding in those extra lines to my proguard file.\n. ",
    "bornvanchris88": "\n[ ] i k\n  I\n. \n",
    "javiersantos": "I've been using the library without adding .withFields(R.string.class.getFields()) multiple times, as you can see in this examples::\n- ML Manager\n- Beta Updater\n- AppUpdater\nI will check today if adding .withFields(R.string.class.getFields()) solves the problem, but I think yesterday was showing the same result (even with the same log message).\n. It's working now when adding .withFields(R.string.class.getFields()) and updating the versionCode.\n. ",
    "ofirmiron": "I used to use this library, however I decided to make my own about page.\n. ",
    "Jawnnypoo": "Good catch on Copy paste. Should be good now!\n. I suppose this is resolvable if you initiate the activity with a theme with the proper attributes. Just curious if this would be something worth fixing since you can presently customize the toolbar and status bar colors manually\n. Yeah, nvm, I think with the fact that you can just set this up with a theme, no need for this\n. Ahh, very nice! Thanks a bunch for answering this. Appreciate this lib!\n. I think it would be nice to make a note of this issue in the README so that others don't go about requesting or attempting to add this. \n. ",
    "lawloretienne": "Hey @mikepenz thanks for pointing me to you Libs class.  I just called the constructor\nLibs libs = new Libs(this);\nand I can see two member fields externLibraries and internLibraries.\nexternLibraries has a size of 3 and internLibraries has a size of 138.\nHow can I filter out to only get the dependencies that i have included in my build.gradle ?  Is the externLibraries accounting for all nested dependencies or something?\n. So this seems to be returning a subset of the libraries that i have in my build.gradle .  It doesn't return about 17 libraries that are listed in my build.gradle .\n. So since there is no definition file in https://github.com/mikepenz/AboutLibraries/tree/develop/library/src/main/res/values\nfor some of those libraries that were not picked up, then I must include them manually?\njava\npublic ArrayList<Library> prepareLibraries(Context ctx, String[] internalLibraries, String[] excludeLibraries, boolean autoDetect, boolean sort) {\nIs the 2nd param of this function what i need to pass in to include those libraries that were not initially included?\nAlso what exactly do you mean by the identifier?\nBtw, thanks for being so responsive.\n. Thanks @mikepenz I will be creating a pull request soon to add my definition files.  I had an issue with the prepareLibraries() method.  There is a param that you can pass in to exclude libraries.  I have tried a couple different combinations but i can't quite exclude anything. For example I would like to exclude Android-Iconics.\n. I also noticed that the version number for something like Timber is outdated\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_timber_strings.xml\nIdk how you can keep the version numbers up to date.\n. \nThanks for you advice.  I was able to customize the UI.\n. Thanks again for all the help.  This is a great library btw.\n. ",
    "ItsCalebJones": "Brilliant, got it working. Thanks!\n. ",
    "Mansourali": "Thanks for you replay \nIf I got you right, you mean I should initiate the Lib by using Fragment, then I retrieve that Fragmentinside the instantiateItemof the viewpager.\n. I think I will go for the Recycleview, i will try my best\nthanks for your help \n. ",
    "austynmahoney": "@mikepenz Can you keep the issue open if you want a pull request for the feature? I'm planning on making this change, just haven't had time yet.\n. ",
    "irobotman": "Thx,I download the Android Support Repository v30 by SDK Manager and solve this issue.\n. ",
    "kiezkicker": "@mikepenz Thanks for the fast reply!\nMy app should show 22 libraries but the static field 'libraries' in LibsFragmentCompat shows 0. If I debug the library I found out that the field 'libraries' is never null so the prepareLibraries-Method is never called.\nI wonder how the field \"libraries\" is initialized. This should be the place, but in my case libraries is never null. LibsFragmentCompat:\n```\nif (libraries == null) {\n                //apply modifications\n                libs.modifyLibraries(builder.libraryModification);\n            //fetch the libraries and sort if a comparator was set\n            boolean doDefaultSort = (builder.sort && null == builder.libraryComparator && null == comparator);\n\n           libraries = libs.prepareLibraries(ctx, builder.internalLibraries, builder.excludeLibraries, builder.autoDetect, doDefaultSort);\n\n            if (comparator != null) {\n                Collections.sort(libraries, comparator);\n            } else if (builder.libraryComparator != null) {\n                Collections.sort(libraries, builder.libraryComparator);\n            }\n        }\n\n```\nMy project is a multi-apk projekt (different applicationIds). It uses gradle sourceSets. In the \"main\" Source Set the library is working correct. In the others I have the mentioned problem. Could this be a gradle configuration issue?\nI use proguard for release builds - the problem occurs also on debug builds. I have defined an applicationId in my gradle file.\n. @mikepenz it is working with the withFields-Method! Thanks a lot!\n. ",
    "xiaobailong24": "Hello, I try to use it to get the fragment in Fragment, then i get an error that the method fragment() cannot be resolved. And I search for the fragment in the LibsBuilder.java, I cannot find that. Thank you.\n```\n@TargetApi(Build.VERSION_CODES.HONEYCOMB)\n    public static class AboutPreferenceFragment extends PreferenceFragment {\n        @Override\n        public void onCreate(Bundle savedInstanceState) {\n            super.onCreate(savedInstanceState);\n        LibsFragment fragment = new LibsBuilder()\n                //Pass the fields of your application to the lib so it can find all external lib information\n                .withFields(R.string.class.getFields())\n                //get the fragment\n                .fragment();\n    }\n\n}\n```\n. ",
    "fncapps": "I don't overwrite any of them to my knowledge. I'm starting the activity like this:\nnew LibsBuilder()\n            .withFields(R.string.class.getFields())\n            .withActivityStyle(Libs.ActivityStyle.LIGHT_DARK_TOOLBAR)\n            .withActivityTitle(\"TEST\")\n            .withActivityTheme(R.style.CustomTheme)\n            .withAboutIconShown(false)\n            .withAboutVersionShown(false)\n            .withLicenseShown(true)\n            .start(getActivity());\n. CustomTheme has MaterialDrawerTheme.Light.DarkToolbar as parent which I believe is also yours. I'll leave you the XML here:\n```\n</p>\n<pre><code>&lt;!-- ...and here we setting appcompat’s color theme attrs --&gt;\n&lt;item name=\"colorPrimary\"&gt;@color/color_primary&lt;/item&gt;\n&lt;item name=\"colorPrimaryDark\"&gt;@color/color_primary_dark&lt;/item&gt;\n&lt;item name=\"colorAccent\"&gt;@color/color_accent&lt;/item&gt;\n\n&lt;!-- MaterialDrawer specific values --&gt;\n&lt;item name=\"material_drawer_background\"&gt;@color/color_drawer_bkg&lt;/item&gt;\n&lt;item name=\"material_drawer_selected\"&gt;@color/color_drawer_selected_bkg&lt;/item&gt; &lt;!-- selectedBackground --&gt;\n&lt;item name=\"material_drawer_selected_text\"&gt;@color/color_drawer_selected_text&lt;/item&gt; &lt;!-- selectedTextColor --&gt;\n&lt;item name=\"material_drawer_header_selection_text\"&gt;@color/color_drawer_header_selected_bkg&lt;/item&gt; &lt;!-- accountTextColor --&gt;\n\n\n&lt;item name=\"colorControlNormal\"&gt;@color/color_primary_dark&lt;/item&gt;\n&lt;item name=\"colorControlActivated\"&gt;@color/color_accent&lt;/item&gt;\n&lt;item name=\"colorControlHighlight\"&gt;@color/color_primary&lt;/item&gt;\n&lt;item name=\"colorButtonNormal\"&gt;@color/color_primary&lt;/item&gt;\n\n&lt;item name=\"windowActionModeOverlay\"&gt;true&lt;/item&gt;\n&lt;item name=\"android:windowBackground\"&gt;@color/view_background&lt;/item&gt;\n&lt;item name=\"android:actionModeBackground\"&gt;@color/color_primary&lt;/item&gt;\n</code></pre>\n<p>\n```\n. Sorry @mikepenz, was my fault. I changed that theme to:\n```\n</p>\n<pre><code>&lt;item name=\"colorPrimary\"&gt;@color/color_primary&lt;/item&gt;\n&lt;item name=\"colorPrimaryDark\"&gt;@color/color_primary_dark&lt;/item&gt;\n&lt;item name=\"colorAccent\"&gt;@color/color_accent&lt;/item&gt;\n&lt;item name=\"android:windowBackground\"&gt;@color/view_background&lt;/item&gt;\n</code></pre>\n<p>\n```\nNow most of the colors are shown correctly. But I cannot have different colors for the top-left arrow and the scrollbars... And which such a clear background I would like a different color than white for them. \nAlso the padding still being wrong, any way to fix that?\n. I'm setting the background color with <item name=\"android:windowBackground\">@color/view_background</item> as shown in the theme above. It I add <item name=\"colorControlNormal\">COLOR</item> the scrollbars color will change, but so will do the arrow... is there any way I could change the scrollbars color or instead just hide them?\nOk, the padding is alright. The cards don't seem to be centered because of the scrollbars in the right side.\n. @mikepenz That works great! Thanks!\n. ",
    "WoogieNoogie": "Just noticed a few odd things with some of the libraries we were using in our project, though I'd open up this PR. Let me know if you see any issues.\n. Mainly, I've included SugarORM and RxJava in my project, but neither are appearing in the about page. Hopefully the changes I made have fixed this, but at the very least, these two new libraries can be included. I've made the fixes from your comments above.\n. Okay, maybe I didn't 100% understand how this library pulled in the other projects. It can't just use the package path, it needs to be a full path to a class that's used in the project - is that right?\n. Okay great, sorry for the confusion. Let me fix things up a bit and I'll comment when things are looking better.\n. ",
    "MSF-Jarvis": "Sure, five minutes please :)\n. Done, should be mergeable now :smiley: \n. I'll be sending more of them in a couple of days, need to add in some of\nthe libraries I'm using in my projects.\n. :slaphead:\nI'll get it done. PR closed\n. ",
    "7172": "Ok sure but till now my pc not work properly\nSent from myMail app for Android Thursday, 14 July 2016, 07:22p.m. +08:00 from Roland  notifications@github.com :\n\n@mikepenz I have edited Read.me file and it automatically forked the project. After that I have sent pull request. If there are problems with pull request, can you please add our app line to read.me? About the app: MiniDrawer used for the main menu is from MaterialDrawer library. Open Settings -> About -> overflow icon. And you can find open source licenses there.\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly,  view it on GitHub , or  mute the thread .\n. ## I dont know even i cant post also\n\nSent from myMail app for Android Thursday, 14 July 2016, 09:45p.m. +08:00 from Mike Penz  notifications@github.com :\n\nClosed  #227 .\n—\nYou are receiving this because you commented.\nReply to this email directly,  view it on GitHub , or  mute the thread .\n. I got one ques is libraries is what what is the correct point it pol need it that why that dont make it provided easyly\n\nSent from my Samsung device\n-------- Original message --------\nFrom: ste23droid notifications@github.com \nDate: 26/09/2016  14:36  (GMT+08:00) \nTo: mikepenz/AboutLibraries AboutLibraries@noreply.github.com \nSubject: Re: [mikepenz/AboutLibraries] \"about_libraries_window_background\" not\n  working properly (#258) \nThanks, I've just tested and using this works in the style works fine :) @color/custom_color\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n{\"api_version\":\"1.0\",\"publisher\":{\"api_key\":\"05dde50f1d1a384dd78767c55493e4bb\",\"name\":\"GitHub\"},\"entity\":{\"external_key\":\"github/mikepenz/AboutLibraries\",\"title\":\"mikepenz/AboutLibraries\",\"subtitle\":\"GitHub repository\",\"main_image_url\":\"https://cloud.githubusercontent.com/assets/143418/17495839/a5054eac-5d88-11e6-95fc-7290892c7bb5.png\",\"avatar_image_url\":\"https://cloud.githubusercontent.com/assets/143418/15842166/7c72db34-2c0b-11e6-9aed-b52498112777.png\",\"action\":{\"name\":\"Open in GitHub\",\"url\":\"https://github.com/mikepenz/AboutLibraries\"}},\"updates\":{\"snippets\":[{\"icon\":\"PERSON\",\"message\":\"@ste23droid in #258: Thanks, I've just tested and using this works in the style works fine :) \\u003citem name=\\\"android:windowBackground\\\"\\u003e@color/custom_color\\u003c/item\\u003e\"}],\"action\":{\"name\":\"View Issue\",\"url\":\"https://github.com/mikepenz/AboutLibraries/issues/258#issuecomment-249490179\"}}}\n. Hi mikepenz/AboutLibrar,\nI'd like to add you to my professional network on LinkedIn.\n- Waqas\nConfirm that you know Waqas: https://www.linkedin.com/comm/start/accept-invitation?sharedKey=Bj4jx36W&invitationId=6189783536824836099&trk=eml-guest-invite-cta&trkEmail=eml-invite_guest-null-2-null-null-0%7Eityd373s%7E6y\nYou received an invitation to connect. LinkedIn will use your email address to make suggestions to our members in features like People You May Know. Unsubscribe here: https://www.linkedin.com/e/v2?e=0-ityd373s-6y&t=lun&midToken=AQFmrFVhGEd36Q&ek=invite_guest&loid=AQHvd1FncNZXEgAAAVeaHpjUDOkw9w8EXV281gSh3prNmKkVSNoQV5HoXGFMp2svo-JlKT5FGumWAMzzEqJWvyDcqQvVBKBZXIbaCXcuNrvnjszVIZKg_DpE9TDgyuLIfS9Nd4dON_KykwOJQ9o78kzfxdzAKQdpDxDe3LsN5Yhi_bI9AMcRhhccTNx1HC_6Vqzy&eid=0-ityd373s-6y\nThis email was sent to reply@reply.github.com.\nIf you need assistance or have questions, please contact LinkedIn Customer Service: https://www.linkedin.com/e/v2?e=0-ityd373s-6y&a=customerServiceUrl&ek=invite_guest\n© 2016 LinkedIn Corporation, 2029 Stierlin Court, Mountain View CA 94043. LinkedIn and the LinkedIn logo are registered trademarks of LinkedIn.\n. Waqas Khan would like to connect on LinkedIn. How would you like to respond?\nAccept: https://www.linkedin.com/comm/start/accept-invitation?sharedKey=Bj4jx36W&invitationId=6189783536824836099&trk=eml-first_guest_reminder_01-hero-121-accept_text&trkEmail=eml-first_guest_reminder_01-hero-121-accept_text-null-c1wjru%7Eiu6ew2t6%7Eaz\nView Waqas Khan's profile: https://www.linkedin.com/comm/start/accept-invitation?sharedKey=Bj4jx36W&invitationId=6189783536824836099&trk=eml-first_guest_reminder_01-hero-3-profile_text&trkEmail=eml-first_guest_reminder_01-hero-3-profile_text-null-c1wjru%7Eiu6ew2t6%7Eaz\nYou received an invitation to connect. LinkedIn will use your email address to make suggestions to our members in features like People You May Know. Unsubscribe here: https://www.linkedin.com/e/v2?e=c1wjru-iu6ew2t6-az&t=lun&midToken=AQFmrFVhGEd36Q&ek=first_guest_reminder_01&li=123&m=unsub&ts=HTML&eid=c1wjru-iu6ew2t6-az&loid=AQFVXWiAi0JEDgAAAVe4YP1qqnxJKGTCi1O3GMwgWs8pDwnJEbiLaV34BNLKD_bqDkpcKX8TIWMjJ5mONzSfQL_I5tGWIwem2PaRLKxlAK3WwS0Xa6c3pV051pZMzykkDPM7x_NwGGeBqE-coAOsO9w5GoIP_Qs9er4YG7txmcq8ZGOsqWB46Wld8BZEa8ugtbDM\nThis email was sent to reply@reply.github.com.\nIf you need assistance or have questions, please contact LinkedIn Customer Service: https://www.linkedin.com/e/v2?e=c1wjru-iu6ew2t6-az&a=customerServiceUrl&ek=first_guest_reminder_01\n© 2016 LinkedIn Corporation, 2029 Stierlin Court, Mountain View CA 94043. LinkedIn and the LinkedIn logo are registered trademarks of LinkedIn.\n. Hi ,\nWaqas Khan would like to connect on LinkedIn. How would you like to respond?\nAccept: https://www.linkedin.com/comm/start/accept-invitation?sharedKey=Bj4jx36W&invitationId=6189783536824836099&trk=eml-second_guest_reminder_01-hero-120-accept_text&trkEmail=eml-second_guest_reminder_01-hero-120-accept_text-null-c1wjru%7Eiugexm61%7Eey\nView Waqas Khan's profile: https://www.linkedin.com/comm/start/accept-invitation?sharedKey=Bj4jx36W&invitationId=6189783536824836099&trk=eml-second_guest_reminder_01-hero-3-profile_text&trkEmail=eml-second_guest_reminder_01-hero-3-profile_text-null-c1wjru%7Eiugexm61%7Eey\nYou received an invitation to connect. LinkedIn will use your email address to make suggestions to our members in features like People You May Know. Unsubscribe here: https://www.linkedin.com/e/v2?e=c1wjru-iugexm61-ey&t=lun&midToken=AQFmrFVhGEd36Q&ek=second_guest_reminder_01&li=122&m=unsub&ts=HTML&eid=c1wjru-iugexm61-ey&loid=AQHzROBsucVBSAAAAVfb9r_JIBrJwJXV4yKiYfKnu3gZEASrBl_tqyY_idl-U2XpBG50nC-3XopyCUjsafBwyGjisOlc7YBS3BLPXd8QB0pMwx6-Eq1vYQLR0J8-dAokmY5xQj1qeDbUZN2BV3KrHVoF5seDWuLNJy8IHBBNe-Qzix0_VuGNA6TUdv3Xc68_tlU9\nThis email was sent to reply@reply.github.com.\nIf you need assistance or have questions, please contact LinkedIn Customer Service: https://www.linkedin.com/e/v2?e=c1wjru-iugexm61-ey&a=customerServiceUrl&ek=second_guest_reminder_01\n© 2016 LinkedIn Corporation, 2029 Stierlin Court, Mountain View CA 94043. LinkedIn and the LinkedIn logo are registered trademarks of LinkedIn.\n. ",
    "CeJienAJPC": "Thank you for the response. SupportFragment is good enough\n. Sorry for getting back late.\nmy bad. Didn't try using custom Theme for the Preferences Activity. Working as expected. Thanks for the response.\nRegards\n. Yes, i am already using the LibsListener. My question was where/how to get the URL of the corresponding library I clicked? My apologies, the question wasn't elaborate (didn't mention anything about using the LibsListener).\nIf I want to use the method onLibraryContentClicked(View v, Library library){} in LibsListener this would be code\n@Override\n    public boolean onLibraryContentClicked(View v, Library library) {\n        Intent intent = new Intent(PreferencesExtendedActivity.this, BrowserActivity.class);\n        intent.putExtra(\"PutExtra_URL\", \"LibraryURL\");\n        startActivity(intent);\n        return true;\n    }\nusing putExtra I pass the URL from Preferences activity to the Browser activity. In Browser activity I open the URL using the WebView fragment. In order to pass the URL using putExtra, I need the address. The parameters available are View v, Library library and finally the Libs.SpecialButton specialButton.\nHence, my question. Where/how to fetch the URL info of the library?\n. Issue Solved. Thanks. ",
    "SuSandiWai": "Thanks for your reply!! I used the AboutLibraries as extend Activity like following code. \n``` java\npublic class ShowLicensesActivity extends LibsActivity {\nAppCompatActivity mActivity;\n@Override public void onCreate(Bundle savedInstanceState) {\n    setIntent(new LibsBuilder().withAutoDetect(true)\n        .withLicenseShown(true)\n        .withVersionShown(true)\n        .withActivityTitle(\"Licenses\")\n        .withActivityTheme(R.style.LicenseTheme)\n        .intent(this));\n    super.onCreate(savedInstanceState);\n  }\n}\n```\n. ",
    "ronaldsmartin": "Hi @mikepenz, thanks for making this library. I am trying it out now and really like it so far.\nI'm also encountering this leak report via LeakCanary as in issue #241. I've been able to trigger it on occasion by rotating my device a lot with the Library Activity in the foreground, which suggests to me this is a class configuration change-caused AsyncTask leak.\nMy instantiation looks like this so far (using Kotlin):\nkotlin\n    LibsBuilder()\n                .withActivityStyle(Libs.ActivityStyle.LIGHT_DARK_TOOLBAR)\n                .withActivityTitle(resources.getString(R.string.about))\n                .withLicenseShown(true)\n                .withAboutAppName(appName)\n                .withAboutIconShown(true)\n                .withAboutVersionShown(true)\n                .withAboutSpecial1(resources.getString(R.string.about_button_source))\n                .withAboutSpecial1Description(resources.getString(R.string.about_button_source_description))\n                .withAboutSpecial2(resources.getString(R.string.about_button_rate))\n                .withAboutSpecial2Description(resources.getString(R.string.about_button_rate_description))\n                .start(context)\nI peeked inside LibsActivity and also didn't see any obvious places where it could be leaking memory. However, I noticed in LibsFragmentCompat that the LibraryTask is being passed the inflated view's Context. This might be the activity instance that's leaking.\n. Unfortunately, I was still able to replicate the leak with v5.7.2 with rapid device rotation.\nI'm working on a potential fix myself but haven't verified it yet. I'll let you know how it goes and hope to submit a pull request tonight.\n. I think I've worked out a fix.\nMy first thought was to make LibraryTask static and use WeakReferences to prevent the task from leaking the passed-in Context, but unfortunately that didn't help.\nInstead, I simply used the application Context instead of the activity Context from the view. When using this version, I've been unable to replicate the leak in my own app. It's a really simple change that avoids using a Context that's more likely to be destroyed.\nShould I submit a pull request? https://github.com/mikepenz/AboutLibraries/compare/develop...ronaldsmartin:bugfix-context-leak?expand=1\n. If I understand correctly, even though LibsFragmentCompat's reference to the context is set to null, the LibraryTask is still holding onto its own reference for that same context (the one set in its constructor).\nThese situations are inherently complex, so I might be off the mark! Hopefully this fixes the issue, though.\nThanks again for your hard work in this library and for actively working to resolve this!\n. ",
    "Anty0": "This is not leak in AboutLibraries and can't be fixed from this library, it is leak in system Android. https://code.google.com/p/android/issues/detail?id=173789\nThis leaks first started activity to UserManager in system.\nTo fix this leak you should add this few lines to your application:\n```\npublic class ApplicationBase extends Application {\n@Override\npublic void onCreate() {\n    super.onCreate();\n    if (Build.VERSION.SDK_INT > 17) {\n        try {\n            UserManager.class.getMethod(\"get\", Context.class).invoke(null, this);//fixes system leak in android\n        } catch (Exception ignored) {\n        }\n    }\n\n    LeakCanary.install(this);\n}\n\n}\n```\nSorry for my English :)\n. ",
    "long-greg-c": "Your welcome.\n. ",
    "ankitbatra11": "@mikepenz \nI launch the LibsActivity using following code:\njava\nThemeSetting themeSetting = DaggerUtils\n                .getSettingsComponent(getActivity().getApplication())\n                .themeSetting();\nLibsBuilder builder = new LibsBuilder()\n                .withActivityStyle(Libs.ActivityStyle.LIGHT_DARK_TOOLBAR)\n                .withLicenseShown(true)\n                .withVersionShown(true)\n                .withAboutIconShown(true)\n                .withActivityTheme(themeSetting.getThemeRes())\n                .withAboutDescription(getString(R.string.app_name));\n        builder.activityTitle = getString(R.string.about);\n        builder.start(getContext());\nCode is trigged on press of a menu item in settings fragment.\n. ",
    "axelrindle": "@mikepenz Ok, I changed the things you mentioned.\n. @mikepenz I changed the \".\" to a \"_\".\n. @mikepenz Actually I did.\n.  @mikepenz Changed it.\n. Ok I changed it.\n. Oh yeah, sorry xD\n. ",
    "Z3r0byte": "Oops, seems to be an issue with your NavigationDrawer Library. However it started when I added this library.\n. Fixed by updating the drawer library to the newest version.\n. Oh, I see. :)\n. ",
    "icarovirtual": "Just in case someone comes across the same problem as me in the future, I needed to set a custom font to the activity's toolbar title. I managed to do it adding the LibsUIListener in the code below to my LibsBuilder:\n```java\n.withUiListener(new LibsConfiguration.LibsUIListener() {\n    @Override\n    public View preOnCreateView(View view) {return view;}\n@Override\npublic View postOnCreateView(View view) {\n    Context context = view.getContext();\n    Toolbar toolbar = (Toolbar) ((Activity) context).findViewById(R.id.toolbar);\n    for (int i = 0; i < toolbar.getChildCount(); i++) {\n        if (toolbar.getChildAt(i) instanceof TextView) {\n            TextView child = (TextView) toolbar.getChildAt(i);\n            if (child.getText().equals(toolbar.getTitle())) {\n                child.setTypeface(Typeface.createFromAsset(context.getAssets(), \"fonts/ProximaNova-Bold.ttf\"));\n                break;\n            }\n        }\n    }\n    return view;\n}\n\n})\n```. ",
    "ste23droid": "Thanks, I've just tested and using this in the style everything works fine :) <item name=\"android:windowBackground\">@color/custom_color</item>\n. ",
    "roman-ku": "Jesus, I spent at least half an hour with this.\nWhat is \"about_libraries_window_background\" for then?. I wanted to turn off auto detection and supply the library names myself in this fashion: https://github.com/mikepenz/AboutLibraries/issues/272#issuecomment-263132830\nBut it doesn't appear to work. Any ideas?. I am trying to disable auto detection (using .withAutoDetect(false))  but it never works. Maybe there is some requirement to using that command? I'm not sure what versionCode @Rainer-Lang is referring to and I will try to reset app data but maybe later since I don't want to lose what I have saved. . Thanks for adding the progress indicator feature!. Hmm, how do I know which name to put there? Like what exact library name do I use?. Thanks, I will take a look at that.\n\nnot great to exclude libraries which you have in your project\n\nTrue. But I'm not sure why the Android-Iconics and FastAdapter libraries are showing up. I'm not using them in my app nor directly including them. I mean sure your library may be using them, but I don't think it's a legal requirement to include licenses for open source libraries which an open source library is based on or uses. That being said I'm not a lawyer so may be I should be including them.\n@mikepenz . ",
    "FabianTerhorst": "This is already added into the app manifest with the gradle manifest merger.\n. changed realm class path to io.realm.Realm\n. ",
    "xsota": "Since I got a \"android.content.ActivityNotFoundException\", it has been added to the README\n. @mikepenz \nI added app/build.gradle dependencies\ncompile('com.mikepenz:aboutlibraries:5.8.1@aar') {\n        transitive = true\n}\n. @mikepenz \nI'm sorry. It seems it was my mistake.\nThank you very much.\n. ",
    "Namnodorel": "It is not about a specific case, just in general. I often add some small libraries while working, and don't want to add each of them here every time I add another one. \n. Also the detection doesn't always work well with the XML files. For example both ProcessPhoenix and Butterknife should be included automatically, but they aren't...\n. I can, but that's not the point. There needs to be a way to add libraries to the local project quick and easy.\n. ",
    "fettlaus": "That is not possible, because the text color gets overwritten every time by \naboutAppDescription = (TextView) headerView.findViewById(R.id.aboutDescription);\n            aboutAppDescription.setTextColor(UIUtils.getThemeColorFromAttrOrRes(headerView.getContext(), R.attr.about_libraries_text_openSource, R.color.about_libraries_text_openSource));\nin HeaderItem. \n. In this case we need about_libraries_divider_openSource as well. \n. Will change it tomorrow and add it to the PR\n. ",
    "guntherhoppe": "Thx - works perfect! \nI tried this before, but used R.class.getFields instead of R.string.class.getFields ... My mistake. :)\n. @mikepenz: I use a lesser version of the support libs in my app, which results in build errors when I update AboutLibraries to the latest version.. @mikepenz: Mhh - I will try. Thanks. \nBut I'm wondering why you are closing this issue now (and uncommented)? Will the latest version fix this problem for sure, or (means is it a known issue)? It did not sound like that .... ",
    "shanno29": "Thank you very much Mike!. ",
    "IonutNegru87": "I think you have to manually create the style you want and populate with the data provided by the library.. Hello @mikepenz,\nThis is what I did to solve this issue, but I think this can be detected by the library in order to avoid crashes like this. Until then, I think an update of the documentation can be done so that others know how to avoid this.\nThank you for the great library and for your time.. ",
    "IsmetBesic": "@mikepenz Thank you very much for your quick reply. It eventually helped me realize how stupid I was. I actually already had created the libsListener (basically I took over all the code from your FragmentActivity), however, I removed the part where the Drawer is built. That in turn deleted the assignment of the libsListener and thus the methods never fired for me. Adding \".withListener(libsListener)\" to the \"LibsSupportFragment fragment = new LibsBuilder()\" resolved the issue I experienced. \nAgain, thank you very much!. ",
    "thisisPratzz": "add names,description of libraries which where not included  in gradle\nEg.\napp has  used libraries A,B but not used library C\nStill add decription,name of  C aboutLibrary View. Thank you :+1: . ",
    "rfc2822": "Have experienced this, too.\nWhen using this fragment:\n1 -> LibsBuilder()\n        .withAutoDetect(false)\n        .withLicenseShown(true)\n        .withLibraryComparator { o1, o2 ->\n            val vip1 = vipLibraries.contains(o1.definedName)\n            val vip2 = vipLibraries.contains(o2.definedName)\n            if (vip1 == vip2)\n                o1.libraryName.compareTo(o2.libraryDescription)\n            else\n                vip2.compareTo(vip1)\n        }\n        .supportFragment()\n\nthe activity crashes at soon as it is resumed. This is because the comparator can't be serialized. It does not happen when there's no comparator\nSteps to reproduce:\n\nCreate an AppCompatActivity and embed a fragment created by LibsBuilder.withLibraryComparator().supportFragment().\nStart this activity.\nMove away from the activity (e.g. switch to another app)\nSwitch back to the activity.\n\nResult: activity crashes with NotSerializableException.\nExpected result: activity should not crash.\nMaybe the comparator cannot be used with the AboutLibraries fragment? In this case, I suggest to throw an IllegalArgumentException in supportFragment() when a library comparator is set.. Also added dav4jvm and MPL 2.0 license. ",
    "Scrounger": "Overriding the layout file is easier. Just setted your diverders color to transparent and added my custom divider. Still tried but it doesn'r work and i dont know why. ",
    "tomh12389": "On Jan 31, 2017 3:20 PM, \"Kalyan Dechiraju\" notifications@github.com\nwrote:\nAdd PermissionsDispatcher Library definitions.\nYou can view, comment on, or merge this pull request online at:\nhttps://github.com/mikepenz/AboutLibraries/pull/292\nCommit Summary\n\nCreate library_permissionsdispatcher_strings.xml\n\nFile Changes\n\nA library/src/main/res/values/library_permissionsdispatcher_\n   strings.xml\n   https://github.com/mikepenz/AboutLibraries/pull/292/files#diff-0 (21)\n\nPatch Links:\n\nhttps://github.com/mikepenz/AboutLibraries/pull/292.patch\nhttps://github.com/mikepenz/AboutLibraries/pull/292.diff\n\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/mikepenz/AboutLibraries/pull/292, or mute the thread\nhttps://github.com/notifications/unsubscribe-auth/APRRA6UGpIiEd_4CE7HR3SQZed9s2Q3bks5rX5eWgaJpZM4LzIHU\n.\n. ",
    "kalyandechiraju": "Yes, noticed that. . ",
    "odin-": "Excellent. Thank you for a nice lib.. The preOnCreateView returns the RecylerView. So to get the Toolbar is in the parents parent right?\nLinearLayout contains FrameLayout contains RecylerView\nThe LinearLayout contains the toolbar?. Ah of course. That's the smart thing to do :-). More clean than trying to find parent views if you happen to change something in the future.\nThanks.. OK I'll do that for httpclient then! Thanks.. Where did you find it is not open source? Doesn't it says Apache 2.0 license here:\nhttps://mvnrepository.com/artifact/cz.msebera.android/httpclient/4.4.1.2\nand here:\nhttps://github.com/apache/httpclient\n?\n. Kind of lame of me to do 5 commits btw :-). GitHub newbie.... I compiled your project in AS and exported the aar to my project to test locally, but to be honest I didn't get HttpClient to show up. \nAny ideas?. Excellent. Worked like a charm. So that's why it's a bit slow to display the first time.\nThen it's verified on my side at least.\nLearned alot, thanks.. OK should I use \nlibs.getLibrary(\"ActionBarSherlock\") and so on for this?\n. Excellent. Thanks.. Worked fine. My bad. Closing issue.. ",
    "bematthias": "@mikepenz I'm a little bit lazy in that case ;) and I wouldn't forget a library when I add a new one. \nSo, is it at least possible to use two fragments / activities with different LibraryItems? At the moment a LibraryItem is \"lost\" whenever I exclude it in a previous builded instance.. ",
    "matmedev": "OK. I'll try that one, Thanks!. OK. I will take a look at it and get back as soon as I am ready.. I made some changed (see commit message). I couldn't add the classpath for MaterialDesignDimens lib since there are no classes in the lib, only constants.. ",
    "m-rm": "That was fast! Thank you!. @mikepenz  I created a simple test case:\n<string name=\"define_test\"/>\n    <!-- Author section -->\n    <string name=\"library_test_author\">Test Author</string>\n    <string name=\"library_test_authorWebsite\">www.google.com</string>\n    <!-- Library section -->\n    <string name=\"library_test_libraryName\">Test Library</string>\n    <string name=\"library_test_libraryDescription\">Test Description</string>\n    <string name=\"library_test_libraryWebsite\">www.google.com</string>\n    <string name=\"library_test_libraryVersion\">1.0.0</string>\n    <!-- OpenSource section -->\n    <string name=\"library_test_isOpenSource\">true</string>\n    <string name=\"library_test_repositoryLink\">www.google.com</string>\n    <!-- ClassPath for autoDetect section -->\n    <string name=\"library_test_classPath\"></string>\n    <!-- License section -->\n    <string name=\"library_test_licenseId\">test</string>\n    <!-- Custom variables section -->\n<string name=\"define_license_test\"/>\n    <string name=\"license_test_licenseName\">Test License</string>\n    <string name=\"license_test_licenseWebsite\"></string>\n    <string name=\"license_test_licenseShortDescription\"></string>\n    <string name=\"license_test_licenseDescription\">Some Text</string>\nnew LibsBuilder()\n                    .withActivityStyle(Libs.ActivityStyle.LIGHT_DARK_TOOLBAR)\n                    .withLicenseShown(true)\n                    .withLicenseDialog(true)\n                    .start(getActivity());\nWith this no popup with \"Some Text\" is shown. When I instead use \n<string name=\"define_license_test\"/>\n    <string name=\"license_test_licenseName\">Test License</string>\n    <string name=\"license_test_licenseWebsite\">www.google.at</string>\n    <string name=\"license_test_licenseShortDescription\"></string>\n    <string name=\"license_test_licenseDescription\">Some Text</string>\nThe popup appears correctly.. ",
    "Javanshir": "Same problem with AndroidViewPagerIndicator, not a big issue of course, can be solved by adding:\n<string name=\"library_AndroidViewPagerIndicator_licenseId\">apache_2_0</string>\nto the strings. ",
    "JSierawski": "@mikepenz No problem!  I'll probably be following up with some new license entries.  I'll look at some of the older commits.  Thank you for your help.. Hi Mike.  I added a commit to correct the PhotoView issue you mentioned.  Thanks for your help.. Ah, you're right - sorry...this is a different PhotoView.  I should have checked more carefully.  I'll add a new file for this.. It does show up in the project window as 'external library' and gets auto-detected with this classpath.  Is there a reason not to include it here?. Yes, better safe than sorry.  Thanks for the support!. ",
    "fmt-Println-MKO": "android job is included in your repo already:\nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/library_android_job_strings.xml\nI just took this as an example. \nfor me, only the automatic found libs are shown, all libs added manuell are not shown. \nwhen I checked the source code, it looks like, that in case you use a fragment, the builder (which contains the lib list) is passed as \"data\". but when using the activity like me, this information is lost / not passed. \nso all manual added libs are not listed in this case\n. ah ok sorry, i missed the line where the builder is also passed to activity to fragment,\nbut I debugged, and android_job is not in the libraries list, so search by name would result null in there, als ahbottomnavigation ist not there. and as I used debug build, nothing should have removed the resources. strange....\n . yes it is, \nsure I will check out whats going wrong in may app. \nthank you . ",
    "AllanWang": "Updated. I tested this with external string and it worked.. Shrink resources is the issue, not proguard.\nI'm going to try what you have plus\npublic static final int library_*; and see if that works. @rubengees is your project open sourced?. Also since this keeps the whole R class, I'm not sure if this will be better than the original rules. @rubengees I think it means that it does, since the only constraint is that a class contains a define_ string and it's preserving the entire class rather than just some members. I'm still waiting for travis to build so I can decompile it later. Plus I think the reason it works with define_ is because the rest of the class is kept, otherwise all your library_ strings will be gone too.\n(Not a proguard expert either, so what you're saying is ideally what I want to happen). @mikepenz The issue still stands with all the external libraries with their strings, \nUsing the rules defined above definitely cleans it a fair bit though, since it seems to remove all the appcompat resources.\nMy R class with from 6k variables to 3k, and About library went from 3709 to ~300.\nFor the app, the size\n- with the proguard above is 3.92\n- without proguard is 3.98\n- with proguard and no R restrictions is 3.91. Our cases are for proguard + shrink + no auto detection. Because without this rule those strings will be gone anyways. I don't think any changes need to be done on your end since it's fine the way it is, but perhaps the proguard lines can be added to the readme for those who want to shrink their resources as much as possible and are willing to input libraries manually.\nThanks rubengees!\n-keepclasseswithmembers class **.R$* {\n    public static final int define_*;\n}. Addressed in #333 . @mikepenz done. Does the About Libraries version need to be updated for the string updates? There's been quite a few changes since 5.9.6's release on May 3rd. Is there a merge conflict? I just synced my repo with yours. But when doing that on github it generates a commit for that. There still shouldn't be a conflict though . Look funny when squashing or because of my first merge commit? If it's the latter, I agree. I usually delete my fork and fork again to avoid that, but if you squash everything it might have made it look nicer. . @mikepenz friendly ping. I've also updated the reactive libs and added RxKotlin. ",
    "StefMa": "OK. Thank you for the information.\nDoes aboutLibraries works, if I add the strings to our ThirtyInch project? Then I would include it in our library instead in this one. I think it will be easier to maintain...\nAnother question\nIs the library_thirtyinch_strings.xml correct? If I would copy it in our lib, would AboutLibrary recognize our lib?\nWhat is define_int_ThirtyInch?\nWe don't include ThirtyInch or AboutLibraries in Ti. So we don't have to define define_ThirtyInch but define_int_ThirtyInch, right? 🤔 . I have tested it, but it don't work.\nSee this PR https://github.com/StefMa/ThirtyInch/pull/1/files\nThe list is just empty :(\nWhat I'm doing wrong?\n\n. Ahh thank you!\nYes, in the test sample we use proGuard. It have removed the unused resources. Of course...\nI've fixed it now 👍 It works if I disabling the removing with -keep public class **.R$string\n. Yep, that is enough.\nThank you for your help 👍 . ",
    "aminecmi": "@mikepenz I couldn't have two MaterialDrawer libraries at the same time, because I was updating the line of the older version.\nUpdating to support libraries 27 seamed to resolve the issue. Shouldn't it be added in the migration guide ?. It is said in the changelog, but I didn't know that I HAD to update my app too.\nThanks for the help.. ",
    "davemg3": "Ah ok... previously I was on 5.9.1 with V26 libraries and thus this issue.I upgraded to your latest release to check if error was gone, it means indeed to 6.0.0 which conduct also to same issue.\nIs there a version  of AboutLibrary I can use with V26?tks. ",
    "dariobanfi": "Works like a charm, thanks!. ",
    "10erlosh": "\nor just use it's identifier so it shows up\n\nhow?. created a PR (hopefully correct). so when ProGuarding and doing like that:\nLibs libs = new Libs(activity, Libs.toStringArray(R.string.class.getFields()));\nArrayList<Library> list = libs.prepareLibraries(activity, null, null, true, true);\nlist.add(libs.getLibrary(\"androidannotations\"));\nlist.add(libs.getLibrary(\"commonslang3\"));\nonly \"AndroidAnnotations\" and \"Commons Lang 3\" would show up?. ",
    "mmrmartin": "Thank you for accepting, I have to try your library later ;-). ",
    "nstajduhar": "Perfect Thank You! It Worked!. ",
    "QuadTriangle": "may be something wrong on my part\nmy code (with some xml definition):\njava\n    private void showAbout() {\n        new LibsBuilder()\n                .withLibraries(\"aboutlibraries\", \"materialdialogs\", \"appupdater\", \"support_cardview\",\n                        \"constraint_layout\", \"materialprogressbar\", \"okhttp\", \"okio\", \"design\",\n                        \"support_v4\", \"appcompat_v7\", \"recyclerview_v7\", \"support_annotations\",\n                        \"fastadapter\", \"androidiconics\")\n                .withAutoDetect(false)\n                .withLicenseShown(true)\n                .withActivityTheme(getAppTheme())\n                .withActivityTitle(getString(R.string.about))\n                .start(context);\n    }\nI will get back to you after releasing my app.. it does not block the UI instead it shows a spinner. auto detection on and off doesn't make huge difference  . it's same. If I enable auto detection it creates a file containing \nxml\n<?xml version='1.0' encoding='utf-8' standalone='yes' ?>\n<map>\n<string name=\"autoDetectedLibraries\">OkHttp;appcompat_v7;constraint_layout;design;materialdialogs;materialprogressbar;okio;recyclerview_v7;support_annotations;support_cardview;support_v4</string>\n</map>\nso I think it spends most of the time collecting author names, licenses, website urls etc. . I guess it can be done using a plugin (like https://github.com/chaquo/chaquopy).  I am still fine with current version but compiles time information gathering will be better. I think I should close this issue and wait for a plugin.. PR title is somewhat misleading. I actually fixed html links in alertdialog text.\nxml\n<string name=\"aboutLibraries_description_special1_name\" >links</string>\n<string name=\"aboutLibraries_description_special1_text\" >\n    <![CDATA[\n         website:\n         <a href=\"https://google.com\">Google</a>\n         <a href=\"https://github.com\">Github</a>\n    ]]>\n</string>\nhtml links in aboutLibraries_description_text already works. and I give my app to someone to review UI, he ask me to make  links click-able. that's why I opened a PR.\nfeel free to close it.. wasn't catch (Exception ex) {}  enough  for this?\n. ",
    "renner-foc": "will make a new PR, sorry.. ",
    "EmmanuelMess": "This is your own image:\n\nWhere is the license name? Did I miss something?. Thanks!. ping?. ",
    "mueller-ma": "It might cause some overhead in this libary, but one translation here is used in all apps using this libary. I use at least two apps with this libary and sending the same translation to both apps seems to me the larger work.. I'm using version 6.0.8, but the material-about-library doesn't show up in the used libs list.\nI haven't pushed the updated dependencies, but here are the build.gradle file and the activity where both libs are used:\nhttps://github.com/openhab/openhab-android/blob/master/mobile/src/main/java/org/openhab/habdroid/ui/AboutActivity.java#L166\nhttps://github.com/openhab/openhab-android/blob/master/mobile/build.gradle#L113. What's the classpath of the jmdns library? javax.jmdns.JmDNS?. I'm sorry, I wanted to ping the maintainer with my comment, but github removed the ping. Probably I misspelled it.\n@kaikreuzer What's the classpath of the jmdns library? javax.jmdns.JmDNS ?. ",
    "wangpung12": "ดีคับ. ",
    "masahiro-ikemoto": "Never mind :-). I found new version 6.0.4, but it seems that license_lgpl_2_1_strings.xml still includes apostrophe not preceded by backslash.. For example, the line 301 of \nhttps://github.com/mikepenz/AboutLibraries/blob/develop/library/src/main/res/values/license_lgpl_2_1_strings.xml\nhave an apostrophe that not preceded by backslash.\nmodification of the work for the customer's own use and reverse\nI think it shold be quoted like following:\nmodification of the work for the customer\\'s own use and reverse\nAnd there are many other alone apostrophes in the document.. I'll try it, wait a moment.. I build latest repository clone, and replaced my ~/.gradle aar cache by created library-release.aar as a test.\nThen, build of my app was succeed with no error, so all problems may have been fixed.\nI wait for updating jcenter repository.\nthanks a lot.. ",
    "JohannesDev": "Well thanks for your quick answer. Makes a lot of sense. I will just add the libraries manually as you suggested.\nAnyways thanks a lot for your awesome library.. ",
    "kaikreuzer": "Right, here's the proof ;-). @mueller-ma, I assume you didn't yet see https://github.com/mikepenz/AboutLibraries/pull/380#issuecomment-375196892, right?. ",
    "juanitobananas": "Actually, I just realised that the most modern Android versions add the flag themselves:\n04-13 07:58:26.547  1295  2002 W ActivityManager: startActivity called from non-Activity context; forcing Intent.FLAG_ACTIVITY_NEW_TASK for: Intent { cmp=org.example.app/com.mikepenz.aboutlibraries.ui.LibsActivity (has extras) }\nSo another option would be to just always add it instead of using the if I proposed in my previous comment. . You're welcome! Thank you for the cool library! Don't worry about the delay.\nNice! Now I can show my libraries to people with older Androids :smile:. ",
    "Spettacolo83": "@mikepenz thank you very much for your quick reply.\nMay I ask you an example in order to understand which parameter needs to be passed as Field[] fields.\nThank you!. I've just tested and it works like a charm!\nThank you very much for your help!\nGreat library, great support!. ",
    "flocke": "@mikepenz sure, will do.. ",
    "bkhall": "Found #231. ",
    "JosephRoskopfOPI": "@mikepenz Any thoughts on this?. ",
    "klamborowski": "Sorry, my bad. Fixed. ",
    "arpitjindal97": "Is there any problem in above commits ?. I thought you ain't accepting PRs on this repo. 1 PR is pending since a month so i closed.. ",
    "Tezzeret1603": "Hi, solve it.\nThank you for your cooperation.. ",
    "jboxx": "com.android.volley.toolbox.Volley or com.android.volley.toolbox.VolleyTickle or com.android.volley.RequestTickle. ",
    "joanpuigsanz": "I've tried an I still have the same problem. I think you can try it using the CustomSortActivity in your test app, actually the following code is from there:\n.withLibraries(\"crouton, actionbarsherlock\", \"showcaseview\", \"glide\"). ",
    "skauss": "Thanks. ",
    "ccomeaux": "I can, but it may be a while before I can get to it. I think the class path for PhotoView is incorrect - I believe it should be com.github.chrisbanes.photoview.PhotoView.. ",
    "devgianlu": "I created an helper class that I use on some of my projects. Actually, it is open source: starting from here . Somehow, I've written it wrong, I'm using version 6.1.1.. I've did nothing. It fixed itself after some time.. ",
    "tariqul-islam1": "Hey @devgianlu, can you please write how you resolved the issue? I have exactly the same issue.. ",
    "pawegio": "Ok, thanks! If it's not affecting real app users I'm happy to close it.. ",
    "harjazB": ".WithLibraries(String... libraries) doesn't work unless you call LibsBuilder#withExcludedLibraries(\"any_string\") in LibsBuilder()\nExample:\nnew LibsBuilder()\n  .withLibraries(\"lib1\", \"lib2\")\n  .start(context); \nDOESN\"T WORK (internal libraries are not displayed)\nnew LibsBuilder()\n  .withLibraries(\"lib1\", \"lib2\")\n  .withExcludedLibraries(\"\")\n  .start(context);\nWORKS (internal libraries are displayed)\n. Sorry, I changed wrong line :-( New pull request & info will arrive soon.. Oh great, now I see that it is already fixed in master. I meant line\n. I meant line with condition if(isExcluding && lib != null) in 6.1.0 version when library was added to resultLibraries only when isExcluding==true\n    //Now add all libs which do not contains the info file, but are in the AboutLibraries lib\n    if (internalLibraries != null) {\n        for (String internalLibrary : internalLibraries) {\n            Library lib = getLibrary(internalLibrary);\n\n            if(isExcluding && lib != null) {\n                resultLibraries.add(lib);\n                libraries.put(lib.getDefinedName(), lib);\n            }\n        }\n    }.\n",
    "jpstotz": "I am sorry but just replacing github links is not what I had in mind. You even missed most of the github links as you have not changed github.io links.\nTherefore I am a bit dissatisfied with your response. I extracted the http urls from the XML files and tested them with a little script for https availability for each url:\n```\n!/usr/bin/python3\nimport urllib3\nfile = open(\"urls.txt\", \"r\") \nurls = file.read()\nhttp = urllib3.PoolManager()\nfor u in urls.split(\"\\n\"):\n    su = u.replace(\"http://\", \"https://\")\n    try:\n        r = http.request('GET', su, timeout=5.0)\n        if r.status == 200:\n            print(u)\n    except:\n        #print(\"ERR {}\".format(u))\n        pass\n```\nThe following URLs are available via HTTPS and therefore should be updated:\nhttp://aidanfollestad.com/\nhttp://amlcurran.github.io/ShowcaseView/\nhttp://apache.org\nhttp://blog.zhanghai.me/\nhttp://chris.banes.me/\nhttp://commons.apache.org/proper/commons-csv/\nhttp://commons.apache.org/proper/commons-io/\nhttp://creativecommons.org/licenses/by/3.0/legalcode\nhttp://daimajia.com\nhttp://daimajia.com/\nhttp://developer.lge.com/\nhttp://developer.lge.com/MOBILE_HELP/index.jsp?topic=%2Flge.mobilesdk.LGQSlide.api%2Fhtml%2FDeveloping%2FDeveloping%2FDeveloping+with+LG+QSlide+SDK.htm\nhttp://facebook.github.io/rebound/\nhttp://fsf.org/\nhttp://gmariotti.blogspot.it/\nhttp://google.com\nhttp://h6ah4i.com/\nhttp://inthecheesefactory.com/blog/correct-imageview-adjustviewbounds-with-adjustable-imageview/en\nhttp://jakewharton.com/\nhttp://jakewharton.github.io/butterknife/\nhttp://jhy.io/\nhttp://joanzapata.com/android-iconify/\nhttp://jsoup.org/\nhttp://koush.com/\nhttp://ksoichiro.blogspot.pt/\nhttp://ksoichiro.github.io/Android-ObservableScrollView/\nhttp://libphonenumber.googlecode.com/svn/trunk/javascript/i18n/phonenumbers/demo-compiled.html\nhttp://luke.klinker.xyz/\nhttp://malinskiy.com/\nhttp://mikepenz.com/\nhttp://mixpanel.com/\nhttp://mixpanel.github.io/mixpanel-android/index.html\nhttp://nostra13android.blogspot.co.at/\nhttp://opensource.org/licenses/BSD-2-Clause\nhttp://opensource.org/licenses/BSD-3-Clause\nhttp://opensource.org/licenses/MIT\nhttp://paymill.com\nhttp://roomorama.com\nhttp://satyan.github.io/sugar/\nhttp://scripts.sil.org/OFL\nhttp://site.mockito.org/\nhttp://square.github.io/\nhttp://square.github.io/dagger/\nhttp://square.github.io/okhttp/\nhttp://square.github.io/picasso/\nhttp://square.github.io/retrofit/\nhttp://stfalcon.com/\nhttp://su.chainfire.eu/\nhttp://svn.apache.org/viewvc/commons/proper/io/trunk\nhttp://tozny.com/\nhttp://trello.com/\nhttp://wasabeef.jp/\nhttp://www.akexorcist.com/\nhttp://www.apache.org/licenses/LICENSE-2.0\nhttp://www.apache.org/licenses/LICENSE-2.0.html\nhttp://www.avast.com\nhttp://www.daniel-stone.uk/\nhttp://www.devbrackets.com/\nhttp://www.eduardereza.com/\nhttp://www.facebook.com/\nhttp://www.freepik.com\nhttp://www.freepik.com/free-photos-vectors/people\nhttp://www.gnu.org/licenses/lgpl-3.0.en.html\nhttp://www.gotev.net\nhttp://www.jetbrains.org\nhttp://www.joanzapata.com/\nhttp://www.piwai.info/\nhttp://www.twitter.com/\nhttp://www.wix.com/amulyakhare/portfolio\n. You wrote:\n\nI can't update all other urls though as it would require to check every single page if the https link would resolve.\n\nI solved this problem for you. IMHO it is now up to you - I already prepared everything for you for fixing this vulnerability.. What you say about your time and opensource projects - them same is true for me. \nThe only difference is that when I found or take over an open source project I feel responsible for it and therefore do what have to be done and don't just ask for a PR or a patch. \nAnyway why should I fork your project? As I said I don't use it I just asking you to fix your security problems you are causing to dozens or hundred of Android app which are using your library!. ",
    "athkalia": "Hi @mikepenz , I can set the activity theme but i can't customize the card theme cause the card has no default style set. If you set a custom style for the card view then I can override it I guess.. I was only able to set the toolbar title text colour via android:textColorPrimary. ",
    "fei0316": "If all libraries referenced in gradle should appear, then floating action button, material number picker, Android switch date time picker, as well as some more AOSP libraries are missing, despite some of them being defined in the xmls. Only material tap target and your libraries show up.\nProguard is disabled (minify not enabled, and I'm building debug apks)\nWhat could be the problem? Also how do I provide the id for manual inclusion of packages?. A little update... I found out what you mean by \"id\" and it worked by manually including the missing ones, but only when it's included in AboutLibraries. So I have to create my own if some libraries I used are not included?\nAlso, I still don't have a clue as to what happened to autodetect.... Found the problem... \nOne included definition file for a library is old and does not include a classpath, therefore it cannot be updated. My custom-made definition files and included ones with classpath worked flawlessly.\nThank you very much for your help, turned out there is nothing wrong with the library.\nI will be making a PR for my custom files.. No problem! :)\nAlso, thank you for your hard work on this library!. ",
    "mbiebl": "will do. thanks for the quick reply. hi @mikepenz , does closing this issue mean you are no longer interested in getting a PR for it?\nI'm a bit confused why it was closed when the issue is still unfixed.\n. Well, it's common to keep issues open so they can be tracked and be closed by PRs. An issue can be a bug (malfunction) or a feature request (RFE). This issue certainly falls more in the latter category.. Anyway, thanks for still being open to accept a fix for it. \nI'm a bit undecided what to do about the license name wrt #427.\nI see a couple of options here\na/ Set licenseName to GPL 3.0 instead of spelling it out\nb/ Introduce a shortLicenseName field (which would require a more elaborate code change\nc/ Don't shorten the license name to 50% but give it all available space\nWdyt?. Would a layout like this be an option?\n```\n\nlibrary name (*)\nauthors\ndescription\nlicense\n```\n*) If a library version has been set, it's added in brackets, all fields span 100%. That said, discussing the specific UI changes should probably move over to #427\nI just wanted to know which route I should take when preparing the PR, i.e. use a shortened license name like GPL 3.0 or spell it out and hope #427 get's fixed one way or another.. Thanks for that information. Still, I somehow think that AboutLibraries should by default make better use of the available space. In the example above, there would be more then enough space to list both names in full.. That STRING_TOO_LARGE error was triggered when clicking the cert4android license information.. https://stackoverflow.com/questions/6318659/string-error-constant-string-too-long\n. @mikepenz I've considerably reworked the PR.\nIt should not hit the STRING_TOO_LARGE problem anymore by carefully replacing unicode chars with ascii chars and stripping off unnecessary meta data. The rendered version looks much better now as well.\nPlease have another look.. fwiw, the lgpl 2/3 license definitions would probably benefit from such a rework as well. The current rendering of those licenses doesn't look too good. If you want, I can prepare a separe PR for that.. A new release would be perfect, as I want to make use of the GPL library definitions without having to copy&pasting it into my project. Thanks a lot!. > Sounds great :) anything to improve is always appreciated!\nAck, will have a look at the LGPL 2/3 definitions then and submit a separate PR.. ",
    "buildkii": "Help. Setting . "
}