{
    "minikomi": "OK. Shouldn't be a problem.\n. I'm not going to add this.. it's not hard to just delete the class from the rendered form.\n. Hmm. As it stands, that would be a bit tricky to implement. I think it would be better to consider in a future version.\n. What form would the json take? And what would you use it for?\nThe app is meant for quickly prototyping bootstrap forms without having to\nretype all the required scaffolding markup.\nOn Tuesday, November 27, 2012, bluee wrote:\n\nIt would be really nice if you could save and load a form in JSON\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/4#issuecomment-10730354.\n\n\n----=^.^=---\n. I don't intend to add this at the moment. Once the site is using backbone it should be easier to add so I'll rethink it then.\n. I'm sorry, I'm not entirely sure what you mean. Can you explain in another way what you had difficulty with?\n. I'm not sure what the issue is here. Please open another with a more clearly stated problem.\n. Yep. Good idea. Will do.\n. :hammer: \n. I've started modularizing the snippets into underscore templates, in preparation for converting this to a backbone.js app:\n``` html\n  data-content=\"<%=\n  popoverTemplate({items: [\n    {label: 'Label Text'  , type: 'text' , id: 'label'       , value: label },\n    {label: 'Placeholder' , type: 'text' , id: 'placeholder' , value: placeholder },\n    {label: 'Help Text'   , type: 'text' , id: 'help'        , value: helptext }\n    ]})                      %>\"\n\n Text input\n<%= label %>\n\n<%= helptext %>\n\n\n```\n\nThat way things will be much easier to add / keep up with the main bootstrap version.\nPopover options can be type text, textarea, select, checkbox etc. each with their own respective templates.\nIt's a bit of a mess at the moment but I'll put up another branch when things start to get organized. Been wrapping my head around how I want to lay this out in backbone so it's taking a little longer than expected.\n. OK I added required as a checkbox for the input elements.\n. I'm hesitant to add too many of these, I think things like validation patterns are better added to the generated source. I don't want the popup to be too cluttered.\n. Please create a separate issues for these requests. I'm not convinced validation patterns belong in the basic form builder, but a dropdown to select \"type\" eg. text, email, url sounds good.\n. This is something better served by another library, and added later.\n. Thanks for the commit!\nYes, I'm rewriting this, but I will be happy to merge anything which improves the current version.\nIt's quite hard to see what changed if the entire file is replaced.. Is it possible to make a commit with only the parts you added?\n. Also some other things which need fixing before I pull:\n- having an id set by default to eg. \"text\" means that you will have overlapping id's if you don't set them.\n- The form in the popover isn't being populated by the id / name if it is set \n  - i.e. set an id -> save -> click again to set id & it's blank.\n- mixed tabs & spaces\n- some formatting issues but not too important - I can reformat later\n. - spaces & tabs.. and \n- git config core.autocrlf = true (It's really hard to see what you committed the first time because windows added a lot of ^M's to every line)\n- If the id/name $(e).val() is set to \"\", we need to $(value).removeAttr(\"id\").removeAttr(\"name\") \n. This is included as part of rewriting the tool using bootstrap.\n. Having blank (id / name) attributes isn't considered valid HTML.\n. You mean a set of combined inline elements? Eg. Two text inputs, an input and select etc.\n. No, unfortunately that would require pretty extensive changes to the drag & drop.\nSupporting two dimensions as it were.\nSorry but apart from perhaps offering some pre-made two column options, that's outside the scope of this quick & dirty tool.\n. I'm having trouble reproducing this. What did you enter for your values? Can you give me the steps it took to make it break?\n. Thanks Kurt, let me know if you see it again. Also, if possible, when you see it happening can you let me know if there's any message in the Javascript console? It might be throwing an error which will make it easier to track down.\nThe code is not well organized, but the two long if / else trees are where you want to be looking, along with the \"vartype\" data attribute which tells the function how to create the item from the popover values and vice versa.\n. Hmm.. Maybe this has to do with the \"group\" name being the same.. try changing the group name of the inline radios before adding the others.\n. Thanks for taking the time to give a detailed description. I'll look into\nit as soon as I can.\nOn Thursday, December 20, 2012, truks wrote:\n\nThanks much for the pointer, Adam. That should help me a lot in what I\nwant\nto do.\nWhen I was having the issue earlier, I had chrome's javascript console\nopen,\nand I did set a breakpoint in the code to try to see what was going on,\nbut\nI didn't have the time to put into it then.\nI do know, though, that there were no error messages.\nOk, Adam, it is doing it again right now.\nHere is exactly what I did:\n1. open index.html in chrome.\n2. select radio tab.\n3. drag an inline radio group to the form (I notice here that in my\n   browser,\n   the first radio is checked, and it stays checked when I change the\n   options.\n   the inline radio is the only object that has an item checked).\n4. change the options (I went from 1 2 3 to Pass Fail, and this succeeds).\n5. drag a radio buttons object (not inline) into the form below the\n   existing\n   radio group. (when I drop the new object into the form, the first radio\n   group checked item becomes unchecked, and the first radio button in the\n   new\n   group becomes checked!!! Interesting.).\n6. attempt to change the items in the new group, can change the label\n   text,\n   cannot change the button items.\nSo, since this is directly after a fresh boot, directly after opening the\nbrowser, I would guess that this is real after all.\nI did this with the js console open, no error messages.\nI just refreshed the browser, and now I can't get the same result.\nThat's all I know at this point, but I forgot to mention the 'jumping\nselected radio' thing (it seems like the selected radio jumps from one\ngroup\nto the next, visually, when I drop the new group).\nI likely won't have time to work with this more today, but I will be\nworking\non it in the future, and I will definitely be on the lookout for anything\nmore I can find out if I see this again.\nThanks for your work on this project, it definitely is a useful one, and I\nappreciate your efforts.\nKurt Stevens\n-----Original Message-----\nFrom: Adam Moore [mailto:notifications@github.com ]\nSent: Monday, December 17, 2012 9:03 PM\nTo: minikomi/Bootstrap-Form-Builder\nCc: truks\nSubject: Re: [Bootstrap-Form-Builder] Radio buttons in Chrome browser\n(#13)\nThanks Kurt, let me know if you see it again. Also, if possible, when you\nsee it happening can you let me know if there's any message in the\nJavascript console? It might be throwing an error which will make it\neasier\nto track down.\nThe code is not well organized, but the two long if / else trees are where\nyou want to be looking, along with the \"vartype\" data attribute which\ntells\nthe function how to create the item from the popover values and vice\nversa.\n\nReply to this email directly or view\n<\nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/13#issuecomment-1\n1471045> it on GitHub.\n<\nhttps://github.com/notifications/beacon/T3izrWDRT7aPvJfy0ZccLCJgtrP3vxe4duR\nPVuWa8QhiMN67aPaiRYx4Vm0oMqdu.gif>\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/13#issuecomment-11543914.\n\n\n----=^.^=---\n. #15 seems to have solved it. I'll close this for now - please reopen if you see the behavior again\n. Thanks! :floppy_disk: \n. I don't understand what you're asking. The site has no modal windows.\n. Not going to add this. If you want, you can fork and have it so the builder exports / imports the my-form collection as JSON. \n. OK I think I know what this is. There's a [].map(function(){}) in there\nwhich I changed to use _.map([], function(){})\nCan you test here: http://poyo.co/forms/\nOn Mon, Mar 18, 2013 at 6:02 PM, Tetsuya Tatsumi\nnotifications@github.comwrote:\n\nIE log is below\n\u001b$B%*%V%8%'%/%H$G%5%]!<%H$5$l$F$$$J$$%W%m%Q%F%#$^$?$O%a%=%C%I$G$9!#\u001b(B\nmain-built.js \u001b$B9T\u001b(B26\u001b$BJ8;z\u001b(B172609\nrender:function(){this.$el.empty();var n=this;\n^\n\u001b$B!=\u001b(B\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/19#issuecomment-15044505\n.\n\n\n----=^.^=---\n. OK, i disabled selection for $('form') .. can you check again?\nOn Mon, Mar 18, 2013 at 6:33 PM, Tetsuya Tatsumi\nnotifications@github.comwrote:\n\nVery Good, I can do it.\nAnd I found other problem, this also IE only,\nAfter drop Radios or checkboxes, and singble button and double button, all\nthe text is selected.\nOther Components are going well.\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/19#issuecomment-15045616\n.\n\n\n----=^.^=---\n. Please open another issue with details of that bug. \n. I'm building everything into main-built using r.js . I'll add a description\nof this and close this issue thanks.\nOn Monday, March 18, 2013, Tetsuya Tatsumi wrote:\n\nHi,\nin index.html describes belows,\n\nIn source path , main-build.js have not included.\nto describe main.js is not currect ??\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/20\n.\n\n\n----=^.^=---\n. Thanks, I can't see your image though can you re-attatch?\n. Can you check again please? On http://bootstrap-forms.heroku.com.\nIt fixed it for most cases, but still happens occasionally. Still trying to pin down the cause.\n. Thanks. There was another place where I'd used .map, and also .trim for a string which was not working in IE8.\n. Great! I changed some selection preventing CSS. :cat2: \n. :+1: \n. :octocat: :ok_woman: \n. 869c17789775ecd674c6b0e6359e35b5a1657d2d\n:tada: \n. Thanks! :lollipop: \n. @php-coder  Can you check again now?\n. 53a17187d204b7d8cd6a110cda863af62c8ed3b0\n. thanks again :+1: \n. Please see http://twitter.github.io/bootstrap/ for general information on using bootstrap. \n. Clicking on a form element will give you a popover allowing you to edit some properties. If you need more properties, please fork the project and add them to the yaml / underscore templates and recompile.\n. Yep it can be done. A dropdown to select sizes?\nOn Wed, May 8, 2013 at 2:49 PM, Ivan notifications@github.com wrote:\n\nThanks, the Form Builder saves me lot of time!!! :-)\nPlease, can you add the option to choose which class to add instead of the\ndefault \"input-xlarge\", even for textareas?\nMany many thanks!\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/33\n.\n\n\n----=^.^=---\n. I think span1 - 12 don't really work well with this form builder.. since\nthe actual form itself is span6. I'll add the other size classes though.\nThanks!\n. OK! Give it a go! :point_right: : 58f7120bc0ffd1adb38ba6491104ca106fc1f581\n:octocat: :cactus: \n. Yeah, unfortunately I noticed that too..\nI could add a max-width / overflow hidden to the target form but it still\nlooks a bit weird.\nMaybe that's the best I can do with a span6 target form!\nOn Fri, May 10, 2013 at 8:57 PM, Ivan notifications@github.com wrote:\n\nMany thanks! I noticed that XXLarge expands too much in the Form Builder,\nbut functionalities are untouched (I can still drag & drop)\nMaybe (but it's NOT crucial, it's still great now!!!) you could drop the\nlarger sizes and fill in the smallest ones even with span* (say, 'til span4\nor span5)...\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/33#issuecomment-17716480\n.\n\n\n----=^.^=---\n. Just added some cosmetic fixes for this. Best I can do I think!\nOn Fri, May 10, 2013 at 9:01 PM, adam moore nerdfunk@gmail.com wrote:\n\nYeah, unfortunately I noticed that too..\nI could add a max-width / overflow hidden to the target form but it still\nlooks a bit weird.\nMaybe that's the best I can do with a span6 target form!\nOn Fri, May 10, 2013 at 8:57 PM, Ivan notifications@github.com wrote:\n\nMany thanks! I noticed that XXLarge expands too much in the Form Builder,\nbut functionalities are untouched (I can still drag & drop)\nMaybe (but it's NOT crucial, it's still great now!!!) you could drop the\nlarger sizes and fill in the smallest ones even with span* (say, 'til span4\nor span5)...\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/33#issuecomment-17716480\n.\n\n\n----=^.^=---\n\n\n----=^.^=---\n. Yep makes sense! Thanks I'll add it.\nOn Wed, May 8, 2013 at 2:55 PM, Ivan notifications@github.com wrote:\n\nPlease, can you add the \"for\" attribute (tied to relative input field) for\n\"control-label\"s?\nMany thanks :-)\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/34\n.\n\n\n----=^.^=---\n. Check it out :point_right:  ec78d6e4c02f7adaac13e64b8ff74131aade1202 \nI also added it for checkboxes :checkered_flag: \n. Ah, I should add this to the readme:\n- In the js/data/yaml folder are yaml files each, of which corresponds to a tab in the form builder.\n- If you just want to add a new element you need to:\n  - describe it in one of these files\n  - parse the yaml to json using parse.rb in the same folder\n  - create a corresponding template in the templates/snippet directory\n  - add the template to snippet-templates.js\n- If you want to add a new tab, you'll also need to adjust the app.js file to make sure the tab is loaded.\nAdding a new type for the popover is much more involved. I'd recommend looking at how the others are implemented if you want to go down this route.\nThis isn't really an \"issue\" as such, so I'll add a note on the readme and close this.\n. :blush: \n. Hmm. I can see the reasoning behind it, but is it really a problem?\n. Wow.. which browser are you using and how are you getting those results?\nIn chrome I haven't observed such a collapsing of the textarea before. Thanks for pointing it out - I'd like to test in the same browser you use before merging.\n. :+1:\n. Sorry, there's no simple way to do this with the way the web app is designed.\n. No, this is beyond the scope of this tool.\nPlease make the regions separately and then integrate them into your page.\n. Are you running a server from the root directory? eg python -m\nSimpleHTTPServer\nOn Wednesday, July 3, 2013, Keeo wrote:\n\nHi,\ni am not able to switch to development mode. One would simply assume that\nclone repository and switch script to this\n\nwould be enough but it doesn't work.\nIs it wrong or is there something missing in the readme?\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/39\n.\n\n\n----=^.^=---\n. Hey, this should be pretty easy because the whole created form is stored as a backbone model. I'll get back to you about this soon.\n. Add:\nthis.collection.on(\"add\", this.toJson, this);\n  this.collection.on(\"remove\", this.toJson, this);\n  this.collection.on(\"change\", this.toJson, this);\nhere: https://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/views/my-form.js#L17\nand:\n```\n, toJson: function() {\n  console.log(this.collection.toJSON());\n}\n```\nhere: https://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/views/my-form.js#L39\nOpen the console, and look at the output.\nYou should see the object which is used to create the form.\nIf you pass it in here:\nhttps://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/app.js#L49-L59\nYou can repopulate the form on creation.\n. There was no mention of that in the documentation, and when I created the\nform builder I just followed the examples on bootstrap site.\nIt seems that bootstrap 3 is coming soon, so a lot will have to be redone..\nI think this can wait until then.\nOn Thursday, July 25, 2013, Maximilian Mackh wrote:\n\nAccording to: twitter/bootstrap#3413https://github.com/twitter/bootstrap/issues/3413\ninput-xlarge, input-xxlarge, etc. are only there for legacy reasons.\nI tripped on this issue because with the form builder, select and input\nhave different sizes.\nIs there a reason for still using the legacy css tags?\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/41\n.\n\n\n----=^.^=---\n. Will fork & create new version.\n. Well.. what have you tried?\n. Hmm. If you change the html and nothing changes, sounds like a caching issue. try disabling caching and try again.\n. Even to html? This doesn't sound like something specific to the form\nbuilder.\nOn Tue, Aug 13, 2013 at 11:38 PM, kleach notifications@github.com wrote:\n\nI have disable my cache in both Chrome and Firefox, but I don't see my\nchanges..\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/42#issuecomment-22569395\n.\n\n\n----=^.^=---\n. OK, I made the tabs add to #formtabs .. just use a different id for your own.\n. fixed .active tab to be unique to form builder too.\n. This is beyond the scope of the form builder.\nLook at https://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/app.js#L49-L56 where a MyFormView is being created. You can pass it a collection of form objects to get the view\n. Check out https://github.com/minikomi/Bootstrap-Form-Builder/issues/40#issuecomment-24131496\n. I won't add it in to this version, but feel free to do what you like.\nOn Fri, Sep 13, 2013 at 6:15 PM, hardik-dave notifications@github.comwrote:\n\nThanks minikomi, I already found the same solution earlier and sent you an\nemail personally asking your permission to submit the changes, but anyway,\nthanks for your effort to make it available, i'm sure a lot of people will\nbe benefited from this.\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/44#issuecomment-24382414\n.\n\n\n----=^.^=---\n. This project uses require js and avoids declaring globals.\nMore info here: http://requirejs.org/\n. Yep, it'll be a fork though. I think many people will stick with 2 for the time being...\n. @aponxi no problem, i'll let you know.\n. How would you see this working?\n. Try exploring the my-form.js \nhttps://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/views/my-form.js\nusing breakpoints and the js console.\n. Sorry, only bootstrap normal elements.\n. Yeah I'll fork and create a bootstrap 3 version eventually. Thanks.\n. No. This is a developer tool, so I think desktop support is enough.\n. https://github.com/minikomi/Bootstrap-Form-Builder/issues/40#issuecomment-24131496\n. Can you give a more specific example of how to recreate the bug? \n. @mazen79 I tried but couldn't reproduce.. can you give specific instructions?\n. What exactly do you mean by reset?\n. You need to set the id/name so that it is unique for each form element.\nOn Mon, Sep 16, 2013 at 3:17 PM, mazen79 notifications@github.com wrote:\n\nOne of them has no value selected.\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/53#issuecomment-24490661\n.\n\n\n----=^.^=---\n. Click on an element and edit the ID/Name or group name attribute.\n. Base components only.\n. That's more of a ruby environment problem.\n. Not possible unless you create them in the original templates.\n. Thank you. I added it for radios & checkboxes.\n. Fork & Change labels here. https://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/app.js#L19-L41\n. The formatting is standard Bootstrap. You can already do this with, say, a text input item.\n. Not sure what you're saying? You tried to add something but couldn't.. The original form is defined in app.js\nhttps://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/app.js#L47-L60\n. Good idea. Will add it in at some point.\n. 496f186a3d6ecf0c178cfa8c108eec173f077a26\n. Just add them after the form is created.\n. Not sure sorry.\n. Browser version?\n. I don't know what your issue is.\n. Add readonly attribute to the input element http://www.w3schools.com/tags/att_input_readonly.asp\n. You need to use a local web server.\nTry python -m SimpleHTTPServer 8000 and go to localhost:8000 \n. Not in scope for this repository.\n. https://github.com/minikomi/Bootstrap-Form-Builder/issues/40#issuecomment-24131496\n. It's not an issue with this repository. If you want to fork it, create an app on top of it which can read and save forms from a database, feel free to do so.\n. Sure but that's not what this is for. It's just a simple bootstrap form builder, not a component intended to be added to another project.\n. I think this was added in bootstrap 3? I'll get around to updating everything soon.\n. The only way to do this is to make two-column elements as new templates, I'm afraid.\n. Fixed! Thanks.\n. Yep, this is fixed. \n. Try gem install json first\n. Thanks mcrayne\n. Hmm. Thanks for pointing it out, you're right, I just made this for myself so I didn't take into consideration people extending it. Maybe each snippet should have a snippet-name: field.\n. Not going to happen.\n. Outside scope of project. Please fork.\n. Use a web server in the root of the project.\n. You mean, add an HTML5 type=\"email\" input?\n. Sorry, only simple horizontal forms. Not a product either - just a simple tool.\n. It's possible, but not relevant to this project.\n. Thank you. I fixed escaping in a bunch of templates.\n. It was there in about the 3rd line of the Readme, but I updated the actual site too.\n. Please make it yourself. Read past issues.\n. Yep, sounds like a good idea. On add I'll check for a duplicate name. After that they're on their own.\n. 1. learn backbone js.\n2. read code.\n. Use css or change the templates to not have labels.\nOr just edit the resulting html.\n. Thank you @dptole & @emmar. I added in the relevant field and adjusted the templates.. Can you check if it's fixed the problem for you and close if so?\nI didn't use the pull request as I'd rather fix the source than the compiled js.\n. Outside the scope of this repo. Please fork and add yourself.\n. Easier to dump the json from bootstrap and reload from there. Good luck!\n. Sorry, no idea what you're talking about? This is only version 2.\n. This is a basic vanilla bootstrap 2 builder - if you need custom attributes please fork.\n. This is not within the scope of this repository\n. Good luck, but this is not a component to be included - it is a standalone.\n. Not sure what you mean?\n. Did you build the script using r.js? Or change the index.html to use the unbuilt version?\n. No, sorry.\n. Fork and remove from json / remove from yaml and compile.\n. Good luck.\n. Fork and add them.\n. Please contact bootsnip guys. I didn't make the bootstrap 3 version.\n. Read http://requirejs.org/ and try again\n. You can learn about require.js here:\nhttp://requirejs.org/\n. Not me. Check the forks.\n. I only maintain the version here:\nhttps://minikomi.github.io/Bootstrap-Form-Builder/\nDoes that work? @MaxPleaner \n. ",
    "craighooghiem": "I personally rebuilt this entire thing with this method in mind. I can now re-populate the form based on data stored somewhere (file, database, etc) and it works again.\nThere are a couple things that need to happen though - the whole system has to work as an \"instance\" so that you can apply the javascript after you append the contents, otherwise the form builder won't work when you reload the existing data. I also had to do this so I can have multiple form builders on one page of my CMS applications.\nUnfortunately, I'm not sure how I can re-package what I've done to share it back, since it's 100% deviated from what you have here and tied to a CMS database. The point I'm trying to make is that it's quite possible, just needs a tweak to re-load the data into the form builder and it should work. \n. This came up in discussion earlier.. I think there's a StackOverflow question on the matter also.\nWhat you built this for and what it can be used for are two very different things. I am using it as part of a CMS that allows the user to create (and later on edit) forms for the front-end of their website. \nSo, I adjusted the generate functions so that the database now stores the \"post generate\" code that is clean and useful on the front-end of the website, but I also stored the un-edited code in the database so I can re-load a form from the database, populate that side of the form with the old markup and then make any changes necessary.\nWorked out quite well when it was all said and done. \n. This wouldn't be that difficult to implement. Which validation attributes do you want added/removed specifically?\nOr are you just referring to things like required, email, etc?\n. Waiting until after the weekend to look at this. Minikomi discussing some overhaul changes.\n. This makes sense. I think it's a good way to do it.\nI'm not so sure about the backbone part, but if it works then that's perfect for most people.\n. It looks reasonable to me. However, the whole thing is being rebuilt right now and possibly being ported to backbone.\nI've asked him to look at adding name and ID fields as this is an oversight for a form generator.\nFor my personal build I basically did what you did. \n. I believe this is an issue with the new version of Bootstrap, because they added an html boolean value to the JS.\nhttp://twitter.github.com/bootstrap/javascript.html#popovers \nNow you have to add html:true to the popover in order for the HTML to be parsed, as it defaults to false.\n. No problem. Been there, had that issue, fixed it.\nI was going to file a pull-request but I'm about 9 light years away from this build now.\nI wrapped mine up into a fuelPHP CMS and it's grossly modified.\n. No it's not and it won't ever be.\nI'm moving all my projects to Laravel and letting this one die a slow death. \nIt's a block-based CMS, similar in concept to PyroCMS, but not similar in execution at all.\nHowever, with PyroCMS moving to laravel a bunch of great changes are happening for CMS therein.\n. I work for a company (Vicimus in Ontario, Canada) and I'm the manager for everything development. \nI built the CMS myself and no one else has touched it yet. It was made for clients to be able to manage the websites we create for them, so it serves it's purpose, but not much more.\n. I had this working on the previous setup.\nI'm going to look into adding it here and see if it makes sense.\nIs the backbone stuff online yet or still in development?\n. Bootstrap does not have captcha form types, so it doesn't make that much sense to include this.\nAlso, JS based captcha forms that have visible logic tend to be less secure than the alternative anyways. \nThe code generated here should be phase 1 of your form project. \nOnce the form is generated, add the captcha manually and properly and write your form processor script.\n. ",
    "bluee": "It would be really nice if you could save and load a form in JSON\n. Hi, thanks for your quick response!\nI would use it for creating dynamic forms, so that users could create forms on the fly.\nSomething like https://github.com/joshfire/jsonform except yours is way much cooler :)\n. ",
    "Iristyle": "Yeah, attributes like required, new input types, etc.\nhttp://caniuse.com/#feat=forms\nHere's another decent table on the state of HTML5 forms\nhttp://wufoo.com/html5/\n. ",
    "ghost": "First of all, thank you for this nice tool!!\nHow about adding more types like \"email\", \"number\", \"url\" and so on... ? I would also be happy to see the possibility to set a specific pattern for a form field.\nedit:\nIf it's possible, please remove unused elements from the final code, like the help-element.\n. First I changed the data-main  to point to assets/js/main.js \nThen to build.js (and I don't know what to do with the r.js). Then changed it to assets/js/main-built.js\nAnd I didn't run the command bc I don't know what that is. \nI made a change to the about.html file and it still shows up as what it came with when I originaly downloaded\n. I  have disable my cache in both Chrome and Firefox, but I don't see my changes..\n. Here is what I have if you wanna check it out: https://github.com/kleach/Bootstrap-Form-Builder\n. DId my code work for you?\n. Hi . Can you reference or let me know where I can find the bootstrap3 form builder that will be awesome.  Thanks \nSwagato Bhatta\nemail: admin@swagatobhatta.com\n. Same here.\n. ",
    "jiji262": "The following problems has been fixed, I will pull later.\nhaving an id set by default to eg. \"text\" means that you will have overlapping id's if you don't set them.\nThe form in the popover isn't being populated by the id / name if it is set i.e. set an id -> save -> click again to set id & it's blank.\nmixed tabs & spaces\n. ",
    "mustafauysal": "automatic id would be handy\n. ",
    "cassdsghxw": "that means: \nForm Name\ncolumn1(label + field) [blank space] column2(label + field) \ncolumn1(label + field) [blank space] column2(label + field) \ncolumn1(label + field) [blank space] column2(label + field) \ncolumn1(label + field) [blank space] column2(label + field) \ncolumn1(label + field) [blank space] column2(label + field) \nSubmit\n. ok, tks for you reply; i'm try to rewrite the code to implement my requirement....\n. ",
    "truks": "Adam,\n```\nThanks for the reply.\nYes, I'm using chrome on XP Pro SP3. \nThe chrome version is 23.0.1271.97 m.\nI saw the issue when I added any radio set to a form. I downloaded the\n```\nwindows zip package and extracted it intact, and was using the index.html.\nThe first time I went to change the options, the change would work, but\nsubsequent attempts to change the options would fail.\nThis morning, I am working with it again, and I am not seeing the same\nbehavior.\nPerhaps my system had some instability last night that the boot this\nmorning has resolved.\nIn any case, I was only seeing the issue with the radio elements, and it\nwas only the options with those (I could always change the label and group,\neven when the options issue was happening).\nI will keep an eye on this as I use it and try to narrow down more info\nif I see it happening again.\nSince you are a developer with this project, I would like to ask you\nanother, unrelated question.\nI am wanting to modify this source for my needs, specifically to change\nthe output (the result in the generated source tab)\n(no, I had not edited the source when I was seeing the issue, I have not\ntried to change it yet)\nI would like to change the output into an encoding I am working on to\nuse for another project.\nI see in fb.js in the genSource function where the output for radios and\ncheckboxes is generated, but I am wondering if you will give me a pointer\nand/or any insight to where the other elements' source is generated.\nI know eventually I could figure it out, but I figure you are already\nmuch more intimate with the code, and could likely save me a bunch of time.\nAgain, thanks for the reply, and thanks for any additional help you can\ngive.\nKurt Stevens\n-----Original Message-----\nFrom: Adam Moore [mailto:notifications@github.com] \nSent: Sunday, December 16, 2012 9:24 PM\nTo: minikomi/Bootstrap-Form-Builder\nCc: truks\nSubject: Re: [Bootstrap-Form-Builder] Radio buttons in Chrome browser (#13)\nI'm having trouble reproducing this. What did you enter for your values? Can\nyou give me the steps it took to make it break?\n\nReply to this email directly or view\nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/13#issuecomment-1\n1428573 it on GitHub. \nhttps://github.com/notifications/beacon/T3izrWDRT7aPvJfy0ZccLCJgtrP3vxe4duR\nPVuWa8QhiMN67aPaiRYx4Vm0oMqdu.gif \n. Thanks much for the pointer, Adam. That should help me a lot in what I want\nto do.\nWhen I was having the issue earlier, I had chrome's javascript console open,\nand I did set a breakpoint in the code to try to see what was going on, but\nI didn't have the time to put into it then.\nI do know, though, that there were no error messages.\nOk, Adam, it is doing it again right now. \nHere is exactly what I did:\n1. open index.html in chrome.\n2. select radio tab.\n3. drag an inline radio group to the form (I notice here that in my browser,\n   the first radio is checked, and it stays checked when I change the options.\n   the inline radio is the only object that has an item checked).\n4. change the options (I went from 1 2 3 to Pass Fail, and this succeeds).\n5. drag a radio buttons object (not inline) into the form below the existing\n   radio group. (when I drop the new object into the form, the first radio\n   group checked item becomes unchecked, and the first radio button in the new\n   group becomes checked!!! Interesting.).\n6. attempt to change the items in the new group, can change the label text,\n   cannot change the button items.\nSo, since this is directly after a fresh boot, directly after opening the\nbrowser, I would guess that this is real after all.\nI did this with the js console open, no error messages.\nI just refreshed the browser, and now I can't get the same result.\nThat's all I know at this point, but I forgot to mention the 'jumping\nselected radio' thing (it seems like the selected radio jumps from one group\nto the next, visually, when I drop the new group).\nI likely won't have time to work with this more today, but I will be working\non it in the future, and I will definitely be on the lookout for anything\nmore I can find out if I see this again.\nThanks for your work on this project, it definitely is a useful one, and I\nappreciate your efforts.\nKurt Stevens\n-----Original Message-----\nFrom: Adam Moore [mailto:notifications@github.com] \nSent: Monday, December 17, 2012 9:03 PM\nTo: minikomi/Bootstrap-Form-Builder\nCc: truks\nSubject: Re: [Bootstrap-Form-Builder] Radio buttons in Chrome browser (#13)\nThanks Kurt, let me know if you see it again. Also, if possible, when you\nsee it happening can you let me know if there's any message in the\nJavascript console? It might be throwing an error which will make it easier\nto track down.\nThe code is not well organized, but the two long if / else trees are where\nyou want to be looking, along with the \"vartype\" data attribute which tells\nthe function how to create the item from the popover values and vice versa.\n\nReply to this email directly or view\nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/13#issuecomment-1\n1471045 it on GitHub. \nhttps://github.com/notifications/beacon/T3izrWDRT7aPvJfy0ZccLCJgtrP3vxe4duR\nPVuWa8QhiMN67aPaiRYx4Vm0oMqdu.gif \n. If I change the group name, the first radio stays selected, and the first\nradio in the second group is selected as well.\nNot seeing the issue today (yet).\n-----Original Message-----\nFrom: Adam Moore [mailto:notifications@github.com] \nSent: Thursday, December 20, 2012 2:35 AM\nTo: minikomi/Bootstrap-Form-Builder\nCc: truks\nSubject: Re: [Bootstrap-Form-Builder] Radio buttons in Chrome browser (#13)\nHmm.. Maybe this has to do with the \"group\" name being the same.. try\nchanging the group name of the inline radios before adding the others.\n\nReply to this email directly or view\nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/13#issuecomment-1\n1562880 it on GitHub. \nhttps://github.com/notifications/beacon/T3izrWDRT7aPvJfy0ZccLGK2SBkTn0clMFr\nB1KcfB1cHCgBn-BL4BQSO6W15gX2b.gif \n. OK, thanks.\nGreat product!\n-----Original Message-----\nFrom: Nuno Santos [mailto:notifications@github.com] \nSent: Sunday, December 23, 2012 10:51 AM\nTo: minikomi/Bootstrap-Form-Builder\nCc: truks\nSubject: Re: [Bootstrap-Form-Builder] Radio buttons in Chrome browser (#13)\nFWIW, this is very likely related to issue #15\nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/15 . It should\nbe fixed now.\n\nReply to this email directly or view\nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/13#issuecomment-1\n1647282 it on GitHub. \nhttps://github.com/notifications/beacon/T3izrWDRT7aPvJfy0ZccLCJgtrP3vxe4duR\nPVuWa8QhiMN67aPaiRYx4Vm0oMqdu.gif \n. ",
    "nfvs": "FWIW, this is very likely related to issue #15. It should be fixed now.\n. Re-created with pull-request fix.\n. ",
    "jogarriot": "@minikomi what he means is when you host the formbuilder inside the modal window you the drag-drop wont work. \nWhen I use FF it inserts the temp form before the title. When using IE it simply will not show.\n\n\n. ",
    "aaroncastanos": "Thank you for the email.  Please be aware that my email address has recently changed to aaron.castanos@connectedbusiness.com. \nThe email you sent will be forwarded to my new email address.\nThank you,\nAaron Castaños\n. ",
    "sanjaysparx": "Thanks Aaron! Please look into my issue & advice.\nKindest Regards,\nSanjay\nOn 02/14/2013 03:54 PM, aaroncastanos wrote:\n\nThank you for the email.  Please be aware that my email address \nhas recently changed to aaron.castanos@connectedbusiness.com. \nThe email you sent will be forwarded to my new email address.\nThank you,\nAaron Castaños\n—\nReply to this email directly or view it on GitHub \nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/17#issuecomment-13541308. \n. \n",
    "frutik": "I have same problem\n. ",
    "ankurngm": "If anyone of you suceeded in accomplishing it, can you please share the snippet. I need to do the following?\n1. Create form using plugin\n2. Save the generated collection as json/yaml in database \n3. Re-create the form using the save information.\n- Thanks.\n. qfard - No I couldn't, instead created myself in different technology.\n. Used AngularJs with Drag n  Drop plugin\n. If anyone of you guys have the snippet/solution/pointers, can you please share it here or some Wiki... I can see many people are trying to accomplish the same thing and are struck...\n. Not sure about this library, but you can easily accomplish it via AngularJs. Have you tried exploring that?\n. ",
    "qfard": "ankurngm,\ndid you find a solution, without saving it and reusing it, it would do me any good...\nTIA\n. Ankurmgn,\nThanks for the reply.\nMay I ask what approach/technology did you use to accomplish this?\n. hardik-dave,\ncan you please share saving to and reloading from database?\nTIA\n. That would be a nice option - did you find an answer?  I can modify template to put the X but not sure what event it should trigger.\n. thanks.\nbefore I do that, is there way to bring it back and re-edit the form?\n. is there a sample code somewhere or tutorial I could follow? I am really new to this \n. no i didn't mean sample of serialize - i meant sample of the serialize, json, saving and retrieving it back...  willing to pay for your time for sample too...\n. I can do the page in PHP or ASP... I want to have it display on the page and have a lightbox popup for edit mode and the popup can be in PHP or ASP.\nthanks guys.\n. i really appreciate your help.  one day when we are in the same city, I'll buy you a beer or two... BTW, I am in Philadelphia area\n. thanks and my offer stands - i am really new to backbone and have only done one other JSON call - so really new here...\n. how? have you done it?  I don't know backbone \n. i am working at it right now but do need help...my email is qfardinboxcom -----Original Message-----From: notifications@github.comSent: Thu, 12 Jun 2014 00:47:35 -0700To: bootstrap-form-builder@noreply.github.comSubject: Re: [Bootstrap-Form-Builder] Save to database & re-edit? Has anyone been able to do it? (#88)@qfard  Do you still looking for the solution? I can help you in this case. If you need any help you can knock me.\nThanks\n—Reply to this email directly or view it on GitHub.\nFree Online Photosharing - Share your photos online with your friends and family!\nVisit http://www.inbox.com/photosharing to find out more!\n. that too - i found the templates and can make the changes as needed. thanks.\n. Thanks.  Great product.\nJust in case someone else needs/wants it, I have solved it, contact me for the code.\nBelow is a new tab I create that has some useful stuff like:\n1- heading\n2- horizontal line\n3- line break\n4- first name / last name on single line\n5- full address widget\n\n. does anyone know what can create a blank or  in the popup?\n. ",
    "ibanez0r": "http://api.jquery.com/serialize/ \n. sample code -> http://www.php.net/manual/en/function.serialize.php\n. hehe, its really not too hard m8, im sure if u have a look around you will find full working examples of how to do it in existing form building web plugins for wordpress etc, i will have a try later on tonight and see if i can do it ok! and ill post back here later to let you know how i go.\n. I will try, sure!\n. Well i had a quick look into doing this, i am too busy sadly tonight to do the entire script but i can give an example of how to save your form then load it, i will fork this and post tomorrow at some point a full working example. as its really not very complex i dont req any payment brother. \n. So just an update m8 i managed to save the form as a serialized string that u could convert to json etc, very easily, having a few issues loading the form atm, tho i think i can prob figure it out. will keep u posted!\n. ",
    "msurguy": "Oh, will try that, that must be it! \nThanks @craighooghiem !!! You saved my day =)\n. I see that there is a Backbone branch in this repo now, hopefully that will be available soon =) \nIs your FuelPHP cms module open source? I want to make something like that for Laravel PHP framework too =)\n. Cool! \nDo you have co-founders or collaborators on the CMS? \nI am also developing a CMS but with different focus. \nThis form builder was just for Bootsnipp.com website that I made with Laravel long ago =) \n. ",
    "dokechin": "IE log is below\nオブジェクトでサポートされていないプロパティまたはメソッドです。\nmain-built.js 行26文字172609\nrender:function(){this.$el.empty();var n=this;\n                                                       ^\n. Very Good, I can do it.\nAnd I found other problem, this also IE only,\nAfter drop Radios  or checkboxes, and singble button and double button, all the text is selected.\nOther Components are going well. \n. I checked agein, but not mended.\n. Oh, reatach this.\n\n. Hi,\nI found #19 issued has not merged , please confirm again.\n. Excellent !! I tryed again, and I found it was fixed.\nThank you very much.\n. Hi !\nI tryed agein at new version. This proglem have fixed.\n. There is no name attribute on radios and check boxes. \nOther components has. \n. ",
    "php-coder": "Thank you, now it works!\n. ",
    "rizqyhi": "sorry, my mistake, I didn't noticed them.\n. ",
    "ivansammartino": "Yes, thanks! Sizes (input-mini, input-small, etc.) and classes (span1, span2, etc.), please\nReally, this form builder is amazing!!!\n. NP! I'll later do a \"search and replace\" in my text editor in case I'd need to use spans :-)\n. Many thanks! I noticed that XXLarge expands too much in the Form Builder, but functionalities are untouched (I can still drag & drop)\nMaybe (but it's NOT crucial, it's still great now!!!) you could drop the larger sizes and fill in the smallest ones even with span* (say, 'til span4 or span5)...\n. Thanks! :-)\n. Very nice, thanks!\n. ",
    "simith": "Thank you for that and the great stuff you have built.\n. ",
    "IonicaBizau": "It's a minor thing, but with a great effect (at least for me) and I promote it everywhere I can.\nThis will prevent the following cases:\n1\n\n2\n\n3\n\n. I am a Firefox fan, so I use it as default browser. \nIn Chrome we can't make it narrower but wider, like in the screen shot bellow:\n\n. ",
    "Keeo": "Oh, that was the issue. Thank you for fast help.\n. ",
    "yosephlodamo": "This is the best form builder I have seen so far!\nI am hoping you will get back to this issue because I want to store the designed form in json format in a database and reload it later.\nThanks\n. ",
    "matt-e-king": "This is perfect! Thanks so much. Sorry for the late reply.\nI have tested and it is working like a charm. I will be taking that JSON, storing it in a database and then reloading it dynamically into the \"new MyFormSnippetsCollection\" as you mentioned here:\nhttps://github.com/minikomi/Bootstrap-Form-Builder/blob/gh-pages/assets/js/app.js#L49-L59\nThanks!\n. ",
    "zltqzj": "How to change form-builder  to multiple column?  thanks\n. I am trying this now. but not success.\n1、change the index.html to index.jsp \n2、 change this\n <% \n String str1 = \"{title:'Form Name',fields:{name:{label:'Form Name',type:'input',value:'Form Name'}}}\"; \n String str2 = \"{title:'Text Area',fields:{id:{label:'ID / Name',type:'input',value:'Text Area'},label:{label:'Label Text',type:'input',value:'Text Area'},textarea:{label:'Starting Text',type:'textarea',value:'Default Text'}}}\";\n %>\n\n  var initControls = [&lt;%=str1+\",\"+str2 %&gt;];\n  \nstr1 str2,you can select database to get it .\nThat's my opinion.\n. ",
    "axnpro888": "@matt-e-king Hi i have checked yours solution. Its pretty neat. I just want to ask is there a way to reload the form using the Rendered HTML Code.\nI would think it as : Parsing the HTML Code to Json Object and then passing the same json to your Load Json Area.\nSo is there a way we can parse the HTML to exact the same Json which already being created every time we drag the control\n. Hi Above. The solution you posted is that having a touch support for drag and drop ??\n. Hi \nCan we add a support for dynamically adding column structure to the form builder.?\nLike the below guy has done. \nhttp://demos.anupshinde.com/form-builder-part2-1_kevin_d/index.html\n. @tanwaniniranjan  Hi have you got any success in edit form reload by passing Json or any other method ??\nI need help in that\n. @mbchandar How will you store as Json and pass it in this app.js file >?\nCan you show me ?\n. I  compiled it somehow\n. Its working. Thanks.\n. ",
    "mazen79": "hey dave did you find a solution to this problem i'm facing the same issue?\n. I'm using asp.net for my code and loading the content of the saved #render  into a hiddenField. Then i'm using a javascript function to simply copy the content of the hiddenField to #target.\nthe script is as follows:\n    function CopyToEdit(HdnFldID) {\n        var hdEdit = $(\".\" + HdnFldID).val()\n        $(\"#target\").html(hdEdit);\n    }\nIt's loading correctly to the page but i cannot edit it.\n. Simply add the 2 controls to a single form and view the html. One will reset the other.\n <form class=\"form-horizontal\">\n<fieldset>\n<legend>Form Name</legend>\n<div class=\"control-group\">\n  <label class=\"control-label\" for=\"radios\">Multiple Radios</label>\n  <div class=\"controls\">\n    <label class=\"radio\" for=\"radios-0\">\n      <input name=\"radios\" id=\"radios-0\" value=\"Option one\" checked=\"checked\" type=\"radio\">\n      Option one\n    </label>\n    <label class=\"radio\" for=\"radios-1\">\n      <input name=\"radios\" id=\"radios-1\" value=\"Option two\" type=\"radio\">\n      Option two\n    </label>\n  </div>\n</div>\n<div class=\"control-group\">\n  <label class=\"control-label\" for=\"radios\">Inline Radios</label>\n  <div class=\"controls\">\n    <label class=\"radio inline\" for=\"radios-0\">\n      <input name=\"radios\" id=\"radios-0\" value=\"1\" checked=\"checked\" type=\"radio\">\n      1\n    </label>\n    <label class=\"radio inline\" for=\"radios-1\">\n      <input name=\"radios\" id=\"radios-1\" value=\"2\" type=\"radio\">\n      2\n    </label>\n    <label class=\"radio inline\" for=\"radios-2\">\n      <input name=\"radios\" id=\"radios-2\" value=\"3\" type=\"radio\">\n      3\n    </label>\n    <label class=\"radio inline\" for=\"radios-3\">\n      <input name=\"radios\" id=\"radios-3\" value=\"4\" type=\"radio\">\n      4\n    </label>\n  </div>\n</div>\n</fieldset>\n</form>\n\n. One of them has no value selected. \n. How exactly can i do that using the form builder? shouldn't the id/name be set at form creation. \nI already created something similar using a script for setting names at page load but only for labels.\n. Yeah i know but the interface i have created will be used by users on my portal so they won't probably set the ID for these elements. I should have it by default set to some random id. Thanks for the help anyway.\n. changing the group name value will fix this issue for me. They were both set to the same value \"radios\". \n. ",
    "hardik-dave": "Thanks minikomi, I already found the same solution earlier and sent you an email personally asking your permission to submit the changes, but anyway, thanks for your effort to make it available, i'm sure a lot of people will be benefited from this. \n. Sorry guys for late response, please let me know if you still need the help saving, retrieving the information. \n. Sorry guys, been busy on a different project. @ND17  I will spare some time in couple of days and share my logic and possibly the code with you guys. For any quick information you need, please send me PM on hardikmdave at yahoo dot com \n. ok one more question, hopefully last one.\nApology for bugging you so much, and thanks for quick responses. \nI have dragged like 4 different types of controls from the right tabs to the form pane. now, how can i get hte JSON format of this generated Form with recently dropped controls? I believe, i will have to do this in my-form.js where the render code is written. I need that form to be converted to JSON so that i can then take it and utilize it.\n. nevermind, figured it out. Thanks once again.\n. ",
    "IhabSoliman": "Hey hardik-dave\nCan you tell me how you reloaded and saved the form from the database please?\n. https://github.com/IhabSoliman/Bootstrap-Form-Builder\n. https://github.com/IhabSoliman/Bootstrap-Form-Builder\nI forked it and changed it to be bootstrap 3.0 compatible, you are welcome to fix any bugs you find\n. Hey,\nCan you share your code that you use to reload the content back to the form and we can work together to fix this error you are getting.\nand we can add it to this too,\nThats my fork of this project using bootstrap 3\n https://github.com/IhabSoliman/Bootstrap-Form-Builder\n. https://github.com/IhabSoliman/Bootstrap-Form-Builder\nI forked the original project and added 3.x support, its not full and some bugs but feel free to fix anything you find and commit it.\nI personally don't have that much time now to update or fix it.\n. ",
    "prestatr": "@hardik-dave yes I'm need this. How is to re-edit OR re-load saved form from database to bootstrap-form-builder. \n. ",
    "keyurcrest": "please give me solutions of the edit form functionality. I saved render htm code in database.please give me a solutions\n. ",
    "hiteshcrest": "@hardik-dave yes I'm need this. How is to re-edit OR re-load saved form from database to bootstrap-form-builder. \n. ",
    "Nehace40": "@hardik-dave  How to save data to database and retrive that data as edit form\n. ",
    "aponxi": "Thanks! if you could mention me or reference this issue when it's up I'd appreciate it!\n. ",
    "Rawgeek": "You should be able to drag the fieldset (empty box) in the main area and be able to drag fields inside that box. This will help creating rules later. eg. If field A containe 'abc' hide/show fieldset/field.\n. ",
    "pspeth": "I would love to see this feature as well.\nIt would be useful, and interesting to see nested elements.\n. ",
    "aruld": "+1 for this feature. It would simplify grouping of form elements. Do you have plans to support this? \n. app.js gets merged into optimized main-built.js. How do I invoke the reload() function in HTML? It is confusing with require.js, because I am referencing main-built.js in HTML, but I am not sure how to call app.reload().\n<script data-main=\"/public/javascripts/lib/main-built.js\" src=\"/public/javascripts/lib/require.js\" ></script>\n. @hussv1 Could you share the code that makes the attribute readonly? I have a similar requirement. Thanks.\n. ",
    "huchister": "Same here. Need this feature absolutely. Would love to see it.\n. ",
    "siddarth-rajavelu": "Any improvement on this?\nThanks\n. HI qfard,\nI'm very interested in this feature. \nCan you send me the link to the code. srajavel@uci.edu.\nThanks \nSiddarth\n. ",
    "llonchj": "Will be a good idea to implement \"renderers\" able to build a Bootstrap 2, or Bootstrap 3, or even other type of forms...\n. ",
    "hueitan": "@IhabSoliman  @minikomi\nWhy don't you give a pull request to the author ?\n. ",
    "ripegooseberry": "Thank you, that’s grand!\nBig karma hug ☺\nFrom: Adam Moore [mailto:notifications@github.com]\nSent: 25 October 2013 04:44\nTo: minikomi/Bootstrap-Form-Builder\nCc: Pawel Orzechowski\nSubject: Re: [Bootstrap-Form-Builder] There is no Required option on Radio input types (#57)\nThank you. I added it for radios & checkboxes.\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/57#issuecomment-27057613.\n. ",
    "shethnc": "Is there's any way to add enctype=\"multipart/form-data\" ?\n. I have same question. Can it be done ?\n. ok Cool. Will be waiting for it to be finished.\nThanks\n. ",
    "XiaoqinLI": "Can you explain a bit more how did you render json object rather than html markups?\n. @minikomi can you explain a little bit more how to render form as Json object instead of html markups?\nI check issues like #40 and #63 and others, but none of them explains it explicitly.\nThank you very much.\n. I was able to output json obj in console, but how to see them in \"rendered view\"?\n. ",
    "hussv1": "What i do is set the value to a hidden text area in my form.\nEdit the file my-form.js\nIn the render section you may add code to populate your hidden textarea with the rendered code.\nCheers\n. OR is there a way to make the property read only?\nThanks\n. I figured it out. in the popover template I added an if statement for id field made that read only.\n. ",
    "bhavya-nick": "This work has already been done by matt-e-king\nyou can check it at https://github.com/matt-e-king/Bootstrap-Form-Builder\n. ",
    "kalpitpandit": "hi,\nthanks for replaying.. actually i am using PHP as my backend language so i\ncan go with jsp files...\nstill i am trying to do edit but no success...\ni am suggesting you please make this one as open issue so everyone come to\nknow and they will give their try also..\nThanks\nOn Fri, Feb 7, 2014 at 3:07 PM, miss_chalk notifications@github.com wrote:\n\nI am trying this now. but not success.\n1、change the index.html to index.jsp\n2、 change this\n<%\nString str1 = \"{title:'Form Name',fields:{name:{label:'Form\nName',type:'input',value:'Form Name'}}}\";\nString str2 = \"{title:'Text Area',fields:{id:{label:'ID /\nName',type:'input',value:'Text Area'},label:{label:'Label\nText',type:'input',value:'Text Area'},textarea:{label:'Starting\nText',type:'textarea',value:'Default Text'}}}\";\n%>\nstr1 str2,you can select database to get it .\nThat's my opinion.\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/70#issuecomment-34421260\n.\n. \n",
    "akoskm": "Why don't you create a pull request for this one?\n. ",
    "tanwaniniranjan": "https://bountify.co/new-version-of-bootstrap-formbuilder-in-v3\n. Please look for the bootstrap 3 version here\nhttps://bountify.co/new-version-of-bootstrap-formbuilder-in-v3\n. Ok, So I am gonna keep this copy for a while: http://www.small2big.in/Bootstrap-3-Drag-n-Drop-Form-Maker.zip\n. Haha, archive! 👍🏻\n. no\n. Honestly, haven't tried. Needed it for an old project, but the module was removed.\n. We will need the source code! then it can be done.. if we get it, i'll try and finish it up in my free time.\n. I need the non-built source code for that! might have to ask the author!\n. ",
    "mbchandar": "you could change yourself in the template file.\n. store the instance of MyFormView in a variable and convert the form collection to json and save it.\n. yes. store the json in db. reload the json from db and give it to the collection as input\n. you are doing it in PHP?\n. it can be done.\n- balachandar muruganantham\n  எனது தமிழ் பக்கங்கள் - http://www.balachandar.net/pakkangal\n  தமிழ் புத்தக விற்பனை இணையம் - http://www.chennaishopping.com/ - 450ரூ மேல்\n  உள்ள ஆர்டர்களுக்கு, இலவச சேர்க்கை.\n  தமிழ்ச் சொல் திருத்தி -\n  https://addons.mozilla.org/en-US/firefox/addon/tamil-spell-checker-for-firefo/\n2GB space + 20 GB B/W + cPanel, LAMP Hosting http://www.vazhangi.com/\nOn Sat, May 24, 2014 at 12:44 AM, qfard notifications@github.com wrote:\n\nhey there, do you think you could do this for me?  i am really stuck here\nand need virtual hand.thanks. -----Original Message-----From:\nnotifications@github.comSent: Tue, 20 May 2014 22:03:18 -0700To:\nbootstrap-form-builder@noreply.github.comSubject: Re:\n[Bootstrap-Form-Builder] Save to database & re-edit? Has anyone been able\nto do it? (#85)So just an update m8 i managed to save the form as a\nserialized string that u could convert to json etc, very easily, having a\nfew issues loading the form atm, tho i think i can prob figure it out. will\nkeep u posted!\n—Reply to this email directly or view it on GitHub.\nFree 3D Marine Aquarium ScreensaverWatch dolphins, sharks & orcas on your\ndesktop!Check it out at www.inbox.com/marineaquarium\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/85#issuecomment-44049700\n.\n. @gopal333 hope you understood my question. i want to design form with grid in form builder. any possibility or idea?\n. store as json or html and simply display in browser\n. \n",
    "sagikazarmark": "+1 for this. IMO it is better to call it fieldset.\n. Same as #47 \n. ",
    "jolamar": "+1\n. +1 for this feature\n. ",
    "mcrayne": "Look in the Rendered tab for the HTML snippet you can use for your form. You will need to copy(all)-paste from this tab into your app. (Ctrl-A, Ctrl-C, then Ctrl-V where you want the form in your app). Your app will need to include the Bootstrap CSS and JS files for the form to look and feel like it does in the Bootstrap-Form-Builder.\nSee the discussion at https://github.com/minikomi/Bootstrap-Form-Builder/issues/40 for forks addressing the saving and retrieving of the form definition.\n. There is no problem here. Though, your instructions for adding a new element should emphasize that the \"title\": value used in the .json file must match the name of the snippet .html file and when adding to the snippet-templates.js file add the require in both place of the define method.\nThis seems pretty fragile. Can you refactor to remove this magic (using a regex to convert the \"title\": to all lower case, no whitespace but then using the \"title\": property as is to title the popover?\n. ",
    "gopal333": "http://getbootstrap.com/css/\ncheck Here...\n. I think it is not possible to built such form in Form Builder.\nYou have To do it by hard coding by using span tag.\n. ",
    "krkmzugur": "2014-05-24 11:14 GMT+03:00 gopal333 notifications@github.com:\n\nI think it is not possible to built such form in Form Builder.\nYou have To do it by hard coding by using span tag.\n—\nReply to this email directly or view it on GitHubhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/87#issuecomment-44080962\n.\n. \n",
    "sohelrana820": "@qfard  Do you still looking for the solution? I can help you in this case. If you need any help you can knock me.\nThanks\n. ",
    "razisyed": "Btw, I tried adjusting the paths in main.js. I removed the baseUrl and used relative path instead of \"..\", and got:\nhttp://requirejs.org/docs/errors.html#scripterror\n. ",
    "profscot": "I am having the same problem as razisyed and I cannot understand minikomi's response made on Oct 9th 2014.  Can you help? \n. ",
    "SachinNambiar": "http://pastebin.com/Rwevbcj5\nIt is caused because IIS is blocking static JSON. Add this to webconfig to solve the problem.\n. ",
    "tariq-mahmood-dev": "Hi qfard,\ncan you please send me your updated plugin on email: tariq.mahmood_2@yahoo.com\nThanks\n. Hi qfard I still need your changes, can you please send me\n. ",
    "KrunchMuffin": "Did you post it back to github for others?\n. ",
    "rtpHarry": "Not sure what you mean - I didn't make the code in my link.\nHowever you have reminded me that I did eventually find a Bootstrap v3 port of this code tucked away in somebodies dropbox account: \nhttps://dl.dropboxusercontent.com/u/1656247/bfb/index.html\nHopefully that helps people\n. ",
    "sr33jith": "Sorry I just checked the Readme file :)\n. ",
    "dptole": "The pull request #103 may fix this issue but I've seen another one.\nWhen the radios (inline or multiple) are pushed to the form they share the same group name called radio, which causes the previously inserted radios to be unfocused.\n. @minikomi it's fixed for me, thanks\n. @hasibul2363 I'm not sure if I understood your question but when you drag the component to the form area, and click on it, you have a field called Label Text. I think you should just change that value.\n. @thiyagu06 By now the only way o do this is editing the Rendered source of your form in the Rendered tab.\n. ",
    "emmar": "I tried it on the demo, and it works great.  Thanks @dptole and @minikomi!\n. ",
    "stickypages": "Ahhh yeah thanks for the notice. I see the 'winning' solution isn't available for download...\nI will try the others.\nThanks\n. Okay great thanks.\n. ",
    "jangondol": "If the above link ever goes away, here's the permalink.\n. ",
    "hasibul2363": "found solution on\nhttps://github.com/minikomi/Bootstrap-Form-Builder/issues/40#issuecomment-24131496\n. @zeeshan4971 hi do you have any mental disorder problem?\n. ",
    "zeeshan4971": "Dafa hoja kuttay tu kiya karaya ga is ka\n. bharway teri maa ki choot hai tu programming kar kay apni gand kun mararaha hai behchod apni shakal dekhi hai ja jakay sabzi bech tu isi like hai\n. ",
    "snehalchavan": "How can I add jQueryUI date picker in Bootstarp form builder?\n. ",
    "unosbm65": "i used this link to install ruby http://editrocket.com/articles/ruby_windows.html\nand then run the \nC:\\Ruby22\\bin>ruby D:\\BootstrapFormBuilder\\ass\nets\\js\\data\\parse.rb\n. "
}