{
    "tkroman": "Did you consider using, for example, Guava for this purpose? I've recently had some experience with it and if you aren't against one else 3rd party library, I hope I could somehow contribute.\n. I've made some efforts on splitWords in #6, let me know if you find them acceptable so that I could advance in that direction further.\n. Well, the problem is with line #30 (ÒpitchÓ word). My iconv doesn't seem to be able to handle it as well.\n. I fixed this in #6 \n. Fixed this in #6\n. That's pretty good, I've been trying to make my local version mondo-independent and my way lacks some features you have. I'm going to track this PR.\n. Can you provide me with some kind of paper on the subject please? So I could have better understanding of under-the-hood principles of the main algorithm.\n. I'm sorry, could you be more elaborate on that issue please? It's not clear for me what precisely do you want.\n. I have already noticed it and fixed it in my PR, but @MojoJolo doesn't seem to be able to accept it right now.\n. ",
    "melpomene": "I have the same issue on mac, just converted the Main.scala file to UTF-8 with intellij and problem was solved. \n. Duplicate of issue #3 \n. You have to install MongoDB and point the settings in config.scala to the correct port and address. \nI had to create a database in mongodb and add a user to it to get everything working as well. I think the standard port is 27017\n. Or as summerized by TextTeaser; \n- This judge remained at his work for a year without a single case from anyone.\n- Because the judge is Allah and the dominant is the book of Allah.\n- The prophet (May the blessings and peace of Allah be upon him) said: \"There will be temptation.\"\n- The result was that they made for mankind a perfect example for utopia (the virtuous city) and the fair state.\n- This is the dream and the aim of mankind at every time.\n. ",
    "netvisao": "I think it has to do with the files being committed from a windows system.\nDos2unix did not do the full trick for me. I wonder if there is another cli\nsolution to it.\nSent via a mobile device.\nOn Oct 12, 2013 12:02 PM, \"Christopher Käck\" notifications@github.com\nwrote:\n\nI have the same issue on mac, just converted the Main.scala file to UTF-8\nwith intellij and problem was solved.\n—\nReply to this email directly or view it on GitHubhttps://github.com/MojoJolo/textteaser/issues/3#issuecomment-26200112\n.\n. \n",
    "MojoJolo": "Thanks @cdshines. I also encountered this issue. Will check it out later and merge it.\n. Sorry about the encoding issues. Some clumsy issues right there. Anyways. @cdshines fixed it and I merged it already. Thanks. Will close this issue.\n. Thanks for the improvements you made. Sorry for the delay, I didn't get any notifications from Github via email. Will review this as I said in the other comments and will merge it. :)\n. @melpomene is right. @timforgach any updates after installing mongodb? Then input the necessary settings here in the Config.scala file: https://github.com/MojoJolo/textteaser/blob/master/src/main/scala/com/textteaser/summarizer/Config.scala\n. I think this is an issue in authentication. I removed the database authentication so username and password is not required now.\n. I just saw this now. Sorry for the delay. Will review this later and will merge it. Thanks! :)\n. The corpus files are used by OpenNLP to split sentences. You can see corpus for other languages here: http://opennlp.sourceforge.net/models-1.5/\nAnd if you want to create a model for yourself, here's the instructions from OpenNLP: http://opennlp.apache.org/documentation/1.5.3/manual/opennlp.html#tools.sentdetect.training\n. @jasons-novaleaf NLP experience is not required. :) You can contribute by gathering articles of the language you choose. Split those articles into sentences via new line. It can then be used as a corpus. The instruction into building a corpus is easy, just follow the link I posted above.\n. Yes. This will be the next issue I planned to open. I don't have that experience with testing but I think I tried ScalaTest.\n. I saw it. Didn't manage to reply though. Sorry about it.\nI'm aware that the results might be different with those two implementations.\nI first implemented the commented code for the algorithm. It's not in Scala as you see. When I'm implementing it to Scala, I saw some errors in the code. I corrected it in Scala but didn't manage to change it from the commented code. That's why there is some inconsistency.\nFor added reference, here's the formula I used for DBS: http://imgur.com/8ZjKPbK. You might want to take a look at it. There might still wrong implementation in the code.\nBy the way, you're awesome and will review your pull request tomorrow.\n. Here:\nhttp://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.222.6530&rep=rep1&type=pdf\nAs you can see in 4.3 which is in page 3, the paper mentioned two algorithms for sentence selection. These are Summation-Based Selection and Density-Based Selection. Which is SBS and DBS respectively.\n. The code here in Github only accepts the text and the title. The API in Mashape has another layer to extract the text from the webpage. It was using Python Goose for it.\n. Yes. Those are the numbers I obtain in my research.\n. TextTeaser.com is running continuously and all the articles it summarized are saved in the database. Previous articles are used to determine the keywords and might affect the result.\n. Didn't manage to check it right now. Sorry about it. @cdshines. I just saw your pull request. Weird because Github never alerts me.\n. I'm sorry that merging took a while.\n. I created a news reader for Philippine news called Readborg (http://ph.readborg.com/). The word Philippines and Manila will appears very frequently that I just decided to just add them to the stop words. Never managed to remove it though.\n. Can you replaced this line (https://github.com/MojoJolo/textteaser/blob/master/project/plugins.sbt#L7) with this:\naddSbtPlugin(\"com.github.mpeltonen\" % \"sbt-idea\" % \"1.6.0\")\nI think the previous dependency doesn't exist anymore thus needs to be replaced. If it works, can you pull request your changes and I'll merge it.\n. ",
    "jmazin": "Hi -- I think the issue in this case is the cut-and-pasted text at Main.scala:30, specifically the use of the curly double-quotes:  “ and ”.\n. ",
    "Jonovono": "Ah great, my bad for missing that.\n. ",
    "timforgach": "Thanks for your help. MongoDB was not installed/running.\n. ",
    "jasonswearingen": "thanks for the info, i guess due to no NLP experience I won't be able to contribute though :(\n. @melpomene  you sir win the internet.\n. ",
    "mikkogozalo": "Praise Allah!\n. Praise Allah!\n. I think those are just arbitrary numbers that worked well for him after doing some trial and error. @MojoJolo, is this correct?\n. ",
    "hassanelagouz67": "Thank you all\nI wish to know your opinions always\nAnd pleasure ăŃćŃßă and friendship\n I love you all\n. Thank you Mahmoud Radwan\nGreetings\n. ",
    "mahmoudradwan666": "Multi more wonderful God Bless. We hope you try again.\n. ",
    "Whoaa512": "Clearly off-topic for this issue tracker, please close.\n. ",
    "RahulKulhari": "To disable Mongodb :\nIn class GuiceModule.Scala\nclass GuiceModule(config: Config, dummyKeywordService: Boolean = false) extends AbstractModule with ScalaModule { \njust put  dummyKeywordService: Boolean = true then it will not use Mongodb\n. SELECT SUM(score)\nFROM keyword\nWHERE blog = 'blog'\nAND word = 'word'\n. ",
    "wodow": "Thanks for that. I've created a PR to put that in the README.\nGreat project! Thanks for open-sourcing.\n. ",
    "shyams80": "The mashape api can take a URL input and return the summarized result. I\ncouldn't find the section of the code that provides this functionality. I\nam assuming that when given a URL, you will need to download the entire\npage, extract the main article (i.e. remove the boilerplate) and them pass\nthe article to the main summarizer routine. How and where is the code\nhandling this?\nOn Sat, Oct 26, 2013 at 11:20 PM, Roman Tkalenko\nnotifications@github.comwrote:\n\nI'm sorry, could you be more elaborate on that issue please? It's not\nclear for me what precisely do you want.\n—\nReply to this email directly or view it on GitHubhttps://github.com/MojoJolo/textteaser/issues/19#issuecomment-27151513\n.\n\n\nhttp://about.me/sunder.struck/bio\n. ",
    "a7i7": "Can anyone tell me what is dbs and sbs? I want to know the logic behind it\n. ",
    "xiaoxu193": "Running com.textteaser.summarizer.Main\n04:43:39.103 [run-main] INFO   - Starting...\n04:43:39.574 [run-main] INFO   - App is now runnning.\n{\"sentences\":[\"Now that conventional thinking has been turned on its head in a paper by Prof Christof Wetterich at the University of Heidelberg in Germany.\",\"The way these absorb and emit light would shift towards the blue part of the spectrum if atoms were to grow in mass, and to the red if they lost it.\",\"Because the frequency or ÃpitchÃ of light increases with mass, Prof Wetterich argues that masses could have been lower long ago.\",\"ÃI see no fault in [Prof WetterichÃs] mathematical treatment,Ã he says.\",\"If we are lucky, they might even be as revolutionary as Edwin HubbleÃs, almost a century ago.\"]}\n04:43:39.930 [run-main] INFO   - Summarization completed.\n[success] Total time: 6 s, completed Nov 14, 2013 4:43:39 AM\n. ",
    "vibhav": "Make sure to send the request to the correct port. The default port, as found in Config.scala, is 27017.\n. ",
    "psanchezdl": "No problem, thanks for merging it! :)\nOn Mon, Jan 27, 2014 at 2:29 PM, Jolo Balbin notifications@github.comwrote:\n\nI'm sorry that merging took a while.\n\nReply to this email directly or view it on GitHubhttps://github.com/MojoJolo/textteaser/pull/26#issuecomment-33430945\n.\n\n\nPedro Sanchez de Lozada\nt: @psanchezdl http://www.twitter.com/psanchezdl\nf: PSDL http://www.facebook.com/psanchezdl\nl: Pedro Sanchez de\nLozadahttp://www.linkedin.com/pub/pedro-sanchez-de-lozada/1a/590/94a\np: (773) 789 7735\ns: pedro_sdl\nk: t = twitter, f = facebook, p = phone, s = skype, l = linkedin, k = key\n. ",
    "seuros": "This is probably a generated list.\n. "
}