{
    "BertPC": "I am seeing behavior where a resize event will trigger the appear event on an item that was within the viewport, and is remaining in the viewport.  Is it possible to not make this happen?  I am trying to use jquery.appear to create click-less infinite scroll functionality, but window resizing is making it difficult to work.\n. I did not quite understand all of your reply, but it may be that I am just not handling the case where there are no results to display, or no more results to display.\nIf there are no results, for instance, I should disable the appear event from firing so there's no chance that a resize would want to call the event unnecessarily.  I was just in the early stages of testing and was seeing the appear event fire every time I resized the window, when there were no more results to display.\nBasically, what I am saying is this:  if the object that is set to \"appear/disappear\" is already visible (i.e. within the viewport) and you resize the window even by one pixel, it will fire the appear event again, even though the object did not hide and come back into view.\n. ",
    "borisnadion": "i'm not sure i'm following, that's the whole point, if after a resize the element is within a viewport an event should be triggered, the same way when you scroll down and up and down again before your code brings a new page\ni mean that the flow should be like this: event is triggered, unsubscribe, bring a new page, render it, subscribe again, in such a way you will ignore all the events that happen after you starting to load a new page and before it's rendered\ndo i miss something?\n. yeah, i understand the what do you mean, i think the event still should be triggered, let's give a chance to mor to decide ;-)\nanyway, i'd suggest the following workaround:\n- subscribe to event\n- when the event is triggered, unsubscribe and start loading a next page\n- when the next page is loaded, subscribe again\nif no more results to display - unsubscribe from event\nin such a case, even multiple events triggered one after another will not affect you because you're not subscribed while loading next page(s)\n. ",
    "danwashusen": "+1 for this\n. ",
    "morr": "@elhoyos Can't merge it automatically with github. Could you please fix conflicts?\nAlso it has error in these lines when viewport equals window.\nvar viewport_offset = $viewport.offset();\nvar viewport_offset_left = viewport_offset.left || 0;\nvar viewport_offset_top = viewport_offset.top || 0;\n$(window).offset() returns undefined so viewport_offset.left raises \"Cannot read property 'left' of undefined\" exception.\nvar viewport_offset = $viewport.offset();\nvar viewport_offset_left = viewport_offset ? viewport_offset.left : 0;\nvar viewport_offset_top = viewport_offset ? viewport_offset.top : 0;\n. @pushpesh4u merged. thanks!. ",
    "rickhall": "This would be a very nice addition, any plans on integrating it?\n. ",
    "elhoyos": "I have been a bit busy these days. Will give it some time this weekend.\n. Notice these changes provide basic support for viewports. On my side this is enough. You may find some undesirable behavior depending on your needs:\n- Using the plugin multiple times in the document will only remember the last used viewport option.\n- Attaching jquery.appear to elements located inside an element with overflow: auto and using the default viewport option will trigger the appear event even when not all the inner elements are visible.\n. ",
    "cm325": ":+1:  seems like this would really complete this plugin\n. :+1: \n. ",
    "user24": "i also added this to my pull req: https://github.com/morr/jquery.appear/pull/27\n. +1\n. ",
    "andysmithdev": "Fixed my last pull request\n. ",
    "inferusvv": "+1\n. ",
    "redpik": "this snippet works for me:\n$(window).load(function() {\n        $.force_appear();\n    });\n. ",
    "danielhusar": "Closing for inactivity.. ",
    "dsadinoff": "just noticed https://github.com/morr/jquery.appear/pull/34 , youpalsonja's delta, which is related.\nPretty sure this one is more powerful, as it allows for more than one additional selector.\n. ....hrm, but it doesn't have the revamped offsets of the pullreq from https://github.com/morr/jquery.appear/pull/22\nandysmithdev.\n. Sorry, I should probably withdraw this.\n. ",
    "SlimDeluxe": "Do you have an updated version for your pull request?. ",
    "jer2665": "I'm working on upgrading my site to jquery3 and the jquerymigrate plugin is complaining on...\nJQMIGRATE: jQuery.expr[':'] is deprecated; use jQuery.expr.pseudos\nThis just uses the new way to handle pseudos. Can you be more specific? I just did a test and it's working fine for me. Here are two codepens...\nOriginal jquery.appear.js\nhttps://codepen.io/jer2665/pen/QMmbzN/\nMy changes to script\nhttps://codepen.io/jer2665/pen/yoKNGg/. Codepen is using jquery3 as well, according to $.fn.jquery it's 3.2.1 as of my just checking. . ",
    "jvitoroc": "Your commit is not working. I was using jquery 3, maybe that is the problem. Fork this project and make your version. ",
    "Mohsen-Khakbiz": "it's working pretty fine for me. appreciate it . "
}