{
    "cosmolux": "Ahah! I see that the \"View as RTF\" opens the selection as styled text in TextEdit, from where it can be copied and pasted as Mac styled text.  An adequate workaround.\n. ",
    "n1k0": "As a side note, I wish I could find a way to directly have styled contents copied into the clipboard…\n. duplicate of #7\n. Could you possibly please report the exception or error message you can eventually found in the sublime console, if any? Thanks\n. > 'new_vieiw' seem to be a strange name :)\nDo'h, impressive I didn't notice this one.\n. Indeed :)\n. Thanks @rozza \n. Thanks again :)\nI'm not closing the issue because I may add support for the same feature for other platforms in the future.\n. Whenever anybody comes with a patch.\n. > Thanks for this awesome plugin!\nThanks for this very nice report :)\n. Damn, so this issue strikes back… I encountered it some times at the times I was bootstrapping the plugin, it's weird… looks like a Sublime Text 2 issue, but I'm not sure\n. Okay, looks like a problem related to PHP syntax highlighting only. I'm investigating.\n. This is a really, really weird issue with pygments and/or sublime text python env. I've updated Pygments and forced loading of the _phpbuiltins lexer module, and its solved the problem on my box… but that's nearly black voodoo.\nSo tell me if this fixes your problem as well.\n. That's because you have to copy the <?php opening tag, looks like that's how Pygments work :/\n. Here you go https://bitbucket.org/birkenfeld/pygments-main/issue/137/bug-in-pygments-php-lexer\nI can't do much about this, unfortunately :/\nEdit: damn, I misread the author's answer, looks like the startinline option may solve your issue.\n. So as stated in the README:\nLexer options\nSublimeHighlight supports Pygments lexer options. To set an option for a given lexer, eg. PHP:\n{\n    \"lexer_options\": {\n        \"PHP\": {\n            \"startinline\": true\n        }\n    }\n}\n. Nice! Could you please eventually update the README accordingly? Thanks!\n. Yeah, there's no Windows support for RTF pasting atm, because I'm not aware of any Windows tool to achieve it. But any patch is welcome :)\n. I've just found http://code.activestate.com/recipes/474121-getting-html-from-the-windows-clipboard/, if somebody with a vindows box/vm want to play with it and submit a patch, go :)\n. > Be kind. I've never written a line of Python in my life prior to yesterday.\n@schmod No pb it's already great you took the time to write & send a PR, thank you! I've made some comments on your code, take it easy :)\n. Ah yeah, sure :)\n. I've added setup instructions in the README https://github.com/n1k0/SublimeHighlight#setting-up-shortcuts\n. Hmm, «The Gist you were looking for has been deleted. Sorry about that!»\n\nFYI, I'm seeing this behavior when trying to paste to Evernote. I haven't tried pasting elsewhere.\n\nCan you please try on Keynote, Powerpoint or LibreOffice Impress (which is free)?\nThx\n. thanks!\n. Merged, thanks for contributing :)\n. Thanks :)\n. Yeah, still waiting your patch ;)\nLe 28 avr. 2013 13:53, \"Juan Manuel Elosegui\" notifications@github.com a\nécrit :\n\nsome thing new on this??\n—\nReply to this email directly or view it on GitHubhttps://github.com/n1k0/SublimeHighlight/issues/22#issuecomment-17132876\n.\n. fixed by #36\n. Thanks :)\n. > and it should be exported in the same theme I'm using in sublime text\n\nyou sure? I'm not\n. I'd love being able to propose that, but from what I'm understanding from the tm/st theme XML stuff it's not likely to happen soon using pygments, I'm sorry\nMaybe there's room for another attempt at a plugin for this here (or a pull request, let me dream aloud)\n. Thanks for contributing.\n. Looks like there's a pb with latest beta of ST3… https://github.com/timonwong/OmniMarkupPreviewer/issues/30\n. fixed by #30\n. I think there's still a bug in their relative import implementation as I'm also getting this error randomly. I don't have a workaround in mind for now, so my guess is we just have to wait for a fix to land in ST3.\nIf you have any idea I'm all ears though.\n. fixed by #30\n. fixed by #36\n. Thanks!\n. For some reason ST3 is unable to store user settings in the appropriate folder. Still investigating this one.\n. SHould be fixed by #37 - Please reopen if that's not true.\n. Looks like there's a problem with the windows clipboard library. What version of sublime do you use?\n. I don't think it's possible using Pygments, unfortunately :/\n. Thanks!\n. I can't reproduce this issue. What version of the plugin? Of SublimeText? What OS?\n. As I can't reproduce the issue it's a bit hard to investigate\n. @aaronkeck thanks for the update, I've updated the README accordingly\n. I'm a bit reluctant maintaining a local fork of Pygments. Can you please explain the rationale behind this move? Shouldn't this patch be suggested to the Pygments team instead?\n. Oh, makes sense indeed. No need to wait if this was picked from current head, I can easily update to stable later :)\nThanks.\n. This has been addressed already, check the README and this comment.\n. Thanks!\n. Fixed by #66\n. Nice. Can someone submit a PR for this?\n. Could you guys create a PR for this?\n. thanks!\n. Thanks!\n. Thank you :)\n. Looks good! I don't own a Mac anymore, so I couldn't test the patch. I believe it works and adds value for Mac users though, so merging this.\n. Thanks!\n. Thanks!\n. If that patch works for you, would you mind creating a PR?\n. Fixed by #61.\n. Thank you :+1: . Just a friendly reminder that this project is looking for a new maintainer :) see #78. Not any I'm aware of but I didn't look very hard as I'm not using Sublime anymore.. Hi, thanks for the patch! I'm embarrassed, I don't use Sublime Text anymore, so I can't really test this patch (nor I have the time to actually).\nCould anybody shime him to confirm this works fine? Also, I'm looking for a new maintainer for this package #78.. Thanks. this could be rewritten as below:\npython\nwin = all([platform == 'Windows', output_type == 'html', target == 'clipboard'])\nfull = False if win else settings.get('full', full)\nAlso please take care of observing the PEP-8 styleguide and avoid lines having more than 79chars :)\n. would be better to have this after all imports\n. You may want to store the compiled regexp in some top level var, eg.\n``` python\nWIN_CR_RE = re.compile(r\"\\r(?!\\n)|(?<!\\r)\\n\")\n... later\npygmented = WIN_CR_RE.sub(\"\\r\\n\", pygmented)\n```\n. Please remove this :)\n. Please remove commented lines\n. ",
    "t8g": "Traceback (most recent call last):\n  File \"/home/t8g/Sublime Text 2/sublime_plugin.py\", line 356, in run_\n    return self.run(edit, **args)\n  File \"./SublimeHighlight.py\", line 123, in run\nNameError: global name 'new_vieiw' is not defined\n. 'new_vieiw' seem to be a strange name :)\n. ",
    "rozza": "Think this is now fixed :)\n. I had to move the menu settings round, so edit was first to get this to work.\n. https://gist.github.com/2843451 \n. ",
    "chambery": "@rozza , can you post a snippet of your config?\n. ",
    "leplatrem": "Problem confirmed under Linux :) Couldn't find a way to specify mimetype using xclip so far!\nEven kenneth's xerox does not seem to address the issue...\n. ",
    "barbazzz": "Will be there any changes?\n. ",
    "jannisg": "Wow that was quick. Just confirmed it working for me now. Thanks!\n. ",
    "rmbaad": "I have a same problem.\nUbuntu 12.10, Sublime Text Dev build 2220.\nImportError: No module named _phpbuiltins\nTraceback (most recent call last):\n  File \"./sublime_plugin.py\", line 356, in run_\n  File \"./SublimeHighlight.py\", line 97, in run\n  File \"./SublimeHighlight.py\", line 92, in highlight\n  File \"./SublimeHighlight.py\", line 82, in get_lexer\n  File \"./pygments/lexers/__init__.py\", line 121, in get_lexer_for_filename\n  File \"./pygments/lexer.py\", line 470, in __call__\n  File \"./pygments/lexers/web.py\", line 870, in __init__\nImportError: No module named _phpbuiltins\n. ",
    "rubdottocom": "Same problem :( Mountain Lion\nTraceback (most recent call last):\n  File \"./sublime_plugin.py\", line 356, in run_\n  File \"./SublimeHighlight.py\", line 97, in run\n  File \"./SublimeHighlight.py\", line 92, in highlight\n  File \"./SublimeHighlight.py\", line 82, in get_lexer\n  File \"./pygments/lexers/__init__.py\", line 121, in get_lexer_for_filename\n  File \"./pygments/lexer.py\", line 470, in __call__\n  File \"./pygments/lexers/web.py\", line 870, in __init__\nImportError: No module named _phpbuiltins\n. @n1k0 Now is working, but only if I do it for an entire file, if I select some text (an entire function for example) there are no colors copied (I don't know if is how it works)\n. ",
    "jlvcm": "Same (Windows 8)\n. ",
    "schmod": "Just issued a pull request for this.  RTF and HTML should now get stored on the clipboard in the correct formats, with a plaintext fallback for apps that don't support rich text.\nI'm implemented this using ctypes, and interacted directly with the Windows API.  Most existing libraries for this purpose had a huge overhead, and didn't handle HTML elegantly.  Given that we just need to copy two formats, it seemed easiest to do this as directly as possible.  \n(Be kind.  I've never written a line of Python in my life prior to yesterday.)\n. Thanks for the helpful suggestions!\n. Time to close this up?\n. As far as I see it, the benefits/drawbacks to combining the two commands are:\nPros\n\nSimple and consistent experience for Windows users.\nPygments' RTF and HTML output is somewhat equivalent.\nMost applications are able to determine the \"better\" option when both RTF and HTML are available.\n\nCons\n\nCreates an inconsistent cross-platform experience.  (The OS X pasteboard has similar functionality, but it's not implemented in this extension)\nMakes assumptions that might not be valid for all users.  Somebody might really prefer RTF over HTML...\nHandling of plaintext remains ambiguous.\n\nI don't have strong opinions one way or the other, but the current state of affairs seems somewhat unsatisfactory.  How can we provide a flexible experience without adding too much feature bloat?\n. Oh, so that's why people like this language...\n. ",
    "yawnt": "doesn't work in Win8.. i click on Copy as but nothing is stored in the clipboard\n. ",
    "npearson72": "Very cool, thank you!\n. Sorry, I was trying to use this for syntax highlighting in Evernote. It's likely it works in those others, but that would not be of use to me.\nThanks anyway. Cheers!\n. ",
    "matthubb": "I just found this plugin as a possible solution for getting highlighted code-snippets into Evernote.\nI discovered that the RTF copy-to-clipboard ended up with extra whitespace all over the place (opposite of npearson72's problem).\nHowever, using \"HTML\" copy-to-clipboard and the \"noclasses\" option, it looks like it's working perfectly. I can now shunt all of my \"untitled\" sublime windows full of code snippets into Evernote and close them down.\n. ",
    "JSlote": "Yea I have the same issue - perhaps a different/newer python-clipboard package would do the trick?\n. ",
    "jmelosegui": "some thing new on this??\n. ",
    "5v3n": "+1 - I want the same theme (colors, fonts, etc) I use in the editor for the export too\n. @n1k0 : I'll see how close adjusting the sublime highlight user setting will get me - depending on that I might also contribute & the pull request you dream of will happen ;-)\n. ",
    "farzher": "It would be cool. Too bad there's no .tmtheme to pygments converter out there. You could just run their theme through that and be good to go. I don't know about pygments or if that's even possible.\n. ",
    "acaland": "any updates on that?\n. ",
    "qodesmith": "I'm looking for this too. I use this plugin to paste code into Evernote, but the font size is too small when pasted in. Changing the default user settings in Sublime yields no change.\n. ",
    "lamnatos": "I'm very interested in this too please.\n. ",
    "hcatlin": "I also have this error...\n. ",
    "simait": "\"Oups\", anyway, fixed it :)\n. ",
    "MrOrz": "I'm in Mac OSX 10.7.5 Lion and also encountered the problem mentioned above.\nAfter changing tmp_file.write(contents.encode(...)) to tmp_file.write(contents) the TypeError is resolved, and \"Copy as RTF\" works well.\n. ",
    "zenoamaro": "None of the commands are working for me, either. This is the output from the console:\nTraceback (most recent call last):\n  File \"/Applications/Sublime Text 3.app/Contents/MacOS/sublime_plugin.py\", line 543, in run_\n    return self.run(edit, **args)\n  File \"/Users/zenojevski/Library/Application Support/Sublime Text 3/Packages/SublimeHighlight/SublimeHighlight.py\", line 118, in run\n    pygmented = self.highlight(output_type, full)\n  File \"/Users/zenojevski/Library/Application Support/Sublime Text 3/Packages/SublimeHighlight/SublimeHighlight.py\", line 107, in highlight\n    self.get_formatter(output_type, full))\n  File \"/Users/zenojevski/Library/Application Support/Sublime Text 3/Packages/SublimeHighlight/SublimeHighlight.py\", line 75, in get_formatter\n    fontface=settings.get('fontface', ''))\n  File \"/Users/zenojevski/Library/Application Support/Sublime Text 3/Packages/SublimeHighlight/HighlightLib/pygments/formatters/__init__.py\", line 51, in get_formatter_by_name\n    return cls(**options)\n  File \"/Users/zenojevski/Library/Application Support/Sublime Text 3/Packages/SublimeHighlight/HighlightLib/pygments/formatters/html.py\", line 372, in __init__\n    Formatter.__init__(self, **options)\n  File \"/Users/zenojevski/Library/Application Support/Sublime Text 3/Packages/SublimeHighlight/HighlightLib/pygments/formatter.py\", line 68, in __init__\n    self.full  = get_bool_opt(options, 'full', False)\n  File \"/Users/zenojevski/Library/Application Support/Sublime Text 3/Packages/SublimeHighlight/HighlightLib/pygments/util.py\", line 58, in get_bool_opt\n    string, optname))\npygments.util.OptionError: Invalid type None for option full; use 1/0, yes/no, true/false, on/off\nI have transitioned my folder to ST3 some time ago, so I'm guessing I may have stale configuration values from before, but I'm can't seem to find anything relevant.\n. ",
    "vhbsouza": "I'm with the same error but I'm using ST2. Please help me.\n. ",
    "fharper": "When I use the options \"view as\" in the menu, it's working.\n. Sublime Text 2.0.2 build 2221\n. ",
    "GitMyCode": "Same probleme for me too. Here is my Traceback in the console\nTraceback (most recent call last):\n  File \".\\sublime_plugin.py\", line 356, in run_\n  File \".\\SublimeHighlight.py\", line 152, in run\n  File \".\\winclip__init__.py\", line 60, in Paste\n  File \".\\winclip__init__.py\", line 79, in Put\nWindowsError: exception: access violation writing 0x0000000000000000\n. ",
    "vinyar": "very awesome plugin, however I also found that \"linenos\" do not work for me either. User settings file below.\n{\n        \"linenos\": \"inline\",\n        \"noclasses\": true,\n        \"fontface\": \"Inconsolata\"\n    }\n. ",
    "kashif": "you are not doing anything wrong. the fact is that the pygments rtf formatter only has options for style and and fontface and does not render rtf with line numbers. Supporting this will require you to add this functionality to pygments itself.\n. sure this is jus the current head of pygments which has some newer lexers as well as bug fixes to some older one... I think they will release a version soonish so you can hold on from merging this if you like.\n. ",
    "Cahya": "Uh okay :( thank you n1k0.\n. ",
    "TRPB": "I have the same problem: Changing the theme makes no difference. \n. ",
    "hibob224": "Same issue here, here's the console error for copying to RTF\nTraceback (most recent call last):\n  File \"C:\\Program Files\\Sublime Text 3\\sublime_plugin.py\", line 543, in run_\n    return self.run(edit, **args)\n  File \"C:\\Users\\Bob\\AppData\\Roaming\\Sublime Text 3\\Packages\\Highlight\\SublimeHighlight.py\", line 143, in run\n    winclip.Paste(pygmented, output_type, plaintext)\n  File \"C:\\Users\\Bob\\AppData\\Roaming\\Sublime Text 3\\Packages\\Highlight\\HighlightLib\\winclip\\__init__.py\", line 57, in Paste\n    Put(data, CF_RTF)\n  File \"C:\\Users\\Bob\\AppData\\Roaming\\Sublime Text 3\\Packages\\Highlight\\HighlightLib\\winclip\\__init__.py\", line 79, in Put\n    strcpy(c_char_p(pchData), bytes(data))\nEdit: My issue seems to only be with ST3, ST2 copies fine.\n. ",
    "aaronkeck": "I'm experiencing the same issue.  I'm using latest Sublime Text 3, on Windows 7 x64.\n\n[Edit]\nI downloaded a zip snapshot of the python3 branch, renamed to .sublime-package, and replaced the Package Control-installed version with the python3 snapshot and am still having the same issue.\n. A version of those instructions fixed my problem (ST3, Win7-64).  For Sublime Text 3, and the SublimeHighlight python3 branch:\n1. Remove the package, if installed, using Package Control.\n2. Add a repository: https://github.com/n1k0/SublimeHighlight/tree/python3\n3. Install SublimeHighlight with Package Control.  It should pull the correct branch from Github. \n4. I didn't need to restart Sublime, but it may not be a terrible idea at this point.\nSeems like I somehow initially botched the manual package install, the code is clearly working fine.\n. ",
    "chongxi": "I use sublime 2, under Mac OS X. Is it something to do with python, I use canopy.\nSent from my iPad\n\nOn Oct 28, 2013, at 4:20 AM, Nicolas Perriault notifications@github.com wrote:\nI can't reproduce this issue. What version of the plugin? Of SublimeText? What OS?\n—\nReply to this email directly or view it on GitHub.\n. What about this issue, I still can not address it.\n. \n",
    "busse": "Also was experiencing this issue. Fresh install of Sublime Text 2 Version 2.0.2, Build 2221 on a new rMBP, OSX 10.9 Build 13A3017\nI was able to resolve it, and I suspect it is a permissions or config issue with Sublime and how I initially installed the package, which was:\n1. Download .zip to Downloads folder\n2. Extract to Downloads\n3. Drag & Drop SublimeHighlight-master to Packages\n4. Restart Sublime\n...had the all-disabled menus as reported by earlier posters. However, was also unable to edit the Default & User settings file through Sublime. A clue! They both came up as blank and I got an error when trying to save them that I couldn't.\nSolution:\n1. Installed Package Control\n2. Uninstalled SublimeHighlight with Package Control\n3. Installed SublimeHighlight with Package Control\n4. Restarted Sublime\nMenus are now enabled, config files now editable.\n(thanks n1k0 for making this very useful package!)\n. ",
    "ramkam": "Hi there, same issue for me, \nOSX Stinky Lion that ditched my \"save as\" feature, \nans ST2\nhere's what the console says : \n\n\nfound 1 files for base name Default.sublime-theme\nReloading plugin /Users/RK/Library/Application Support/Sublime Text 2/Packages/SublimeHighlight/SublimeHighlight.py\nTraceback (most recent call last):\n  File \"./sublime_plugin.py\", line 62, in reload_plugin\n  File \"./SublimeHighlight.py\", line 15, in \n    import pygments.formatters\n  File \"./HighlightLib/pygments/formatters/__init__.py\", line 14, in \n    from pygments.formatters._mapping import FORMATTERS\n  File \"./HighlightLib/pygments/formatters/_mapping.py\", line 18, in \n    from pygments.formatters.html import HtmlFormatter\n  File \"./HighlightLib/pygments/formatters/html.py\", line 509\n    'using current directory as base for the CSS file name', file=sys.stderr)\n                                                                 ^\nSyntaxError: invalid syntax\nfound 4 files for base name Main.sublime-menu\ntheme loaded\n\n\n. ",
    "Laokoont": "Same problem here\nOSX 10.10, SublimeText 2, version 2.0.2, build 2221.\nInstalled via Package Manager, restarted ST — menu items are still inactive. Also default settings file is empty and uneditable.\n\n. ",
    "Ewarren7": "I seem to be having the same problem. I installed via package control after adding repo https://github.com/n1k0/SublimeHighlight/tree/python3. I also quit and restarted sublime. \nSublime Text 2 v 2.0.2 build 2221on OS x 10.10.1 (Yosemite)\nI also uninstalled via PC and Reinstalled. Same problem. \n\n. ",
    "Blackbaud-GuillaumeUys": "Hello, I am also experiencing the same problem, menu items grayed out. I followed the instructions on github and mentioned her. Windows 7 Enterprise SP1, Sublime Text Build 3065. None of the plugin files shown in the menu (README, user settings or default settings) show any content.\n. ",
    "afilina": "In case someone here uses Sublime Text 2 and the menu is greyed out, try this:\n- Remove the package, remove the repo.\n- Add the repo https://github.com/n1k0/SublimeHighlight instead of the one mentioned in the README.\n- Install the package SublimeHighlight.\n- Restart Sublime.\nThe repo https://github.com/n1k0/SublimeHighlight/tree/python3 is for Sublime Text 3 users, not 2.\n. I also have the issue. Bumping it.\n. ",
    "cba7": "@afilina solution worked for me. However, when looking for the package it appears as Highlight and not SublimeHighlight, in my case anyway.\n. ",
    "jakepeyser": "Thanks @afilina - solved my issue. Didn't even consider that I was adding the wrong repo...\nGreat package @n1k0  - very useful when I'm taking notes with code that can use a little syntax flavor\n. ",
    "mboeckle": "@afilina great thank you!\n. ",
    "serain": "I'm using Sublime Text 3 Build 3065 on Fedora Linux. I have the greyed out issue as well.\nI installed using Package Control and https://github.com/n1k0/SublimeHighlight/tree/python3 repo.\nInstalled the SFTP plugin from Package Control and it works fine. Tried re-installed SublimeHighlight a couple of times, same issue.\nn1k0 if you want any more info about the issue just give me a shout.\n. ",
    "solstice333": "@afilina Thanks for the add repo tip! Worked great.\n. ",
    "caroksh": "Hi. I have the same issue but the strange thing is that when I installed it at first it was working OK for a couple of days and then suddenly the Highlight options in the menu are greyed out (can't use them).\nI've tried all what has been said here but nothing changes.\nI hope someone finds a solution for this issue because it's a great pluggin, very useful for me. Thanks n1k0. \nI use Linux Mint 17 Qiana and Sublime Text 3. But I also tried with ST2 and had the same issue.\n. ",
    "tyiannak": "Any updates on that? I've just installed it on Ubuntu, Sublime 3, using the https://github.com/n1k0/SublimeHighlight/tree/python3 repo and all sublimehighlight menus are greyed.\n. ",
    "yeluolei": "same problem with Chinese language, please consider to solve this issue. thanks~\n. ",
    "GingerN": "This problem is still actual. When I choose \"copy to clipboard as rtf\" or \"view as rtf\" I get invalid cyrillic (also arrow symbol) symbols when pasting to Word.\nFrom this:\n<!DOCTYPE html>\n<html lang=\"ru\">\n<head>\n    <meta charset=\"UTF-8\">\n    <title>Заголовок Title</title>\n</head>\n<body>\n    <noscript>Включите JS</noscript>\n    <script>\n        //пример\n        // → 61.67\n        // → 54.56\n    </script>\n</body>\n</html>\nI get this:\n<!DOCTYPE html>\n<html lang=\"ru\">\n<head>\n    <meta charset=\"UTF-8\">\n    <title>Ð—Ð°Ð³Ð¾Ð»Ð¾Ð²Ð¾Ðº Title</title>\n</head>\n<body>\n    <noscript>Ð’ÐºÐ»ÑŽÑ‡Ð¸Ñ‚Ðµ JS</noscript>\n    <script>\n        //Ð¿Ñ€Ð¸Ð¼ÐµÑ€\n        // â†’ 61.67\n        // â†’ 54.56\n    </script>\n</body>\n</html>\nBut when I choose the \"copy to clipboard as html\" or \"view as html\" symbols stay right but formatting I need is lost. So it is not good for me either.\nIt would be great if this problem can be solved.\n. ",
    "kgizdov": "This line and the next are the culprit. Line background is set fixed and not taken from the theme. This is a bug.\n@n1k0 could you have a look. It looks very bad with monokai them for example.\nEDIT: Sorry, it turns out it's this line. Change to the colour you want and it works.\n. ",
    "eric-wieser": "I get something similar:\nTraceback (most recent call last):\n  File \"C:\\Program Files\\Sublime Text 3\\sublime_plugin.py\", line 543, in run_\n    return self.run(edit, **args)\n  File \"C:\\Users\\Eric\\AppData\\Roaming\\Sublime Text 3\\Packages\\SublimeHighlight\\SublimeHighlight.py\", line 143, in run\n    winclip.Paste(pygmented, output_type, plaintext)\n  File \"C:\\Users\\Eric\\AppData\\Roaming\\Sublime Text 3\\Packages\\SublimeHighlight\\HighlightLib\\winclip\\__init__.py\", line 53, in Paste\n    Put(unicodetext, CF_UNICODETEXT)\n  File \"C:\\Users\\Eric\\AppData\\Roaming\\Sublime Text 3\\Packages\\SublimeHighlight\\HighlightLib\\winclip\\__init__.py\", line 68, in Put\n    raise Exception('Failed to lock: %r' % code)\nException: Failed to lock: 6\n. ",
    "zhengqm": "Similar error:\nTraceback (most recent call last):\n  File \"F:\\Program Files\\Sublime Text 3\\sublime_plugin.py\", line 543, in run_\n    return self.run(edit, **args)\n  File \"C:\\Users\\lenovo\\AppData\\Roaming\\Sublime Text 3\\Packages\\SublimeHighlight\\SublimeHighlight.py\", line 143, in run\n    winclip.Paste(pygmented, output_type, plaintext)\n  File \"C:\\Users\\lenovo\\AppData\\Roaming\\Sublime Text 3\\Packages\\SublimeHighlight\\HighlightLib\\winclip\\__init__.py\", line 52, in Paste\n    Put(plaintext, CF_TEXT)\n  File \"C:\\Users\\lenovo\\AppData\\Roaming\\Sublime Text 3\\Packages\\SublimeHighlight\\HighlightLib\\winclip\\__init__.py\", line 68, in Put\n    raise Exception('Failed to lock: %r' % code)\nException: Failed to lock: 6\n. ",
    "ragchuck": "same here....\n. ",
    "adback03": "Also getting the same error as everyone else. Any updates on this?\n. I have fixed my issues as well by doing the following (Windows):\n1. Open C:\\Users\\YourName\\AppData\\Roaming\\Sublime Text 3\\Packages\\SublimeHighlight\\HighlightLib\\winclip__init__.py\n2. Comment out lines 52 and 53.\n   # Put(plaintext, CF_TEXT)\n   # Put(unicodetext, CF_UNICODETEXT)\n3. Save, and restart sublime.\nAfter I did this, copying as RTF or HTML both work, and I was able to paste into editors like Microsoft Word and Evernote just fine.\n. ",
    "simonlei": "I got the same error.\nThen I check the HighlightLib/winclip/init.py, at line 52 and 53, it's \n    Put(plaintext, CF_TEXT)\n    Put(unicodetext, CF_UNICODETEXT)\nI think it should be the error when it try to put twice, I just comment the first Put line,\nit works!\n. ",
    "Shoubi": "I have the same problem and correct it with the following steps:\n- In SublimeText menu, go to \"Preferences\" => \"Browse Packages...\"\n- Navitage to \"Highlight\\winclip\\\" folder\n- Edit init.py line 80 : change \"scd(c_int(format), hCd, 0, False)\" by \"scd(c_int(format), hCd)\"\n- Save file and restart SublimeText\n- \"copy as HTML\" should work now\nSetClipboardData takes only 2 parameters: http://msdn.microsoft.com/en-us/library/windows/desktop/ms649051(v=vs.85).aspx\n. ",
    "klashxx": "Thanks @Shoubi \n. ",
    "ButchAnton": "I'm also having the same problem on the Mac (El Capitan) and ST3.  I've installed it, it shows up in the package list and it has entries in the preferences (though everything is empty), but nothing having to do with SublimeHighlight show up in the command palette.  :-(\n. ",
    "laras126": "Try checking out the python 3 branch - cd into Packages/SublimeHighlight and git checkout python3. That worked for me!\n. ",
    "1Mark": "I tried that and it didnt work for me...\n1)Open the command palette (CTRL+SHIFT+P) then type PackageControl: Add Repository then paste https://github.com/n1k0/SublimeHighlight/tree/python3 \n2)Open the command palette again Install Package search SublimeHighlight ( it should now appear) and then select it.\n3) Restart Sublime.\nIt should let you copy as rtf when you right click on some text.. ",
    "rpbeltran": "I had to manually enable it after my installation, which matched the instructions posted above by 1Mark. From the command pallette use \"Package Manager: Enable package\" and find SublimeHighlight on the list. After this it worked immediately.. ",
    "dkugappi": "Also have this issue - \"Copy to RTF\" does not seem to copy the line numbers when enabling line numbers with \"linenos\": \"inline\",\n. ",
    "RubenPHP": "Same error here. I've submited a pull request with the fix. \nYou can see the fix here: https://github.com/n1k0/SublimeHighlight/pull/57/files\n. ",
    "kressi": "Thank you, this fixed my problem.\nI just realised, also with pull request https://github.com/n1k0/SublimeHighlight/pull/53/files the issue will no longer occur.\n. ",
    "OverStruck": "Worked on Xubuntu (Ubuntu 16.04 xenial). ",
    "prurph": "Same issue here. I haven't been able to find out where this is getting dropped but it may be the same reason for: https://github.com/n1k0/SublimeHighlight/issues/55.\n. ",
    "Frankenmint": "\nThis is what I'm getting\n. ",
    "lemonlab": "I am also interested !\n. ",
    "hashworks": "Works for me, thanks.\n. PR #61 fixes this for me and is a cleaner solution in my eyes.\n. ",
    "dbarros": "Cheers! Thank you for the Sublime package. \n. ",
    "joelw": "I noticed something similar. Checking the console, the following error is visible:\nreloading plugin SublimeHighlight.SublimeHighlight\nTraceback (most recent call last):\n  File \"/opt/sublime_text_3/sublime_plugin.py\", line 109, in reload_plugin\n    m = importlib.import_module(modulename)\n  File \"./python3.3/importlib/__init__.py\", line 90, in import_module\n  File \"<frozen importlib._bootstrap>\", line 1584, in _gcd_import\n  File \"<frozen importlib._bootstrap>\", line 1565, in _find_and_load\n  File \"<frozen importlib._bootstrap>\", line 1532, in _find_and_load_unlocked\n  File \"<frozen importlib._bootstrap>\", line 584, in _check_name_wrapper\n  File \"<frozen importlib._bootstrap>\", line 1022, in load_module\n  File \"<frozen importlib._bootstrap>\", line 1003, in load_module\n  File \"<frozen importlib._bootstrap>\", line 560, in module_for_loader_wrapper\n  File \"<frozen importlib._bootstrap>\", line 868, in _load_module\n  File \"<frozen importlib._bootstrap>\", line 313, in _call_with_frames_removed\n  File \"/home/user/.config/sublime-text-3/Packages/SublimeHighlight/SublimeHighlight.py\", line 17, in <module>\n    if desktop.get_desktop() == 'Windows':\n  File \"/home/user/.config/sublime-text-3/Packages/SublimeHighlight/HighlightLib/desktop/__init__.py\", line 167, in get_desktop\n    elif _is_xfce():\n  File \"/home/user/.config/sublime-text-3/Packages/SublimeHighlight/HighlightLib/desktop/__init__.py\", line 138, in _is_xfce\n    return _readfrom(_get_x11_vars() + \"xprop -root _DT_SAVE_MODE\", shell=1).strip().endswith(' = \"xfce4\"')\nTypeError: endswith first arg must be bytes or a tuple of bytes, not str\nGoogle suggested changing line 138 to endswith(b' = \"xfce4\"') and doing so fixed the plugin for me. Not being a Python programmer, I have no idea if this is a valid fix so I'm not sure I want to submit a PR. Ah, someone has already submitted a fix (using a different method) in #57.\n. ",
    "Yulei-Duan": "i have the same problem  . ",
    "ZoeVonFeng": "It should be fixed in this Pull Request. ",
    "zcwang3": "same issue on Mac OS with latest Sublime and plugin\ncopy as RTF does not work when code is view with Java Syntax\nTraceback (most recent call last):\n  File \"/Applications/Sublime Text.app/Contents/MacOS/sublime_plugin.py\", line 812, in run_\n    return self.run(edit, **args)\n  File \"/Users/zcwang3/Library/Application Support/Sublime Text 3/Packages/Highlight/SublimeHighlight.py\", line 117, in run\n    pygmented = self.highlight(output_type, full)\n  File \"/Users/zcwang3/Library/Application Support/Sublime Text 3/Packages/Highlight/SublimeHighlight.py\", line 105, in highlight\n    return pygments.highlight(self.code, self.get_lexer(),\n  File \"/Users/zcwang3/Library/Application Support/Sublime Text 3/Packages/Highlight/SublimeHighlight.py\", line 88, in get_lexer\n    lexer = pygments.lexers.guess_lexer(code)\n  File \"/Users/zcwang3/Library/Application Support/Sublime Text 3/Packages/pygments/all/pygments/lexers/init.py\", line 252, in guess_lexer\n    raise ClassNotFound('no lexer matching the text found'). 😯. 😯，so sad\ndo we have other plugin has similar functionality?. got it. Thanks very much 👍 . \"Copy as RTF\" works after the fix and the format can be paste into microsoft word.\nWhile when paste into Evernote, the color is missed...\nThanks. ",
    "Hsn723": "For anyone still having this issue, I took a look at it today and it might be a regex bug with the python3 branch. guess_lexer_from_syntax uses the regex re.match(r\"Packages/.*/(.*?)\\.tmLanguage$\", syntax) (line 60) when it should be re.match(r\"Packages/.*/(.*?)\\.(?:tmLanguage|sublime-syntax)$\", syntax) like on master. In fact that issue has already been fixed on master and the python3 branch hasn't been updated in a year. I don't know if the master branch is compatible with python3, but I'm closing this issue since it works for me now after editing that line.. "
}