{
    "akashivskyy": "Does this happen in playgrounds or in app targets as well?\n. @tomassliz Please check if the latest commit fixed your issue. You may install latest HEAD version by using \"master\" in your Cartfile:\nnone\ngithub \"netguru/ResponseDetective\" \"master\"\n. Installation fails because of code signing issues, please make sure that you have a valid provisioning profile for any framework to be built. :smiley:\n. Looks like I have to include Carthage/Checkouts as submodules (Carthage/Carthage#278)... But that's another issue, so I'm closing this for now and will release a pre-built 0.2 version for now. :)\n. @tomassliz FYI, 0.2 is now live. :smiley: \n. Not yet. There were plans to implement this, but they didn't make it to the 0.1 release.\nWe'll focus on that in the next iteration (and you can contribute as well, if you'd like). :wink: \n. I think the best way would be to use the underlying implementation that exists in NSURLSession's delegate (so there's no need to duplicate your code).\nBut there's no easy way of accessing it, because NSURLProtocol only receives NSURLRequest, without the information of which session is responsible for it. :confused: \n. Glad you've found the source of the issue. I will add the information about use_frameworks! to README. :smiley: \n. ResponseDetective is not yet compatible with Objective-C.\nHaving said that, this is a major area of focus in the next interation and I can promise that Objective-C support is soming soon. :wink: \n. This has been included in the upcoming 0.4 release.\n. Thanks for noticing! :wine_glass: \n. @AnthonyMDev I will investigate that. Could you provide me with a sample project?\n. Hi everyone, I came back to this issue recently and found out that cancellation happens because of Alamofire.Manager.deinit which invalidates the session, which triggers a chain reaction of cancelling all requests.\nThe following code:\nswift\nlet manager = Alamofire.Manager()\nmanager.request(.GET, \"https://httpbin.org/get\").response { _, _, _, error in\n    print(error)\n}\nwill always fail with NSURLErrorCancelled code, even with ResponseDetective disabled, because manager is deallocated before the request even starts loading.\nIn order for Manager to complete the tasks successfully, its instance needs to be retained (e.g. in a private property). This also makes ResponseDetective work again.\nI'm closing this issue as it has been tested with retained Alamofire.Manager in the upcoming 0.4 release.\n. Thanks for contribution! :sparkles: I just improved the code examples to be more declarative. :wink: \n. Closes #4.\n. Can anybody review this? cc @netguru/response-detective \n. This is not yet finished. :disappointed: \n. Done, sorry for the delay. :wink: \n. We want to deliver the best debugging functionality for production projects. Since most of them use Objective-C and/or Swift 1.2, we want to focus on those languages.\nNevertheless, Swift 2.0 support is certainly coming soon, and will probably be released by the end of September.\n. @davejlong That's our top priority right now, expect an update in a couple of days. :wink: \n. Sorry, had some high-priority issues in other projects (and a vacation). The development on ResponseDetective will return at full speed in October!\n. That went quicker than expected.\n. ResponseDetective 0.3 is now available via Carthage and CocoaPods.\n. Closes #9.\n. Builds fail because Circle CI does not yet fully support Xcode 7. Tests pass, tho, I promise.\n. Should be resolved by #15.\n. No, but I think we'll start working on that next week. I'll keep you updated. 🙂\n. >I'm working on the issue. Existing code base is already migrated, now I'm fixing tests and then I'm gonna update API to be more Swifty.\nFantastic! ✨ \n\nAs far as I understood you rely on objects order in dictionary. It fails because headers have different order:\n\nYeah, I agree that was kind of dumb on my side. If you'd like to change how the test behaves, feel free to do so. 😉 . Should be fixed by #15.\n. Hi @serejahh! How is the progress going? Maybe you could use some help? 😉 . I'm happy to help! 😊\nI created a feature/swift-3-dev branch so that we can collaborate without touching develop. You can re-target (close and one another) this pull request to feature/swift-3-dev and we'll work together on stage 2. 😉 . Nevermind that reopening, seems like I can change the base just like that. 😄 . As for conforming to Swift 3's API Design Guidelines, I see lots of places that can be improved in addition to changes in 707d1ff.\nAs for fixing JSONBodyDeserializer tests, I think your solution would be temporarily okay, just remember to use tabs, not spaces as we follow GitHub's Style Guide (I will put a link to that in README and CONTRIBUTING files).\nAs for fixing the buffer comparison tests, I think this is out of scope of this superb pull request. I'll need to think that over. 😉\nLet me know if this is ready for in-depth code review. ✨ . Hi! Swift 3 migration is tracked by #13, and a pull request #18 is already in progress. Will keep you updated!. It is set to \"yes\" in ResponseDetective-Common.xcconfig. 😉 \nIt looks like you're trying to import a pre-built Swift 2.3 version in Swift 3. If you're using Carthage, please use --no-use-binaries flag until a Swift 3 version is released.\n. @khurramengr: Just FYI, ResponseDetective 1.0 has been released. 😉 . How are you adding ResponseDetective to your project?. Does #import <ResponseDetective/ResponseDetective.h> work?. Ok, I will take a look at this and try to reproduce.. @VladKorzun @jaymathew: Can you paste here the exact error you're seeing?. @VladKorzun: Can you also paste the output of xcodebuild -version?. And does your project contain any Swift files or is it Objective-C only? (I'm just trying to reproduce the issue).. Are you not seeing \"Convert to Current Swift Syntax?\" dialog after installing ResponseDetective?. Okay, it seems I identified the issue. TL;DR: Will be fixed in ResponseDetective 1.0.\nWhen integrating with Objective-C-only projects, CocoaPods doesn't know which Swift version to use and doesn't set SWIFT_VERSION build setting for Swift pods.\nStarting with CocoaPods 1.1.0, there is a pushed_with_swift_version podspec JSON key that CocoaPods uses when installing a pod, but it only works for already pushed versions (and ResponseDetective 0.5 was pushed before that).\nIn addition, CocoaPods generates its own umbrella header file, ResponseDetective-umbrella.h, ignoring the already existing ResponseDetective.h. This causes the error reported by @SandeepAggarwal, because Swift types are not available after importing a non-umbrella header. To fix that, I pushed a custom modulemap and told CocoaPods to use that.\nThe two above problems are now fixed and will be included in ResponseDetective 1.0, which will be released today.\n. @SandeepAggarwal @jaymathew @VladKorzun: ResponseDetective 1.0 has been released. 😉 . Hi! When installing dependencies with Carthage, it gives you a URL to xcodebuild log. Can you paste its contents here?. Are you using Xcode 8.3 Beta?. This is an Xcode bug which has been fixed in Xcode 8.2.1:\n\nFixed an issue that could cause building a project to fail with the error message “\"Use Legacy Swift Language Version\" (SWIFT_VERSION) is required to be configured correctly for targets which use Swift” when using a supported version of Swift. (29667880)\n\nPlease update Xcode to 8.2.1 and check whether the error still occurs.. Please note that feature/swift-3-dev branch has been deleted and you now need to target develop (or wait for version 1.0). 😉 . ✨ . That is too little information. I cannot reproduce it.. For which request/response the body is missing?. I'm sorry, I still cannot reproduce it for GET https://httpbin.org/get.. It doesn't unfortunately. One last question: What are the Content-Type and Content-Length headers of the response logged by ResponseDetective?. Ok, I identified the issue. It seems that ResponseDetective does not honor a valid Content-Type headers containing parameters (such as ; charset=utf-8 in your case).\nThis bug will be tracked in #24 from now on.\nThanks for reporting! 🙇 . Seems to be a fairly simple thing. I expect to fix this and release a stable version 1.0 by the end of this week. 😉 . RespondeDetective 0.5, which is the latest version, is written in Swift 2. If you want to use Swift 3 version, please explicitly use bleeding-edge develop branch or wait for 1.0 release which is coming very, very soon.. @laindow: Just FYI, ResponseDetective 1.0 has been released. 😉 . Which ResponseDetective version are you using?. The develop branch, as the name suggests, is not stable. I'll let you know when stable 1.0 is released.. @yousefhamza: ResponseDetective 1.0 has been released. 😉 . Thanks! 👍 . Are you sure this isn't your app's fault? 😉 I cannot reproduce this, using an iPhone 7 running iOS 10.3.1 and Xcode 8.3.1 on macOS 10.12.4. \nAlso, apps never crash without any message or crash log. Please search for one and provide it so that it is possible to diagnoze the error.\nAs for the warning – it seems to be an issue with flags passed by Xcode to Swift compiler, which is beyond our control. 🙂 . Hi, @SandeepAggarwal!\nCan you confirm that the issue is on ResponseDetective's side and, if yes, provide some more information on how to reproduce the crash?. It is almost impossible for me to reproduce the issue without any hint. :wink: Between b0276c6...1fd7eee there were no changes that could potentially fix a runtime crash (the only thing that was fixed was a compile-time static analyzer error).\nIf this happens again, please include any logs and other information that may help in locating the issue.\nAs for the warning during carthage update, it is not connected with ResponseDetective – it might be a Carthage issue or potentially incompatible Xcode version.\nP.S. I advice locking dependencies to version, not specific commits.. As the issue is gone on your side and I cannot reproduce it, I'm closing this issue for the moment. If it ever happens again, feel free to either reopen this one, or create a new one. 🙂 . It seems ResponseDetective doesn't recognize application/x-www-form-urlencoded content-type. Will address this asap.. Released in 1.1.. (Sorry for a late response, I totally missed the notification on this issue).\nResponseDetective doesn't support multipart/form-data requests. They are very complex and may contain multiple segments with multiple content-types which makes them particularly hard to implement correctly.\nThat being said, the support for multipart/form-data will be a point of focus in the next major release, that is 2.0.. This will be tracked by #39 – you can subscribe for updates under that issue. 😉 . It seems that version 1.1 already builds without issues from source, using Carthage and using CocoaPods in Xcode 9 Beta 5.. Well, it looks like Xcode 9.3 fixed this for us – libxml2 is now a module, which means we can do straight import libxml2 in Swift. 🎉 . Thanks! 👯 . ⛵️ . Carthage 0.26 now uses archive when building against device SDK, so that apps don't get rejected for using LLVM instrumentation (code coverage) in frameworks.\nI will release a new version of ResponseDetective which supports archiving (I have no idea why it doesn't support it already).. Did you try doing what the error suggests to do? :). Hi @adamhongmy, I'm not sure what you mean. Swift Version build setting is set up here.. What's your version of CocoaPods?. Okay, last question: is the error thrown for ResponseDetective target in Pods.xcodeproj or for your own app target?. I can't reproduce this error – I created a brand new project in Xcode 9.2, added ResponseDetective as CocoaPods dependency, installed it and built the project successfully. Please make sure you're not modifying any targets auto-created by CocoaPods and use a compatible version of ResponseDetective.\nI'm closing the issue for now. If you still believe that the error lies on the side of ResponseDetective, please open a new issue and provide more information, such as a sample project with failing configuration.. Thanks! ⛵️ . Fixed in ce59947eda8aa4aee955756d845131d1a93754d3 and released in 1.2.3. Thanks for reporting! 🙌 . Oh, my bad. I can't release 1.2.3 to CocoaPods without doing a force push, so I will release 1.2.4.. Released as 1.2.4 and pushed to CocoaPods trunk. Sorry for 1.2.3 not being there. 😔\nPlease open a new issue if there are any further problems.. The latest stable release of ResponseDetective includes a pre-compiled binary for Swift 4.0.3. This is not going to change until the next version.\nWhat you see is not an installation error because in your case, Carthage will compile the library manually anyway.. To resolve what exactly? 😉 This is not an error, it's just a message from Carthage that it will compile the library because the pre-compiled binary was made with an earlier Swift version.. Hi, sorry for being late. This sounds like a bug in CocoaPods. I'm closing this for now, if you believe this should not be closed, feel free to reopen.. Let's be a little future-proof and add + to OS X version as well. And since we're here, I would also add information about Xcode version:\nmd\nResponseDetective requires **Xcode 7.0+**, targeting **iOS 8.0+** or **OS X 10.10+**.\n. Please remove these SWIFT_VERSION settings from the project file itself (by hitting backspace in \"Build Settings\" list) and update the value in ResponseDetective-Common.xcconfig instead.. Let's use private if possible (this affects other fileprivates as well).. Thanks for remembering about the playground! ✨ . You forgot to change spaces to tabs here... 🙈 . And here as well (tabs). 😄 . Yes, but I don't see any extensions. 😉 \nI just prefer the most restrictive access modifier – if there are no extensions, there is nothing that justifies them to be fileprivate.. As it should. 😄 . Will fix!. Tests on all 3 platforms pass so it doesn't. 😉 \nApple documentation has been lying about availability from day one, see -[NSArray init] for example. It says it's available since... iOS 7 and macOS 10.9. :trollface: \nThat availability is misleading since the symbols such as NSArray or URLComponents are introduced in Swift releases, not Foundation releases. But since Apple bundles Swift and SDK releases, symbols that have been introduced in Swift 3, are always marked as available since SDK versions, such as iOS 10, macOS 10.12, etc.\nURLComponents has been introduced in Swift 3 (along with macOS 10.12), yes. But as it's only a bridging type and since Swift's stdlib is bundled with the app, the only thing that matters is the underlying NSURLComponents class. And that's available for a long time.\nIf you cmd+click URLComponents, you'll see no @availability attributes.\nThe check you commented above is for URLComponents.queryItems, which seriously was introduced in macOS 10.10 (the property has an @availability macro).. Hell, I even fell into the trap and, since I'm not familiar with tvOS, I marked this as available since tvOS 10.0, while it's really available since tvOS 9.0 (the first release of tvOS). 🙈 . I think this is missing removeAllStubs in afterSuite.. ",
    "tomassliz": "I tried this only in app target - new clean iOS project.\n. I can't install latest HEAD version. This is output of carthage update command:\n```\n Cloning ResponseDetective\n Checking out ResponseDetective at \"99a7428b07a7ffbd54d5613c87f27dd7f0538807\"\n xcodebuild output can be found in /var/folders/3s/5fmt6_0d6zx7m316ynk2_4cr0000gn/T/carthage-xcodebuild.iRaoun.log\n Building scheme \"ResponseDetective (iOS)\" in ResponseDetective.xcodeproj\n BUILD FAILED \nThe following build commands failed:\n    Check dependencies\n(1 failure)\nA shell task failed with exit code 65\n```\nI tried to create new project or clean Carthage cache. So it's maybe problem with your framework settings.\nAnyway, if I clone your project and build the latest HEAD version manually everything is ok and the original issue is fixed.\n. I don't think that code signing is the problem. Problem is that you have private dependencies and that's why Carthage can't build it. Look at this:\n```\n~/Desktop/Detective $ carthage update --platform ios --verbose\n Fetching ResponseDetective\n Checking out ResponseDetective at \"cc54353fa3994436192298f199bab9f9242350e9\"\n*** Building scheme \"ResponseDetective (iOS)\" in ResponseDetective.xcodeproj\nBuild settings from command line:\n    SDKROOT = iphonesimulator8.4\n=== BUILD TARGET ResponseDetective (iOS) OF PROJECT ResponseDetective WITH CONFIGURATION Release ===\nCheck dependencies\nThe file “Release.xcconfig” couldn’t be opened because there is no such file. (/Users/deny/Desktop/Detective/Carthage/Checkouts/ResponseDetective/Carthage/Checkouts/xcconfigs/Base/Configurations/Release.xcconfig)\nThe file “iOS-Framework.xcconfig” couldn’t be opened because there is no such file. (/Users/deny/Desktop/Detective/Carthage/Checkouts/ResponseDetective/Carthage/Checkouts/xcconfigs/iOS/iOS-Framework.xcconfig)\nBuild setting PRODUCT_NAME undefined\n BUILD FAILED \nThe following build commands failed:\n    Check dependencies\n(1 failure)\nA shell task failed with exit code 65\n```\n. Thank you, I♥️ this project idea.\n. I would like to contribute but I don't know how to implement this. Alamofire solved this with own block property. But when you do the same, where should be then the right place for setting up this block? In your library or in Alamofire? I don't know.\n. ",
    "combinatorial": "I realized I didn't have the right min SDK version. I fixed that, now I get the error...\n[!] Pods written in Swift can only be integrated as frameworks; this feature is still in beta. Add use_frameworks! to your Podfile or target to opt into using it. The Swift Pod being used is: ResponseDetective\nSo I added use_frameworks! and it worked\n. ",
    "mateuszbuda": "Solution found: https://github.com/netguru/ResponseDetective/pull/6\nJust needed to append InterceptingProtocol to protocol classes and not assigning new array like suggested in Usage\nconfiguration.protocolClasses?.insert(InterceptingProtocol.self, atIndex: 0)\n. Are you using anything else that do something with protocolClasses?\n. ",
    "AnthonyMDev": "I'm having this problem while using the new suggested way of adding the protocol class with Alamofire.\n. I fixed this by using append rather than insert: atIndex:\nEdit: Scratch that. This doesn't fix it. This allows the requests to work, but stops intercepting the requests.\n. Here is the code that is setting up my configuration:\n```\n  let networkManager: Manager = {\n    let configuration = NSURLSessionConfiguration.defaultSessionConfiguration()\n    configuration.HTTPAdditionalHeaders = Manager.defaultHTTPHeaders\nconfiguration.protocolClasses = map(configuration.protocolClasses, { (var protocolClasses) in\n  protocolClasses.insert(InterceptingProtocol.self, atIndex: 0)\n  return protocolClasses\n}) ?? [InterceptingProtocol.self]\n\nreturn Manager(configuration: configuration, serverTrustPolicyManager: nil)\n\n}()\n```\nThe configuration's protocolClasses array contains:\nResponseDetective.InterceptingProtocol,\n_NSURLHTTPProtocol,\n_NSURLDataProtocol,\n_NSURLFTPProtocol,\n_NSURLFileProtocol,\nNSAboutURLProtocol\nI'm going to continue attempting to debug this this morning, but I'm pretty lost at the moment.\nIt may be worth noting that I'm making HTTPS requests. I know there were issues in the past with that.\nI'm also using the commit tagged for version 0.2\n. It seems that stopLoading is being called, which is canceling the request. But when I check out the response in the debugger, I see that the response from the server is there. I just also have an error NSURLErrorDomain code=-999 \"canceled\"\nBecause there is an error, my validation is failing.\nResponseDetective is also never logging the responses.\n. ",
    "davejlong": "Any update on this? With Xcode 7 forcing developers to upgrade apps to Swift 2, ResponseDetective just became utterly useless.\n. Thanks. Was a little nervous seeing no commits on the project in a month.\n. Dang. That's a hell of a responsive OSS owner. Thanks @akashivskyy \n. One minor change to README in PR #11 \n. ",
    "sxua": "Hi guys, do you have any ETA for Swift 3 compatible version?\n. ",
    "serejahh": "Hi @akashivskyy! I'm working on the issue. Existing code base is already migrated, now I'm fixing tests and then I'm gonna update API to be more Swifty. While fixing tests, I got a failed ConsoleOutputFacilitySpec tests. As far as I understood you rely on objects order in dictionary. It fails because headers have different order:\nactual:\n\"X-Baz\": \"qux\"\n\"X-Foo\": \"bar\",\nexpected:\n\"X-Foo\": \"bar\",\n\"X-Baz\": \"qux\". Hi @akashivskyy. I hope I'll finish 2 step on the weekend. If you have time, let's finish it together 😄 . That's great! I've reviewed API and I can't say it doesn't follow. I just changed one thing. About tests:\n1. I've fixed tests for JSONDeserializer, but the solution doesn't look good 😿. Please have a look at https://github.com/netguru/ResponseDetective/pull/18/commits/a3e67c5b29109cc1ba3b80e4396a7a87bc044760\n2. What would your suggestion be for tests which compare buffer output just by comparing strings (I mentioned it in #13)? . Oh, sorry. I've just fixed it 😉 \nI believe you can review and merge it (to be able to commit your change). Damn! Github diff didn't show . Why do you prefer private over fileprivate? I love to use extensions in ways Natasha The Robot described. In this case you need fileprivate. \nLooks dangerous 😄 . ",
    "khurramengr": "@akashivskyy if it supports Swift 2.3 then it should work with \"Use Legacy Swift Version\" set to 'yes'. ",
    "SandeepAggarwal": "Using Cocoapods \npod 'ResponseDetective', :git => 'https://github.com/netguru/ResponseDetective.git/' , :branch => 'feature/swift-3-dev'. Yes, #import <ResponseDetective/ResponseDetective.h> it gets complile but doesn't serve any purpose.\nThen I get an error saying \n\nDeclaration of 'RDTResponseDetective' must be imported from module 'ResponseDetective.Swift' before it is required\n\nHence I go with @import ResponseDetective;. /usr/bin/xcrun xcodebuild -project \"/pathToMyProject/Carthage/Checkouts/ResponseDetective/ResponseDetective.xcodeproj\" -scheme iOS -configuration Release -sdk iphoneos ONLY_ACTIVE_ARCH=NO BITCODE_GENERATION_MODE=bitcode CODE_SIGNING_REQUIRED=NO CODE_SIGN_IDENTITY= CARTHAGE=YES clean buildBuild settings from command line:\n    BITCODE_GENERATION_MODE = bitcode\n    CARTHAGE = YES\n    CODE_SIGN_IDENTITY = \n    CODE_SIGNING_REQUIRED = NO\n    ONLY_ACTIVE_ARCH = NO\n    SDKROOT = iphoneos10.1\nBuild Preparation\nBuild task concurrency set to 4 via user default IDEBuildOperationMaxNumberOfConcurrentCompileTasks\n=== CLEAN TARGET ResponseDetective (iOS) OF PROJECT ResponseDetective WITH CONFIGURATION Release ===\nCheck dependencies\n“Use Legacy Swift Language Version” (SWIFT_VERSION) is required to be configured correctly for targets which use Swift. Use the [Edit > Convert > To Current Swift Syntax…] menu to choose a Swift version or use the Build Settings editor to configure the build setting directly.\n“Use Legacy Swift Language Version” (SWIFT_VERSION) is required to be configured correctly for targets which use Swift. Use the [Edit > Convert > To Current Swift Syntax…] menu to choose a Swift version or use the Build Settings editor to configure the build setting directly.\nBuild Preparation\nBuild task concurrency set to 4 via user default IDEBuildOperationMaxNumberOfConcurrentCompileTasks\n=== BUILD TARGET ResponseDetective (iOS) OF PROJECT ResponseDetective WITH CONFIGURATION Release ===\nCheck dependencies\n“Use Legacy Swift Language Version” (SWIFT_VERSION) is required to be configured correctly for targets which use Swift. Use the [Edit > Convert > To Current Swift Syntax…] menu to choose a Swift version or use the Build Settings editor to configure the build setting directly.\n“Use Legacy Swift Language Version” (SWIFT_VERSION) is required to be configured correctly for targets which use Swift. Use the [Edit > Convert > To Current Swift Syntax…] menu to choose a Swift version or use the Build Settings editor to configure the build setting directly.\n. Cartfile:\ngithub \"https://github.com/netguru/ResponseDetective.git\" \"feature/swift-3-dev\". No Xcode 8.1. Thanks, I will  update the Xcode and will let you know the status of this issue.. Thanks @akashivskyy  you saved my next 30 minutes :). It is working fine in Xcode 8.2.1. Sorry about that, I am using following code to set up ResponseDetective.\nNSURLSessionConfiguration *configuration = [NSURLSessionConfiguration defaultSessionConfiguration];\n[RDTResponseDetective enableInConfiguration:configuration];. GET request. Response body is missing. ```\nNSURLSessionConfiguration *configuration = [NSURLSessionConfiguration defaultSessionConfiguration];\n[RDTResponseDetective enableInConfiguration:configuration];\n\nid connection = [[TRCConnectionNSURLSession alloc] initWithBaseUrl:[NSURL URLWithString:@\"SomeURL\"] configuration:configuration];\n```\nI am using Typhoon Rest client . May be this will give you any hint.. Content-Type: application/json; charset=utf-8\n Content-Length: 19099. Glad, it helped you track a bug. Btw, How much early can I expect to get it fixed?. yes, the issue was either of Carthage or ResponseDetective.\nAs I mentioned in the ticket, the crash issue has gone when I updated the Carthage but it also raised the warning which I have mentioned above.. Prior to update , I had  ResponseDetective  with the commit ID: 'b0276c6' and I have updated it to commit with ID: '1fd7eee'.\nHope this helps to reproduce the issue.. ",
    "jaymathew": "Same issue here . ",
    "VladKorzun": "Same issue when trying to import 0.5 version in Objective-C project. I've installed ResponseDetective via cocoapods:\npod 'ResponseDetective', '~> 0.5'\nThen when I try to import it\n@import ResponseDetective;\nI get \"Could not build module 'ResponseDetective'\" error. If I try to import it like\n#import <ResponseDetective/ResponseDetective.h>\nand try to enable configuration \n[RDTResponseDetective enableInConfiguration:configuration];\nI get \"Declaration of 'RDTResponseDetective' must be imported from module 'ResponseDetective.Swift' before it is required\"  error. Xcode 8.2.1\nBuild version 8C1002. Objective-C only. Yes! Thank you, I've got it. It was just unclear for me from errors I've got that the issue was caused by unspecified SWIFT_VERSION. \nThanks! . ",
    "yousefhamza": "I'm using the develop branch for Swift 3. But it's the only version working with xcode 8, What branch/version shall I use to use it with xcode 8?. ",
    "mmackowiak": "+1 for this one. Especially useful for 3rd party debugging, but also other traffic, not necessarily owned by app, like AVPlayer. FLEX debugger can be probably used as a reference, from what I've seen, swizzling is used there.. ",
    "adamhongmy": "Oh I see. Well I hope you able to implement it in version 2. :D cheers . Hi, sorry for late reply. I thought the setting it mentioned is the framework. I will try tomorrow.. I had configure it and it works. Thanks for your patience. Cheers. Hello, can you set the swift language version on your end? It is getting tedious to reset it every time.. Weird, everytime I run pod install in the terminal, I always get this error in xcode and I have to manually reconfigure it.. As an alternative, I use Carthage instead. It doesn't seem to be having the error.. Allo, sorry for the delay. My version is 1.3.1. It is from Pods.xcodeproj. \n\n. Alright, what should I do to resolve this then?.  :anguished:. ",
    "bpolat": "Can you please update pod for Xcode 9.3? . ",
    "PatrykKaczmarek": "I think sentence below would be more precise:\nrequires minimum \nor \nrequires iOS 8+ / 10.10+ . ",
    "pikor": "Compiler is not complaining about it? From Apple docs, URLComponents is available from macOS 10.12+ (https://developer.apple.com/reference/foundation/urlcomponents). So line 22 shouldn't be\nif #available(macOS 10.12...? If the answer is yes then remember about *Spec.swift file.. "
}