{
    "nikgraf": "@eugene1g thanks a lot for the feedback. Which browser do you use? I can't reproduce it :(\n. @eugene1g This screenshot was worth gold. Thanks :smile:\nI did a bit of testing & now believe it's an issue of the valueLink functionality. Could you confirm?\nProviding a defaultValue for the TextInput (new lines not allowed) results in this:\n\nWith new lines allowed you can see little spike which I believe are due the height calculation. The number of total nodes rised, but only by a handful.\n\nI tried valueLink first with a plain textarea & then with an input of type text and it resulted in a similar memory behaviour:\n<input type=\"text\" valueLink={ this.linkState('value') } />\n\n<textarea valueLink={ this.linkState('value') } placeholder=\"Just fill in whatever you like :)\" />\n\n. People still have issues here: https://www.reddit.com/r/reactjs/comments/3dh9k0/introducing_belle_100_easy_to_style_react/ct596fp\n. Solved with https://github.com/nikgraf/belle/pull/129\nReally good find @jpuri \n. The Toggle is part of the core! :smile: \n. Done by pair programming with @GCinellu\n. Done by pair programming with @GCinellu \n. I feel we don't need it.\n. Resolved with this commit https://github.com/nikgraf/belle/commit/f530038965a91aba4e64c3f51fe0f2133925faef\n. Hey @GCinellu \nUnfortunately when typing npm install the in npm 1 & 2 the peerDependencies are installed as well. By removing them I could make sure the setup allows to make changes to Belle while instantly reviewing them in the examples playground or docs.\nAccording to the docs npm 3 won't have these issues:\nNOTE: npm versions 1 and 2 will automatically install peerDependencies if they are not\nexplicitly depended upon higher in the dependency tree. In the next major version of\nnpm (npm@3), this will no longer be the case. You will receive a warning that the\npeerDependency is not installed instead.\nhttps://docs.npmjs.com/files/package.json\nhttp://blog.npmjs.org/post/110924823920/npm-weekly-5\nI'm happy to merge any pull-request that improves the situation, but for now I'm not sure how.\n. Fixed the npm install belle issue for windows with https://github.com/nikgraf/belle/pull/159\n@blakeembrey thanks a lot for pointing that out. I missed that postinstall also runs when people do npm install belle. It was intended as fix for the development environment, because peerDepedencies even get install when you do npm install in the library.\n. @GCinellu We fixed the Windows issues :smile: \n. @GCinellu did you maybe miss to check in changes to style/select.js. I tried the branch and it didn't work.\n. @GCinellu I merge it & try to fix what's missing. Thanks again for helping out here :smile:\n. Solid changes! Looks good :+1: \n. Interesting at point 3. Intuitive I would have expected the value only to change after the user selected it (space or enter)\n. @jpuri I will close it. We can bring them up as separate issues. I can do that.\n. ouch :smile: - thanks for fixing @jpuri :+1: \n. :tada: :smile: \n. :+1: \n. :smile: \n. Let's just do it. I want hot reload of components :smile: \n. Might be a good base https://github.com/gaearon/library-boilerplate\n. Done with this Pull-Request https://github.com/nikgraf/belle/pull/183\n. :+1: We probably should use the same wording a React documentation & also refer to it with links.\n. Interesting issue: https://github.com/facebook/react/issues/4751\n. @jpuri I found a few questions/issues we probably should fix first:\n1. I typing in \"Te\". While \"Te\" is in the originally provided list it is not shown as an Option.\n2. When typing in \"TE\" (uppercased) the background characters are lowercase in grey & do not properly overlap.\n3. When clicking on the input I instantly see the first suggestion. When I hit the backspace key it is removed instantly.\n4. Why did you call it pseudoInput? With pseudo in the context of HTML I associate pseudo classes in CSS. Why not call it just hint? btw I didn't come up with this name. I noticed typeahead uses it as class name on their hidden input.\n5. Please update the documentation as well (also the internal structure, style configuration) :smile: \n. We probably should also make that clear in the documentation as well (every component).\nCould be done with an example like:\n// When hovering the component, the color will be blue and the background still green.\n<Button style={{ color: red, background: green }} hoverStyle={{ color: blue }}>Follow</Button>\n. @jpuri by extend I meant it like this:\n// When hovering the diabled component, the color will be blue and the background still green.\n<Button disabledStyle={{ color: red, background: green }} disabledHoverStyle ={{ color: blue }}>Follow</Button>\nRegarding the API: Would you suggest to change the API for Rating? While it doesn't comply with the other components styling configuration I though it would make more sense as the style is directly applied to the character. Maybe the old html structure was better?\n. :+1: sure, I added this issue: https://github.com/nikgraf/belle/issues/86\n. Solved with this PR: https://github.com/nikgraf/belle/pull/87\n. Closed with this PR https://github.com/nikgraf/belle/pull/63\n. @jpuri only that the API becomes consistent between all Belle components\n. I see it as a chance to do better than HTML :)\n. @jpuri cool, let's use it :smile: \n. Solved with: https://github.com/nikgraf/belle/pull/100\n. Solved with: https://github.com/nikgraf/belle/pull/102\n. Closed with this PR: https://github.com/nikgraf/belle/pull/94\n. yay :)\n. Some thinking behind the look & feel:\n\n. Closed with https://github.com/nikgraf/belle/pull/72\n. A related issue is that when doing a Ctrl+Click to show the context menu the active state never goes away.\nThe solution might look similar as in: https://github.com/nikgraf/belle/pull/97\n. It was more of an idea. If you press the mouseDown on a button & then move away without leaving it would be great to indicate that if you release the mouse outside the click won’t be triggered (by removing the active state)\n. Might still be valid for touch events.\n. Not sure if we should do this as it breaks with default active state behaviour.\n. I think we can close it :)\n. There is a note in the code: https://github.com/nikgraf/belle/blob/master/src/components/Select.jsx#L349\n. Didn't find a solution. We can do this later.\n. What happened to getHint? Was it not used anymore?\n. One way to deal with it could by leaving out children completely like <Option value=\"some text\" />. The downside here would be a lot of checking & complexity is needed.\nOn alternative thing I though of for the select was introducing a second component:\n<TextSelect options={[ 'Apple', 'Banana', 'Cherry' ]}>\nIn this case we could even leverage the native select implementations on mobile devices:\nhttp://media.mediatemple.netdna-cdn.com/wp-content/uploads/2010/03/mobileinputs5.jpg\n. :top: work :smile: \n. @jpuri I'm looking into this now\n. Fixed with this PR: https://github.com/nikgraf/belle/pull/97\n. I like the idea of make them expandable. What might make it easier is have short list of all properties in the beginning? I will experiment with it.\nOne more thing that might be good is to provide a simple code example for every property.\n. Let me also look at other documentation.\n. Instead of splitting would could just use filters.\n. @jpuri There actually was something wrong with the way I managed props.\nregarding focus settings: I will continue on the bootstrap theme today. I think this will have a big impact on the API design.\n. Solved with this PR: https://github.com/nikgraf/belle/pull/87\n. Closed the wrong issue\n. Right, there is no point in doing so. Let's close this one.\n. @jpuri super good cleanup! I added one commit. As select is not a pseudo class & for the use-case it should not inherit the base style. The purpose of selectStyle is to allow users to apply completely different styling for the situation when the Option is displayed in the Select (not in the options menu). If we would have inheritance here it would make peoples life probably bit harder.\n. Sweeeet!\n. @jpuri I needed this fix for the bootstrap theme. Can you double check?\n. Super helpful!\n. Solved with PR: https://github.com/nikgraf/belle/pull/105\n. :+1: looking forward to this\n. We included underscore. In the future we will refactor this part & take only what we need. https://github.com/nikgraf/belle/pull/108\n. \n. :smile: \n. \n. good find, unfortunately it's still a problem because pseudoClass styles are only updated in the constructor or willReceiveProperties. We just call render on theme switch right now. I'm not sure we even want to handle the case people changing the config on the fly properly. As an alternative we could have a query string in the route & based on this decide the theme. When someone changes the theme we switch the URL & do a window.location.reload()\n. Hmmm, we can provide an extra API, but I had the feeling it's not necessary. The idea was that if we have simple plain JS objects then people are familiar with it & can overwrite or extend them depending on what they want.\n. I think the API Vjeux proposed to create multiple stylings on one page would still be nice on top of the existing API. I fell we still should stick to the commonJS API use-case. That's what JS people are used to.\n. Fixed with this PR: https://github.com/nikgraf/belle/pull/109\n. good one!\n. works fine :+1: \n. Looks good!\n. @luisrudge oh, thx for point this out. What Windows version do you have?\n. Good to know. Might be better to use custom SVG icons in case Windows doesn't support certain unicode characters. /cc @jpuri \n. @luisrudge I love the level of detail you looking at the components. Will definitely look into it on how to speed it up!\n. :+1: :smile: \n. :+1: \n. +1\n@kof What are your thoughts about what React Native is doing. I haven't looked into it, but I heard they kind of sort them.\n{\n  borderLeft: '1px solid red',\n  border: '1px solid black'\n}\nIn this case the left border will still be red. Instead of taking the last definition they sort based on the level of detail. Some people would like to see this even for the default React style property. If I'm not mistaken it's even easy to implement, because a more detailed version descriptor is always prefixed with the original e.g paddingLeft has padding as prefix.\n. Great :smile: \n. Main question here: What value can we add compared to ?\nMy first guess is: We can provide a nicer interface for editing numbers. Yet I'm not sure what's a great a experience. It also might very different depending on the range or if decimals are allowed/not allowed.\nThere are list of helpful attributes: min, max, step and inputmode=\"numberic\".\nImportant UX requirements:\n- On Mobile devices we should show a numbers keypad if available\n- Formatting/localisation should be supported\n- Should the user be able to type characters? Do we show a warning or prevent it?\nThx to @ungerik for his feedback\n. Today @jpuri & I did some brainstorming. We thought about providing two components:\n<DatePicker>\nThe datepicker component is just the component to select a date. In mobile situations people might want to use it directly. It's also great to just show a calendar in case no event listeners are bound. This also allows people to cover more complex date/range selections with custom components.\n<DateInput>\nThe dateinput looks like an input field. By default we put a calendar icon next it. But clicking the calendar icon a datepicker will open. The text is still editable, but is going to be validated like in this example: http://rudeg.github.io/react-input-calendar/\n. @jpuri interesting read regarding focus behaviour: http://ux.stackexchange.com/questions/52849/datepicker-behavior\n. @jpuri I thought about the ctrl+up as well, but the issue here is that even on OSX these keyboard short cuts are used for different things by default.\nlook what I found: http://www.w3.org/TR/wai-aria-practices/#datepicker - I suggest to exactly use the keyboard short cuts as they propose.\nThis also has some nice hints regarding behaviour: https://www.w3.org/WAI/PF/HTML/wiki/Datepickers\n. @jpuri I updated the sub-tasks on top (added suggestions & bugs I found)\n. @LucaColonnello honestly we are not sure yet - we did a brainstorming for mobile navigation most recently:\nOn Mobile\n\nSlide the main page to the right (sometimes left). This is becoming popular and feels pretty good. This navigation field is even scrollable. I like Slack's version on iOS where you have search bar on top.\n   You can grab the menu. If you slide it it will complete the slide, but as like with the toggle you can grab it and move it from left to right and back.\n\n\n1. Also very popular the burger menu like Bootstrap3 has it. It's a one time animation to open & close it. It is not positioned absolute, but rather moves the content down. This is especially nice in case the list is longer than the screen.\n\n1. In Angular Material you see the Navigation fading in from the left and overlaying the content. It's an animation you can't control. If you click a Navigation entry or click on the small content area if changes the content and fades the navigation area back.\n\nOn Desktop\n\nVery common is a top navigation. Some have dropdowns e.g. Google, Facebook.\nSometimes you get the same left navigations as with on mobile devices, but because of the larger screen it's always visible.\n\nOpen Questions\n\nWhat are the event handlers?\nHow does it move the content? Does the content need a special wrapper tag to make sure the styling works fine or is it not problem?\nFor menu of type-1 above, if someone is using on desktop, how will user drag it in. User may end-up resizing the browser rather. <- like on Slack app or our toggle a simple tap or click is good enough to slide it. No need to slide it all the way.\n\nNotes\nThe first one (Slack like) looks good on Mobile and might also look good on Desktop. What happens if someone wants to have a top nav on desktop and the left sided menu on mobile.\nShould be pretty easy. We can provide an example based on responsive design to switch between.\nWe would need to provide users with couple of nav designs:\n1. Simple link\n2. Dropdown with multiple options\n3. Expandable links\nOpen question: How do they play with react-router?!? We need to investigate there.\nI like the idea of having the simple navigation component which is just taking care of left/right sliding. People can use their own links or if they want to leverage the ready to use design of belle the can use our simple link, drowns & expandable link components like described above.\nPossible names: <LeftNavigation>, <Navigation>, <Nav>, <LeftNav>, <MobileNav>, <SlideNavigation>, <SlideNav>\n<Navigation>\n   <NavLink>Home</NavLink>\n   <NavGroup> // expandable\n      <NavTitle>Components</NavTitle>\n      <NavLink>Button</NavLink>\n      <NavLink>ComboBox</NavLink>\n   </NavGroup>\n  <NavDivider/> or <NavSeparator/>\n</Navigation>\nInspriations: https://www.google.com/design/spec/patterns/navigation-drawer.html#\nI noticed that most of sites have navigation at both places left and top like gmail, youtube, slack, bootstrap. Though left menus are more often like nested list, but top menu are more often individual choices like buttons, dropdowns. What comes to my mind is 2 kinds of components:\nA bootstrap kind of nav-bar / app-bar  (http://getbootstrap.com/components/#navbar)\nA gmail / slack (in mobile) kind of left-nav\nI think making just one component and adjusting it for for both left and top navs may increase complexity of component and we may lose some of the cool unique features. <- couldn’t agree more. Let’s make multiple components and make them good (nik)\n. Proposed rules:\n- The next version is developed on the develop branch. I don't like the complexity of git flow, but it kind of makes sense for developing a library. http://nvie.com/posts/a-successful-git-branching-model/\n- We still want to release often even if it's a small fix.\n- We should have Changelog. Pull requests should update the changelog as well.\n- Be there for questions in http://www.reactiflux.com/ (do we need Gitter then?)\nThoughts? Anything else? @jpuri \n. +1 on the guidelines for contributors (e.g. git commit messages, code of conduct)\n. good one!\n. Fixed with: https://github.com/nikgraf/belle/pull/145\n. I'm so glad you identified that issue. Sadly this will prevent the highlighting on the page. It never worked on development, because the css file is not available.\nI will check later today, but it should be possible to render the highlighting code component only once.\n. @jpuri I made a change. What do you think about this version?\n. I will close this card. We are doing it a lot anyway.\n. @alexkuz We somehow missed that! Thx Alex :smile: \n. @alanrsoares Good find!\nSounds better to search through the Option children instead of value. If we switch the default behaviour the second issue should be solved as we. I guess the tricky part here will be to get a text representation in case the there are nested children. My first guess is that we will need a helper function to traverse through the children and compile a text version e.g.\n<Option>\n  He<span>ll</span>o World!\n  <div>\n    This is a <b>Test</b>\n  </div>\n</Option>\nshould result in Hello World!This is a Test\n@jpuri What do you think?\n. Hmm, I didn't think of the case that we actually copy the value into the input. That makes things a bit more tricky.\nI definitely can see the use-case where you want to have IDs in the value rather than the actual value. I must say right now the ComboBox is not very well designed for this use-case. Actually I will need to later today as well.\nSome thoughts on how it could work:\n<ComboBox>\n  <Option value={ 1234 } inputText={ Croatia }>\n    <img src=\"/path/to/croatia-image\" />Croatia (Special Deal)\n  </Option>\n  <Option value={ 1235 } inputText={ France }>\n    <img src=\"/path/to/france-image\" />France (Best Price)\n  </Option>\n</ComboBox>\nIn this case we could take the inputText and apply it to the input when selecting an Option with they mouse for example.\nWhat also would be useful/necessary is to make onUpdate only be called when a perfect match happened. inputProps={ onUpdate: this.onInputUpdate } would still allow to read out whenever a character in the input changed or a option has been selected and the input was updated.\nThese are a few API changes and it complicates things a bit more. On the other side it would help to support the use-case of selecting from a pre-defined list. I will sleep over it and have look tomorrow again. What are your thoughts @jpuri @alanrsoares ?\n. @jpuri You almost had it. A lot of people don't use see/use it as an Input like the Google search rather then a Select with better UX for large sets of data. Think like the use-case of typeahead https://twitter.github.io/typeahead.js/. When someone searches for a Twitter user the onChange with typing is not helpful. What you want to know is if the user selected with typing or mouse click is in the list of the available Options you provided. It's important because if you have a match you can redirect to the profile. If it's not a match you don't want to do anything and let the user continue it's search.\n. @alanrsoares Just had a call with @jpuri and we came up with an idea:\nInstead of allowing to change the behaviour of value we could add an optional identifier which we provide in the onUpdate callback. We also consider adding an extra callback in case a exact match happened.\n```\n\nFrance (Best Price)\n\nonUpdate({\n  value: \"France\",\n  identifier: 1234\n})\n```\nWhat do you think?\n. Hey @alanrsoares, just right now we released a new version of Belle allowing you to pass in via the onUpdate callback get out identifiers. In addition you can check if the values was matching an Options.\nSee all the changes here: https://github.com/nikgraf/belle/blob/master/CHANGELOG.md#added\nHere an examples how to use it:\n<ComboBox onUpdate={ (event) => { if (event.isMatchingOption) { _chooseOption(event.identifier) }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nWhat do you think? Does this work for you?\n. Good one! Thx @alanrsoares \n. @alanrsoares We just released 1.0.1 which includes this bugfix\n. @jpuri the 300ms delay was recently removed from webkit which means in future version the problem won't exist and we don't have to do anything about it :smile:\n. Wow! I will take a closer look tomorrow\n. Changes look good.\nI researched a bit more regarding ComboBox and as defined by the W3C consortium the combobox is a subclass of a select tag.\n\"A presentation of a select; usually similar to a textbox where users can type ahead to select an option, or type to enter arbitrary text as a new item in the list. See related listbox.\"\nhttp://www.w3.org/TR/wai-aria/complete#combobox\nTo me this implies it should behave like one. Meaning the onUpdate should only be triggered in case an exact match happened. Unfortunately this will break our existing API, but I think it's better to do it now than later.\nYou might wonder what about the other use-cases when ComboBox is used like a Google. This is already possible by providing inputProps.onChange and listen to this one. We could add inputProps.onUpdate but I don't feel it's necessary.\n@jpuri What do you think?\n. Use cases we want to cover:\na. A field where the users needs to select a valid options (Pick a Country)\nb. A search field with suggestions like google (just as help, but doesn't effect the output)\nc. A search field where in case of a perfect match a redirect to the entry happens, otherwise a search page with alternative pages open\nd. A search field where in case of a select from an option a redirect to the entry happens, otherwise a search page with possible entries open\nProposal 1\nonUpdate (fires whenever the input changes)\nonExactMatch (fires when an option has chosen or the input match happend)\na.\n<ComboBox onExactMatch={ (event) => { _chooseOption(event.identifier) }}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nb.\n<ComboBox onUpdate={ (event) => { _updateSearchTerm(event.value) }}>\n  <Option value=\"Alaska\">Alaska</Option>\n  <Option value=\"California\">California</Option>\n</ComboBox>\nc.\nno idea, but probably super complex? We would somehow need to know which fires first and then sync those events.\nd.\nno idea, but probably super complex? We could add another method to only fire when something is selected, but it doesn't help\nProposal 2\nonUpdate (fires whenever a select/exact match happens)\ninputProps.onUpdate (fires when input changes including select)\na.\n<ComboBox onUpdate={ (event) => { _chooseOption(event.identifier) }}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nb.\n<ComboBox inputProps={{ onUpdate: (event) => { _updateSearchTerm(event.value) }}}>\n  <Option value=\"Alaska\">Alaska</Option>\n  <Option value=\"California\">California</Option>\n</ComboBox>\nc.\nno idea, but probably super complex? We would somehow need to know which fires first and then sync those events.\nd.\nno idea, but probably super complex? We could add another method to only fire when something is selected, but it doesn't help\nProposal 3\nonUpdate (fires whenever the input changes, in case of a perfect match the optionMatch is set to true, in case an option has been selected optionSelect is set to true)\nonUpdate({\n  value: 'weee',\n  identifier: 1\n  optionMatch: true/false, (not sure about the name here)\n  optionSelect: true/false (not sure about the name here)\n})\na.\n<ComboBox onUpdate={ (event) => { if (event.optionMatch) { _chooseOption(event.identifier) }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nb.\n<ComboBox onUpdate={ (event) => { _updateSearchTerm(event.value) }}>\n  <Option value=\"Alaska\">Alaska</Option>\n  <Option value=\"California\">California</Option>\n</ComboBox>\nc.\n<ComboBox onUpdate={ (event) => {\n    if (event.optionMatch) {\n      _redirectToEntry(event.identifier)\n    } else {\n      _updateSearchTerm(event.value)\n    }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nd.\n<ComboBox onUpdate={ (event) => {\n    if (event.optionSelect) {\n      _redirectToEntry(event.identifier)\n    } else {\n      _updateSearchTerm(event.value)\n    }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\" identifier={ 2 }>California</Option>\n</ComboBox>\nHow do you feel about these proposal? Which one do you like more? Which one you don't? Feel free to add use-cases or other proposals. @jpuri \n. @jpuri hey :smile:\nI like it the most as well. It doesn't break the API, but opens up new opportunities. The only downside is that for the a use-case it's a bit more complicated then it needs to be. But that's fine :smile: \nWhat do you think about the names optionMatch & optionSelect? Do you have better ideas?\n. @jpuri I'm bit worried about updating all the helpers. There are a lot of things that can go wrong in various browsers and underscore is heavily used & tested. Also the further we move away from underscore the harder it will be to apply bug-fixes they do.\nWould it have been possible to just fix the whole issue by doing this?\nif (this.props.children instanceof Array) {\n  this.sanitizedChildren = this.props.children;\n} else {\n  this.sanitizedChildren = [this.props.children];\n}\nIf we then always use this.sanitizedChildren we should be pretty much save?\n. Hey@jpuri - I finally found some time to review and work on this PR in detail.\nI looked at it not only from the perspective of providing one single option, but also combining a single placeholder with an array of options (see https://github.com/nikgraf/belle/issues/161). Rather than cover all possible edge cases in the helpers I propose we move towards sanitising the props.children before using them.\nThis can simply be done by using flatten. I tested my assumptions by updating this PR, but we can always go back.\nLet me know what you think.\n. @jpuri sounds good\n:+1: on mapObject\n. @jpuri no children also bugged me when working on this. I figured a Select without Options or a Placeholder doesn't make sense to me and it should be mandatory.\nThoughts?\n. :+1: \n. Looks good. Can you update the activeStyle for the bootstrap theme. There the active style makes the most sense.\nI probably do something tomorrow night again. In case you don't get to it I can do it.\n. Hey @luandro, we just published version 1.1.0 which should work seamlessly with server-side rendering. Can you give it a try and let us know how it works for you?\n. hey @yzhiJun, just release 2.0.3 with a fix for the issue, thx for letting us know :smile: \n. Hey @markdalgleish :smile: react-themeable looks nice. Interesting approach. Are you using it in an application already? Any downsides you discovered?\n@kof thx for pointing it out\n. Hey @lapanoid - I talked to a couple people the last couple days and will draft a new document. I think we are onto something. I want to validated that next week and then move Belle over. Shouldn't be more than a week of work.\n. @jpuri can you double check that everything is fine here? I already merged it for the release\n. @andreychev thx for reporting, will look into this today or tomorrow\n. @luisrudge Will cut a release with this today :smile: \n. @andreychev we cut a release today - problem solved :smile: \n. Looks good to me.\n@bvleur & @jpuri The purpose of having such properties in state is that every time it changes the render function would be called. Would it be possible that we miss a render (which should happen) due this change?\n. Sorry for the late reply! I see what you mean. Good work!\n. @bvleur fantastic work! thanks a lot!\n. hey @kof \nwe kind of wanted to do this and opened some issues:\nhttps://github.com/nikgraf/belle/issues/121\nhttps://github.com/nikgraf/belle/issues/122\nhttps://github.com/nikgraf/belle/issues/123\nhttps://github.com/nikgraf/belle/issues/124\nthere is some discussion going on, but no really spec. I find it hard to provide specs without digging deep into the behaviour while writing the component. Usually I do a  brainstorming with 1-2 people. Then we write some code, then iterate based on the learnings. Any suggestions how to improve the process?\n. @luisrudge alright, what's the value to you for such a list component? built-in styling? which parts are important?\n. @jpuri I did some more investigation\nWith this code we get back this:\n<Select>\n  <Placeholder>-- Select a Fruit --</Placeholder>\n  {\n    map(fruits, (fruit, index) => {\n      return (\n        <Option value={ fruit.value }\n                key={ index }>\n          { fruit.content }\n        </Option>\n      );\n    })\n  }\n</Select>\n\nIf we run map over them: const children = React.Children.map(properties.children, (child) => child); we get:\n\nThis is the same thing Radium provides us with. Right now it seems clear to me that we should work with objects like this one. I see two options right now:\n1. modify Select, Combobox, Toggle and run const children = React.Children.map(properties.children, (child) => child); in the constructor of each of these components to make children consistent in their usage. We would need to update the helper functions. The downside here is that we unnecessarily iterate through the whole list.\n2. update/add helper functions to be based on React.Children functions. We could build a filter specifically for React children components or a splice specifically for React children.\n@jpuri To me options two seems like more work, but the proper implementation. What's your take?\n. @luisrudge @ianobermiller We fixed the issue and cut a new release. The newest version works well with Radium :smile: \n. @luisrudge no worries, thanks for pointing out\n. hey @bvleur - the text input was heavily influenced by this https://github.com/andreypopp/react-textarea-autosize (I made some contributions there as well). I took some fixes from them and noticed they also have minRows & maxRows. With their implementation we potentially can reduce a domAccess in case min & max rows are defined.\nI noticed you added new line characters to calculate the height, while these guys calculated the height of one row and multiplied. Do you know if we are missing anything by doing so?\n. hey @andreypopp, it's actually not too much, but there are some features that make the belle version different\n- allowNewLine (I'm happy to create a PR in case you would be interested to have this in react-textarea-autosize). The downside here is that it introduces some needed complexity and you can't pass value, defaultValue or valueLink down to the textarea, but rather control it.\n- props like hoverStyle, focusStyle, … (this is very opinionated)\n- we decided to consistently use onUpdate for belle components (find some details here: https://github.com/nikgraf/belle/issues/58)\n. thx @abzfarah :+1: \n. @jpuri for sure\nbtw I added a first skeleton commit in here: https://github.com/nikgraf/belle/tree/popover\n. great work\n. @namuol so cool, thx man. I will test the touch support in the few days and merge it then.\n. Hi @iansinnott \nThanks for your suggestion. We were considering pre-defined size-levels for Toggle early on, but dropped the idea due increased complexity. The main idea of Belle components is to allow a lot of styling freedom. By adding a size property people who want to style the Toggle differently might have a hard time doing so. Nevertheless I think we should have done a better job to explain how to style a Toggle. We added an example here: http://nikgraf.github.io/belle/#/component/toggle\n<Toggle style={{\n          borderRadius: 10,\n          height: 20,\n          width: 50\n        }}\n        sliderStyle={{\n          // Calculated with 2 * the width of choice area\n          width: 80\n        }}\n        sliderWrapperStyle={{\n          borderRadius: 10\n        }}\n        handleStyle={{\n          borderRadius: 10,\n          // 1 px smaller than the width due the border effect\n          height: 19,\n          width: 20\n        }}\n        firstChoiceStyle={{\n          height: 20,\n          // Calculated with the width of the whole toggle - half of the width from the handle\n          width: 40,\n          lineHeight: 20 + 'px',\n          textIndent: -5,\n          fontSize: 12\n        }}\n        secondChoiceStyle={{\n          height: 20,\n          // Calculated with the width of the whole toggle - half of the width from the handle\n          // style.width - (handleStyle.width / 2 )\n          width: 40,\n          lineHeight: 20 + 'px',\n          textIndent: 5,\n          fontSize: 10\n        }}\n        activeHandleStyle={{\n          height: 20\n        }} />\nIf you need help or have a specific size in mind. I'm happy to help. Shouldn't take a lot of time :smile: \n. @iansinnott I gave this a bit more thought over the weekend. I totally see the need and tried to come up with a solution that would allow scaling without introducing more complexity. I think a UI configurator where you dynamically could change the styles would be great. In the end you could export the styles.\nWould you be interested to pair on a simple iteration for the Toggle? Shouldn't take us more than a few hours.\n. What about a dedicated SecretInput or PasswordInput component? I think it would be great to do the same for NumberInput & EmailInput.\n. I think we should avoid ImmutableJs for now to not make it too big …\n. Hi @Agamennon, thanks for asking. In case we didn't miss anything we do expose all onChange, onFocus and so on. It's true that we don't expose onChange, but instead you can use onUpdate. This is, because simulating onChange properly would have increased component's complexity a lot and even React core contributors don't recommend it. See a longer explanation here: https://github.com/nikgraf/belle/issues/58/.\nI would be happy to help you out. Maybe you can post an example of what you want to achieve and we can work it out together. Here an example using onUpdate:\n<Select onUpdate={ (event) => console.log(event.value) }>\n  <Option value={ \"vienna\" }>Vienna</Option>\n  <Option value={ \"rome\" }>Rome</Option>\n</Select>\n. @jpuri the missing onChange probably causes the problem. We could check if we can create a PR for redux-forms to also take onUpdate into account.\n. @jpuri that's a good idea! We could mention it in the documentation as alias.\n. I think it should be the same. So we need to fire onChange whenever onUpdate fires.\n. @jpuri Just opened an issue at redux-forms. I realised again that onUpdate is different to onChange.\n. @Agamennon can you try it again? @erikras was so nice to add support for Belle's onUpdate.\n. @Agamennon any chance to give it a try?\n. hey @luisrudge - we just released a version ready to work with React 0.14. You can get it by running npm install belle@2.0.0-beta1. We tested all components. Let us know if you run into any trouble.\n. @luisrudge now it should work :smile: \n. thanks :)\n. @alexfedoseev sorry for my late reply. We are thinking a lot about moving from inline-styles to a class based system. This then could be used with JSS, css-modules or any other solution. Since this will be quite a big change we will do a few prototypes first and if it works release it with Belle 3.0.0. Are you interested to contribute as well?\nbtw what do you think about https://github.com/markdalgleish/react-themeable\n. @jpuri The PR looks good. I just noticed it looks bad when switching to the Bootstrap theme. Should we maybe exclude it in case the bootstrap theme is active?\n. I was thinking about better explaining to the how it works in case they want to have completely different styling, but I guess you are right. It's too complex anyway. I will merge it and maybe kick it out later.\n. @jpuri nice, thx :+1: \n. @jpuri works like a charm!\n. time to release a new beta :)\n. @jpuri I think that's done, right?\n. @pliegl thx :smile: \n. good one, thx\n. :+1: \n. @jpuri what do you think? any objections/ideas?\n. @jpuri Yeah, there are a couple things we could do like count of dots or even allowing to replace the dot character, but I I couldn't imagine anyone needing this. And this with my phantasy :smile: \nI added tests. I think it's good to be merged.\n. @jpuri I merged it as I needed it for another fix.\n. @jpuri good one!\n. hahaha\n. hey @plandem - there is a bright future ahead for belle. From next January on I have 3 months full-time on open source and will spend a significant amount of time to work on belle.\nI want to work on a new coding standard for belle 3.0.0 the week after this one. if you want to you could join a call and we start a grid component together that you can continue. What do you have in mind for a grid component. What kind of features?\nRoadmap is something like:\n- create the belle 3.0.0 coding standard\n- create a test component (something simple)\n- migrate all the components\n- add a dropzone, navigation, dropdown, table (with sort)\n- launch 3.0.0\n- party hard :smile: \nkeep in mind this is more or less a rough idea. feedback & help is very much appreciated\n. this is super useful, let's chat next week :+1: \n. Hey @tonyxiao - yes indeed. From next week on I have a lot of time for Belle. @jpuri & I experimented with a future version of Belle to leverage different styling options like CSS Modules & JSS. See a first draft here: https://github.com/nikgraf/future-react-ui/\n. The Ant components are beautiful. Glad you found something that works well for you 😃 \n. hmmm, yeah activity dropped a lot after moving from Slack to Reactiflux. Any suggestion where to guide people for questions & discussions?\n. thx for the advice @vcarl \n. Have you guys considered moving to another tool? Maybe https://chatgrape.com/ ??? /cc @kof\n. @coopy oh damn, totally forgot to remove it. Seems like we need to fix a couple tests. Thx for pointing it out.\n. ah, that's a nice one. danke Patrick :+1: \n. interesting @bradennapier - do you have simple code example so I can reproduce it?\n. @rchanou are you still using it? does the bug still exist?. Hi @plandem, we have thought about this a lot and most recently started an experiment to explore how Belle could evolve. If you have time feedback here is very much appreciated: https://github.com/nikgraf/future-react-ui/\n. thx :+1: \n. Hey @mattikl, thanks for your kind words & the feedback. Super valuable. Especially that you already did some profiling.\nYes, I'm working on a solution, but it will more be a complete restructuring of the architecture of Belle (using CSS Modules by default, but you can use anything class based). Here is what we came up so far: https://github.com/nikgraf/future-react-ui/ - I'm curious what you think about such a hard cut …\nRight now I'm fixing a few bugs and upgrade Belle 2 to the lastest dependencies to do a final release for Belle 2 before focusing on Belle 3.\n. Hi @mkusher, I'm not aware of any. Since I'm not using TypeScript I'm not going to focus in TypeScript declarations anytime soon, but would be super happy about a PullRequest that adds some.\n. @mkusher I'm happy to pair program with you on adding them. I'm on vacation this week, but next week would be great. \n. @jpuri looks great! the issue with binding in a render function is: every time your render all the functions have to bind again and the old ones release. this is an unnecessary overhead that is eventually slowing rendering down (I guess not by much, but still worth doing :smile: )\nFor the datepicker we can try to us data key or similar and get it out of the target element. This way we can avoid the binding in the rendering. Feel free to give it a try. If not I most probably can do it tomorrow.\n. @kiresuah you are absolutely right! Tomorrow I will have time to fix this and cut a new release right away!\nThanks for reporting\n. @kiresuah thanks again for reporting. Just release 2.0.5 with a fix.\n. happy to do so! What's a good timepicker? I know the one from material, but found the 2 step clock rather confusing … any recommendations?\n. sorry, will close this as I probably start over with v3 :)\n. I could reproduce the issue in Safari. Will look into this probably tomorrow. Thanks for letting us know :smile: \n. Sorry, took me a bit longer to get to it fixed here https://github.com/nikgraf/belle/issues/277 und cutting a new release now\n. I see what you mean. It should scroll to the right position if it gets out of bounds of the visible area. I try to come up with a fix until the weekend. Sorry, currently I'm bit swamped in work.\nor would you be willing to pick it up?\n. @mars Sorry for the late reply. You shouldn't need to do anything at all actually. Belle is taking care of injecting one style tag with the CSS by default.\nimport React from 'react';\nimport { Spinner } from 'belle';\nimport { injectStyles } from 'belle/lib/utils/inject-style';\n``` js\nclass App extends React.Component {\n  render() {\n    return (\n      \n\n\n    );\n  }\n}\nexport default App;\n```\nWhich platform & browser did you use?\n. Hey @bradennapier, sorry I was super busy finishing up 1.0 for https://www.draft-js-plugins.com/\nI just gave it a try & couldn't reproduce the issue …\njs\n<h3>Select placeholder test</h3>\n<Select wrapperStyle={{ width: '100%' }} shouldPositionOptions={false}>\n  <Placeholder>\n    {'Select One...'}\n  </Placeholder>\n  <Option value={ 0 }>Zero</Option>\n  <Option value={ 1 }>One</Option>\n</Select>\n\n. @cezarneaga what do you mean? where?\n. sorry, been busy with too many project lately. I will cut a new release with these fixes. If someone is interested to contribute more and maintain please ping me.\n. @mafzst @HugoHeneault just published 2.0.8 with @mcbryant's fixes\n. thx for your awesome work @mafzst & @mcbryant \n. @mafzst interested to contribute more? I could provide you with collaborator right …\n. Thx again for your fix!\n. @mcbryant I believe from all I learned v3 will be started over in a few months.\nAfter this awesome contribution I will give you commit writes. Interested to contribute more?\n. @mcbryant feel free to ping me anytime on Twitter or here. I have some ideas, but too little time 😄 \n. @GuillaumeBadi can you check what's up with the tests? maybe rebase with master?\nthx for taking the effort to create a PR\n. closed since I merged the other PR 👍 . @jpuri and I found a nicer solution implemented in this PR https://github.com/nikgraf/belle/pull/329\n. I will update this over the next couple days … sorry for the delay. @erikras @cezarneaga @ig43 just published 3.0.0 https://www.npmjs.com/package/belle which is compatible with React 15.4.0 🙌\nThanks for your patience!. Tests work fine for me:\n```bash\n➜  belle git:(master) npm run test\n\nbelle@3.0.0 test /Users/nikgraf/Projects/belle/belle\nBABEL_ENV=test BABEL_JEST_STAGE=0 jest src/\n\nPASS  src/tests/union-class-names-test.js\n PASS  src/tests/Separator-test.js\n PASS  src/tests/Select-test.js\n PASS  src/tests/Rating-test.js\n PASS  src/tests/Placeholder-test.js\n PASS  src/tests/Spinner-test.js\n PASS  src/tests/helpers-test.js\n PASS  src/tests/DatePicker-test.js\n PASS  src/tests/date-helpers-test.js\n PASS  src/tests/ComboBox-test.js\n PASS  src/tests/Card-test.js\n PASS  src/tests/TextInput-test.js\n PASS  src/tests/Button-test.js\n PASS  src/tests/Option-test.js\nTest Summary\n › Ran all tests matching \"src/\".\n › 192 tests passed (192 total in 14 test suites, run time 13.947s)\n```. @manpenaloza seems like you removed both, shouldn't you remove only one?. nice one, thx!. Sounds interesting! Do you use showroom in your company? I'm mostly concerned about long-term support.. @dynamiccast just published it!. @rohmanhm good point, interested to create a PR?. @modsushi great suggestion, interested to create a PR?. thanks for the PR @tconroy, sorry for the late reply! I'm about to add React 16 support and add a new release. Hey @costagolub, I would be happy to add the radio buttons, but can you remove the lob folder from your PR?. Back then we could solved it by moving the import, but at this point functionality must be extracted from the React repo.\n@eddiekollar Are you interested to do that? Here is the file: https://github.com/facebook/react/blob/2566b2420b714c00b3a456b8d744a26387eaf511/src/renderers/dom/shared/CSSPropertyOperations.js\nAll the required imports would also be need to be pulled in . @eddiekollar awesome, looking forward to your PR :)\nbtw another alternative would be to switch to styled-components for example. Either way if fine for me. Happy to accept PRs :). @eugene1g thanks a lot for the feedback. Which browser do you use? I can't reproduce it :(\n. @eugene1g This screenshot was worth gold. Thanks :smile:\nI did a bit of testing & now believe it's an issue of the valueLink functionality. Could you confirm?\nProviding a defaultValue for the TextInput (new lines not allowed) results in this:\n\nWith new lines allowed you can see little spike which I believe are due the height calculation. The number of total nodes rised, but only by a handful.\n\nI tried valueLink first with a plain textarea & then with an input of type text and it resulted in a similar memory behaviour:\n<input type=\"text\" valueLink={ this.linkState('value') } />\n\n<textarea valueLink={ this.linkState('value') } placeholder=\"Just fill in whatever you like :)\" />\n\n. People still have issues here: https://www.reddit.com/r/reactjs/comments/3dh9k0/introducing_belle_100_easy_to_style_react/ct596fp\n. Solved with https://github.com/nikgraf/belle/pull/129\nReally good find @jpuri \n. The Toggle is part of the core! :smile: \n. Done by pair programming with @GCinellu\n. Done by pair programming with @GCinellu \n. I feel we don't need it.\n. Resolved with this commit https://github.com/nikgraf/belle/commit/f530038965a91aba4e64c3f51fe0f2133925faef\n. Hey @GCinellu \nUnfortunately when typing npm install the in npm 1 & 2 the peerDependencies are installed as well. By removing them I could make sure the setup allows to make changes to Belle while instantly reviewing them in the examples playground or docs.\nAccording to the docs npm 3 won't have these issues:\nNOTE: npm versions 1 and 2 will automatically install peerDependencies if they are not\nexplicitly depended upon higher in the dependency tree. In the next major version of\nnpm (npm@3), this will no longer be the case. You will receive a warning that the\npeerDependency is not installed instead.\nhttps://docs.npmjs.com/files/package.json\nhttp://blog.npmjs.org/post/110924823920/npm-weekly-5\nI'm happy to merge any pull-request that improves the situation, but for now I'm not sure how.\n. Fixed the npm install belle issue for windows with https://github.com/nikgraf/belle/pull/159\n@blakeembrey thanks a lot for pointing that out. I missed that postinstall also runs when people do npm install belle. It was intended as fix for the development environment, because peerDepedencies even get install when you do npm install in the library.\n. @GCinellu We fixed the Windows issues :smile: \n. @GCinellu did you maybe miss to check in changes to style/select.js. I tried the branch and it didn't work.\n. @GCinellu I merge it & try to fix what's missing. Thanks again for helping out here :smile:\n. Solid changes! Looks good :+1: \n. Interesting at point 3. Intuitive I would have expected the value only to change after the user selected it (space or enter)\n. @jpuri I will close it. We can bring them up as separate issues. I can do that.\n. ouch :smile: - thanks for fixing @jpuri :+1: \n. :tada: :smile: \n. :+1: \n. :smile: \n. Let's just do it. I want hot reload of components :smile: \n. Might be a good base https://github.com/gaearon/library-boilerplate\n. Done with this Pull-Request https://github.com/nikgraf/belle/pull/183\n. :+1: We probably should use the same wording a React documentation & also refer to it with links.\n. Interesting issue: https://github.com/facebook/react/issues/4751\n. @jpuri I found a few questions/issues we probably should fix first:\n1. I typing in \"Te\". While \"Te\" is in the originally provided list it is not shown as an Option.\n2. When typing in \"TE\" (uppercased) the background characters are lowercase in grey & do not properly overlap.\n3. When clicking on the input I instantly see the first suggestion. When I hit the backspace key it is removed instantly.\n4. Why did you call it pseudoInput? With pseudo in the context of HTML I associate pseudo classes in CSS. Why not call it just hint? btw I didn't come up with this name. I noticed typeahead uses it as class name on their hidden input.\n5. Please update the documentation as well (also the internal structure, style configuration) :smile: \n. We probably should also make that clear in the documentation as well (every component).\nCould be done with an example like:\n// When hovering the component, the color will be blue and the background still green.\n<Button style={{ color: red, background: green }} hoverStyle={{ color: blue }}>Follow</Button>\n. @jpuri by extend I meant it like this:\n// When hovering the diabled component, the color will be blue and the background still green.\n<Button disabledStyle={{ color: red, background: green }} disabledHoverStyle ={{ color: blue }}>Follow</Button>\nRegarding the API: Would you suggest to change the API for Rating? While it doesn't comply with the other components styling configuration I though it would make more sense as the style is directly applied to the character. Maybe the old html structure was better?\n. :+1: sure, I added this issue: https://github.com/nikgraf/belle/issues/86\n. Solved with this PR: https://github.com/nikgraf/belle/pull/87\n. Closed with this PR https://github.com/nikgraf/belle/pull/63\n. @jpuri only that the API becomes consistent between all Belle components\n. I see it as a chance to do better than HTML :)\n. @jpuri cool, let's use it :smile: \n. Solved with: https://github.com/nikgraf/belle/pull/100\n. Solved with: https://github.com/nikgraf/belle/pull/102\n. Closed with this PR: https://github.com/nikgraf/belle/pull/94\n. yay :)\n. Some thinking behind the look & feel:\n\n. Closed with https://github.com/nikgraf/belle/pull/72\n. A related issue is that when doing a Ctrl+Click to show the context menu the active state never goes away.\nThe solution might look similar as in: https://github.com/nikgraf/belle/pull/97\n. It was more of an idea. If you press the mouseDown on a button & then move away without leaving it would be great to indicate that if you release the mouse outside the click won’t be triggered (by removing the active state)\n. Might still be valid for touch events.\n. Not sure if we should do this as it breaks with default active state behaviour.\n. I think we can close it :)\n. There is a note in the code: https://github.com/nikgraf/belle/blob/master/src/components/Select.jsx#L349\n. Didn't find a solution. We can do this later.\n. What happened to getHint? Was it not used anymore?\n. One way to deal with it could by leaving out children completely like <Option value=\"some text\" />. The downside here would be a lot of checking & complexity is needed.\nOn alternative thing I though of for the select was introducing a second component:\n<TextSelect options={[ 'Apple', 'Banana', 'Cherry' ]}>\nIn this case we could even leverage the native select implementations on mobile devices:\nhttp://media.mediatemple.netdna-cdn.com/wp-content/uploads/2010/03/mobileinputs5.jpg\n. :top: work :smile: \n. @jpuri I'm looking into this now\n. Fixed with this PR: https://github.com/nikgraf/belle/pull/97\n. I like the idea of make them expandable. What might make it easier is have short list of all properties in the beginning? I will experiment with it.\nOne more thing that might be good is to provide a simple code example for every property.\n. Let me also look at other documentation.\n. Instead of splitting would could just use filters.\n. @jpuri There actually was something wrong with the way I managed props.\nregarding focus settings: I will continue on the bootstrap theme today. I think this will have a big impact on the API design.\n. Solved with this PR: https://github.com/nikgraf/belle/pull/87\n. Closed the wrong issue\n. Right, there is no point in doing so. Let's close this one.\n. @jpuri super good cleanup! I added one commit. As select is not a pseudo class & for the use-case it should not inherit the base style. The purpose of selectStyle is to allow users to apply completely different styling for the situation when the Option is displayed in the Select (not in the options menu). If we would have inheritance here it would make peoples life probably bit harder.\n. Sweeeet!\n. @jpuri I needed this fix for the bootstrap theme. Can you double check?\n. Super helpful!\n. Solved with PR: https://github.com/nikgraf/belle/pull/105\n. :+1: looking forward to this\n. We included underscore. In the future we will refactor this part & take only what we need. https://github.com/nikgraf/belle/pull/108\n. \n. :smile: \n. \n. good find, unfortunately it's still a problem because pseudoClass styles are only updated in the constructor or willReceiveProperties. We just call render on theme switch right now. I'm not sure we even want to handle the case people changing the config on the fly properly. As an alternative we could have a query string in the route & based on this decide the theme. When someone changes the theme we switch the URL & do a window.location.reload()\n. Hmmm, we can provide an extra API, but I had the feeling it's not necessary. The idea was that if we have simple plain JS objects then people are familiar with it & can overwrite or extend them depending on what they want.\n. I think the API Vjeux proposed to create multiple stylings on one page would still be nice on top of the existing API. I fell we still should stick to the commonJS API use-case. That's what JS people are used to.\n. Fixed with this PR: https://github.com/nikgraf/belle/pull/109\n. good one!\n. works fine :+1: \n. Looks good!\n. @luisrudge oh, thx for point this out. What Windows version do you have?\n. Good to know. Might be better to use custom SVG icons in case Windows doesn't support certain unicode characters. /cc @jpuri \n. @luisrudge I love the level of detail you looking at the components. Will definitely look into it on how to speed it up!\n. :+1: :smile: \n. :+1: \n. +1\n@kof What are your thoughts about what React Native is doing. I haven't looked into it, but I heard they kind of sort them.\n{\n  borderLeft: '1px solid red',\n  border: '1px solid black'\n}\nIn this case the left border will still be red. Instead of taking the last definition they sort based on the level of detail. Some people would like to see this even for the default React style property. If I'm not mistaken it's even easy to implement, because a more detailed version descriptor is always prefixed with the original e.g paddingLeft has padding as prefix.\n. Great :smile: \n. Main question here: What value can we add compared to ?\nMy first guess is: We can provide a nicer interface for editing numbers. Yet I'm not sure what's a great a experience. It also might very different depending on the range or if decimals are allowed/not allowed.\nThere are list of helpful attributes: min, max, step and inputmode=\"numberic\".\nImportant UX requirements:\n- On Mobile devices we should show a numbers keypad if available\n- Formatting/localisation should be supported\n- Should the user be able to type characters? Do we show a warning or prevent it?\nThx to @ungerik for his feedback\n. Today @jpuri & I did some brainstorming. We thought about providing two components:\n<DatePicker>\nThe datepicker component is just the component to select a date. In mobile situations people might want to use it directly. It's also great to just show a calendar in case no event listeners are bound. This also allows people to cover more complex date/range selections with custom components.\n<DateInput>\nThe dateinput looks like an input field. By default we put a calendar icon next it. But clicking the calendar icon a datepicker will open. The text is still editable, but is going to be validated like in this example: http://rudeg.github.io/react-input-calendar/\n. @jpuri interesting read regarding focus behaviour: http://ux.stackexchange.com/questions/52849/datepicker-behavior\n. @jpuri I thought about the ctrl+up as well, but the issue here is that even on OSX these keyboard short cuts are used for different things by default.\nlook what I found: http://www.w3.org/TR/wai-aria-practices/#datepicker - I suggest to exactly use the keyboard short cuts as they propose.\nThis also has some nice hints regarding behaviour: https://www.w3.org/WAI/PF/HTML/wiki/Datepickers\n. @jpuri I updated the sub-tasks on top (added suggestions & bugs I found)\n. @LucaColonnello honestly we are not sure yet - we did a brainstorming for mobile navigation most recently:\nOn Mobile\n\nSlide the main page to the right (sometimes left). This is becoming popular and feels pretty good. This navigation field is even scrollable. I like Slack's version on iOS where you have search bar on top.\n   You can grab the menu. If you slide it it will complete the slide, but as like with the toggle you can grab it and move it from left to right and back.\n\n\n1. Also very popular the burger menu like Bootstrap3 has it. It's a one time animation to open & close it. It is not positioned absolute, but rather moves the content down. This is especially nice in case the list is longer than the screen.\n\n1. In Angular Material you see the Navigation fading in from the left and overlaying the content. It's an animation you can't control. If you click a Navigation entry or click on the small content area if changes the content and fades the navigation area back.\n\nOn Desktop\n\nVery common is a top navigation. Some have dropdowns e.g. Google, Facebook.\nSometimes you get the same left navigations as with on mobile devices, but because of the larger screen it's always visible.\n\nOpen Questions\n\nWhat are the event handlers?\nHow does it move the content? Does the content need a special wrapper tag to make sure the styling works fine or is it not problem?\nFor menu of type-1 above, if someone is using on desktop, how will user drag it in. User may end-up resizing the browser rather. <- like on Slack app or our toggle a simple tap or click is good enough to slide it. No need to slide it all the way.\n\nNotes\nThe first one (Slack like) looks good on Mobile and might also look good on Desktop. What happens if someone wants to have a top nav on desktop and the left sided menu on mobile.\nShould be pretty easy. We can provide an example based on responsive design to switch between.\nWe would need to provide users with couple of nav designs:\n1. Simple link\n2. Dropdown with multiple options\n3. Expandable links\nOpen question: How do they play with react-router?!? We need to investigate there.\nI like the idea of having the simple navigation component which is just taking care of left/right sliding. People can use their own links or if they want to leverage the ready to use design of belle the can use our simple link, drowns & expandable link components like described above.\nPossible names: <LeftNavigation>, <Navigation>, <Nav>, <LeftNav>, <MobileNav>, <SlideNavigation>, <SlideNav>\n<Navigation>\n   <NavLink>Home</NavLink>\n   <NavGroup> // expandable\n      <NavTitle>Components</NavTitle>\n      <NavLink>Button</NavLink>\n      <NavLink>ComboBox</NavLink>\n   </NavGroup>\n  <NavDivider/> or <NavSeparator/>\n</Navigation>\nInspriations: https://www.google.com/design/spec/patterns/navigation-drawer.html#\nI noticed that most of sites have navigation at both places left and top like gmail, youtube, slack, bootstrap. Though left menus are more often like nested list, but top menu are more often individual choices like buttons, dropdowns. What comes to my mind is 2 kinds of components:\nA bootstrap kind of nav-bar / app-bar  (http://getbootstrap.com/components/#navbar)\nA gmail / slack (in mobile) kind of left-nav\nI think making just one component and adjusting it for for both left and top navs may increase complexity of component and we may lose some of the cool unique features. <- couldn’t agree more. Let’s make multiple components and make them good (nik)\n. Proposed rules:\n- The next version is developed on the develop branch. I don't like the complexity of git flow, but it kind of makes sense for developing a library. http://nvie.com/posts/a-successful-git-branching-model/\n- We still want to release often even if it's a small fix.\n- We should have Changelog. Pull requests should update the changelog as well.\n- Be there for questions in http://www.reactiflux.com/ (do we need Gitter then?)\nThoughts? Anything else? @jpuri \n. +1 on the guidelines for contributors (e.g. git commit messages, code of conduct)\n. good one!\n. Fixed with: https://github.com/nikgraf/belle/pull/145\n. I'm so glad you identified that issue. Sadly this will prevent the highlighting on the page. It never worked on development, because the css file is not available.\nI will check later today, but it should be possible to render the highlighting code component only once.\n. @jpuri I made a change. What do you think about this version?\n. I will close this card. We are doing it a lot anyway.\n. @alexkuz We somehow missed that! Thx Alex :smile: \n. @alanrsoares Good find!\nSounds better to search through the Option children instead of value. If we switch the default behaviour the second issue should be solved as we. I guess the tricky part here will be to get a text representation in case the there are nested children. My first guess is that we will need a helper function to traverse through the children and compile a text version e.g.\n<Option>\n  He<span>ll</span>o World!\n  <div>\n    This is a <b>Test</b>\n  </div>\n</Option>\nshould result in Hello World!This is a Test\n@jpuri What do you think?\n. Hmm, I didn't think of the case that we actually copy the value into the input. That makes things a bit more tricky.\nI definitely can see the use-case where you want to have IDs in the value rather than the actual value. I must say right now the ComboBox is not very well designed for this use-case. Actually I will need to later today as well.\nSome thoughts on how it could work:\n<ComboBox>\n  <Option value={ 1234 } inputText={ Croatia }>\n    <img src=\"/path/to/croatia-image\" />Croatia (Special Deal)\n  </Option>\n  <Option value={ 1235 } inputText={ France }>\n    <img src=\"/path/to/france-image\" />France (Best Price)\n  </Option>\n</ComboBox>\nIn this case we could take the inputText and apply it to the input when selecting an Option with they mouse for example.\nWhat also would be useful/necessary is to make onUpdate only be called when a perfect match happened. inputProps={ onUpdate: this.onInputUpdate } would still allow to read out whenever a character in the input changed or a option has been selected and the input was updated.\nThese are a few API changes and it complicates things a bit more. On the other side it would help to support the use-case of selecting from a pre-defined list. I will sleep over it and have look tomorrow again. What are your thoughts @jpuri @alanrsoares ?\n. @jpuri You almost had it. A lot of people don't use see/use it as an Input like the Google search rather then a Select with better UX for large sets of data. Think like the use-case of typeahead https://twitter.github.io/typeahead.js/. When someone searches for a Twitter user the onChange with typing is not helpful. What you want to know is if the user selected with typing or mouse click is in the list of the available Options you provided. It's important because if you have a match you can redirect to the profile. If it's not a match you don't want to do anything and let the user continue it's search.\n. @alanrsoares Just had a call with @jpuri and we came up with an idea:\nInstead of allowing to change the behaviour of value we could add an optional identifier which we provide in the onUpdate callback. We also consider adding an extra callback in case a exact match happened.\n```\n\nFrance (Best Price)\n\nonUpdate({\n  value: \"France\",\n  identifier: 1234\n})\n```\nWhat do you think?\n. Hey @alanrsoares, just right now we released a new version of Belle allowing you to pass in via the onUpdate callback get out identifiers. In addition you can check if the values was matching an Options.\nSee all the changes here: https://github.com/nikgraf/belle/blob/master/CHANGELOG.md#added\nHere an examples how to use it:\n<ComboBox onUpdate={ (event) => { if (event.isMatchingOption) { _chooseOption(event.identifier) }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nWhat do you think? Does this work for you?\n. Good one! Thx @alanrsoares \n. @alanrsoares We just released 1.0.1 which includes this bugfix\n. @jpuri the 300ms delay was recently removed from webkit which means in future version the problem won't exist and we don't have to do anything about it :smile:\n. Wow! I will take a closer look tomorrow\n. Changes look good.\nI researched a bit more regarding ComboBox and as defined by the W3C consortium the combobox is a subclass of a select tag.\n\"A presentation of a select; usually similar to a textbox where users can type ahead to select an option, or type to enter arbitrary text as a new item in the list. See related listbox.\"\nhttp://www.w3.org/TR/wai-aria/complete#combobox\nTo me this implies it should behave like one. Meaning the onUpdate should only be triggered in case an exact match happened. Unfortunately this will break our existing API, but I think it's better to do it now than later.\nYou might wonder what about the other use-cases when ComboBox is used like a Google. This is already possible by providing inputProps.onChange and listen to this one. We could add inputProps.onUpdate but I don't feel it's necessary.\n@jpuri What do you think?\n. Use cases we want to cover:\na. A field where the users needs to select a valid options (Pick a Country)\nb. A search field with suggestions like google (just as help, but doesn't effect the output)\nc. A search field where in case of a perfect match a redirect to the entry happens, otherwise a search page with alternative pages open\nd. A search field where in case of a select from an option a redirect to the entry happens, otherwise a search page with possible entries open\nProposal 1\nonUpdate (fires whenever the input changes)\nonExactMatch (fires when an option has chosen or the input match happend)\na.\n<ComboBox onExactMatch={ (event) => { _chooseOption(event.identifier) }}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nb.\n<ComboBox onUpdate={ (event) => { _updateSearchTerm(event.value) }}>\n  <Option value=\"Alaska\">Alaska</Option>\n  <Option value=\"California\">California</Option>\n</ComboBox>\nc.\nno idea, but probably super complex? We would somehow need to know which fires first and then sync those events.\nd.\nno idea, but probably super complex? We could add another method to only fire when something is selected, but it doesn't help\nProposal 2\nonUpdate (fires whenever a select/exact match happens)\ninputProps.onUpdate (fires when input changes including select)\na.\n<ComboBox onUpdate={ (event) => { _chooseOption(event.identifier) }}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nb.\n<ComboBox inputProps={{ onUpdate: (event) => { _updateSearchTerm(event.value) }}}>\n  <Option value=\"Alaska\">Alaska</Option>\n  <Option value=\"California\">California</Option>\n</ComboBox>\nc.\nno idea, but probably super complex? We would somehow need to know which fires first and then sync those events.\nd.\nno idea, but probably super complex? We could add another method to only fire when something is selected, but it doesn't help\nProposal 3\nonUpdate (fires whenever the input changes, in case of a perfect match the optionMatch is set to true, in case an option has been selected optionSelect is set to true)\nonUpdate({\n  value: 'weee',\n  identifier: 1\n  optionMatch: true/false, (not sure about the name here)\n  optionSelect: true/false (not sure about the name here)\n})\na.\n<ComboBox onUpdate={ (event) => { if (event.optionMatch) { _chooseOption(event.identifier) }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nb.\n<ComboBox onUpdate={ (event) => { _updateSearchTerm(event.value) }}>\n  <Option value=\"Alaska\">Alaska</Option>\n  <Option value=\"California\">California</Option>\n</ComboBox>\nc.\n<ComboBox onUpdate={ (event) => {\n    if (event.optionMatch) {\n      _redirectToEntry(event.identifier)\n    } else {\n      _updateSearchTerm(event.value)\n    }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\"  identifier={ 2 }>California</Option>\n</ComboBox>\nd.\n<ComboBox onUpdate={ (event) => {\n    if (event.optionSelect) {\n      _redirectToEntry(event.identifier)\n    } else {\n      _updateSearchTerm(event.value)\n    }}}>\n  <Option value=\"Alaska\" identifier={ 1 }>Alaska</Option>\n  <Option value=\"California\" identifier={ 2 }>California</Option>\n</ComboBox>\nHow do you feel about these proposal? Which one do you like more? Which one you don't? Feel free to add use-cases or other proposals. @jpuri \n. @jpuri hey :smile:\nI like it the most as well. It doesn't break the API, but opens up new opportunities. The only downside is that for the a use-case it's a bit more complicated then it needs to be. But that's fine :smile: \nWhat do you think about the names optionMatch & optionSelect? Do you have better ideas?\n. @jpuri I'm bit worried about updating all the helpers. There are a lot of things that can go wrong in various browsers and underscore is heavily used & tested. Also the further we move away from underscore the harder it will be to apply bug-fixes they do.\nWould it have been possible to just fix the whole issue by doing this?\nif (this.props.children instanceof Array) {\n  this.sanitizedChildren = this.props.children;\n} else {\n  this.sanitizedChildren = [this.props.children];\n}\nIf we then always use this.sanitizedChildren we should be pretty much save?\n. Hey@jpuri - I finally found some time to review and work on this PR in detail.\nI looked at it not only from the perspective of providing one single option, but also combining a single placeholder with an array of options (see https://github.com/nikgraf/belle/issues/161). Rather than cover all possible edge cases in the helpers I propose we move towards sanitising the props.children before using them.\nThis can simply be done by using flatten. I tested my assumptions by updating this PR, but we can always go back.\nLet me know what you think.\n. @jpuri sounds good\n:+1: on mapObject\n. @jpuri no children also bugged me when working on this. I figured a Select without Options or a Placeholder doesn't make sense to me and it should be mandatory.\nThoughts?\n. :+1: \n. Looks good. Can you update the activeStyle for the bootstrap theme. There the active style makes the most sense.\nI probably do something tomorrow night again. In case you don't get to it I can do it.\n. Hey @luandro, we just published version 1.1.0 which should work seamlessly with server-side rendering. Can you give it a try and let us know how it works for you?\n. hey @yzhiJun, just release 2.0.3 with a fix for the issue, thx for letting us know :smile: \n. Hey @markdalgleish :smile: react-themeable looks nice. Interesting approach. Are you using it in an application already? Any downsides you discovered?\n@kof thx for pointing it out\n. Hey @lapanoid - I talked to a couple people the last couple days and will draft a new document. I think we are onto something. I want to validated that next week and then move Belle over. Shouldn't be more than a week of work.\n. @jpuri can you double check that everything is fine here? I already merged it for the release\n. @andreychev thx for reporting, will look into this today or tomorrow\n. @luisrudge Will cut a release with this today :smile: \n. @andreychev we cut a release today - problem solved :smile: \n. Looks good to me.\n@bvleur & @jpuri The purpose of having such properties in state is that every time it changes the render function would be called. Would it be possible that we miss a render (which should happen) due this change?\n. Sorry for the late reply! I see what you mean. Good work!\n. @bvleur fantastic work! thanks a lot!\n. hey @kof \nwe kind of wanted to do this and opened some issues:\nhttps://github.com/nikgraf/belle/issues/121\nhttps://github.com/nikgraf/belle/issues/122\nhttps://github.com/nikgraf/belle/issues/123\nhttps://github.com/nikgraf/belle/issues/124\nthere is some discussion going on, but no really spec. I find it hard to provide specs without digging deep into the behaviour while writing the component. Usually I do a  brainstorming with 1-2 people. Then we write some code, then iterate based on the learnings. Any suggestions how to improve the process?\n. @luisrudge alright, what's the value to you for such a list component? built-in styling? which parts are important?\n. @jpuri I did some more investigation\nWith this code we get back this:\n<Select>\n  <Placeholder>-- Select a Fruit --</Placeholder>\n  {\n    map(fruits, (fruit, index) => {\n      return (\n        <Option value={ fruit.value }\n                key={ index }>\n          { fruit.content }\n        </Option>\n      );\n    })\n  }\n</Select>\n\nIf we run map over them: const children = React.Children.map(properties.children, (child) => child); we get:\n\nThis is the same thing Radium provides us with. Right now it seems clear to me that we should work with objects like this one. I see two options right now:\n1. modify Select, Combobox, Toggle and run const children = React.Children.map(properties.children, (child) => child); in the constructor of each of these components to make children consistent in their usage. We would need to update the helper functions. The downside here is that we unnecessarily iterate through the whole list.\n2. update/add helper functions to be based on React.Children functions. We could build a filter specifically for React children components or a splice specifically for React children.\n@jpuri To me options two seems like more work, but the proper implementation. What's your take?\n. @luisrudge @ianobermiller We fixed the issue and cut a new release. The newest version works well with Radium :smile: \n. @luisrudge no worries, thanks for pointing out\n. hey @bvleur - the text input was heavily influenced by this https://github.com/andreypopp/react-textarea-autosize (I made some contributions there as well). I took some fixes from them and noticed they also have minRows & maxRows. With their implementation we potentially can reduce a domAccess in case min & max rows are defined.\nI noticed you added new line characters to calculate the height, while these guys calculated the height of one row and multiplied. Do you know if we are missing anything by doing so?\n. hey @andreypopp, it's actually not too much, but there are some features that make the belle version different\n- allowNewLine (I'm happy to create a PR in case you would be interested to have this in react-textarea-autosize). The downside here is that it introduces some needed complexity and you can't pass value, defaultValue or valueLink down to the textarea, but rather control it.\n- props like hoverStyle, focusStyle, … (this is very opinionated)\n- we decided to consistently use onUpdate for belle components (find some details here: https://github.com/nikgraf/belle/issues/58)\n. thx @abzfarah :+1: \n. @jpuri for sure\nbtw I added a first skeleton commit in here: https://github.com/nikgraf/belle/tree/popover\n. great work\n. @namuol so cool, thx man. I will test the touch support in the few days and merge it then.\n. Hi @iansinnott \nThanks for your suggestion. We were considering pre-defined size-levels for Toggle early on, but dropped the idea due increased complexity. The main idea of Belle components is to allow a lot of styling freedom. By adding a size property people who want to style the Toggle differently might have a hard time doing so. Nevertheless I think we should have done a better job to explain how to style a Toggle. We added an example here: http://nikgraf.github.io/belle/#/component/toggle\n<Toggle style={{\n          borderRadius: 10,\n          height: 20,\n          width: 50\n        }}\n        sliderStyle={{\n          // Calculated with 2 * the width of choice area\n          width: 80\n        }}\n        sliderWrapperStyle={{\n          borderRadius: 10\n        }}\n        handleStyle={{\n          borderRadius: 10,\n          // 1 px smaller than the width due the border effect\n          height: 19,\n          width: 20\n        }}\n        firstChoiceStyle={{\n          height: 20,\n          // Calculated with the width of the whole toggle - half of the width from the handle\n          width: 40,\n          lineHeight: 20 + 'px',\n          textIndent: -5,\n          fontSize: 12\n        }}\n        secondChoiceStyle={{\n          height: 20,\n          // Calculated with the width of the whole toggle - half of the width from the handle\n          // style.width - (handleStyle.width / 2 )\n          width: 40,\n          lineHeight: 20 + 'px',\n          textIndent: 5,\n          fontSize: 10\n        }}\n        activeHandleStyle={{\n          height: 20\n        }} />\nIf you need help or have a specific size in mind. I'm happy to help. Shouldn't take a lot of time :smile: \n. @iansinnott I gave this a bit more thought over the weekend. I totally see the need and tried to come up with a solution that would allow scaling without introducing more complexity. I think a UI configurator where you dynamically could change the styles would be great. In the end you could export the styles.\nWould you be interested to pair on a simple iteration for the Toggle? Shouldn't take us more than a few hours.\n. What about a dedicated SecretInput or PasswordInput component? I think it would be great to do the same for NumberInput & EmailInput.\n. I think we should avoid ImmutableJs for now to not make it too big …\n. Hi @Agamennon, thanks for asking. In case we didn't miss anything we do expose all onChange, onFocus and so on. It's true that we don't expose onChange, but instead you can use onUpdate. This is, because simulating onChange properly would have increased component's complexity a lot and even React core contributors don't recommend it. See a longer explanation here: https://github.com/nikgraf/belle/issues/58/.\nI would be happy to help you out. Maybe you can post an example of what you want to achieve and we can work it out together. Here an example using onUpdate:\n<Select onUpdate={ (event) => console.log(event.value) }>\n  <Option value={ \"vienna\" }>Vienna</Option>\n  <Option value={ \"rome\" }>Rome</Option>\n</Select>\n. @jpuri the missing onChange probably causes the problem. We could check if we can create a PR for redux-forms to also take onUpdate into account.\n. @jpuri that's a good idea! We could mention it in the documentation as alias.\n. I think it should be the same. So we need to fire onChange whenever onUpdate fires.\n. @jpuri Just opened an issue at redux-forms. I realised again that onUpdate is different to onChange.\n. @Agamennon can you try it again? @erikras was so nice to add support for Belle's onUpdate.\n. @Agamennon any chance to give it a try?\n. hey @luisrudge - we just released a version ready to work with React 0.14. You can get it by running npm install belle@2.0.0-beta1. We tested all components. Let us know if you run into any trouble.\n. @luisrudge now it should work :smile: \n. thanks :)\n. @alexfedoseev sorry for my late reply. We are thinking a lot about moving from inline-styles to a class based system. This then could be used with JSS, css-modules or any other solution. Since this will be quite a big change we will do a few prototypes first and if it works release it with Belle 3.0.0. Are you interested to contribute as well?\nbtw what do you think about https://github.com/markdalgleish/react-themeable\n. @jpuri The PR looks good. I just noticed it looks bad when switching to the Bootstrap theme. Should we maybe exclude it in case the bootstrap theme is active?\n. I was thinking about better explaining to the how it works in case they want to have completely different styling, but I guess you are right. It's too complex anyway. I will merge it and maybe kick it out later.\n. @jpuri nice, thx :+1: \n. @jpuri works like a charm!\n. time to release a new beta :)\n. @jpuri I think that's done, right?\n. @pliegl thx :smile: \n. good one, thx\n. :+1: \n. @jpuri what do you think? any objections/ideas?\n. @jpuri Yeah, there are a couple things we could do like count of dots or even allowing to replace the dot character, but I I couldn't imagine anyone needing this. And this with my phantasy :smile: \nI added tests. I think it's good to be merged.\n. @jpuri I merged it as I needed it for another fix.\n. @jpuri good one!\n. hahaha\n. hey @plandem - there is a bright future ahead for belle. From next January on I have 3 months full-time on open source and will spend a significant amount of time to work on belle.\nI want to work on a new coding standard for belle 3.0.0 the week after this one. if you want to you could join a call and we start a grid component together that you can continue. What do you have in mind for a grid component. What kind of features?\nRoadmap is something like:\n- create the belle 3.0.0 coding standard\n- create a test component (something simple)\n- migrate all the components\n- add a dropzone, navigation, dropdown, table (with sort)\n- launch 3.0.0\n- party hard :smile: \nkeep in mind this is more or less a rough idea. feedback & help is very much appreciated\n. this is super useful, let's chat next week :+1: \n. Hey @tonyxiao - yes indeed. From next week on I have a lot of time for Belle. @jpuri & I experimented with a future version of Belle to leverage different styling options like CSS Modules & JSS. See a first draft here: https://github.com/nikgraf/future-react-ui/\n. The Ant components are beautiful. Glad you found something that works well for you 😃 \n. hmmm, yeah activity dropped a lot after moving from Slack to Reactiflux. Any suggestion where to guide people for questions & discussions?\n. thx for the advice @vcarl \n. Have you guys considered moving to another tool? Maybe https://chatgrape.com/ ??? /cc @kof\n. @coopy oh damn, totally forgot to remove it. Seems like we need to fix a couple tests. Thx for pointing it out.\n. ah, that's a nice one. danke Patrick :+1: \n. interesting @bradennapier - do you have simple code example so I can reproduce it?\n. @rchanou are you still using it? does the bug still exist?. Hi @plandem, we have thought about this a lot and most recently started an experiment to explore how Belle could evolve. If you have time feedback here is very much appreciated: https://github.com/nikgraf/future-react-ui/\n. thx :+1: \n. Hey @mattikl, thanks for your kind words & the feedback. Super valuable. Especially that you already did some profiling.\nYes, I'm working on a solution, but it will more be a complete restructuring of the architecture of Belle (using CSS Modules by default, but you can use anything class based). Here is what we came up so far: https://github.com/nikgraf/future-react-ui/ - I'm curious what you think about such a hard cut …\nRight now I'm fixing a few bugs and upgrade Belle 2 to the lastest dependencies to do a final release for Belle 2 before focusing on Belle 3.\n. Hi @mkusher, I'm not aware of any. Since I'm not using TypeScript I'm not going to focus in TypeScript declarations anytime soon, but would be super happy about a PullRequest that adds some.\n. @mkusher I'm happy to pair program with you on adding them. I'm on vacation this week, but next week would be great. \n. @jpuri looks great! the issue with binding in a render function is: every time your render all the functions have to bind again and the old ones release. this is an unnecessary overhead that is eventually slowing rendering down (I guess not by much, but still worth doing :smile: )\nFor the datepicker we can try to us data key or similar and get it out of the target element. This way we can avoid the binding in the rendering. Feel free to give it a try. If not I most probably can do it tomorrow.\n. @kiresuah you are absolutely right! Tomorrow I will have time to fix this and cut a new release right away!\nThanks for reporting\n. @kiresuah thanks again for reporting. Just release 2.0.5 with a fix.\n. happy to do so! What's a good timepicker? I know the one from material, but found the 2 step clock rather confusing … any recommendations?\n. sorry, will close this as I probably start over with v3 :)\n. I could reproduce the issue in Safari. Will look into this probably tomorrow. Thanks for letting us know :smile: \n. Sorry, took me a bit longer to get to it fixed here https://github.com/nikgraf/belle/issues/277 und cutting a new release now\n. I see what you mean. It should scroll to the right position if it gets out of bounds of the visible area. I try to come up with a fix until the weekend. Sorry, currently I'm bit swamped in work.\nor would you be willing to pick it up?\n. @mars Sorry for the late reply. You shouldn't need to do anything at all actually. Belle is taking care of injecting one style tag with the CSS by default.\nimport React from 'react';\nimport { Spinner } from 'belle';\nimport { injectStyles } from 'belle/lib/utils/inject-style';\n``` js\nclass App extends React.Component {\n  render() {\n    return (\n      \n\n\n    );\n  }\n}\nexport default App;\n```\nWhich platform & browser did you use?\n. Hey @bradennapier, sorry I was super busy finishing up 1.0 for https://www.draft-js-plugins.com/\nI just gave it a try & couldn't reproduce the issue …\njs\n<h3>Select placeholder test</h3>\n<Select wrapperStyle={{ width: '100%' }} shouldPositionOptions={false}>\n  <Placeholder>\n    {'Select One...'}\n  </Placeholder>\n  <Option value={ 0 }>Zero</Option>\n  <Option value={ 1 }>One</Option>\n</Select>\n\n. @cezarneaga what do you mean? where?\n. sorry, been busy with too many project lately. I will cut a new release with these fixes. If someone is interested to contribute more and maintain please ping me.\n. @mafzst @HugoHeneault just published 2.0.8 with @mcbryant's fixes\n. thx for your awesome work @mafzst & @mcbryant \n. @mafzst interested to contribute more? I could provide you with collaborator right …\n. Thx again for your fix!\n. @mcbryant I believe from all I learned v3 will be started over in a few months.\nAfter this awesome contribution I will give you commit writes. Interested to contribute more?\n. @mcbryant feel free to ping me anytime on Twitter or here. I have some ideas, but too little time 😄 \n. @GuillaumeBadi can you check what's up with the tests? maybe rebase with master?\nthx for taking the effort to create a PR\n. closed since I merged the other PR 👍 . @jpuri and I found a nicer solution implemented in this PR https://github.com/nikgraf/belle/pull/329\n. I will update this over the next couple days … sorry for the delay. @erikras @cezarneaga @ig43 just published 3.0.0 https://www.npmjs.com/package/belle which is compatible with React 15.4.0 🙌\nThanks for your patience!. Tests work fine for me:\n```bash\n➜  belle git:(master) npm run test\n\nbelle@3.0.0 test /Users/nikgraf/Projects/belle/belle\nBABEL_ENV=test BABEL_JEST_STAGE=0 jest src/\n\nPASS  src/tests/union-class-names-test.js\n PASS  src/tests/Separator-test.js\n PASS  src/tests/Select-test.js\n PASS  src/tests/Rating-test.js\n PASS  src/tests/Placeholder-test.js\n PASS  src/tests/Spinner-test.js\n PASS  src/tests/helpers-test.js\n PASS  src/tests/DatePicker-test.js\n PASS  src/tests/date-helpers-test.js\n PASS  src/tests/ComboBox-test.js\n PASS  src/tests/Card-test.js\n PASS  src/tests/TextInput-test.js\n PASS  src/tests/Button-test.js\n PASS  src/tests/Option-test.js\nTest Summary\n › Ran all tests matching \"src/\".\n › 192 tests passed (192 total in 14 test suites, run time 13.947s)\n```. @manpenaloza seems like you removed both, shouldn't you remove only one?. nice one, thx!. Sounds interesting! Do you use showroom in your company? I'm mostly concerned about long-term support.. @dynamiccast just published it!. @rohmanhm good point, interested to create a PR?. @modsushi great suggestion, interested to create a PR?. thanks for the PR @tconroy, sorry for the late reply! I'm about to add React 16 support and add a new release. Hey @costagolub, I would be happy to add the radio buttons, but can you remove the lob folder from your PR?. Back then we could solved it by moving the import, but at this point functionality must be extracted from the React repo.\n@eddiekollar Are you interested to do that? Here is the file: https://github.com/facebook/react/blob/2566b2420b714c00b3a456b8d744a26387eaf511/src/renderers/dom/shared/CSSPropertyOperations.js\nAll the required imports would also be need to be pulled in . @eddiekollar awesome, looking forward to your PR :)\nbtw another alternative would be to switch to styled-components for example. Either way if fine for me. Happy to accept PRs :). ",
    "eugene1g": "Chrome42 - the screenshot is attached you can see node count (the blue line) jiggling up and down hitting 300k and then going back.\nAll I did was type in \"one two three four five six seven eight nine ten eleven twelve\"\n\n. Perfect fix - no more leaks!\n. Chrome42 - the screenshot is attached you can see node count (the blue line) jiggling up and down hitting 300k and then going back.\nAll I did was type in \"one two three four five six seven eight nine ten eleven twelve\"\n\n. Perfect fix - no more leaks!\n. ",
    "jpuri": "Ya I just checked it there...\n. I saw that in general controlled components in our docs are slowing down as we type more. But I came across this fiddle with controlled input and textarea components really fast: http://jsfiddle.net/f1v1fac1/\nAs I copied the same components in our docs, they also became slow, interesting. I believe the trouble is somewhere with our docs as same components are good in examples. \n. Finding: in docs we are using highlightJs for highlighting the code. When we type a lot in controlled <TextInput> render is called multiple times and these code blocks are rendered again and again, this is adding crazy number of elements to dom and slowing down the page.\nThe issue disappears if I comment these highlightJs calls.\n. It still had more issues, I tried running belle on windows box 2 days back. Need to spend more time to fix that :)\n. You are right postinstall is the exact pain point, the way we are using dependencies can definitely be improved. Let me spend more time trying to fix this ( I will probably have more queries for you then).\nWe also had some troubles with some babel configurations like this '--optional='es7.classProperties'' on windows.\n. Autocomplete has been renamed to combobox and is largely completed. But there are still a few points I was to note here so that we do not miss:\n1. Right now we do not have a hover style for caret but will be probably a good thing to add.\n2. Add option for highlighting matching text for combobox input in option - this looks good and we should have.\n3. Right now when you navigate through options using keyboard their value is temporarily copied to combobox input. I had put it there coz many combobox out there I found have this feature. But it at times look misleading giving impression to user that value has been changed and is also error prone. We can think about removing it.\n. Looks good.\n. I think we should fix this one in this week itself (before we release).\n. I think we can go we span caret as in Select right now.\nAlso is there some way that we had a tag conditionally in what we return from render() method (rather than using display:none to hide the element).\n. As me and Nik discussed we will use span for caret (as used in select currently).\nThe api for ComboBox will be aligned to select.\n. Done PR: https://github.com/nikgraf/belle/pull/91\n. Fix in combobox is good catch :+1: \n. +1, I have also been thinking about this.\n. Hey Nik,\nI am merging this small PR. You can take look whenever you get time.\n. I think we can make it configurable and give user choice between plain (blue outline) focus style and our current animated focus style. Like what we are doing with this option \"preventFocusStyleForTouchAndClick\".\nWe will still live with complexity that this style handling bring to components. But I think there might be use cases where someone wants these animated focus styles or focusStyle hidden when you click.\nAnd good UX comes with complexity cost :)\n. Yep, we kind of felt that while we were writing those styles, but then there are sites like youtube which use focus style which stays for short while.\nThat is why we kept it so configurable. You can always turn them off. Check out components on this link with classical focus styles: http://nikgraf.github.io/belle/#/configuration?theme=belle-with-default-focus\n. I agree with what you are saying, we always had that in our mind and thats the reason we created this issue :)\nWe will rethink about it and would let you know how we plan to handle this accessibility issue, which we agree exist with focus animation.\n. Another possible downside of focus animation (of the kind we have right now in belle theme) is if we use button in button group or menu this can effect nearby component in the layout.\n. Another important, tough minor thing that I noticed is that if we disable focus for touchAndClick, ideally we should disable focus when context menu opens.\nThere is another small issue, if you right click(open context) of an unfocused component focus animation will appear, but if you open contextMenu of an already focused element - no animation appears. Coz though focus is an extended state, current animated focus styles does not reflect that.\nA possible style could be animation focus which does not completely fades away. (But this will create issue like one that comes when user switches between tabs and preventFocusStyleForTouchAndClick is true).\n. I think we should have a page in docs that explains how we handle value, i.e how is value, valueLink, defaultValue handled and what should users expect to get from onUpdate method.\n. Lets create a different section in docs 'guides' after component.\nThese details and more can be added to this section.\n. I think we are done with all changes that were need for this issue.\n. Hey Nik,\nThanks a lot for these detailed feedback :smile: \nI have fixed all theses, also I have made the hint feature optional. I wanted to create different commits for docs and test but I had some issue with rebasing and then ended up rebasing them all to 1 commit.\nThis second commit is small code error I found which was breaking builds, I guess is from ESLint changes you did yesterday.\n. I have added t this branch 2 commit, that is small refactoring which was pending for Rating component.\n. That's good idea I think, having props everywhere.\nI will check the above broken one.\n. Our implementation of Rating does not have a hoverStyle or disabledHoverStyle....hover for Rating is implemented at level of character and not wrapper, thus we have this: hoverCharacterStyle.\nIts look fine in terms of logic, but api looks different from other components.\n. Why should disabledHoverStyle extend disabledStyle ?\nFormer is applied as pseudo class.\n. No this structure is good....its just about how we have grouped and designed the styles. \nWe can change our styling api for Rating to comply with other components and still keep same structure...\nI see the list of stuff to be completed for release just growing as we are working on things... :)\n. What are the down side of using \"checked\" with \"onUpdate\".\n. HTML did not kept for this consistence across various tags... :)\n. :+1: \nyou are awesome :)\n. I found it working with the babel version we have.\n. Great job Nik...\n. Good catch Nik.... i will fix :+1: \n. Done...\nPR: https://github.com/nikgraf/belle/pull/75\n. Strange its working bad in iPhone but works well on my android and also chrome (in mobile iPhone mode)\n. Fixed by removing these styles for combobox box Input:\nWebkitUserSelect: 'none',\n   MozUserSelect: 'none',\n   MsUserSelect: 'none',\n   userSelect: 'none',\n. Hey @nikgraf ,\nI would say lets not do this. I was also thinking about it but then it would break active state behavior and expectations of users.\nBut still we need to fix issues with Rating, Button, Select, Toggle (if any), to make sure:\n1. Active state is not triggered when context menu is opened.\n2. If mouseDown or touchStart happens at component and mouseUp / touchEnd happens outside - focusState, activeState should be reset.\nAnother question should focus state be enabled when context menu is opened. Its enabled in general for html components. But I am not sure when the behavior should be when 'preventFocusStyleForTouchAndClick' is set to true. This handling will ad more complexity to components.\n. Focus can also be divided into:\n1. Inputs\n2. Buttons (Button, Rating, Toggle)\nWe can think on these lines how we want our api to behave and how we want to document the details.\n. Change look good now, Nik plz review and merge.\n. This one is there now _getHint().\n. I was again thinking about this :)\nso implementation may not be very simple....currently we pass to option what we want to see in there.. and Option tag just put it as it is.\nTo achieve this highlighting I think we can pass highlight text to option\n<option value=\"abcdefghij\" highlight=\"efg\"/>\nAnd now option should translate it to structure like this:\n<div>\n  <span>abcd</span>\n  <span bold>efg</span>\n  <span>hij</span>\n</div>\nWe can change existing Option component to do this for us if \"highlight\" property is present on Option tag.\nAgain this highlighting will be an optional feature in ComboBox as it will not be possible if the user uses a custom layout for option.\nHey @nikgraf , what do you suggest ?\n. This would restrict us in terms of customizing the options, like we have we have done using images and sub-titles.\nBut yep the overall structure will become simpler.\n. I am not able to replicate this Nik. We can check this on ur screen whenever you get time.\n. This grouping looks good Nik...I am thinking about how we can really show them in docs...\nBase properties and Advance properties will be different for all components.\nBut a lot in  StylingProperties may be similar, though not same. \nAll information should be available to user, but still should not look like  there is a huge list of props. might be we can have small expandable area where we detail the properties.\n. Completed.\n. Hey Nik,\nChanges look good. But:\n1. I see a test cases breaking, I tired to look into it but it needs more debugging.\n2. As we discussed I think we need to work to make focus styles more easily configurable and simplified for user. Default I think should be blue outline one....but  then user should be able to easily switch to animated focus, or use some altogether different focus style of his own. We can think more to improve it.\n. PR: https://github.com/nikgraf/belle/pull/90 and code changed for this.\n. Changes look good Nik.\nBut I always feel we can do better job at Docs.\n. Hey @nikgraf,\nWhile I am implementing the changes for combobox. I think duration when an input is active is effectively same as when its focused (this is unlike button, rating).\nDo we really need a separate activeStyle ?\n. Changes look good Nik.\n. +1, good idea.\nLets add a file utils/helper.js which can have all such utility methods.\n. Also investigate if we can effectively use ES6 destructuring assignment in place on omit function.\n. I see an issue with this branch in my local...plz hold on the merge.\n. Fixed with https://github.com/nikgraf/belle/pull/104\n. @nikgraf, I think we should have more info in our docs about unique things in belle like support on mobiles....how our components are made handle all events touch/ mouse/ keyboard...and how they are super configurable.\n. Lets add something about react also in 'Philosophy' and why we choose it and underlying library.\n. another thing...I think our docs should also reflect belle themes...\nand something better than this dropdown to change themes.\n. :+1: :smile: \n. The reason for this issue Nik is that pseudo classes we are injecting using 'injectStyles(styles);'.\nIn componentWillReceiveProps we should use have:\n    removeStyle(this.ratingWrapperStyleId);\nBefore:\n    updatePseudoClassStyle(this._styleId, properties, this.preventFocusStyleForTouchAndClick);\nLet me fix this.\n. I have created PR: https://github.com/nikgraf/belle/pull/103\nThere might be issues other than these also with styling, we can test more.\n. Yep we can fix issue in docs by using window.location.reload() and I think the probably of users changing themes on fly is very low.\nBut @nikgraf , if I think from the perspective of good code structure....if theme can change dynamically its  not good to bring them in react components with just \nimport style from '../style/button';\nProbably a design like this which Vjeux told would be better:\nbelleComponents = new BelleComponents(stylingTheme)\nAlso, React component should ideally change only by user interaction or change in props..... this 'forceUpdate()' brings a feeling of something done wrong. And variables other than state and props are affecting the component.\n. This way to configuring by changing core configurations in lib do not look good:\nbelle.style.button.style = _.extend(belle.style.button.style, {\n  color: '#FFF',\n  background: '#444',\n  border: '1px solid #444',\n  borderBottomColor: '#000'\n});\n. Great job Nik\n. :+1: \n. Good fix.... \n. :+1: \n. Could not replicate this:  IE 9: Combobox is not focusable (seems like the underlaying input is on top)\nUsed IE9 browser here: https://www.browserstack.com/\nwhich is real IE9 browser and not IE11 in IE9 mode.\n. Toggle:\n1: 'IE11 and lower: With Bootstrap styles there is an issue at the border/background top of the handle'\nthis can not be fixed as toggle will break on other browsers then. (though toggle with custom choice looks good)\n2: IE11 and lower: On Belle with classic focus style you can see the Toggle is loosing focus\ndivs do not get focused in IE....this happens for all divs (I guess some different in how :focus is applied in IE)...but need to check this more deeply if we want to fix this.\n. Thanks @kof , and thanks for this great work (https://github.com/jsstyles/jss). We will definitely consider and evaluate it for belle and get back to you with queries :smile: \n. Hey @alanrsoares ,\nPlease let us know specific OS you are using and whats your version on node/ npm.\nAlso can you try 'npm start' in belle directory before you do it in examples.\n. Do it in this sequence:\ncd ~/belle\nnpm install\nnpm start\nNow you will be able to see a lib directory inside belle directory, now do:\ncd examples\nnpm install\nnpm start\nHope that will help and let us know if you still do not find any luck.\n. Another point to mention our test cases will not run with npm 0.12.0. Jest currently does not support it.\n. Hey @alanrsoares,\nI could find there was really some issue with package.json which we were not facing as our node_modules were already in place.\nI have pushed a new commit to fix that, please take latest.\n. Thanks for bringing this up :+1: \n. Something on top of React's input component with type=\"number\" may look nice:\n<input type=\"number\"/>\n. References: \nhttps://github.com/JedWatson/react-date-input\nhttps://github.com/Rudeg/react-input-calendar\n. Yep @dmitry , this one is real good. Thanks.\n. Collecting couple of design / api thoughts about the component:\n1. The component will have 2 properties month, year. They will be by default current month and current year. The component will by default show that month and year to user to select date from.\n2. Current date (today) will be highlighted on the component but not selected.\n3. User can give a default date to the component using - defaultValue, value or valueLink props. Once a new date is selected onUpdate will be called and also component will be updated depending on which property -> \"defaultValue, value or valueLink\" is used.\n4. Like rating we should provide some api method for user to be able to unset the date.\n. Rating component will support these 3 states:\n1. Enabled and can be modified:\n   Component is enabled and value can be changed:\n2. Disabled:\n   http://www.w3.org/TR/html401/interact/forms.html#h-17.12.1\n3. Read-Only:\n   http://www.w3.org/TR/html401/interact/forms.html#h-17.12.2\nARIA-properties supported:\n1. aria-label\n2. aria-current\n3. aria-selected\n4. aria-disabled\n5. aria-readonly\nReference for localization data: https://github.com/jquery/jquery-ui/tree/master/ui/i18n\nWhen using date-picker with input box - date input, focus styles of date picker should be totally disabled and CTRL + keys can then be used for kayboard navigation. This might mean much complexity for keyboard handling :(\nFor days in datePicker it will be better to have a new state (in addition to focus state), so that both mouse and keyboard events can be handled seemlessly. This state may not have any styling associated with it.\nReference: https://jqueryui.com/datepicker/\nHighlighting weekend in calendar will be an optional feature. Though many calendar's do no include weekend information as locale data. I think locale data is good place to do that. There will be a property 'styleWeekend' which when true will result in highlighting weekend.\n. KeyStrokes to be implemented:\n- [x] Tabbing - current date to be set active.\n- [ ] Control+Page Up - Moves to the same date in the previous year.\n- [ ] Control+Page Down - Moves to the same date in the next year.\n- [x] Space - Singleton Mode: acts as a toggle either selecting or deselecting the date.\n- [ ] Home - Moves to the first day of the current month.\n- [ ] End - Moves to the last day of the current month.\n- [ ] Page Up - Moves to the same date in the previous month.\n- [ ] Page Down - Moves to the same date in the next month.\nImplemented ones:\n1. Shift+Tab - reverses the direction of the tab order.\n2. Up Arrow and Down Arrow - goes to the same day of the week in the previous or next week respectively.\n3. Left Arrow and Right Arrow - advances one day to the next, also in a continuum.\n4. Enter -  Enter confirms the selected date(s).\n. WAI-ARIA support:\n- [x] The current month has a label representing the month and year. It is advisable to use a role heading but is not essential. This \"label\" should have a unique ID.\n- [x] The container for the day of week headers and numeric days of the week has a role of grid.\n- [x] Each name for the day of the week has a role columnheader and is not navigable via the keyboard.\n- [x] Each numeric day of the week has the role gridcell.\n- [x] When a day is selected its aria-selected is set to true, otherwise it is set to false or removed.\n- [x] Changes in aria states, identified here, as well as focus, are clearly styled to show the user where their point of regard is and what days are selected.\n. - [x] Creating spans for arrows.\n. Nice @nikgraf , I plan to work on all the bugs you highlighted, lets also catchup some time to discuss the suggestions.\n. My feedback: Great component :)\nBut I am doubtful  about merged hover and focus states. This can create unexpected behaviors like someone can hover over a date and press enter to select it - something which will never work for simple button.\n. It would be nice to have some guidelines for contributors also.\nWe could have thought of some other git workflows more customized to our needs. Bit I think get flow is more of standard now, which everyone is comfortable using.\n. Helpers can be further simplified and improved by using js methods for Array and Object, check http://kangax.github.io/compat-table/es5/.\n. Hey nik\nR u sure, it may just work as highlight.js is still called when code\ncomponent is mount. I just removed call from update.\nOn Jul 18, 2015 8:40 PM, \"Nikolaus Graf\" notifications@github.com wrote:\n\nI'm so glad you identified that issue. Sadly this will prevent the\nhighlighting on the page. It never worked on development, because the css\nfile is not available.\nI will check later today, but it should be possible to render the\nhighlighting code component only once.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/pull/129#issuecomment-122551305.\n. I expect the fix to work coz in dev environment also the highlight.js classes are getting applide in code block. Its just that css is not there.\n. Hey Nik,\n\n+1, I was also thinking of doing it this way. Though its very less probable that value param will change dynamically. But still I think this would be better fix, in fact I can revert mine. Let me do that.\nThat makes me thing how careful one should be to optimize render for controlled components.\n. Seems like you are missing react addons. Check this: https://facebook.github.io/react/docs/addons.html. Use this to import React:\nimport React from 'react/addons';\nPlease let us know if problem still persist.\n. Point noted :)\nWe will update docs. Thanks a lot.\n. After merging the PR https://github.com/nikgraf/belle/pull/134. React.addons should not longer be a dependency.\n. Thanks a ton Alexander for this cool code change :+1: \n. I think its not wrong to use value for comparison, coz value is what is ultimately copied to combobox. We have different text in <option> for user to be able to put additional information about the <option>. And you can always make value same as text.\nAnd I am not able to think of a filter for numeric value, I think its good the way it is right now. Can you suggest some filter which can cater to numeric value, btw this combobox allows custom filters also.\n. Hey @nikgraf , @alanrsoares ,\nMight be I do not understand the use case you guys have.\nI am wondering combobox at the end is input, why like <select/> it would need to input something different than value.\n. Hey @nikgraf , @alanrsoares ,\nI get your point here. onBlur can help us know when the user is finally done with changing the value. But it would be useful to have additional callbacks that will be triggered when user selects some value from options or use hint to change value. :+1: (complex)\nDo you think we still need a value different from text in input box (like ids) for filtering ? typeahead.js seems to be filtering on the actual value you enter and not some separate id.\nHey @alanrsoares , thanks a lot for ur useful inputs. This combobox discussion is one me and Nik are having from quite some time. But your vote makes him win :smile:\n. I think different value from inputText can be useful for situations like user wants more complex filtering and not the default one we provide.\nBut then what should we send back to the user in callbacks (onUpdate, onBlur). In addition since we are using React's <input> for combobox. What will be value of that input, it will not be possible to have a value different from what it shows.\n. Thx @alanrsoares :+1: \n. Hey @bvleur ,\nThanks a lot for finding thus bug and submitting this PR. One thing I do not get is what are those crucial props for filtering which sanatizeInputProps is mutating.\n. Hey @bvleur ,\nYep, can you plz do that.\nOther than that I think putting the if/else block for checking value/valueLink before `const newState = {} will have no impact, so we are good.\nThanks again :smile:\n. Hey @bvleur ,\nWhile testing ur change I found another small issue. The call to 'this.filterOptions' on line no: 549 also needs to be changed, else combo-box behavior is broken :(\nIs it possible for you to do this as well ?\n. :+1: \nthanks\n. Hey @alanrsoares , @nikgraf ,\n@alanrsoares : first of all thanks a lot for digging so deep into it.\nI think its definitely good to have a method which is called when user selection an option or hint (typeahead.js) has it. Lets add it :+1: . But again my concern here is if user prefer to type whole value rather than select from option, we might miss that. So I think onBlur/ onUpdate is the best place to handle user inputs.\nAgain @alanrsoares , belle combo-box opens on focus. But its not happening for you, might be async call in 'componentWillMount' is delaying in getting the options.\nHere:\nConsole output after first loading:\njavascript\ncomponentWillMount Object {options: Object, selected: null}\nrender Object {options: Object, selected: null}\nquery Object {next: null, maxId: 195701, items: Array[8]}\nrender Object {options: Object, selected: null}\nLast render does not shows data in state, seems like something not going correct.\n. Hey @alanrsoares ,\nDid you had any luck in getting this one fixed.\n. Fixed with PR: https://github.com/nikgraf/belle/pull/139\nThanks to @bvleur \n. I think it not very good idea to call 'props.onClick()' after touchEnd - it will be breaking the default behavior of onClick. I think it will be better to have onPressed, (onUpdate is typically for form elements as they update as result of user interaction).\nBut again our onPressed will be exactly same as onTouchEnd. Might be we can just leave a note in our docs about this behavior of onClick and onTouchEnd and which ones users should prefer.\n@nikgraf , what do you suggest ?\nNew Date Picker component can also be referred, as I handled it differently there.\n. Nice research Nik,\nWe have components which are like blend of 2 others like rating something between a button and a form component.\nThis is how W3C definition of combobox goes - \"A presentation of a select; usually similar to a textbox where users can type ahead to select an option, or type to enter arbitrary text as a new item in the list. See related listbox. combobox is the combined presentation of a single line textfield with a listbox popup. The combobox may be editable. Typically editable combo boxes are used for autocomplete behavior, and authors SHOULD set aria-autocomplete attribute on the textfield.\"\nIts actually blend of select and input, this makes tough to decide the api. I do not want to go by the name 'ComboBox' or definition to design api, but want to create something that would fit need of web development and users of belle as of now - its our chance to do it better than w3c :smile: \nI think best way out is have 2 methods:\n1. Triggered for exact match\n2. Trigger for every change - for this we can not depend on onChange of React's <input> as it will not be triggered when user selects an option.\nWe can give any names in our api to these methods.\nYou can check this events in typeahead.js: https://github.com/twitter/typeahead.js/blob/master/doc/jquery_typeahead.md#custom-events\nIt has events for both input and select. I do not mind breaking the api, but what new we design should be great.\n. How about methods names like \n1. onUpdate - for any change\n2. onSelect / onSelectionChange - for exact match\n. We might need to rethink upon 'onInputMatch' implemented as of now, the use case I see problematic is if suppose we have 4 options like \n1. test\n2. testing\n3. testing12\n4. testing12345\nAs soon as user types 'test' function 'onInputMatch' will be called. Might be user intended to type 'test' and then select 'testing12345'.\nI think like typeadhead.js we call these callbacks only if user selects or autocompletes using hint one of the options. User may type whole values but then its developers job to handle these scenarios in 'onUpdate'.\n. Hey Nik,\nProposal-3 looks useful, very nice idea :+1: \n. Hey Nik,\nThese names looks fine. For use case (a) we can still add callback for case when user selects option (in addition to these params).\n. Another small related issue: if there is no placeholder(which is not highly probable) and no option then select gets broken on the page as  for placeholder or option is missing.\n. This has been fixed with PR https://github.com/nikgraf/belle/pull/148.\n. Hey Nik,\nMy implementation of helpers is not underscore, underscore takes care of a hell lot of edge cases and ECMA versions. I want to keep implementation minimal and tailored specifically to our need.\nIt definitely can be handled the way you are mentioning. But if we change helpers it will be change in one centralized place (it will not be ideal to need to do this for all props of type array :( ). I want to have clear expectation set from helper methods and all helper methods should behave in that way.\nBy moving away from underscore we definitely are losing advantage of battle tested code. But reverse engineering a helpers for us from underscore is crazy plus we might still be left with unexpected behaviors and doing some of the handling in components code itself.\n. My brain is kind of loaded with thoughts about what would be the best way out for this. I do not want to have some black box code in my app which I just trust.\nThe reason <select> was not breaking previously was that when we passed single object to it underscore was doing filtering on each field of the object and returning empty object. This was not what we needed but we never knew - some edge case might not have worked well, but we never noticed.\nSo there are trade-offs, loosing the advantage of some battle tested code (which is no small in  itself) vs loosing the advantage of having a helper perfectly suited to what I need (this will need that we have exact knowledge of underscore method when we use it and we tailor our input to the expectations of the method).\nLets discuss this and the other PR more in call today.\n. Hey Nik,\nI have updated the PR, but still there is one issue - if there is no placeholder(which is not highly probable) and no option then select gets broken on the page as <div> for placeholder or option is missing.\n. Hey @nikgraf ,\nChanges in select look great :+1: (I will spend some time testing those today).\nI agree with you about helpers we should use more of native methods. There are many in ES5 which can greatly help us (I will create a issue for this).\nI want helpers to have consistent and well defined behavior (more tailored to what belle code needs), so that when we use it we know what exactly we are doing - that also makes me happy about getting rid of underscore.\nI still want to keep mapObject method because otherwise map method handling both array and object becomes inconsistent from what other methods do. Let me add a commit for that.\n. Hey Nik,\nIn case select has no children. its hight become 0. Which looks bad, this can be fixed by giving a min-height.\nWhat would you suggest for this.\nI am yet to do that mapObject changes - planning to do it tomorrow.\n. Yes, its very unlikely to have such scenario (I think of scenario where options are dynamically and there is no option in some scenario).\nLets leave it as is :) \n. Great job Nik... :+1:\n. Hey @nikgraf ,\nJust added active styles to bootstrap theme.\n. Oh...let me add a if condition before...document.addEventListener in componentWillMount.\n. Hey,\nRelease should be very soon today or tomorrow by latest, @nikgraf can confirm.\n. Hey @luandro ,\nWe are looking into this.\n. Hey @luandro ,\nI tired using select in React-Server side project - https://github.com/nikgraf/react-server-example\nand also in another isomorphic project.\nWhat I found regarding select is that its rendering but has issue in event handling - that is coz we have referenced 'document' in some of event handlers ( :( our fault, we will fix that).\nBut I could not replicate the issue you are getting :(\n. happy to see ur liking these :smile: \n. Hey @yzhiJun,\nThanks a lot for this finding, we will soon fix this :+1: \n. Great job @nikgraf :smile:\n. Fixed in PR https://github.com/nikgraf/belle/pull/154\n. Its coming from line: Select.jsx line:62\nI guess issue is that when we use above way of giving options, the type is somehow not coming correct.\nOne trouble is also that options.map returns an array, placeholder has been given as separate component but should have been part of array.\nplaceholder + array !== array\n. This has been fixed with PR https://github.com/nikgraf/belle/pull/148\nSoon there will be a release we well :)\n. :) this should be merged and released in 1-2 days.\n. Fix:\nI do not wanted to move logic for calculation of filtered option in render method as that calculation may not be needed each time combobox is  rendered. I have rather moved it to a variable (instance variable) of ComboBox, so that we calculate it only when:\n1. Component is initialized or receives props.\n2. Value of component changes.\n. :smile: great\n. Hey @nikgraf ,\nThat should not happen, coz filteredOptions are derived from other parameters in state and props. Check my comments here #162 .\n@bvleur was facing this issue: \"If you arrive at a input value matching an option by pressing backspace, the isMatchingOption won't be set to true.\"\nThe reason for the issue was that I was updating filteredOptions in state using setState() method and immediately after that I was using this.state.filteredOptions. setState is asynchronous and I was getting old value. I could have solved that in other ways. But I was thinking that filteredOptions are really not needed in state, I was always confused about this - so I moved them out and now its working fine.\n. We already know specific places where filteredOptions can change, so I think calling function at just those places might be more performant than memoize and calling at each render.\nMostly its called only when inputValue changes and in that case re-filtering is actually needed.\n. I debug the issue in radium + belle, and it came out that out 2 components - Select / ComboBox are not working well with radium. These components are structured like:\n<Select>\n  <Placeholder>Select Country</Placeholder>\n  <Option value=\"USA\">USA</Option>\n  <Option value=\"UK\">UK</Option>\n</Select>\nSelect code expects to get an array of the nested components in props.children:\n\nBut with radium this array is converted to object:\n\nThis is breaking the 2 components :(\n. This makes sense, we will refactor our code for that. Thanks a lot @ianobermiller.\n. Thanks a lot @luisrudge for bringing this up, we will soon fix it.\n. Hey @ianobermiller ,\nWe still need filtering/ splicing in scenario like when user enters some test in combobox, we need options to be filtered. Though I agree with you validateChildrenAreOptionsAndMaximumOnePlaceholder can be improved.\n@nikgraf , I would suggest writing new set of helper methods for filtering and other operations like some, index, first which will use React.Children.forEach underneath.\nThis may be little more code change, but I agree with you that's how we should so it.\n. This might be related: https://github.com/nikgraf/belle/issues/151, though not same.\n. :+1: \n. Finally ... changes completed and PR looks good. I also tested it with Radium :)\n. Looks good ... :+1: \n. A work around could be using controlled TestInput component and saving characters of password on each onUpdate and showing only some place holder in component.\nThough this is not good fix, ideally we should add a prop 'type' to component and be able to handle it for values like number, password, email.\n. Yeh, might be we can think about using  for these, I do not expect emails, pwds and numeric inputs to span multiple lines\n. Great work Nik.\n. Hey @Agamennon,\n value property can be manipulated, but if you use value property it becomes controlled component, check this for detailed explanation: http://nikgraf.github.io/belle/#/guide/form-components. Please let me know if that needs more clarity.\nBelle supports most of standard events, can you please let us know which specific ones do you find missing.\n. Yeh ur right Nik, though a workaround could be that we call onChange from onUpdate.\n. Hey Nik,\nShould we enhance our code to take care of onChange or should we suggest users to call onChange from onUpdate ?\n. Hey @luisrudge / @nikgraf ,\nI did looked into issue and thats apparently use of method 'isReactElement' in is-component-of-type.js\nReact RC candidate has got this method removed: https://github.com/facebook/react/pull/4652/files.\nThis needs to be fixed in belle.\n. Hey @luisrudge,\nThough select is working its showing this error while trying to reposition options (check http://nikgraf.github.io/belle/#/component/select, property: shouldPositionOptions).\nPR: https://github.com/nikgraf/belle/pull/207 has the fix.\n. Thanks @antipin :smile: \n. Good Job :+1: \n. Hey @alexfedoseev ,\nCan you plz specify some examples. It could be the case that the way we implemented inline styles, I mean which particular styling parameters like 'display', 'position', etc is creating trouble for you.\n~Jyoti\n. Thanks a lot @iansinnott\n. :+1: \n. I guess reason is that styles we are passing are overriding most of bootstrap styles. Yep make sense to hide it for bootstrap theme, or may be just get rid of it, re-sizing using props is too complex for anyone to use.\n. Cool, let me check.\nGood work :smile: \n. Hey Nik,\nI tried out changes in my project and one more small change was needed. I have done that and merging.\n. No @nikgraf, its done only for few components.\n. Hey Nik,\nPR looks good, I have some feedbacks which you can check. I am merging it.\n. Hey @nikgraf,\nThis PR has fix for month, year issue as discussed and some refactoring for onKeyDown method.\n. Good work.\n. Hey @nikgraf,\nSpinner is good its small, simple and very useful. I think its good enough to be merged and be part of 2.0. Do you want to work more on it or should I go ahead and merge it.\nA property could be configurable number of dots, but again thats a good to have thing not must have.\n. I agree, I mean giving out such minimal components and then looking for feedbacks to improve them can help us build more and more components and reduce un-necessary coding and features.\n. Looks good :+1: \n. Nice fix.\n. Looks good.\n. I thought you added some guy there :smile: \n. Hey @plandem, nice research on grid. A data grid is something I would love making as well :smile: \n. That's interesting @nikgraf, I will take a look at it today.\n. Fixed here: https://github.com/nikgraf/belle/pull/264\n. :+1: \n. Verified changes today, they look all good.\nI am still trying to understand why are binding a performance overhead.\nAlso at places I used fat arrow functions for event handling (in date picker) so that I can avoid binding. But then I am realizing that fat arrow functions are binding in themselves.\n. Changes look good Nik, but for broken build :worried: \n. Closing as it has wrong lib change.\n. Ya I just checked it there...\n. I saw that in general controlled components in our docs are slowing down as we type more. But I came across this fiddle with controlled input and textarea components really fast: http://jsfiddle.net/f1v1fac1/\nAs I copied the same components in our docs, they also became slow, interesting. I believe the trouble is somewhere with our docs as same components are good in examples. \n. Finding: in docs we are using highlightJs for highlighting the code. When we type a lot in controlled <TextInput> render is called multiple times and these code blocks are rendered again and again, this is adding crazy number of elements to dom and slowing down the page.\nThe issue disappears if I comment these highlightJs calls.\n. It still had more issues, I tried running belle on windows box 2 days back. Need to spend more time to fix that :)\n. You are right postinstall is the exact pain point, the way we are using dependencies can definitely be improved. Let me spend more time trying to fix this ( I will probably have more queries for you then).\nWe also had some troubles with some babel configurations like this '--optional='es7.classProperties'' on windows.\n. Autocomplete has been renamed to combobox and is largely completed. But there are still a few points I was to note here so that we do not miss:\n1. Right now we do not have a hover style for caret but will be probably a good thing to add.\n2. Add option for highlighting matching text for combobox input in option - this looks good and we should have.\n3. Right now when you navigate through options using keyboard their value is temporarily copied to combobox input. I had put it there coz many combobox out there I found have this feature. But it at times look misleading giving impression to user that value has been changed and is also error prone. We can think about removing it.\n. Looks good.\n. I think we should fix this one in this week itself (before we release).\n. I think we can go we span caret as in Select right now.\nAlso is there some way that we had a tag conditionally in what we return from render() method (rather than using display:none to hide the element).\n. As me and Nik discussed we will use span for caret (as used in select currently).\nThe api for ComboBox will be aligned to select.\n. Done PR: https://github.com/nikgraf/belle/pull/91\n. Fix in combobox is good catch :+1: \n. +1, I have also been thinking about this.\n. Hey Nik,\nI am merging this small PR. You can take look whenever you get time.\n. I think we can make it configurable and give user choice between plain (blue outline) focus style and our current animated focus style. Like what we are doing with this option \"preventFocusStyleForTouchAndClick\".\nWe will still live with complexity that this style handling bring to components. But I think there might be use cases where someone wants these animated focus styles or focusStyle hidden when you click.\nAnd good UX comes with complexity cost :)\n. Yep, we kind of felt that while we were writing those styles, but then there are sites like youtube which use focus style which stays for short while.\nThat is why we kept it so configurable. You can always turn them off. Check out components on this link with classical focus styles: http://nikgraf.github.io/belle/#/configuration?theme=belle-with-default-focus\n. I agree with what you are saying, we always had that in our mind and thats the reason we created this issue :)\nWe will rethink about it and would let you know how we plan to handle this accessibility issue, which we agree exist with focus animation.\n. Another possible downside of focus animation (of the kind we have right now in belle theme) is if we use button in button group or menu this can effect nearby component in the layout.\n. Another important, tough minor thing that I noticed is that if we disable focus for touchAndClick, ideally we should disable focus when context menu opens.\nThere is another small issue, if you right click(open context) of an unfocused component focus animation will appear, but if you open contextMenu of an already focused element - no animation appears. Coz though focus is an extended state, current animated focus styles does not reflect that.\nA possible style could be animation focus which does not completely fades away. (But this will create issue like one that comes when user switches between tabs and preventFocusStyleForTouchAndClick is true).\n. I think we should have a page in docs that explains how we handle value, i.e how is value, valueLink, defaultValue handled and what should users expect to get from onUpdate method.\n. Lets create a different section in docs 'guides' after component.\nThese details and more can be added to this section.\n. I think we are done with all changes that were need for this issue.\n. Hey Nik,\nThanks a lot for these detailed feedback :smile: \nI have fixed all theses, also I have made the hint feature optional. I wanted to create different commits for docs and test but I had some issue with rebasing and then ended up rebasing them all to 1 commit.\nThis second commit is small code error I found which was breaking builds, I guess is from ESLint changes you did yesterday.\n. I have added t this branch 2 commit, that is small refactoring which was pending for Rating component.\n. That's good idea I think, having props everywhere.\nI will check the above broken one.\n. Our implementation of Rating does not have a hoverStyle or disabledHoverStyle....hover for Rating is implemented at level of character and not wrapper, thus we have this: hoverCharacterStyle.\nIts look fine in terms of logic, but api looks different from other components.\n. Why should disabledHoverStyle extend disabledStyle ?\nFormer is applied as pseudo class.\n. No this structure is good....its just about how we have grouped and designed the styles. \nWe can change our styling api for Rating to comply with other components and still keep same structure...\nI see the list of stuff to be completed for release just growing as we are working on things... :)\n. What are the down side of using \"checked\" with \"onUpdate\".\n. HTML did not kept for this consistence across various tags... :)\n. :+1: \nyou are awesome :)\n. I found it working with the babel version we have.\n. Great job Nik...\n. Good catch Nik.... i will fix :+1: \n. Done...\nPR: https://github.com/nikgraf/belle/pull/75\n. Strange its working bad in iPhone but works well on my android and also chrome (in mobile iPhone mode)\n. Fixed by removing these styles for combobox box Input:\nWebkitUserSelect: 'none',\n   MozUserSelect: 'none',\n   MsUserSelect: 'none',\n   userSelect: 'none',\n. Hey @nikgraf ,\nI would say lets not do this. I was also thinking about it but then it would break active state behavior and expectations of users.\nBut still we need to fix issues with Rating, Button, Select, Toggle (if any), to make sure:\n1. Active state is not triggered when context menu is opened.\n2. If mouseDown or touchStart happens at component and mouseUp / touchEnd happens outside - focusState, activeState should be reset.\nAnother question should focus state be enabled when context menu is opened. Its enabled in general for html components. But I am not sure when the behavior should be when 'preventFocusStyleForTouchAndClick' is set to true. This handling will ad more complexity to components.\n. Focus can also be divided into:\n1. Inputs\n2. Buttons (Button, Rating, Toggle)\nWe can think on these lines how we want our api to behave and how we want to document the details.\n. Change look good now, Nik plz review and merge.\n. This one is there now _getHint().\n. I was again thinking about this :)\nso implementation may not be very simple....currently we pass to option what we want to see in there.. and Option tag just put it as it is.\nTo achieve this highlighting I think we can pass highlight text to option\n<option value=\"abcdefghij\" highlight=\"efg\"/>\nAnd now option should translate it to structure like this:\n<div>\n  <span>abcd</span>\n  <span bold>efg</span>\n  <span>hij</span>\n</div>\nWe can change existing Option component to do this for us if \"highlight\" property is present on Option tag.\nAgain this highlighting will be an optional feature in ComboBox as it will not be possible if the user uses a custom layout for option.\nHey @nikgraf , what do you suggest ?\n. This would restrict us in terms of customizing the options, like we have we have done using images and sub-titles.\nBut yep the overall structure will become simpler.\n. I am not able to replicate this Nik. We can check this on ur screen whenever you get time.\n. This grouping looks good Nik...I am thinking about how we can really show them in docs...\nBase properties and Advance properties will be different for all components.\nBut a lot in  StylingProperties may be similar, though not same. \nAll information should be available to user, but still should not look like  there is a huge list of props. might be we can have small expandable area where we detail the properties.\n. Completed.\n. Hey Nik,\nChanges look good. But:\n1. I see a test cases breaking, I tired to look into it but it needs more debugging.\n2. As we discussed I think we need to work to make focus styles more easily configurable and simplified for user. Default I think should be blue outline one....but  then user should be able to easily switch to animated focus, or use some altogether different focus style of his own. We can think more to improve it.\n. PR: https://github.com/nikgraf/belle/pull/90 and code changed for this.\n. Changes look good Nik.\nBut I always feel we can do better job at Docs.\n. Hey @nikgraf,\nWhile I am implementing the changes for combobox. I think duration when an input is active is effectively same as when its focused (this is unlike button, rating).\nDo we really need a separate activeStyle ?\n. Changes look good Nik.\n. +1, good idea.\nLets add a file utils/helper.js which can have all such utility methods.\n. Also investigate if we can effectively use ES6 destructuring assignment in place on omit function.\n. I see an issue with this branch in my local...plz hold on the merge.\n. Fixed with https://github.com/nikgraf/belle/pull/104\n. @nikgraf, I think we should have more info in our docs about unique things in belle like support on mobiles....how our components are made handle all events touch/ mouse/ keyboard...and how they are super configurable.\n. Lets add something about react also in 'Philosophy' and why we choose it and underlying library.\n. another thing...I think our docs should also reflect belle themes...\nand something better than this dropdown to change themes.\n. :+1: :smile: \n. The reason for this issue Nik is that pseudo classes we are injecting using 'injectStyles(styles);'.\nIn componentWillReceiveProps we should use have:\n    removeStyle(this.ratingWrapperStyleId);\nBefore:\n    updatePseudoClassStyle(this._styleId, properties, this.preventFocusStyleForTouchAndClick);\nLet me fix this.\n. I have created PR: https://github.com/nikgraf/belle/pull/103\nThere might be issues other than these also with styling, we can test more.\n. Yep we can fix issue in docs by using window.location.reload() and I think the probably of users changing themes on fly is very low.\nBut @nikgraf , if I think from the perspective of good code structure....if theme can change dynamically its  not good to bring them in react components with just \nimport style from '../style/button';\nProbably a design like this which Vjeux told would be better:\nbelleComponents = new BelleComponents(stylingTheme)\nAlso, React component should ideally change only by user interaction or change in props..... this 'forceUpdate()' brings a feeling of something done wrong. And variables other than state and props are affecting the component.\n. This way to configuring by changing core configurations in lib do not look good:\nbelle.style.button.style = _.extend(belle.style.button.style, {\n  color: '#FFF',\n  background: '#444',\n  border: '1px solid #444',\n  borderBottomColor: '#000'\n});\n. Great job Nik\n. :+1: \n. Good fix.... \n. :+1: \n. Could not replicate this:  IE 9: Combobox is not focusable (seems like the underlaying input is on top)\nUsed IE9 browser here: https://www.browserstack.com/\nwhich is real IE9 browser and not IE11 in IE9 mode.\n. Toggle:\n1: 'IE11 and lower: With Bootstrap styles there is an issue at the border/background top of the handle'\nthis can not be fixed as toggle will break on other browsers then. (though toggle with custom choice looks good)\n2: IE11 and lower: On Belle with classic focus style you can see the Toggle is loosing focus\ndivs do not get focused in IE....this happens for all divs (I guess some different in how :focus is applied in IE)...but need to check this more deeply if we want to fix this.\n. Thanks @kof , and thanks for this great work (https://github.com/jsstyles/jss). We will definitely consider and evaluate it for belle and get back to you with queries :smile: \n. Hey @alanrsoares ,\nPlease let us know specific OS you are using and whats your version on node/ npm.\nAlso can you try 'npm start' in belle directory before you do it in examples.\n. Do it in this sequence:\ncd ~/belle\nnpm install\nnpm start\nNow you will be able to see a lib directory inside belle directory, now do:\ncd examples\nnpm install\nnpm start\nHope that will help and let us know if you still do not find any luck.\n. Another point to mention our test cases will not run with npm 0.12.0. Jest currently does not support it.\n. Hey @alanrsoares,\nI could find there was really some issue with package.json which we were not facing as our node_modules were already in place.\nI have pushed a new commit to fix that, please take latest.\n. Thanks for bringing this up :+1: \n. Something on top of React's input component with type=\"number\" may look nice:\n<input type=\"number\"/>\n. References: \nhttps://github.com/JedWatson/react-date-input\nhttps://github.com/Rudeg/react-input-calendar\n. Yep @dmitry , this one is real good. Thanks.\n. Collecting couple of design / api thoughts about the component:\n1. The component will have 2 properties month, year. They will be by default current month and current year. The component will by default show that month and year to user to select date from.\n2. Current date (today) will be highlighted on the component but not selected.\n3. User can give a default date to the component using - defaultValue, value or valueLink props. Once a new date is selected onUpdate will be called and also component will be updated depending on which property -> \"defaultValue, value or valueLink\" is used.\n4. Like rating we should provide some api method for user to be able to unset the date.\n. Rating component will support these 3 states:\n1. Enabled and can be modified:\n   Component is enabled and value can be changed:\n2. Disabled:\n   http://www.w3.org/TR/html401/interact/forms.html#h-17.12.1\n3. Read-Only:\n   http://www.w3.org/TR/html401/interact/forms.html#h-17.12.2\nARIA-properties supported:\n1. aria-label\n2. aria-current\n3. aria-selected\n4. aria-disabled\n5. aria-readonly\nReference for localization data: https://github.com/jquery/jquery-ui/tree/master/ui/i18n\nWhen using date-picker with input box - date input, focus styles of date picker should be totally disabled and CTRL + keys can then be used for kayboard navigation. This might mean much complexity for keyboard handling :(\nFor days in datePicker it will be better to have a new state (in addition to focus state), so that both mouse and keyboard events can be handled seemlessly. This state may not have any styling associated with it.\nReference: https://jqueryui.com/datepicker/\nHighlighting weekend in calendar will be an optional feature. Though many calendar's do no include weekend information as locale data. I think locale data is good place to do that. There will be a property 'styleWeekend' which when true will result in highlighting weekend.\n. KeyStrokes to be implemented:\n- [x] Tabbing - current date to be set active.\n- [ ] Control+Page Up - Moves to the same date in the previous year.\n- [ ] Control+Page Down - Moves to the same date in the next year.\n- [x] Space - Singleton Mode: acts as a toggle either selecting or deselecting the date.\n- [ ] Home - Moves to the first day of the current month.\n- [ ] End - Moves to the last day of the current month.\n- [ ] Page Up - Moves to the same date in the previous month.\n- [ ] Page Down - Moves to the same date in the next month.\nImplemented ones:\n1. Shift+Tab - reverses the direction of the tab order.\n2. Up Arrow and Down Arrow - goes to the same day of the week in the previous or next week respectively.\n3. Left Arrow and Right Arrow - advances one day to the next, also in a continuum.\n4. Enter -  Enter confirms the selected date(s).\n. WAI-ARIA support:\n- [x] The current month has a label representing the month and year. It is advisable to use a role heading but is not essential. This \"label\" should have a unique ID.\n- [x] The container for the day of week headers and numeric days of the week has a role of grid.\n- [x] Each name for the day of the week has a role columnheader and is not navigable via the keyboard.\n- [x] Each numeric day of the week has the role gridcell.\n- [x] When a day is selected its aria-selected is set to true, otherwise it is set to false or removed.\n- [x] Changes in aria states, identified here, as well as focus, are clearly styled to show the user where their point of regard is and what days are selected.\n. - [x] Creating spans for arrows.\n. Nice @nikgraf , I plan to work on all the bugs you highlighted, lets also catchup some time to discuss the suggestions.\n. My feedback: Great component :)\nBut I am doubtful  about merged hover and focus states. This can create unexpected behaviors like someone can hover over a date and press enter to select it - something which will never work for simple button.\n. It would be nice to have some guidelines for contributors also.\nWe could have thought of some other git workflows more customized to our needs. Bit I think get flow is more of standard now, which everyone is comfortable using.\n. Helpers can be further simplified and improved by using js methods for Array and Object, check http://kangax.github.io/compat-table/es5/.\n. Hey nik\nR u sure, it may just work as highlight.js is still called when code\ncomponent is mount. I just removed call from update.\nOn Jul 18, 2015 8:40 PM, \"Nikolaus Graf\" notifications@github.com wrote:\n\nI'm so glad you identified that issue. Sadly this will prevent the\nhighlighting on the page. It never worked on development, because the css\nfile is not available.\nI will check later today, but it should be possible to render the\nhighlighting code component only once.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/pull/129#issuecomment-122551305.\n. I expect the fix to work coz in dev environment also the highlight.js classes are getting applide in code block. Its just that css is not there.\n. Hey Nik,\n\n+1, I was also thinking of doing it this way. Though its very less probable that value param will change dynamically. But still I think this would be better fix, in fact I can revert mine. Let me do that.\nThat makes me thing how careful one should be to optimize render for controlled components.\n. Seems like you are missing react addons. Check this: https://facebook.github.io/react/docs/addons.html. Use this to import React:\nimport React from 'react/addons';\nPlease let us know if problem still persist.\n. Point noted :)\nWe will update docs. Thanks a lot.\n. After merging the PR https://github.com/nikgraf/belle/pull/134. React.addons should not longer be a dependency.\n. Thanks a ton Alexander for this cool code change :+1: \n. I think its not wrong to use value for comparison, coz value is what is ultimately copied to combobox. We have different text in <option> for user to be able to put additional information about the <option>. And you can always make value same as text.\nAnd I am not able to think of a filter for numeric value, I think its good the way it is right now. Can you suggest some filter which can cater to numeric value, btw this combobox allows custom filters also.\n. Hey @nikgraf , @alanrsoares ,\nMight be I do not understand the use case you guys have.\nI am wondering combobox at the end is input, why like <select/> it would need to input something different than value.\n. Hey @nikgraf , @alanrsoares ,\nI get your point here. onBlur can help us know when the user is finally done with changing the value. But it would be useful to have additional callbacks that will be triggered when user selects some value from options or use hint to change value. :+1: (complex)\nDo you think we still need a value different from text in input box (like ids) for filtering ? typeahead.js seems to be filtering on the actual value you enter and not some separate id.\nHey @alanrsoares , thanks a lot for ur useful inputs. This combobox discussion is one me and Nik are having from quite some time. But your vote makes him win :smile:\n. I think different value from inputText can be useful for situations like user wants more complex filtering and not the default one we provide.\nBut then what should we send back to the user in callbacks (onUpdate, onBlur). In addition since we are using React's <input> for combobox. What will be value of that input, it will not be possible to have a value different from what it shows.\n. Thx @alanrsoares :+1: \n. Hey @bvleur ,\nThanks a lot for finding thus bug and submitting this PR. One thing I do not get is what are those crucial props for filtering which sanatizeInputProps is mutating.\n. Hey @bvleur ,\nYep, can you plz do that.\nOther than that I think putting the if/else block for checking value/valueLink before `const newState = {} will have no impact, so we are good.\nThanks again :smile:\n. Hey @bvleur ,\nWhile testing ur change I found another small issue. The call to 'this.filterOptions' on line no: 549 also needs to be changed, else combo-box behavior is broken :(\nIs it possible for you to do this as well ?\n. :+1: \nthanks\n. Hey @alanrsoares , @nikgraf ,\n@alanrsoares : first of all thanks a lot for digging so deep into it.\nI think its definitely good to have a method which is called when user selection an option or hint (typeahead.js) has it. Lets add it :+1: . But again my concern here is if user prefer to type whole value rather than select from option, we might miss that. So I think onBlur/ onUpdate is the best place to handle user inputs.\nAgain @alanrsoares , belle combo-box opens on focus. But its not happening for you, might be async call in 'componentWillMount' is delaying in getting the options.\nHere:\nConsole output after first loading:\njavascript\ncomponentWillMount Object {options: Object, selected: null}\nrender Object {options: Object, selected: null}\nquery Object {next: null, maxId: 195701, items: Array[8]}\nrender Object {options: Object, selected: null}\nLast render does not shows data in state, seems like something not going correct.\n. Hey @alanrsoares ,\nDid you had any luck in getting this one fixed.\n. Fixed with PR: https://github.com/nikgraf/belle/pull/139\nThanks to @bvleur \n. I think it not very good idea to call 'props.onClick()' after touchEnd - it will be breaking the default behavior of onClick. I think it will be better to have onPressed, (onUpdate is typically for form elements as they update as result of user interaction).\nBut again our onPressed will be exactly same as onTouchEnd. Might be we can just leave a note in our docs about this behavior of onClick and onTouchEnd and which ones users should prefer.\n@nikgraf , what do you suggest ?\nNew Date Picker component can also be referred, as I handled it differently there.\n. Nice research Nik,\nWe have components which are like blend of 2 others like rating something between a button and a form component.\nThis is how W3C definition of combobox goes - \"A presentation of a select; usually similar to a textbox where users can type ahead to select an option, or type to enter arbitrary text as a new item in the list. See related listbox. combobox is the combined presentation of a single line textfield with a listbox popup. The combobox may be editable. Typically editable combo boxes are used for autocomplete behavior, and authors SHOULD set aria-autocomplete attribute on the textfield.\"\nIts actually blend of select and input, this makes tough to decide the api. I do not want to go by the name 'ComboBox' or definition to design api, but want to create something that would fit need of web development and users of belle as of now - its our chance to do it better than w3c :smile: \nI think best way out is have 2 methods:\n1. Triggered for exact match\n2. Trigger for every change - for this we can not depend on onChange of React's <input> as it will not be triggered when user selects an option.\nWe can give any names in our api to these methods.\nYou can check this events in typeahead.js: https://github.com/twitter/typeahead.js/blob/master/doc/jquery_typeahead.md#custom-events\nIt has events for both input and select. I do not mind breaking the api, but what new we design should be great.\n. How about methods names like \n1. onUpdate - for any change\n2. onSelect / onSelectionChange - for exact match\n. We might need to rethink upon 'onInputMatch' implemented as of now, the use case I see problematic is if suppose we have 4 options like \n1. test\n2. testing\n3. testing12\n4. testing12345\nAs soon as user types 'test' function 'onInputMatch' will be called. Might be user intended to type 'test' and then select 'testing12345'.\nI think like typeadhead.js we call these callbacks only if user selects or autocompletes using hint one of the options. User may type whole values but then its developers job to handle these scenarios in 'onUpdate'.\n. Hey Nik,\nProposal-3 looks useful, very nice idea :+1: \n. Hey Nik,\nThese names looks fine. For use case (a) we can still add callback for case when user selects option (in addition to these params).\n. Another small related issue: if there is no placeholder(which is not highly probable) and no option then select gets broken on the page as  for placeholder or option is missing.\n. This has been fixed with PR https://github.com/nikgraf/belle/pull/148.\n. Hey Nik,\nMy implementation of helpers is not underscore, underscore takes care of a hell lot of edge cases and ECMA versions. I want to keep implementation minimal and tailored specifically to our need.\nIt definitely can be handled the way you are mentioning. But if we change helpers it will be change in one centralized place (it will not be ideal to need to do this for all props of type array :( ). I want to have clear expectation set from helper methods and all helper methods should behave in that way.\nBy moving away from underscore we definitely are losing advantage of battle tested code. But reverse engineering a helpers for us from underscore is crazy plus we might still be left with unexpected behaviors and doing some of the handling in components code itself.\n. My brain is kind of loaded with thoughts about what would be the best way out for this. I do not want to have some black box code in my app which I just trust.\nThe reason <select> was not breaking previously was that when we passed single object to it underscore was doing filtering on each field of the object and returning empty object. This was not what we needed but we never knew - some edge case might not have worked well, but we never noticed.\nSo there are trade-offs, loosing the advantage of some battle tested code (which is no small in  itself) vs loosing the advantage of having a helper perfectly suited to what I need (this will need that we have exact knowledge of underscore method when we use it and we tailor our input to the expectations of the method).\nLets discuss this and the other PR more in call today.\n. Hey Nik,\nI have updated the PR, but still there is one issue - if there is no placeholder(which is not highly probable) and no option then select gets broken on the page as <div> for placeholder or option is missing.\n. Hey @nikgraf ,\nChanges in select look great :+1: (I will spend some time testing those today).\nI agree with you about helpers we should use more of native methods. There are many in ES5 which can greatly help us (I will create a issue for this).\nI want helpers to have consistent and well defined behavior (more tailored to what belle code needs), so that when we use it we know what exactly we are doing - that also makes me happy about getting rid of underscore.\nI still want to keep mapObject method because otherwise map method handling both array and object becomes inconsistent from what other methods do. Let me add a commit for that.\n. Hey Nik,\nIn case select has no children. its hight become 0. Which looks bad, this can be fixed by giving a min-height.\nWhat would you suggest for this.\nI am yet to do that mapObject changes - planning to do it tomorrow.\n. Yes, its very unlikely to have such scenario (I think of scenario where options are dynamically and there is no option in some scenario).\nLets leave it as is :) \n. Great job Nik... :+1:\n. Hey @nikgraf ,\nJust added active styles to bootstrap theme.\n. Oh...let me add a if condition before...document.addEventListener in componentWillMount.\n. Hey,\nRelease should be very soon today or tomorrow by latest, @nikgraf can confirm.\n. Hey @luandro ,\nWe are looking into this.\n. Hey @luandro ,\nI tired using select in React-Server side project - https://github.com/nikgraf/react-server-example\nand also in another isomorphic project.\nWhat I found regarding select is that its rendering but has issue in event handling - that is coz we have referenced 'document' in some of event handlers ( :( our fault, we will fix that).\nBut I could not replicate the issue you are getting :(\n. happy to see ur liking these :smile: \n. Hey @yzhiJun,\nThanks a lot for this finding, we will soon fix this :+1: \n. Great job @nikgraf :smile:\n. Fixed in PR https://github.com/nikgraf/belle/pull/154\n. Its coming from line: Select.jsx line:62\nI guess issue is that when we use above way of giving options, the type is somehow not coming correct.\nOne trouble is also that options.map returns an array, placeholder has been given as separate component but should have been part of array.\nplaceholder + array !== array\n. This has been fixed with PR https://github.com/nikgraf/belle/pull/148\nSoon there will be a release we well :)\n. :) this should be merged and released in 1-2 days.\n. Fix:\nI do not wanted to move logic for calculation of filtered option in render method as that calculation may not be needed each time combobox is  rendered. I have rather moved it to a variable (instance variable) of ComboBox, so that we calculate it only when:\n1. Component is initialized or receives props.\n2. Value of component changes.\n. :smile: great\n. Hey @nikgraf ,\nThat should not happen, coz filteredOptions are derived from other parameters in state and props. Check my comments here #162 .\n@bvleur was facing this issue: \"If you arrive at a input value matching an option by pressing backspace, the isMatchingOption won't be set to true.\"\nThe reason for the issue was that I was updating filteredOptions in state using setState() method and immediately after that I was using this.state.filteredOptions. setState is asynchronous and I was getting old value. I could have solved that in other ways. But I was thinking that filteredOptions are really not needed in state, I was always confused about this - so I moved them out and now its working fine.\n. We already know specific places where filteredOptions can change, so I think calling function at just those places might be more performant than memoize and calling at each render.\nMostly its called only when inputValue changes and in that case re-filtering is actually needed.\n. I debug the issue in radium + belle, and it came out that out 2 components - Select / ComboBox are not working well with radium. These components are structured like:\n<Select>\n  <Placeholder>Select Country</Placeholder>\n  <Option value=\"USA\">USA</Option>\n  <Option value=\"UK\">UK</Option>\n</Select>\nSelect code expects to get an array of the nested components in props.children:\n\nBut with radium this array is converted to object:\n\nThis is breaking the 2 components :(\n. This makes sense, we will refactor our code for that. Thanks a lot @ianobermiller.\n. Thanks a lot @luisrudge for bringing this up, we will soon fix it.\n. Hey @ianobermiller ,\nWe still need filtering/ splicing in scenario like when user enters some test in combobox, we need options to be filtered. Though I agree with you validateChildrenAreOptionsAndMaximumOnePlaceholder can be improved.\n@nikgraf , I would suggest writing new set of helper methods for filtering and other operations like some, index, first which will use React.Children.forEach underneath.\nThis may be little more code change, but I agree with you that's how we should so it.\n. This might be related: https://github.com/nikgraf/belle/issues/151, though not same.\n. :+1: \n. Finally ... changes completed and PR looks good. I also tested it with Radium :)\n. Looks good ... :+1: \n. A work around could be using controlled TestInput component and saving characters of password on each onUpdate and showing only some place holder in component.\nThough this is not good fix, ideally we should add a prop 'type' to component and be able to handle it for values like number, password, email.\n. Yeh, might be we can think about using  for these, I do not expect emails, pwds and numeric inputs to span multiple lines\n. Great work Nik.\n. Hey @Agamennon,\n value property can be manipulated, but if you use value property it becomes controlled component, check this for detailed explanation: http://nikgraf.github.io/belle/#/guide/form-components. Please let me know if that needs more clarity.\nBelle supports most of standard events, can you please let us know which specific ones do you find missing.\n. Yeh ur right Nik, though a workaround could be that we call onChange from onUpdate.\n. Hey Nik,\nShould we enhance our code to take care of onChange or should we suggest users to call onChange from onUpdate ?\n. Hey @luisrudge / @nikgraf ,\nI did looked into issue and thats apparently use of method 'isReactElement' in is-component-of-type.js\nReact RC candidate has got this method removed: https://github.com/facebook/react/pull/4652/files.\nThis needs to be fixed in belle.\n. Hey @luisrudge,\nThough select is working its showing this error while trying to reposition options (check http://nikgraf.github.io/belle/#/component/select, property: shouldPositionOptions).\nPR: https://github.com/nikgraf/belle/pull/207 has the fix.\n. Thanks @antipin :smile: \n. Good Job :+1: \n. Hey @alexfedoseev ,\nCan you plz specify some examples. It could be the case that the way we implemented inline styles, I mean which particular styling parameters like 'display', 'position', etc is creating trouble for you.\n~Jyoti\n. Thanks a lot @iansinnott\n. :+1: \n. I guess reason is that styles we are passing are overriding most of bootstrap styles. Yep make sense to hide it for bootstrap theme, or may be just get rid of it, re-sizing using props is too complex for anyone to use.\n. Cool, let me check.\nGood work :smile: \n. Hey Nik,\nI tried out changes in my project and one more small change was needed. I have done that and merging.\n. No @nikgraf, its done only for few components.\n. Hey Nik,\nPR looks good, I have some feedbacks which you can check. I am merging it.\n. Hey @nikgraf,\nThis PR has fix for month, year issue as discussed and some refactoring for onKeyDown method.\n. Good work.\n. Hey @nikgraf,\nSpinner is good its small, simple and very useful. I think its good enough to be merged and be part of 2.0. Do you want to work more on it or should I go ahead and merge it.\nA property could be configurable number of dots, but again thats a good to have thing not must have.\n. I agree, I mean giving out such minimal components and then looking for feedbacks to improve them can help us build more and more components and reduce un-necessary coding and features.\n. Looks good :+1: \n. Nice fix.\n. Looks good.\n. I thought you added some guy there :smile: \n. Hey @plandem, nice research on grid. A data grid is something I would love making as well :smile: \n. That's interesting @nikgraf, I will take a look at it today.\n. Fixed here: https://github.com/nikgraf/belle/pull/264\n. :+1: \n. Verified changes today, they look all good.\nI am still trying to understand why are binding a performance overhead.\nAlso at places I used fat arrow functions for event handling (in date picker) so that I can avoid binding. But then I am realizing that fat arrow functions are binding in themselves.\n. Changes look good Nik, but for broken build :worried: \n. Closing as it has wrong lib change.\n. ",
    "blakeembrey": "@nikgraf I would just remove postinstall. NPM will use the parent react version without trying to force it. The warning is only to say that installation won't happen automatically.\n. Yes, looking at the package.json and most scripts will give pain on Windows. The only relevant script for consumers is postinstall though, and trying to delete a local react module isn't something you really need to do anyway (it shouldn't even be installing locally there if someone is consuming it, hence peerDependency - perhaps it's left over from linking and trying to avoid duplicate react modules?). \n. @nikgraf I would just remove postinstall. NPM will use the parent react version without trying to force it. The warning is only to say that installation won't happen automatically.\n. Yes, looking at the package.json and most scripts will give pain on Windows. The only relevant script for consumers is postinstall though, and trying to delete a local react module isn't something you really need to do anyway (it shouldn't even be installing locally there if someone is consuming it, hence peerDependency - perhaps it's left over from linking and trying to avoid duplicate react modules?). \n. ",
    "ericmatthys": "In general, I find the \"one-time\" focus animation to be visually interesting at the cost of accessibility. It's too easy to lose track of what is focused when the style doesn't stick around.\n. I think accessibility should be promoted by making this behavior the default and save the flair to be shown off in a theme. Otherwise, it could be seen as encouraging questionable practices. The configurability to allow either is definitely nice though.\n. In general, I find the \"one-time\" focus animation to be visually interesting at the cost of accessibility. It's too easy to lose track of what is focused when the style doesn't stick around.\n. I think accessibility should be promoted by making this behavior the default and save the flair to be shown off in a theme. Otherwise, it could be seen as encouraging questionable practices. The configurability to allow either is definitely nice though.\n. ",
    "luisrudge": "\nLatest windows10 build (10240)\n. MS EDGE shows the icons just fine. They don't work on chrome. I messed up. Not sure why I sent a MS EDGE print screen :D\n. @nikgraf I loved this kit! Awesome!\n. please don't forget to add a date range picker :heart: \n. I tried a lot of date pickers. From a library consumer perspective, I ended up using this one: http://zippyui.com/react-date-picker/\nThe api is very simple and I created a date range picker on top of it pretty easily.\n. @dmitry awesome! Thanks! This is date picker is really great. It has range as well!\n. Here's an winjs (windows components) example:\nhttp://winjs.github.io/react-winjs/examples/address-book/index.html\n. any ETA on this PR? I just got bitten by this as well :)\n. Thanks @nikgraf and @jpuri!\n. Yes. Built-in style is the most important thing I can think of.\nI think the api should be something like this:\nhtml\n<List>\n  <ListItem title={'some description text'} icon={'path/to/icon'} text={'Item 1'} />\n  <ListItem title={'some description text'} image={'path/to/image'} text={'Item 2'} />\n</List>\n. Not sure if you prefer props or children.. This could have something like ListItemIcon or ListItemImage if you prefer to use children\n. ops, I just noticed material-ui has some code in there. But yeah, the api should be something like what they have\n. even #124 can benefit from this, since we can have a sidebar component with the menu being a list\n. Thanks folks!\n. Thanks @jpuri Belle is amazing!\n. Aweeeeeeeeesome! Thanks very much, all of you!\n. Ok, just found the problem. Not sure why, but belle is rendering the items on top of the select element. It's like the selected item is always centralized. Sorry! :)\n. Just found this. Sorry again!\n\n. I'd like to fix this issue when someone agrees with me that there's an issue. \n. Damn. Totally dupe of #161. SOrry!\n. Thanks for the feedback @jpuri \n. ok. I'll try that. thanks!\n. I'm still seeing an error. I updated my repro repo.\n\n. thaaaaaaaaaaaaaaaaaanks :)\n. @plandem no english docs?\n. \nLatest windows10 build (10240)\n. MS EDGE shows the icons just fine. They don't work on chrome. I messed up. Not sure why I sent a MS EDGE print screen :D\n. @nikgraf I loved this kit! Awesome!\n. please don't forget to add a date range picker :heart: \n. I tried a lot of date pickers. From a library consumer perspective, I ended up using this one: http://zippyui.com/react-date-picker/\nThe api is very simple and I created a date range picker on top of it pretty easily.\n. @dmitry awesome! Thanks! This is date picker is really great. It has range as well!\n. Here's an winjs (windows components) example:\nhttp://winjs.github.io/react-winjs/examples/address-book/index.html\n. any ETA on this PR? I just got bitten by this as well :)\n. Thanks @nikgraf and @jpuri!\n. Yes. Built-in style is the most important thing I can think of.\nI think the api should be something like this:\nhtml\n<List>\n  <ListItem title={'some description text'} icon={'path/to/icon'} text={'Item 1'} />\n  <ListItem title={'some description text'} image={'path/to/image'} text={'Item 2'} />\n</List>\n. Not sure if you prefer props or children.. This could have something like ListItemIcon or ListItemImage if you prefer to use children\n. ops, I just noticed material-ui has some code in there. But yeah, the api should be something like what they have\n. even #124 can benefit from this, since we can have a sidebar component with the menu being a list\n. Thanks folks!\n. Thanks @jpuri Belle is amazing!\n. Aweeeeeeeeesome! Thanks very much, all of you!\n. Ok, just found the problem. Not sure why, but belle is rendering the items on top of the select element. It's like the selected item is always centralized. Sorry! :)\n. Just found this. Sorry again!\n\n. I'd like to fix this issue when someone agrees with me that there's an issue. \n. Damn. Totally dupe of #161. SOrry!\n. Thanks for the feedback @jpuri \n. ok. I'll try that. thanks!\n. I'm still seeing an error. I updated my repro repo.\n\n. thaaaaaaaaaaaaaaaaaanks :)\n. @plandem no english docs?\n. ",
    "kof": "I am open for any improvements you might need.\n. CSS does basically override, react-native - extends. In CSS you would normally write the border first and then override only the left one. In react native the original order just doesn't matter. \nI think the last one is more intuitive and easy.\nIn jss this can be implemented as a plugin. Core of jss needs to stay slim and close to css.\n. As of implementation detail it can be a simple sort of props by inc length.\n. here you go) https://github.com/jsstyles/jss-props-sort\n. Well, some sort of roadmap with links to the issues and things already decided upon would be usefull.\n. Reactiflux moved from slack recently, I doubt they want to move again. Also chatgrape hasn't been tested with 10k sized communities yet.\n. I am open for any improvements you might need.\n. CSS does basically override, react-native - extends. In CSS you would normally write the border first and then override only the left one. In react native the original order just doesn't matter. \nI think the last one is more intuitive and easy.\nIn jss this can be implemented as a plugin. Core of jss needs to stay slim and close to css.\n. As of implementation detail it can be a simple sort of props by inc length.\n. here you go) https://github.com/jsstyles/jss-props-sort\n. Well, some sort of roadmap with links to the issues and things already decided upon would be usefull.\n. Reactiflux moved from slack recently, I doubt they want to move again. Also chatgrape hasn't been tested with 10k sized communities yet.\n. ",
    "alanrsoares": "Hi @jpuri \nI'm running on OSX Yosemite, node 0.12.0\nI'll try running 'npm start' on the root folder, thanks\n. Makes sense :)\nOn 17 July 2015 at 20:05, Jyoti Puri notifications@github.com wrote:\n\nDo it in this sequence:\ncd ~/belle\nnpm install\nnpm start\nNow you will be able to see a lib directory inside belle directory, now do:\ncd examples\nnpm install\nnpm start\nHope that will help and let us know if you still do not find any luck.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/issues/120#issuecomment-122210798.\n. Thank you. Indeed it wasn't working even after your instructions. I'll try\nwith the latest commits\n\nOn Saturday, 18 July 2015, Jyoti Puri notifications@github.com wrote:\n\nHey @alanrsoares https://github.com/alanrsoares,\nI could find there was really some issue with package.json which we were\nnot facing as our node_modules were already in place.\nI have pushed a new commit to fix that, please take latest.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/issues/120#issuecomment-122352718.\n. Working!\n. Thank you again, @jpuri. It was exactly that.\nShould be updated in the docs though.\n. That's great news. You guys rock!\nLooking forward to leave my contributions too.\n. @nikgraf, that's exactly the point. In my use case I managed to get it\nworking given the current constraints. But it felt quite hacky. Having to\nmanually tell on the onUpdate callback whether that was an input change or\nan option being selected.\n\nOn Tuesday, 21 July 2015, Nikolaus Graf notifications@github.com wrote:\n\n@jpuri https://github.com/jpuri I almost have it. A lot of people don't\nuse see/use it as an Input like the Google search rather then a Select with\nbetter UX for large sets of data. Think like the use-case of typeahead\nhttps://twitter.github.io/typeahead.js/. When someone searches for a\nTwitter user the onChange with typing is not helpful. What you want to know\nis if the user selected with typing or mouse click is in the list of the\navailable Options you provided. It's important because if you have a match\nyou can redirect to the profile. If it's not a match you don't want to do\nanything and let the user continue it's search.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/issues/135#issuecomment-122876115.\n. This might probably fix the scenario described in #140\n. Managed to get it working by forcing a complete re-render.\n\njavascript\nrender() {\n    if (!Object.keys(this.state.options).length) {\n      return (\n        <ComboBox\n          disabled={ true }\n          placeholder={ this.props.placeholder }\n          className={ this.props.className }\n          displayCaret={ true }>\n        </ComboBox>\n      );\n    }\n    return (\n      <div>\n        <ComboBox\n          disabled={ this.props.disabled }\n          placeholder={ this.props.placeholder }\n          className={ this.props.className }\n          displayCaret={ true }\n          enableHint={ true }\n          onUpdate={ this.handleUpdate.bind(this) }\n          defaultValue={ this.props.value }>\n          { this.renderOptions() }\n        </ComboBox>\n      </div>\n    );\n  }\n. Hi @jpuri \nI'm running on OSX Yosemite, node 0.12.0\nI'll try running 'npm start' on the root folder, thanks\n. Makes sense :)\nOn 17 July 2015 at 20:05, Jyoti Puri notifications@github.com wrote:\n\nDo it in this sequence:\ncd ~/belle\nnpm install\nnpm start\nNow you will be able to see a lib directory inside belle directory, now do:\ncd examples\nnpm install\nnpm start\nHope that will help and let us know if you still do not find any luck.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/issues/120#issuecomment-122210798.\n. Thank you. Indeed it wasn't working even after your instructions. I'll try\nwith the latest commits\n\nOn Saturday, 18 July 2015, Jyoti Puri notifications@github.com wrote:\n\nHey @alanrsoares https://github.com/alanrsoares,\nI could find there was really some issue with package.json which we were\nnot facing as our node_modules were already in place.\nI have pushed a new commit to fix that, please take latest.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/issues/120#issuecomment-122352718.\n. Working!\n. Thank you again, @jpuri. It was exactly that.\nShould be updated in the docs though.\n. That's great news. You guys rock!\nLooking forward to leave my contributions too.\n. @nikgraf, that's exactly the point. In my use case I managed to get it\nworking given the current constraints. But it felt quite hacky. Having to\nmanually tell on the onUpdate callback whether that was an input change or\nan option being selected.\n\nOn Tuesday, 21 July 2015, Nikolaus Graf notifications@github.com wrote:\n\n@jpuri https://github.com/jpuri I almost have it. A lot of people don't\nuse see/use it as an Input like the Google search rather then a Select with\nbetter UX for large sets of data. Think like the use-case of typeahead\nhttps://twitter.github.io/typeahead.js/. When someone searches for a\nTwitter user the onChange with typing is not helpful. What you want to know\nis if the user selected with typing or mouse click is in the list of the\navailable Options you provided. It's important because if you have a match\nyou can redirect to the profile. If it's not a match you don't want to do\nanything and let the user continue it's search.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/nikgraf/belle/issues/135#issuecomment-122876115.\n. This might probably fix the scenario described in #140\n. Managed to get it working by forcing a complete re-render.\n\njavascript\nrender() {\n    if (!Object.keys(this.state.options).length) {\n      return (\n        <ComboBox\n          disabled={ true }\n          placeholder={ this.props.placeholder }\n          className={ this.props.className }\n          displayCaret={ true }>\n        </ComboBox>\n      );\n    }\n    return (\n      <div>\n        <ComboBox\n          disabled={ this.props.disabled }\n          placeholder={ this.props.placeholder }\n          className={ this.props.className }\n          displayCaret={ true }\n          enableHint={ true }\n          onUpdate={ this.handleUpdate.bind(this) }\n          defaultValue={ this.props.value }>\n          { this.renderOptions() }\n        </ComboBox>\n      </div>\n    );\n  }\n. ",
    "ungerik": "On Sat, Jul 18, 2015 at 9:19 AM, Nikolaus Graf notifications@github.com\nwrote:\n\nShould the user be able to type characters? Do we show a warning or\nprevent it?\n\nIt's not necessary to allow characters except for comma dot etc. depending\non the number format.\nTo allow natural editing it is necessary to accept user input, that is not\na valid number temporarily.\nFor example imagine someone is editing: \"3.14\".\nHe may add a point at a different position: \"3.1.4\"\nAnd then remove the other point: \"31.4\"\nShould that be supported, or should the user be forced to remove the other\npoint first?\nOther cases are more easy to parse as valid numbers, even when digits are\nmissing: \".14\" and \"3.\" But in those cases the point must not be removed\nwhile editing (which would happen if you parse and reset the number to\nvalid float in a bound input field)\n. On Sat, Jul 18, 2015 at 9:19 AM, Nikolaus Graf notifications@github.com\nwrote:\n\nShould the user be able to type characters? Do we show a warning or\nprevent it?\n\nIt's not necessary to allow characters except for comma dot etc. depending\non the number format.\nTo allow natural editing it is necessary to accept user input, that is not\na valid number temporarily.\nFor example imagine someone is editing: \"3.14\".\nHe may add a point at a different position: \"3.1.4\"\nAnd then remove the other point: \"31.4\"\nShould that be supported, or should the user be forced to remove the other\npoint first?\nOther cases are more easy to parse as valid numbers, even when digits are\nmissing: \".14\" and \"3.\" But in those cases the point must not be removed\nwhile editing (which would happen if you parse and reset the number to\nvalid float in a bound input field)\n. ",
    "LucaColonnello": "Have someone a sketch or psd or jpeg for the ui?\n. Do you wanna a main navigation menu or a menu that can be placed in every navigation situation?\n. Have someone a sketch or psd or jpeg for the ui?\n. Do you wanna a main navigation menu or a menu that can be placed in every navigation situation?\n. ",
    "dmitry": "Most powerful react date picker: https://github.com/gpbl/react-day-picker\nI've checked around 5 different date pickers. This one is powerful, because it gives ability to a user modify dates depending on requirements, plus it has most powerful support of i18n (possible to push own localization keys into a component, instead of moment.js).\n. @luisrudge I've also tried a lot of date pickers, and found https://github.com/gpbl/react-day-picker very simple to read, to modify and implement a features. On the first sight looks like not possible to implement some features like range of dates, blocking dates etc., but after looking into the modifiers feature you can find out that the power of this date picker is huge. Also almost all the date pickers force you to use moment.js, but only this one gives you option to implement your own i18n interface.\n. Most powerful react date picker: https://github.com/gpbl/react-day-picker\nI've checked around 5 different date pickers. This one is powerful, because it gives ability to a user modify dates depending on requirements, plus it has most powerful support of i18n (possible to push own localization keys into a component, instead of moment.js).\n. @luisrudge I've also tried a lot of date pickers, and found https://github.com/gpbl/react-day-picker very simple to read, to modify and implement a features. On the first sight looks like not possible to implement some features like range of dates, blocking dates etc., but after looking into the modifiers feature you can find out that the power of this date picker is huge. Also almost all the date pickers force you to use moment.js, but only this one gives you option to implement your own i18n interface.\n. ",
    "bvleur": "@jpuri: I just retested and I was wrong. While debugging it seemed that has(properites, 'value') returned true before sanatizeInputProps and false afterwards, therefore I felt like it mutated properties. It was probably some error in my testing :)\nDo you want me to change the commit message?\n. Whoops. I've updated the patch again.\n. :+1: This fix seems to work for me. Thank you.\n. > Would it be possible that we miss a render (which should happen) due this change?\nfilteredOptions is a derivative of some props and state. It's value should be a pure function of value, children, filterFunc and maxOptions.\nWe could even make that explicit in the code by moving from a filteredOptions variable to a getFilteredOptions()-function. For performance reasons you should probably memoize that function.\nIf the statement above is correct then any change to the input of that function might cause filteredOptions to change and should cause a re-render. But because it's input is from state and props changes already cause the component to re-render, so we won't miss a render.\n. The reason I mentio the getFilteredOptions and memoizing alternative is mostly to explain how you could see it as derived state and why I think it is correct to not have it trigger a rerender by itself.\nThe alternative will probably only be slower if the \"is it cached\"-check is particulary heavy (which I don't think it is) but there is not real need to actually go that route, given that the current implementation (with this fix) works fine.\n. @jpuri: I just retested and I was wrong. While debugging it seemed that has(properites, 'value') returned true before sanatizeInputProps and false afterwards, therefore I felt like it mutated properties. It was probably some error in my testing :)\nDo you want me to change the commit message?\n. Whoops. I've updated the patch again.\n. :+1: This fix seems to work for me. Thank you.\n. > Would it be possible that we miss a render (which should happen) due this change?\nfilteredOptions is a derivative of some props and state. It's value should be a pure function of value, children, filterFunc and maxOptions.\nWe could even make that explicit in the code by moving from a filteredOptions variable to a getFilteredOptions()-function. For performance reasons you should probably memoize that function.\nIf the statement above is correct then any change to the input of that function might cause filteredOptions to change and should cause a re-render. But because it's input is from state and props changes already cause the component to re-render, so we won't miss a render.\n. The reason I mentio the getFilteredOptions and memoizing alternative is mostly to explain how you could see it as derived state and why I think it is correct to not have it trigger a rerender by itself.\nThe alternative will probably only be slower if the \"is it cached\"-check is particulary heavy (which I don't think it is) but there is not real need to actually go that route, given that the current implementation (with this fix) works fine.\n. ",
    "luandro": "That would be awesome! Thanks @jpuri\n. Thanks a lot for the update.\nSo far I'm using Toggle and Select components. Toggle seems to render fine, but Select discards my server-side render:\nWarning: React attempted to reuse markup in a container but the checksum was invalid. This generally means that you are using server rendering and the markup generated on the server was not what the client was expecting. React injected new markup to compensate which works but you have lost many of the benefits of server rendering. Instead, figure out why the markup being generated is different on the client or server:\n (client) id=\"belle-select-id-1\" data-reactid=\".jh\n (server) id=\"belle-select-id-2\" data-reactid=\".jh\n. It seems to be working perfectly now. Thank you very much for these beautiful components.\n. That would be awesome! Thanks @jpuri\n. Thanks a lot for the update.\nSo far I'm using Toggle and Select components. Toggle seems to render fine, but Select discards my server-side render:\nWarning: React attempted to reuse markup in a container but the checksum was invalid. This generally means that you are using server rendering and the markup generated on the server was not what the client was expecting. React injected new markup to compensate which works but you have lost many of the benefits of server rendering. Instead, figure out why the markup being generated is different on the client or server:\n (client) id=\"belle-select-id-1\" data-reactid=\".jh\n (server) id=\"belle-select-id-2\" data-reactid=\".jh\n. It seems to be working perfectly now. Thank you very much for these beautiful components.\n. ",
    "yzhiJun": "Warning: React attempted to reuse markup in a container but the checksum was invalid. This generally means that you are using server rendering and the markup generated on the server was not what the client was expecting. React injected new markup to compensate which works but you have lost many of the benefits of server rendering. Instead, figure out why the markup being generated is different on the client or server:\n (client) id=\"belle-select-id-1\" data-reactid=\".jh\n (server) id=\"belle-select-id-2\" data-reactid=\".jh\nI also has issue when doing server-side rendering, just add the id property to the component will fixed that.\nIn server-side rendering, Everytime create the select component will cause belle-select-id-${uniqueId()} plus 1:\nhttps://github.com/nikgraf/belle/blob/master/src/components/Select.js#L243\n. @jpuri @nikgraf \nWow, so quickly respond,  I just upgrade to 2.0.3 and it works perfectly now :+1: \nThank you for your great project.\n. Warning: React attempted to reuse markup in a container but the checksum was invalid. This generally means that you are using server rendering and the markup generated on the server was not what the client was expecting. React injected new markup to compensate which works but you have lost many of the benefits of server rendering. Instead, figure out why the markup being generated is different on the client or server:\n (client) id=\"belle-select-id-1\" data-reactid=\".jh\n (server) id=\"belle-select-id-2\" data-reactid=\".jh\nI also has issue when doing server-side rendering, just add the id property to the component will fixed that.\nIn server-side rendering, Everytime create the select component will cause belle-select-id-${uniqueId()} plus 1:\nhttps://github.com/nikgraf/belle/blob/master/src/components/Select.js#L243\n. @jpuri @nikgraf \nWow, so quickly respond,  I just upgrade to 2.0.3 and it works perfectly now :+1: \nThank you for your great project.\n. ",
    "markdalgleish": "Author of react-themeable here. Happy to help out, if this is something you'd like to do.\n. Author of react-themeable here. Happy to help out, if this is something you'd like to do.\n. ",
    "lapanoid": "I guess there is no example how to use belle with react-themeable, right? I guess the main discussion continues here https://github.com/nikgraf/future-react-ui/issues/1 and react-themeable highly recomended, @nikgraf could you give an update on this here?\n. I guess there is no example how to use belle with react-themeable, right? I guess the main discussion continues here https://github.com/nikgraf/future-react-ui/issues/1 and react-themeable highly recomended, @nikgraf could you give an update on this here?\n. ",
    "nickcox": "Super keen to see where you're going with this too.. Super keen to see where you're going with this too.. ",
    "chrisvariety": "Workaround for now: [<Placeholder>Foo bar</Placeholder>].concat(options.map(...))\n. Workaround for now: [<Placeholder>Foo bar</Placeholder>].concat(options.map(...))\n. ",
    "andreychev": "@nikgraf @jpuri good job, thx :)\n. @jpuri @nikgraf yeah :)\n. @nikgraf @jpuri good job, thx :)\n. @jpuri @nikgraf yeah :)\n. ",
    "ianobermiller": "This isn't a Radium bug; belle should never manipulate this.props.children directly (e.g. by expecting it to be an array). Only the React.Children helpers should be used: https://facebook.github.io/react/docs/top-level-api.html#react.children.\n(I mentioned the same thing in https://github.com/FormidableLabs/radium/issues/317)\n. :+1: \n. What are the use cases for filtering/splicing children? I don't even think you need to have children as an array for propTypes checks, as in validateChildrenAreOptionsAndMaximumOnePlaceholder (in Select), since you can just do the check while iterating using React.Children.forEach.\n. This isn't a Radium bug; belle should never manipulate this.props.children directly (e.g. by expecting it to be an array). Only the React.Children helpers should be used: https://facebook.github.io/react/docs/top-level-api.html#react.children.\n(I mentioned the same thing in https://github.com/FormidableLabs/radium/issues/317)\n. :+1: \n. What are the use cases for filtering/splicing children? I don't even think you need to have children as an array for propTypes checks, as in validateChildrenAreOptionsAndMaximumOnePlaceholder (in Select), since you can just do the check while iterating using React.Children.forEach.\n. ",
    "andreypopp": "Hey @nikgraf, would be interesting to know what are you missing from react-textarea-autosize not to reuse its code in Belle?\n. The one described in this article feels good: http://miksovsky.blogs.com/flowstate/2010/10/reconsidering-stock-controls-to-create-an-optimized-user-experience.html\n. Hey @nikgraf, would be interesting to know what are you missing from react-textarea-autosize not to reuse its code in Belle?\n. The one described in this article feels good: http://miksovsky.blogs.com/flowstate/2010/10/reconsidering-stock-controls-to-create-an-optimized-user-experience.html\n. ",
    "namuol": "Yeah I'm using beta3 and I'd expect most people using 0.14 to be on that version as well. :+1: \n. Awesome! Thank you so much. :beers:\n. Yeah I'm using beta3 and I'd expect most people using 0.14 to be on that version as well. :+1: \n. Awesome! Thank you so much. :beers:\n. ",
    "iansinnott": "Thanks @nikgraf. Yeah I totally understand if you thought the additional complexity of adding a size prop wasn't worth it. I read through your docs as well, but what made me think of a this feature was that many of the styles are related to eachother to bring the final look together. \nIf all it were possible to pass something like <Toggle scale={0.5} /> and get a component that was half as wide and half as tall that would be very useful, and would probably help with adoption. I'm not sure how your styles are calculated now but if it were possible to just multiply all the relevant size styles by this.props.scale that might be a less complex solution.\nThanks for the cool lib \n. Absolutely. Let's connect over email and figure out a time that works. I'm at ian@iansinnott.com\n. It might be useful to add a note somewhere more general in the docs to remind people about CSS transforms. It's one of those things that people generally don't use very often so we tend to forget.\nDocs: CSS Transforms\n. Happy to help. When I first found Belle I completely forgot about transforms and this would have been exactly what I needed :grin:\n. Thanks @nikgraf. Yeah I totally understand if you thought the additional complexity of adding a size prop wasn't worth it. I read through your docs as well, but what made me think of a this feature was that many of the styles are related to eachother to bring the final look together. \nIf all it were possible to pass something like <Toggle scale={0.5} /> and get a component that was half as wide and half as tall that would be very useful, and would probably help with adoption. I'm not sure how your styles are calculated now but if it were possible to just multiply all the relevant size styles by this.props.scale that might be a less complex solution.\nThanks for the cool lib \n. Absolutely. Let's connect over email and figure out a time that works. I'm at ian@iansinnott.com\n. It might be useful to add a note somewhere more general in the docs to remind people about CSS transforms. It's one of those things that people generally don't use very often so we tend to forget.\nDocs: CSS Transforms\n. Happy to help. When I first found Belle I completely forgot about transforms and this would have been exactly what I needed :grin:\n. ",
    "Agamennon": "I am trying to use redux-forms , it uses the other standard events too, onUpdate is not enough, for instance i think <TextInput />  value propriety cannot be manipulated, so when a new value comes in it does not update. by the way you are doing a awesome work! \n. @erikas @nikgraf, Thanks!,  will do, i am out of town up until next week, i will report back as soon as i come back.\n. I am trying to use redux-forms , it uses the other standard events too, onUpdate is not enough, for instance i think <TextInput />  value propriety cannot be manipulated, so when a new value comes in it does not update. by the way you are doing a awesome work! \n. @erikas @nikgraf, Thanks!,  will do, i am out of town up until next week, i will report back as soon as i come back.\n. ",
    "erikras": "@Agamennon, try redux-form v1.7.0.\n. Finally got around to upgrading. ❤️ @nikgraf!!. @Agamennon, try redux-form v1.7.0.\n. Finally got around to upgrading. ❤️ @nikgraf!!. ",
    "alexfedoseev": "Hey @jpuri, sorry for the long answer.\nI have common use-case: for example I'm using SASS (Stylus, PostCSS, whatever) to manage my styles. In these envs I have variables, mixins & base classes, which I'm using to extend my local styles across the app. So in this case I must duplicate all these things to include them as inline styles. If it were possible to use classNames instead, I'd just extend new class inside css module and apply it to belle component.\nAnd actually I like the idea of managing styles in stylesheets using css-modules, outside of markup and jsx, where long styles become pretty noisy.\n. @nikgraf My turn to apologize for late reply. It's really awesome news about class based system!\nAccording to contribution: due to my current workload on current company's and oss projects I'm veeeery slow (+ I started messing around with ClojureScript also), so I can help with some not too big improvements, which are not blockers for something.\nAnd about react-themeable: I haven't tried it and, after a quick look, I have no opinion on it really :)\n. Hey @jpuri, sorry for the long answer.\nI have common use-case: for example I'm using SASS (Stylus, PostCSS, whatever) to manage my styles. In these envs I have variables, mixins & base classes, which I'm using to extend my local styles across the app. So in this case I must duplicate all these things to include them as inline styles. If it were possible to use classNames instead, I'd just extend new class inside css module and apply it to belle component.\nAnd actually I like the idea of managing styles in stylesheets using css-modules, outside of markup and jsx, where long styles become pretty noisy.\n. @nikgraf My turn to apologize for late reply. It's really awesome news about class based system!\nAccording to contribution: due to my current workload on current company's and oss projects I'm veeeery slow (+ I started messing around with ClojureScript also), so I can help with some not too big improvements, which are not blockers for something.\nAnd about react-themeable: I haven't tried it and, after a quick look, I have no opinion on it really :)\n. ",
    "plandem": "hey, it sounds great about 3 month of full time - really bright future.\n1) about grid, i saw and try alot of js grids, but my experience tells me that in 80% you will need common table with sorting, paging, actions (e.g. last column with buttons), template for row/cell output, columns setup (e.g. cols/rowspan, multiline columns) and some kind of 'bulk actions' - like checkbox all rows and etc. \n2) Yes, often grids also needs a filter, but in most cases it's only at demo you can see built-in filter in columns, but in real world it's almost useless and you will need more complex way to filter data, like few criteria for same attribute of model (with differ operand OR/AND). So in most cases i had to create from ground a external filter for grid and exclude built-in filters. So for that feature i would think about separate component with ability to \"bind\" to grid.\n3) More advanced grids also let you to use some column settings, e.g.: resize, show/hide and etc, BUT it's like extra feature that can be missed, but not critical.\n4) some advanced grids also let you inline editing, but my experience tells me that in real world, in most cases it's better to edit via external editor, maybe at modal window. \n5) server-side integration to get data from server\n6) maybe it's good idea to think about 'data provider' that can be used at data related components - select, grids, suggest, forms and etc.\nSo i would like to stick with features from (1) and (5) and maybe (6)\nP.S.: of course serve-side integration for grid is must have feature.\nP.P.S.: Ok, i will wait till draft of 3.0.0 and \"test component\" to join :)\n. Here is example of possible filter. That what i meant - it can be quite complex and 'built-in' simple filters will: a) not enough, b) quite ugly, c)not so easy to integrate with design\nhttps://www.dropbox.com/s/ca6ky57t1zjcvy7/Screenshot%202015-12-07%2016.03.52.png?dl=0\n. i recommend to look at: https://github.com/ant-design/ant-design\ni sticked to this library finally.\n. they are working on it. They just released v1.0 recently. But for me google translate and official site were enough:\nhttp://ant.design/#/docs/react/introduce\n. done\n. hey, it sounds great about 3 month of full time - really bright future.\n1) about grid, i saw and try alot of js grids, but my experience tells me that in 80% you will need common table with sorting, paging, actions (e.g. last column with buttons), template for row/cell output, columns setup (e.g. cols/rowspan, multiline columns) and some kind of 'bulk actions' - like checkbox all rows and etc. \n2) Yes, often grids also needs a filter, but in most cases it's only at demo you can see built-in filter in columns, but in real world it's almost useless and you will need more complex way to filter data, like few criteria for same attribute of model (with differ operand OR/AND). So in most cases i had to create from ground a external filter for grid and exclude built-in filters. So for that feature i would think about separate component with ability to \"bind\" to grid.\n3) More advanced grids also let you to use some column settings, e.g.: resize, show/hide and etc, BUT it's like extra feature that can be missed, but not critical.\n4) some advanced grids also let you inline editing, but my experience tells me that in real world, in most cases it's better to edit via external editor, maybe at modal window. \n5) server-side integration to get data from server\n6) maybe it's good idea to think about 'data provider' that can be used at data related components - select, grids, suggest, forms and etc.\nSo i would like to stick with features from (1) and (5) and maybe (6)\nP.S.: of course serve-side integration for grid is must have feature.\nP.P.S.: Ok, i will wait till draft of 3.0.0 and \"test component\" to join :)\n. Here is example of possible filter. That what i meant - it can be quite complex and 'built-in' simple filters will: a) not enough, b) quite ugly, c)not so easy to integrate with design\nhttps://www.dropbox.com/s/ca6ky57t1zjcvy7/Screenshot%202015-12-07%2016.03.52.png?dl=0\n. i recommend to look at: https://github.com/ant-design/ant-design\ni sticked to this library finally.\n. they are working on it. They just released v1.0 recently. But for me google translate and official site were enough:\nhttp://ant.design/#/docs/react/introduce\n. done\n. ",
    "tonyxiao": "Do you have any plans to use something like Radium to handle inline styles rather than using the functions in inject-style.js file?\n. Do you have any plans to use something like Radium to handle inline styles rather than using the functions in inject-style.js file?\n. ",
    "vcarl": "Gitter or a channel on Freenode are both good options. \n. Can also point people to the general or need-help channel, if traffic picks up can make the channel again. I don't want to imply that Discord isn't for library chatter, it just has really bad discoverability.\n. Gitter or a channel on Freenode are both good options. \n. Can also point people to the general or need-help channel, if traffic picks up can make the channel again. I don't want to imply that Discord isn't for library chatter, it just has really bad discoverability.\n. ",
    "ryyppy": "Hey, I extended the linting config to prevent this kind of issues...\nMaybe this is useful.\n. Naturally, CI linting process will fail since you still have .only suffixes in there... ironically this proves that the config is working ;-)\n. Hey, I extended the linting config to prevent this kind of issues...\nMaybe this is useful.\n. Naturally, CI linting process will fail since you still have .only suffixes in there... ironically this proves that the config is working ;-)\n. ",
    "rchanou": "I also got this for certain toggles, though I haven't been able to isolate why. It seems to happen specifically in Chrome; Firefox and Edge show fine. The fix also works when applied via JS:\njavascript\nconst toggleFixStyle = {\n  WebkitMaskImage: 'url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAIAAACQd1PeAAAAGXRFWHRTb2Z0d2FyZQBBZG9iZSBJbWFnZVJlYWR5ccllPAAAAA5JREFUeNpiYGBgAAgwAAAEAAGbA+oJAAAAAElFTkSuQmCC)'\n};\n...\n<div>\n  <Toggle /> {/* masking messed up */}\n  <Toggle style={toggleFixStyle} /> {/* masking fixed */}\n</div>\n. All right, it has to do with adjacent elements that have -webkit-backface-visibility: hidden. Here's a simple test case:\njavascript\n<div>\n  <Toggle />\n  <div style={{ WebkitBackfaceVisibility: 'hidden' }} />\n</div>\nThe toggle should have bugged masking. Removing -webkit-backface-visibility: hidden via the inspector fixes it.\n. Probably just a Chrome bug we'll have to deal with.\n. I don't know, I removed the offending -webkit-backface-visibility: hidden a while ago. Unless @bradennapier wants to chime in, I would say go ahead and close this because it appears to be a Chrome issue (which may be fixed by now), it's a rare case, and there's a documented workaround.. I also got this for certain toggles, though I haven't been able to isolate why. It seems to happen specifically in Chrome; Firefox and Edge show fine. The fix also works when applied via JS:\njavascript\nconst toggleFixStyle = {\n  WebkitMaskImage: 'url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAIAAACQd1PeAAAAGXRFWHRTb2Z0d2FyZQBBZG9iZSBJbWFnZVJlYWR5ccllPAAAAA5JREFUeNpiYGBgAAgwAAAEAAGbA+oJAAAAAElFTkSuQmCC)'\n};\n...\n<div>\n  <Toggle /> {/* masking messed up */}\n  <Toggle style={toggleFixStyle} /> {/* masking fixed */}\n</div>\n. All right, it has to do with adjacent elements that have -webkit-backface-visibility: hidden. Here's a simple test case:\njavascript\n<div>\n  <Toggle />\n  <div style={{ WebkitBackfaceVisibility: 'hidden' }} />\n</div>\nThe toggle should have bugged masking. Removing -webkit-backface-visibility: hidden via the inspector fixes it.\n. Probably just a Chrome bug we'll have to deal with.\n. I don't know, I removed the offending -webkit-backface-visibility: hidden a while ago. Unless @bradennapier wants to chime in, I would say go ahead and close this because it appears to be a Chrome issue (which may be fixed by now), it's a rare case, and there's a documented workaround.. ",
    "mattikl": "Hi @nikgraf, that's all very interesting. I haven't seen enough real-life usage to really compare the different techniques, but that's sounds like a good approach for Belle 3.\nSo rather than trying to optimize Belle 2's ad hoc styling, I'll wait for Belle 3 development to start and hope to help you out with that.\n. Hi @nikgraf, that's all very interesting. I haven't seen enough real-life usage to really compare the different techniques, but that's sounds like a good approach for Belle 3.\nSo rather than trying to optimize Belle 2's ad hoc styling, I'll wait for Belle 3 development to start and hope to help you out with that.\n. ",
    "mkusher": "@nikgraf ok, will try to add some soon\n. @nikgraf ok, will try to add some soon\n. ",
    "johannesnagl": "\nany recommendations?\n\nChrome's built-in timepicker (<input type=\"time\">) is the best one I've ever found in the internet. \n. > any recommendations?\nChrome's built-in timepicker (<input type=\"time\">) is the best one I've ever found in the internet. \n. ",
    "bradennapier": "I am not sure where to start on it.  Another bug has popped up as well in the newest version of React I am about to report.  Placeholder no longer seems to do anything \n. I am not sure where to start on it.  Another bug has popped up as well in the newest version of React I am about to report.  Placeholder no longer seems to do anything \n. ",
    "GenZai": "@mars Thanks your solution works for me.. @tconroy I'm using Meteor Framework, on Ubuntu 17.04 Firefox and chromium. @mars Thanks your solution works for me.. @tconroy I'm using Meteor Framework, on Ubuntu 17.04 Firefox and chromium. ",
    "tconroy": "I'm unable to reproduce this issue on OSX/Chrome. . @nikgraf: https://github.com/nikgraf/belle/pull/341. @cezarneaga Very cool! Major +1 on styled components 👍 \nThis project seems pretty small ( at least currently ) to warrant Lerna. Would be interested to hear more about your plans!\nI'm looking for more OSS projects to contribute to, so if you're looking for extra hands, feel free to hit me up! . I'm unable to reproduce this issue on OSX/Chrome. . @nikgraf: https://github.com/nikgraf/belle/pull/341. @cezarneaga Very cool! Major +1 on styled components 👍 \nThis project seems pretty small ( at least currently ) to warrant Lerna. Would be interested to hear more about your plans!\nI'm looking for more OSS projects to contribute to, so if you're looking for extra hands, feel free to hit me up! . ",
    "cezarneaga": "its no longer there. checked again. you can close the issue. i should have taken a screenshot. :)\n. @nikgraf was looking for maintainers a couple of weeks ago. not sure he still has time for belle :)\na bit busy this week but will try something this weekend maybe. yeap! you are right!\nif in SelectItem.js i change to onMouseDown i get:\n```\n ● Select › should be able to provide a valueLink\nexpect(received).toBeTruthy()\n\nExpected value to be truthy, instead received\n  false\n\n  at Object.<anonymous> (src/__tests__/Select-test.js:192:23)\n\n● Select › should be able to provide a onUpdate callback\nexpect(received).toBeTruthy()\n\nExpected value to be truthy, instead received\n  false\n\n  at Object.<anonymous> (src/__tests__/Select-test.js:208:23)\n\n● Select › should change the selectedValue & focusedOptionValue on selection\nexpect(received).toBe(expected)\n\nExpected value to be (using ===):\n  \"vienna\"\nReceived:\n  \"rome\"\n\n  at Object.<anonymous> (src/__tests__/Select-test.js:222:40)\n\n```\nneed to see why. will get back if i find the cause.\nC. you didn't miss it. if you did miss it, then so did i. \nhow do you see this working?. Hi @manpenaloza,\ncould you fix the failing tests?\nthanks for the PR!\nCezar. Nik still keeps it running with new react versions. I have started a version 4 but progress is slow. We’re thinking of using Lerna, styled components, and some other goodies. I have limited time and Nik not much either. . its no longer there. checked again. you can close the issue. i should have taken a screenshot. :)\n. @nikgraf was looking for maintainers a couple of weeks ago. not sure he still has time for belle :)\na bit busy this week but will try something this weekend maybe. yeap! you are right!\nif in SelectItem.js i change to onMouseDown i get:\n```\n ● Select › should be able to provide a valueLink\nexpect(received).toBeTruthy()\n\nExpected value to be truthy, instead received\n  false\n\n  at Object.<anonymous> (src/__tests__/Select-test.js:192:23)\n\n● Select › should be able to provide a onUpdate callback\nexpect(received).toBeTruthy()\n\nExpected value to be truthy, instead received\n  false\n\n  at Object.<anonymous> (src/__tests__/Select-test.js:208:23)\n\n● Select › should change the selectedValue & focusedOptionValue on selection\nexpect(received).toBe(expected)\n\nExpected value to be (using ===):\n  \"vienna\"\nReceived:\n  \"rome\"\n\n  at Object.<anonymous> (src/__tests__/Select-test.js:222:40)\n\n```\nneed to see why. will get back if i find the cause.\nC. you didn't miss it. if you did miss it, then so did i. \nhow do you see this working?. Hi @manpenaloza,\ncould you fix the failing tests?\nthanks for the PR!\nCezar. Nik still keeps it running with new react versions. I have started a version 4 but progress is slow. We’re thinking of using Lerna, styled components, and some other goodies. I have limited time and Nik not much either. . ",
    "Bunkerbewohner": "I don't know about more updates, but imho we don't have to worry about that warning. The code that uses the PropTypes validation is there only to print more helpful error messages (it's a custom PropType validator using the built-in ones). So worst case that part is removed and you get the \"plain\" React error messages when passing something wrong for Toggle's children.\n. I don't know about more updates, but imho we don't have to worry about that warning. The code that uses the PropTypes validation is there only to print more helpful error messages (it's a custom PropType validator using the built-in ones). So worst case that part is removed and you get the \"plain\" React error messages when passing something wrong for Toggle's children.\n. ",
    "HugoHeneault": "Any ideas on this? :)\n. Any ideas on this? :)\n. ",
    "mcbryant": "I gave this and other similar issues a shot.\n. This fixes allowNewLine on <textarea />, but similar issues also exist for other properties in other components. I gave the other properties a shot across the repo.\n. Note: This can be applied to the v3 branch with small changes. I'll make a PR once this is merged.\n. I'm definitely interested! Thank you for your consideration, and I'll see what I can do!\n. I'm interested in fixing this!\nRegarding your suggestions, @felix-d:\n- React confusingly treats \"key\" differently from other props. You can't access it from this.props.\n- An \"id\" prop would absolutely solve this issue! It would be a bit painful to require an \"id\" (or similar) prop for every component when you want server side rendering, though.\nHere's two similar ways of solving this:\n- We could make style IDs based on a hash of the computed style. Multiple components with the same style would have the same hash, and we would have to update the hash whenever the style changes. We would need to reference count each hash globally. I'm not sure what having to change class names when styles change would do for performance. Hopefully, not much?\n- We could generate hashes after the component mounts. The downside here is we would have to either manually add class names or rerender, neither of which seem quite \"right\".\nI'd be interested in implementing the style-hash ID approach. Am I missing another way? Thoughts, @felix-d and @nikgraf?\n. I gave this and other similar issues a shot.\n. This fixes allowNewLine on <textarea />, but similar issues also exist for other properties in other components. I gave the other properties a shot across the repo.\n. Note: This can be applied to the v3 branch with small changes. I'll make a PR once this is merged.\n. I'm definitely interested! Thank you for your consideration, and I'll see what I can do!\n. I'm interested in fixing this!\nRegarding your suggestions, @felix-d:\n- React confusingly treats \"key\" differently from other props. You can't access it from this.props.\n- An \"id\" prop would absolutely solve this issue! It would be a bit painful to require an \"id\" (or similar) prop for every component when you want server side rendering, though.\nHere's two similar ways of solving this:\n- We could make style IDs based on a hash of the computed style. Multiple components with the same style would have the same hash, and we would have to update the hash whenever the style changes. We would need to reference count each hash globally. I'm not sure what having to change class names when styles change would do for performance. Hopefully, not much?\n- We could generate hashes after the component mounts. The downside here is we would have to either manually add class names or rerender, neither of which seem quite \"right\".\nI'd be interested in implementing the style-hash ID approach. Am I missing another way? Thoughts, @felix-d and @nikgraf?\n. ",
    "tuarrep": "@mcbryant Nice! I close this one in favor of yours (#323)\n. @nikgraf Thank for your consideration. But I don't think I have enough time to contribute efficiently to your package.\nWhen I find something weird I try to fix it and I create a PR. But I have no time to develop feature and enhancements \n. @mcbryant Nice! I close this one in favor of yours (#323)\n. @nikgraf Thank for your consideration. But I don't think I have enough time to contribute efficiently to your package.\nWhen I find something weird I try to fix it and I create a PR. But I have no time to develop feature and enhancements \n. ",
    "felix-d": "@mcbryant \n\nAn \"id\" prop would absolutely solve this issue! It would be a bit painful to require an \"id\" (or similar) prop for every component when you want server side rendering, though.\n\nThis is what Material UI does AFAIK. \nThe hashing solution seems like a good idea but it's more complex. I'd go with the id solution first to fix the issue, and then maybe think about an alternative solution that involves hashing, but the id solution is quite viable and solid 👍 Simple is always better than complex 😄 \nGood reasoning!\n. @mcbryant \n\nAn \"id\" prop would absolutely solve this issue! It would be a bit painful to require an \"id\" (or similar) prop for every component when you want server side rendering, though.\n\nThis is what Material UI does AFAIK. \nThe hashing solution seems like a good idea but it's more complex. I'd go with the id solution first to fix the issue, and then maybe think about an alternative solution that involves hashing, but the id solution is quite viable and solid 👍 Simple is always better than complex 😄 \nGood reasoning!\n. ",
    "ig43": "Yup - I've just run into exactly the same issue, after having done npm update. I'm using Webpack, so will see if I can set up an alias to point to the correct directory.. Hi Nik,\nMany thanks for getting in touch with an update on status.\nFrom my point of view, I have temporarily worked around it, simply by creating an alias in webpack.config.js. So it’s only a minor issue.\nI must say that you have done a fantastic job with Belle. I evaluated several UI libraries, such as MaterialUI etc., but Belle for me was the best and well documented.\nSo I owe you a big thank you!!\nKind regards,\nIan\nIan Gillingham\nSenior Electronic Systems Engineer\nDiamond Light Source\nDH G.01\nDidcot\nOxfordshire\nUK\nOX11 0DE\nTel: +44 (0)1235 778129\nFrom: Nik Graf [mailto:notifications@github.com]\nSent: 01 December 2016 23:26\nTo: nikgraf/belle\nCc: Gillingham, Ian (DLSLtd,RAL,TEC); Comment\nSubject: Re: [nikgraf/belle] Incompatible with React v15.4.0 (#330)\nI will update this over the next couple days … sorry for the delay\n—\nYou are receiving this because you commented.\nReply to this email directly, view it on GitHubhttps://github.com/nikgraf/belle/issues/330#issuecomment-264327273, or mute the threadhttps://github.com/notifications/unsubscribe-auth/AIFa8VL-S1KlJeewwgmWkiGfG6kW4WhJks5rD1dqgaJpZM4K2tZM. https://github.com/notifications/beacon/AIFa8ad5PgCaENGMtsML7K0aKaNldKKhks5rD1dqgaJpZM4K2tZM.gif\n-- \nThis e-mail and any attachments may contain confidential, copyright and or privileged material, and are for the use of the intended addressee only. If you are not the intended addressee or an authorised recipient of the addressee please notify us of receipt by returning the e-mail and do not use, copy, retain, distribute or disclose the information in or attached to the e-mail.\nAny opinions expressed within this e-mail are those of the individual and not necessarily of Diamond Light Source Ltd. \nDiamond Light Source Ltd. cannot guarantee that this e-mail or any attachments are free from viruses and we cannot accept liability for any damage which you may sustain as a result of software viruses which may be transmitted in or with the message.\nDiamond Light Source Limited (company no. 4375679). Registered in England and Wales with its registered office at Diamond House, Harwell Science and Innovation Campus, Didcot, Oxfordshire, OX11 0DE, United Kingdom\n. Yup - I've just run into exactly the same issue, after having done npm update. I'm using Webpack, so will see if I can set up an alias to point to the correct directory.. Hi Nik,\nMany thanks for getting in touch with an update on status.\nFrom my point of view, I have temporarily worked around it, simply by creating an alias in webpack.config.js. So it’s only a minor issue.\nI must say that you have done a fantastic job with Belle. I evaluated several UI libraries, such as MaterialUI etc., but Belle for me was the best and well documented.\nSo I owe you a big thank you!!\nKind regards,\nIan\nIan Gillingham\nSenior Electronic Systems Engineer\nDiamond Light Source\nDH G.01\nDidcot\nOxfordshire\nUK\nOX11 0DE\nTel: +44 (0)1235 778129\nFrom: Nik Graf [mailto:notifications@github.com]\nSent: 01 December 2016 23:26\nTo: nikgraf/belle\nCc: Gillingham, Ian (DLSLtd,RAL,TEC); Comment\nSubject: Re: [nikgraf/belle] Incompatible with React v15.4.0 (#330)\nI will update this over the next couple days … sorry for the delay\n—\nYou are receiving this because you commented.\nReply to this email directly, view it on GitHubhttps://github.com/nikgraf/belle/issues/330#issuecomment-264327273, or mute the threadhttps://github.com/notifications/unsubscribe-auth/AIFa8VL-S1KlJeewwgmWkiGfG6kW4WhJks5rD1dqgaJpZM4K2tZM. https://github.com/notifications/beacon/AIFa8ad5PgCaENGMtsML7K0aKaNldKKhks5rD1dqgaJpZM4K2tZM.gif\n-- \nThis e-mail and any attachments may contain confidential, copyright and or privileged material, and are for the use of the intended addressee only. If you are not the intended addressee or an authorised recipient of the addressee please notify us of receipt by returning the e-mail and do not use, copy, retain, distribute or disclose the information in or attached to the e-mail.\nAny opinions expressed within this e-mail are those of the individual and not necessarily of Diamond Light Source Ltd. \nDiamond Light Source Ltd. cannot guarantee that this e-mail or any attachments are free from viruses and we cannot accept liability for any damage which you may sustain as a result of software viruses which may be transmitted in or with the message.\nDiamond Light Source Limited (company no. 4375679). Registered in England and Wales with its registered office at Diamond House, Harwell Science and Innovation Campus, Didcot, Oxfordshire, OX11 0DE, United Kingdom\n. ",
    "themre": "there are some options:\n- have both month and year as a dropdown (like jquery UI datepicker)\n- year as input (for very large date range e.g. 1000 - 2017 ,much more convenient than dropdown)\n- there are some libs that have some popup panel inside datepicker with available years/months, but personally I don't prefer this style\ni think first options would be probably the most easy one to integrate and also the most UX friendly.. there are some options:\n- have both month and year as a dropdown (like jquery UI datepicker)\n- year as input (for very large date range e.g. 1000 - 2017 ,much more convenient than dropdown)\n- there are some libs that have some popup panel inside datepicker with available years/months, but personally I don't prefer this style\ni think first options would be probably the most easy one to integrate and also the most UX friendly.. ",
    "manpenaloza": "f... thx, i messed up some commits. Will close this one and send a new one.. f... thx, i messed up some commits. Will close this one and send a new one.. ",
    "kvolkovich-sc": "Yes. We use showroom in our company about 4 months in 20+ repositories .\nWe are very interested in further improvement and support.. Yes. We use showroom in our company about 4 months in 20+ repositories .\nWe are very interested in further improvement and support.. ",
    "elazzabi": "I'll take this\nEdit: Found a strange error, I'm working on it. I'll take this\nEdit: Found a strange error, I'm working on it. ",
    "modsushi": "Actually it works if I do \nReactDOM.findDOMNode(this.textFieldComponent).focus();\nBut would be nice if it can be done with out findDOMNode like material-ui text component.. Actually it works if I do \nReactDOM.findDOMNode(this.textFieldComponent).focus();\nBut would be nice if it can be done with out findDOMNode like material-ui text component.. ",
    "costagolub": "hey @nikgraf, sure, will make it . hey @nikgraf, sure, will make it . ",
    "eddiekollar": "@nikgraf Yes, I would be happy to.. @nikgraf Yes, I would be happy to.. "
}