{
    "soffes": "Something to solve crashes relating to tasks failing is definitely important. Your commit makes the textfield lose focus if the task fails or succeeds. I'll think on it.\n. The networking code delete the core data object if the create fails. Maybe delaying this the duration of the animation would solve this issue. Kinda hacky though :/\n. I like that approach @carsonmcdonald. I'll think on it.\n. Closing for now since this is more a discussion than code that can be merged. Thanks again for you effort!\n. Thanks so much! I can't thank you enough!\n. Thanks!\n. Awesome! Thanks so much for your work. I have some designs in mind. I'll get going on it soon.\n. I appreciate your effort on this. I had planned on merging, but got motivated on a plane and implemented it from scratch. Thanks though!\n. You don't have to do this. If you run rake setup, it will do all of this for you. Also, just for reference, you can do both of those with just git submodule update --init --recursive.\n. It's all good. Yay for recursive submodules :)\n. Like I said before, you just need to run rake setup like the instructions say to get going.\n. I've gone back an forth on this. I think you're probably right though.\n. Right. They did enable edit mode and then open settings. They never explicitly ended editing. They will most likely want to end editing after viewing settings so I think it's the right interaction.\n. I dig it. Thanks!\n. Glad you got it.\n. Instead of adding all of that HTML, is there way to add those resources as a submodule?\n. Sorry @moredip, could you send a separate pull request so all of those assets don't stay in the git history? Sorry to be annoying, but keeping clones fast is important.\n. <3 <3 <3\n. Can you edit the readme with instructions how to run it? Thanks!\n. Thanks so much for fixing this!\nDo you think you could rebase those commits? :)\n. Thanks!\n. Thanks for this. There is actually an API for hiding the shadow besides clips to bounds. Mind using respondsToSelector and switching it out?\n. Looks good. Thanks man.\n. Looks great. Could you pull from master so it can automatically merge? Also could you remove the PSD from your pull request. Don't want to clutter git with big binary files. If you want to send it to sam@cheddarapp.com though, that would be awesome :)\n. Thanks so much for your work on this! Love the icon! I might tweak it a bit (to use the Cheddar blue used elsewhere).\nThis is a very welcome addition. Thanks again.\n. Good call!\n. Love it! Thanks so much!\n. Thanks! I appreciate it. I know it doesn't have any effect, but clarity is always good.\n. I'm actually going to implement this similar to how it works on the web with little badges. Thanks though!\n. Good call. Thanks!\n. This repo is no longer maintained.\n. It is supposed to be an error as the instructions say since you are intended to change it.\nAlso this repo is no longer maintained.\n. ",
    "Benuuu": "Would it be more appropriate to animate when the task is created with success?\n. ",
    "carsonmcdonald": "@Benuuu I don't think that would work. The user needs to see the animation right after the action. It is hard to solve the failure case in a easy way. The failure could be temporary for example. A more comprehensive fix would probably be separating the local data storage from the network sync but that is a larger task.\n. It does seem a little hacky because you are introducing another bit of information to the outside caller. \nAnother option I thought about before the reload here was a \"has it failed yet\" flag. The only issue is that there could be a race between the failure happening and the final failure block getting called since the final failure block gets called after the task is deleted. Maybe it would be less hacky to have the failure block execute before the task is deleted and then just have a flag that checks for failure in the animation block. To be complete it would need to be synchronized around the table insert but that shouldn't be too big of an issue. Thoughts? The callback could actually be called pre and post delete if needed (could just pass a flag that says what stage it is being called at).\n. @samsoffes For what it is worth I made the changes in my local repo and it seemed to work. I would have made another pull request but I was being lazy because moving the callback was a change to a different repo. If you are interested let me know and I'll send a different pull.\n. ",
    "biznickman": "Whoops ... I did not see that one ... the just saw it now ... was about to close\n. ",
    "rhysforyou": "I think it's less about what's the objectively best approach and more\nabout conforming to the expectations users have built up from using\nother apps.\nOn 06/08/2012, at 4:57 PM, Sam Soffes\nreply@reply.github.com\nwrote:\n\nI've gone back an forth on this. I think you're probably right though.\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/nothingmagical/cheddar-ios/pull/50#issuecomment-7517797\n. Yeah. It's not like they tapped the edit button with the intention of\nmaking any edits. It's just an intermediate step in accessing the\nsettings.\n\n—Rhys Powell\nOn 06/08/2012, at 5:04 PM, Sam Soffes\nreply@reply.github.com\nwrote:\n\nRight. They did enable edit mode and then open settings. They never explicitly ended editing. They will most likely want to end editing after viewing settings so I think it's the right interaction.\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/nothingmagical/cheddar-ios/pull/50#issuecomment-7517880\n. Also wow is my git history a mess, I should probably read Pro Git or something.\n. Yeah sure, I'm on a train right now but I'll do it when I get to university.\n. There you go, all fixed up\n. I was going to mention that I'd like a backtick key, good to see someone's already gone ahead and implemented it.\n. \n",
    "webdevotion": "When using the command with the --recursive option I get:\nFailed to recurse into submodule path 'Vendor/CheddarKit'\nDoing the clone ( without --recursive, submodule init, update manually makes everything succeed.\n. Tried command again, works now, after I ssh-added my keys.\n. ",
    "Diwann": "I got the same error, but because cucumber was not installed on my system. \nIf someone has the same problem, simply open a terminal and type : \nsudo gem install cucumber rake task \n(after having installed ruby gem of course)\n. ",
    "AndyBowskill": "I also get the Failed to recurse into submodule path 'Vendor/CheddarKit' error as well as for some other submodules, such as 'Vendor/SocketRocket' and 'CheddarKit/Vendor/Bully'.\nI have ruby, cucumber, etc. installed and have performed an ssh-add, please could someone point me in the right direction as to what I am missing?\n. ",
    "moredip": "Done\n. ",
    "nicolasgomollon": "I’m not sure which API you’re talking about, but Session Video 216 says to simply “Clip Subviews” on the navigation bar to hide its shadow.\n. Alright, should be ready for pulling now. I've sent you the DevIcons and I've removed all of the PSDs from the repo.\n. ",
    "aviell": "Looks good :)\nI actually changed the name as well ( I got 3 different environments).\nIF you want to support Push Notification in dev mode, you should add a new app with dev bundle name in the dev portal (and also direct the app to the dev api host).\n. ",
    "dhilipsiva": ":)\n. "
}