{
    "pedrovgs": "Hi!!\nIt's a known issue. When I created this repository I put a section inside the readme with some TODO. One of them is: \"Create other draggable component to resize elements instead of scale the view. This new component is needed to drag and resize videos\". \nI will do it if I have time or may be other developer could implement this feature and send me a pull request :)\n. Right now I don't have time to implement this feature. I'm waiting for a pull request from a buddy, but I don't know when is going to be ready. Sorry\n. Hi!\nI've released a new version of this library with the version number 1.1. This new version contains the fix to use VideoView with DraggableView class and resize the VideoView instead of scale it.\nThanks for your feedback!\n. You can build this project using maven or gradle, professional and most common build tools. I'm not going to support more build system, sorry. \n. What's your Gradle version? I'm using Gradle 1.11 and I don't have this problem compiling :S How do you reproduce it?\n. Hello?\n. @patelajay745 can you tell me how reproduce this error? I asked you about the gradle version you were using :)\n. What are you doing to get that error?\n. Build the application using Gradle. Clone this repository, follow README.md instructions to install YouTube player dependency and execute ./gradlew installDebug\n. ./gradlew build\n. If you execute ./gradlew build from your terminal inside the project directory you'll generate a build of the project.\nIf you execute ./gradlew installDebug you will instal the sample project into the phone/emulator detected by adb.\n. You should not try to compile this project using eclipse because the build tool used in this project is Gradle and eclipse doesn't support it as should. \nTo build this project you can import it using android studio or intelli j and press the play button or execute the command I told you in the previous comment. \n. Thanks!!! :)\n. Thanks!!!\n. Done :) Thanks!!\n. I don't understand your problem. Do you have any screenshot or any project uploaded to a public repository to see what's going on?\n. Bump!\n. In YoutubeSampleActivity we are using Fragments and is not supported. If you use youtube player view instead of youtube fragment and DraggableView instead of DraggablePanel this library is resizing the video properly.\n. Please...upload your project to a public repository to be able to review what's going on\n. Bump!\n. Please...upload your project to a public repository to be able to review what's going on\n. We are going to close all your problems in #17\n. @jayachandrakuruba we are trying to fix this issue, but I need to see your code to help you. My demo is working find :S. Can you give me access to your repository to take a look?\nFYI, I'll try to fix a similar issue reported by @manpreetsinghsodhi.\n. @jayachandrakuruba I've released a new version (Release 1.3) with some fixes. Can you review if your I've fixed your problem with this release?\n. @jayachandrakuruba I'm working to support orientation changes. Release 1.3 is working fine for you?\n. @jayachandrakuruba can you check if this branch or the previous release fix your problem? https://github.com/pedrovgs/DraggablePanel/tree/fix-video-view-sample-problems\n. @jayachandrakuruba can you upload a screenshot or video to review your problem?\n. @Fiddl3 is this issue related just to VideoPlayer?\n. Ok, thanks for your help!\n. You can change the fragment associated as top fragment using Android Fragment Manager yourself. I'll try to implement this feature to replace fragments. You can send me a pull request with this feature if you want.\n. I need to take a look to your code. Can you upload your project to any public repository or give mi access to take a look and help you with your problem?\n. @ngnclht1102 have you sent me an email?\n. We are going to close all your problems in #17\n. We are going to close all your problems in #17\n. We are going to close all your problems in #17 \n. Guys I was on holidays and I couldn't comment about this issues. Sorry.\nInstead of copy paste code modifications why don't you fork this project to your github and send me a pull request with your changes?\n@manpreetsinghsodhi  if you want some help, please upload your project to any repository and give me access. My mail is pedrovicente.gomez (at) gmail (dot) com. And I'll take a look.\nPlease, don't open more issues related with the same problem. I'm going to help you with this in this issue and close other issues opened by @manpreetsinghsodhi because every issue opened is related with the same problem.\n. I'll take a look this weekend. Thanks!\n. @Fiddl3 thanks! @manpreetsinghsodhi can you check if that version of the library is working for you?\n. @manpreetsinghsodhi  I've created a new branch with a ListView below DraggablePanel in YoutubeSampleActivity. It's working fine to me.\nhttps://github.com/pedrovgs/DraggablePanel/tree/manpreetsinghsodhi-issue17\n. @manpreetsinghsodhi I think I've found the bug. It's related with YouTube player view. This view is executing requestLayout when I still think my view was in other position :) I've changed onLayout method to fix this issue. Please, review if it's working for to and tell me to do a public release to maven central.\nThis is the branch: https://github.com/pedrovgs/DraggablePanel/tree/manpreetsinghsodhi-issue17\n. \\o/ Released and uploaded to Maven Central Repository in Release 1.3.\n. As Fiddl3 says, you can use setHorizontalAlphaEffectEnabled method to enable/disable this visual effect or use xml customization based on attrs. This library is going to apply that effect but some views are not going to support it, this is an Android bug and not a bug related with this library.\n. You need to configure your maven local repository to be able to provide that dependency. YouTube developers are not providing that dependency in Maven Central and you have to install it manually.\nI've one section in this project README file talking about this. https://github.com/pedrovgs/DraggablePanel#building-the-sample-app\n. Can you upload any screenshot or video to show this problem? I'm not able to reproduce it.\n. @manpreetsinghsodhi can you take a look at https://github.com/pedrovgs/DraggablePanel/tree/fix-horizontal-drag-problems I've been working to improve horizontal drag implementation and it seems to work again in this branch :)\nOnce you validate this branch I will release this feature to 1.4 version\n. Can you upload a video with that movement? Thanks!\nOn Dec 1, 2014 9:30 AM, \"manpreetsinghsodhi\" notifications@github.com\nwrote:\n\nHi Pedrovgs,\nFirst of all thanks for taking time in solving the issue.\nI tested this branch. It is working fine on left drag(on minimized view)\nbut when we drag right sometimes it goes left again and whenever this\nparticular case happens the view after going out of screen comes back in\nminimized state on right side . Rest everything is fine..\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/20#issuecomment-65033247\n.\n. Thanks to @Fiddl3 I've found the bug \\o/. @manpreetsinghsodhi can you review if it's working fine for you?\n. @manpreetsinghsodhi can you review if this branch is working fine for you and fixes the bug related to the horizontal drag? I'd like to integrate this branch and release a new version :)\n. \\o/ @manpreetsinghsodhi I'll merge that branch and generate a new release asap. Thanks for your help!\n. Can you upload a video or screenshot with your problem? \n. @Amritpal33 I'd like to review your problem, could be related to other changes not just with getMinHeightPlusMargin method. Can you upload one video or one screenshot reproducing your bug?\n\nI'm working to fix one issue related to the horizontal drag effect, issue #20 . Can you review if this branch: https://github.com/pedrovgs/DraggablePanel/tree/fix-horizontal-drag-problems fix your problems?\n. You might close this bug now? I need to integrate that fix and I'm waiting for a pull request of @Fiddl3 xD\n. Please, create different branches for different fixes. One to fix video view position using resize transformer, other to support landscape mode. Create your branches from the development tip.\nTo fix video view position you can change every variable related to video view position or size to int instead of use floats.\n. hahaha, good luck with your project! I'll wait for your PR. Thanks!\n2014-12-04 22:09 GMT+01:00 Fiddl3 notifications@github.com:\n\nI think I already hanged all variables to int, except for\nscaleTransformer, but I will review this again...\nThis evening (very late) or tomorrow. With fixes for landscape mode You\nwill have to wait, when I find some time to figure how really Scale\ntransformer works (for ResizeTransformer it works and this is what I needed\nfor my project).\nI'm working on project which requires rtmp stream (flv [x264+speex])\nplaying and I having some issues with audio/video sync... It's nightmare....\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/21#issuecomment-65704045\n.\n. @Fiddl3, @Amritpal33 I've found and fix the bug with VideoView and Resize transformer \\o/. Thanks to some help of @Fiddl3 !!! Can you check if it's working fine to you and your applications? I'd like to release this fix to maven central this weekend. You have the code in this branch: https://github.com/pedrovgs/DraggablePanel/tree/fix-video-view-sample-problems\n. Ok @Fiddl3, I'll wait for your PR. But compile and check that branch. The sample project is working fine without take into account the right margin.\n. This is a screenshot of video sample in a Nexus 5 -> https://drive.google.com/file/d/0B9xkpTnF9BXjZHh0Q2NBRi1TZkU/view?usp=sharing\n\nAnd this in a Samsung Galaxy S3 -> https://drive.google.com/file/d/0B9xkpTnF9BXjOXZXQkRQM0F3X1U/view?usp=sharing\nVertical drag is also working :)\n. Here you have a video where the VideoView is released and smoothSlideTo() is executed as minimize() method does.\nhttps://drive.google.com/file/d/0B9xkpTnF9BXjRzdQVU9fdEd5Z2s/view?usp=sharing\n. @Fiddl3 's pull request has been merged. I'm going to release a new version today :)\n. I can't right now because I'm working in other projects, sorry. Can you upload some screenshots with your problems. The VideoView problem in landscape is already know but I can't reproduce the other problem :S. \n. @Fiddl3 are you going to send me a pull request?\n. Please, update your branch with develop to avoid conflicts ;)\nThanks!\n. I've also fixed one issue related with the horizontal drag effect. Review this branch if you need it: https://github.com/pedrovgs/DraggablePanel/tree/fix-horizontal-drag-problems\nI'm going to integrate it once the reporter of the issue tell me it's working as expected.\n. Please, send me an email to pedrovicente.gomez@gmail.com with every detail to avoid retro compatibility problems and talk about this :)\nI've also added one checkstyle configuration to the project and linked it to the travis CI build. Review this in your branch once be updated with development tip.\nThanks for your help!!!\n. Hi @dangalg. If you have fixed the landscape problem, why don't you send me a pull request?\n. Maybe you can start reading some articles about how github works http://readwrite.com/2013/09/30/understanding-github-a-journey-for-beginners-part-1\n. That's normal, you are trying to push to my repository and you don't have permissions to do that. Review some articles about github and how to use it. You have to fork my project and clone your fork, not this repo. Change your repository code and then send me a pull request.\n. Guys? How is this issue. Have you already fixed this? I'm waiting for your PR.\n. @Fiddl3 are you working on this? What's the state of this feature?\n. Ok! Good luck with your personal project!!!\n. That feature is not going to be implemented.\n. Hi @Amritpal33! @ppamorim is working on a PR to implement your requested feature. This PR will be merged and a new version of DraggablePanel will be released once the PR be ready!\n. Hi @IlyaGazman! Thanks for your pull request :)\nReview your branch, your PR is breaking the build.\nRelated to the code, I'm going to fix this issue changing some variables using float to use int, because it should be declared as int xD. Your PR doesn't fix the bug I have with VideoView sample and compare floats using a delta is not the best approach.\n. I've merged other pull request from @Fiddl3 that fixes one problem with ResizeTransformer and apply some changes that are not compatible with this PR. I'm going to close this PR.\n. Nice PR, can you update this branch with pedrovgs:develop?\n. xD Revert your build.gradle changes to use an older version. I'll update that dependencies later.\n. Can you restore the value of MINIMUN_DX_FOR_HORIZONTAL_DRAG to 5?\n. Yes, should be density dependent. We can do that in other PR.\n. There is something wrong with tv shows sample, ScaleTransformer and this branch :S. Here you have a video https://drive.google.com/file/d/0B9xkpTnF9BXjbDZQcU4tR1ZfblE/view?usp=sharing Can you take a look. This is the last fix needed to merge this PR :)\n. Review also how you measure your max bottom position. I've changed your <item name=\"y_scale_factor\" format=\"float\" type=\"dimen\">2</item> to <item name=\"y_scale_factor\" format=\"float\" type=\"dimen\">2.3</item> and is working as you can see in this video: https://drive.google.com/file/d/0B9xkpTnF9BXjZndQOE9vSDNCa0E/view?usp=sharing\n. Thanks @Fiddl3 for this pull request!!!! I'm going to update project readme with a contributors section and you will be there :) What's your name and last name?\n. If you are using this library in any project, please send me an email with\nthe project name and link to update README.md file with that information.\n2014-12-06 14:20 GMT+01:00 Fiddl3 notifications@github.com:\n\nNo problem :)\nI'll continue working on lanscape support when I'll have time\nI'm Rafał Pluta\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/pull/27#issuecomment-65896706\n.\n. Ok, let me know once be published! Good luck ;)\nOn Dec 6, 2014 3:39 PM, \"Fiddl3\" notifications@github.com wrote:\nThis project is still in dev stage, I still have problems with rtmp stream\nplayback...\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/pull/27#issuecomment-65898965\n.\n. I'll take a look this night if I have time, Thanks @Fiddl3 !\n. @Fiddl3 thanks!\n. I need time to review this. Let me check it this weekend ;)\n. Do you know if this bug is still reproducible?\n. @Amritpal33, @Fiddl3 can we close this issue? Or can you still reproduce it with the last library version?\n. @Amritpal33 are you using resize or scale transformer? Can you upload a screenshot or a video with your problem and also paste here your DraggablePanel/DraggableView xml configuration?\n. Do you have the screenshot?\n. bump!\n. @vuhung3990 review your MediaPlayer usage. I'm using VideoView for this sample and the resize is working as expected.\n. @Fiddl3 YouTube sample is not using ResizeTransformer because take the resize value and move it to the DraggableView  is not implemented. Remember DragablePanel uses DragableView inside.\n. @vuhung3990 was this issue a problem with your MediaPlayer or can you confirm if it's related to DraggableView?\n. DraggablePanel is a DraggableView facade and is not easy to support resize feature right now. You can use DraggableView with resize enabled and add your fragment manually as DraggablePanel does. That's why the sample code is not using this feature.\n. Can you upload a screenshot whit your device layout bounds option activated?\n. I don't see any problem :S can you add an arrow or something like that pointing to the problem? Why do you say that youtube player is going to stop the video if youtube fragment is under some view? \n\nI guess you are using the last library version.\n. @ninja-tortoise can you upload your previous DraggablePanel configuration to a sample project? I'd like to fix this issue :)\n. The current workaround is change your DraggablePanel to use DraggableView. I'm trying to get time to improve this project but I'm working in another open source project right now...sorry.\n. Thie setTopViewHeight is a method only valid in the portrait mode. If you want to develop a landscape mode you'll have to override some of the current behavior.\n. That feature has to be implemented out of DraggablePanel.\n. I don't understand the effect :S do you have any schema or drawing to show me this?\n. @ppamorim bump!\n. That's not in the original youtube component. I've added your feature to maximize minimize but this doesn't match with the feature look and feel. Sorry.\n. I don't see any problem, can you upload a video and specify better where is the problem?\n. @ppamorim can you show me how to reproduce this bug?\n. Hi @ppamorim! First of all, thanks for your pull request!\nYou should review your branch because you have some checkstyle issues:\n/home/travis/build/pedrovgs/DraggablePanel/draggablepanel/src/main/java/com/github/pedrovgs/DraggableView.java:297:7: switch without \"default\" clause.\n[ant:checkstyle] /home/travis/build/pedrovgs/DraggablePanel/draggablepanel/src/main/java/com/github/pedrovgs/DraggableView.java:298:7: '{' should be on the previous line.\nHere you have the full build details: https://travis-ci.org/pedrovgs/DraggablePanel/builds/47370138\nTo avoid problems with your IDE configuration you can use this Square project to configure IntelliJ or Android Studio with the correct code format configuration: https://github.com/square/java-code-styles\n. No problem @ppamorim the important is the pull request :). Your name looks familiar to me, are you from Spain or speak spanish?\n. Hey @ppamorim  are you going to update this branch with the changes I suggested you?\n. That's could be great! Remember to update the readme project with information about this feature, just one line.\nLet me know when you update your branch to review it again and prepare another pull request with TextureView and RTSP video.\nCheers!\n. Hey @ppamorim  why have you added code not related to this pull request like the RtspSample? Please, revert your changes and use different pull requests for different features. One for the RtspSample and other for \"click to maximize\" feature. I'm not going to review all this code if it's not in different branches.\nUpdate also your branch with development, you have updated the android gradle plugin to 1.0.0 and that change is already in development.\n. @ppamorim code reviewed! Take a look to my comments please. In addition you should update your branch with my \"development\" branch to be able to see if Travis accepts your branch.\nYou forgot to add the same configuration to DraggablePanel class and connect it with DraggableView. I left you some comments about this.\n. @ppamorim, please, update your branch with my development branch. I need to see if Travis CI build is of for this pull request and I can't do it if you don't update your branch.\n. If you update your branch with my development branch you'll se how Travis CI mark your pull request as \"invalid\" because right now, your code doesn't compile. Review my comments, please.\n. Take a look here https://help.github.com/articles/syncing-a-fork/ and https://help.github.com/articles/merging-an-upstream-repository-into-your-fork/. You can use sorcetree if you want. You'll have to resolve some conflicts after commit and push.\n. @ppamorim you have some problems with the checkstyle -> https://travis-ci.org/pedrovgs/DraggablePanel/builds/48468744\n. Hey @ppamorim I see your build is ok, but when I've tested your code I've seen your feature is not working with the YouTube sample. You have changed activity_youtube_sample.xml to use your new feature but the feature is not working. Here you have a video to show the problem: https://drive.google.com/file/d/0B9xkpTnF9BXjc25IS05HaXBZbmM/view?usp=sharing \n. Then, modify the sample and use your feature in the famous places sample instead of the YouTube one. Add also some javadoc with this information inside setClickToMaximizeEnabled and setClickToMinimizeEnabled  methods for DraggablePanel and DraggableView classes.\n. Sorry @ppamorim I've been working 12 h per day this week. I'll try to merge your pull request this weekend. Do you need a maven central release with this feature?\n. Branch merged! Thanks for your pull request @ppamorim!!\n. @ppamorim a new version of DraggablePanel has been released to Maven Central Repository. New version 1.6 is ready to be used!\n. This project is using ActionBar Sherlock just for the sample code. That's not important. I used sherlock because this repository was published before Android 5.0. If the code of the sample project is not related with DraggablePanel usage I'm not going to change it. Sorry.\n. No thanks, I think the usage of ActionBar Sherlock or the new Android-L features is just a detail, what's  important for this repository is the library.\n. I'm not sure about that feature :S I don't like that shadow and the code we will have to implement to add that shadow doesn't worth.\n. Send me a pull request, but try to keep that feature as simple as possible. Forget about customization and add just the YouTube default shadow please. I don't want to add a lot of code just to add that shadow.\n. Hi @ppamorim!\nYou have another bug in this branch. If I use your feature the user can't minimize the view manually. The only thing a user can do to minimize your view is to open app navigation drawer. I have to tap in other list element to maximize the view.\nHere you have a video: https://drive.google.com/file/d/0B9xkpTnF9BXjSjBFaFlSR2JkT0k/view?usp=sharing\n. Can you use another drawable to put inside navigation drawer? Another drawable related to the sample UI.\n. Now, everything seems ok. I'm going to merge this pull request and publish a new release to Maven Central. Thanks @ppamorim!\n\n. Already reported in #22\n. You have the library artifact uploaded to maven central. http://search.maven.org/#artifactdetails|com.github.pedrovgs|draggablepanel|1.7|\nI'm not going to support eclipse for this project. Sorry.\n. ./gradlew build\n. @ppamorim  is this issue duplicated?\n. As @ppamorim says, the problem is related with the view you are using inside DraggablePanel not with this library.\n. No idea, but that's seems related with your code, not with the library code. Review your layouts :)\n. Is this pull request a fix for #47?\n. Thanks for your pull request!\n. Please, can you tell me what is this pull request going to add to the repository? Is this a new feature or a fix? I'd like to have more information before to start reviewing your code.\n. To organize features we are using issues not a changelog. Thanks for your idea, but I prefer github issues.\n. Landscape mode is not supported right now with ResizeTransformer. There is an issues requesting that feature.\n. Hi @DuongNTdev I see you already have a patch? Are you going to send a PR?\n. We could do it, but right now I'm working on other projects. Feel free to send a PR :)\n. We should not add more dependencies to this project in order to perform any animation, we are already using Nine Old Android.\n. You have a method in DraggablePanel and DraggableView with name setClickToMaximizeEnabled(boolean enableClickToMaximize) which enables the effect you are looking for.\nThis is the DraggableViewmethod implementation:\n``` java\n/\n   * Enable or disable click to maximize view when dragged view is minimized\n   * If your content have a touch/click listener (like YoutubePlayer), you\n   * need disable it to active this feature.\n   \n   * @param enableClickToMaximize to enable or disable the click.\n   /\n  public void setClickToMaximizeEnabled(boolean enableClickToMaximize) {\n    this.enableClickToMaximize = enableClickToMaximize;\n  }\n```\nYou can also enable this effect from your layout using draggable_view:enable_click_to_maximize=\"false\" xml attribute:\n``` xml\n\n    <!-- ....... -->\n\n\n```\nIs this the answer to your question?\n. Are you using the library namespace like the sample shows? xmlns:draggable_view=\"http://schemas.android.com/apk/res-auto\"\n. Can you show me the diff? I'd like to know what you've modified to get that error.\n. The correct attribute is:\nxml\ndraggable_view:enable_click_to_maximize_view=\"false\"\nThe README.md documentation is not following the attrs.xml file: https://github.com/pedrovgs/DraggablePanel/blob/develop/draggablepanel/res/values/attrs.xml. Sorry I'm going to update it.\n. I've updated the README.md with the documentation updated. Is this the fix to your problem?\n. You are welcome!\n. The build of this branch is broken in Travis-CI. Can you take a look?\n. We've already talked about this in other issues, Youtube Library does not support alpha or size changes, that's not a problem of the library.\n. @DuongNTdev I've seen this patch in other issue and I've already asked you about a pull request so I'm going to close this one. Can you review your code and send me a PR with the changes?\nThanks!\n. @frakc can you review this PR? The build is failing :(\n. @frakc your implementation to keep the view state after the device rotation is not valid. Using android:configChanges=\"keyboardHidden|orientation|screenSize\" in the sample activity you are configuring your activity to not reset the activity lifecycle. This implementation is not valid because if the library user wants to show different layout in portrait or landscape this implementation is not going to work.\nRelated to the checkstyle, this one is the one used by Square. I suggest you to review your code instead of remove the rule failing.\nI've also seen some files modified just to add some white spaces should not be there or splitting lines. Review this files and revert your changes please, these changes are just adding noise to the PR.\n. @frakc your PR is not passing in Travis-CI. Can you take a look before to start with the PR review?\n. :)\n. Thanks for your PR @Mariovc I've been out for some time. I'm going to merge it and release a new version right now. Thanks!!!!\n. Sorry guys, I've been out for some time :(. As @Glurt says the small view has to be ABOVE the top view in the xml file. @yongsunCN If you thing this should be in the project readme feel free to send a PR with the documentation update. Every PR is welcome. \nAs this issues seems to be fixed, I'm closing this issue.\n. Right now the library does not support this feature. I've already opened some issues about this one, so I'm going to close this. If you want to implement full screen support without use the library I recommend you to use a different layout in landscape mode. Cheers!\n. As @Nguyenduylinh1402 you have to change the order :)\n. This issue is related to the #78 so I'm going to close it, sorry.\n. I'm so sorry @DanhDueExOICTIF but with the current implementation this feature is not supported :( We have to rewrite part of the core library to support this feature you need right now.\n. Hi @redwerk can you also review the usage of the method getSupportActionBar() The code is not compiling because the compiler can't find this method.\n. Sorry for the delay @redwerk, I've been out for some time. You have some checkstyle issues. Can you review it and fix it to get the build working on travis?\n. Seems related to the Travis-CI configuration. This is the failure output > failed to find target with hash string 'android-23' in: /usr/local/android-sdk Can you take a look?\n. Hi @tuncaulubilge I need to debug the code manually to know what's going on. Can you upload a sample project with your configuration?\n. Hi @tuncaulubilge right now you can't configure this value. But you can send a PR with this configuration if you want :)\n. Hi @rencsaridogan, thanks for your PR. I'm going to review it right now.\nI've noticed that your PR is breaking the checkstyle rules I've configured. Can you review the code and format it to match with the checkstyle? If you want to do it automatically you can use this project to configure your IDE: https://github.com/square/java-code-styles\n. Sorry for the delay @rencsaridogan, I've been out for some time. I think I can wait for the ExoPlayer example before to merge this PR. Please, if you have time add the example and the documentation needed to show how to use the new feature :)\n. Yeap @Shuhrat-java is right.\n. Sorry guys but this is the original behaviour of the library. As this is not a bug I'm closing the issue.\n. This library does not support landscape mode yet. As this issue is duplicated I'm closing it, sorry.\n. As pointed at #38 the bug is not related to the library, the bug is related to the YouTube player library. Sorry, I'm closing this issue.\n. You can send an evento to the future using a delay or send a pull request to add the events you need :)\n. Hi @tarunnoida!\nCould you review which is the order in the z index used by these fragments? Maybe just changing the z index used by these fragments we can fix the issue  :)\n. If that approach is not working you can try detecting when the keyboard is going to be shown and then change the size of the view or move the y position. Is this the answer to your question?\n. Hi @Taranlayal10 what my suggestion was to move the y position of the draggable pannel view, not invoking setYTopViewScaleFactor method. Sorry if I didn't explain my suggestion properly. Could you try changing the top value of the layout params associated to the draggable panel? Doing this you'll move the entire view Y position instead of change the top view scale factor.\n. Hi @mdtuyen to be able to do that we need to write some code. Review this file and modify the onTouchEvent:)\n. Hi @DawinderGill to be able to help you I need more information:\n- Version of the library you are using.\n- Layout configured using the library.\n- Code initializing the library.\n- Version of the Android SDK used to build the APK and the target sdk configured.\nThe easiest way for providing this information is to create a sample project reproducing the bug :)\n. Hi @prabhumallappa the landscape mode is not supported. The portrait gap you have between the top view and the bottom view has to be related to the bottom view margin or padding, please review it and tell me if that's your error or the problem is related to the library implementation.\n. Thanks @cog :)\n. Hi @billyjoker sorry for the delay, I've been working on other projects for some time. I can't see your example right now could you describe what's the problem you have with the fragment? Do you have any error or exception thrown by the SDK when the fragment is configured as retain instance state?. Hi @manhhoangxuan sorry for the late response. I've been working on other projects for some time. \nRemember you can adjust the height of your fragment and pin it to the top of your screen. You can also move the bar to the first layer of your UI so it's drawn in top of any other fragment. This last option depends on your bar implementation. \nIs this the answer to your question?. As I can see in your screenshot you have to adjust the fragment or the draggable view/ draggable panel height. You can use animations when needed.. @manhhoangxuan did you invalidate the view after calling that method?. @manhhoangxuan right now I'm working on a different project. I don't have a quick fix for this. Sorry. If you have time you can always send a PR with the fix. Any contribution is always welcome :). Hi @gkarthikchess this feature is not supported right now. It could be a nice contribution :). Hi @salvadorjhai sorry for the late response. You can configure your fragments easily using the methods indicated in the project README.md\njava\nprivate void initializeDraggablePanel() throws Resources.NotFoundException {\n      draggablePanel.setFragmentManager(getSupportFragmentManager());\n      draggablePanel.setTopFragment(placeFragment);\n      draggablePanel.setBottomFragment(mapFragment);\n      draggablePanel.initializeView();\n}. The feature you suggest it's not implemented right now. A workaround is to minimize the view when it's created and keep is as invisible until you want to show it. That will show you an animation and the view at the same time.. Hi @b00n12 thanks for your contribution!! Before to review the implementation and the correct behavior could you review the checkstyle errors you have? The build is failing because of this.. Hi @Shajeel-Afzal. Looking at your layout I can't see any obvious error. Could you create a sample project reproducing the issue so we can review what's going on? . @SarthakJoshi review other issues open in this repository. Depending on the video view you are implementing the library is going to resize it or not. There are some Android SDK APIs which doesn't support resize. Sorry I'm closing this issue because it's duplicated.. This old bug could be fixed changing how the view is being resized but I can't do it soon. Now I'm working on a different project.. You can enable the \"show layout bounds\" development option on your device and change the lib fixing the views overlap.. Hi @nitinrana, sorry for the late response. If you don't provide me more information about how to reproduce your bug, helping you is going to be really hard.\nI need this information:\n\nSteps to reproduce your bug. A gif or a video could be great.\nLibrary version being used.\nLibrary configuration in your project.\nLayout configuration in your project.\n\n It could be great if you can create a sample project reproducing the bug!. If I'm not wrong, this feature is not implemented. As you can see here, there is a flag you can enable or disable to configure the alpha effect applied during the horizontal drag. But the feature you request is not implemented. . @ceddyb you have methods to maximize the view. You should configure any view listener and invoke the maximize method when needed. I hope, this is the answer to your question.. Why have you changed X_MIN_VELOCITY, Y_MIN_VELOCITY and MINIMUN_DX_FOR_HORIZONTAL_DRAG? \n. Can you update README.md to remove the section related to how to install this dependency into your local maven repository?\n. In this project I'm not using \"m\" naming convention. Can you rename this variable name to clickToMaximize?\n. Please, move this constant declaration with the other one. Line 50. \nYou can rename it to MIN_SLIDING_DISTANCE or MIN_SLIDING_DISTANCE_ON_MINIMIZED_CLICK and remove the comment.\n. Don't you prefer: \"Return if user can maximize minimized view on click.\"\n. Don't you prefer isClickToMaximizeEnabled?\n. Remember to rename this method to setClickToMaximizeEnabled once mEnableClickToExpand be renamed.\n. Remove this space\n. Remove this empty lines, please.\n. Why don't you put this if condition into a method?\npublic boolean shouldMaximizeOnClick(MotionEvent ev, int deltaX, boolean isDragViewHit ...){\n   return (Math.abs(deltaX(<MIN_DISTANCE && isMinimized() && isClickToExpandEnabled && isDragViewHit ......;\n}\nWhit this your if will be more readable.\n. Please, don't use x1 and x2 as variable method. use lastTouchActionDownXPosition instead.\nReview also x2, you can reduce the scope to method level instead of class level, can't you?\n. Remove this line\n. Do you need this white line?\n. You don't need this variable. You can use isDragViewHit\n. Don't you prefer clickOffset as name?\n. The initial value of this variable should be false. This feature have to be disabled by default. Once you change this,  you have to create a method to enable this feature from DraggablePanel.\n. Don't you prefer to move this switch inside the else? and move all that code to a method?\nelse{\n   dragView.dispatchTouchEvent(cloneMotionEventWithAction(ev, MotionEvent.ACTION_CANCEL));\n   analyzeTouchToMaximizeIfNeeded();\n}\nor:\nelse{\n   dragView.dispatchTouchEvent(cloneMotionEventWithAction(ev, MotionEvent.ACTION_CANCEL));\n   if(shouldMaximizeOnClick(...)){\n       maximize();\n    }\n}\n. dragViewId and secondViewId are local variable and it has no sense to declare it as final variables. dragView and secondView are not declared as final because that attributes are instantiated when the layout is inflated and you can't use final modifier with an attribute if you don't initialize in the constructor.\n. Please, remove the \"[NEW]\" and keep the rest of the sentence. I'm going to add a CHANGELOG.md file with this information.\n. Don't let library clients to configure this parameter, this should be a constant.\n. If you add this xml attrs for draggable_view, provide the same implementation for DraggablePanel class, please.\n. Remove this attribute and use the constant.\n. As I've said before, this shouldn't be configurable. Please, remove this method.\n. Review this javadoc. This should be something like \"Enable or disable click to maximize view when dragged view is minimized\".\n. Review this javadoc. This should be something like \"Enable or disable click to minimize view when dragged view is maximized\".\n. Remove this attribute and this method and use the constant.\n. This method should be private.\n. You'll have to connect DraggablePanel configuration with DraggableView configuration as I'm already doing with other configurable attrs elements.\n. You'll have to remove this.\n. Yes\n. I'm talking about minSlidingDistanceOnClick\n. Yes :)\n. This doesn't compile. You can't use the same \"name\" for attributes used with DraggablePanel and DraggableView. Remember to update the README.md with the new attr name.\n. Oh my God, pay attention to your merges!!! Remove line 4, 6 and 9 please.\n. I don't have any message xD\n. No problem, but please, send me an email instead of use G+ or twitter. I hate G+. You have my email in the README.md\n. This repository doesn't use \"m\" notation. Please review your variables and rename them without the \"m\" prefix.\n. Here you have another variable with the \"m\" notation we should change.\n. You have a colors.xml file you should use to put this values there. Please, move this hardcoded values to colors.xml\n. You don't need this method, this variable should not be accessed out of this class.\n. The same with this method, you don't needed.\n. This method is not used\n. This method should use private visibility and not public. You are using it just from DraggableView.\n. You don't need to provide xml configuration for this variable, please remove this.\n. As I said in the other comment, you don't need to provide xml configuration for this new feature. Please, remove enable_touch_listener_panel and enable_touch_listener_view.\n. Don't you prefer this approach?\njava\nsetEnableTouchListener(slideOffset<=MIN_SLIDE_OFFSET);\n. Please, remove this part of the feature. The default behavior should be just move DraggablePanel out of the window. In addition you have a bug with this minimize call. Take a look to the video -> https://drive.google.com/file/d/0B9xkpTnF9BXjR0Q3NXVWclVkOTQ/view?usp=sharing\n. You have a typo in \"WHen\"\n. We need a better name for this attribute. Instead of enableTouchListener don't you prefer to use enableTouch and methods to enableTouch(boolean enableTouch) and isEnabled?\n. Instead of slideMinimizedView we should use slideHorizontally.\n. @ppamorim to fix the bug you can see in the video the only thing you have to do is use this implementation for slideMinimizedView(....). Take a look:\n``` java\npublic void slideHorizontally(float slideOffset, float drawerPosition, int width) {\n    float slide = Math.abs(drawerPosition);\n    if (slideOffset > MIN_SLIDE_OFFSET && !isClosed() && isMaximized()) {\n      minimize();\n    }\n    setEnableTouch(!(slideOffset <= MIN_SLIDE_OFFSET));\n    ViewHelper.setX(this, width - slide);\n  }\n```\n. mDrawerLayout left attribute still has the \"m\" notation!\n. This methods and this variable should be:\n``` java\nprivate boolean touchEnabled;\nprivate boolean isTouchEnabled(){\n     return this.touchEnabled;\n}\nprivate void setTouchEnabled(boolean touchEnabled){\n    this.touchEnabled = touchEnabled;\n}\n```\n. As I said in my previous comment where I attached you a video with a visual bug, your method implementation should be:\n``` java\npublic void slideHorizontally(float slideOffset, float drawerPosition, int width) {\n    float slide = Math.abs(drawerPosition);\n    if (slideOffset > MIN_SLIDE_OFFSET && !isClosed() && isMaximized()) {\n      minimize();\n    }\n    setEnableTouch(!(slideOffset <= MIN_SLIDE_OFFSET));\n    ViewHelper.setX(this, width - slide);\n  }\n```\nJust taking into account if the view is maximized or not you'll avoid this bug.\n. Do you need the parent of this DrawerLayout, if I'm not wrong you can remove it!\n. This is not \"black\" this is just transparent xD\n. hahaaha first time I hear this xD Nice to know :)\n. If you push a new commit in the pull request branch GitHub should update this pull request automatically.\n. This annotation has no sense. You are overriding this method from the Android SDK and is the Android SDK who is going to call this method. The contract specified in the onInterceptTouchEvent declaration says MotinEvent can't be null. Please, remove this annotation and the import.\n. This repository doesn't use \"m\" notation. Please rename this variable to activePointerId.\n. Remember to remove this annotation.\n. Why did you change this target sdk to api 19?\n. Can you use ' instead of \"?\n. We should change the naming of the methods you've added to match with the naming of the project. If you review the methods already implemented all start using on as prefix. Based on that, we should rename these last three methods to:\n``` java\nvoid onTouch()\nvoid onClickedToMaximize()\nvoid onClickedToMinimize();\nvoid onSmoothSlide();\n``\n. It could be useful to pass the event to the listener method.\n. Why do you process the touch event just if the configuration is portrait?\n. All this extra whitespace you have here and in the rest of the file will be gone if you format the project using the correct checkstyle.\n. @rencsaridogan this is not the way to go to implement the listener mechanism. You are using a polling mechanism to notify your listener and depending on the device this approach will notify at the second X or X+1. You should notify your listener close to the method where the alpha is modified and remove the usage of this count down timer.\n. Definitively this should be configurable. You should add aonlyPortraitflag in to theattrs.xml` file and use this value here.\n. Cool, thanks!\n. @rencsaridogan if you add an example to the project using exo player could be great. We could use it to improve the library usage combined with this component.\n. ",
    "Pepeli": "Hi! Any news on that? I am trying to implement it unsuccessfully :(\n. Thanks for your reply. I will let you know if I manage it.\n. ",
    "npike": "I have a hacked together version of DraggablePanel that basically only handles having a scalable videoview:  https://github.com/npike/so_scalevideoview\nI am not sure I would recommend using it for a production app, but for my use case it did the trick.\n. ",
    "vuhung3990": "<com.github.pedrovgs.DraggableView\n    ..................\n    draggable_view:top_view_resize=\"true\"\n. hello, i have same problem when landscape it show a half of width. now i can set top fragment width match_parent, do you want something like this? \n. good job @dangalg , i spent much time to fix it\n. in Readme  : \"This library works on Android 4.X because the scale effect is not going to work properly when the user try to drag the view. The clickable zone on a scaled view in Android 2.X is bigger than the real scaled zone.\"\n. ```\n    draggable_view.setOnTouchListener(new OnTouchListener() {\n        @Override\n        public boolean onTouch(View v, MotionEvent event) {\n            if(draggable_view.isMinimized() && event.getAction() == MotionEvent.ACTION_UP){\n                draggable_view.maximize();\n            }\n            return false;\n        }\n    });\n\n```\n. i solved, edit DraggableVIew.java\nif(context.getResources().getConfiguration().orientation == Configuration.ORIENTATION_PORTRAIT){\n                            viewDragHelper.processTouchEvent(ev);\n       }\n. thank you for your hint, but my code have already draggable_view:top_view_resize=\"true\" in XML\n. i use mediaplayer for play video\n. I use custom media player, maybe it is my problem\n. ",
    "kekedaine": "i using maven but i has been error:\n\n. ",
    "adnan-SM": "@ kekedaine  : You should just use Android Studio and build it. \n. ",
    "patelajay745": "Hello\n. i dont know about gradle...can you help me?\nOn 13 August 2014 22:27, Pedro Vicente Gómez Sánchez \nnotifications@github.com wrote:\n\n@patelajay745 https://github.com/patelajay745 can you tell me how\nreproduce this error? I asked you about the gradle version you were using :)\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/4#issuecomment-52077294\n.\n. i m simply run project in emulator in adt.\n. \n",
    "HagerMagdy": "would you please tell me how to Build the application using Gradle ?\n. steps please am stuck in this sample for a week ! this error is always facing me \n. ok Thanks alot i will try it now :) Thanksssssssssssssssssss\n. is it  a must to run it on android studio ? or may run in Eclipse\n. Thanks a lot appreciated :)\n. I execute ./gradlew build from CMD as you said and create local.properties file in the project root with my sdk.dir but it can't find my sdk .\nmy local.prpoerties file is :\nsdk.dir=D:\\Work\\Tools\\adt-bundle-windows-x86-20140321\\adt-bundle-windows-x86-20140321\\sdk\nany advice ??\nthe error is :\nFAILURE: Build failed with an exception.\n- What went wrong:\n  A problem occurred configuring project ':draggablepanel'.\n\nSDK location not found. Define location with sdk.dir in the local.properties f\n  ile or with an ANDROID_HOME environment variable.\n. And I added Android_Home enviromental vriable as well but it stil can't find my sdk\n. simply I need to use your  draggable panel for videos in myapp which is created and has many library projects in eclipse \n. believe it or not i build draggable panel in eclipse and create new project and add it as lib project it Works ! now i am going to investigate more in your sample code :)\nThanks a lot \n. dear  pedrovgs why after added the configuration code above on click the video minimize?? any help plz\n. \n",
    "ppamorim": "Why you need use Eclipse?\n. VideoPlayer extends SurfaceView, SurfaceView can't be transformed or resized. \nI recommend to change to TextureView.\nLook to this sample: https://github.com/ppamorim/DraggablePanel/tree/textureViewSample\n. @Fiddl3 Correct! I confuse me with resized and scaled.\nBut the scale of SurfaceView as some problems (black borders while dragging).\n. I've removed the surfaceView if my project because it cause some problems(black screen, resize/scale)\n. @Fiddl3 API 14 here :p\n. Fixed on #42, working now!\n. @Amritpal33, feature implemented. That deserves a round of beer. If you aren't of legal age, otherwise the juice round... :)\n. I'll work on it.\n. Like AndroidSlidingUpPanel:\nhttps://github.com/umano/AndroidSlidingUpPanel\nIt only can be possible when the view is maximized.\n. Well, I believe that the library name is DraggablePanel and not YoutubePanel...\nWe can be better than the Youtube itself.\nBut what's the need for it? Sometimes it's necessary to perform this resizing in some cases such as when the user will enter text in EditText without the keyboard being on top...\n. why?\n. Working now!\n. Hi @pedrovgs! I apologize for the bad sourcecode , made ​​on the run because my time is very short. I'll do it better, of course.\n. @pedrovgs I'm from Brazil. My name is Pedro Paulo de Amorim\n. @pedrovgs Yup! I'm in the middle of two projects and I'm without much time . I think today I will take a little time to work on those changes , seriously ! : p\n. @pedrovgs But my internet connection is horrible. If all goes well , to implement an example in the sample containing the TextureView running a RTSP video.\n. Pushed! Can you review?\n. Good morning Pedro,\n- RTSP features removed\n- sample return to the base\n- build.gradle updated.\ncan you review?\n. @pedrovgs RTSP sample changed to textureViewSample branch.\n. @pedrovgs Done :p\n. I'm kind of stuck and tried to update my fork with yours, but do not know how to do ... :(\n. @pedrovgs Yeah!\n. Working on this checkstyle issues :+1: \n. :100: YEEP\n. We need implement a View helper only for the touch or disable the touch listener of youtube player, always when the view is minimized.\n. It's not a problem of library. It's a common problem when we've a view with a listener inside another view with a listener.\nLike a Google Maps inside a ViewPager. Google Maps = YoutubePlayer, ViewPager = DragView.\n. I think placing a View is a bad idea. I believe it is better to inform the developer that he must change / add another listener along with your YoutubePlayer. This covers various cases than implement a solution in the library.\nWhy? Because we don't know how to be the player of them.\n. @pedrovgs It's ok?\n. Oh my god, where's you?\n. @pedrovgs No problem, In the time, I'm working with this project inside of my app  (the project) and a maven central release isn't necessary now for me. \n. I fell out of my bed, I thought it was a dream.\n. Thanks!\n. Solved! Don't use the SurfaceView with this library, otherwise, I recommend to use the TextureView.\nSample: https://github.com/ppamorim/TextureView-Sample\n. If you want, I can remake this sample with the new Material Design UI. :)\n. I need to do this as it's a need of the app I'm working on...\n. ok\n. #57 to solve it\n. :( let's try again...\n. Blood are coming out of my eyes, but I'm working on it.\n. It's a different ideia. It will do a resize and rotate.\n. Good one!\n. #49 the same opened implementation.\n. Take a fork! I will not do it for you now.\n. @pedrovgs Yes. This feature (rotate to fullscreen) need to be implemented out of box. But use the same ideia/methods of #49.\n. @frakc Vitamio Player use SurfaceView. SurfaceView has problems with resize and transform operation. You need use TextureView for it. I'll report to Vitamio dev...\nThe problem is here:\nhttps://github.com/yixia/VitamioBundle/blob/master/vitamio/src/io/vov/vitamio/widget/VideoView.java\n. Please, study this branch:\nhttps://github.com/ppamorim/DraggablePanel/tree/textureViewSample\n. @bilalilyas90 SurfaceView... bro!\n. It's a common problem with this library.\nWe need start the view off screen (minimized and hide) and only expand this to maximized position.\n. I think it's. Becase another library have the same issue and I've do the same for to fix it...\n. It's a new features. That's allow to minimize to left, center or right position. And change the drag limit.\nI need change the readme too.\nDon't start the review until I tell you.\n. @pedrovgs Look to the line 676 on DraggableView class. I've change it (encapsulation), it can result a performance issue? If it can, I'll return to the original style.\n. @DuongNTdev Please remove your comment, do a fork and implement anythink that you want, then, open a pull request.\n. @pedrovgs Remember, it's a unstable code yet, but is the base of this animation. You can see this animation at Tv Shows Activity.\n. @pedrovgs Do you noticed any problem with ViewCompat.setPivotX? Here's a strange problem.\n\n. Yes, don`t use the class ViewCompat.\n. Yes!\nhttps://gist.github.com/ppamorim/c5a003495295cab9ae4b\n. You need to disable the touch listener of the DraggablePanel. I think this library has a method to do that.\n. Tested at a 6.0 device here. No problems. Would you inform the device that happens the problem? Hardly its a problem with the library, but the problem can be with the beta version of Android 6.0.\n. Its hard to identify the problem with this simple log. Do you have tried to use the sample app or implemented this library on your application?\n. This can be a problem with the beta release of the Android 6. Otherwise, try to use the sample application, if it works, wait for the stable version and test it.\nThis library use the most common way to perform these animations. We don't have any reason to happen this bug, we don't use any JNI code here.\n. @pedrovgs Where are you?\n. This is made by design, not a bug.\n. You need to do some workarounds to pervent this problem. I solved this on my app doing this: \n- Start the view hidden \n- Call to move to close to right \n- Only show the view only the method to expand the view is called.\n. why you not set these integers to final?\n. This is the standard that work. Changing...\n. ok\n. It's only to line 145?\n. lastTouchActionDownXPosition can't be a constant.\n. Only to getMinSlidingDistanceOnClick? Correct?\n. Opps...\n. I swear removed...\n. Done\n. Oh my God, I have not modified this guy : p\n. I've send a message to you on Twitter and Google+. Another questions...\n. https://plus.google.com/u/1/+PedroPauloAmorim\n. Forgive me, it's the first time I do a pull request: p\n. Old code, old standards. Will be changed.\n. Where's the problem?\nThe problem is that the developer has to put the DraggablePanel above the ActionBar/Toolbar, then this will not happen. As well as Youtube.\n. setEnableTouchListener is used on DraggablePanel.\n. It can be useful if user need now if touch is enable or not.\n. @pedrovgs It's black transparent. Exist a huge difference between white transparent and black transparent. It's used on gradient and influence on the colors of the element.\n. unecessary slide variable removed.\n. Changed, but github not notice that...\n. Yes, it updated the other notes , not this ...\n. My fault. Bad day...\n. Bad AS...\n. ",
    "friederbluemle": "Thanks!\n. ",
    "manpreetsinghsodhi": "i guess same is happening in my case. On maximising vedioview, bottom fragment is slighly moving under vedioview and lot of empty spaces can been seen. Since in my case i am using listview behind draggable panel so list view is visible . please help\n. This is the vedio of problem i am facing http://videobam.com/IUjYH\n. Hi i implemented the changes you suggested but still it is not working fine. There is a problem of rendering when i drag from top to bottom and bottom to top again and also it is taking a lot of time. \nI am sending you screenshots when i drag from top to bottom\n\nAnd when i drag from bottom to top then it is displaying as follows\n\nSo please help me\n. And what are changes  in code should i do in resize transformer? \n. I implemented the library as it is in sample . Haven't changed anything other than changes you suggested. So how to resolve it now .\nIs there any alternate for this draggable pannel on github or anywhere else?\n. @Fiddle3 sure .Can i have your mail id or skype id ?\n. @pedrovgs sure !!\n. @pedrovgs Hi i added you as a collaborator to my repository. I uploaded the files that are causing me error. Please have a look. Issue you already know . I uploaded vedio in earlier issue as well. Looking positively for help. \n. Fiddle when vedio plays it is again cutting edges at bottom(only on vedio play). I will send you my project in android studio.\n. Thanks. This issue is solved. \n. Sure. Here is the link of video i am facing problem http://tinypic.com/player.php?v=289wjo7%3E&s=8#.VGLjdMluVlM\nIssues with this video when dragged left and right on minimized state are :\n1. On dragging right halfway, it is going left and vica versa. \n2. And when video is dragged out(via left or right), it comes back again in minimized state(on right side)  sometimes.\n3. Fading effect(alpha)  while going left and right fades video completely as soon as we drag. Fading should be such that video keep on playing and should fade lightly then completely at corner.\nAnd lastly one minor issue is dragging horizontally was not that smooth . Vertically it was very very smooth.\n. Hi Pedrovgs,\nFirst of all thanks for taking time in solving the issue.\nI tested this branch. It is working fine on left drag(on minimized view) but when we drag right sometimes it goes left again(out of the screen) and whenever this particular case happens the view after going out of screen comes back in minimized state on right side .  Rest everything is fine..\n. Here is the link of  video . Please have a look. Thanks !\nhttp://tinypic.com/player.php?v=zwjn7q%3E&s=8#.VH1UZ8ladWE\n. Hi ,yes  it is working fine now . Thanks @Pedrovgs and fiddle :)\n. ",
    "jayachandrak": "Sure i will test and let you know the result\nIs this version supports oriantation changes?\nOn Nov 12, 2014 2:33 AM, \"Pedro Vicente Gómez Sánchez\" \nnotifications@github.com wrote:\n\n@jayachandrakuruba https://github.com/jayachandrakuruba I've released a\nnew version (Release 1.3) with some fixes. Can you review if your I've\nfixed your problem with this release?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/12#issuecomment-62620162\n.\n. I have tested it wasn't fixed my problem , are you supporting orientation\nchanges?\nOn 05-Dec-2014 5:47 am, \"Pedro Vicente Gómez Sánchez\" \nnotifications@github.com wrote:\n@jayachandrakuruba https://github.com/jayachandrakuruba can you check\nif this branch or the previous release fix your problem?\nhttps://github.com/pedrovgs/DraggablePanel/tree/fix-video-view-sample-problems\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/12#issuecomment-65727946\n.\n. \n",
    "Fiddl3": "this https://github.com/Fiddl3/DraggablePanel/commit/ba33447ae423c3fa6ca4083fbb456d924eea6274 implementation of onLayout method should fix this issue.\n. This happens when VideoView change his size to match played Video aspect ratio.\nOne of solution is put VideoView in container ex FrameLayout in that case video size changes will not affect dragView height.\n. SurfaceView can be resized (can not be animated, transformed and scaled).\nTextureView can only be used in a H/A windows.\nTextureView use more memory, much more.\nTextureView has small lag, needs 1-5 extra frames to update\nSo for video playback we should use overridden SV, add listeners and update SV dimensions manually when it's necessary. TV will not work on all devices (ex. wo H/A, with small amount of RAM memory....)... but it's easier to implement \nEDIT\nH/A - Hardware Acceleration\n. If you take care of its size (while dragging) there will not be black borders. It takes some time, but it can be done.\n. ...and if everything works well for you, that's the most effective way, but you have to make sure that app is working as supposed on all devices you targeting - that's the main goal \n. It's related to all view all which were not designed to move/resize/transform while rendering. But we can't do anything to improve this in library. \n. I had a similar problem with vitamio VideoView as dragView and resizeTransformer.\nSolution: Move methods responsible for changing a position of seconView to layoutChange listener of dragView.\nin DraggableView.mapGui()\n``` java\n...\nprivate void mapGUI(TypedArray attributes) {\n\n    final int dragViewId = attributes.getResourceId(R.styleable.draggable_view_top_view_id, R.id.drag_view);\n    final int secondViewId = attributes.getResourceId(R.styleable.draggable_view_bottom_view_id, R.id.second_view);\n    dragView = findViewById(dragViewId);\n    secondView = findViewById(secondViewId);\n\n    ViewTreeObserver observer = dragView.getViewTreeObserver();\n    observer.addOnGlobalLayoutListener(new ViewTreeObserver.OnGlobalLayoutListener() {\n        @Override\n        public void onGlobalLayout() {\n            changeSecondViewPosition();\n            changeSecondViewAlpha();\n        }\n    });\n}\n\n...\n```\nand comment in: DraggableViewCallback.onViewPositionChanged()\n``` java\n...\n@Override\npublic void onViewPositionChanged(View changedView, int left, int top, int dx, int dy) {\n    draggableView.updateLastDragViewPosition(top, left);\n\n    if (draggableView.isDragViewAtBottom()) {\n        draggableView.changeDragViewViewAlpha();\n    } else {\n        draggableView.restoreAlpha();\n        draggableView.changeDragViewScale();\n        draggableView.changeDragViewPosition();\n        //draggableView.changeSecondViewAlpha();\n        //draggableView.changeSecondViewPosition();\n        draggableView.changeBackgroundAlpha();\n    }\n}\n\n...\n```\nalso there is bug in DraggableView.smoothSlideTo(float slideOffset) \njava\n        int x = (int) (slideOffset * (getWidth() - transformer.getMinWidth()));\n        int y = (int) (topBound + slideOffset * getVerticalDragRange());\nshould be:\njava\n        int x = (int) (slideOffset * (getWidth() - transformer.getMinWidth() - transformer.getMarginRight()));\n        int y = (int) (topBound + slideOffset * getVerticalDragRange());\nand some in resize tranformer...\n. You need to create local copy of library (clone git repo), add it as module, add module dependency in grade (I'm using Android Studio), and modify java sources.\nIn eclipse create android library project, make changes, compile and add .jar to libs, of your project.\nChanges You need to make:\nIn Class:\nhttps://github.com/pedrovgs/DraggablePanel/blob/develop/draggablepanel/src/main/java/com/github/pedrovgs/DraggableView.java#L334\nmodify/replace mapGUI (Copy&Paste from above answer)\nand in https://github.com/pedrovgs/DraggablePanel/blob/develop/draggablepanel/src/main/java/com/github/pedrovgs/DraggableViewCallback.java#L58\nadd comment in line 66&67, or replace whole onViewPositionChanged() from my prev answer\nSorry for my English, I hope You'll understand now.\n. You using ScaleTransformer which is default (seems more smooth, but not working with vitamio)... in ScaleTransformer view position is changed by ViewHelper.\nAdd brake point in addOnGlobalLayoutListener you implemented, and check whether it is fired\nIf not, you should reverse changes and study dragView & secondView positions while dragging, and in OnLayout https://github.com/pedrovgs/DraggablePanel/blob/develop/draggablepanel/src/main/java/com/github/pedrovgs/DraggableView.java#L308\nand check if positions are proper... \n. Can you share your code (Add whole project to Archive)? I'll take look and may be able to help.\n. mail.fiddle@gmail.com\n. I'll send pull request, but I have to test it more deeply\n. @pedrovgs I tried to explore why this issue occurs, but I haven't enough time to investigate this deeply, so, for now, i use temp fix with ViewTreeObserver and it works\nI made some other changes in library, take look https://github.com/Fiddl3/DraggablePanel/commit/b0f253eb76adc530dc01e6ec456e41265065d4f2\nI'll continue working on this when I'll have time, and send you a pull request... Maybe you'll resolve this issue earlier\n. @pedrovgs here is  updated sample app that I send to @manpreetsinghsodhi last week https://github.com/Fiddl3/DraggablePanel/commit/e6f64b6798bc5e3707ed2d991344d62b4a876d85\n. I don't have time to resolve all of your problems... especially if I don't know what is the problem...\nI suppose that video aspect ratio is different than dragView aspect ratio and part of video is cutoff (at bottom), the solution for this \"issue\" is to change dragView height programmatically to adjust it to video height \nThere is more problems to solve for example, when you drag YT player the video doesn't change its dimensions. There will be many more so You should teach yourself how to resolve them.\n. I deleted my prev answer by mistake....\nby default this is enabled, but you can\nIn java you can enable/disable apha effect:\ndraggablePanel.setEnableHorizontalAlphaEffect(true|false);\nor\ndraggableView.setHorizontalAlphaEffectEnabled(true|false);\nin XML:\ndraggable_view:enable_horizontal_alpha_effect=\"true|false\"\nfading of dragView is controlled by method changeDragViewViewAlpha() in draggableView\nThis will not work with Views that uses SurfaceView to display content (ex: video) because default PixelFormat of holder doesn't support alpha channel or support only one bit (visible/invisible)\nThere are 2 solutions:\n1) Change PixelFormat to one that support alphatransparency - http://developer.android.com/reference/android/graphics/PixelFormat.html#TRANSLUCENT\n2) Put View in container, set background of container, set visibility of View to INVISIBLE while moving\nI suppose YT player use SyfraceView too, but I'm not sure\n. in ~~triggerOnReleaseActionsWhileVerticalDrag()~~ method of DraggableViewCallback:\nedit:\nsorry in triggerOnReleaseActionsWhileHorizontalDrag()\n``` java\n...\n   if (xVel < 0 && xVel <= -X_MIN_VELOCITY) {//the mising \"-\" before (Y_MIN_VELOCITY) caused this bug\n        draggableView.closeToLeft();\n    }\n\n...\n```\n. It's because getMinHeightPlusMargin() in ResizeTransformer return different value than dimensions for   ~~verticalDragOffset ==1~~ verticalDragOffset ==0 in updateHeight()\nI don't remember if there was another issue causing this....\nResizeTransformer from my form works OK but resizeFactor work different than in original library\n. I'm sure @pedrovgs will fix it very quick \nyou can edit getMinHeightPlusMargin() to return the same value that is calculatet vile dragging\nI think it will be:\njava\nreturn (int) ((getOriginalHeight()* (1/getYScaleFactor())) + getMarginBottom());\nbut I'm not sure\n. I'll create new branch with fixes related to ResizeTransformer and send you a pull request.\n. I think I already hanged all variables to int, except for scaleTransformer, but I will review this again...\nThis evening (very late) or tomorrow.  With fixes for landscape mode You will have to wait, when I find some time to figure out how really Scale transformer works (for ResizeTransformer it works and this is what I needed for my project). \nI'm working on project which requires rtmp stream (flv [x264+speex]) playback and I having some issues with audio/video sync... It's nightmare....\n. It'll not work...\nint getMinWidthPlusMarginRight() \"margin part is missing\"\nI'll update my for (ResizeTransformer_fix branch) with all fixes (without changing a scaleFactor implementation) then send you a pull request later today.\nI still think that my scaleFactor implementation is better, but I don't know how many devs are using this library, and how many apps we \"broke\" when we will change this in maven central.... ergo lets leave this as is. \n. It's not working, look at the right side on the minimized dragView when you use minimize() method, there is no margin, so vertical dragging will not work.\n. There is no way for this to work ok... look in to smoothSlideTo() left coordinate is calculated using getMinWidthPlusMarginRight() so it'll be moved right by margin size.\nWhen you use finger to move view it'll work OK, but when you minimize it using minimize() or smoothSlideTo() it'll not\n. check my fork:\nhttps://github.com/Fiddl3/DraggablePanel/commit/c91dde454434a31f6e87a0794cd2212245c9bfa7\nI tested the library in my application, but you need to test this yourself \nif you target pre KitKat devices (API < 16) you need to handle window flags in activity\njava\n    @Override\n    public void onConfigurationChanged(final Configuration newConfig) {\n        super.onConfigurationChanged(newConfig);\n        if (Build.VERSION.SDK_INT < Build.VERSION_CODES.JELLY_BEAN){\n            if (newConfig.orientation == Configuration.ORIENTATION_LANDSCAPE) {\n                getWindow().clearFlags(WindowManager.LayoutParams.FLAG_FORCE_NOT_FULLSCREEN);\n                getWindow().addFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN);\n            } else {\n                getWindow().clearFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN);\n            }\n        }\n    }\n. You are using DraggablePanel or DraggableView in your layout??\nI'll look in to it tomorrow, and test in sample app.\n. Tomorrow I'll work on this...\nI'm going to remove part responsible for hiding status and nav bars, because it's depend on API level, ant can be confusing for developers.\nThen I'll send pull request .\nEDIT:\nI'll add xml attribute for auto fullscreen mode.\n. There will be one problem... \nIn my version scaleFactor work differently. drag view is scaled to 1/scaleFactor of its original size. now only for scaleFactor=2 it match your calculations (In last commit I accidentally reverted changes in scaleTransformer).\nThis may be confusing for devs who use the library, but I think that this approach (for calculation) makes more sense (its more logical)\n. No problem.\nI'll email you, but not today. \nThere was a \"small\" party last night and... I can't think straight right now.\n. draggable_view_top_view_y_scale_factor should be set as float value, not dimesion, \n. I'm working on fullscreen support for ResizeTransformer on this branch: https://github.com/Fiddl3/DraggablePanel/tree/LanscapeMode-feature.\nIt's synchronized with develop, you can clone this branch and make your changes.\n. Now I'm working on my engineering degree (Home automation project) and I don't have any time for this. I hope in second half of February this'll change. \n. Travis say Could not find com.android.support:support-v4:21.0.2. xD \nThere is no support library on maven central (I think is in local repo, when you install android google support libs via SDK Manager) \n. MINIMUN_DX_FOR_HORIZONTAL_DRAG typo in MINIMU``N word \n...MIN_VELOCITY - I've tested various values and this to works ok for me, Y_MIN_VELOCITY was too high for landscape mode. \n. hmmmm.... I'm thinking MINIMUM_DX & MINIMUM_DY should be density dependent...\n. Whats wrong there? I don't know where I should look \n. aaa I see, second view content is missing, I'll take look at this\n. travis doesn't like me & lastest google support library....\nTravis downloads and installs support library, but then it doesn't see it... https://travis-ci.org/pedrovgs/DraggablePanel/builds/43138658#L935\n. No problem :) \nI'll continue working on lanscape support when I'll have time\nI'm Rafał Pluta\n. This project is still in dev stage, I still have problems with rtmp stream playback...\n. I will, thanks.\n. This happens to me too on some devices... \nI don't think this is bug in DraggableView, but there is simple solution - check pointerCount and if count > 1 return false :\n``` java\n  @Override public boolean onInterceptTouchEvent(MotionEvent ev) {\n  ...\nif (action == MotionEvent.ACTION_CANCEL || \n    action == MotionEvent.ACTION_UP  || \n    ev.getPointerCount() > 1) {\n  viewDragHelper.cancel();\n  return false;\n}\n\n...\n  }\n``\n. You can always catch exception and return false but you should debugViewDragHelper.shouldInterceptTouchEvent()` method because it appears that MotionEvent is changing in for loop and this cause exception, because before loop PointerCount must be grater than 1, but in second pass of for loop NullPointerException appears in line :\njava\nfinal float dx = x - mInitialMotionX[pointerId];\n. please try this branch https://github.com/Fiddl3/DraggablePanel/tree/viewDragHelper_issue if it fix this bug I'll create pull request\n. For now I'm using try...catch to silence this exception, but I really don't know why it is happening even with new instance on event...\n. You can try extend DraggableView class and override public boolean onInterceptTouchEvent(MotionEvent ev) and return false when user touch mediaController view.\nBut i discovered that this will produce NullPointerException in ViewDragHelper class similar to #31. \nGenerally if other view take over a MotionEvent the shouldInterceptTouchEvent method will throw NullPointerException or OutOfBoundsException at some point....\n. can you upload a video showing this problem?\n. Are You using regular Android VideoView or custom view?\n. Look in to sample app, there is example with YT player (but with outdated library) and it's working\n. Did You try set right & bottom margin for draggableview? I don't know where yt player view is overlaped and I don't have time to investigate this right now, but I'll take look in to this in future.\n. I don't understand...\n``` java\ndraggablePanel.setTopFragmentMarginRight(topViewMarginRight);\ndraggablePanel.setTopFragmentMarginBottom(topViewMargnBottom);\n```\ndoesn't work if you are using ResizeTransformer ??\nAnd which view is overlaping YT player? or is it positioned outside the screen? \n. this is the patch\nAlways set layout bounds except edit mode\n. ",
    "ngnclht1102": "Thanks for your answer. Sorry because I coundn't online for a long time!  \nMy Draggble panel has 2 fragments, top view fragment is Youtube fragment, bottom view is a custom fragment which display other videos's list. Other video's list is loaded by a loader (data is from my server). \nThe first time (call initializeView) , my draggble panel work okey with no problem. But other time I try to change content of bottom view, the bottom view positon is wrong. Some time, a part of the bottom view  is overlayed by topview.\nBut the problem is not occur when the bottom view data is static.\nPlease help me when you have time! \nThanks you very much and sorry for poor english!! \n. I have sended an email to you. My draggble panel is located on VideoPlayer.java. Thank you very much!\n. ",
    "megataps": "Hi Manpreetsinghsodhi\nYou should change order call listener in methods OnCreate like below:\n@Override\n    protected void onCreate(Bundle savedInstanceState) {\n        super.onCreate(savedInstanceState);\n        setContentView(R.layout.activity_youtube_sample);\n        ButterKnife.inject(this);\n        initializeYoutubeFragment();\n```\n   // Set listner for DraggablePannel befor init\n   hookDraggablePanelListeners();\ninitializeDraggablePanel();\n\n}\n```\nHope this help.\n. ",
    "Amritpal33": "How do i fix it..?\neven the close to Left or right doesn't work for me.\nI am testing on Nexus 5 and Samsung S4 with 4.4.2\n. Hi Pedrovgs,\n     I took the latest update from Fiddl and it seemed to have solved maximum of my problems.\nAlso i will review the horizontal dragg effect branch.\n You might close this bug now.\nThanks for your efforts.\n. Hi Pedrovgs,\n    I am using your library in one of the high scale commercial Application.\nCould you please help me resolving how can i support both resizing and Landscape mode.\nAlso the Bottom fragment gets overlapped to topFragment.\nYour support will be highly appreciated.\nThanks.\n. Hi Fiddl3,\n     Thanks alot for your Fixes. i tried to run your branch and the secondview issue and resizing is working perfectly.\nHow Landscape mode changing is Throwing Number Format Exception.Here are the Logs:\n11-30 18:03:39.196: E/AndroidRuntime(12005): java.lang.NumberFormatException: Invalid float: \"\"\n11-30 18:03:39.196: E/AndroidRuntime(12005):    at java.lang.StringToReal.invalidReal(StringToReal.java:63)\n11-30 18:03:39.196: E/AndroidRuntime(12005):    at java.lang.StringToReal.parseFloat(StringToReal.java:289)\n11-30 18:03:39.196: E/AndroidRuntime(12005):    at java.lang.Float.parseFloat(Float.java:300)\n11-30 18:03:39.196: E/AndroidRuntime(12005):    at android.content.res.TypedArray.getFloat(TypedArray.java:288)\n11-30 18:03:39.196: E/AndroidRuntime(12005):    at com.github.pedrovgs.DraggableView$1.onGlobalLayout(DraggableView.java:359)\n11-30 18:03:39.196: E/AndroidRuntime(12005):    at android.view.ViewTreeObserver.dispatchOnGlobalLayout(ViewTreeObserver.java:847)\nPlease check what could be done to fix this.\nonce Again Thanks alot.\n. I am using Draggable Panel. i replace the value with hardcoded 2.0(random x scale factor and everything works fine.)\n. Hi Fiddl3,\n      I am constantly facing Number Format Exception while using DraggablePanel class in the following line:\nfloat yScaleFactor = attributes.getFloat(R.styleable.draggable_view_top_view_y_scale_factor, DEFAULT_SCALE_FACTOR);\nHere are the Logs:\n12-01 11:48:40.502: E/AndroidRuntime(3621): java.lang.NumberFormatException: Invalid float: \"48.0dip\"\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at java.lang.StringToReal.invalidReal(StringToReal.java:63)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at java.lang.StringToReal.parseFloat(StringToReal.java:310)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at java.lang.Float.parseFloat(Float.java:300)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.content.res.TypedArray.getFloat(TypedArray.java:288)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at com.github.pedrovgs.DraggableView$1.onGlobalLayout(DraggableView.java:363)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.ViewTreeObserver.dispatchOnGlobalLayout(ViewTreeObserver.java:815)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.ViewRootImpl.performTraversals(ViewRootImpl.java:1778)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.ViewRootImpl.doTraversal(ViewRootImpl.java:996)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.ViewRootImpl$TraversalRunnable.run(ViewRootImpl.java:5600)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.Choreographer$CallbackRecord.run(Choreographer.java:761)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.Choreographer.doCallbacks(Choreographer.java:574)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.Choreographer.doFrame(Choreographer.java:544)\n12-01 11:48:40.502: E/AndroidRuntime(3621):     at android.view.Choreographer$FrameDisplayEventReceiver.run(Choreographer.java:747)\nPlease Let me Know how can i fix this.\n. Hi Fiddl3,\n   The Method is already written in the similar passion , and the crash is still there.\n. @Pedrovgs i am using DraggablePanel with resize Transformer. DraggableView's  resize attribute is set to True in draggablePanel.xml.\nI have reverted my branch again to the older version. i will upload a screen shot once i will migrate back to R0.5\n. Hi vuhung3990,\n    You have to set draggable_view:top_view_resize=\"true\" to resize your videos in com.github.pedrovgs.DraggableView attribute of your xml.\nThanks!\n. ",
    "dangalg": "I have fixed this in my branch but don't know how to share it with you\n. I fixed the landscape problem... does anyone hear me?? Pedro?\n. I don't know how....\nOn Wed, Dec 10, 2014 at 3:15 PM, Pedro Vicente Gómez Sánchez \nnotifications@github.com wrote:\n\nHi @dangalg https://github.com/dangalg. If you have fixed the landscape\nproblem, why don't you send me a pull request?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/22#issuecomment-66449473\n.\n. I work with sourcetree and I am getting these errors when trying to create\na pull request:\n\ngit -c diff.mnemonicprefix=false -c core.quotepath=false push -v --tags\n--set-upstream origin dangal:master\nPushing to https://dangalg@github.com/pedrovgs/DraggablePanel.git\nremote: Permission to pedrovgs/DraggablePanel.git denied to dangalg.\nfatal: unable to access '\nhttps://dangalg@github.com/pedrovgs/DraggablePanel.git/': The requested URL\nreturned error: 403\nCompleted with errors, see above.\nOn Wed, Dec 10, 2014 at 3:19 PM, Pedro Vicente Gómez Sánchez \nnotifications@github.com wrote:\n\nMaybe you can start reading some articles about how github works\nhttp://readwrite.com/2013/09/30/understanding-github-a-journey-for-beginners-part-1\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/22#issuecomment-66449952\n.\n. ok fine, maybe I'll join fiddles branch because he is working on it as well\n\nOn Wed, Dec 10, 2014 at 3:36 PM, Pedro Vicente Gómez Sánchez \nnotifications@github.com wrote:\n\nThat's normal, you are trying to push to my repository and you don't have\npermissions to do that. Review some articles about github and how to use\nit. You have to fork my project and clone your fork, not this repo. Change\nyour repository code and then send me a pull request.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/22#issuecomment-66451953\n.\n. Its easy to fix..\nבתאריך 18 בדצמ 2014 07:27, מאת \"vuhung3990\" notifications@github.com:\nhello, i have same problem when landscape it show a half of width. now i\ncan set top fragment width match_parent, do you want something like this?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/22#issuecomment-67442936\n.\n. \n",
    "Glurt": "Hey @Fiddl3  did you ever get around to implementing this and sending a pull request?\n. I'm having the same issue, is the DraggableView broken? I would much rather use DraggableView than DraggablePanel.\nEdit: I've done some digging and dragging works on 1.3 but not 1.4 and above, something changed between those two versions that prevents the top view being dragged when minimised. I'll keep looking and see what I find.\n. Ok so I've done some more testing and it turns out that the order of the top and bottom views matters, you need the bottom view to go ABOVE the top view in the xml file.\nThis will work:\n```\n\n<!-- Bottom View -->\n<ListView\n    android:id=\"@+id/bottomView\"\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:layout_below=\"@+id/topView\" />\n\n<!--Top View-->\n\n<com.google.android.youtube.player.YouTubePlayerView\n    android:id=\"@+id/topView\"\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"150dp\"\n    android:layout_alignParentTop=\"true\" />\n\n\n```\nThis will not:\n```\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n\n<!-- Top View -->\n<com.google.android.youtube.player.YouTubePlayerView\n    android:id=\"@+id/topView\"\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"150dp\"\n    android:layout_alignParentTop=\"true\" />\n\n<!-- Bottom View -->\n<ListView\n    android:id=\"@+id/bottomView\"\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:layout_below=\"@+id/topView\" />\n\n\n```\n. @yongsunCN Unfortunately I think this project might be dead, there are a lot of issues with it and the dev doesn't seem very active. Once I have some spare time I intend to write my own library that is functionally similar to the YouTube implementation and less general. \n. ",
    "jdourlens": "got kind of same issue there, do you have a workaround or i need to do it by myself?\n. I quick patched this doing: \nif (isViewHit(mySeekBar, (int) ev.getX(), (int) ev.getY())\n       return (false);\nin onInterceptTouchEvent(MotionEvent ev) of the DraggableView.java\n. ",
    "haipro912": "Thanks jdourlens!. ",
    "coderbhupendra": "@jdourlens @haipro912 can you give a detail code how to use isViewHit in onInterceptTouchEvent and what is mySeekBar.. I also got similar problem,, the top view on minimization sometimes does not minimize to fullest.\nThis is my draggableview xml:\n``\n    <!--Bottom View-->\n    <LinearLayout\n        android:orientation=\"horizontal\"\n        android:layout_width=\"match_parent\"\n        android:layout_height=\"match_parent\"\n        android:id=\"@+id/drag_ll_details\"\n        android:background=\"@color/bmb_seller_details\"\n        android:layout_below=\"@+id/drag_ll_top_slider\">\n\n\nTop View\n\n        <android.support.v7.widget.RecyclerView\n            android:layout_width=\"match_parent\"\n            android:layout_height=\"wrap_content\"\n            android:id=\"@+id/recyclerview_slide\" />\n    </LinearLayout>\n\n\n</com.github.pedrovgs.DraggableView>`\n\n```\nBelow are the screen shot.\n\n\n. ",
    "xiaojianan": "I have the same question too, I would also like to know how to fix it, thanks.\n. ",
    "frakc": "@Fiddl3  same problem with youtubeplayersupportfragment. I saw comments saying it works fine with youtubeplayerview, but i dont know how to use youtubplayerview inside fragment and it is actually said that this view can be used only in activity extending YoutubeBaseActivity\n. @Fiddl3  If you mention this example\nhttp://oi58.tinypic.com/2mos0i0.jpg  you can see that video is cropped at right and bottom ( it also visible in readme of this project. \nMay be you have any idea about this problem? https://github.com/pedrovgs/DraggablePanel/issues/38\nIt is resized properly, but due to few pixels overlapping it stops by crual youtubeplayer developers' logic/\nFrom you words, I assume that this issue was fixed at some point, but later it was accidentaly reverted\n. @Fiddl3  I tried. margins in dagable pannel does not affect the distance between topview and bottom view. Those view are adjecent if scaleTransformer is used and there is few pixel overlaping if ResizeTransformer is used.\n. Solved\nCorrect way to initialise is \njava\n initializeYoutubeFragment();\n        hookDraggablePanelListeners();\n        initializeDraggablePanel();\nContradictory to sample\n. @pedrovgs  but main problem - resize transformer causes youtubefragment to be few pixel under some view, which make youtube player to stop, as anything is not allowed to be above it\n. @pedrovgs  screenshoot\nAs You can see if you magnify image, video fragme is slightly overlaped a bottom\n. @pedrovgs \nYes, I am using last library version. \nquot from google dev https://developers.google.com/youtube/android/player/reference/com/google/android/youtube/player/YouTubePlayerFragment?hl=ru \"Note that while videos are playing, this View has a minimum size of 200x110 dp. If you make the view any smaller, videos will automatically stop playing. Also, it is not permitted to overlay this fragment's view with other views while a video is playing. \"\nAnd if you will try to put any overlay to youtubeplayerview or youtubeplayerfragment you will see that it is true - video will stop plaing in 2 second if overlay vill not move out of youtubeplayer bounds.\nAlso in last line of error log in topic body, you will see distances with negative numbers which point to overlaping. \nI also tried to point it on this image, do you see that top view is just few pixels below bottomview?\nhttp://oi61.tinypic.com/2vv8dw5.jpg\n. besides overlappind, there also was issue with minimal player size for YouTubePlayerSupportFragment,which is limited to 200*110 dp. I fixed it in following way:\nAt first wrap frame which will hold youtube fragment and add top and bottom padding\n``` xml\n \n        <FrameLayout\n            android:id=\"@+id/youtube_here\"\n            android:layout_width=\"match_parent\"\n\n            android:layout_height=\"match_parent\">\n\n        </FrameLayout>\n    </FrameLayout>\n\n```\nthen\nchange updateScale method in resizetransformer to\n``` java\n  @Override public void updateScale(float verticalDragOffset) {\n    int newWidth = (int) (getOriginalWidth() * (1 - verticalDragOffset / getXScaleFactor()));\n    int newHeight = (int) (getOriginalHeight() * (1 - verticalDragOffset / getYScaleFactor()));\n    if(newWidth>minX)layoutParams.width = newWidth;\n    if(newHeight>minY)layoutParams.height = newHeight;\ngetView().setLayoutParams(layoutParams);\n\n}\n```\nand constructor to\n``` java\n  private int minX,minY;\n  ResizeTransformer(View view, View parent) {\n    super(view, parent);\n    layoutParams = (RelativeLayout.LayoutParams) view.getLayoutParams();\n    minX = (int) TypedValue.applyDimension(\n        TypedValue.COMPLEX_UNIT_DIP, 210, view.getContext()\n        .getResources()\n        .getDisplayMetrics()\n    );\n    minY = (int) TypedValue.applyDimension(\n        TypedValue.COMPLEX_UNIT_DIP, 114, view.getContext().getResources().getDisplayMetrics()\n    );\n}\n```\nthat will ensure that player will not be smalle then minimal dimentions and will not be overlaped by bottom fragment\n. @ppamorim \nHi. Do you need any help with this feature? (dont know how much i can help, but I need this feature too)\n. @bilalilyas90 \n``` java\n    @Override\n    public void onConfigurationChanged(Configuration newConfig) {\n        super.onConfigurationChanged(newConfig);\n    if(getResources().getConfiguration().orientation == Configuration.ORIENTATION_LANDSCAPE) {\n        Display\n                display =\n                VideoSampleActivity.this.getWindowManager()\n                             .getDefaultDisplay();\n\n        Point size = new Point();\n        display.getSize(size);\n        draggableView.setTopViewHeight(size.y);\n\n        Toast.makeText(VideoSampleActivity.this, \"landscape\", Toast.LENGTH_SHORT)\n             .show();\n    } else if(getResources().getConfiguration().orientation == Configuration.ORIENTATION_PORTRAIT) {\n        Toast.makeText(VideoSampleActivity.this, \"portraite\", Toast.LENGTH_SHORT)\n             .show();\n\n        Resources r = getResources();\n        int px = (int) TypedValue.applyDimension(\n                TypedValue.COMPLEX_UNIT_DIP, 200, r.getDisplayMetrics()\n        );\n        draggableView.setTopViewHeight(px);\n\n\n    }\n}\n\n```\nThat actually works good for draggableView. For draggablePannel need to add extra method to pass height directly to view.\n. @bilalilyas90  try this tweak \nhttps://github.com/pedrovgs/DraggablePanel/issues/29\nI did not tested it by myself but i hope it will help\n. @bilalilyas90  try to replace your player with standart videoview. If behaviour consistent - it sum internal bug, if not - contact your payer developers as it might be part of player protection ( like in youtube, which stops when view overlaping is detected)\n. @bilalilyas90 sorry i am unexpirienced with draggablepanel and vitamio,  I simply dont have any idea\n. @HagerMagdy \nIts because of minimise check\njava\nif(slideOffset > MIN_SLIDE_OFFSET && !isClosed() && isMaximized()) {\n            minimize();\n        }\nyou can ither edit way of minimise check or check orientation to perform or not perform some actions\njava\nif(getResources().getConfiguration().orientation == Configuration .ORIENTATION_PORTRAIT)\n. it is something with check style, How to use checkstyle plugin?\nBuy the way, does resize transformer work at all (when i doenloaded demo and run on my tablet (android 5.02, it freesed)? Cause I have another commit which gratly improve positioning with scale transfromer and probably will brake resize transformer.\n. @pedrovgs Horray, it finaly passed:) You probably has to validate if there is negative impact on recize transformer, as i could not, on version 1.8 it always freees on my devices\n. @pedrovgs also check you checkstyle for <module name=\"RedundantThrows\"/>  it seems, that check style does not support it any more. loading checkstyle file with it causes loading crash\n. ",
    "tuncaulubilge": "@vuhung3990 I had the same bug with height not resizing properly. I'm also using a custom player but I doubt the problem is with the player. It seems like the issue occurs when I manually set the height in code, in order to keep aspect ratio. Can you confirm this is the case for you too?\nIssue: https://github.com/pedrovgs/DraggablePanel/issues/84\n. Any luck?\n. Had the same problem, solved it by moving the fragment to the parent layout:\n```\n    @Override public void onConfigurationChanged(Configuration configuration) {\n        super.onConfigurationChanged(configuration);\n        if (configuration.orientation == Configuration.ORIENTATION_LANDSCAPE) {\n            View playerView = playerFragment.getView();\n            playerParent = (ViewGroup) findViewById(R.id.drag_view);\n            playerParent.removeView(playerView);\n            draggablePanel.addView(playerView, playerView.getLayoutParams());\n        } else if (configuration.orientation == Configuration.ORIENTATION_PORTRAIT) {\n            View playerView = playerFragment.getView();\n            draggablePanel.removeView(playerView);\n            playerParent = (ViewGroup) findViewById(R.id.drag_view);\n            playerParent.addView(playerView, playerView.getLayoutParams());\n        }\n    playerFragment.onOrientationChanged(configuration.orientation);\n}\n\n```\n. Could you find any solutions to this issue? Tried several methods but no luck\n. @ppamorim Any suggestions on how to change this? I can fork your project for this feature.\n. Found an ugly but working solution for this issue.\nThe trick is, the draggableView has to be visible when you call minimize(). In my layout, I made draggableView visible with both drag views invisible. \nWhen the draggableView global layout is called, I minimize the view and set it to invisible again in a delayed runnable. This way, when I want to display the views with maximize, the animation plays from bottom to top. \nHere is the code:\nplayerView.getViewTreeObserver().addOnGlobalLayoutListener(\n                new ViewTreeObserver.OnGlobalLayoutListener() {\n                    @Override public void onGlobalLayout() {\n                        // gets called after layout has been done but before display\n                        playerView.getViewTreeObserver().removeOnGlobalLayoutListener(this);\n                        playerView.minimize();\n                        Handler handler = new Handler();\n                        handler.postDelayed(new Runnable() {\n                            @Override public void run() {\n                                playerView.setVisibility(View.INVISIBLE);\n                                playerView.setChildViewsVisible();\n                            }\n                        }, 10);\n                    }\n                });\nAfterwards, when I want to display the player, I just set it to VISIBLE and call maximize()\n. ",
    "rafael-alves-enterplay": "Hi, I'm also having a similar issue, I'm using a custom player as top fragment and when I minimize it, bottom and right are cropped. Is there any parameter that I have to change to \"fitXY\"-like? Or maybe in my video fragment?\nI think it's something with my player, because I added an imageview to my video fragment and it's being resized properly, only my video is being cropped.\nThis is my panel:\n\nAnd this is my Custom Player:\n\n. ",
    "ninja-tortoise": "I'm also seeing this behaviour where the youtube video will stop sometimes in minimized view. \nI am using DraggableView and the youtube video resizes correctly.\n03-28 15:06:47.630    3783-3783/com.myapp W/YouTubeAndroidPlayerAPI﹕ YouTube video playback stopped due to unauthorized overlay on top of player. The YouTubePlayerView is not contained inside its ancestor android.widget.FrameLayout{1e96423f V.E..... .......D 1189,897-2395,1334 #7f0a0043 app:id/youtubeVideoContainer}. The distances between the ancestor's edges and that of the YouTubePlayerView is: left: 0, top: 0, right: -3, bottom: -1 (these should all be positive).\n. @nostake This worked like charm. Thanks a lot.\n. @frakc when I add the onConfigurationChanged code you added above the video goes to landscape as expected. However, when I go to portrait after this, minimize the video, maximize it again and then rotate the device to go portrait again, the landscape video is not the correct width.\nI'm using draggable view.\nIs this the same for anyone else?\nhttp://imgur.com/o2YbAQ1\n. Its a Nexus 6\n. Yeah this is an issue with another lib in my app. False alarm!\n. ",
    "v-b7": "@ninja-tortoise There might be an issue with ResizeTransformer or with YouTubePlayerFragment. A quick fix would be to add padding or margin (bottom and right) to YouTubePlayerView after the fragment's view was created\n. ",
    "kriishna": "\nHi Pedrovgs,\ni had a problem with landscape view while using draggable panel, can u mention any hint or help to solve this feature.. i am trying to implement fullscreen mode... \n. Hi Pedrovgs,\nThanks for giving reply for my previous question, Hope you are doing well and busy with you work, i have one more doubt regarding draggable panel , if u have some free time can u clarify me ,  \nif we use \"draggableView.setTopViewHeight(topFragmentHeight);\" for top view fragment like 200 dip in  Portrait mode , when the screen is in landscape mode, still the topFragmentHeight is 200dp,  to show topview (video view) in full screen mode this is stopping me,  if we change topFragmentHeight  to 400 dp , in portrait mode it will bit more and in landscape view the top view(video view) will be fitted to fullscreen.. i guess this is stopping to load in full screen,, i tried from sidewith different approaches other than this way..\ncan u share your valuable inputs ..\n. ",
    "Ambilash": "Hi frank,\n    I have tried what you mentioned i am able to get resize transformer with youtube fragment but when minimized it seams that touches on minimized view is not recognized.It is not sliding to right or left for close its only maximizing.Can you update your code to sample.. ",
    "Swapnildhamale92": "Hi Frakc,\nI implemented your suggestions but the top video fragment is going below the screen,its not position well and also when minimized it seams that touches on minimized view is not recognized.It is not sliding to right or left for close its only maximizing... ",
    "dotgc": "I need to do this. I have a bottom view where user comments are shown and an EditText is provided for the viewing user to add comments. When the EditText gains focus and the keyboard is shown, I want to be able to overlay the bottom view on top of the top view. Right now, users can't even see the EditText box when the keyboard is open.\n. ",
    "tanaev": "Hi! When it will be in ready?  i saw solved problem in @ppamorim fork\n. @ppamorim hi! How you solve problem from previous comment?\n. @ppamorim  cool! Where i can found example?\n. Good! One more question! \nWhere i can get \nSpringSequencer, ZoomListener, RotateCallback \n?\n. @bqthuan when you call initializeView() its called draggableView.attachTopFragment(topFragment);\nvoid attachTopFragment(Fragment topFragment) {\n    addFragmentToView(R.id.drag_view, topFragment);\n  }\nthen \nprivate void addFragmentToView(final int viewId, final Fragment fragment) {\n    fragmentManager.beginTransaction().replace(viewId, fragment).commit();\n  }\nwhere viewId is R.id.drag_view by default\nso, for change top fragment, you need something like\ngetSupportFragmentManager().beginTransaction().replace(R.id.drag_view, YOUFRAGMENT).commit();\n. ",
    "oleynikd": "Any updates?\n. +1. Would be great\n. ",
    "bilalilyas90": "i want to use this same as youtube.... when in portrait work as default but  when landscape video is full screen.\nthank you\n. please guide me a little bit... i dont know what to do..\n. @frakc \nthanks... This works great but when in landscape mode , when i click on top view it goes to minimize..\nand in layout i even used this draggable_view:enable_click_to_minimize_view=\"false\"  but still it goes to minize view... can u help me here ?\n. @frakc \nthank you alot.... this tweak helped me... :)\n. one more thing... i am using vitamio player in my app with draggable panel draggableview and when I minimize the dragview the screen of video goes to white in minimized view but is good in maximized view... can u help me here too??\n. @frakc \nI am using vitamio player library.... sometimes video comes correct in minimized view and sometimes when I am in minimized state(at end of screen) screen goes white but when in maximized state and while dragging it is working fine... please help me.. screenshots are attached\nhttp://prntscr.com/6a0apy (sometimes correct)\nhttp://prntscr.com/69yge2 (while dragging)\nhttp://prntscr.com/69yfpa (in minimized state)\n. @frakc no problem... and by the way thanks for the help..\n. @ninja-tortoise \nyes I am also having same problem :( \n. ",
    "abbaskandemir": "Did you solve the problem ?. ",
    "sikandercb": "thanks to reply sir \ncan you please tell me how can i disable the dragging ...? mean setenable(false) or some thing like this.\nthere should be function like this setDraggedToMinimizeEnabled(false)\n. thanks i have already done this..:)\n. ",
    "DuongNTdev": "Hi sikandercb, i did try disable draggable view with the solution:\nIn draggable view, declare : \nprivate boolean isDisableDraggableView = false;\n@Override public boolean onInterceptTouchEvent(MotionEvent ev) {\nif(isDisableDraggableView) return false; // -> add to this\nif (!isEnabled()) {\nreturn false;\n}\n}\n@Override public boolean onTouchEvent(MotionEvent ev) {\nif(isDisableDraggableView) return false; // -> add to this\nint actionMasked = MotionEventCompat.getActionMasked(ev);\n}\nand use it:\ndisable : draggableView.setIsDisableDraggableView(true);\ndraggableView.setEnable(false);\nand enable \ndraggableView.setIsDisableDraggableView(false);\ndraggableView.setEnable(true);\n. /\n- Copyright (C) 2014 Pedro Vicente Gómez Sánchez.\n  \n- Licensed under the Apache License, Version 2.0 (the \"License\");\n- you may not use this file except in compliance with the License.\n- You may obtain a copy of the License at\n  \n- http://www.apache.org/licenses/LICENSE-2.0\n  \n- Unless required by applicable law or agreed to in writing, software\n- distributed under the License is distributed on an \"AS IS\" BASIS,\n- WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n- See the License for the specific language governing permissions and\n- limitations under the License.\n  */\n  package com.github.pedrovgs;\nimport android.content.Context;\nimport android.content.res.TypedArray;\nimport android.graphics.drawable.Drawable;\nimport android.support.v4.app.Fragment;\nimport android.support.v4.app.FragmentManager;\nimport android.support.v4.view.MotionEventCompat;\nimport android.support.v4.view.ViewCompat;\nimport android.support.v4.widget.ViewDragHelper;\nimport android.util.AttributeSet;\nimport android.view.MotionEvent;\nimport android.view.View;\nimport android.widget.RelativeLayout;\nimport com.github.pedrovgs.transformer.Transformer;\nimport com.github.pedrovgs.transformer.TransformerFactory;\nimport com.nineoldandroids.view.ViewHelper;\n/\n- Class created to extends a ViewGroup and simulate the YoutubeLayoutComponent\n  \n- @author Pedro Vicente Gómez Sánchez\n  /\n  public class DraggableView extends RelativeLayout {\nprivate static final int DEFAULT_SCALE_FACTOR = 2;\n  private static final int DEFAULT_TOP_VIEW_MARGIN = 30;\n  private static final int DEFAULT_TOP_VIEW_HEIGHT = -1;\n  private static final float SLIDE_TOP = 0f;\n  private static final float SLIDE_BOTTOM = 1f;\n  private static final float MIN_SLIDE_OFFSET = 0.1f;\n  private static final boolean DEFAULT_ENABLE_HORIZONTAL_ALPHA_EFFECT = true;\n  private static final boolean DEFAULT_ENABLE_CLICK_TO_MAXIMIZE = false;\n  private static final boolean DEFAULT_ENABLE_CLICK_TO_MINIMIZE = false;\n  private static final boolean DEFAULT_ENABLE_TOUCH_LISTENER = true;\n  private static final int MIN_SLIDING_DISTANCE_ON_CLICK = 10;\n  private static final int ONE_HUNDRED = 100;\n  private static final float SENSITIVITY = 1f;\n  private static final boolean DEFAULT_TOP_VIEW_RESIZE = false;\n  private static final int INVALID_POINTER = -1;\n  s\n  private int activePointerId = INVALID_POINTER;\n  private float lastTouchActionDownXPosition;\nprivate View dragView;\n  private View secondView;\n  private TypedArray attributes;\nprivate FragmentManager fragmentManager;\n  private ViewDragHelper viewDragHelper;\n  private Transformer transformer;\nprivate boolean enableHorizontalAlphaEffect;\n  private boolean topViewResize;\n  private boolean enableClickToMaximize;\n  private boolean enableClickToMinimize;\n  private boolean touchEnabled;\nprivate DraggableListener listener;\npublic DraggableView(Context context) {\n    super(context);\n  }\npublic DraggableView(Context context, AttributeSet attrs) {\n    super(context, attrs);\n    initializeAttributes(attrs);\n  }\npublic DraggableView(Context context, AttributeSet attrs, int defStyle) {\n    super(context, attrs, defStyle);\n    initializeAttributes(attrs);\n  }\n//DuontNT : workaround issue can't disable draggable view\nprivate boolean isDisableDraggableView = false;\n\npublic boolean isDisableDraggableView() {\n    return isDisableDraggableView;\n}\n\npublic void setIsDisableDraggableView(boolean isDisableDraggableView) {\n    this.isDisableDraggableView = isDisableDraggableView;\n}\n\npublic void disableDraggableView(){\n    setIsDisableDraggableView(true);\n    setEnabled(false);\n}\n\npublic void enableDraggableView(){\n    setIsDisableDraggableView(false);\n    setEnabled(true);\n}\n//end DuontNT\n\n/*\n  - Return if user can maximize minimized view on click.\n    /\n    public boolean isClickToMaximizeEnabled() {\n    return enableClickToMaximize;\n    }\n/\n  - Enable or disable click to maximize view when dragged view is minimized\n  - If your content have a touch/click listener (like YoutubePlayer), you\n  - need disable it to active this feature.\n    \n  - @param enableClickToMaximize to enable or disable the click.\n    /\n    public void setClickToMaximizeEnabled(boolean enableClickToMaximize) {\n    this.enableClickToMaximize = enableClickToMaximize;\n    }\n/*\n  - Return if user can minimize maximized view on click.\n    /\n    public boolean isClickToMinimizeEnabled() {\n    return enableClickToMinimize;\n    }\n/\n  - Enable or disable click to minimize view when dragged view is maximized\n  - If your content have a touch/click listener (like YoutubePlayer), you\n  - need disable it to active this feature.\n    \n  - @param enableClickToMinimize to enable or disable the click.\n    /\n    public void setClickToMinimizeEnabled(boolean enableClickToMinimize) {\n    this.enableClickToMinimize = enableClickToMinimize;\n    }\n/*\n  - Return if touch listener is enable or disable\n    /\n    private boolean isTouchEnabled() {\n    return this.touchEnabled;\n    }\n/\n  - Enable or disable the touch listener\n    \n  - @param touchEnabled to enable or disable the touch event.\n    /\n    public void setTouchEnabled(boolean touchEnabled) {\n    this.touchEnabled = touchEnabled;\n    }\n/\n  - Slide the view based on scroll of the nav drawer.\n  - \"setEnableTouch\" user prevents click to expand while the drawer is moving, it will be\n  - set to false when the @slideOffset is bigger than MIN_SLIDE_OFFSET.\n  - When the slideOffset is bigger than 0.1 and dragView isn't close, set the dragView\n  - to minimized.\n  - It's only possible to maximize the view when @slideOffset is equals to 0.0,\n  - in other words, closed.\n    \n  - @param slideOffset Value between 0 and 1, represent the value of slide:\n  - 0.0 is equal to close drawer and 1.0 equals open drawer.\n  - @param drawerPosition Represent the position of nav drawer on X axis.\n  - @param width Width of nav drawer\n    /\n    public void slideHorizontally(float slideOffset, float drawerPosition, int width) {\n    if (slideOffset > MIN_SLIDE_OFFSET && !isClosed() && isMaximized()) {\n      minimize();\n    }\n    setTouchEnabled(slideOffset <= MIN_SLIDE_OFFSET);\n    ViewHelper.setX(this, width - Math.abs(drawerPosition));\n    }\n/*\n  - Configure the horizontal scale factor applied when the view is dragged to the bottom of the\n  - custom view.\n    /\n    public void setXTopViewScaleFactor(float xScaleFactor) {\n    transformer.setXScaleFactor(xScaleFactor);\n    }\n/*\n  - Configure the vertical scale factor applied when the view is dragged to the bottom of the\n  - custom view.\n    /\n    public void setYTopViewScaleFactor(float yScaleFactor) {\n    transformer.setYScaleFactor(yScaleFactor);\n    }\n/\n  - Configure the dragged view margin right applied when the dragged view is minimized.\n    \n  - @param topFragmentMarginRight in pixels.\n    /\n    public void setTopViewMarginRight(int topFragmentMarginRight) {\n    transformer.setMarginRight(topFragmentMarginRight);\n    }\n/*\n  - Configure the dragView margin bottom applied when the dragView is minimized.\n    /\n    public void setTopViewMarginBottom(int topFragmentMarginBottom) {\n    transformer.setMarginBottom(topFragmentMarginBottom);\n    }\n/\n  - Configure the dragged view height.\n    \n  - @param topFragmentHeight in pixels\n    /\n    public void setTopViewHeight(int topFragmentHeight) {\n    transformer.setViewHeight(topFragmentHeight);\n    }\n/*\n  - Configure the disabling of the alpha effect applied when the dragView is dragged horizontally.\n    /\n    public void setHorizontalAlphaEffectEnabled(boolean enableHorizontalAlphaEffect) {\n    this.enableHorizontalAlphaEffect = enableHorizontalAlphaEffect;\n    }\n/*\n  - Configure the DraggableListener notified when the view is minimized, maximized, closed to the\n  - right or closed to the left.\n    /\n    public void setDraggableListener(DraggableListener listener) {\n    this.listener = listener;\n    }\n/*\n  - Configure DraggableView to resize top view instead of scale it.\n    /\n    public void setTopViewResize(boolean topViewResize) {\n    this.topViewResize = topViewResize;\n    }\n/*\n  - To ensure the animation is going to work this method has been override to call\n  - postInvalidateOnAnimation if the view is not settled yet.\n    /\n    @Override public void computeScroll() {\n    if (!isInEditMode() && viewDragHelper.continueSettling(true)) {\n      ViewCompat.postInvalidateOnAnimation(this);\n    }\n    }\n/*\n  - Maximize the custom view applying an animation to return the view to the initial position.\n    /\n    public void maximize() {\n    smoothSlideTo(SLIDE_TOP);\n    notifyMaximizeToListener();\n    }\n/*\n  - Minimize the custom view applying an animation to put the top fragment on the bottom right\n  - corner of the screen.\n    /\n    public void minimize() {\n    smoothSlideTo(SLIDE_BOTTOM);\n    notifyMinimizeToListener();\n    }\n/*\n  - Close the custom view applying an animation to close the view to the right side of the screen.\n    /\n    public void closeToRight() {\n    if (viewDragHelper.smoothSlideViewTo(dragView, transformer.getOriginalWidth(),\n        getHeight() - transformer.getMinHeightPlusMargin())) {\n      ViewCompat.postInvalidateOnAnimation(this);\n      notifyCloseToRightListener();\n    }\n    }\n/*\n  - Close the custom view applying an animation to close the view to the left side of the screen.\n    /\n    public void closeToLeft() {\n    if (viewDragHelper.smoothSlideViewTo(dragView, -transformer.getOriginalWidth(),\n        getHeight() - transformer.getMinHeightPlusMargin())) {\n      ViewCompat.postInvalidateOnAnimation(this);\n      notifyCloseToLeftListener();\n    }\n    }\n/\n  - Checks if the top view is minimized.\n    \n  - @return true if the view is minimized.\n    /\n    public boolean isMinimized() {\n    return isDragViewAtBottom() && isDragViewAtRight();\n    }\n/\n  - Checks if the top view is maximized.\n    \n  - @return true if the view is maximized.\n    /\n    public boolean isMaximized() {\n    return isDragViewAtTop();\n    }\n/\n  - Checks if the top view closed at the right place.\n    \n  - @return true if the view is closed at right.\n    /\n    public boolean isClosedAtRight() {\n    return dragView.getLeft() >= getWidth();\n    }\n/\n  - Checks if the top view is closed at the left place.\n    \n  - @return true if the view is closed at left.\n    /\n    public boolean isClosedAtLeft() {\n    return dragView.getRight() <= 0;\n    }\n/\n  - Checks if the top view is closed at the right or left place.\n    \n  - @return true if the view is closed.\n    /\n    public boolean isClosed() {\n    return isClosedAtLeft() || isClosedAtRight();\n    }\n/\n  - Override method to intercept only touch events over the drag view and to cancel the drag when\n  - the action associated to the MotionEvent is equals to ACTION_CANCEL or ACTION_UP.\n    \n  - @param ev captured.\n  - @return true if the view is going to process the touch event or false if not.\n    /\n    @Override public boolean onInterceptTouchEvent(MotionEvent ev) {\n    //DuontNT : workaround issue can't disable draggable view\n    if (isDisableDraggableView) return false;\n    if (!isEnabled()) {\n      return false;\n    }\n    switch (MotionEventCompat.getActionMasked(ev) & MotionEventCompat.ACTION_MASK) {\n      case MotionEvent.ACTION_CANCEL:\n      case MotionEvent.ACTION_UP:\n        viewDragHelper.cancel();\n        return false;\n      case MotionEvent.ACTION_DOWN:\n        int index = MotionEventCompat.getActionIndex(ev);\n        activePointerId = MotionEventCompat.getPointerId(ev, index);\n        if (activePointerId == INVALID_POINTER) {\n          return false;\n        }\n        break;\n      default:\n        break;\n    }\n    boolean interceptTap = viewDragHelper.isViewUnder(dragView, (int) ev.getX(), (int) ev.getY());\n    return viewDragHelper.shouldInterceptTouchEvent(ev) || interceptTap;\n    }\n/\n  - Override method to dispatch touch event to the dragged view.\n    \n  - @param ev captured.\n  - @return true if the touch event is realized over the drag or second view.\n    /\n    @Override public boolean onTouchEvent(MotionEvent ev) {\n    //DuontNT : workaround issue can't disable draggable view\n    if (isDisableDraggableView) return false;\n    int actionMasked = MotionEventCompat.getActionMasked(ev);\n    if ((actionMasked & MotionEventCompat.ACTION_MASK) == MotionEvent.ACTION_DOWN) {\n      activePointerId = MotionEventCompat.getPointerId(ev, actionMasked);\n    }\n    if (activePointerId == INVALID_POINTER) {\n      return false;\n    }\n    viewDragHelper.processTouchEvent(ev);\n    if (isClosed()) {\n      return false;\n    }\n    boolean isDragViewHit = isViewHit(dragView, (int) ev.getX(), (int) ev.getY());\n    boolean isSecondViewHit = isViewHit(secondView, (int) ev.getX(), (int) ev.getY());\n    analyzeTouchToMaximizeIfNeeded(ev, isDragViewHit);\n    if (isMaximized()) {\n      dragView.dispatchTouchEvent(ev);\n    } else {\n      dragView.dispatchTouchEvent(cloneMotionEventWithAction(ev, MotionEvent.ACTION_CANCEL));\n    }\n    return isDragViewHit || isSecondViewHit;\n    }\nprivate void analyzeTouchToMaximizeIfNeeded(MotionEvent ev, boolean isDragViewHit) {\n    switch(ev.getAction()) {\n      case MotionEvent.ACTION_DOWN:\n        lastTouchActionDownXPosition = ev.getX();\n        break;\n      case MotionEvent.ACTION_UP:\n        float clickOffset = ev.getX() - lastTouchActionDownXPosition;\n        if (shouldMaximizeOnClick(ev, clickOffset, isDragViewHit)) {\n          if (isMinimized() && isClickToMaximizeEnabled()) {\n            maximize();\n          } else if (isMaximized() && isClickToMinimizeEnabled()) {\n            minimize();\n          }\n        }\n        break;\n      default:\n        break;\n    }\n  }\npublic boolean shouldMaximizeOnClick(MotionEvent ev, float deltaX, boolean isDragViewHit) {\n    return (Math.abs(deltaX) < MIN_SLIDING_DISTANCE_ON_CLICK)\n        && ev.getAction() != MotionEvent.ACTION_MOVE\n        && isDragViewHit;\n  }\n/\n  - Clone given motion event and set specified action. This method is useful, when we want to\n  - cancel event propagation in child views by sending event with {@link\n  - android.view.MotionEvent#ACTION_CANCEL}\n  - action.\n    \n  - @param event event to clone\n  - @param action new action\n  - @return cloned motion event\n    /\n    private MotionEvent cloneMotionEventWithAction(MotionEvent event, int action) {\n    return MotionEvent.obtain(event.getDownTime(), event.getEventTime(), action, event.getX(),\n        event.getY(), event.getMetaState());\n    }\n/*\n  - Override method to configure the dragged view and secondView layout properly.\n    /\n    @Override protected void onLayout(boolean changed, int left, int top, int right, int bottom) {\n    if (isInEditMode())\n      super.onLayout(changed, left, top, right, bottom);\n    else if (isDragViewAtTop()) {\n      dragView.layout(left, top, right, transformer.getOriginalHeight());\n      secondView.layout(left, transformer.getOriginalHeight(), right, bottom);\n      ViewHelper.setY(dragView, top);\n      ViewHelper.setY(secondView, transformer.getOriginalHeight());\n    } else {\n      secondView.layout(left, transformer.getOriginalHeight(), right, bottom);\n    }\n    }\n/*\n  - Override method to map dragged view, secondView to view objects, to configure dragged\n  - view height and to initialize DragViewHelper.\n    /\n    @Override protected void onFinishInflate() {\n    super.onFinishInflate();\n    if (!isInEditMode()) {\n      mapGUI(attributes);\n      initializeTransformer(attributes);\n      attributes.recycle();\n      initializeViewDragHelper();\n    }\n    }\nprivate void mapGUI(TypedArray attributes) {\n    int dragViewId =\n        attributes.getResourceId(R.styleable.draggable_view_top_view_id, R.id.drag_view);\n    int secondViewId =\n        attributes.getResourceId(R.styleable.draggable_view_bottom_view_id, R.id.second_view);\n    dragView = findViewById(dragViewId);\n    secondView = findViewById(secondViewId);\n  }\n/*\n  - Configure the FragmentManager used to attach top and bottom Fragments to the view. The\n  - FragmentManager is going to be provided only by DraggablePanel view.\n    /\n    void setFragmentManager(FragmentManager fragmentManager) {\n    this.fragmentManager = fragmentManager;\n    }\n/\n  - Attach one fragment to the dragged view.\n    \n  - @param topFragment to be attached.\n    /\n    void attachTopFragment(Fragment topFragment) {\n    addFragmentToView(R.id.drag_view, topFragment);\n    }\n/\n  - Attach one fragment to the secondView.\n    \n  - @param bottomFragment to be attached.\n    /\n    void attachBottomFragment(Fragment bottomFragment) {\n    addFragmentToView(R.id.second_view, bottomFragment);\n    }\n/*\n  - Modify dragged view pivot based on the dragged view vertical position to simulate a horizontal\n  - displacement while the view is dragged.\n    /\n    void changeDragViewPosition() {\n    transformer.updatePosition(getVerticalDragOffset());\n    }\n/*\n  - Modify secondView position to be always below dragged view.\n    /\n    void changeSecondViewPosition() {\n    ViewHelper.setY(secondView, dragView.getBottom());\n    }\n/*\n  - Modify dragged view scale based on the dragged view vertical position and the scale factor.\n    /\n    void changeDragViewScale() {\n    transformer.updateScale(getVerticalDragOffset());\n    }\n/*\n  - Modify the background alpha if has been configured to applying an alpha effect when the view\n  - is dragged.\n    /\n    void changeBackgroundAlpha() {\n    Drawable background = getBackground();\n    if (background != null) {\n      int newAlpha = (int) (ONE_HUNDRED * (1 - getVerticalDragOffset()));\n      background.setAlpha(newAlpha);\n    }\n    }\n/*\n  - Modify the second view alpha based on dragged view vertical position.\n    /\n    void changeSecondViewAlpha() {\n    ViewHelper.setAlpha(secondView, 1 - getVerticalDragOffset());\n    }\n/*\n  - Modify dragged view alpha based on the horizontal position while the view is being\n  - horizontally dragged.\n    /\n    void changeDragViewViewAlpha() {\n    if (enableHorizontalAlphaEffect) {\n      float alpha = 1 - getHorizontalDragOffset();\n      if (alpha == 0) {\n        alpha = 1;\n      }\n      ViewHelper.setAlpha(dragView, alpha);\n    }\n    }\n/*\n  - Restore view alpha to 1\n    /\n    void restoreAlpha() {\n    if (enableHorizontalAlphaEffect && ViewHelper.getAlpha(dragView) < 1) {\n      ViewHelper.setAlpha(dragView, 1);\n    }\n    }\n/\n  - Check if dragged view is above the middle of the custom view.\n    \n  - @return true if dragged view is above the middle of the custom view or false if is below.\n    /\n    boolean isDragViewAboveTheMiddle() {\n    return transformer.isAboveTheMiddle();\n    }\n/\n  - Check if dragged view is next to the left bound.\n    \n  - @return true if dragged view right position is behind the right half of the custom view.\n    /\n    boolean isNextToLeftBound() {\n    return transformer.isNextToLeftBound();\n    }\n/\n  - Check if dragged view is next to the right bound.\n    \n  - @return true if dragged view left position is behind the left quarter of the custom view.\n    /\n    boolean isNextToRightBound() {\n    return transformer.isNextToRightBound();\n    }\n/\n  - Check if dragged view is at the top of the custom view.\n    \n  - @return true if dragged view top position is equals to zero.\n    /\n    boolean isDragViewAtTop() {\n    return transformer.isViewAtTop();\n    }\n/\n  - Check if dragged view is at the right of the custom view.\n    \n  - @return true if dragged view right position is equals to custom view width.\n    /\n    boolean isDragViewAtRight() {\n    return transformer.isViewAtRight();\n    }\n/\n  - Check if dragged view is at the bottom of the custom view.\n    \n  - @return true if dragged view bottom position is equals to custom view height.\n    /\n    boolean isDragViewAtBottom() {\n    return transformer.isViewAtBottom();\n    }\n/\n  - Calculate if one position is above any view.\n    \n  - @param view to analyze.\n  - @param x position.\n  - @param y position.\n  - @return true if x and y positions are below the view.\n    /\n    private boolean isViewHit(View view, int x, int y) {\n    int[] viewLocation = new int[2];\n    view.getLocationOnScreen(viewLocation);\n    int[] parentLocation = new int[2];\n    this.getLocationOnScreen(parentLocation);\n    int screenX = parentLocation[0] + x;\n    int screenY = parentLocation[1] + y;\n    return screenX >= viewLocation[0]\n        && screenX < viewLocation[0] + view.getWidth()\n        && screenY >= viewLocation[1]\n        && screenY < viewLocation[1] + view.getHeight();\n    }\n/\n  - Use FragmentManager to attach one fragment to one view using the viewId.\n    \n  - @param viewId used to obtain the view.\n  - @param fragment to be attached.\n    /\n    private void addFragmentToView(final int viewId, final Fragment fragment) {\n    fragmentManager.beginTransaction().replace(viewId, fragment).commit();\n    }\n/*\n  - Initialize the viewDragHelper.\n    /\n    private void initializeViewDragHelper() {\n    viewDragHelper = ViewDragHelper.create(this, SENSITIVITY, new DraggableViewCallback(this, dragView));\n    }\n/*\n  - Initialize Transformer with a scalable or change width/height implementation.\n    /\n    private void initializeTransformer(TypedArray attributes) {\n    topViewResize =\n        attributes.getBoolean(R.styleable.draggable_view_top_view_resize, DEFAULT_TOP_VIEW_RESIZE);\n    TransformerFactory transformerFactory = new TransformerFactory();\n    transformer = transformerFactory.getTransformer(topViewResize, dragView, this);\n    transformer.setViewHeight(attributes.getDimensionPixelSize(R.styleable.draggable_view_top_view_height,\n        DEFAULT_TOP_VIEW_HEIGHT));\n    transformer.setXScaleFactor(\n        attributes.getFloat(R.styleable.draggable_view_top_view_x_scale_factor,\n            DEFAULT_SCALE_FACTOR));\n    transformer.setYScaleFactor(\n        attributes.getFloat(R.styleable.draggable_view_top_view_y_scale_factor,\n            DEFAULT_SCALE_FACTOR));\n    transformer.setMarginRight(\n        attributes.getDimensionPixelSize(R.styleable.draggable_view_top_view_margin_right,\n            DEFAULT_TOP_VIEW_MARGIN));\n    transformer.setMarginBottom(\n        attributes.getDimensionPixelSize(R.styleable.draggable_view_top_view_margin_bottom,\n            DEFAULT_TOP_VIEW_MARGIN));\n    }\n/\n  - Initialize XML attributes.\n    \n  - @param attrs to be analyzed.\n    /\n    private void initializeAttributes(AttributeSet attrs) {\n    TypedArray attributes = getContext().obtainStyledAttributes(attrs, R.styleable.draggable_view);\n    this.enableHorizontalAlphaEffect =\n        attributes.getBoolean(R.styleable.draggable_view_enable_minimized_horizontal_alpha_effect,\n            DEFAULT_ENABLE_HORIZONTAL_ALPHA_EFFECT);\n    this.enableClickToMaximize =\n        attributes.getBoolean(R.styleable.draggable_view_enable_click_to_maximize_view,\n            DEFAULT_ENABLE_CLICK_TO_MAXIMIZE);\n    this.enableClickToMinimize =\n        attributes.getBoolean(R.styleable.draggable_view_enable_click_to_minimize_view,\n            DEFAULT_ENABLE_CLICK_TO_MINIMIZE);\n    this.attributes = attributes;\n    }\n/\n  - Realize an smooth slide to an slide offset passed as argument. This method is the base of\n  - maximize, minimize and close methods.\n    \n  - @param slideOffset to apply\n  - @return true if the view is slided.\n    /\n    private boolean smoothSlideTo(float slideOffset) {\n    final int topBound = getPaddingTop();\n    int x = (int) (slideOffset * (getWidth() - transformer.getMinWidthPlusMarginRight()));\n    int y = (int) (topBound + slideOffset * getVerticalDragRange());\n    if (viewDragHelper.smoothSlideViewTo(dragView, x, y)) {\n      ViewCompat.postInvalidateOnAnimation(this);\n      return true;\n    }\n    return false;\n    }\n/*\n  - @return configured dragged view margin right configured.\n    /\n    private int getDragViewMarginRight() {\n    return transformer.getMarginRight();\n    }\n/*\n  - @return configured dragged view margin bottom.\n    /\n    private int getDragViewMarginBottom() {\n    return transformer.getMarginBottom();\n    }\n/\n  - Calculate the dragged view left position normalized between 1 and 0.\n    \n  - @return absolute value between the dragged view  left position divided by custon view width\n    /\n    private float getHorizontalDragOffset() {\n    return (float) Math.abs(dragView.getLeft()) / (float) getWidth();\n    }\n/\n  - Calculate the dragged view  top position normalized between 1 and 0.\n    \n  - @return dragged view top divided by vertical drag range.\n    /\n    private float getVerticalDragOffset() {\n    return dragView.getTop() / getVerticalDragRange();\n    }\n/\n  - Calculate the vertical drag range between the custom view and dragged view.\n    \n  - @return the difference between the custom view height and the dragged view height.\n    /\n    private float getVerticalDragRange() {\n    return getHeight() - transformer.getMinHeightPlusMargin();\n    }\n/*\n  - Notify te view is maximized to the DraggableListener\n    /\n    private void notifyMaximizeToListener() {\n    if (listener != null) {\n      listener.onMaximized();\n    }\n    }\n/*\n  - Notify te view is minimized to the DraggableListener\n    /\n    private void notifyMinimizeToListener() {\n    if (listener != null) {\n      listener.onMinimized();\n    }\n    }\n/*\n  - Notify te view is closed to the right to the DraggableListener\n    /\n    private void notifyCloseToRightListener() {\n    if (listener != null) {\n      listener.onClosedToRight();\n    }\n    }\n/*\n  - Notify te view is closed to the left to the DraggableListener\n    /\n    private void notifyCloseToLeftListener() {\n    if (listener != null) {\n      listener.onClosedToLeft();\n    }\n    }\npublic int getDraggedViewHeightPlusMarginTop() {\n    return transformer.getMinHeightPlusMargin();\n  }\n  }\nI can't commit to your git because i dont' have permission\n. sorry, i can't find that method in DraggableView\n. can you make snippet code for me, thanks u\n. thanks for support, i do solved problem.\nIn draggable view, declare : \nprivate boolean isDisableDraggableView = false;\n@Override public boolean onInterceptTouchEvent(MotionEvent ev) {\n    if(isDisableDraggableView) return false; // -> add to this\n    if (!isEnabled()) {\n      return false;\n    }\n}\n@Override public boolean onTouchEvent(MotionEvent ev) {\n    if(isDisableDraggableView) return false; // -> add to this\n    int actionMasked = MotionEventCompat.getActionMasked(ev);\n}\nand in my fragment, solved:\nskProgress.setOnTouchListener(new View.OnTouchListener() {\n            @Override\n            public boolean onTouch(View v, MotionEvent event) {\n                int action = event.getAction();\n                switch (action){\n                    case MotionEvent.ACTION_DOWN:\n                        draggableView.setIsDisableDraggableView(true);\n                       draggableView.setEnable(false);\n                        break;\n                    case MotionEvent.ACTION_CANCEL:\n                    case MotionEvent.ACTION_UP:\n                        draggableView.setIsDisableDraggableView(false);\n                       draggableView.setEnable(true);\n                        break;\n                }\n                return false;\n            }\n        });\nTkz u and close my issue :)\n. ",
    "Johannes11833": "this works \ndraggableView.setOnTouchListener(new View.OnTouchListener() {\n                    @Override\n                    public boolean onTouch(View v, MotionEvent event) {\n                        if (getResources().getConfiguration().orientation == Configuration.ORIENTATION_LANDSCAPE) {\n                            mMediaController.dispatchTouchEvent(event);\n                            return true;\n                        }else{\n                            return false;\n                        }\n                    }\n                });. ",
    "redwerk": "Hi,\nHere is PR #83  for this enhancement:)\nThanks for great lib!\n. Hi @pedrovgs ,\nSorry for the long delay response.\nI've changed quotes as you wanted.\nChanging from target sdk from 19 to 20 was a mistake, sorry about that. Fixed too.\ngetSupportActionBar() now can be found be compiler.\nThanks!\n. @pedrovgs, I've updated this fix, but it fails again and again, i guess you have to update gradle wrapper to 2.8 version, because everything is ok on my machine and device.\n. ",
    "JoysonF": "Thanks pedrovgs for your prompt reply. Using setClickToMaximizeEnabled  solved my query .However When using the attritube in layout file gave me the following error :Error:(17) No resource identifier found for attribute 'enable_click_to_maximize' in package 'com.github.pedrovgs.sample'.\n. Yes pedrovgs, I am editing in the sample project you provided.\n. Yes Sure.\n\n. Yes. Thanks Again For the library :+1:  .\n. ",
    "Mariovc": "The videoView goes out of the screen (to the right of it) while a black background is perfectly rotated and transalated.\nSeems to be working on my phone with \"TV Shows\" but not with \"VideoView\". \nTesting with Android 5.1. Is it working for you, guys?\n. ",
    "eneim": "@pedrovgs Oh so sorry, I push this right before my bed time. Not many experiences with Travis, but I'll fix it. It seems to be errors related to gradle version and Android Build Tools version.\n. Hm, I 'changed' your travis.yml but it turns out not to be a good try, since It will affect others' PR and may cause more problems. I will revert it and fix my local build tool. Pardon me!\n. hm @pedrovgs , using Math.abs(dragView.getLeft()) to get horizontal alpha when you drag the view to the left will end up an unexpected value when the view's left bound out of screen (its left value become negative then the alpha will increase). Is that your expected value? Or else I think we can use\n(dragView.getRight() - dragView.getLeft())/2\nwhich will use dragView's center location to determine alpha value, which I suppose could get better alpha effect.\nI found some other math stuff that need to be corrected too, please tell me if you are pleasure if I take care of them.\nBest regard.\n. I'll create a better PR later\n. ",
    "yangxuan0261": "I have same problem, how to fix it? plz help.\n. ",
    "bqthuan": "@tanaev Did you test your solution? It's not working for me.\n. ",
    "andreimarinescu": "I'm having the same issue, I'm unable to change the view hierarchy of the top fragment. The only thing that worked indeed was calling a requestLayout on the bottom fragment with a 500 ms delay (when doing it instantly, the touch would also have issues and onMaximize would be called each time i touched the top fragment).\nAny way of doing this elegantly?\n. ",
    "ChunJR": "Hi @FunnyDevs try to use DraggablePanel replace DraggableView. It will work !\n. Hi, i facing this issue too .. this is my fullscreen code:\n@Override\n    public void onConfigurationChanged(final Configuration newConfig) {\n        // TODO Auto-generated method stub\n        super.onConfigurationChanged(newConfig);\n```\n    if (getActivity().getResources().getConfiguration().orientation \n                                                == Configuration.ORIENTATION_LANDSCAPE) {\n    Display display = getActivity().getWindowManager().getDefaultDisplay();\n\n    Point size = new Point();\n    display.getSize(size);\n\n    MyActivity.draggablePanel.setTopViewHeight(size.y);\n\n```\n//          MyActivity.draggablePanel.initializeView(); // i used this and it fullscreen but i can't touch my mediaplayer control\n```\n        Toast.makeText(getActivity(), \"landscape\", Toast.LENGTH_SHORT).show();\n    } else if (getActivity().getResources().getConfiguration().orientation \n                                                == Configuration.ORIENTATION_PORTRAIT) {\n    Resources r = getResources();\n    int px = (int) TypedValue.applyDimension(\n            TypedValue.COMPLEX_UNIT_DIP, 360, r.getDisplayMetrics());\n\n    MyActivity.draggablePanel.setTopViewHeight(px);\n\n    Toast.makeText(getActivity(), \"portraite\", Toast.LENGTH_SHORT).show();\n}\n\n}\n```\n. Thank you @Nguyenduylinh1402  ^^, it's work perfectly !\n. ",
    "yongsunCN": "@Glurt thank you for solving my problem! This should really be fixed or at least noted in the readme. \n. ",
    "Nguyenduylinh1402": "@ChunJR \n// MyActivity.draggablePanel.initializeView(); // i used this and it fullscreen\nWith your code, it work with draggableView, but with draggablePannel, it not work. If you use draggablepannel, Please show me more code.\n. Hi @ChunJR \n@Override\nprotected void onCreate(Bundle savedInstanceState) {\n    super.onCreate(savedInstanceState);\n    setContentView(R.layout.activity_main);\n    draggablePanel = (DraggablePanel) findViewById(R.id.draggable_panel);\n    Frag_Top = new Fragment_Top();\n    Frag_Bot = new Fragment_Bot();\n//init hookDraggableListener() first.\n    hookDraggableListener();\n    initializeDraggablePanel();\n}\nChange order code like that. Try it.\n. @ChunJR \nWhich exactly case you want to change top height ?\nIf you want change when rotate screen in landscape mode, you just create landscape file dimens.xml but it will destroy your topview and recreate it(You have to disable orientation config).\n. ",
    "usmanrana07": "@tuncaulubilge your solution works.. ",
    "royalviki007": "Hi,\nI wanted to achieve diagonal slide animation similar to youtube.\nI have made  changes on updatePosition method in ScaleTransformer class to calculate the new pivotX for landscape mode to drag the top fragment diagonally.\npublic void updatePosition(float verticalDragOffset) {\n            float maxScaleFactor = (1 - (1 / getXScaleFactor()));\n            int actualWidth = (int) getMinWidthPlusMarginRight();\n            int finalWidth = (int) (getMinWidthPlusMarginRight() * maxScaleFactor);\n            int translatedWidth = actualWidth - finalWidth;\n            int totalTanslatedWidth = getParentView().getWidth() - finalWidth;\n            xPosition = (int) (actualWidth * 1.0f / translatedWidth * totalTanslatedWidth);\n            ViewHelper.setPivotX(getView(), xPosition);\n            ViewHelper.setPivotY(getView(), getView().getHeight() - getMarginBottom());\n  }\nThis enable me to drag the video(Top Fragment)  from top left to bottom right in landscape mode, after settling down at bottom right, not able to drag vertically , only horizontal drag was working.\nAs I am playing with scaling the view, its actual properties remain the same. which is make it fail for isViewHit method of ViewHelper.\nThanks ..\n. ",
    "DanhDueExOICTIF": "Ok. Thank sir!\n. ",
    "LouisLin0706": "\nThis is the problem i use the DraggablePanel 1.9 , setting topView resize \"true\" , there is still have some margin top for topView , Is there have any problem like this and fix it ?\n. ",
    "oiramcro": "Hi, please implement this since this I quite annoying. \nThanks very much\n. ",
    "rencsaridogan": "@pedrovgs I've implemented a change for anyone to be able to choose any rotation they like for the panel to work (Default is all), implemented the changes and applied the improvements we've discussed. ExoPlayer example is not added yet, working on that to prepare the best example to work on. \nAfter the review you can merge this without waiting the example version. After the fixes and improvements it shouldn't effect the current version anyhow. Instead it should be adding the new features.\nBest regards,\nRenç Sarıdoğan.\n. In case of usage a video player such as ExoPlayer, this processes the drag event when you try to hover the player controls, breaks the user experience about controlling the player. A control has been added for that purpose. Could be optional for people who doesn't have hover for player controls and aims to drag even on Landscape.\n. Working on it.\n. I'll be formatting the code with the correct checkstyle along with the other changes.\n. You are right. Since the alpha is modified constantly in that case, removing the extra timers and handling the notifiers within the alpha change sounds logical. I'll be implementing and testing that version. Thanks!\n. @pedrovgs While I'm coding the changes through, I will add a sample for ExoPlayer along with others for the purpose of improving usage of both components together. I believe since industry is focused on using ExoPlayer based players, so this could be great to give it a full support!\n. @pedrovgs I thought it is better to give all the options (all, landscape, portrait) for the user, in case of different needs I'll be adding a flag to support all of those to trigger touch events. You can check it out after the commit with new implementations.\n. ",
    "Shuhrat-java": "I think it is because of you are using SurfaceView. Use TextureView instead of it. Problem should go away and never return back :).\n. ",
    "ameruddinjamil": "Hi there,\nNope, still no solution.\nOn 5 May 2016 22:43, \"Tunca Ulubilge\" notifications@github.com wrote:\n\nCould you find any solutions to this issue? Tried several methods but no\nluck\n—\nYou are receiving this because you authored the thread.\nReply to this email directly or view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/88#issuecomment-217172594\n. \n",
    "phamvansy": "Try:\nedit below line in DraggableView\ndraggable_view:top_view_id=\"@+id/frameLayout_videoView\"\nto\ndraggable_view:top_view_id=\"@+id/activity_video_layout\"\n. ",
    "Taranlayal10": "Hi Perdrovgs,\n  Thanks for your reply. I couldn't reply before coz I was working on some other thing. As you suggested I have tried setting the Y scale. Below is the code for that.\nif (NavigationManager.getInstance().getDraggablePanel() != null && NavigationManager.getInstance().getDraggablePanel().isMinimized()) {\n                    NavigationManager.getInstance().getDraggablePanel().setYTopViewScaleFactor((float)100);\n                }\nBut it does not work and however it does not seem to be a right way though as it may cause other issues like clicking on view and maximizing it again etc.\nIf you could suggest any other option that would be very helpful and also It is a must have feature also as your library is popular worldwide now. So hopefully if you could spend sometime on it.\nThanks\n. ",
    "b00n12": "Hi,\nI have a solution for this in my fork.. Hi, i use the KeyBoardVisibilityEvent library in order to move the draggableview above the keyboard. So you have to set a listener for keyboardvisibilityevent to get it working:\nKeyboardVisibilityEvent.setEventListener(this, draggableView);\nI will provide an example and issue a pull request as soon as I have time.. ",
    "srikanthsunkari": "hi @b00n12, I check in your fork I could see that draggable panel still behind the keypad. It can't move up of keypad. It'd be really helpful if you point me where to find the change in your fork.. Hi @b00n12,Thanks for update, It would be great if you will give pull request as soon as possible.. ",
    "DawinderGill": "Hi\nThanks for reply.\nThat issue is resolved but these are some new issues.\n1. I am using video view in top dragable view. Can you please tell me how\nto make this video view fullscreen on button click because it creates\nproblems when we make ot full screen.\n2. Is the any option in this library to disable dragable method because i\nwant to disable dragable functionality when user on landscape mode.\nPlease reply me as soon as possible.\nThanks\nOn Monday 29 August 2016, Pedro Vicente Gómez Sánchez \nnotifications@github.com wrote:\n\nHi @DawinderGill https://github.com/DawinderGill to be able to help you\nI need more information:\n- Version of the library you are using.\n- Layout configured using the library.\n- Code initializing the library.\n- Version of the Android SDK used to build the APK and the target sdk\n  configured.\nThe easiest way for providing this information is to create a sample\nproject reproducing the bug :)\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/98#issuecomment-243057370,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AIMwe7T7t6tuZOAMP7jx8R4w4xoRueE2ks5qkpEigaJpZM4Jr-GJ\n.\n. Right now issue is not resolved. Will tell you if i got any solution.\n\nOn Thursday 15 September 2016, Black Quan notifications@github.com wrote:\n\nHi,\nI got a same issue, can you tell me how to fix\nFor more info:\n- compileSdkVersion 23\n- buildToolsVersion \"23.0.2\"\n- minSdkVersion 16\n- targetSdkVersion 23\n- compile 'com.github.pedrovgs:draggablepanel:1.9'\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/98#issuecomment-247356164,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AIMwe0K9-vZSa-O97JVmAVzEl30Vdx4Lks5qqV-CgaJpZM4Jr-GJ\n.\n. Yes @Blackquan for right or left wipe i am using dragable view and i have implement all again with reference of this library sample. Then this problem have been solved. You can also try this. :)\n. No problem bro.\nYes this sample.\n\nOn Thursday 15 September 2016, Black Quan notifications@github.com wrote:\n\nthis library sample?\nCan you explain in detail? Sorry i am newbie\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/98#issuecomment-247373894,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AIMwe_T_jI25rsOJX5ctokPfk3t5qjahks5qqW3CgaJpZM4Jr-GJ\n.\n. You are using dependecy or import library??\n\nOn Thursday 15 September 2016, Black Quan notifications@github.com wrote:\n\ni just did it, still not work for me :(\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/98#issuecomment-247381791,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AIMwe8WIrYU52G9l_IzCNQQKHpDNl-egks5qqXRSgaJpZM4Jr-GJ\n.\n. Ok friend\nI am not sure about this but this library having this issue. First time i\nhave also face this problem. After that i have implement 4th type in sample\ni.e where they play spiderman movie trailer. Try that one once hope this\nwill be solved.\nOtherwise you have to talk with support team.\n\nOn Thursday 15 September 2016, Black Quan notifications@github.com wrote:\n\nalready in 2 way :(\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/98#issuecomment-247384041,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AIMwe7zTCJDk9wmcL407GvrwiEbRGCjdks5qqXZvgaJpZM4Jr-GJ\n.\n. Hi @pedrovgs \n\nI am also facing same issue. Please tell me if you found any solution.\nThanks\n. No problem i future if you got any please tell. For the timing i am going to next activity to make videoview landscape but by this we are not able to play buffered video in portrait mode. We can just seek video and prepare it again. ;(\n. ",
    "Blackquan": "Hi,\nI got a same issue, can you tell me how to fix\nFor more info:\n- compileSdkVersion 23\n- buildToolsVersion \"23.0.2\"\n- minSdkVersion 16\n- targetSdkVersion 23\n- compile 'com.github.pedrovgs:draggablepanel:1.9'\n. this library sample?\nCan you explain in detail? Sorry i am newbie\n. i just did it, still not work for me :(\n. already in 2 way :(\n. ",
    "GaNhep": "I finally fixed this \"bug\", but don't know why this happen.\nfollwing the examples, if you have the top layout (A) and the bottom layout (B) inside the draggble view layout, there are 2 way to arrange them.\n1: draggbleView(A, B) -> couldn't work\n2: draggbleView(B,A) -> it works like a champ\ncan anyone explan why?\n. ",
    "tainangtk9": "\nI finally fixed this \"bug\", but don't know why this happen.\nfollwing the examples, if you have the top layout (A) and the bottom layout (B) inside the draggble view layout, there are 2 way to arrange them.\n1: draggbleView(A, B) -> couldn't work\n2: draggbleView(B,A) -> it works like a champ\ncan anyone explan why?\n\nit's working 👍  many thank you GaNhep!! i dont know why . ",
    "prabhumallappa": "Hi @pedrovgs , I know about the portrait gap. My issue is to support the library in landscape mode. When I rotate the device to landscape mode, the top fragment width is not taking full screen. This  happens  if I use draggable panel. But if I use draggable view from your library, the top view width takes full screen but the top view resizes and hence it does not look good .\nSo if I  use draggable panel , the top fragment does not takes full screen width.\nAlso, I have seen one more different scenario, If I launch the app, and rotate the device to landscape without minimize the draggable panel, then the top fragment is taking full screen width .\nPlease help me to support draggable panel in landscape mode.\n. No I didn't get any solution.\nOn Sep 15, 2016 9:27 PM, \"DawinderGill\" notifications@github.com wrote:\n\nHi @pedrovgs https://github.com/pedrovgs\nI am also facing same issue. Please tell me if you found any solution.\nThanks\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/pedrovgs/DraggablePanel/issues/99#issuecomment-247370578,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AOtMnXKaQUtzlsTAuV0efnx-CMSoFikqks5qqWr6gaJpZM4JxRPd\n.\n. \n",
    "anhbinhvodanh": "Have any solution for this problem?\nThank. ",
    "manhhoangxuan": "Thanks for your responding Mr @pedrovgs \nFirst problem, i have move my bottombar to first layer (as you said) and this problem is ok\nHowever, the second problem is \"Cannot move Top player down/up when bottombar hide/show\" by  setTopFragmentMarginBottom still not working.\nI would like move Top Miniplayer down/up when my bottombar hide/show (i have attacked screen shot for more clear) but i can't ( I have changed setTopFragmentMarginBottom but it's not working)\nThanks\n\n\n. Hi @pedrovgs \nAs you see, i have  setTopFragmentMarginBottom(60dp) from start for miniplayer above bottom menu\nHowever, when bottom menu is hide, i have used setTopFragmentMarginBottom(0) to move down Miniplayer but it's not working\nDo you have any solution here?\nThanks . Hi @pedrovgs \nI have called this code to move down miniplayer\nmContainerDraggable.setTopFragmentMarginBottom(0);\nmContainerDraggable.invalidate();\nAnd this code to move up miniplayer \nmContainerDraggable.setTopFragmentMarginBottom(getResources().getDimensionPixelSize(R.dimen.top_fragment_margin_x));\nmContainerDraggable.invalidate();\nHowever, It's not working, miniplayer position is nothing changed\n. Hi @pedrovgs \nPlease help\nDo you have any solution for this problem?. ",
    "nitinrana": "I have the same problem. I am not able to slide or maximize DraggableView once minimized. Could you please help me to solve this problem.. This is my project layout .  Could you please help me to solve this problem.\n<RelativeLayout xmlns:android=\"http://schemas.android.com/apk/res/android\"\n    android:id=\"@+id/ll_container\"\n    android:layout_width=\"match_parent\"\n    android:layout_height=\"match_parent\"\n    android:background=\"@color/white\">\n<ListView\n    android:id=\"@+id/list_view\"\n    android:layout_width=\"match_parent\"\n    android:layout_height=\"fill_parent\"\n    android:dividerHeight=\"1dp\">\n\n</ListView>\n\n<com.github.pedrovgs.DraggableView xmlns:android=\"http://schemas.android.com/apk/res/android\"\n    xmlns:draggable_view=\"http://schemas.android.com/apk/res-auto\"\n    android:id=\"@+id/draggable_view\"\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:background=\"@color/white\"\n    draggable_view:bottom_view_id=\"@+id/ll\"\n    draggable_view:top_view_height=\"200dp\"\n    draggable_view:top_view_id=\"@+id/image1\"\n    draggable_view:top_view_margin_bottom=\"@dimen/top_fragment_margin\"\n    draggable_view:top_view_margin_right=\"@dimen/top_fragment_margin\"\n    draggable_view:top_view_x_scale_factor=\"@dimen/x_scale_factor\"\n    draggable_view:top_view_y_scale_factor=\"@dimen/y_scale_factor\">\n\n\n    <ImageView\n        android:id=\"@+id/image1\"\n        android:layout_width=\"match_parent\"\n        android:layout_height=\"wrap_content\" />\n\n    <LinearLayout\n        android:id=\"@+id/ll\"\n        android:layout_width=\"match_parent\"\n        android:layout_height=\"wrap_content\"\n        android:background=\"@color/white\"\n        android:orientation=\"vertical\">\n\n        <TextView\n            android:id=\"@+id/textView\"\n            android:layout_width=\"match_parent\"\n            android:layout_height=\"wrap_content\"\n            android:gravity=\"center\" />\n\n    </LinearLayout>\n\n</com.github.pedrovgs.DraggableView>\n\n`. Thank you. ",
    "adesueb": "hi all, \nthe important thing is your video must specified on bottom \nand your background or description view is specified on top and do not forget to add \n          android:layout_below=\"@+id/drag_view to your description\"\n(drag_view is not in your layout xml but do not make it confuse, just add it)\nthe video must specified on bottom but actually your video is on top of description. So the simple sample \nlooks like :\n<drag>\n  <desc\n    android:layout_below=\"@+id/drag_view />\n  <video />\n</drag>. <ListView\n    android:id=\"@+id/list_view\"\n    android:layout_width=\"match_parent\"\n    android:layout_height=\"fill_parent\"\n    android:dividerHeight=\"1dp\"/>\n<com.github.pedrovgs.DraggableView xmlns:android=\"http://schemas.android.com/apk/res/android\"\n    xmlns:draggable_view=\"http://schemas.android.com/apk/res-auto\"\n    android:id=\"@+id/draggable_view\"\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:background=\"@color/white\"\n    draggable_view:bottom_view_id=\"@+id/ll\"\n    draggable_view:top_view_height=\"200dp\"\n    draggable_view:top_view_id=\"@+id/image1\"\n    draggable_view:top_view_margin_bottom=\"@dimen/top_fragment_margin\"\n    draggable_view:top_view_margin_right=\"@dimen/top_fragment_margin\"\n    draggable_view:top_view_x_scale_factor=\"@dimen/x_scale_factor\"\n    draggable_view:top_view_y_scale_factor=\"@dimen/y_scale_factor\">\n    <LinearLayout\n        android:id=\"@+id/ll\"\n        android:layout_width=\"match_parent\"\n        android:layout_height=\"wrap_content\"\n        android:layout_below=\"@+id/drag_view\"\n        android:background=\"@color/white\"\n        android:orientation=\"vertical\">\n        <TextView\n            android:id=\"@+id/textView\"\n            android:layout_width=\"match_parent\"\n            android:layout_height=\"wrap_content\"\n            android:gravity=\"center\" />\n    </LinearLayout>\n    <ImageView\n        android:id=\"@+id/image1\"\n        android:layout_width=\"match_parent\"\n        android:layout_height=\"wrap_content\" />\n</com.github.pedrovgs.DraggableView>\ni hope that will help you.. . you're welcome.. . ",
    "shuBomb": "@adesueb  : Thanks alot dude. ",
    "SarthakJoshi": "What can I do about this bug?. ",
    "thushcapone": "Hello @pedrovgs.\nFirst things first, thank you for this amazing library.\nAs for this bug that am encountering now, I don't understand the issue, can you explain it to me to help me solve it  as If I understand you already know about it!. ",
    "raazvengala": "In \"isMinimized()\" method of \"DraggableView\" class, replace \nreturn isDragViewAtBottom() && isDragViewAtRight();\nthat above line with\nreturn isDragViewAtBottom();\n. ",
    "GabrielHobold": "@vtproduction Have you found a solution for this?. ",
    "vtproduction": "Not yet.. ",
    "HamidZandi": "for me Dragable is cropping the video and scaleFactor not working :(. ",
    "awaistoor": "Did anyone manage to find any solution for this? . ",
    "bakikocak": "I am able to install and run the sample app by typing following command in Android Studio:\n./gradlew installDebug\n. Looks like nobody has any idea on this.. ",
    "jbmlaird": "Commenting out the clampViewPositionHorizontal override method will disable horizontal swiping.. To avoid the issue I downloaded a local copy of the repository and removed the NineOldAndroids dependency and it worked as expected.\nThis is just a band-aid and am curious for a proper fix.. "
}