{
    "pinggod": "嗨，谢谢你的贡献，不过目前还是请在自己的仓库维护独立的分支，不要给 pull request。\n. First, page.excerpt is supported by Hexo.\nSecond, please show me code.\nLast, please send me mail: pinggodstudio@gmail.com\n. Thanks!\n. Thanks for your advise : )\nIt was merged and the styles was updated for it, but all may be changed someday.\n. 这种方式过于简单粗暴，会影响行文的美观。如果用户想使用该主题，请按规范来做。\n欢迎 fork 之后自定义修改。\n. @likev \nDone, thx : )\n. thx :)\n. Thx :)\n. Thx :)\n. Thx:)\nThe relevant tag elements will be discard from the document directly.\n. Thank you so much for these jobs @bdupharm.\nBUT this theme will no longer accepts new features，even should be cut something to return the original ideals - clean, clean and clean!\nFork this theme and create your customize theme is free :)\n. @LumpyChen \n该主题不再接受新的特性，fork 项目之后可以随意发挥。\n. 该主题不接受新特性，请 fork 之后自由修改。\n. Dont accept new features.. Fork this project and do any thing new features.. Thanks for your good job,  and I will add it.. ",
    "edagarli": "\n每一页的最后一个post item出现乱码。我怀疑是Next按钮引起的。\n. 我刚才看了看没啥问题，但是有一页很奇怪，变成这样了。\n\n. 不是语法错误的问题。刚才我把你的markdown文章\n\nReact 组件的生命周期\n\n放进去还是出现乱码\n. 已经解决，～本地环境的问题。\n. ",
    "leonewang": "我觉得可能是你的 markdown 语法问题\n. ",
    "Manjiz": "发现已经有了\n. ",
    "0x333333": "Thanks :D \n. ",
    "likev": "很多人不知道需要用 <!-- more --> 这样的方式来生成摘要，我也是 Google 搜索才知道。你可以在使用文档中说明一下。\n. ",
    "notbdu": "Ohh okay gotcha. Yea I''ll just continue customizing with my forked theme then. \nP.S. Looked around for a bit and settled on your theme. It really is very clean and simple. The guys at work like it too. Good job man!\n. ",
    "LumpyChen": "\nThe effect looks like this.\n. ",
    "ghost": "Okay... I see that this repo is no longer admitting new features, and people should therefore work with their own forks respectively... But I still like to argue that my pull request is not a new feature: It adds nothing new. Even if you are not updating on this repo, it might help others who fork it... Anyway the decision is up to you^_^ and thank you for creating such a wonderful theme.\n. ",
    "JLHwung": "Personally I am disappointed that this feature is not merged as there is not any visual difference for normal users while it does offer convenience for sighted users.\nAnyway, please state feature policy on readme.md. Good for potential contributors.. You are very welcome.. ",
    "cheerx": "我用Disqus了，你可以自己搞一个哈. ",
    "imkiva": "太棒了 👍 . ",
    "hanxiao": "若使用@tonghuashuai 的修改，需要在_config.yml的页面链接处加'/'例如\nyaml\nmenu:\n    About: /about/\n    Archive: /archives/\n而不是\nyaml\nmenu:\n    About: /about\n    Archive: /archives. "
}