{
    "pires": "This crash is related to SpeedObdCommandresult parsing. Perhaps the response is invalid for that request! Will look at it for release 2.0.\n. @jabyeah can you try with the latest code?\n. Can you please describe the value the ECU returns? Preferably in byte notation.\n. Yeah, I'm closing whenever that gets implemented.\n. This has been implemented in obd-java-api v0.10, https://github.com/pires/obd-java-api/commit/f5c4361500558d9f80516a3b35263d4694fc8721. Anyone care to try it?\n. Awesome!\n. Thanks :-)\n. Fixed with 8f0a19d33e17d47f912f440fd509aa4de1baa102\n. This is closed now @nomwerp, right?\n. Implemented in obd-java-api 0.5 release.\n. Thanks for your support. We'll be in touch next week.\n. OK, so I'm about to receive a Nexus 7 and will be able to get this fixed really soon. Keep with me :-)\n. Hi @kenticus. I've just released a new version of the API (which now is a separate project) and am in the middle of improving the app but am having issues with Android Studio (bummer!).\nAlso, and so far, I haven't issues with Android 4.3 (Nexus 7 2013, latest OTA) and Cyanogenmod 10.2-NIGHTLY (Galaxy Nexus). So, I'm expecting that at least I may fix your issue by revamping the entire base-code.\n. @GH0S1R33P0R it seems @kenticus had an issue with his ELM327 device. A new one fixed it!\n. Interesting. Will sleep on this and eventually have it merged.\n. @abhijitpandey you may have lost connectivity to your ELM327 device.\nSee this thread.\n. Great! Thanks @spapas\n. Will have a look next week.\n. I'm not sure I follow you, but will do some tests with your solution and come back to this.\n. @sebaroesch can you please try with latest version of the code?\n. Closing inactive issue.\n. Actually, the value should be calculated right after the response is read so that we guarantee the calculations are executed only once. I'll be working on this.\n. Fixed. Also, I've moved the API to its own project.\n. This dependency has been removed. Data storage and upload will be rewritten. If you want to contribute with ideas on how this should be featured, check at https://groups.google.com/forum/?hl=en#!topic/android-obd-reader-users/Fhl-hKI4Y_s\n. Did you clone the masterbranch from this repository? I see no reference to that plug-in in obd-reader/pom.xml.\n. Can you please update to the latest commit? Anyway, I messed up obd-java-api 0.2 release. I'll fix it by the end of the day.\n. Did you edit the Bluetooth device MAC address on purpose? Or did you change anything related to the Bluetooth code available in the master branch?\n[BluetoothDevice: address=xx:xx:xx:xx:xx:xx, alias=OBDII work, name=OBDII, majorDeviceClass=7936, deviceClass=7964] just don't seem right.\n. I don't see any timeout in the logs you shared. Actually, I see that the device is connected and the system reports back that action. I just don't have a callback for it (which seems to be the way to deal with this in JELLY_BEAN_MR2 or newer) but it doesn't matter.\nCan you provide more logs from adb logcat?\n. This issue references #18.\n. You're using an emulator? I never tested with an emulator. Try a real vehicle and let us know!\n. I have one similar to the black one and it works. Never tested with hardware emulator, nor do I have access to one, so I'm unable to debug this.\n. OK, I will have to reverify how commands are executed and read from the buffer.\n. @cesarizu your issue is gone with that fix, then? I've never seen such messages with my ELM327 devices, but I trust your idea and how pleasantly it was provided. Thank you!\n@olimpotec @omarpontis @ReNDeZOwnler can you please verify this as well?\n. @cesarizu thank you for your contribution. It's been merged and released as version 0.4. Now, let's wait for some more feedback.\n. Sorry, but can't debug the app as I don't have an emulator. Will close this, since a fix, if any, can be made available.\n. What is the error you're seeing?\nAlso, what version of the code are you running?\n. Never seen \"CONNECTING\" as a response, or any of the other strings for that matter.. so I can't help with debugging that device :-(\n. Closing as it's rather impossible to debug every device.\n. Nice catch. Will fix!\n. Thanks @spapas \n. installDebug needs you to have ADB installed and the phone connected (through USB or network).\n. I'm going to close this and let's follow #7 \n. Nice catch. Will fix.\n. Not fixed yet. Looking forward your contributions, guys :-)\n. Trouble codes were added in https://github.com/pires/obd-java-api/commit/66ad7f107e006053e1d790081fa83ad62849742c\n. Nice catch. Thank :-)\n. Thanks once again :-)\n. Does this fix #22?\n. Thanks @spapas. You're contributions are invaluable!\n. Great!\nRegarding #26 it's an usability issue and this doesn't fix it. This is more of a \"developer\" debugging feature which should be configurable in the future.\n. I'm sorry, but that doesn't match the provided code. https://github.com/pires/android-obd-reader/blob/master/src/main/java/pt/lighthouselabs/obd/reader/net/ObdReading.java\n. Sorry, but unfortunately I cannot say for sure which vehicles implement this command. Regulations only force emission-related commands to be implemented.\n. Excellent @spapas!\n. What is Mode 1?\nIf data returns STOPPED it's your ELM327 device.\n. Unfortunately, I'm unable to assist you as of the moment. Will be glad to take a look at your future contributions, though.\n. Thanks for your contribution @nomwerp.\n. As detailed in README.md one should use Android Studio and not Eclipse.\n. The fix has been merged into obd-java-api, but right now I'm unable to provide a new release of the said library. Will try somewhere in the next weekend. Thanks for the fix @spapas \n. I'm closing this as the fix provided by @spapas will be available in obd-java-api 0.7 release, to be made available tomorrow.\n. Interesting but will have to take a better look at it before merging. Will probably merge in another branch, make my changes and merge into master.\n. @alonsodub code is the existing documentation. I believe it's self-explanatory as there are many comments included.\n. hey @nomwerp how about taking a look at this, especially the GPS integration and interface?\n. @nomwerp yes, I'd be glad to take a look at smaller commits (without the indent size changes and some other things I've commented in the PR diff).\n. @fabcira want to let you know this contribution is of value to me. Unfortunately, it's really hard to verify such a huge patch. Hope you have the time and will to catch up with the current code and clean-up this PR ;-)\n. This is fixable in obd-java-api project. Can you provide a fix, please?\n. This has been fixed in obd-java-api and will be released in 0.7 later this week.\n. Would be great if you could double check this in obd-java-api project.\n. Probably increasing the sleep time between a command is sent an read is the way to go (obd-java-api). ELM327 and OBD are really a major PITA.\n. Probably the threading part needs some love :-)\n. The existing obd-java-api is agnostic to the transport protocol, so it's perfectly possible. Will you contribute code for this?\n. Awesome!!\n. @spapas, people just don't read the instructions.\n. Logs please?\n. I'm gonna trust you've tested this since I have no way of testing it as of the moment. Thanks for your contribution.\n. Using Eclipse is not supported and not recommended.\n. See https://github.com/pires/obd-java-api/blob/master/src/main/java/pt/lighthouselabs/obd/enums/ObdProtocols.java\n. Out of the scope of this project. Please, try Google or Stackoverflow.\n. Just read the instructions on the main page on how to install and test this app.\n. I'm trusting you have tested this. Thanks a lot for your contribution :-)\n. Yes, my experiments resulted in the same conclusion.\n. Can you fix it and provide a PR for obd-java-api? Will be glad to merge. Thanks\n. @Hesamedin obd-java-apiis the actual OBD implementation. This project is just an Android app that usesobd-java-api`` for OBD operations.\nI'll close this when your PR gets in.\n. To be honest, just now I realized the command we're talking here. Fuel related commands usually don't work. Manufacturers don't implement the standard and charge for proprietary commands access. This class and others related should disappear. \n. I'm sorry, but this is a disruptive change. Please:\n- Do not remove Roboguice;\n- Do not force your code indenting, but follow current one (tabs are spaces, 2 spaces per tab);\n- Break into small changes/several PR's.\n. Thanks @nomwerp for another great contribution.\n. I understand your concern but at the time the only thing that mattered to me was to catch any I/O exception thrown by the socket handling code.\nI'm actually OK with merging this and eventually provide enhancements.\n. Tbh, I dislike explicit threading on Android. That's why you have stuff like AsyncTask. Anyway, the code looks good and so I'm merging it.\nCloses #40\n. @nomwerp would you like to become a contributor to this project?\n. You're given it more time than I do so.. :-) thanks a lot!\n. https://github.com/pires/android-obd-reader/blob/master/src/main/java/pt/lighthouselabs/obd/reader/io/ObdGatewayService.java#L49\n. Thanks @jeepingben \n. Good catch, thanks!\n. Hey @elagin going to try this later on. Can you ping me tomorrow if I don't give feedback? Thanks!\n. Thanks @elagin \n. Well, it's an interesting idea to ask the user to enable it before starting the app and helping him doing that. But of course, we still need to validate the device is paired as well.\nWe can also ask the user if he wants to disconnect Bluetooth when the app is stopped.\n. > The idea was to store the state of bluetooth before running the application and return it after the call stopLiveData ()\nWhat do you mean by store the state of bluetooth?\nI believe thinks work as expected now and we only need to validate more scenarios when Bluetooth is enabled/disabled by the user.\n. Oh, now I get it. Well, it's good to try turning it on/off depending on the app lifecycle. I'll be waiting for a PR to better assess this behavior.\n. Intents are always the best way to do it in Android.\n. Can we close this one?\n. @nomwerp I'll leave this for you to review ;-)\n. Thank you once more @elagin!\n. I wish we could just get proper fuel consumption support.\n. We'll see how that works out :)\n. @nomwerp I can add support for multiple records in one PUT on obd-server, but this doesn't mean it's one single record in the database for all the entries, because it will be not. Unless, we were storing JSON documents.\n. Thank you @nomwerp \n. So you'll be storing JSON on your database?\n. This works if the fields don't exist beforehand on your schema?\n. Ah OK :-) I'm trying to avoid that because we never know when a user adds a tailored command.\n. +1 for @nomwerp idea. Please open a new issue and discuss there.\n. LGTM!\n. Thank you so much @elagin \n. @elagin @nomwerp I believe this was added recently, right?\n. Thanks @elagin. Waiting for a PR then ;-)\n. @FunThomas76 fix LGTM. Care to try it out and let us know if it worked?\n. @FunThomas76 reopening and waiting on your feedback to close the issue ;-)\n. Awesome!\n. @elagin LGTM. Can I merge?\n. Thank you @elagin. You and @nomwerp have brought a new life to this project.\n. LGTM. Thanks\n. @elagin is this a WIP or can I merge?\n. @elagin can you rebase please? This conflicts with #74.\n. Auto-merging this @elagin @nomwerp \n. I can't understand. Can you please improve issue description?\n. Implemented obd-java-api support in 0.10, https://github.com/pires/obd-java-api/blob/e2a98f051407414edff5001097887446cfad8106/src/main/java/pt/lighthouselabs/obd/commands/protocol/AvailablePidsObdCommand.java.\nNot having more details on how to implement this in this project, I'm closing this.\n. I'm reviewing this and will merge tomorrow after testing.\n. @nomwerp can you squash the commits to a more clean commit log?\n. Thank you.\n. Need help!\n. I guess it never looked as prettier :D\n. Awesome! Thanks \n. @nomwerp we're ready to close this one, are we not?\n. Awesome! Thanks \n. Oh, so nice of you to actually get a new icon. It looks good :)\n. I have no idea.\n. Did you fix this with #83? If so, next time close it please.\n. You merged it and were waiting on complains? :-D\n. Sure. \n. @nomwerp damn, I should have asked for README.md changes but I guess I'll be doing it tomorrow. Can you take some screenshots of the app running on a moving car?\n. I'm open to improvements on the https://github.com/pires/obd-java-api project.\n. Awesome @anti43! \n. Different cars and ELM327 devices respond differently. It's sad but it's the reality. I'm open to any improvement that adds support for responses like this without breaking previous functionality.\n. @nomwerp would be nice to close some obj-java api issues, release 1.0 and update the dependency here as well, but I'm lacking the time to do it.\n. @nomwerp honestly, I never pushed the app to any app store. Probably, someone else did it. I've been notified about it in the past.\n. @nomwerp you are the expert here :D I'll leave that to you. I will be tagging RC1 in the coming days.\n. @nomwerp I know I've changed the packaging in the past because I no longer controlled the lighthouselabs.eu domain.  But right now, I don't even control the .pt as well, so I can probably rename stuff to com.github.pires.obdreader or something prettier.\n. Moved to com.github.pires.obd in 26cba74.\nTagging 2.0-RC1 now.\n. It is feasible. One would need to handle Bluetooth errors on https://github.com/pires/android-obd-reader/blob/master/src/main/java/pt/lighthouselabs/obd/reader/io/ObdGatewayService.java and play with the service lifecycle to act accordingly.\n. This is most probably due to the explicit delay in sending commands.\n. @vivek40 is there a PR coming?\n. Need logs please.\n. ELM327 is not connected. \n. > pt.lighthouselabs.obd.exceptions.UnableToConnectException: Error running 03, response: SEARCHING...UNABLETOCONNECT\nThis response comes from the ELM327 device.\n. Exactly! Thank you @nomwerp \n. Awesome! Thank you so much @amouly \n. @amouly now I do https://github.com/pires/android-obd-reader/issues/90. Do you have the time and will to take care of it? Would love to review a PR :+1: \n. Awesome! You rock.\n. @nomwerp @amouly can you update me on this, please?\n. Awesome!\n. Good question. Historical reasons! Feel free to propose any changes.\n. @amouly the code should be 2 spaces indent. The XML stuff could and should follow the same thing. This tree is quite old and a lot of stuff came from very old versions so I'm thankful you noticed it and can fix it.\nPlease, reformat to 2 spaces indent.\nAlso, when you're done and feel comfortable with the PR, please squash your commits into a more discernible log.\n. Refs #90 \n. I always use 2 spaces on my Java code, regardless of the specific framework I'm using, in this case Android.\n. @amouly unless you don't feel like contributing other stuff in the future, I'm ok with what you suggested.\nIf otherwise, and if you want to provide a PR first that formats code according to Android guidelines, and if @nomwerp agrees, I am OK to get it merged. But you must understand we need to trust it because reviewing will be overwhelming.\n. @nomwerp if you're happy, i'm happy with reformatting the code. I'll merge this and reformat code tomorrow.\n. You know IDEs allow you to configure indentation, right guys? Please, don't argue about ease of reading code, because I have a totally different opinion about many spaces. Two spaces is enough and the decision of going with four is just based on the fact that it seems it's Android guidelines.\nI will reformat the code later in the day.\nThank you.\n. Care to fill a PR? Will gladly review.\n. Thank you!! You're awesome. \n. Reviewing.\n. Thank you @Hippoish24 :)\n. I've never had any issues importing this project into Android Studio. Actually, Gradle Wrapper used to exist for people that didn't have Gradle installed which I don't believe is true when you install said IDE.\n. So if Android Studio creates the wrapper, what's the issue then?\n. Hmmm, current Android Studio complains about not having Gradle indeed. I wonder if they removed the bundled version... anyway one of the prerequisites in the doc is Gradle 2.2.1. Will mark this as an improvement rather than a bug and will take care of it ASAP. Thank you for reporting.\n. Actually, I revert what I just said, Gradle is bundled.\n$ ls /Applications/Android\\ Studio.app/Contents/gradle/gradle-2.2.1/bin/gradle*\n/Applications/Android Studio.app/Contents/gradle/gradle-2.2.1/bin/gradle\n/Applications/Android Studio.app/Contents/gradle/gradle-2.2.1/bin/gradle.bat\n. PR on its way.\n. @nomwerp I think it's related to proguard blocking roboguice stuff. Will look into it, thanks.\n. @amouly care to try it and let me know how it goes?\n. Nice! Thanks\n. @amouly care to try it and let me know?\n. Fixed @amouly? Been a couple years since I last used Proguard on Android.\n. Thank you for reporting and helping with the fix.\n. No and no. You have to do that code by yourself, but the most complicated part is already delivered by obd-java-api, which is to write/read from any channel (OutputStream and InputStream).\n. Where did you remove the 200ms? I'm not sure I follow what in script means. And polling time.\n. And please, stop comparing this to Torque. Torque is a closed app, paid by many users. This is not!\n. Thread.sleep(...) happens in obd-java-api as well, as a safe-measure. Change it, compile it and adapt your app at your own risk. It's the only way to bypass said safe-measure.\nRegarding Torque, it's a troubleshooting thing for misbehaving ELM 327 devices, not for comparing it to this open-source application.\n. Hi @MaxBenChrist! Thanks for contributing back. I am open to review your PRs and so far your issues are on pair with my personal guidelines.\n. People should be able to set whether they want to upload on WiFi connection only or not.\n. Awesome @MaxBenChrist! Bring it on :)\n. @nomwerp want to take care of that? Would be happy to merge. I'm traveling for a couple weeks and my availability for this is close to none.\n. Can you test RC3. Just released it but may take a while to sync to Maven Central.\n. Thank you. Will close this and wait for @anti43 feedback on https://github.com/pires/obd-java-api/issues/34.\n. Thank you @MaxBenChrist!\n. @nomwerp any insight?\n. @mvglasow can you try latest code, please?\n. What's your car protocol? \n. Have you tried building the code? \n. You should try build and install the code. There's protocol nuances for some commands. \n. @valens254 anything to add? \n. @valens254 just to be sure it's clear, @mvglasow is running an old release of this software. I will try and make a new release, but I suggested him to compile the code.\nAlso @mvglasow, I'm not responsible for F-Droid releases or any other APK releases.\n. @mvglasow please test https://github.com/pires/android-obd-reader/releases/tag/2.0-RC3 and let us know. I'm closing this for now.\n. @mvglasow did you run the RC3?\n. You are correct. @mvglasow the app crashed? Can you provide logs?\n. @pho3nix90 care to develop further your comment? Is it an app thing? Library thing? I can provide a fix as well if I see some logs. \n. @pho3nix90 awesome! Thank you. \n. @mvglasow please try https://github.com/pires/android-obd-reader/releases/tag/2.0-RC4\n. Interesting!\n. @mvglasow care to try #155?\n. @mvglasow i'm also in favor if a dedup of code.\n. @mvglasow this was a really nice contribution. Thank you for that. And thank you for debugging this issue until a solution was found.\n. Good point here. The buffer processing stuff on the API changed a bit and it's a bit confusing, so I'd say that for now we should change how this app handles strings. I'm sorry for breaking this, but I can't pay as much attention as I want for the next two weeks :(\n. @MaxBenChrist just to be sure, this is optional and disabled by default, right?\n. Thank you, awesome!\n. @nomwerp is this to be merged or closed?\n. Any updates on this?\n. @nomwerp is this to be merged or closed?\n. @nomwerp is this to be merged or closed?\n. I'll release obd-java-api RC5 later today and upgrade the dependency version here.\n. See https://github.com/pires/obd-java-api/commit/d5474dce0556d3eca1707a5b41033edbc0600c94. That should be the properly formatted VIN.\n. Calling @anti43 on this one.\n. Please, try the latest code. Closing this but will reopen if there's feedback about it not being fixed.\n. I've tried a lot of equations before and never worked out because engines are so different. I'm open to try out an implementation, though.\n. @Pho3niX90 awesome!\n. @Pho3niX90 when adding new commands to obd-java-api, please add more tests as well, please. I will be releasing 1.0-RC6 in a bit.\n. @Pho3niX90 unit-tests. Check obd-java-api/src/test/java. Even when using an IDE to build your stuff, it's a Maven project and you should use it to run tests and validate what you implement.\n. @Pho3niX90 can we close this?\n. Merged and updated to 1.0-RC5 version of dependency.\n. @Pho3niX90 you're rocking the place! Keep it up.\n. My suggestion is to use your own repos and let's list them over here. Single requirement is to follow the JSON structure I have implemented in obd-server and this app.\n. @Pho3niX90 is that a server? Been a while since I coded PHP but I do not see any REST related code but rather a PHP script that one can run in his terminal.\n. Yeah, I will change that no later than monday. @Pho3niX90 would you be so kind and wait until I've done it to reopen the PR?\n. @Pho3niX90 can you create a new PR with latest formatting style?\n. Nop. Idea may have screwed it. Will improve manually later. \n. For some stupid reason, Android Studio had loaded the now removed Eclipse formatting settings file. Fixed and closed.\n. Pending on new library release. \n. Thank you!\n. I will not remove roboguice in favor of more boilerplate code. \n. @Hippoish24 it's also helping a lot with service and AsyncTask lifecycle management. Again, this is a no-go for me unless something happens to how much Android code we need to handle this burden.\n. Dagger is much more complicated to use and I want to maintain the code simple for anyone to use. I don't see any added value for the user in this, since the application delivers what it's supposed to do.\nStill, I'm open to analyze a PR that replaces Roboguice with something that means more performance AND less code.\n. This is probably caused by the service not being able to reset/restart. \n. How was it fixed? \n. @Pho3niX90 care to add latest comment to documentation?\n. @matthiasblaesing very good insight actually. It's been a long time since I last worked on that code and at the time I didn't gave it much thought. I should have :+1:\nI'll be working on this.\n. @nomwerp @anti43 @MaxBenChrist @Pho3niX90 just letting you know (since you are the most active users around) that PUT has been replaced with POST. \n. But you haven't updated build.gradle to include the latest lib, did you?\n. @sytolk not sure what to do with this since I can't maintain two build tools.\n. I will accept this for now. Thank you.\n. @Pho3niX90 I am in favor of that solution instead of #138. Anyway, #138 is not ready for testing/merge.\n. @sytolk my comments on why PR #138 is not ready for merge are detailed there.\nRegarding plug-ins for logging, it's possible but probably too time-consuming for me right now.\n. Yes. I'm taking care of this, thank you. \n. 1.0-RC9 has been released with revert from Java 8 to 7 and a fix for the Windows platform.\n. Thanks for the PR @sytolk but I can't merge it.\nFirst of all, I don't want obd-java-api snapshot releases in the build. There's plenty snapshots that will break the build entirely.\nSecondly, the official build process is based on build.gradle and you haven't updated it there.\n. Please, keep the PR pointed at 1.0-RC9. I will release it as soon as https://github.com/pires/obd-java-api/pull/62 is merged.\n. @sytolk 1.0-RC9 has been released.\n. You're missing build.gradle as well.\n. While it's important to you, it's not ready for generic usage. I'm sorry but this won't be merged as is.\n. @sytolk I understand laziness, I'm lazy too. But we need variables to be configurable. All of them have been detailed before.\nAlso, the commit log is a mess. Please meld your commits into a single one after rebasing current changes in master.\n. Please, provide PR :)\n. @sytolk please don't do it that way or I won't be able to validate the PR and merge.\n. We can aim higher, say API Level 14.\n. @Pho3niX90 the idea of broadcasting command results is interesting and my only recommendation is to use LocalBroadcastManager.\n. The app is small enough for us to think about plug-ins.\n. OBD Java API is pure Java so there's no way it will accept Android code.\nCan't we wrap ObdCommandresult in another object specific to this project that implements Parcelable?\n. I'll close this since you were the one suggesting it but no one has provided feedback or the will to pick it up.\nGood luck with your project. Thank you for all your contributions.\n. @Pho3niX90 care to open a PR addressing this issue? Glad to review it.\n. The thing with AT S0 is that I can't guarantee it to work with all ELM devices or that all programmers will send said command. But I can guarantee I remove all spaces, if any.\n. @sytolk @Pho3niX90 let's agree to disagree here.\nI am fine with native Android crash handling that sends logcat logs by email. I am also fine with adding Acra or any other external service that a user sees fit for the same purpose.\nWhat I'm not OK with, and both with this PR and #138 is the lack of configurability by the user.\nPlease, make all variables configurable, i.e. usernames, passwords, email destination addresses, service URLs and tokens, etc. Then, remove all references to other software you may have written before that is in no way related to Android OBD Reader app. And finally, meld (squash) your commits into a single one and I'll be ready to merge it.\n. @Pho3niX90 looks sharp. Now, I need to crash the app to test.\nMeanwhile, can you meld your commits into a single one? Thanks!\n. I need to add this to documentation. Thanks @filipeportes \n. Thank you very much @godfreyduke!\n. https://icculus.org/obdgpslogger/obdsim.html\n. Why don't you try it yourself?\n. Probably the phone is broken. There's little to nothing I can do to help here, I'm sorry.\n. Can you rebase this to a single commit and edit the message to it makes sense to anyone reading the commit log, please? If you can't do this, just let me know and I'll take care of it.\n. @Pho3niX90 thank you, it was squashed and merged.\n. @mvglasow awesome! Thank you @Pho3niX90.\n. Fixed by #156.\n. Fixes #111\nFixes #155\n. You need to follow GPL if you import or copy their code. There's no need for that. Thank you for the link. \n. Guess it depends on the size of the array.\n. Any logs related to the initial failure and the service failed binding?\n. @Pho3niX90 ok will close this until you find proof this doesn't work as expected.\n. What does this fix exactly? \n. @fscodesimone I'm not sure this fixes anything. Can someone else let me know what does this fixes exactly? Also, the code is not mergeable.\n. What is the impact of this change?\n. @Pho3niX90 thank you.\n. OK I will squash these commits into one and close the PR. Thank you @Pho3niX90 \n. Thank you @roalts \n. Interesting! Thank you for reporting, will look into it.\n. performCalculations is the culprit here.\njava\nprotected void performCalculations() {\n    // ignore first two bytes [hh hh] of the response\n    fuelRate = (buffer.get(2) * 256 + buffer.get(3)) * 0.05f;\n}\nThing is, why are there only 3 bytes when there should be 4? Could this be a protocol thing? I call in the master of multi-protocol support, @valens254.\n. @Kolyall I could do that, but then the result would need to be an exception since the standard is pretty adamant about the result calculations. In this case, with my tests - and it's working for others - one would need to ignore the first two bytes of the response, namely 41 5E which means response to 01 5E.\n. I'm not sure it can be a single byte response, but in case you're right it should be easy to implement. Want to open a PR in obd-java-api which fixes this? Please, don't forget to add unit-tests that assert your code works.\n. I can't understand what's going on with this output. Care to disclose the full stacktrace?\n. Commands may return exceptions. You need to handle them. In this case, the error seems to be related to the response to 01 1F which seems to be wrong.\nSince you're having so many issues, I'd say the protocol your car uses is mostly unsupported by obd-java-api library.\n@valens254 seems to be the multi-protocol expert around and he's probably the most fit to help here again.\n. @Pho3niX90 would this be a CAN thing too?\n. @valens254 again, can you help? This is something you've worked on.\n. A server side interface? You mean, implement MQTT client that publishes data to one MQTT broker?\n. Is that a server-side interface? Anyway, seems interesting and I'm open to review a PR.\n. :+1: thanks a lot for your contribution!\n. @ZKjellberg can you share at least one screenshot?\n. This is awesome, this app is needing a UI revamp/redesign for sure. Thank you a ton!\n. Closing for now. Will re-open if there's proof this doesn't work.\n. I'll be releasing library RC16 as soon as @Pho3niX90 finishes an open PR and will update this project.\n. Done.\n. I wish manufacturers would at least implement all standard PIDs. Thank you @Pho3niX90.\n. @jbits why don't you open a PR with a fix? Would be glad to merge.\n. Thank you @Pho3niX90 \n. Thank you @Pho3niX90 \n. What @Pho3niX90 said. This is a Bluetooth issue and not an app issue.\n. I will create similar issue in the API project.\n. Not sure this will fix it permanently. The fact that one queues the command doesn't mean it's executed instantaneously. Thoughts?\n. Fixes #176 \n. @phamels thanks for reporting. Care to open a PR that fixes this?\n. @jbits want to check this one out? ;-)\n. Awesome, thanks!\n. @Pho3niX90 always to the rescue, thanks man!\n. From the top of my head this makes sense. Is a PR coming? \n. Fixed by #189. Thanks @jbits.\n. If there's anything I've learned about OBD is that nothing is guaranteed. Good luck!\n. @diegomalone excellent job!\nAs a sidenote, this is pr-BR.\n. Nice catch, thanks!\n. The API (obd-java-api) used in this project allows you to send any command you desire. \n. OBD-II PIDs are not meant for that. You must consult your car manufacturer to get the proprietary commands to execute.\n. You should try different protocols since auto selection isn't working.\n. It's probably CAN stuff that is not well supported right now.\n. Please, go ahead. github.com/pires/obd-java-api is where it should be implemented.\n. Share here what you have and I'll take a look.\n. Just override fillBuffer or readRawData, depending on your needs.\n. This is not a library but an Android app. The library sits at https://github.com/pires/obd-java-api and there you can find the implementation of said command.. You can base your work in this https://github.com/pires/android-obd-reader/issues/147. But a github/google search would probably give you PHP code as well.. Why did you remove these if I've tested with them before?\n. Not sure why this info would appear in README.md...\n. Are you proposing a new icon?\n. This URL shouldn't have been merged. Please replace with default obd-server url.\n. Why 70?\n. Fuel consumption is not working unfortunately. We should remove this entirely from the app.\n. Why did you change the indent to 4 spaces instead of 2? Please revert that change.\n. Once again, due to indent size change I can't review the changes in this class.\nAlso, why the hell files are now mode 755?\n. This is meant to work with OBD Server. If you're adapting it, please keep those changes for yourself alone.\n. Fix indent size.\n. This should be reverted to false since many users won't have interest in uploading data.\n. Ah, interesting.\n. Sure!\n. Can you please use english for comments as well?\n. Good catch!\n. Remove these comments.\n. This should be configurable to provide this feature to other users.\n. This should be configurable and encrypted on device storage.\n. This must be configurable.\n. What is Hazmat?\n. hazmat?\n. Why leave this commented?\n. Why not reuse getString(R.string.text_bluetooth_disabled)?\n. Why did these went away?\n. Please, remove this email address. Otherwise, I may see my inbox filled with user logs.\n. This is not the way to do it, but Log.e.\n. ",
    "jabyeah": "Hello Paulo,\nthanks for your answer. Sorry, but I`m working out of my city and I don't\nhave anymore my OBD connector, and also my Fiat was sold two months ago :(\nRegards,\nJavier.\n2014-02-19 16:16 GMT+01:00 Paulo Pires notifications@github.com:\n\n@jabyeah https://github.com/jabyeah can you try with the latest code?\n\nReply to this email directly or view it on GitHubhttps://github.com/pires/android-obd-reader/issues/1#issuecomment-35508806\n.\n. \n",
    "jegee": "Instead of AT RV (which provides Voltage measured in the OBD-Device), it is better to use the \nOBD Command \"01 42\" which returns two bytes (e.g. 2F 35). This value has to be divided with 1000, then you get e.g. 12,085V.\n. I had the same problem on my Nexus 7 while it worked on other devices. On the Nexus 7, opening the Bluetooth socket resulted in \" ERROR establishing connection: read failed, socket might closed or timeout, read ret: -1\".\nThe solution described in\nhttp://stackoverflow.com/questions/18657427/ioexception-read-failed-socket-might-closed-bluetooth-on-android-4-3/18786701#18786701\nsolved the problem. Here the most important code pieces: \npublic class ObdGatewayService extends Service {\n//...\n    private boolean         useFallback = false; // <---- new\n    private BluetoothSocket _sock = null;\n    private BluetoothSocket _sockFallback = null; // <--------------- new\nprivate void startService() {\n//...\n        startObdConnection();  // Here, the try/catch has been removed\n    }\nprivate void startObdConnection(){\n    try{\n        // Instantiate a BluetoothSocket for the remote device and connect it.\n        _sock = _dev.createRfcommSocketToServiceRecord(MY_UUID);\n        _sock.connect();\n        useFallback = false; \n    } catch (Exception e1) {\n        // TODO Auto-generated catch block\n        Log.e(TAG, \"There was an error while establishing connection. -> \" + e1.getMessage());\n        /************** Fallback Socket based on ********/\n        /* http://stackoverflow.com/questions/18657427/ioexception-read-failed-socket-might-closed-bluetooth-on-android-4-3/18786701#18786701*/\n        Class<?> clazz = _sock.getRemoteDevice().getClass();\n        Class<?>[] paramTypes = new Class<?>[] {Integer.TYPE};\n        try {           \n            Method m = clazz.getMethod(\"createRfcommSocket\", paramTypes);\n            Object[] params = new Object[] {Integer.valueOf(1)};\n            _sockFallback = (BluetoothSocket) m.invoke(_sock.getRemoteDevice(), params);\n            _sockFallback.connect();                \n            useFallback = true; \n        } catch (Exception e2) {            \n            e2.printStackTrace();\n            stopService();\n            return; \n        }\n        /*************** END MODIFICATION\n    }\n    // Let's configure the connection.\n    Log.d(TAG, \"Queing jobs for connection configuration..\");\n    queueJob(new ObdCommandJob(new ObdResetCommand()));\n    queueJob(new ObdCommandJob(new EchoOffObdCommand()));\n//...\n}\nprivate void _executeQueue() {\n//...\n    if (useFallback == false)\n    job.getCommand().run_send_rcv(_sock.getInputStream(), _sock.getOutputStream());\n    else\n    job.getCommand().run_send_rcv(_sockFallback.getInputStream(), _sockFallback.getOutputStream());\n//...\n}\npublic void stopService() {\n//...\n        try {\n            _sock.close();\n            _sockFallback.close(); \n//...\n}\n. ",
    "nomwerp": "isn't this one for pires/obd-java-api ? close this one and create an issue there?\n. nevermind, just checked and it is already there: pires/obd-java-api#3 \n. well definitely not as fancy as described above , there is for example no status for successful OBD communication , but since nowadays the actual results is already printed to the screen in case of an communication error i.e. NODATA let's close this one and open a new issue for additional functionality (or bugs;)\n. i've just created a pull request that should fix this  , still needs to be tested (but should be safe) for the case there is a bluetooth adapter selected since my phone doesn't have a working one at the moment ;)\n. Hi, had the same problem here, solved it by stripping out the \"SEARCHING...\"  string from rawdata by overriding getResult in TroubleCodesActivity.java :\njava\npublic class ModifiedTroubleCodesObdCommand extends TroubleCodesObdCommand {\n    @Override\n    public String getResult() {\n        // remove unwanted response from output since this results in erroneous error codes\n        return rawData.replace(\"SEARCHING...\", \"\");\n        }\n    }\nand changing\njava\nTroubleCodesObdCommand tcoc = new TroubleCodesObdCommand();\ntcoc.run(sock.getInputStream(), sock.getOutputStream());\nresult = tcoc.getFormattedResult();\nto \njava\nModifiedTroubleCodesObdCommand tcoc = new ModifiedTroubleCodesObdCommand();\ntcoc.run(sock.getInputStream(), sock.getOutputStream());\nresult = tcoc.getFormattedResult();\nworks for me ...\n. I was thinking to start merging smaller parts , this a very big collection of changes.\n. closing since by now we've picked all the good bits or implemented them otherwise , thanks again!\n. Hi Fabio, i'm running into similar issues here so planning to look into it, do you have any additional updates /hints /guesses as to what is going on? \n. found one issue:  it seems multiple instances of readRawData can be reading from the same stream at the same time , looks like in some cases it is pulling more than one job from the queue, this obviously results in garbage out (apologies for the long log below but it does show the issue):  \n12-16 22:47:41.105  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Queing jobs for connection configuration..\n12-16 22:47:41.105  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Adding job[1] to queue..\n12-16 22:47:41.105  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Job queued successfully.\n12-16 22:47:41.105  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Adding job[2] to queue..\n12-16 22:47:41.110  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Job queued successfully.\n12-16 22:47:41.110  18452-18848/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Executing queue..\n12-16 22:47:41.110  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Adding job[3] to queue..\n12-16 22:47:41.110  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Job queued successfully.\n12-16 22:47:41.110  18452-18849/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Executing queue..\n12-16 22:47:41.110  18452-18849/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[1] from queue..\n12-16 22:47:41.110  18452-18849/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n12-16 22:47:41.110  18452-18848/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[2] from queue..\n12-16 22:47:41.110  18452-18848/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n12-16 22:47:41.110  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Adding job[4] to queue..\n12-16 22:47:41.115  18452-18850/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Executing queue..\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Job queued successfully.\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Adding job[5] to queue..\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Job queued successfully.\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Adding job[6] to queue..\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Job queued successfully.\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Adding job[7] to queue..\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.AbstractGatewayService﹕ Job queued successfully.\n12-16 22:47:41.115  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Initialization jobs queued.\n12-16 22:47:41.120  18452-18850/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[3] from queue..\n12-16 22:47:41.120  18452-18850/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n12-16 22:47:41.135  18452-18452/pt.lighthouselabs.obd.reader I/Choreographer﹕ Skipped 325 frames!  The application may be doing too much work on its main thread.\n12-16 22:47:41.210  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:Reset OBD\n12-16 22:47:41.210  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:AT Z_\n12-16 22:47:41.215  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:Echo Off\n12-16 22:47:41.215  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:AT E0_\n12-16 22:47:41.220  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:Echo Off\n12-16 22:47:41.220  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:AT E0_\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:_\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:69\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__E\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:76\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__EL\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:77\n12-16 22:47:42.170  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:51\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM3\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:50\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM32\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:55\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:118\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327 v\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:49\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327 v1\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:46\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327 v1.\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:53\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327 v1.5\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327 v1.5_\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327 v1.5__\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:62\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__ELM327 v1.5__>\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ finalres:__ELM327 v1.5__>\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:ELM327 v1.5\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:ELM327 v1.5\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:ELM327 v1.5\n12-16 22:47:42.175  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:ELM327 v1.5\n12-16 22:47:42.185  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ errorcheck:ELM327 v1.5\n12-16 22:47:42.185  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ fillbuffer:[]\n12-16 22:47:42.185  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ formatted:ELM327 v1.5\n12-16 22:47:42.185  18452-18849/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[4] from queue..\n12-16 22:47:42.185  18452-18849/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:65\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:A\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:84\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:76\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L\n12-16 22:47:42.240  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:48\n12-16 22:47:42.245  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0\n12-16 22:47:42.245  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.245  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_\n12-16 22:47:42.245  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:79\n12-16 22:47:42.245  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_O\n12-16 22:47:42.245  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:75\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:_\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:62\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:__>\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ finalres:__>\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.250  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.255  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OK\n12-16 22:47:42.255  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ errorcheck:\n12-16 22:47:42.255  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ fillbuffer:[]\n12-16 22:47:42.260  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ formatted:\n12-16 22:47:42.265  18452-18850/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[5] from queue..\n12-16 22:47:42.265  18452-18850/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n12-16 22:47:42.290  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:Line Feed Off\n12-16 22:47:42.290  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:AT L0_\n12-16 22:47:42.305  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:65\n12-16 22:47:42.305  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKA\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:84\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:83\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T S\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:84\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:51\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:101\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3e\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3e_\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:79\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3e_O\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:75\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3e_OK\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3e_OK_\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3e_OK__\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:62\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:T ST 3e_OK__>\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ finalres:T ST 3e_OK__>\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:T ST 3e_OK\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:OK\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:OK\n12-16 22:47:42.305  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:OK\n12-16 22:47:42.330  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ errorcheck:OK\n12-16 22:47:42.330  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ fillbuffer:[]\n12-16 22:47:42.330  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ formatted:OK\n12-16 22:47:42.330  18452-18849/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[6] from queue..\n12-16 22:47:42.330  18452-18849/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n12-16 22:47:42.365  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:Timeout\n12-16 22:47:42.365  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:AT ST 3e_\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:65\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAA\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:84\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAAT\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:83\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATS\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:80\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:48\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:79\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_O\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:75\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.370  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK_\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:62\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res: >\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ finalres: >\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.375  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:\n12-16 22:47:42.380  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.385  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__\n12-16 22:47:42.385  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ errorcheck:\n12-16 22:47:42.385  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ fillbuffer:[]\n12-16 22:47:42.385  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ formatted:\n12-16 22:47:42.390  18452-18850/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[7] from queue..\n12-16 22:47:42.390  18452-18850/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:48\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__0\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:49\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:52\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 4\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:54\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:83\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_S\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:69\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SE\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:65\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEA\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:82\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEAR\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:67\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARC\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:72\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCH\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:73\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHI\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:78\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHIN\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:71\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHING\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:46\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHING.\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:46\n12-16 22:47:42.435  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHING..\n12-16 22:47:42.440  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:Select Protocol AUTO\n12-16 22:47:42.440  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:AT SP 0_\n12-16 22:47:42.505  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:Ambient Air Temperature\n12-16 22:47:42.505  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ cmd:01 46_\n12-16 22:47:48.000  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:85\n12-16 22:47:48.000  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHING..U\n12-16 22:47:48.000  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:78\n12-16 22:47:48.000  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:65\n12-16 22:47:48.000  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:A\n12-16 22:47:48.000  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:66\n12-16 22:47:48.000  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:N\n12-16 22:47:48.000  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:76\n12-16 22:47:48.005  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHING..UB\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:69\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE\n12-16 22:47:48.005  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AL\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:84\n12-16 22:47:48.005  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:79\n12-16 22:47:48.005  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:32\n12-16 22:47:48.005  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHING..UBO\n12-16 22:47:48.005  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AL\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE T\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:67\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TC\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:79\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TCO\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:78\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TCON\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:78\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TCONN\n12-16 22:47:48.005  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:69\n12-16 22:47:48.010  18452-18459/pt.lighthouselabs.obd.reader I/dalvikvm﹕ Jit: resizing JitTable from 4096 to 8192\n12-16 22:47:48.010  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:67\n12-16 22:47:48.010  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:84\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TCONNE\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TCONNE_\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:13\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TCONNE__\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ byte:62\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:NE TCONNE__>\n12-16 22:47:48.010  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ finalres:NE TCONNE__>\n12-16 22:47:48.010  18452-18850/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AL C\n12-16 22:47:48.010  18452-18848/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ res:AT L0_OKAATSP 0_OK__01 46_SEARCHING..UBOT\n12-16 22:47:48.020  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:NE TCONNE\n12-16 22:47:48.020  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:NE TCONNE\n12-16 22:47:48.020  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:NE TCONNE\n12-16 22:47:48.020  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ rawdata:NE TCONNE\n12-16 22:47:48.030  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ errorcheck:NE TCONNE\n12-16 22:47:48.030  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ fillbuffer:[]\n12-16 22:47:48.030  18452-18849/pt.lighthouselabs.obd.reader I/pt.lighthouselabs.obd.commands.ObdCommand﹕ formatted:NE TCONNE\n12-16 22:48:00.015  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.activity.MainActivity﹕ Stopping live data..\n12-16 22:48:00.015  18452-18452/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Stopping service..\n. yes unfortunately looks that way, although I want to rule out that I didn't press \"start live data\" 3 times to get a connection and that this somehow started multiple processes \nPaulo Pires notifications@github.com wrote:\n\nProbably the threading part needs some love :-)\n—\nReply to this email directly or view it on GitHub.￼\n. yes is tested, the only issue i can see is that some of the OBD commands enabled by default in preferences can  fail resulting in symptoms as described in #40 .\n. what version is that? (looks a bit different from recent versions)\n. there doesn't seem to be a version released recently but current code is runable,\nif you don't use git you can download it here https://github.com/pires/android-obd-reader/archive/master.zip\ni've never tried to use eclips with android development but it seems a common thing to do :\nhttps://developer.android.com/tools/help/adt.html\n. hi, do you mean you want to build all the libraries from source too?\nhave a look here : https://stackoverflow.com/questions/16718026/how-to-build-an-android-library-with-android-studio-and-gradle\n. yeps, all works. i needed the protocol selection setting to be able  to try them all (unfortunately none of them seems better then AUTO, still issues )\n. I'll try to get my (OBD) communication issues sorted , looks pretty much the same as #40 , I'll add my finding there.  The changes  ( 21ac445  )  i made here help a bit with the diagnoses since it now prints the actual error for each command.\n. on a more technical note , how should we handle this?  of course any time speed is zero or very low you'll get a very high  (or infinite) fuel economy. easy enough to put in a if statement for zero or low speed but what to return in that case? my car will display \"--.-\" at low speed. is there any more high level code that expect it always returns a number or can we safely return a string?\n\nPaulo Pires notifications@github.com wrote:\n\n@Hesamedin obd-java-apiis the actual OBD implementation. This project is just an Android app that usesobd-java-api`` for OBD operations.\nI'll close this when your PR gets in.\n—\nReply to this email directly or view it on GitHub.￼\n. hey have a look at this, i'm sure the logic of interrupting and catching can be improved but this seems to work as it is. might help towards resolving #40 \n. sure, for now I'm just interested in doing small improvements to make this project more usable for myself. will discuss anything more drastic with yourself first.\n. thanks, do you actually get any useful response when collecting live data or are all the \nother commands also failing?\n\nOn Sunday 15 February 2015 13:45:00 jeepingben wrote:\nThis happens 100% of the time for me on 2 vehicles. I have tried building the latest and \nusing the version distributed on f-droid with the same result. \nReading live data works, but Get-DTC causes the program to crash \"Unfortunately obd-\nreader has stopped working\". This is the exception from logcat: E/AndroidRuntime(26913): \nFATAL EXCEPTION: AsyncTask #1[1]\nandroid.os.BinderProxy@421ae8f[2] time:82671870W/bt-rfcomm(13170): \nrfc_port_closedW/bt-btif (13170): bta_jv_rfc_port_to_cb(port_handle:0xf):jv handle:0x0 \nnot FOUNDI/Timeline( 2253): Timeline: Activity_windows_visible id: \nActivityRecord{42bb3930 u0 pt.lighthouselabs.obd.reader/.activity.MainActivity t51} \ntime:82672140W/SurfaceFlinger( 1724): couldn't log to binary event log: \noverflow.E/WindowManager(26913): E/WindowManager(26913): \nandroid.view.WindowLeaked: Activity \npt.lighthouselabs.obd.reader.activity.TroubleCodesActivity has leaked window \ncom.android.internal.policy.impl.PhoneWindow$DecorView{42b8b540 V.E..... R....... \n0,0-1026,642} that was originally added hereE/WindowManager(26913): at \nandroid.view.ViewRootImpl.(ViewRootImpl.java:346)E/WindowManager(26913): at \nandroid.view.WindowManagerGlobal.addView(WindowManagerGlobal.java:248)E/WindowMa\nnager(26913): at \nandroid.view.WindowManagerImpl.addView(WindowManagerImpl.java:69)E/WindowManage\nr(26913): at android.app.Dialog.show(Dialog.java:286)E/WindowManager(26913): at \npt.lighthouselabs.obd.reader.activity.TroubleCodesActivity$GetTroubleCodesTask.onPreEx\necute(TroubleCodesActivity.java:153)E/WindowManager(26913): at \nandroid.os.AsyncTask.executeOnExecutor(AsyncTask.java:587)E/WindowManager(26913): \nat android.os.AsyncTask.execute(AsyncTask.java:535)E/WindowManager(26913): at \npt.lighthouselabs.obd.reader.activity.TroubleCodesActivity.onCreate(TroubleCodesActivity.\njava:76)E/WindowManager(26913): at \nandroid.app.Activity.performCreate(Activity.java:5231)E/WindowManager(26913): at \nandroid.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1087)E/WindowMa\nnager(26913): at \nandroid.app.ActivityThread.performLaunchActivity(ActivityThread.java:2169)E/WindowMan\nager(26913): at \nandroid.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2271)E/WindowMana\nger(26913): at \nandroid.app.ActivityThread.access$800(ActivityThread.java:144)E/WindowManager(26913)\n: at \nandroid.app.ActivityThread$H.handleMessage(ActivityThread.java:1205)E/WindowManager\n(26913): at \nandroid.os.Handler.dispatchMessage(Handler.java:102)E/WindowManager(26913): at \nandroid.os.Looper.loop(Looper.java:136)E/WindowManager(26913): at \nandroid.app.ActivityThread.main(ActivityThread.java:5146)E/WindowManager(26913): at \njava.lang.reflect.Method.invokeNative(Native Method)E/WindowManager(26913): at \njava.lang.reflect.Method.invoke(Method.java:515)E/WindowManager(26913): at \ncom.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:732)E/Windo\nwManager(26913): at \ncom.android.internal.os.ZygoteInit.main(ZygoteInit.java:566)E/WindowManager(26913): at \ndalvik.system.NativeStart.main(Native Method)W/bt-l2cap(13170): L2CA_DisconnectReq() \nCID: 0x0040 \nI see that the reset command fails in start-live-data as well, but that it keeps going. \n, response: ?selabs.obd.reader.io.ObdGatewayService(30123): Failed to run command. -> \nError running AT ZD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(30123): Taking \njob[2] from queue..D/pt.lighthouselabs.obd.reader.io.ObdGatewayService(30123): Job \nstate is NEW. Run it.., response: ?selabs.obd.reader.io.ObdGatewayService(30123): Failed to \nrun command. -> Error running AT \nE0D/pt.lighthouselabs.obd.reader.io.ObdGatewayService(30123): Taking job[3] from \nqueue.. \nI see that the ObdGatewayService catches all exceptions and keeps going while \nTroubleCodesActivity dies on exceptions (I added catch \n(MisunderstoodCommandException) in my build). \n—Reply to this email directly or view it on GitHub[3].[4]\n\n[1] https://github.com/pires/android-obd-reader/issues/1\n[2] https://github.com/android.os.BinderProxy/android-obd-reader/commit/421ae8f0\n[3] https://github.com/pires/android-obd-reader/issues/61\n[4] \nhttps://github.com/notifications/beacon/AJpBTvVUXTl9T6Gn_4XKL1Cm00IZIZ2Iks5nsQrc\ngaJpZM4DgvE6.gif\n. yes, it would make a lot of sense if live-data and trouble code activity share more of the code since they effectively do the same thing...   but on the other hand if we can prevent it from crashing by catching one more exception we should probably do that first.\n. should be fixed by #63 , we should create a separate issue for improving trouble code activity \n. thanks!\n. interesting, i was attempting something similar but instead of using\nbtAdapter.enable();\ni was trying something like:\nIntent enableBtIntent = new Intent(BluetoothAdapter.ACTION_REQUEST_ENABLE);\nstartActivityForResult(enableBtIntent, ENABLE_BLUETOOTH);\nand some more code to check if it was successful\npublic void onActivityResult(int requestCode, int resultCode, Intent data) {\n    switch (requestCode) {\n      case ENABLE_BLUETOOTH:\n        if (resultCode != RESULT_OK) {\n          showDialog(BLUETOOTH_DISABLED);\n          Toast.makeText(this, \"Bluetooth is disabled, will use Mock service instead\", Toast.LENGTH_SHORT).show();\n        }\n    }\n  }\nwould that give any benefit at all or just complicate things?\n. one scenario that seems to be missed is to turn bluetooth off if it was automatically enabled  + app is paused + no live data is running ?  \n1) bluetooth is off \n2) app started\n3) bluetooth gets enabled\n4) live data is started\n5) live data is stopped\n6) app paused\n7) should bluetooth be turned off again?\n. yes works great, my previous comment about disabling bluetooth when paused can be ignored, i don't think it should do that anyway and bluetooth does get disabled onDestroy().\n. i'm playing around with a simple php server side implementation to add the uploaded data to a database so that's where combing the data helps a lot, i haven't looked into obd-server but didn't want to break anything there.\nanyway due to the asynchronous execution of the queue there is also no guarantee we get a complete set of records for every upload but should be in most cases since only called when queue is empty, maybe it should be switched around so that we first upload before filling queue again...\n. for now i was using json_decode and a RecursiveIteratorIterator to explode it into individual fields and insert those into my database as a set \n. SQL\nINSERT INTO `mytable` SET  `vin`='XXX', `SPEED`='0km/h', `ENGINE_RPM`='0 RPM', `INTAKE_MANIFOLD_PRESSURE`='0kPa', `ENGINE_LOAD`='0.0%', `longitude`=0, `latitude`=0\n. no, at the moment just always adding all supplied fields to table before inserting , definitely not the most elegant  or secure way\n. @elagin if we are going in the direction of storing data locally (#74) , shouldn't we rethink data upload? I'm thinking a synchronization between databases could be more appropriate\n. yes agreed\n. squash seems to have worked...\n. I guess it could make things pretty but it seems that android:Theme.Material requires API level 21 (current min is 10). since supposedly only 10% of devices use this is that something we want? or does it fall back gracefully? (although it might not install anymore)\nhttps://developer.android.com/about/dashboards/index.html\n. to answer my own question:\nfrom main/res/values/styles.xml\n\"Theme customizations available in newer API levels can go in\n            res/values-vXX/styles.xml, while customizations related to\n            backward-compatibility can go here.\"\n. just applying the theme and deleting the background colours in favour of the defaults doesn't even look too bad: \n\n. commit 8bebec600e  (still  looks as ugly as always on older versions )\nbut I'll play around for a bit with the new theme...\n. Theme.Material.Light looks better in my opinion: \n\nnomwerp/android-obd-reader@0a8bc8c806\nI'm having trouble getting the fancy shadows to show up , setting elevation works in the preview but not on device\n. where would be a good place to put the .svg?  my best bet is directly in src/main/res \n. well if no complaints about the new icons i'd be happy to close...\n. TODO: update README.md too\n. @pires : happy to go to targetSdkVersion 21 ? \n. hmmm it could be that the \"CONNECTING\"  in the response is causing some confusion , had  a similar issue with device returning \"SEARCHING...\"  in front of the first response.\nif that is the case a crude fix could be to strip it from the response in  https://github.com/pires/obd-java-api/blob/master/src/main/java/pt/lighthouselabs/obd/commands/ObdCommand.java at the end of readRawData() add something like: \n    rawData = rawData.replace(\"SEARCHING...\", \"\");\n. try with only a couple of OBD commands selected in the preferences, i've found that if you ask for one that is not supported you might be left with \"unable to connect\" until the next reset \n. it seems that for me having the (additional) \"Reset OBD\" enabled in settings results in \"UNABLE TO CONNECT\" for all following commands\n. ok just tested it and it is indeed the extra reset command that screws things up, I had it disabled in my preferences because one of the commands was causing issues but hadn't narrowed down to the extra reset.  i think the issue is that calling reset without the other init commands leaves it in a non working state.  anyway i removed if from the list of commands to run : commit e1a7a8776dcecafec2e69fb939f7c8e472911f65\nbut back to your original issue , did you solve that ?\n. without the extra reset that stopped everything doesn't it just fail on the first command (there is a temperature command hard coding in for this purpose just after all the init stuff) and continue happily after that?\n. alright, i'll have a look but there don't seem to be (m)any open issues that affect android-obd-reader.  \nI think it'd also be good to do a bit more work on the UI before calling it 2.0\nf-droid doesn't seem to be auto updating anyway , last build there is from 2013, what needs to happen to get that to work again?\n. ok i'll investigate , seems that we'd need to make an update of : \nhttps://gitlab.com/fdroid/fdroiddata/blob/master/metadata/eu.lighthouselabs.obd.reader.txt\nI might create a 2.0-expermintal or so to test if f-droid can actually build it from source\n. managed to have a local copy of f-droid build it from source successfully, only thing we need to add to f-droid metadata is another build:\nBuild:2.0,11\n    commit=826dd9737\n    gradle=yes\n...where commit is now just the latest commit but can also be a tag when we actually release a 2.0\nthere is one issue: at f-droid the app is listed as eu.lighthouselabs.obd.reader instead of pt.lighthouselabs.obd.reader so we'd have to add it as a new app or possibly rename the existing, or maybe tell f-droid to ignore this issue\n. do you know the history behind the name change? \n. OK great,   when I'm back home I'll make a pull request for the fdroid people with the name change and to set it to auto update based on the tags.\n. i think @pires means that the  ELM327 is unable to connect to the car? e.g. the car is not responding because it is not running/powered  or the appropriate init and reset commands haven't been issued \n. did you try it with the engine running?\n. i think that's all strings in the UI, @amouly would you mind to do some more translation to spanish?\n. yeah i'm afraid that the changes i did in  19fa27811ebb0b19147f4a2e077334689d820706 are causing the conflict,  could i ask you to prepare a pull request just for the changes you made in src/main/res/values-es/strings.xml  and  src/main/res/values/strings.xml ?  and I'll work work out what those strings are called now afterwards.  thanks.\n. actually, that seems to be right place: \"You must save the XML file in the res/xml/ directory.\"\nhttps://developer.android.com/guide/topics/ui/settings.html#DefiningPrefs\n. i'm happy to have this merged , i've build @amouly  's fork and looks good (in english at least ;) the diff here on github is actually smart enough to show both the real changes behind the formatting changes.\nmaybe a way ahead for now is the have all the xml formatted with 4 spaces and the keep the java code with 2 until we figure out what we want? I'd be happy to go the 4 spaces since it seems that would make it so much easier for people to contribute to this project (i know it shouldn't make a difference but still)\n. in  obd-java-api/src/main/java/pt/lighthouselabs/obd/commands/ObdCommand.java\njava\n    /*\n     * HACK GOLDEN HAMMER ahead!!\n     * \n     * Due to the time that some systems may take to respond, let's give it\n     * 200ms.\n     */\n    Thread.sleep(200);\n. you can clone obd-java-api it into your project folder:\ngit clone https://github.com/pires/obd-java-api.git\ncreate obd-java-api/build.gradle with something like\napply plugin: 'java'\nin main build.gradle change \n compile 'pt.lighthouselabs.obd:obd-java-api:0.8' \nto\n compile project(':obd-java-api')\nin settings.gradle add include ':obd-java-api'\nthat should do it\n. we're on f-droid again with the new package name:\nhttps://f-droid.org/repository/browse/?fdid=com.github.pires.obd.reader\nnote that for auto update to work in the future the tag name and android:versionName in the manifest must be absolutely identical (2.0-rc1 vs 2.0-RC1 ). \nfor reference, any future modifications of the fdroid metadata can be made here: https://gitlab.com/fdroid/fdroiddata/blob/master/metadata/com.github.pires.obd.reader.txt\n. D/roboguice.RoboGuice(11500): Using annotation database(s). D/roboguice.RoboGuice(11500): Using annotation database(s) : [, roboguice] W/System.err(11500): java.lang.ClassNotFoundException: AnnotationDatabaseImpl W/System.err(11500): at java.lang.Class.classForName(Native Method) W/System.err(11500): at java.lang.Class.forName(Class.java:308) W/System.err(11500): at java.lang.Class.forName(Class.java:272) W/System.err(11500): at com.google.inject.AnnotationDatabaseFinder.getAnnotationDatabaseInstance(AnnotationDatabaseFinder.java:73) W/System.err(11500): at com.google.inject.AnnotationDatabaseFinder.<init>(AnnotationDatabaseFinder.java:36) W/System.err(11500): at com.google.inject.Guice.setAnnotationDatabasePackageNames(Guice.java:133) W/System.err(11500): at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:288) W/System.err(11500): at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149) W/System.err(11500): at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90) W/System.err(11500): at roboguice.RoboGuice.getInjector(RoboGuice.java:197) W/System.err(11500): at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90) W/System.err(11500): at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305) W/System.err(11500): at android.app.Activity.performCreate(Activity.java:5933) W/System.err(11500): at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1105) W/System.err(11500): at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2282) W/System.err(11500): at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2389) W/System.err(11500): at android.app.ActivityThread.access$900(ActivityThread.java:147) W/System.err(11500): at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1296) W/System.err(11500): at android.os.Handler.dispatchMessage(Handler.java:102) W/System.err(11500): at android.os.Looper.loop(Looper.java:135) W/System.err(11500): at android.app.ActivityThread.main(ActivityThread.java:5254) W/System.err(11500): at java.lang.reflect.Method.invoke(Native Method) W/System.err(11500): at java.lang.reflect.Method.invoke(Method.java:372) W/System.err(11500): at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:898) W/System.err(11500): at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:693) W/System.err(11500): Caused by: java.lang.ClassNotFoundException: Didn't find class \"AnnotationDatabaseImpl\" on path: DexPathList[[zip file \"/data/app/com.github.pires.obd.reader-1/base.apk\"],nativeLibraryDirectories=[/vendor/lib, /system/lib]] W/System.err(11500): at dalvik.system.BaseDexClassLoader.findClass(BaseDexClassLoader.java:56) W/System.err(11500): at java.lang.ClassLoader.loadClass(ClassLoader.java:511) W/System.err(11500): at java.lang.ClassLoader.loadClass(ClassLoader.java:469) W/System.err(11500): ... 25 more W/System.err(11500): Suppressed: java.lang.ClassNotFoundException: AnnotationDatabaseImpl W/System.err(11500): at java.lang.Class.classForName(Native Method) W/System.err(11500): at java.lang.BootClassLoader.findClass(ClassLoader.java:781) W/System.err(11500): at java.lang.BootClassLoader.loadClass(ClassLoader.java:841) W/System.err(11500): at java.lang.ClassLoader.loadClass(ClassLoader.java:504) W/System.err(11500): ... 26 more W/System.err(11500): Caused by: java.lang.NoClassDefFoundError: Class not found using the boot class loader; no stack available D/AndroidRuntime(11500): Shutting down VM D/VoldCmdListener( 210): cryptfs getpwtype E/AndroidRuntime(11500): FATAL EXCEPTION: main E/AndroidRuntime(11500): Process: com.github.pires.obd.reader, PID: 11500 E/AndroidRuntime(11500): java.lang.RuntimeException: Unable to start activity ComponentInfo{com.github.pires.obd.reader/com.github.pires.obd.reader.activity.MainActivity}: java.lang.IllegalStateException: Unable to use annotation database(s) E/AndroidRuntime(11500): at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2329) E/AndroidRuntime(11500): at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2389) E/AndroidRuntime(11500): at android.app.ActivityThread.access$900(ActivityThread.java:147) E/AndroidRuntime(11500): at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1296) E/AndroidRuntime(11500): at android.os.Handler.dispatchMessage(Handler.java:102) E/AndroidRuntime(11500): at android.os.Looper.loop(Looper.java:135) E/AndroidRuntime(11500): at android.app.ActivityThread.main(ActivityThread.java:5254) E/AndroidRuntime(11500): at java.lang.reflect.Method.invoke(Native Method) E/AndroidRuntime(11500): at java.lang.reflect.Method.invoke(Method.java:372) E/AndroidRuntime(11500): at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:898) E/AndroidRuntime(11500): at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:693) E/AndroidRuntime(11500): Caused by: java.lang.IllegalStateException: Unable to use annotation database(s) E/AndroidRuntime(11500): at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:292) E/AndroidRuntime(11500): at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149) E/AndroidRuntime(11500): at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90) E/AndroidRuntime(11500): at roboguice.RoboGuice.getInjector(RoboGuice.java:197) E/AndroidRuntime(11500): at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90) E/AndroidRuntime(11500): at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305) E/AndroidRuntime(11500): at android.app.Activity.performCreate(Activity.java:5933) E/AndroidRuntime(11500): at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1105) E/AndroidRuntime(11500): at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2282) E/AndroidRuntime(11500): ... 10 more E/AndroidRuntime(11500): Caused by: java.lang.RuntimeException: java.lang.ClassNotFoundException: AnnotationDatabaseImpl E/AndroidRuntime(11500): at com.google.inject.AnnotationDatabaseFinder.<init>(AnnotationDatabaseFinder.java:47) E/AndroidRuntime(11500): at com.google.inject.Guice.setAnnotationDatabasePackageNames(Guice.java:133) E/AndroidRuntime(11500): at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:288) E/AndroidRuntime(11500): ... 18 more E/AndroidRuntime(11500): Caused by: java.lang.ClassNotFoundException: AnnotationDatabaseImpl E/AndroidRuntime(11500): at java.lang.Class.classForName(Native Method) E/AndroidRuntime(11500): at java.lang.Class.forName(Class.java:308) E/AndroidRuntime(11500): at java.lang.Class.forName(Class.java:272) E/AndroidRuntime(11500): at com.google.inject.AnnotationDatabaseFinder.getAnnotationDatabaseInstance(AnnotationDatabaseFinder.java:73) E/AndroidRuntime(11500): at com.google.inject.AnnotationDatabaseFinder.<init>(AnnotationDatabaseFinder.java:36) E/AndroidRuntime(11500): ... 20 more E/AndroidRuntime(11500): Caused by: java.lang.ClassNotFoundException: Didn't find class \"AnnotationDatabaseImpl\" on path: DexPathList[[zip file \"/data/app/com.github.pires.obd.reader-1/base.apk\"],nativeLibraryDirectories=[/vendor/lib, /system/lib]] E/AndroidRuntime(11500): at dalvik.system.BaseDexClassLoader.findClass(BaseDexClassLoader.java:56) E/AndroidRuntime(11500): at java.lang.ClassLoader.loadClass(ClassLoader.java:511) E/AndroidRuntime(11500): at java.lang.ClassLoader.loadClass(ClassLoader.java:469) E/AndroidRuntime(11500): ... 25 more E/AndroidRuntime(11500): Suppressed: java.lang.ClassNotFoundException: AnnotationDatabaseImpl E/AndroidRuntime(11500): at java.lang.Class.classForName(Native Method) E/AndroidRuntime(11500): at java.lang.BootClassLoader.findClass(ClassLoader.java:781) E/AndroidRuntime(11500): at java.lang.BootClassLoader.loadClass(ClassLoader.java:841) E/AndroidRuntime(11500): at java.lang.ClassLoader.loadClass(ClassLoader.java:504) E/AndroidRuntime(11500): ... 26 more E/AndroidRuntime(11500): Caused by: java.lang.NoClassDefFoundError: Class not found using the boot class loader; no stack available W/ActivityManager( 1956): Force finishing activity com.github.pires.obd.reader/.activity.MainActivity\n. yes maybe... this is the 2.0-RC1 tag from 12 days ago so wouldn't have included #100 \n. here is the log with line ends ;)\nD/roboguice.RoboGuice(11500): Using annotation database(s).\nD/roboguice.RoboGuice(11500): Using annotation database(s) : [, roboguice]\nW/System.err(11500): java.lang.ClassNotFoundException: AnnotationDatabaseImpl\nW/System.err(11500):    at java.lang.Class.classForName(Native Method)\nW/System.err(11500):    at java.lang.Class.forName(Class.java:308)\nW/System.err(11500):    at java.lang.Class.forName(Class.java:272)\nW/System.err(11500):    at com.google.inject.AnnotationDatabaseFinder.getAnnotationDatabaseInstance(AnnotationDatabaseFinder.java:73)\nW/System.err(11500):    at com.google.inject.AnnotationDatabaseFinder.<init>(AnnotationDatabaseFinder.java:36)\nW/System.err(11500):    at com.google.inject.Guice.setAnnotationDatabasePackageNames(Guice.java:133)\nW/System.err(11500):    at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:288)\nW/System.err(11500):    at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149)\nW/System.err(11500):    at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90)\nW/System.err(11500):    at roboguice.RoboGuice.getInjector(RoboGuice.java:197)\nW/System.err(11500):    at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90)\nW/System.err(11500):    at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305)\nW/System.err(11500):    at android.app.Activity.performCreate(Activity.java:5933)\nW/System.err(11500):    at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1105)\nW/System.err(11500):    at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2282)\nW/System.err(11500):    at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2389)\nW/System.err(11500):    at android.app.ActivityThread.access$900(ActivityThread.java:147)\nW/System.err(11500):    at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1296)\nW/System.err(11500):    at android.os.Handler.dispatchMessage(Handler.java:102)\nW/System.err(11500):    at android.os.Looper.loop(Looper.java:135)\nW/System.err(11500):    at android.app.ActivityThread.main(ActivityThread.java:5254)\nW/System.err(11500):    at java.lang.reflect.Method.invoke(Native Method)\nW/System.err(11500):    at java.lang.reflect.Method.invoke(Method.java:372)\nW/System.err(11500):    at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:898)\nW/System.err(11500):    at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:693)\nW/System.err(11500): Caused by: java.lang.ClassNotFoundException: Didn't find class \"AnnotationDatabaseImpl\" on path: DexPathList[[zip file \"/data/app/com.github.pires.obd.reader-1/base.apk\"],nativeLibraryDirectories=[/vendor/lib, /system/lib]]\nW/System.err(11500):    at dalvik.system.BaseDexClassLoader.findClass(BaseDexClassLoader.java:56)\nW/System.err(11500):    at java.lang.ClassLoader.loadClass(ClassLoader.java:511)\nW/System.err(11500):    at java.lang.ClassLoader.loadClass(ClassLoader.java:469)\nW/System.err(11500):    ... 25 more\nW/System.err(11500):    Suppressed: java.lang.ClassNotFoundException: AnnotationDatabaseImpl\nW/System.err(11500):            at java.lang.Class.classForName(Native Method)\nW/System.err(11500):            at java.lang.BootClassLoader.findClass(ClassLoader.java:781)\nW/System.err(11500):            at java.lang.BootClassLoader.loadClass(ClassLoader.java:841)\nW/System.err(11500):            at java.lang.ClassLoader.loadClass(ClassLoader.java:504)\nW/System.err(11500):            ... 26 more\nW/System.err(11500):    Caused by: java.lang.NoClassDefFoundError: Class not found using the boot class loader; no stack available\nD/AndroidRuntime(11500): Shutting down VM\nD/VoldCmdListener(  210): cryptfs getpwtype\nE/AndroidRuntime(11500): FATAL EXCEPTION: main\nE/AndroidRuntime(11500): Process: com.github.pires.obd.reader, PID: 11500\nE/AndroidRuntime(11500): java.lang.RuntimeException: Unable to start activity ComponentInfo{com.github.pires.obd.reader/com.github.pires.obd.reader.activity.MainActivity}: java.lang.IllegalStateException: Unable to use annotation database(s)\nE/AndroidRuntime(11500):        at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2329)\nE/AndroidRuntime(11500):        at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2389)\nE/AndroidRuntime(11500):        at android.app.ActivityThread.access$900(ActivityThread.java:147)\nE/AndroidRuntime(11500):        at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1296)\nE/AndroidRuntime(11500):        at android.os.Handler.dispatchMessage(Handler.java:102)\nE/AndroidRuntime(11500):        at android.os.Looper.loop(Looper.java:135)\nE/AndroidRuntime(11500):        at android.app.ActivityThread.main(ActivityThread.java:5254)\nE/AndroidRuntime(11500):        at java.lang.reflect.Method.invoke(Native Method)\nE/AndroidRuntime(11500):        at java.lang.reflect.Method.invoke(Method.java:372)\nE/AndroidRuntime(11500):        at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:898)\nE/AndroidRuntime(11500):        at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:693)\nE/AndroidRuntime(11500): Caused by: java.lang.IllegalStateException: Unable to use annotation database(s)\nE/AndroidRuntime(11500):        at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:292)\nE/AndroidRuntime(11500):        at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149)\nE/AndroidRuntime(11500):        at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90)\nE/AndroidRuntime(11500):        at roboguice.RoboGuice.getInjector(RoboGuice.java:197)\nE/AndroidRuntime(11500):        at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90)\nE/AndroidRuntime(11500):        at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305)\nE/AndroidRuntime(11500):        at android.app.Activity.performCreate(Activity.java:5933)\nE/AndroidRuntime(11500):        at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1105)\nE/AndroidRuntime(11500):        at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2282)\nE/AndroidRuntime(11500):        ... 10 more\nE/AndroidRuntime(11500): Caused by: java.lang.RuntimeException: java.lang.ClassNotFoundException: AnnotationDatabaseImpl\nE/AndroidRuntime(11500):        at com.google.inject.AnnotationDatabaseFinder.<init>(AnnotationDatabaseFinder.java:47)\nE/AndroidRuntime(11500):        at com.google.inject.Guice.setAnnotationDatabasePackageNames(Guice.java:133)\nE/AndroidRuntime(11500):        at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:288)\nE/AndroidRuntime(11500):        ... 18 more\nE/AndroidRuntime(11500): Caused by: java.lang.ClassNotFoundException: AnnotationDatabaseImpl\nE/AndroidRuntime(11500):        at java.lang.Class.classForName(Native Method)\nE/AndroidRuntime(11500):        at java.lang.Class.forName(Class.java:308)\nE/AndroidRuntime(11500):        at java.lang.Class.forName(Class.java:272)\nE/AndroidRuntime(11500):        at com.google.inject.AnnotationDatabaseFinder.getAnnotationDatabaseInstance(AnnotationDatabaseFinder.java:73)\nE/AndroidRuntime(11500):        at com.google.inject.AnnotationDatabaseFinder.<init>(AnnotationDatabaseFinder.java:36)\nE/AndroidRuntime(11500):        ... 20 more\nE/AndroidRuntime(11500): Caused by: java.lang.ClassNotFoundException: Didn't find class \"AnnotationDatabaseImpl\" on path: DexPathList[[zip file \"/data/app/com.github.pires.obd.reader-1/base.apk\"],nativeLibraryDirectories=[/vendor/lib, /system/lib]]\nE/AndroidRuntime(11500):        at dalvik.system.BaseDexClassLoader.findClass(BaseDexClassLoader.java:56)\nE/AndroidRuntime(11500):        at java.lang.ClassLoader.loadClass(ClassLoader.java:511)\nE/AndroidRuntime(11500):        at java.lang.ClassLoader.loadClass(ClassLoader.java:469)\nE/AndroidRuntime(11500):        ... 25 more\nE/AndroidRuntime(11500):        Suppressed: java.lang.ClassNotFoundException: AnnotationDatabaseImpl\nE/AndroidRuntime(11500):                at java.lang.Class.classForName(Native Method)\nE/AndroidRuntime(11500):                at java.lang.BootClassLoader.findClass(ClassLoader.java:781)\nE/AndroidRuntime(11500):                at java.lang.BootClassLoader.loadClass(ClassLoader.java:841)\nE/AndroidRuntime(11500):                at java.lang.ClassLoader.loadClass(ClassLoader.java:504)\nE/AndroidRuntime(11500):                ... 26 more\nE/AndroidRuntime(11500):        Caused by: java.lang.NoClassDefFoundError: Class not found using the boot class loader; no stack available\nW/ActivityManager( 1956):   Force finishing activity com.github.pires.obd.reader/.activity.MainActivity\n. but it sounds like we need to tag 2.0-rc2 to get that proguard fix included\n. Version 2.0-RC2 has now been build by f-droid and is available https://f-droid.org/repository/browse/?fdid=com.github.pires.obd.reader\n. sorry if i'm missing something but shouldn't it already be taken from the settings, or is it broken?\n``` java\n  public static int getObdUpdatePeriod(SharedPreferences prefs) {\n    String periodString = prefs.\n            getString(ConfigActivity.OBD_UPDATE_PERIOD_KEY, \"4\"); // 4 as in seconds\n    int period = 4000; // by default 4000ms\ntry {\n  period = (int) (Double.parseDouble(periodString) * 1000);\n} catch (Exception e) {\n}\n\nif (period <= 0) {\n  period = 4000;\n}\n\nreturn period;\n\n}\n```\n. builds and runs but getting  \"7F 01 12\" as response from several commands which i guess is the new UnsupportedCommandException? \n. we should also add the new commands to https://github.com/pires/android-obd-reader/blob/master/src/main/java/com/github/pires/obd/reader/config/ObdConfig.java so that they become available \n. to answer my own question:\n\ngetting \"7F 01 12\" as response from several commands which i guess is the new  UnsupportedCommandException?\n\nyes it is , since it is now actually throwing an exception the raw response is shown. we should probably make it more pretty by replacing  \"7F 01 12\" with \"NA\" or \"-\"  or something like that (and possibly maybe disabling unsupported command for remaining of the live data collection cycle?)\n. yes will have a look , in any case I'll merge the pull request and raise issue for adding new commands and prettifying unsupported command results\n. commented on pires/obd-java-api#34\n. no not really without diving into it, works for me on Android 5-something...   any suggestions welcome\n.  i set up F-droid to automatically build from github but that works on the  android:versionName \nin AndroidManifest.xml ..  so if someone updates that to match the latest tag  (exactly!) it should \nautomagically appear on f-droid \nOn Sunday 20 December 2015 08:52:25 mvglasow wrote:\nSame symptoms here, too: I can collect live data but when I try to get DTC, it says \"Unable to \nconnect to Bluetooth device\". The error message indicates the error happens lower down in the \nstack – or the app is giving out a misleading error message. \nAs for F-Droid: for most apps they simply build an APK from the repo. Thus, apart from the \nsignature, there is no difference between an F-Droid build, a version I have built myself and \n(presumably) a release build on github. They may occasionally patch apps to remove advertising \nor non-free dependencies, but they try to limit this to a few exceptional cases because they lack \nthe resources to do such adaptations. \n—Reply to this email directly or view it on GitHub[1].[2]\n\n[1] https://github.com/pires/android-obd-reader/issues/111#issuecomment-166134871\n[2] https://github.com/notifications/beacon/\nAJpBTtXf97GYlddrtgixrKxUrz2ayh3mks5pRtRJgaJpZM4FYQXB.gif\n. with obd-java-api 1.0-RC3 it now returns \"7F0112\" instead of \"7F 01 12\" ...\n. tested but none of the new commands seems to be supported by my car\n. thanks,  yeah the overlaps get worse with real  (longer) data. it seems something is messed up with gridview,  all bits are set to wrap content for height but for some reason some of the rows that have text wrapping seem to get the wrong height... \n. @Pho3niX90 i'd guess android sdk version issues?   for example: @dimen/abc_text_size_large_material seems to be defined in \nbuild/intermediates/exploded-aar/com.android.support/appcompat-v7/22.1.1/res/values/values.xml\nmaybe build.gradle needs updating?\ndependencies {\n    compile 'com.android.support:appcompat-v7:22.1.1'\n. @Pho3niX90  yeah i see your (now closed?) pull request #116 , is the main trick to add an empty text view below each result_view item?\n<TextView android:layout_span=\"2\" android:layout_height=\"1px\"\n        android:layout_width=\"fill_parent\" android:text=\"\"></TextView>\n. the layout_span doesn't seem to help for me but if you give it a background colour it nicely highlights the issue: \n\n. thanks! will have a closer look at it later\n. please merge if you're happy with it, as you see from the screenshot there are still some minor issues but we can work on them later\n. @Pho3niX90 thanks for your suggestions, adding extra space does definitely help but doesn't seem to solve the issue with the gridview itself, I'll try to sort it later.\n. hey,  just close it.  too far behind to merge it now\nwould still be nice to have a gridview...\nOn Thursday, 12 May 2016 04:51:53 CEST Paulo Pires wrote:\nAny updates on this? \n—You are receiving this because you were mentioned.Reply to this email directly or view it on \nGitHub[1][2]\n\n[1] https://github.com/pires/android-obd-reader/pull/115#issuecomment-218734978\n[2] https://github.com/notifications/beacon/AJpBTnXpek5jrmR6awFUE3cZ_y6gusb-ks5qAxRZgaJpZM4FbiXU.gif\n. thanks for testing, i believe this had just been fixed in pires/obd-java-api#50\n. is there a difference between the version you tested an RC5?\n. it would be really great to have descriptions for the dtc codes but i'm wondering where the data come from, was it released under a license that allows us to use it? or is it public information like a standard published somewhere?\n. doesn't seem to be too kind, http://engine-codes.com/about/terms.php : \"Be advised that all information contained on this site is the copyrighted property of Engine-Codes.com and/or its affiliated companies. This site, Engine-Codes.com, including all other URL's owned by Engine-Codes.com and its owner, contains copyrighted material, trademarks and other proprietary information, including, but not limited to, graphics, music, photos, software, text and video. The whole contents used on or incorporated into this Web site, and the arrangement or integration of all such content and graphics are subject to any copyrights held by or licensed to Engine-Codes.com or in respect of which Engine-Codes.com is protected or entitled to by operation of any law, and all rights thereto are specifically reserved.\"   \nThe underlying problem is that car manufactures claim this as their propitiatory information\n. cool that dmv link looks like a good source\n. i think this applies in general , for example a unsupported command in unlikely to suddenly become supported. so maybe if a command return same value x number of times don't request it again in that session ?  but that might not be a good idea for all commands\n. or maybe move both to the preference dialogue, i.e. before (only show available) or after(check selected) selecting the commands.  and for vin, since we already have a setting for vin there we could add option to get it from the car.\n. yep did the same thing ;) not sure where to put it either\n. thanks,  would you mind reformatting with 2 space indents instead of 4 so that it is easier to see the changes\n. thanks but i think something might have gone wrong since i still seems to be indented by 4 spaces (and the new commit 5ae30d0c2 only has one small change)?\n. you can change the indentation settings (for the project or in general) in android studio and tell it to reformat, that should do it. makes it so much easier to review and keep track of changes .   there has been some discussion before about reformatting the project to use 4 spaces but don't think we settled that :)\n. hey, some files seem still indented with 2 spaces    e.g.  src/main/java/com/github/pires/obd/reader/activity/MainActivity.java (but it is re-arranged), was that the intention?\n. @Pho3niX90 I merged #128 for a quick fix while we sort out the code formatting \n. Thanks!  this fixes #127\n. i think the imports are missing?\n. ...especially not to someone else's server (http://wesenseit-vm1.shef.ac.uk ;)\n. this is the key part\n. was this intended, it seems to revert a recent commit?\n. ",
    "Pho3niX90": "Works on one of my vehicles. \n. Accelerometer wont be needed for proper fuel consumption. I have already made pull requests. The method will be to see how much fuel is actually injected and then calculate the fuel being burned. Most vehicles do have trims to actually show how the afr is being changed (example. Going uphil, going WOT ect)\n. Just as a note.\nCompared to Torque, torque polls double the sensors in half the time\n. Excuse me but your troubleshooting method in the readme states to compare and test in torque as well. \nCode removed was\n/*\n * HACK GOLDEN HAMMER ahead!!\n * \n * Due to the time that some systems may take to respond, let's give it\n * 200ms.\n */\nThread.sleep(200);\n. Has anyone started on this? This should be relatively easy to do.\n. I have fixed this issue in my version. The issue was that it crashes when there are no errors found. I will see if I can incorporate my fix with this.\n. @pires is an app issue. I will provide a fix in the next 30mins. \n. Try this: https://github.com/pires/android-obd-reader/pull/153\n. @mvglasow are you able to read any other data? Have you conpletely restrted your phone and then ONLY tried reading dtc without clicking on start live data?\n. Try #155, that should work if it is in fact your issue\n. An issue that I noticed throughout the project is that layout files referring to \"dimen\" resources that do not exist. Am I the only one that has this issue?\n. I made some changes to the files to prevent the overlap of text. I hope I did it correctly in github for you to see\n. Sorry I redid it. There are 2 file changes.\n. \n. Only diff is I have the altitude in the gps as well. My data is emulated with obdsim\n. Awesome. I will test that and revert back\n. This is working like a charm now. \n. I tried it on my 750 today and it couldn't properly pick up the vin, instead it returned \"IWIBLI82I61I1\". \n. Yes I am using the correct version. This is working on the one car but not the other. \n. I haven't tested. Which obd terminal do you suggest\n. I added the headers command and that solved it. Thank you.\n. That solution just yields hex code returned\n. I have implemented your solution, vin now comes back IIBSI92I0JI68\n. Please ignore the above. Just noticed this is on an E46 m3. I am testing the app on a fleet of BMWs \n. So it has creeped up again with another car. IWIBCI38I05I5\n. I have started implementing this into my version. Sadly I can only test with the car since obdsim only allows limited readings. If all goes according to plan I should have this working this week.\n. So I have started this. Need to test on multiple vehicles though first.\nFor the time being I have made the pull request for everyone to test the 2 different AFRs as it is crucial to the consumption\nhttps://github.com/pires/obd-java-api/pull/55 \nhttps://github.com/pires/android-obd-reader/pull/129\nIf you guys can provide me feedback on which one works the best and actually returns an AFR reading, the AFR, or AFR wide. Also provide your vehicle details if possible. \nAlso let me know if the MAP/MAF reading is working for you\n. @pires Which tests are you referring to?  Never mind. I will add it in my todo next time. \n. Dependent on ResetTroubleCodes.java\n. Not to worry. It is published all over the web. There are hundreds of websites that have the descriptions for trouble codes.\n. http://engine-codes.com/\n. But as far as I know the trouble codes are all based of the OBD2 standard. \nhttp://www.obd-codes.com/trouble_codes/\nhttp://www.dmv.de.gov/services/Vehicle_Services/dtc_list.pdf\nhttp://www.outilsobdfacile.com/data-trouble-code-obd2.php\n. Here is the pull request for the java part: https://github.com/pires/obd-java-api/pull/51\nHere are screenshots, emulated data:\n\n\n\n. I added altitude as well. It is useful for calculating altitude HP loss, which I will add later. \n. Yes that would be the ideal solution. There is a class that checks the supported PIDs, when a session is started it would be good to run this first and store the PID's with the vin, so next time it knows what can be polled and what can't. \n. I will try to add the feature, I am craving for faster data \n. Here you go. https://github.com/Pho3niX90/OBD2-SERVER\nIts extremely simple, just add credentials and it will automatically create the database and add the new columns, if new readings gets added it will automatically create the new columns as well. \n. @pires yes it is a server. That's the end url, have been running it. \nThe brilliant part about it is that it automatically creates the tables and fields as required, so maintenance on it is null\n. Done\n. I think it might be android studio that forces it 4 indents. Also the file was cleaned and reorganised.  Main part that was changed is at the  support check, just search for .apply () or .commit ()\n. Okay I have tried everything now. Changed android studio to 2 lines, selected 2 indents straight in github as well. \n. Think 4 is the best to use. Reason being that all ide's do that, or suggest that. Even github understands code with 4 indents and even stackoverflow\n. @pires Yes sure I will wait\n. It's this:\n<string name=\"action_clear_codes\">Clear Codes</string>\nAnd obdreadings fix is \nhttps://github.com/pires/android-obd-reader/pull/125/files\n. @nomwerp okay thats perfect\n. @Hippoish24 http://developer.android.com/training/articles/memory.html#DependencyInjection\nIf you really need to use a framework I would say use http://google.github.io/dagger/\n. The car was stationary. So non of those readings are correct.\n. Here is a screenshot from terminal\n\n. Fixed it.\n. Seems that it isn't fixed. What I can gather is that for some dongles echo doesn't always turn off. \n. @sytolk You are receiving echos. Some adapters require you to turn on echo and then off twice. Give that a try.\n. @sytolk also make sure headers are off\n. @sytolk they are sent to turn of by default. But I have noticed on some dongles they need to be turned on and then off to correctly work. \n. Awesome thanks. Haven't been active in a while. \n. I have implemented something similar but in native android development. It creates a log file and asks the user if the log should be mailed. \n. True. But acra is another library that needs to be taken into consideration when compiling. I agree that only developers needs logs, that's why you might as well use android native code and send a complete logcat to the developer. \nSee here -> https://github.com/pires/android-obd-reader/pull/144\nUnless acra picks up beter logs than the native android system that I am not aware of ?\n. I agree. Although, not having a local broadcoast could allow for future plugin development? To keep the core app small and individuals install plugins?\n. Okay I have implemented this in my app. One issue though. \nObdCommand.java needs to implement Parcelable.\nThis is so that all activities receive the full package to call the methods as required. A workaround that I can think of now is to only send the formatted result which isn't ideal. \n. @pires that will be a better solution. I will have a look into it.\n. Hi. \nI can't continue with this one. My project has dramatically changed and submitting PR's from it will just be catastrophic.\nThis is also a fairly simple change that I have already implemented in my project. However, I am not sure how you will get around not editing the java, maybe you should write a separate version of ObdCommand.java for this project?\nI have to say this is the best change that can be made. After doing this I was able to bring my project to live by adding extra activities and having gauges in some of them. \n. Sure stuff. Just need to review and test first, I have already added the spaces command to my project, still need to remove the redundant code. \n. Need this first: https://github.com/pires/obd-java-api/pull/68\n. Hi. \nI can't continue with this one. My project has dramatically changed and submitting PR's from it will just be catastrophic. However this change is very simple and will see if I can get some time to do it. For now I am closing.\n. That makes complete sense.\n. @sytolk What exactly more do you need than a complete logcat + device information + android info?\n. @sytolk Okay let me rephrase myself. This gives you a complete log for the application, that includes debug message, error messages and info messages.\n. @sytolk If you do not write new code how are you a developer? I do not understand?\n@pires I have changed the name from my test app to the correct \"OBD2 Reader\". \nWhat do you suggest around the email address? This should be the main developers email address, but give the end user the option to change that address?\n. @pires  Is this sufficient? \n. wrong git\n. @pires I have no idea how to rebase. I made changes in browser. \n. Here is the full list, http://www.obd-codes.com/trouble_codes/\nHowever, most DTC are brand specific and descriptions change. \n. @mvglasow That is an interesting read and never knew that. I did have reference to an opensource db somewhere. I know we have discussed this in another issue somewhere, but since the trouble codes are law they are very generic and should follow a principle and guideline.\nHere are more: http://www.nology.com/OBD2FaultCodes.htm\nAnd another without any copyright notice: http://www.dtcsearch.com/\n. I am busy populating a DB. Question is should this be kept in an Array (For easy translation). Or a sqlite db that cannot be translated. \n. It will be 3 arrays, the key (code), the description and the make. Each being 7919rows.\nI will create the pull request. \n. @mvglasow I also prefer a DB. But realistically people that will be translating will most probably not have the apps to open up a db and edit it.  On commits you also will not have the ability to see what actually changed. And the extra programming might be a pita and will require a lot of testing to make sure it doesn't cause issues with special characters. \n. No nothing. With my debugging it just doesn't happen, but no error logs. I am trying to figure out why the service doesn't bind / recreate unless the app gets a proper restart\n. @pires I am busy testing the performance. \n. @pires fixed some typos. Tested the performance and it's beyond perfect, no delays at all.\nHowever, I did pick up a separate error unrelated to this though. It seem that if there are more than 9 errors it starts acting  out. Might be due to the increased frames beyond 9 \n. @Kolyall Can you please instead of using the calculated results, publish the rawData respons? This will explain what is going on\n. @pires I think this is purely a protocol that is not supported by the vehicle. \n@Kolyall Which vehicle are you testing on and which year model? If I am correct this is not crashing the app, but just throwing the stacktrace? Thus far I have only seen 1 car that supports fuel level, and non that supports run-time (accurately). \n. Have you tried the latests version of the app? This should have been fixed in a previous PR. \n. This is still an issue on my side as well. I am prepared to put up a $10 reward for a proper fix for the VIN. \n. For all that are having this issue, please post your rawData vin here. I need to see what vins are being returned so that I can figure out one algorithm.\n. @kirbyjames\nCould you please post your raw response from the obd. So that I can do tests?\n. @KirbyJames Pleaes try this project: http://goo.gl/uAcCK3\nReplace the result string with your raw response. See if it's giving you the correct output\n. @KirbyJames I will need your rawData response to rrsolve. \n. in calculated results. Instead of returning vin return rawData\n. @KirbyJames \nPlease add the following in you vin data\nLog.d(\"VinCommand.java\", \"rawdata: \" + rawData);\nLike so:\n\nThen find the raw response in your logcat. \n. @KirbyJames I have no idea to be honest. I have completely moved away from gradle. \n@Pires do you know the answer to the above question?\n. @KirbyJames Awesome news! What vehicle was it used in, which country and what year model is the vehicle? This will help greatly in diagnosing further enchancements to the VIN. \n. Then it's most def a can. on same restriction as we here in south africa are, except no emissions. \nAnyways, yes the changes will be added to the lib, pullrequest is located here -> https://github.com/pires/obd-java-api/pull/113 \n. HI, please see https://en.wikipedia.org/wiki/OBD-II_PIDs\nYou will have to hack the canbus to achieve what  you need, not part of this project. \n. @jbits could you please elaborate on the issue? \n. You are either selecting the incorrect device to connect to, or the device is faulty. \n. @yangwuan55 care to share what the problem was?\n. Yes perfect thank you\n. @pires yes that is correct, I am currently looking into other more elegant avenues to fix it. This is just a quick fix. \n. 1. This is because OBD2 protocol is not lightning fast, there will always be a delay based on the ECU of your vehicle + OBD2 adapter being used. \n2. As for distance traveled, is your GPS working? \n. @kaorijp if you do not like that it uses GPS to get accurate distance traveled as opposed to a OBD2 PID that is unreliable then I suggest you modify it to your liking. \nAs for speed issues, the app by default polls ALL sensors and will slow down individual PIDs. So turn off all sensors that you are not interested in.  The app you mentioned does not poll more than 3 to 4 sensors at a time I assume. \n. @sytolk It's available, but I have never gotten anything reliable or remotely accurate from it. The thing is all mobile devices today have a proper built in GPS to properly calculate the distance traveled. Being a business intelligence developer by trade I always opt for the most accurate data possible. \n@pires always a pleasure\n. @bitaromulus that is incompatibility. You are seeing can responses. I am busy working on getting can to work, however my vehicle's do not respond in can so it's taking longer than expected. \nCould you please post more raw responses along with what the value should be (roughly).\n. @kaorijp could you please post your raw responses?\n. @kaorijp Distance MIL is not distance traveled, it's distance traveled with MIL light on.\n. @bitaromulus thank you for the examples you have posted. \nMy pc crashes and need to resetup everything from scratch again. Once I have done that I will work on a solution for the can messages.  I will look into acquiring the ecusim as well for the multiprotocol development. Currently I use win-obdsim for testing but only supports kline messages. \n. @bitaromulus \nCould you please post example of these mods\n29 bit / Fast Init + 500kbps\n11 bit / 5 Baud Init + either 500 kbps or 250 kbps\nWith 2 raw examples of each knob, for each protocol above? That would be a considerable help to improve the library @ https://github.com/pires/obd-java-api/issues/115\n. @kaorijp no it doesn't have such a function. Only distance travelled with MIL on, and since codes cleared. See https://en.wikipedia.org/wiki/OBD-II_PIDs\n. @kaorijp What are you trying to achieve?\n. @kaorijp Then there is no pid for you. 31 has a max value it will display and does not get reset on each trip. 31 is distance travelled after the last time errors were cleared. And it's not supported by most vehicles as far as I have seen\n. @sytolk There is no generic PID for this. Therefore not possible in this project. You will have yo run a sniffer on your vehicles network to find it. But this is different per brand and per model. I personally do not see a need for this so cannot assist in persuing it when the gps works flawlessly. \n. @kaorijp My only suggestion to what you want to achieve is monitor the cars speed over the session time and calculate the distance. \n. ",
    "batsri": "I think that the message you see is 'Starting OBD connection...' and it is when the connection is starting but it doesn't say that the connection has succeeded. if the connection failed you will receive in the logcat: 'There was an error while establishing connection'.\n. ",
    "kenticus": "If you need some help on this, I'd be happy to help you do some research if you want to direct me to a specific topic.\n. Any insight to this issue? Sorry to bug you again. I've written a pretty large app, and unfortunately is depends on this working.\n. Thanks! I'm excited to see your progress.  I'm make sure to attribute you and your library when I release my app.\n. Hey Paulo, quick question. How confident are you that you will get this fixed? I'm thinking about starting a new project, but if you think this will be fixed soon I'll hold off on the new project in favor to finish this one.\n. nevermind....Maven was pointed to wrong repo.\n. ",
    "balbassam": "Hi @pires  I posting to clarify aoubt this project. Does this API now work ? \n. ",
    "mvglasow": "Strange, it still doesn't work for me (I'm using version 1.3 as downloaded from F-Droid). The reader seems to work as I can connect with my laptop, but never got it to work with my phone.\nJust tried on Android 4.3 (Cyanogenmod 10.2RC1) and got a different picture than before. RFCOMM supposedly works in 4.3 (though I don't have any app to verify this). Also, the Bluetooth keyboard which I didn't get to work with 4.2 works with no issues under 4.3.\nHowever, with OBD II Reader, the connect still fails and I get the following errors:\n11-27 23:37:25.101 D/ObdGatewayService( 2696): Starting service..\n11-27 23:37:25.101 D/ObdGatewayService( 2696): Stopping Bluetooth discovery.\n11-27 23:37:25.105 D/BluetoothAdapterService(1100024472)( 860): getState(): mAdapterProperties: com.android.bluetooth.btservice.AdapterProperties@41912b20\n11-27 23:37:25.105 E/ ( 860): ### ASSERT : external/bluetooth/bluedroid/main/../btif/src/btif_dm.c line 1237 unhandled search services event (6) ###\n11-27 23:37:25.113 D/ObdGatewayService( 2696): Starting OBD connection..\n11-27 23:37:25.113 W/BluetoothAdapter( 2696): getBluetoothService() called with no BluetoothManagerCallback\n11-27 23:37:25.113 D/BTIF_SOCK( 860): service_uuid: 00001101-0000-1000-8000-00805f9b34fb\n11-27 23:37:25.113 D/BluetoothSocket( 2696): connect(), SocketState: INIT, mPfd:\n{ParcelFileDescriptor: FileDescriptor[53]}\n11-27 23:37:25.453 E/bt-rfcomm( 860): PORT_DataInd, p_port:0x53974948, p_data_co_callback is null\n11-27 23:37:25.527 W/bt-btif ( 860): info:x0\n11-27 23:37:25.527 D/ ( 860): remote version info [00:0d:18:a0:4e:35]: 3, 7b, 229\n11-27 23:37:25.527 D/btif_config_util( 860): btif_config_save_file(L153): in file name:/data/misc/bluedroid/bt_config.new\n11-27 23:37:25.695 W/bt-sdp ( 860): process_service_search_attr_rsp\n11-27 23:37:25.722 E/bt-btif ( 860): DISCOVERY_COMP_EVT slot id:13, failed to find channle, status:1, scn:0\n11-27 23:37:25.726 W/bt-btif ( 860): invalid rfc slot id: 13\n11-27 23:37:25.726 E/ObdGatewayService( 2696): There was an error while establishing connection. -> read failed, socket might closed or timeout, read ret: -1\n11-27 23:37:25.726 D/ObdGatewayService( 2696): Stopping service..\nSince the Bluetooth stack changed completely, some things may work differently. Apparently, Bluedroid is pickier about call parameters than Bluez was. My suspicion is that OBD II Reader is doing some operation that Bluedroid doesn't like (but which Bluez would handle).\nI see three errors in the log, which might have to do with it:\n- the assert error (which seems to be a log entry from the Bluetooth stack itself - if it's related to the app, it might be a parameter issue)\n- bt-rfcomm: PORT_DataInd, p_port:0x53974948, p_data_co_callback is null (there is an earlier warning about a missing BluetoothManagerCallback, which may be related)\n- bt-btif: DISCOVERY_COMP_EVT, failed to find channel (surrounded by two warnings)\n2696 seems to be the ODB II Reader process, 860 appears to be a Bluetooth-related system service. (I tested two apps and got PID 860 in the logs for both apps.)\nSomething still isn't right, but at this point I can't tell whether the fault lies in the app or in Android. I have another app, iTLogger (also on F-Droid), which suffers from the same issue and still doesn't work on CM10.2RC1. Errors in the log look very similar.\n. Tried today with 2.0-RC2, still no luck. OS is now Android 5.1.1.\n. Where can I find that out? The car is a 2005 Audi A4 (B7 model).\n. No, so far I've only used the APKs on F-Droid.\n. A question, though: how come live data works while DTC doesn't? I thought the underlying protocol is the same for both – or am I wrong?\n. Same symptoms here, too: I can collect live data but when I try to get DTC, it says \"Unable to connect to Bluetooth device\". The error message indicates the error happens lower down in the stack – or the app is giving out a misleading error message.\nAs for F-Droid: for most apps they simply build an APK from the repo. Thus, apart from the signature, there is no difference between an F-Droid build, a version I have built myself and (presumably) a release build on github. They may occasionally patch apps to remove advertising or non-free dependencies, but they try to limit this to a few exceptional cases because they lack the resources to do such adaptations.\n. Yes, downloaded from https://github.com/pires/android-obd-reader/releases/download/2.0-RC3/android-obd-reader-debug.apk. The app shows as RC2 in the package manager, but that is presumably due to https://github.com/pires/android-obd-reader/blob/2.0-RC3/src/main/AndroidManifest.xml#L6.\n. @pires OK, will try. Just to clarify: the app does not crash, it simply displays a toast with an error message.\n. Same issue with RC4. When I try to read DTC, all I get is a toast saying \"unable to connect to Bluetooth device\".\nLogcat is attached. Since at the same time Android was syncing my phone book and dumping all its contents to the log, I've filtered for com.github.pires. If you need other data, let me know.\nalogcat.2015-12-21-15-22-32+0100.filtered.txt\n. @pires I have a suspicion what it might be: LiveData and DTC define their own methods to connect to the OBD dongle, and implementations differ.\nCompare ObdGatewayService (live data):\nhttps://github.com/pires/android-obd-reader/blob/2.0-RC4/src/main/java/com/github/pires/obd/reader/io/ObdGatewayService.java#L138\nand DTC:\nhttps://github.com/pires/android-obd-reader/blob/2.0-RC4/src/main/java/com/github/pires/obd/reader/activity/TroubleCodesActivity.java#L295\nObdGatewayService has a workaround for certain Bluetooth connection issues, which is missing for DTC. Unfortunately my logcat got cut off at the start, so I can't tell for sure if live data relies on the fallback on my phone, but it's probably a good idea to implement the fallback in DTC as well.\n. @Pho3niX90 see above – yes, live data works. Didn't try restarting, though. My test cycle was:\n- Upgrade\n- Start live data – works.\n- Stop live data.\n- Get DTC – error.\n- Start live data – works.\n- Stop live data.\n- Get DTC – error.\nCurrently my suspicion is that it's a low-level issue and that my phone requires the hack in ObdGatewayService to get anything out of the dongle at all, and DTC won't work because it's lacking the fallback machanism.\n. I've just built it myself and implemented a fix, which is functionally equivalent to #155. In fact it works now. I'll just clean up the code to make it a bit more modular (duplicate code isn't very nice) and then send you a merge request.\n. Just built and tested successfully (live data and DTC work).\nI've introduced a new class, io.BluetoothManager, to take the new method, because I didn't find any other class that looked appropriate for this. If you have a better idea (you certainly know the code better than I do), feel free to refactor.\n. as stated in #111, please hold it back for a while, as I have a similar fix, which de-duplicates some code. Coming soon...\n. @Pho3niX90 This is a really great resource! Unfortunately the bottom of the page states that all information on the page is strictly copyrighted, so we probably won't be able to just siphon off their data and feed it into the tool. They do permit linking, though – we could have each DTC open a link to their site (http://www.obd-codes.com/$DTC, replacing $DTC with the respective code).\nAs for brand-specific DTCs: obd-codes.com states that, of the P codes, only those beginning with P1 are manufacturer-specific. The same seems to be true for the C codes (the C0 codes appear to be generic, and they have a list of GM-specific codes starting with C1) and also of the U codes. The have no information on manufacturer-specific B codes, and all the codes they have start with B0. I'd suspect that, as with the others, any manufacturer-specific B codes would also start with B1.\nThe OpenOBD db has manufacturer and model fields but currently they are all set to \"Generic\".\nAbout descriptions changing – different implementations may use different wordings, as in:\nP0441 Tank Venting System Function (Android OBD-II Reader)\nP0441 Evaporative Emission System Incorrect Purge Flow (OpenOBD)\nP0441 Evaporative Emission Control System Incorrect Purge Flow (obd-codes.com)\nHowever, these are all referring to the same thing, with some descriptions being a bit more specific than others. But I'd expect the meaning of the codes to be stable – at least for the generic codes (other than B1, C1, P1, U1). Or do you have examples where the meaning changed?\n. @Pho3niX90 If it's not too late: a Sqlite DB could be translated as well if we included an extra column for language. The search key would then be DTC, make and language. The language field could be null for English descriptions, with some logic to fall back to that if no description is found in the current UI language.\nIt would take some extra coding: we'd initially need to determine the UI language. Then, on each lookup, we'd look for entries in that language, and if no result is found, repeat the search for the default language.\nOn the long run, I think a database is easier to maintain than a set of arrays.\n. ",
    "abhijitpandey": "Bug doesn't seem to be fixed. Am using LG Nexus 5 Android Version 4.4.4\nAfter the fallback, the jobs are queued, but runs into socket errors and no data is read from ECU.\nAbhijit\nD/BluetoothSocket(20310): connect(), SocketState: INIT, mPfd: {ParcelFileDescriptor: FileDescriptor[62]}\nW/bt-btif ( 1774): info:x0\nD/        ( 1774): remote version info [00:0d:18:28:22:7c]: 3, 7b, 229\nI/ActivityManager(  763): Start proc com.skype.raider for broadcast com.skype.raider/com.skype.android.audio.BluetoothReceiver: pid=21533 uid=10107 gids={50107, 3003, 3002, 1028, 1015}\nW/bt-sdp  ( 1774): process_service_search_attr_rsp\nE/bt-btif ( 1774): DISCOVERY_COMP_EVT slot id:14, failed to find channle,                                       status:1, scn:0\nW/bt-btif ( 1774): invalid rfc slot id: 14\nD/dalvikvm(  181): GC_EXPLICIT freed 42K, 1% free 16697K/16772K, paused 2ms+3ms, total 21ms\nE/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): There was an error while establishing Bluetooth connection. Falling back..\nE/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): java.io.IOException: read failed, socket might closed or timeout, read ret: -1\nE/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310):     at android.bluetooth.BluetoothSocket.readAll(BluetoothSocket.java:505)\nE/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310):     at android.bluetooth.BluetoothSocket.readInt(BluetoothSocket.java:516)\nE/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310):     at android.bluetooth.BluetoothSocket.connect(BluetoothSocket.java:320)\nE/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310):     at pt.lighthouselabs.obd.reader.io.ObdGatewayService.startObdConnection(ObdGatewayService.java:174)\nD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Queing jobs for connection configuration..\nW/bt-btif ( 1774): new conn_srvc id:26, app_id:1\nD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Adding job[1] to queue..\nD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Job queued successfully.\nD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Executing queue..\nD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Taking job[1] from queue..\nD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Job state is NEW. Run it..\nE/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Failed to run command. -> Broken pipe\nD/pt.lighthouselabs.obd.reader.io.ObdGatewayService(20310): Job is finished.\n. Fixed with spapas merge.\n. ",
    "sebaroesch": "As far as I understand, the current code does expect the BT adapter not to return any result for the command to reset the OBD BT adapter (\"AT Z\") and thus doesn´t read (and clear) the return buffer at all.\nSince my adapter IS returning something for \"AT Z\" (the ELM version) this return value is still in the buffer, when the  returned value for the next command (\"AT E0\" in my example) is fetched. This causes kind of a chain reaction, so that the result stored for each command executed after \"AT Z\", is in fact the result of the preceeding command. And this, in turn, sometimes leads to a parsing error when calling getFormattedResult, since the result obviously has a different format than expected.\n. ",
    "Cesc83": "I edited the MAC address just on the log, didn't want to post the real one. No changes were made in your code.\nI'm getting this error when trying to connect to a physical ELM 327 interface connected to an HW emulator. The older version (http://code.google.com/p/android-obd-reader/downloads/list) and other software (i.e. Torque) works fine in this configuration.\nNotably, the current version works fine with OBDSim (SW emulator).\n. Here is the complete log:\nhttps://gist.github.com/Cesc83/3550ed1004dbbaeded54\n. ",
    "omarpontis": "Obviously this line in ObdCommand.getResult() doesn't work: \nrawData = ((rawData.contains(\"SEARCHING\") || rawData.contains(\"DATA\")) ? NODATA : rawData);\nI forced the assignement rawData = NODATA , but i obtain the same error message: \nSame speech for \"STOPPED...\". I get the same error:\n4800-4800/pt.lighthouselabs.obd.reader E/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Failed to run command. -> Invalid int: \"0xNO\"\n. \nI used these two elm327 interfaces. With the black one i obtain the error message reported above. With the blue one i can't even communicate. \n. Hi guys. I tested version 0.4 with an hardware emulator .\nIt works...once in a while :) \nI report three different behaviors :\n1\nEverything goes well.\n2\nI select 'Start Live Data' and nothing happens and finally the  app crashes. \nLOGCAT : \n04-10 14:39:37.030  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.activity.MainActivity﹕ Starting live data..\n04-10 14:39:37.030  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.activity.MainActivity﹕ Service is bound? true, and running? false\n04-10 14:39:37.030  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.activity.MainActivity﹕ Service is not running. Going to start it..\n04-10 14:39:37.030  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Starting service..\n04-10 14:39:37.037  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Stopping Bluetooth discovery.\n04-10 14:39:37.053  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Starting OBD connection..\n04-10 14:39:37.053  13156-13156/pt.lighthouselabs.obd.reader W/BluetoothAdapter﹕ getBluetoothService() called with no BluetoothManagerCallback\n04-10 14:39:37.053  13156-13156/pt.lighthouselabs.obd.reader D/BluetoothSocket﹕ connect(), SocketState: INIT, mPfd: {ParcelFileDescriptor: FileDescriptor[56]}\n04-10 14:39:38.811  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Queing jobs for connection configuration..\n04-10 14:39:38.811  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[1] to queue..\n04-10 14:39:38.811  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 14:39:38.811  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Executing queue..\n04-10 14:39:38.811  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Taking job[1] from queue..\n04-10 14:39:38.811  13156-13156/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job state is NEW. Run it..\n04-10 14:40:30.733  13156-13161/pt.lighthouselabs.obd.reader I/dalvikvm﹕ threadid=3: reacting to signal 3\n04-10 14:40:30.772  13156-13161/pt.lighthouselabs.obd.reader I/dalvikvm﹕ Wrote stack traces to '/data/anr/traces.txt'\n3\nI select 'Start Live Data', the app doesn't crash, but i don't receive any live data. The queue is executed, but, for example, i always read \"RPM = -1\" . \nLOGCAT :\n04-10 16:45:00.332  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.activity.MainActivity﹕ Starting live data..\n04-10 16:45:00.332  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.activity.MainActivity﹕ Service is bound? true, and running? false\n04-10 16:45:00.332  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.activity.MainActivity﹕ Service is not running. Going to start it..\n04-10 16:45:00.332  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Starting service..\n04-10 16:45:00.340  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Stopping Bluetooth discovery.\n04-10 16:45:00.348  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Starting OBD connection..\n04-10 16:45:00.348  18239-18239/pt.lighthouselabs.obd.reader W/BluetoothAdapter﹕ getBluetoothService() called with no BluetoothManagerCallback\n04-10 16:45:00.348  18239-18239/pt.lighthouselabs.obd.reader D/BluetoothSocket﹕ connect(), SocketState: INIT, mPfd: {ParcelFileDescriptor: FileDescriptor[59]}\n04-10 16:45:01.747  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Queing jobs for connection configuration..\n04-10 16:45:01.747  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[2] to queue..\n04-10 16:45:01.747  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.747  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[3] to queue..\n04-10 16:45:01.747  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.747  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[4] to queue..\n04-10 16:45:01.747  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.754  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[5] to queue..\n04-10 16:45:01.754  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.754  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[6] to queue..\n04-10 16:45:01.754  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.754  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[7] to queue..\n04-10 16:45:01.754  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.754  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[8] to queue..\n04-10 16:45:01.762  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.762  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Initialization jobs queued.\n04-10 16:45:01.801  18239-18239/pt.lighthouselabs.obd.reader I/Choreographer﹕ Skipped 86 frames!  The application may be doing too much work on its main thread.\n04-10 16:45:01.801  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[1] to queue..\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[2] to queue..\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[3] to queue..\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[4] to queue..\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[5] to queue..\n04-10 16:45:01.809  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[6] to queue..\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[7] to queue..\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[8] to queue..\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[9] to queue..\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Adding job[10] to queue..\n04-10 16:45:02.028  18239-18239/pt.lighthouselabs.obd.reader D/pt.lighthouselabs.obd.reader.io.ObdGatewayService﹕ Job queued successfully.\nand so on....\nSide note: My hardware emulator works well with other applications (Torque), so i exclude any hardware defect.\n. ",
    "olimpotec": "Omarpoints, where did you buy this emulator? I have been the same problem in my emulator...\n. The name package was wrong\n. ",
    "aitoraznar": "omarpontis, have you try the blue one in a real car?\n. ",
    "cesarizu": "I have this same problem both with a software emulator and a real car. Depending on the commands I  get for example: java.lang.NumberFormatException: Invalid int: \"0xIR\"\n. I created a pull request that solves some of these issues by ignoring bus init messages and echo responses at https://github.com/pires/obd-java-api/pull/9\n. @pires Yes this solves the issue when a \"BUS INIT... OK\" or other messages appears before the actual response.\n. ",
    "lokesh1219": "Hi, I am getting live data is perfect but when i click on GET DTC it throwing OBD command failure and list Data null , whta is the solution of it.\n. is there any process to get dtc .\n. ",
    "kuburoma": "Same here.\n. ",
    "john-colgrave": "I tried it again this evening and it worked partly and occasionally.\nI am using a 2012 Google Nexus 7 running Android 4.4.2\nI cloned the repository on May 30th.\nI have selected the device in the app settings.\nWhen I selected Start Live Data this morning the status stayed at \nCONNECTING. When I first tried it this evening it connected.\nWhen I stopped the live data and then selected Get DTC I see the progress \nbar and then I get a pop-up saying \"Unfortunately, Android OBD-II Reader \nhas stopped.\"\nI can't remember whether I tried Start Live Data or Get DTC first this \nmorning, it looks like I must have tried Get DTC first.\nWhen I started the app again and selected Start Live Data again, it stuck \non CONNECTING. It is very difficult to read the display but I think it is:\nReset OBD: STOPPED\nEcho Off: DISC SU\nEcho Off: ?\nLine Feed Off: +CONNECTING<<60 A?\nTimeout: ?\n. ",
    "spapas": "@paulingit the ObdCommand class is included in https://github.com/pires/obd-java-api which is required library for android-odb-reader. There are also some more requirements which are listed in https://github.com/pires/android-obd-reader/blob/master/build.gradle. You should add these to your build path (eitherm manually or using maven) before trying to compile with eclipse.\n. @pires no it doesn't, the second time you press \"stop live data\" it will throw an exception.\nHowever I think that after this PR has been merged it'd be much easier to resolve such issues -- I'd be happy to do it.\n. @pires thanks for merging :)\nI think that this PR resolves #26 (since when no BT found it will use the MockObdGatewayService).\nI'll also take a look at #22.\n. Hello @karthickck. From what I can see from your stacktrace you are using the MockObdGatewayService and not the real one. This means that you hadn't been successfully connected to your OBD bluetooth device. Is this what you actually intented? The MockObdGatewayService is there mainly to allow developing without a real OBD device, thus it has not been thoroughly tested with every possible command.\n. If you want MockObdGatewayService to return diffent values then you can change the line that contains \"41 00 00 00\" in the executeQueue method of MockObdGatewayService (I am on vacation, using a mobile device thus cannot answer properly).\nIt would be great if extra functionality could be implemented onto MockObdGatewayService that would return valid values depending on the PID and not always 0.\n. No problem! I will verify it when I return from my vacation (after\nseptember 1st) however I can only test it with MockOdbGatewayService -- it\nis very difficult for me to test with actual OBD devices :(\nΣτις 21 Αυγ 2014 5:24 μ.μ., ο χρήστης \"KarthickCk\" notifications@github.com\nέγραψε:\n\nReally thanks for your immediate response,it would be great if you verify\nthe fuel type command in Obdgateway service.Once again thanks a lot.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/37#issuecomment-52926800\n.\n. Hello @KarthickCk ,\nI was able to take a look at the issue. It seems that the problem was with the included obd-java-api library (https://github.com/pires/obd-java-api). \n\nThe exception is thrown because the FuelType your vehicle returns is not included in the FuelType enumaration (https://github.com/spapas/obd-java-api/blob/master/src/main/java/pt/lighthouselabs/obd/enums/FuelType.java). I submitted a patch (https://github.com/pires/obd-java-api/pull/22) that checks for the NullPointerException and returns \"-\" instead of letting it propagate. However I believe that a better fix would be to find out why your vehicle returns a Fuel type that is not on the discussed list.\nIn any case, I don't know when my patch will be merged or when the patched version of obd-java-api will be included to the maven repository. If you want to use the patch, just get the patched version of obd-java-api and run mvn clean install. A .jar file will be created in the target directory. Copy the full path of that .jar file. After that, go to the build.gradle file of android-obd-reader and change line \ncompile 'pt.lighthouselabs.obd:obd-java-api:0.6'\nto\ncompile files('/Users/serafeim/progr/java/obd-java-api/target/obd-java-api-0.7-SNAPSHOT.jar')\nIt then should no longer throw the exception (but you will see a \"-\" for the fuel type).\n. Hello @garvgarg. The ObdCommand class (and various others) belong to obd-java-api (https://github.com/pires/obd-java-api) as you can see in the line compile 'pt.lighthouselabs.obd:obd-java-api:0.7' of the file build.gradle\n. ",
    "a7medshe7ata": "how i add this libs by maven\n. where can i download latest version and how can imported to eclipse , i don't have android studio\n. thanks i will download and try migrate to eclipse\n. i want to grab all required source code\n. ",
    "KarthickCk": "this issue if fixed or not? how can i test this library ?\n. the same error also occur through OBDgatewayservice,where FindFuelTypeObdCommand.getFormattedResult() returns always null.\nAny obd simulator for testing?\nHow to can i change the MockObdGateway values?It always returns 0 and same values.\n. Really thanks for your immediate response,it would be great if you verify the fuel type command in Obdgateway service.Once again thanks a lot.\n. Thanks...but our library always return trouble codes P0441,but Torque app does not\n. Our library work for all protocols?\n. ",
    "droweed": "I was referring to 'Pending Trouble Codes', is that included in that?\n. ",
    "v8ramair": "I tried researching more on DTC parsing with different possible protocols and found this: http://www.kbmsystems.net/files/Engine%20ECU%20Fault%20Code%20Reading%20with%20OBDKey.pdf\nHowever, I'm still fuzzy on ELM327 and possible outputs - does the ELM327 have anything to do with the DTC response?  If it does not, then proper DTC parsing will depend if it's a CAN, or ISO response.  If it's CAN, then the first byte (after the header-type 43/47 first byte) is for how many DTC there are.  For ISO, the DTC code bytes are sent right away, but in frames with checksums under some conditions.  I'm trying to create an algorithm on how to correctly parse, but if I'm understanding the documentation correctly, the current code definitely needs quite a bit of work.  We might even need to know the protocol if it will help make the algorithm cleaner.  Of course, I could be wrong if someone can guide me on how to properly fix.\n. ",
    "alonsodub": "Hi, I'm doing something very similar for a school project, is there any existing documentation of this project? maybe some kind of UML diagram\n. ",
    "fabcira": "done. uploaded changes\n. Hi Paulo,\nI have spent several hours on this now and I am baffled. It seems to be a problem on the low level communication with the OBD reader. I have even replaced my bluetooth obd reader to be sure that it was not a hardware issue. \nI have now run the app with as job just the speed command and put some trace printouts in the ObdCommand.java methods.  These should be self explanatory: I put trace printouts in the method readRawData before and after the trimming, one in the method fillBuffer, and one in perform calculations of the speed command, etc. I attach the java file. \nAs you will see at some point the results start being corrupted. I can see a \"NNECTED\" returned at some point (should that be CONNECTED?). At the end of the trace you can clearly see a speed of 49km/h. The car was static. \nI am really not familiar with this low level programming so I guess I cannot help. \nAny idea?\nthanks\nFabio\n09-10 18:25:17.269  30537-30537/pt.lighthouselabs.obd.reader D/OpenGLRenderer﹕ Enabling debug mode 0\n09-10 18:25:19.391  30537-30537/pt.lighthouselabs.obd.reader D/AbsListView﹕ Get MotionRecognitionManager\n09-10 18:25:19.722  30537-30537/pt.lighthouselabs.obd.reader D/AbsListView﹕ unregisterIRListener() is called\n09-10 18:25:19.792  30537-30537/pt.lighthouselabs.obd.reader D/AbsListView﹕ unregisterIRListener() is called\n09-10 18:25:19.792  30537-30537/pt.lighthouselabs.obd.reader D/AbsListView﹕ unregisterIRListener() is called\n09-10 18:25:19.852  30537-30537/pt.lighthouselabs.obd.reader D/AbsListView﹕ unregisterIRListener() is called\n09-10 18:25:23.525  30537-30537/pt.lighthouselabs.obd.reader D/AbsListView﹕ onDetachedFromWindow\n09-10 18:25:23.525  30537-30537/pt.lighthouselabs.obd.reader D/AbsListView﹕ unregisterIRListener() is called\n09-10 18:25:23.595  30537-30537/pt.lighthouselabs.obd.reader D/BluetoothUtils﹕ isSocketAllowedBySecurityPolicy start : device null\n09-10 18:25:23.595  30537-30537/pt.lighthouselabs.obd.reader W/BluetoothAdapter﹕ getBluetoothService() called with no BluetoothManagerCallback\n09-10 18:25:23.595  30537-30537/pt.lighthouselabs.obd.reader D/BluetoothSocket﹕ connect(), SocketState: INIT, mPfd: {ParcelFileDescriptor: FileDescriptor[59]}\n09-10 18:25:24.066  30537-30537/pt.lighthouselabs.obd.reader E/ViewRootImpl﹕ sendUserActionEvent() mView == null\n09-10 18:25:24.066  30537-30537/pt.lighthouselabs.obd.reader I/Choreographer﹕ Skipped 30 frames!  The application may be doing too much work on its main thread.\n09-10 18:25:24.266  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ +DISC:SUCCESS\n?\n?\n09-10 18:25:24.266  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ +DISC:SUCCESS\n?\n?\n09-10 18:25:24.266  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ ?\n09-10 18:25:24.496  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ IRABLE\n?\n09-10 18:25:24.506  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ IRABLE\n?\n09-10 18:25:24.506  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ ?\n09-10 18:25:24.736  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ +CONNECTING<<08:F?\n09-10 18:25:24.736  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ +CONNECTING<<08:F?\n09-10 18:25:24.736  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ +CONNECTING<<08:F?\n09-10 18:25:24.977  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ NNECTED\n?\n09-10 18:25:24.987  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ NNECTED\n?\n09-10 18:25:24.987  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ ?\n09-10 18:25:25.247  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ AT Z\nELM327 v1.5\n09-10 18:25:25.247  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ AT Z\nELM327 v1.5\n09-10 18:25:25.247  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ ELM327 v1.5\n09-10 18:25:25.607  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ AT ST 3e\nOK\n09-10 18:25:25.607  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ AT ST 3e\nOK\n09-10 18:25:25.607  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ OK\n09-10 18:25:25.827  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ AT SP 0\nOK\n09-10 18:25:25.827  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ AT SP 0\nOK\n09-10 18:25:25.827  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ OK\n09-10 18:25:25.837  30537-30964/pt.lighthouselabs.obd.reader D/FILL_BUFFER﹕ OK\n09-10 18:25:26.068  30537-30964/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ 01 46\nSEARCHING...\nSTOPPED\n09-10 18:25:26.068  30537-30964/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ 01 46\nSEARCHING...\nSTOPPED\n09-10 18:25:26.068  30537-30964/pt.lighthouselabs.obd.reader D/readRawData﹕ STOPPED\n09-10 18:25:26.088  30537-30537/pt.lighthouselabs.obd.reader D/getMetricSpeed﹕ metricSpeed:0\n09-10 18:25:26.088  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Vehicle Speed:0km/h\n09-10 18:25:26.098  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Line Feed Off:?\n09-10 18:25:26.128  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Reset OBD:?\n09-10 18:25:26.128  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Timeout:ELM327 v1.5\n09-10 18:25:26.138  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Select Protocol AUTO:OK\n09-10 18:25:26.138  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Ambient Air Temperature:0C\n09-10 18:25:26.148  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Echo Off:+CONNECTING<<08:F?\n09-10 18:25:27.559  30537-30985/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ 1 0D\n7F 10 31\n09-10 18:25:27.559  30537-30985/pt.lighthouselabs.obd.reader D/readRawData after trim﹕ 1 0D\n7F 10 31\n09-10 18:25:27.559  30537-30985/pt.lighthouselabs.obd.reader D/readRawData﹕ 7F 10 31\n09-10 18:25:27.589  30537-30985/pt.lighthouselabs.obd.reader D/FILL_BUFFER﹕ 7F1031\n09-10 18:25:27.599  30537-30985/pt.lighthouselabs.obd.reader D/performCalculations﹕ Buffer:[127, 16, 49]\n09-10 18:25:27.599  30537-30985/pt.lighthouselabs.obd.reader D/performCalculations﹕ MetricSpeed:49\n09-10 18:25:27.599  30537-30537/pt.lighthouselabs.obd.reader D/getMetricSpeed﹕ metricSpeed:49\n09-10 18:25:27.599  30537-30537/pt.lighthouselabs.obd.reader D/ATG﹕ Vehicle Speed:49km/h\n09-10 18:25:29.534  30537-31141/pt.lighthouselabs.obd.reader D/readRawData before trim﹕ 01 0D\n. One additional piece of information. The version I had downloaded before the summer did not have this issue. Is it possible that some changes have been inserted during the summer that influence this? I cannot find any relevant changes in the history but you never know. \n. One last note on this. I spent another couple of hours on this and I have found out (probably not surprisingly) that this happens when the reset command (and the rest of the initialisation) is either not sent by the app or received by the OBD Bluetooth reader. In this case the results are random. \nI could not identify why this happens: if it is just chance or if it is a structural problem. In any case it needs some fix (e.g. by double checking that if the init does not work it is repeated. \nI am reporting this in case anyone else has time to look into this, as I am unlikely to be able to do anything over the next several weeks. \n. I will try. Not sure however that is the cause. \nI have actually halved the sleep time in the old version (the one that does not present the issue) and driven for over 200 miles yesterday it worked just fine. \nI agree on being a big pain.\n. Yes I have done some further investigation and found something. I have realised (quite by chance) that there is one specific moment when you get the random results: when you turn off the engine and turn off the power but do not remove the key, the OBD dongle sends random values. I am unsure of why although I have an intuition that this is related to an imperfect switching off of the power (some functions are still active when the key is in, e.g the lights are kept on). \nAnyway I did an extensive test when I visited a friend. We drove for about 200km and I regularly tested the speed and rpm against the ones shown on the dashboard. They were all right. However when we stopped for petrol and my friend went to pay, I started getting random values. Speed went to 100km/h, rpm to 4000, etc.\nI hope it helps\n. apologies that was a change I did for a test and I left it by mistake]Of course I do not wnt anyone to upload their data to my server!\nf\nProf Fabio Ciravegna, \nProfessor of Language and Knowledge Technologies, \nDepartment of Computer Science, The University of Sheffield,\nRegent Court, 211 Portobello, S1 4DP, Sheffield, UK\nTel: +44(0)1142221940, Fax: +44(0)1142221810\nwww: http://staffwww.dcs.shef.ac.uk/People/F.Ciravegna/ \n\nOn 16 Dec 2014, at 17:47, nomwerp notifications@github.com wrote:\nIn src/main/res/xml/preferences.xml https://github.com/pires/android-obd-reader/pull/38#discussion-diff-21916743:\n\n@@ -11,19 +11,20 @@\n       android:summaryOff=\"Disable http data upload\"\n       android:summaryOn=\"Enable http data upload\"\n       android:dialogTitle=\"Enable Data Upload\"\n-      android:enabled=\"false\"/>\n-      android:enabled=\"true\"/>\n  ...especially not to someone else's server (http://wesenseit-vm1.shef.ac.uk ;)\n\n—\nReply to this email directly or view it on GitHub https://github.com/pires/android-obd-reader/pull/38/files#r21916743.\n. Hi Paulo, the Readme was intended to be for you to consider before considering the changes, It was not supposed to be replacing yours. This is a strategy we use in our group: the changes to the readme are always rejected and are used by the integrator. I appreciate this is not standard way of doing though\n. volunteered one in case of interest\n. as said this is an error\n. ok\n. apologies this has been done automatically by Intellij. I had not realised it was different from the original. I asked the IDE to reindent the code after some changes\n. as before I fear this must be an automatic change by the IDE \n. \n",
    "ghost": "Yeah, I think I will try\n. ",
    "mateenc": "I'm sorry, I had altered something in the code and it caused an error, everything works fine now.\n. ",
    "Hesamedin": "Suer. My Pleaser. Will send you tomorrow. I didn't know there is another lib like this :)\n. ",
    "michalciolek": "@Hesamedin when you removed Robojuice you must init SharedPreferences and SharedPreferences in AbstractGatewayService.\n. ",
    "simbu88": "I Need ODB-II communicate over wifi .if any code give help to me . ",
    "jeepingben": "Live data gives correct results on both vehicles.  RPM and coolant temperature are believable. No values had garbage.\n. Does it make sense to migrate the trouble-codes activity to the same more async looking command processor that live-data uses?  It's been a few days since I looked in the code, but I don't remember a reason that it wouldn't work.  If you think it makes sense, I could take a look at it (no promise it will be done in a timely manner)\n. ",
    "elagin": "ping @pires :)\n. Glad to help\n. The idea was to store the state of bluetooth before running the application and return it after the call stopLiveData ()\nIt is necessary to check whether the fast and reliable work if turn on BT device and immediately start reading data.\n. I try call btAdapter.enable() info startLiveData(). Data acquisition process starts after recall startLiveData() into menu.\nPossibly some function invoked asynchronously when the connection has not yet occurred .\n. In MainActivity.onCreate call BluetoothAdapter.isEnabled() and store result info variable.\nThen, for example in MainActivityonDestroy(), if ConfigActivity.ENABLE_BT_KEY && !variable call call BluetoothAdapter.Disable()\nIn the setting of only one item \"Enable Bluetooth\"\n. If turn on bluetooth after start live data on my device i have trouble.\nThis is probably due to the fact that the connections necessary for some time, and this algorithm code which would have a connection in the event of repeated failure. Of course it makes sense to on bluetooth for use only (between start and stop).\n. Good idea. I would also add the ability to save the data on the sd card (if the user is allowed in the settings.)\n. Yes recently been added. Now try to fix.\n. Ready  #73\n. I think I need to apply this request, and only then to discuss how to use it in conjunction with sending data.\n. Yes, of course.\n. Merge, please.\n. Today I will try to do.\n. ",
    "FunThomas76": "i could not believe that you could fix it that fast ;-) \ni have to rebuild today evening and will report you then\n. working as expected :)\nafter closing the app my bluetooth stays enabled like always\nThanx\n. ",
    "fernando-costa": "i believe that you can expand compatibility using Android Support Library\nhttp://developer.android.com/tools/support-library/index.html\n. ",
    "anti43": "Ok thanks I'll analyze the junk data..\n. ok I did a fork and will do pull requests when i found the issue!\n2015-05-15 22:20 GMT+02:00 Paulo Pires notifications@github.com:\n\nI'm open to improvements on the https://github.com/pires/obd-java-api\nproject.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/85#issuecomment-102516412\n.\n. Ok,\n\nI did some debugging now with my car and an obd terminal..\nit seems there is the sequence +CONNECTING<NNECTED ? at the beginning of the communication .. some sort of initializing message. plus the searching.. message is on front of any command response, not only on error codes..\nI had the same issue before with some usb serial board - I had to read the init from the output once before using the output for responses, otherwise the first command will get the init message as part of the response. Do you think thats a possibility here?\n. Ok,\nre-issuing the reset command as you do with the second echo command does solve the issue so nothing to change in the obd-api part.\n- but then mostly i get some \"unable to connect\". I wonder how torque manages to do this as there it  is working like always:) \n. yes you are absolutely right. possibly issuing a reset every 4 seconds is killing the elm :)\n. Well, yes and no. Just ignoring it and running a dummy command and ignoring the outcome as very first thing makes any troubles go away. \n. @nomwerp yes with this fix it works properly for me. one way to screw it is if the obd device is sending headers, which you can turn off issuing a command AT H0 which is not yet implemented in RC5. Had this issue yesterday.\n. when you connect via obd terminal, what is the raw response?\n2015-07-22 8:04 GMT+02:00 Pho3niX90 notifications@github.com:\n\nYes I am using the correct version. This is working on the one car but not\nthe other.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/119#issuecomment-123572504\n.\n. obd terminal from play store\n\n2015-07-22 8:32 GMT+02:00 Pho3niX90 notifications@github.com:\n\nI haven't tested. Which obd terminal do you suggest\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/119#issuecomment-123576930\n.\n. see https://github.com/pires/obd-java-api/issues/54\n. yes there is a solution, see the referenced issue. the presented solution is not ideal as discussed, but if it works for you it might be ok\n. then go ahead and use it\n\n```\n StringBuilder b = new StringBuilder();\nfor (int i = 2; i < buffer.size(); i++) {\n      b.append(new Character((char) buffer.get(i).intValue()).toString());\n  }\nString vin = b.toString().replaceAll(\"[\\u0000-\\u001f]\", \"\");\n```\nSee a complete solution here (parses those \":\" separated vins and the other multiline one):\nhttps://github.com/anti43/obd-java-api/blob/master/src/main/java/com/github/pires/obd/commands/control/VinObdCommand.java\nfor this to work properly the ObdCommand class needs changes aswell:\nhttps://github.com/anti43/obd-java-api/blob/master/src/main/java/com/github/pires/obd/commands/ObdCommand.java#L165\nas opposed to the solution in https://github.com/pires/obd-java-api/issues/54 this utilizes regex replace to avoid Indexoutofbounds and Nullpointer exceptions\n. can you post the complete raw response\n. ",
    "vivek40": "Thank you. It got it working !!! \nJust one more question, at what frequency you are polling the PID? where can i find it? I tried changing the variable periodString in ConfigActivity.java, but there is no much difference. It still takes 2 to 3 sec for 4 PIDs (rest of the PIDs i have commented from ObdConfig.java)\n. ",
    "oneal": "05-21 00:12:34.363    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ pt.lighthouselabs.obd.exceptions.UnableToConnectException: Error running 03, response: SEARCHING...\nUNABLETOCONNECT\n05-21 00:12:34.364    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at java.lang.Class.newInstanceImpl(Native Method)\n05-21 00:12:34.364    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at java.lang.Class.newInstance(Class.java:1319)\n05-21 00:12:34.367    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at pt.lighthouselabs.obd.commands.ObdCommand.checkForErrors(ObdCommand.java:211)\n05-21 00:12:34.367    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at pt.lighthouselabs.obd.commands.ObdCommand.readResult(ObdCommand.java:140)\n05-21 00:12:34.367    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at pt.lighthouselabs.obd.commands.ObdCommand.run(ObdCommand.java:87)\n05-21 00:12:34.367    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at pt.lighthouselabs.obd.obd2.TroubleCodes$GetTroubleCodesTask.doInBackground(TroubleCodes.java:210)\n05-21 00:12:34.368    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at pt.lighthouselabs.obd.obd2.TroubleCodes$GetTroubleCodesTask.doInBackground(TroubleCodes.java:132)\n05-21 00:12:34.368    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at android.os.AsyncTask$2.call(AsyncTask.java:287)\n05-21 00:12:34.368    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at java.util.concurrent.FutureTask.run(FutureTask.java:234)\n05-21 00:12:34.369    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at android.os.AsyncTask$SerialExecutor$1.run(AsyncTask.java:230)\n05-21 00:12:34.370    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1080)\n05-21 00:12:34.370    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:573)\n05-21 00:12:34.371    6079-7238/pt.lighthouselabs.obd.obd2 W/System.err﹕ at java.lang.Thread.run(Thread.java:838)\n. ELM321 is connected, this occure in your application android-obd-rearder too.\n. ah!!! okay thanks!! should i change ELM 327 by other??\n. he said me no data when i try to engine running\n. sorry, it's send me a lot of informar ion with engine running\n. ",
    "amouly": "@pires then I found a lot of strings all over the app which are not on the Strings.xml file. You are planning to extract them on the future?\n. @pires yes, I can take care of some of those strings. I mean, I like the app and i'm digging on how it works, so at the same time I can fix that ;).\n. @nomwerp yes, I added a lot more Strings, but I have that issue with indentation, because I made some changes and can't merge directly. Maybe I can discard my changes on indentation and just pull the Strings.\n. I think is mostly done. Right @nomwerp?\nOn Jun 15, 2015 08:44, \"Paulo Pires\" notifications@github.com wrote:\n\n@nomwerp https://github.com/nomwerp @amouly https://github.com/amouly\ncan you update me on this, please?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/90#issuecomment-112030604\n.\n. I can't understand why there is different types of indentation all over the app. I mean, on Layouts the indentation it's different from the Java code.\n. @pires Thanks for your feedback. Anyway, just asking, why are you using 2 spaces for indent? The common thing on android it's using 4 spaces for indentation. This is on the Android Developer Guidelines too:\n\nUse Spaces for Indentation\n- We use 4 space indents for blocks. We never use tabs. When in doubt, be consistent with code around you.\nhttps://source.android.com/source/code-style.html#use-spaces-for-indentation\n. That's a shame :(. Well, i'm going to do my changes on my fork, but following the Android guidelines. Then you can extract just the strings. Thanks for this project!\n. @pires yes, it's understandable. Anyway, this thing about format can be easily done with Android Studio. You have and option there: Code -> Reformat code... That option organize the code based on the default config for Android, and make a log with the changes.\n. @pires awesome! Well, I made some reformatting on my fork, if you want you can compare it here to see the changes. I'm not creating the PR because there is a lot of lines changed (but not deleted code). I added most of the Dialog strings to the \"strings.xml\", we can merge that later.\nI agreed with @nomwerp, having the code based on the guidelines would make easier to read, and maybe makes more people feel comfortable to contribute ;).\n. No, Android Stusio only have the Gradle Plugin, but not Gradle itself. I\nhaven't got it installed, I just have AS and it creates the wrapper for\neach project. It's a common issue when you import a project, not having\nGradle or the Wrapper and nothing works :P.\nOn Jun 7, 2015 17:45, \"Paulo Pires\" notifications@github.com wrote:\n\nI've never had any issues importing this project into Android Studio.\nActually, Gradle Wrapper used to exist for people that didn't have Gradle\ninstalled which I don't believe is true when you install said IDE.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/96#issuecomment-109798469\n.\n. No, AS just created it when you start the project from 0, but not when you\nimport it. When so, AS ask where the wrapper is, or where Gradle is, but if\nyou haven't got anyone, you can't run the project. The solution is copy the\nwrapper from another project and paste it on the current project.\nOn Jun 7, 2015 17:49, \"Paulo Pires\" notifications@github.com wrote:\nSo if Android Studio creates the wrapper, what's the issue then?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/96#issuecomment-109798690\n.\n. Yeah sure. Maybe if you commit and push the wrapper it just works. If you\nwant to add it to another branch, I can test importing the project from 0.\nThanks.\nOn Jun 7, 2015 17:55, \"Paulo Pires\" notifications@github.com wrote:\nHmmm, current Android Studio complains about not having Gradle indeed. I\nwonder if they removed the bundled version... anyway one of the\nprerequisites in the doc is Gradle 2.2.1. Will mark this as an\nimprovement rather than a bug and will take care of it ASAP. Thank you for\nreporting.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/96#issuecomment-109798970\n.\n. @pires the wrapper is working just fine. But i'm getting an error when executing the app (compiling and running on real device). The stack is the following:\n\n06-08 20:54:19.948    1633-1633/? E/AndroidRuntime﹕ FATAL EXCEPTION: main\n    Process: com.github.pires.obd.reader, PID: 1633\n    java.lang.RuntimeException: Unable to start activity ComponentInfo{com.github.pires.obd.reader/com.github.pires.obd.reader.activity.MainActivity}: java.lang.IllegalStateException: Unable to use annotation database(s)\n            at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2325)\n            at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2387)\n            at android.app.ActivityThread.access$800(ActivityThread.java:151)\n            at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1303)\n            at android.os.Handler.dispatchMessage(Handler.java:102)\n            at android.os.Looper.loop(Looper.java:135)\n            at android.app.ActivityThread.main(ActivityThread.java:5254)\n            at java.lang.reflect.Method.invoke(Native Method)\n            at java.lang.reflect.Method.invoke(Method.java:372)\n            at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:903)\n            at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:698)\n     Caused by: java.lang.IllegalStateException: Unable to use annotation database(s)\n            at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:292)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90)\n            at roboguice.RoboGuice.getInjector(RoboGuice.java:197)\n            at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90)\n            at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305)\n            at android.app.Activity.performCreate(Activity.java:5990)\n            at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1106)\n            at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2278)\n            at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2387)\n            at android.app.ActivityThread.access$800(ActivityThread.java:151)\n            at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1303)\n            at android.os.Handler.dispatchMessage(Handler.java:102)\n            at android.os.Looper.loop(Looper.java:135)\n            at android.app.ActivityThread.main(ActivityThread.java:5254)\n            at java.lang.reflect.Method.invoke(Native Method)\n            at java.lang.reflect.Method.invoke(Method.java:372)\n            at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:903)\n            at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:698)\n     Caused by: java.lang.RuntimeException: java.lang.ClassNotFoundException: AnnotationDatabaseImpl\n            at com.google.inject.AnnotationDatabaseFinder.(AnnotationDatabaseFinder.java:47)\n            at com.google.inject.Guice.setAnnotationDatabasePackageNames(Guice.java:133)\n            at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:288)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90)\n            at roboguice.RoboGuice.getInjector(RoboGuice.java:197)\n            at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90)\n            at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305)\n            at android.app.Activity.performCreate(Activity.java:5990)\n            at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1106)\n            at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2278)\n            at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2387)\n            at android.app.ActivityThread.access$800(ActivityThread.java:151)\n            at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1303)\n            at android.os.Handler.dispatchMessage(Handler.java:102)\n            at android.os.Looper.loop(Looper.java:135)\n            at android.app.ActivityThread.main(ActivityThread.java:5254)\n            at java.lang.reflect.Method.invoke(Native Method)\n            at java.lang.reflect.Method.invoke(Method.java:372)\n            at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:903)\n            at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:698)\n     Caused by: java.lang.ClassNotFoundException: AnnotationDatabaseImpl\n            at java.lang.Class.classForName(Native Method)\n            at java.lang.Class.forName(Class.java:309)\n            at java.lang.Class.forName(Class.java:273)\n            at com.google.inject.AnnotationDatabaseFinder.getAnnotationDatabaseInstance(AnnotationDatabaseFinder.java:73)\n            at com.google.inject.AnnotationDatabaseFinder.(AnnotationDatabaseFinder.java:36)\n            at com.google.inject.Guice.setAnnotationDatabasePackageNames(Guice.java:133)\n            at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:288)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90)\n            at roboguice.RoboGuice.getInjector(RoboGuice.java:197)\n            at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90)\n            at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305)\n            at android.app.Activity.performCreate(Activity.java:5990)\n            at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1106)\n            at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2278)\n            at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2387)\n            at android.app.ActivityThread.access$800(ActivityThread.java:151)\n            at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1303)\n            at android.os.Handler.dispatchMessage(Handler.java:102)\n            at android.os.Looper.loop(Looper.java:135)\n            at android.app.ActivityThread.main(ActivityThread.java:5254)\n            at java.lang.reflect.Method.invoke(Native Method)\n            at java.lang.reflect.Method.invoke(Method.java:372)\n            at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:903)\n            at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:698)\n     Caused by: java.lang.ClassNotFoundException: Didn't find class \"AnnotationDatabaseImpl\" on path: DexPathList[[zip file \"/data/app/com.github.pires.obd.reader-1/base.apk\"],nativeLibraryDirectories=[/vendor/lib, /system/lib]]\n            at dalvik.system.BaseDexClassLoader.findClass(BaseDexClassLoader.java:56)\n            at java.lang.ClassLoader.loadClass(ClassLoader.java:511)\n            at java.lang.ClassLoader.loadClass(ClassLoader.java:469)\n            at java.lang.Class.classForName(Native Method)\n            at java.lang.Class.forName(Class.java:309)\n            at java.lang.Class.forName(Class.java:273)\n            at com.google.inject.AnnotationDatabaseFinder.getAnnotationDatabaseInstance(AnnotationDatabaseFinder.java:73)\n            at com.google.inject.AnnotationDatabaseFinder.(AnnotationDatabaseFinder.java:36)\n            at com.google.inject.Guice.setAnnotationDatabasePackageNames(Guice.java:133)\n            at roboguice.RoboGuice.initializeAnnotationDatabaseFinderAndHierarchyTraversalFilterFactory(RoboGuice.java:288)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:149)\n            at roboguice.RoboGuice.getOrCreateBaseApplicationInjector(RoboGuice.java:90)\n            at roboguice.RoboGuice.getInjector(RoboGuice.java:197)\n            at roboguice.activity.RoboActivity.onCreate(RoboActivity.java:90)\n            at com.github.pires.obd.reader.activity.MainActivity.onCreate(MainActivity.java:305)\n            at android.app.Activity.performCreate(Activity.java:5990)\n            at android.app.Instrumentation.callActivityOnCreate(Instrumentation.java:1106)\n            at android.app.ActivityThread.performLaunchActivity(ActivityThread.java:2278)\n            at android.app.ActivityThread.handleLaunchActivity(ActivityThread.java:2387)\n            at android.app.ActivityThread.access$800(ActivityThread.java:151)\n            at android.app.ActivityThread$H.handleMessage(ActivityThread.java:1303)\n            at android.os.Handler.dispatchMessage(Handler.java:102)\n            at android.os.Looper.loop(Looper.java:135)\n            at android.app.ActivityThread.main(ActivityThread.java:5254)\n            at java.lang.reflect.Method.invoke(Native Method)\n            at java.lang.reflect.Method.invoke(Method.java:372)\n            at com.android.internal.os.ZygoteInit$MethodAndArgsCaller.run(ZygoteInit.java:903)\n            at com.android.internal.os.ZygoteInit.main(ZygoteInit.java:698)\n    Suppressed: java.lang.ClassNotFoundException: AnnotationDatabaseImpl\n            at java.lang.Class.classForName(Native Method)\n            at java.lang.BootClassLoader.findClass(ClassLoader.java:781)\n            at java.lang.BootClassLoader.loadClass(ClassLoader.java:841)\n            at java.lang.ClassLoader.loadClass(ClassLoader.java:504)\n            ... 26 more\n     Caused by: java.lang.NoClassDefFoundError: Class not found using the boot class loader; no stack available\n. @pires I don't think that this issue it's related to the wrapper, if anyone else have the same issue maybe we can open a new one for this.\n. @pires this is fixed.\n. @pires yes, now it's working. Just FYI, on the build.gradle file, we have \"proguard-rules.pro\", but the file is named \"proguard-android.txt\" on the local path. You have to rename it. The system-default file it's \"proguard-android.txt\" (called with getDefaultProguardFile)  and that's ok.\n. Yes, it works fine for me. And yes, the Proguard system changed a little on Studio. Thanks.\n. @nomwerp ProGuard problem again maybe?\n. @nomwerp wow!! Nice feature. The only thing I see, is the overlapping of text in some of the rows. Maybe increasing the height of elements will help?\n. @nomwerp you can active the \"view layout bounds\" on your device's Developer Tools, for debugging how the rows are rendering exactly.\n. @Pho3niX90 I'm requesting the change to 4 spaces indentation a long time ago :P.\n. Awesome, waiting the PR...\n. +1 for Dagger.\n. ",
    "brianharms": "That. I'm wondering if there is a max polling rate set by the modules themselves (I have a Bluetooth elm27 module) or if there is some overhead in the app I can trim out to get faster polling rates. If the latter is the case, any suggestions are welcome. \nBest,\nbrian\n. Excellent, thanks for the response, nomwerp.\nShould I then download the zipped obd-java-api project, add it as a library to the obd reader app (while removing the existing external dependency, whose files are locked) and edit it there? \nBest,\nbrian\n. Thanks for the quick response!\n. ",
    "seanhold3n": "Will do!\n. Fixed as of pull #95.  Thank you! :)\n. Looks good; thank you!\n. Thank you!\n. What responsiveness would removing Roboguice add?  As I understand it, it's only used during initialization for creating the UI elements.\n. Oops, went the wrong direction.. ",
    "MaxBenChrist": "yes, i already implemented it.\nI will send a pr the next days. I implemented several new features. :) At the moment I am testing my branch and wait for the other pr to resolve so I can merge them into my branch.\n. Yes, the settings are working! So a) is solved. My mistake. \nI am not sure how to implement b).\nMaybe we should close this issue? \n. @pires : yes!\n. You tried to restart the app? I mean by closing it the app settings in the general android menu?\nI observed a similar behavior when I stopped the engine during a trip and the bt connection to the doongle was lost. The application was not able to connect again and when I started a new trip (even with a stationary car) it read 80 km/h and 167 rpm all the time.\nFor me killing the application in the menu and starting it again helped. \n. Yeah, I was thinking the same. You got any idea how to fix that properly? Maybe the trip should be finished if for a certain number of readings no values were observed?\n. Thanks for the notification!\nI implemented a multi entity post in my branch. If somebody is interested, here is the snippet:\n``` java\nHttpClient client = new DefaultHttpClient();\n        // TODO: option einführen\n        HttpPost post = new HttpPost( );\n    MultipartEntityBuilder builder = MultipartEntityBuilder.create();\n\n    builder.setMode(HttpMultipartMode.BROWSER_COMPATIBLE);\n    builder.addPart(\"logfile\", new FileBody(file));\n    builder.addTextBody(\"filename\", file.getName());\n\n    try {\n        post.setEntity(builder.build());\n        HttpResponse response = client.execute(post);\n        Log.d(TAG, EntityUtils.toString(response.getEntity()));\n\n        if (response.getStatusLine().getStatusCode() == 201) {\n\n            file.delete();\n            Log.d(TAG, \"Deleted file\" + file.getName());\n\n            return true;\n        } else {\n            return false;\n        }\n\n    } catch (ClientProtocolException e) {\n        Log.e(TAG, e.toString());\n        return false;\n\n    } catch (IOException e) {\n        Log.e(TAG, e.toString());\n        return false;\n    }\n\n```\n. ",
    "valens254": "@mvglasow I can't understand, what you get when trying read DTC\n. Yes, the old release can read all except DTC and VIN code, because not all protocols was implemented yet.\n. I will look and check.\n. @Kolyall I look and it seems like one frame with two DTC. But it message length must be 12 however into log \"W/System.err: java.lang.StringIndexOutOfBoundsException: length=11;\" 11. It is strange. May you check getResult() method?\n. ",
    "carpiko1010": "I am using this php code on my server, but there is no entries in the mysql table, the tables are created but no data is getting entered into it from the obd app.. ",
    "sytolk": "I have the same issue with my toyota corolla verso\n\nresults is the same if car is moving or not. I have try to restart application restart Android phone but without success.\n. 09-09 16:43:20.520 E/com.github.pires.obd.reader.io.ObdGatewayService( 3354): Failed to run command. -> Error running 09 02, response: 0902NODATA\n09-09 16:44:48.769 E/com.github.pires.obd.reader.io.ObdGatewayService( 5993): Failed to run command. -> Error reading response: ATSP0OK\n09-09 16:44:48.974 E/com.github.pires.obd.reader.io.ObdGatewayService( 5993): Failed to run command. -> Error running 01 44, response: 0146...STOPPED\n. I have update obd-api lib to version 10. And test this issue with cheap but working with other obd app bluetooth hardware. The only changes are speed from 20km/h to 65 km/h but the real speed =0km/h\nIts have trouble code true but the code is different..\n\n. I will try this. Thanks @Pho3niX90 But why these commands are not executed from obd-reader app?\nhttps://www.scantool.net/support/index.php?_m=knowledgebase&_a=viewarticle&kbarticleid=32\nATE0 - Turn echo off. Characters sent to ElmScan are not retransmitted back to the host computer.\nATE1 - Turn echo on. This is the default state, characters are echoed back to the host computer.\nATH0 - Turn headers off. This is the default state, header information and CRC byte are omitted.\nATH1 - Turn headers on. Header information and CRC byte are displayed.\nATZ - Causes the chip to reset itself, as if the power was cycled off and then on again.\n. Folders in the res are only allowed to be those defined by Android. See \nhttp://developer.android.com/guide/topics/resources/available-resources.html\nIf you choose anything else you get the error \"invalid resource directory name\" when building your project.\n. I have see that obd-java-api project have pom.xml file. So many projects have two build systems gradle and maven for Android. You can add pom.xml file to the project and use only gradle to build it. Maven pom.xml file can be updated from maven users like me :) I know that gradle is googles choose for Android build system but simple I not like it..\n. ACRA support sending report by email too \nhttps://github.com/ACRA/acra/wiki/AdvancedUsage#sending-reports-by-email\nYou can put this preference in settings. But the main advantage that https://github.com/pires/android-obd-reader/pull/138 have its that its not need to have Email account (or SMTP) on Android device or Emulator. This is debugging feature (its only for the programmers and @pires can I know what is not ready for you ?) if you not like to debug application with my solution feels free to close PR and write new ACRA project for example ;)\n. @pires you can think about debugging plugins for every kind of developer ;)\n. Fix is for Linux platform too :+1: Thanks!\n. Ok I`m waiting for obd-java-api 1.0-RC9-RELEASE :)\nDo you have success with official gradle build ?\ndependencies {\n    compile 'com.github.pires:obd-java-api:1.0-RC8'\n}\nhttps://github.com/pires/android-obd-reader/pull/133 this pull changes obd-java-api version from 1.0-RC6 to 1.0.-RC8 (its have changes in class names) maven build will break. Can I have build log with the current build.gradle project file ?\n. ok thanks\n. I have changed this pull request - maven and gradle build with 1.0-RC9 version. Maven build success you can test gradle.\n. The main problem.. its appears that openshift will not send emails. https://forums.openshift.com/php-53-of-openshift-they-support-the-mail-functions\nIts need to have in acra.php one hardcoded google acount (user/pass) and use googles SMTP to send emails.. I not like this solution\nI prefer to use mailgun SMTP\nhttp://stackoverflow.com/questions/23064765/cant-send-email-through-openshift\n. I have tested report sending and it works. I have use mu mailgun key to send emails. I have publish my PHP part too https://github.com/d-a-n/acra-mailer/pull/3\n. I think that this is ready for merge now. \nTODO: SHARED_SECRET is hardcoded it can be received on saved in shared preferences email and with this will have email validation too. But it works and debugging with ACRA is more important for me now.\n. Ok :) \n. @pires I have write TODO for the SHARED_SECRET. You can merge it now (debugging works) and to open new issue with this.. actually SHARED_SECRET is for the security but not for the obd-reader application this is for the security of the php mailer. But this can be done later. I`m too lazy to finish it now ;)\n. @pires you are right.. you are lazy too :) maybe I will do this but my working priorities are different now and I really want to see this PR https://github.com/pires/android-obd-reader/pull/144 finished. good luck @Pho3niX90 :+1: \n. MainActivity.java\nLine:159  sb.append(String.valueOf(mLastLocation.getAltitude()).substring(0, posLen));\nposLen=7\nremove this substing() for the Altitude will fix this\nand StringBuffer sb = new StringBuffer(); can be replaced with StringBuilder sb = new StringBuilder(); for better performance I dont think that here its need synchronization\njava\nStringBuilder sb = new StringBuilder();\n                    sb.append(\"Lat: \");\n                    sb.append(String.valueOf(mLastLocation.getLatitude()).substring(0, posLen));\n                    sb.append(\" Lon: \");\n                    sb.append(String.valueOf(mLastLocation.getLongitude()).substring(0, posLen));\n                    sb.append(\" Alt: \");\n                    sb.append(String.valueOf(mLastLocation.getAltitude()));\n                    gpsStatusTextView.setText(sb.toString());\n. Ok but my previous PR  is not merged yet https://github.com/pires/android-obd-reader/pull/138 and these changes will be added to it ;)\n. no comment :)\nif this log is enough for you.. happy debugging :+1:\nbut I want to receive on my email some more crash information and to save my debugging time Im so lazy ;)\n. \"complete logcat\" - I dont want it (I want logcat filtered by application PID)\nI think that this email is exactly what you need to debug some application:\nhttps://github.com/d-a-n/acra-mailer#sample-e-mail-error-report\nWhere is your stack trace of crash? Can I send logcat without crash? ...\n. @Pho3niX90 I`m open source programmer. If its have open source library for debugging (like ACRA) I will use it. If its have somethings wrong with this library I will make a PR but to start writing code from the  beginning.. this is not my style :)\n. @Pho3niX90 think about this and maybe you will understand ;)\n. :+1: \n. @pires @Pho3niX90 do its have command implemented in obd-reader that can return vehicle KM traveled? Its will be good to match it with the GPS distance.\n. @Pho3niX90 I have KM on the display of my car :) and I suppose that its have some pid to get this KM. If its have this KM (of production without reset) a car travels from point A to point B = km B - km A\n. @Pho3niX90 this is good idea. @kaorijp can you check distance calculated from speed like: List speedChanges = [30,10,30,25,5];\nif(curr_speed != previous_speed) //add to array\nint avgSpeed = 100/5=20 km/h\ndistance (km)= 20 x time(h)\n. Its wrong :) its need to have timestamp attached to the HashMap speed => timestamp\n. Maybe some mix if pid 31 and 21 supported by vehicle use it. If not it will be good to have distance based on speed changes or to enable both methods +GPS and match the results. Who can provide PR ? :)\n. SHARED_SECRET must be the same like in acra.php I think that its better after user save his email (encrypted in Android shared preferences) it will receive email message with SHARED_SECRET.\nMy idea was to use only one acra.php script hosted on openshift and user email can be configurable. OBD-Reader application will have email=null if(email != null && SHARED_SECRET!=null) ACRA logging will be enabled.\n. ",
    "matthiasblaesing": "Thank you!\n. ",
    "M-Ahmad-sattar": "Sir this link is not working now can u please refer some other i need this php trigger code.. sir is still any referral information regarding this point?. ",
    "isgarsi": "I don't think so, because It can connect with other apps like torque. I'm going to try with your app android-obd-reader and will tell you the result.\nThanks\n. It didn't run with android-obd-reader app, but it runs in all other smartphones so I won't waste more time with that.\nThanks.\n. ",
    "fscodesimone": "Compile problem in MainActivity.stopLiveData i've compile problem dialogClickListener is not visible when used out of the if statement.\n. ",
    "roalts": "fixed, sorry for the delay\n. Yeah that just skipped my mind, I ll make the necessary changes.\nOn 26-Dec-2015 4:43 pm, \"Paulo Pires\" notifications@github.com wrote:\n\nIn src/main/java/com/github/pires/obd/reader/activity/MainActivity.java\nhttps://github.com/pires/android-obd-reader/pull/162#discussion_r48446613\n:\n\n@@ -659,6 +664,18 @@ public void onGpsStatusChanged(int event) {\n         }\n     }\n-    @Override\n-    protected void onActivityResult(int requestCode, int resultCode, Intent data) {\n-        if (requestCode == REQUEST_ENABLE_BT) {\n-            if (resultCode == Activity.RESULT_OK) {\n-                btStatusTextView.setText(getString(R.string.status_bluetooth_connected));\n-            } else {\n-                Toast.makeText(this, \"Bluetooth not enabled\", Toast.LENGTH_LONG).show();\n\nWhy not reuse getString(R.string.text_bluetooth_disabled)?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pires/android-obd-reader/pull/162/files#r48446613.\n. \n",
    "Kolyall": "The same issue for this PIDs:\nPid:01 5E : ConsumptionRateCommand.class\nPid:01 34 : WidebandAirFuelRatioCommand.class\nPid:01 23 : FuelRailPressureCommand.class\nPid:01 21 : DistanceMILOnCommand.class\nPid:01 31 : DistanceSinceCCCommand.class\n. @pires Maybe you should check size of buffer, without hardcode getting  buffer.get(2) and buffer.get(3) ?\n. About ignore of first two bytes I understand, and it is good for responce 41041B70- after cut 1B70 is remaining -  The decoded number is 7024\nbut if responce is 4104EA - after cut EA is remaining -  The decoded number is  234 - and here is bug reproduced\n. Duplicate of https://github.com/pires/android-obd-reader/issues/164\n. Duplicate of https://github.com/pires/android-obd-reader/issues/164\n. The same issue for 01 2F : FuelLevelCommand.class\n. @pires It's full log stacktrace.\n. ",
    "mstormi": "exactly\n. Oh, seems you got me a little bit wrong there. I don't have anything to contribute, unfortunately ... actually I meant this to be a feature request to you :-) Sorry for being unclear.\nBtw, for a blueprint, you can check out the 'owntracks' app on Github.\n. ",
    "ZKjellberg": "Please excuse the size, the Nexus 6P resolution is a bit absurd.\nFirst image, not the white font instead of black, giving a better appearance. In the second image you'll see the full appname is visible, compared to the original which only would say \"Android OB...\"\n\n\n. These values were labeled as untranslatable in the master strings.xml file and were simply a copy of the original master value. This felt redundant to me.\n. Email has been removed. The application prompts the user to submit logs when deactivated, but by default provides no means to discover an email address to submit them to. I emailed you about this today and assumed you were comfortable with giving users a method to contact you. I have updated the commit and removed the value.\n. ",
    "shareef593": "Add $10 from me\nSent from my iPhone\n\nOn May 9, 2016, at 4:51 AM, Pho3niX90 notifications@github.com wrote:\nThis is still an issue on my side as well. I am prepared to put up a $10 reward for a proper fix for the VIN.\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly or view it on GitHub\n. \n",
    "KirbyJames": "Many thanks for returning to this issue.\nBelow are two VINs shown as both raw and hex\neuÂ¥Â¥Â£ÂµÂ¤ #3s#                               \neÂ…Â„Ã”Â£ £ÂƒSs\n\n. Many thanks for returning to this issue.\nBelow are two VINs shown as both raw and hex\neuÂ¥Â¥Â£ÂµÂ¤ #3s#\neÂ…Â„Ã”Â£ £ÂƒSs \n\n. Hi, I've added the code to VinCommand.java and rebuilt the app. Unfortunately it returns the same value ..\n\n. Ah. I have realised that my build is using the github version of obd-java-api-master/.  I have downloaded the obd-java-api-master library - but I don't know how to modify the gradle configuration to use it in the build.\n. I've managed to re-build the app with the modified VinCommand.java\nI've printed the rawdata value below ... and a valid 17-character Vin is returned :-)\nrawdata: 0:4902015756571:5A5A5A314B5A422:57323233373237\n    Vin: WVWZZZ1KZBW223727\nrawdata: 0:4902015756571:5A5A5A314B5A422:57323233373237\n    Vin: WVWZZZ1KZBW223727\n. WVWZZZ1KZBW223727 is a 2011 VW Golf registered in the UK.\nWill the update be included in an updated obd-java-api?\n. ",
    "jbits": "NAMES_COLUMNS is missing column name for ALTITUDE. \nLogCSVWriter writes out altitude:\ncrl = reading.getTimestamp() + \";\" +\n                    reading.getLatitude() + \";\" +\n                    reading.getLongitude() + \";\" +\n                    reading.getAltitude() + \";\" +\n                    reading.getVin() + \";\";\nAs a result all values past Longitude have wrong column heading.\n. I can't reproduce it. From what I understand after I go back to the app by clicking on notification (service != null && service.isRunning()) evaluates to false. I don't see it happening. Maybe somebody could explain more clearly what is the issue. I'm fairly new to android.\n. Nothing obvious. I use logging a lot and it works. Your best bet is to debug it yourself.\n. > The speed was displayed as a constant 65km/h while standing still and engine RPM of 4163.\n\nAlso the runtime was a constant 04:37:51.\n\nThe GUI is not always refreshing correctly when OBD status  is disconnected. Make sure it's connected before attaching any significance to the readings. \n. ",
    "yangwuan55": "Thanks.\nI found the problem.\n. @Pho3niX90 I use the simulator,and the simulator should set the agreement,I set the agreement and it can use.\n. ",
    "vegeta20": "Thank for your reply. \nI would like to confirm as below\n1. I was testing with adapter OBD II Multi Meter that was supported by OBD Info-san MAXWIN application.\n   It's working fine\n   - Updating is  as fast as real kilometer on car. ( I feel it is no delay and very smooth )\n     So, when I switch to use OBD-reader, the updating is very late. \n2. I removed the GPS function on app ( by customize source code )\n   Because , OBD 2 is supporting command to get Distance , right ?\n   If I use GPS, so OBD adapter becomes meaningless \n. In addition, I can get distance by using OBD Info-san MAXWIN without turn on GPS.\nI confirmed that\n. @Pho3niX90 \nThank for your suggestion. \nI'll try to do that \n. > @pires @Pho3niX90 do its have command implemented in obd-reader that can return vehicle KM traveled? Its will be good to match it with the GPS distance.\nThis is my confusion. I try to confirm that.\nTheoretically, we can do that. \n. @deft5746 Are you working on Simulator or real Car ?\nThere are a lot of car models with difference protocols among difference manufactures.\nWith some new model car we can get distance without GPS . But of course it depends on car models ( support or not support )\n. Good morning !\n@Pho3niX90 \nRegrading the raw data, I'm sorry that I didn't save it before. I will take the screenshot or file log in next testing time. \nBUT, all of strange value look likes a [Max value] that is described on Wiki page:\nhttps://en.wikipedia.org/wiki/OBD-II_PIDs\nFor examples :\nRPM 16,383\nDistance 65,535\netc...\n@bitaromulus \nHave you think the protocol type is a one of reasonable ?\n( At that time, I choosed AUTO )\n. @bitaromulus \nThank for your reply.\nAs far as I know, the Vehicle speed is the most important value. \nAnyway, I'm waiting your next report.\nI will also try to test with all protocols. I just need to get Timing, Speed, Distance only .\nReport you soon....\n. Hello @bitaromulus \nThank for your report 👍 \nI have a question for you.\n\nI've tried with all of the available protocols and only the CAN ones provide good data (except for the Vehicule Speed).  \n\nWhat kind of CAN protocol that has been confirmed ?\nThere are many CAN protocols type that is defined in source code .\nEx: \nIOS_15765_4_CAN\nIOS_15765_4_CAN_B\nIOS_15765_4_CAN_C\nIOS_15765_4_CAN_D\nSAE_J1939_CAN\nUSER1_CAN\n. @bitaromulus\nI'm planing to buy a OBD 2 Simulator such as ECUsim.\nSo I have been testing on real car ( Toyota Voxy 2014).\nI didn't test with each of protocol type. Just set as AUTO.\nBeside that, I do not use Wifi , my expected is what is the real result that retuning by OBD II command only .\nI dont want to get distance by GPS. \nCan you help me to test Distance MIL with out GPS ?\n. Good evening!\n@Pho3niX90\nThanks for your explain.\nSo , OBD 2 is not currently supporting distance traveled command (PID) ?\n. @bitaromulus \n@Pho3niX90 \nI'm so sorry for ask you again about Distance traveled.\nI'm really confused with three Module $ PID\n- 01 21   -> Distance traveled with malfunction indicator lamp (MIL) on\n- 01 31   -> Distance traveled since codes cleared\n- 04 NA  -> Clear trouble codes / Malfunction indicator lamp (MIL) / Check engine light\n  (Clears all stored trouble codes and turns the MIL off.)\nFrom my understanding,we can get value that return from command Distance travelled with MIL on\nAnd then, if (04 NA) command has been called , it means the MIL if OFF.  At this time, we can use command (01 31) to get value in this case ( Since codes cleared) . What does value of (01 31) mean ?\nSo my confusion is :\n- What is the difference beween distance travelled , distance travelled with MIL on and distance travelled with MIL off ( in case of since codes cleared)\n. @Pho3niX90 \nEx: A car travels from point A to point B. \nHow many km driven in this case?\n. @Pho3niX90 \n\n31 has a max value it will display and does not get reset on each trip\n\nWhat does max value mean in this case ?\n@sytolk\n@Pho3niX90 \n\nMy only suggestion to what you want to achieve is monitor the cars speed over the session time and calculate the distance\n\nYep. This is my workaround until now.\nI also tested this case and has a litle difference from the real kilometer on car.\nResults\nIn fact, I have driven 2.2km and spent 15 minutes. But the calculation is returned 1.9 ~ 2.05 km \nMaybe the calculation the not good BUT the main problem is the speed is not updated in real time !\n( Around 2 seconds is delayed with real kilometer )\n. ",
    "deft5746": "I have a ELM327 device and i want to calculate distance from start point to end point with ELM327 device and not with GPS.I am a newbie and I am unable to find anything on the internet. Can anyone help with this? Any help would be appreciated.. Thank you for replying,\nWe were working on a simulator as we are just setting up the code right now but we didn't get the code for calculating the distance. Once we are done with the code setup then we will try it on a real car. We were working with this till now :\nhttps://github.com/Hesamedin/ELM327 . ",
    "bitaromulus": "Hello,\nI am also receiving some strange values for most of the parameters. I am using the ECUsim 2000 simulator and for example, the Speed and RPM is displayed like this:\nSpeed: 410D941:DAF11803410D942:DAF12803410D94\nRPM: 410CFFFF1:F11804410CFFFF\nWhen i manually change the value of the parameters of the ECUsim, these parameters are updated but are displayed in the same format.\nIs this a format issue, incompatibility or am i doing something wrong ?\nThank you !\nL.E. By the way, i am using an Asus ZEN Tablet with Android 5.0.1\n.  @Pho3niX90 \nHello again,\nMy ECUsim 2000 has 5 knobs which can be used to manually update the values of the parameters.\nThe parameters that can be monitored are:\n- Knob 1: Engine Coolant Temperature;\n- Knob 2: Engine Speed (RPM);\n- Knob 3: Vehicle Speed;\n- Knob 4: Oxygen Sensor Voltage (I don't know if this is actually available in the current API, didn't check);\n- Knob 5: Mass Air Flow (MAF).\nThis simulator, also has a Configuration DIP Switch (has two switches that set the protocol attributes for ISO 15765-4(CAN). Switch number 1 is also used to select the init type for ISO 14230-4: \na) 29 bit / 11 bit - Selects CAN frame ID type;\nb) 500 kbps / 250 kbps - Selects CAN baud rate;\nc) Fast Init / 5 Baud Init - Selects the type of initialization for ISO 14230-4).\nWhen i wrote the previous message, i was using the simulator with the following settings: \n29 bit / Fast Init + 500kbps\nWith these settings, i was receiving those strange values for most of the parameters, to be more precise: Knob 1, Knob 2 and Knob 3.\nMeanwhile, i changed to the following settings:\n11 bit / 5 Baud Init + either 500 kbps or 250 kbps\nAfter i did this, i ran the Android application once again and i've noticed that the values for Knob 1(Engine Coolant Temperature) and Knob 2(Engine Speed (RPM)) are displayed correctly. Knob 3(Vehicle Speed) is still the same strange format, though.\nCurrently, for Knob 3(Vehicle Speed) the displayed value is as follows:\n- With Knob 3 set at max, the displayed value is: 410DFF2:0DFF4000103700\n- With Knob 3 set at min, the displayed value is: 410D002:0D003000103700\nKnob 3 should give as a returned value 0x00 for min and 0xFF for max (0~255km/h).\nWhat is suprisingly is that certain bits of the displayed parameter, are constantly updated without touching any of the knobs:\n410DFF2:0DFF4000103700\nThe numbers marked in bold are being updated constantly (it doesn't has an exact period of time, it just changes at about 5~10 seconds).\nIf you need any other information, please let me  know and i will try to help in whatever way is possible for me.\nThank you in advance !\nL.E. I've tried using the same ECUsim and ELM 327 with the existing Torque application. Everything runs as it should, no problem regarding the display of parameters.\n. Good morning,\n@kaorijp I've tried with all of the available protocols and only the CAN ones provide good data (except for the Vehicule Speed). The other ones do not work, NODATA is displayed in most of the cases.\nCurrently, i also use AUTO setting.\nThis evening, i will also try to post a screenshot and if possible, a log file. I guess this way, it will be better.\nThank you and have a nice day !\n. Hello once again,\nI've tested once again the application but it's the same problem with the vehicle speed.\nI am attaching the log file, i hope it helps to identify more easily the source of this problem:\nOBDReader_logcat_1466540907052.txt\nIf you need any other information, please let me know.\nThank you and have a nice day !\n. Hello @kaorijp \nYou are right, i should have been more specific regarding the protocol which i use.\nMy ECUsim 2000 is not full featured, this means that it currently supports only the Standard ISO 15765-4.\nI currently have chosen the AUTO option from the configuration menu, but it always uses IOS_15765_4_CAN_C (except for the Vehicle Speed, everything works for me with this protocol).\nIf i choose a different protocol, NODATA is received/displayed.\nI hope this information is useful for you.\nHave a nice evening !\n. Hello @Pho3niX90 \nI have managed to group some raw incoming/outgoing data for each of the Knobs.\nIn the pictures, you will see incoming/outgoing (Rx/Tx) data from the ECUsim 2000, which i've captured using TeraTerm. I've started with min value for each knob and gradually increased it until the max value is reached (you will notice that the values will modify).\nAlso, for each Knob, i've associated the log file.\n11 bit / 5 Baud Init + 250 kbps\n\nKnob 1 (Engine Coolant Temperature)\n\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316364/f795ab94-398e-11e6-98f1-9bf4eb8843a8.jpg\nAndroid App LOG: -  (I forgot to send the logfile. If it's necessary, i can upload it later.)\n- Knob 2 (RPM)\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316391/19188be2-398f-11e6-82e9-206dc385879b.jpg\nAndroid App LOG: [RPM]OBDReader_logcat_1466705645131.txt\n- Knob 3 (Vehicle Speed)\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316417/2a89a0aa-398f-11e6-9661-58eed0e5b989.jpg\nAndroid App LOG: [VH. SPEED]OBDReader_logcat_1466706265806.txt\n- Knob 4 (Oxygen Sensor Voltage) - Not available\nECUsim LOG: -\nAndroid App LOG: -\n- Knob 5 (Mass Air Flow)\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316423/3872af68-398f-11e6-8b1b-6dcfc58999b0.jpg\nAndroid App LOG: [MAF]OBDReader_logcat_1466706011275.txt\n29 bit / Fast Init + 500kbps\n\nKnob 1 (Engine Coolant Temperature)\n\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316508/9075dc8a-398f-11e6-9f57-f4cc4a47078d.jpg\nAndroid App LOG: [ENGINE COOLANT TEMP.]OBDReader_logcat_1466707547676.txt\n- Knob 2 (RPM)\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316516/9997fa8c-398f-11e6-8284-d3611a315777.jpg\nAndroid App LOG: [RPM]OBDReader_logcat_1466708093893.txt\n- Knob 3 (Vehicle Speed)\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316949/912e3030-3991-11e6-8baa-bd61ebaf9054.jpg\nAndroid App LOG: [VH. SPEED]OBDReader_logcat_1466707754477.txt\n- Knob 4 (Oxygen Sensor Voltage) - Not available\nECUsim LOG: -\nAndroid App LOG: -\n- Knob 5 (Mass Air Flow)\nECUsim LOG: https://cloud.githubusercontent.com/assets/20044707/16316530/acb95af2-398f-11e6-8fd6-42f0e23355a1.jpg\nAndroid App LOG: [MAF]OBDReader_logcat_1466707977783.txt\nWhen do you think it will be possible to fix the displayed format for the Vehicle Speed ?\nIf you need any more information, let me know and if it's possible for me, i will try to help.\nThank you and have a nice evening !\n. ",
    "HIGHLANDER3": "\nIf you take the memorized distance traveled and subtract from the actual and display it, that could satisfy?\nYou just need to consider that other option when he uses the other PID for the calculation the distance traveled due to MIL ocurrence.\nIt will not be good if you clear those trouble codes, once you need it to know whats going on in your vehicle.\n. ",
    "unnivm": "Thank you Pires.\nUnni M\nOn Sat, Jul 16, 2016 at 6:34 PM, Paulo Pires notifications@github.com\nwrote:\n\nIf there's anything I've learned about OBD is that nothing is guaranteed.\nGood luck!\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/pires/android-obd-reader/issues/191#issuecomment-233129410,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AA7JG0XOqF3otBARJstMZ9crAjdB3Fn6ks5qWNbNgaJpZM4JKXPx\n.\n\n\n\nIf not played, Free Sudoku Android Game\nhttps://play.google.com/store/apps/details?id=com.gamerfan.sudoku\n. ",
    "achinverma": "ok , i mean to say that i can turn on/off car Horn or Head Lamps via this api from android mobile app , please share any example or code ?\nbecause in the current demo app it will only get the car details\n. ",
    "BorisKnez": "I triead all the protocols...they all turn the same static values if they are successful. Else I get ERROR or NODATA. \nI tried with torque and it works well on no matter what protocol I use. \nI'm testing everything with Freematics OBD emulator if that helps. \nDo you have any idea what else could I try? \nThanks!\n. What do you reccomend that I can do now to continue testing / developing the app?\nWhat protocol is 100% supported that I should use?\n. ",
    "vinod123igloble": "Hi Pires,\n             Thanks for the demo code its really helpful but i have some problem as i am not able to getting distance travelled and Fuel consumption,fuel level by this.can you please help me out of this.\nthanks in advance \n. ",
    "malibu1320": "Do you have any guidance on what needs to be modified? I'm not seeing where the base request header is setup that needs changed.  I have the source running locally and connected to my bench PCMs.\n. Here's an example for GM vs standard OBD.  You request on mode $22 with PID \"119D\". Now I need to see where to adjust analyzing the buffer for a valid response.\npublic BarometricPressureCommand() {super(\"01 33\");} //Standard OBD PID\npublic GMBarometricPressureCommand() {super(\"22 11 9D\"); //GM Mode $22 PID\n. @pires , do you have any tips on how I can implement this?  I tried adding new command classes as seen above and adjusting the buffer offset for finding the data but didn't have any luck (yet).\n. ",
    "Drjacky": "@galuhboy123 It's not this project issue. It's yours. Mentioned error means that there is problem on server side. check it via Postman. Anyway, google that error.. "
}