{
    "pixelsign": "Thank you! \n. Thanks a bunch!\n. Hello,\nThanks for the recommendation/request. I have added a link to the demo page in the readme file.\nhttp://aarnis.com/demo.html is the link\nThanks again, and I hope this can be helpful to you! :)\nAngelos\n. New devices probably will be added in the near future.\n. New devices probably will be added in the near future. The CSS devices is indeed a good alternative.\n. Thanks guys. it should be working now.\nOn Sun, Aug 3, 2014 at 2:28 PM, NodexTech notifications@github.com wrote:\n\nYour demo website doesn't work\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pixelsign/html5-device-mockups/issues/6.\n\n\nBest Regards,\nAngelos Arnis\nBSc Hospitality Management\nFreelance Graphics Designer\n+358 (0) 45 8498340\nhttp://fi.linkedin.com/in/angelosarnis\nhttp://dribbble.com/pixelsign\n. make sure to clear your cache. The url is now\nhttp://aarnis.com/pixelsign/demo.html\nOn Sun, Aug 3, 2014 at 3:05 PM, NodexTech notifications@github.com wrote:\n\nhttp://aarnis.com/demo.html\nNot Found\nThe requested URL /index.php was not found on this server.\nAdditionally, a 404 Not Found error was encountered while trying to use an\nErrorDocument to handle the request.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pixelsign/html5-device-mockups/issues/6#issuecomment-50988801\n.\n\n\nBest Regards,\nAngelos Arnis\nBSc Hospitality Management\nFreelance Graphics Designer\n+358 (0) 45 8498340\nhttp://fi.linkedin.com/in/angelosarnis\nhttp://dribbble.com/pixelsign\n. Hello, thanks for notifying me about this. It is now changed and corrected.\n. Thank you for the heads up. The demo now works under the Github pages.\nhttp://pixelsign.github.io/html5-device-mockups/\n. Changed the site a bit but the demo still contains the div with the code. You can simply download it and remove it.\n. Sorry for the huge delay, it is fixed now.\n. Merged.\n. Good idea, will add soon!. This might be helpful\nhttps://www.apple.com/legal/intellectual-property/guidelinesfor3rdparties.html. ",
    "LukoCastillo": "No, what is it?\n. ",
    "JosefJezek": "Free Pure CSS Mockups\n. ",
    "zivc": "+1, bit bummed out you didn't use transform:rotate(90deg);\n. ",
    "andregoiano": "Couldn't access it either. (Safari/OS10.10).\n. ",
    "desmondhume": "Me neither\n. ",
    "NodexTech": "http://aarnis.com/demo.html\nNot Found\nThe requested URL /index.php was not found on this server.\nAdditionally, a 404 Not Found error was encountered while trying to use an ErrorDocument to handle the request.\n. Perhaps update the Github docs then?\n. ",
    "yosefw": "+1\n. ",
    "christiangenco": "This should probably be redone for Github Pages - hosting is free and guaranteed.\n. ",
    "acidus99": "Hurray! Glad you fixed it\nOn Mon, Aug 31, 2015 at 5:28 AM, pixelsign notifications@github.com wrote:\n\nClosed #20 https://github.com/pixelsign/html5-device-mockups/issues/20.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pixelsign/html5-device-mockups/issues/20#event-396470404\n.\n. \n",
    "JuanS-zz": "Regarding Nexus 6, a quick hack which is working for me just fine:\nadd this to your device-mockups.css\n```\n/ Nexus 6 /\n.device-mockup.nexus6,\n.device-mockup.nexus6.portrait {\n    padding-bottom: 189.751958225%;\n}\n.device-mockup.nexus6.landscape {\n    padding-bottom: 52.700378397%;\n}\n.device-mockup.nexus6 > .device,\n.device-mockup.nexus6.portrait > .device {\n    background-image: url(\"nexus_6/nexus_6_port.png\");\n}\n.device-mockup.nexus6.landscape > .device {\n    background-image: url(\"nexus_6/nexus_6_land.png\");\n}\n.device-mockup.nexus6 > .device > .screen,\n.device-mockup.nexus6.portrait > .device > .screen {\n    top: 7.5%; bottom: 7.5%; left: 7%; right: 7%;\n}\n.device-mockup.nexus6.landscape > .device > .screen {\n    top: 7%; bottom: 7%; left: 7.5%; right: 7.5%;\n}\n```\n. ",
    "MatissJanis": "NPM too please. ",
    "ben182": "Pull request is already opened.\n. Hey andrew8712,\nI think thats caused by the lazy loading. We do not perload every device when the site loads. We would end up with a lot of traffic. Insted when you change the phone, the browser loads the image. You can test this by switching the same 2 devices. On the first switch, the delay occurs. From the second time on, the devices switch intant.\nBen. That's right - you can not find it until this pull request is merged. Bower needs the config file in the repository. Unfortunately the owner does not maintain his repo that often.. Hi\ncan you explain your problem a bit further and give some code examples?. You can control the height by setting a max-width in the .device-container. For example 300px. This will also make it responsive for small screens.. galaxy_tab4 has no psd file. http://www.pixeden.com/psd-mock-up-templates/iphone-7-psd-mockup-vector. https://www.behance.net/gallery/51510707/-free-iphone-6-6s-mockup-. http://www.designlazy.com/iphone-7-mockup-psd/. Hi @bencmbrook,\nbasically you cannot control the height of the device through the css height property.\nIt is a bit more complicated since we need to respect the device's aspect ratio.\nSo the formula is: Wanted Height = X / Y * 100. X is the Wanted Height, Y is the padding-bottom property of the device DIV. This will calculate the needed width.\nHere is the working example: https://jsbin.com/wacezudezi/1/edit?html,css,output\n. Hi @bencmbrook,\nwill this affect the css image paths? Have you tested this?. Okay thanks for the help!. #49. Actually the device pictures are very small - nevertheless I will accept the pr.. Fixed #53. Sadly not. We need a good mockup. Feel free to commit one as I added the help wanted flag.. Hi SamThilmany,\nI appreciate and checked ur changes. Actually I dont think this is helpful. Preprocessors are to help writing simpler CSS. If we put 2 different in the bucket it gets complicated. Moreover, with two preprocessors we have two device array files. This would make it more difficult to maintain.\nBen. Okay, so I sleeped about it and I guess I accept ur PR. I think I can live with two preprocessors and since we get more developers into the project with scss its a win-win for all. The problem with the doubled maintenance is still present but I dont know a solution to this yet. Actually we have to keep in mind that we have two files to maintain.. U know what? I consider removing the less part. When I look over the new scss files in comparison, I notice the more simple and more beautiful approach. Especially for the loop.. Hi ralphchung,\nwe use the MIT license. I changed the package.json.\nCheers Ben . Hi,\ndisable pointer-events: none; in .device .screen.\nThis should fix it.\nCheers. Hey,\nI can not accept your PR yet. The following needs to be changed:\n\nYou have to include your device in the sass file. Otherwise it can get overwritten in the future. Please use Grund to build your css file afterwords and not write your rule directly in the css file. You will also get the minified version with these steps.\nPlease add your device to the global readme. \n",
    "austince": "Awesome, looking forward to it! \n. Not to be that guy, but bower themselves are now suggesting using npm/yarn as a frontend package manager. Is there willingness to include a package.json and publish as well? . ",
    "agordeev": "Fixed by setting paddings.. ",
    "jeffrey-effendy": "Has this been integrated yet? I can't find package named \"html5-device-mockups\" in the bower repo. ",
    "Hayko1994": "Hi. I solve that problem however can't control the size of the device. on the small screens it seems normal but on the large screen it looks like this. How can I control the size of the device? Here are the 2 images.\n\n\n. ",
    "bencmbrook": "Gotcha. Appreciate the help.. And one thing to note-- the imac and iMac folders were combined in this PR, which moves the .PSD into the folder. I figured this combination was okay, since this is consistent with other devices' folders. The same goes for the .PSDs in surface and ipad.\nIn total, this PR changes\n- rename macbook to Macbook\n- rename iphone5 to iPhone5\n- merge imac into iMac\n- merge surface into Surface\n- merge ipad into iPad. Hey @ben182, the CSS image paths remain as they were. The data-device attributes always used proper capitalization, so the paths always resolved to the correct capitalized case. In other words, there are no API changes and it should not break any existing projects.\nI've tested this, and it's running properly now on my production server (which was failing before due to the mismatched letter casing).\nAnd thanks for this awesome repo!. worked fine for me on bower 1.7.9 and bower 1.8.2. ",
    "gerbil802": "Any update on this? . ",
    "kajensen": "+1. ",
    "mehrdadrafiee": "Nice work! Cannot wait for these mockups to be added. 👍 . ",
    "RigoTheDev": "Any updates?. ",
    "pshah123": "iPhone X is available via #69 thanks to @dessonchan 🎉 . The .min.css file is not updated in this fork, but the .css is.\nFor anyone using this pull, the device name is \"iPhoneX\" and the data-color attribute is \"black\". If you're having trouble having your screen content appearing, set the z-index on the screen (e.g. style=\"z-index: 2\") and that should fix any problems.\nAwesome mockup!. ",
    "srigaux": "https://github.com/pixelsign/html5-device-mockups/pull/72. ",
    "SamThilmany": "Actually, the default value of the $rel-mockup-path variable should point to the actual folder of this project. I will change it to ../../device-mockups and recompile the css.. @ben182 I only partly agree with your opinion. \n\nPreprocessors are to help writing simpler CSS\n\nYes, absolutely, but they also give you the possibility to include the styles into your own project styles and overwrite some basic settings. Think on bootstrap for example. If you are building a serious website, you won't include the basic bootstrap stylesheet, but import those modules you need and alter the variables to your needs.\nOkay, so you might think that what I just said only applies to huge projects such as bootstrap, but the simple fact, that I cannot change the path to the mockup images in your current code shows the opposite. If I want to use html5-device-mockups I have to have the same project structure as the one defined, otherwise, the css code will not find the images. \nIn my opinion, this is a huge shortcoming of the project. Have a look at font-awesome, they define a 'scss' and a 'less' variable for the path to the fonts too, otherwise, you wouldn't be able to use it, if you choose to import it yourself.\n\nMoreover, with two preprocessors we have two device array files.\n\nThat's a big problem, I know. Maybe it is possible to write one array, that can be read from 'scss' and from 'less'. Hopefully, there is a possibility to do so.\n\nI'm including all my css dependencies into my scss files, which is also commonly done in the industry. So why restrict this to less? The popularity of scss is growing and has overtaken less by far, so there is really no reason (besides the two arrays) to not include a scss version for those users that want to use it.\nI really like the way font-awesome deals with this by offering the two most common preprocessors and a compiled version for those users that simply want to add a style tag. \n\nSidenote: This PR came to life because I wanted to use html5-device-mockups in one of my projects and I needed a scss version. That's why I quickly translated your less code into scss.\n\nRegrads, Sam. Great to see that this was accepted.\nJust as a side note: If you add me as Collaborator/Developer I'll happily take care of the scss in the future.. ",
    "bucklander": "+1\nalso, the PNG mock-up exists here: https://facebook.design/devices. ",
    "emrealparslan93": "I found the solution:\nFor 'screen' div, you have to set pointer-events: all.\n. ",
    "susthitsoft": "Is this going to be merged anytime soon?. ",
    "theluk": "On Chrome 71.0.3578.98 without any plugins or extensions. ",
    "itsminetechnology101": "I had a similar problem. A background color from a div was overlaying the phone image. I changed the z-index of the covering div and it got fixed. In the css for the mockups the z-index is set to -1. I experimented with the div with the background color changing its z-index until it showed the phones. In my case I set the div z-index to 1.. ",
    "binakot": "Same problem on chrome 72.0.3626.121. "
}