{
    "pkyeck": "hi.\ni just tried this and it worked perfectly ...\nnode:\nio.sockets.on('connection', function (socket) {\n    socket.on('message', function (data) {\n        console.log(\"on message ... \" + data);\n    });\n});\nobjc\n[socketIO connectToHost:@\"localhost\" onPort:3030];\n// ...\n- (void) socketIODidConnect:(SocketIO *)socket\n  {\n  [socket sendMessage:@\"hello world: what's up\"];\n  }\nserver log:\ninfo  - handshake authorized 1280190971158189083\ndebug - setting request GET /socket.io/1/websocket/1280190971158189083\ndebug - set heartbeat interval for client 1280190971158189083\ndebug - client authorized for \ndebug - websocket writing 1::\ndebug - websocket received data packet 3:::hello world: what's up\non message ... hello world: what's up\nbut it looks just like your code .... !?!?\nare you sure that you added the listener before the message arrived?\n. Vielen Dank für Ihre Email,\nich bin erst wieder am Montag, den 29. August 2011 erreichbar.\nMit freundlichen Grüßen\nPhilipp Kyeck\n. sorry for the wait - was on holidays the last 3 weeks.\ni will also commit some changes later this week.\nthanks for the support.\n. the snippet from the readme looks like this:\n```\n NSMutableDictionary *dict = [NSMutableDictionary dictionary];\n [dict setObject:@\"test1\" forKey:@\"key1\"];\n [dict setObject:@\"test2\" forKey:@\"key2\"];\nSocketIOCallback cb = ^(id argsData) {\n     NSDictionary *response = argsData;\n     // do something with response\n };\n [socketIO sendEvent:@\"welcomeAck\" withData:dict andAcknowledge:cb];\n```\n. in the delegate you have the following methods:\n- (void) socketIO:(SocketIO *)socket didReceiveMessage:(SocketIOPacket *)packet;\n - (void) socketIO:(SocketIO *)socket didReceiveJSON:(SocketIOPacket *)packet;\n - (void) socketIO:(SocketIO *)socket didReceiveEvent:(SocketIOPacket *)packet;\n - (void) socketIO:(SocketIO *)socket didSendMessage:(SocketIOPacket *)packet;\nyou can check if the packet has the \"ack\" parameter set. if yes, then do your stuff and after you are done with it, just do\n- (void) sendAcknowledgement:(NSString*)pId withArgs:(NSArray *)data;\nwith the \"pId\" from the packet-object.\n. added a xcode test project to the repo\n. hi bsnote,\ni don't have the time right now, sorry.\nbut i shouldn't be too complicated - take a look at it and adjust the class correspondingly.\nthat's what github is for ;)\nbest\nphil\n. the current version uses ARC\n. i changed a lot today - including adding the two remaining dependencies as submodules\n. sorry, but you're wrong. it's build for iOS.\n. just clone the repo + copy these two files into your project:\nWebSocket.h\nWebSocket.m\nthat's it.\n. you don't have to do this async - then everything should work as expected\n. does the UI stop \"flowing\" when you get rid of the async stuff?\n. most of the work is done in the background so even if it takes the server some seconds to send an answer, your UI should be ok.\n. what is your setup?\nis your socketserver running (correctly)? can you connect using the browser?\n. i just made some small changes to the way the handshake is done - could you please do a pull and check whether or not the problem is still there?\n. @claaslange what did the socket.io server log. the handshake was successful, the socket-connection after that failed.\n. is this with the ARC or non-ARC version?\n. @quintet i tried your server and sometimes got this:\n2012-06-09 09:58:03.523 SocketTesterNonARC[8271:f803] Connecting to socket with URL: http://50.97.85.225:80/socket.io/1/?t=16807\n2012-06-09 09:58:03.867 SocketTesterNonARC[8271:f803] requestFinished() 1728195448305002263:60:60:websocket,xhr-polling,jsonp-polling,htmlfile,flashsocket\n2012-06-09 09:58:03.869 SocketTesterNonARC[8271:f803] sid: 1728195448305002263\n2012-06-09 09:58:03.873 SocketTesterNonARC[8271:f803] heartbeatTimeout: 67.000000\n2012-06-09 09:58:03.875 SocketTesterNonARC[8271:f803] transports: (\n    websocket,\n    \"xhr-polling\",\n    \"jsonp-polling\",\n    htmlfile,\n    flashsocket\n)\n2012-06-09 09:58:03.875 SocketTesterNonARC[8271:f803] Opening ws://50.97.85.225:80/socket.io/1/websocket/1728195448305002263\n2012-06-09 09:58:09.027 SocketTesterNonARC[8271:f803] ERROR: Connection failed with error ... Read operation timed out\n2012-06-09 09:58:09.028 SocketTesterNonARC[8271:f803] onDisconnect()\nbecause you don't have access to the server, try debugging the traffic: http://stackoverflow.com/questions/5751495/debugging-websocket-in-google-chrome\n. that was on my todo-list anyway ... i'll have a look at socketrocket and will probably switch the two.\n. added the changes by kayleg to the master branch\n. socket.IO-objc supports socket.io from version 0.7.2 and up - you have to check whether or not your socket.io version is compatible with node 0.6.18 - if so, this library will work as expected.\n. look at the logs - it had nothing to do with SocketIO:\n*** Terminating app due to uncaught exception     'NSInvalidArgumentException', reason: '-[UITouchData setLength:]: unrecognized selector sent to instance 0x7a8b5e0'\n. can't reproduce the problem. anyone else having this issue?\n. the handshake happens asynchronously - no need for dispatch_async\n. never saw this one before ... i pushed some minor changes (including submodules) - try if the error still occurs.\n. thanks\n. added this to the current version - thanks\n. > But, it worries me that we may end up getting out of sync with the, what appears to be, main ARC-based repo.\nI'm afraid that'll be the case because I won't put any more effort into the non-ARC version.\n\nWhat was the motivation for two repos, as opposed to either non-ARC-only, or ARC via conditional compilation? If it was just for speed-of-development, would you be up for either of these as a longer-term solution?\n\nI think - in this case - \"ARC via conditional compilation\" would be best, but I don't have the time to make any big changes to the library right now ... but feel free -  that's why the lib is open source.\nAnd I should mention that SocketRocket AND the json-framework use ARC, so you would have to change these dependencies as well.\nHope this answers your questions.\n. > I had noticed that the non-arc version is out of date. Perhaps that should be called out in the README?\nyou're right - i should at least add a note. thanks.\n. i'd like to keep the iOS4 version ... sorry.\n. you can take a look here:\nhttps://github.com/LearnBoost/socket.io/blob/master/examples/chat/index.jade\nit's the html/js part of the example.\nin line 47 they emit the \"nickname\" event.\nsocket.emit('nickname', $('#nick').val(), function (set) { // ...});\nthe second parameter is a function/callback that is missing in your iOS code - so fn is undefined.\nhere is an article that explains this in more detail:\nhttp://www.zachstronaut.com/posts/2011/08/17/node-socket-io-curious.html\ni think you have to change the JS code on the server to don't require the second parameter - and just emit an event if the nickname was set / couldn't be set.\n. could you put this in a separate file so the SocketIO stuff and the JSON serialization won't get mixed and the SocketIO.m won't get too big ...\n. compiling this for ios5 works w/o problems.\nbut could you adjust the test project to also compile under ios4 using SBJson? that would be great.\n. did you try to run it in the ios4 simulator? it doesn't work.\n. aaaaargh, another reason to not update to mountain lion ;)\nbut you're sure that you can't install them later on - they weren't shipped with 10.7 but you could install them.\nthis is the error I'm getting when testing on the iOS4 simulator:\n2012-08-21 22:33:35.957 SocketTesterARC[11472:b903] *** NSInvocation: warning: object 0x2d27c of class 'SocketIOJSONSerialization' does not implement methodSignatureForSelector: -- trouble ahead\n2012-08-21 22:33:36.043 SocketTesterARC[11472:b903] *** NSInvocation: warning: object 0x2d27c of class 'SocketIOJSONSerialization' does not implement doesNotRecognizeSelector: -- abort\n. don't be too hard on yourself :D\neverything fixed now.\n. used an even more general approach with (id). but thanks for pointing this out.\n. done ... hope this works :)\n. fixed in the current version 0.2.3\n. these are the available options:\nobjective-c\n- (void) connectToHost:(NSString *)host onPort:(NSInteger)port;\n- (void) connectToHost:(NSString *)host onPort:(NSInteger)port withParams:(NSDictionary *)params;\n- (void) connectToHost:(NSString *)host onPort:(NSInteger)port withParams:(NSDictionary *)params withNamespace:(NSString *)endpoint;\n- (void) connectToHost:(NSString *)host onPort:(NSInteger)port withParams:(NSDictionary *)params withNamespace:(NSString *)endpoint withConnectionTimeout: (NSTimeInterval) connectionTimeout;\nyou always have to supply a port.. split them and pass them in separately. will take a look at this ...\n. fixed this using the method described here: http://gigliwood.com/weblog/Cocoa/Q__When_is_an_conne.html\nbut thanks for pointing this out.\n. pulled this directly from your repo because i had to change some other things as well.\n. mmm, never tried that. i always use a nodejs server on my dev-machine.\nbut you could maybe take a look at this: http://browserver.org/\n. there's a - (void) disconnect you can use to disconnect the socket-connection.\n. there's a - (void) disconnect method you can call.\n. isConnected shows whether or not the client is connected to the server.\nisConnecting shows whether or not the client is currently trying to establish a connection (but is not yet connected).\n. which version are you using? the ARC one?\nand what are you doing? connecting and then just sending events over the wire? or any other fancy stuff?\n. that's not a socket.io thing - it's got to do with the multitasking/background state of the app.\niOS doesn't allow just any kind of background process.\nmore info: developer.apple.com\n. looks like a server problem to me. sorry.\n. i myself never had this problem either but the fix doesn't hurt anybody - so i went ahead and merged.\n. thanks\n. fixes #49\n. would be great to keep the old delegation method, deprecate it and add the new one - so nobody's app breaks because of the update.\n. thanks for the pull request.\nsorry for not getting the commit history right - had to do this manually.\nbut added you to the authors in readme :)\n. thanks\n. merged. thanks.\n. you got \nio.sockets.on('mapReady', function() {\non the server but send a\nsocketio sendEvent:@\"mapsReady\" withData:nil\nevent (mapReady vs mapsReady).\nmay this be the whole problem?!\n. do you reconnect to the server manually after switching to/from airplane mode?\n. yep, should work as expected.\n. hey. i never used namespaces myself and the NS addition to this library came from someone else  \n\nNamespace support by Sam Lown sam@cabify.com at Cabify.\n\nsorry for not being of much help.\n. this is a rarely used special case (at least I've never been asked this before ...), so you'd have to adjust the library yourself.\nmaybe this helps!? http://stackoverflow.com/questions/9250076/how-to-set-a-cookie-with-a-nsurlrequest\n. I'm not planning on implementing this any time soon. but feel free to try this yourself ... I'd be happy to add it to the library.\n. sounds great ...\n. @maziyarpanahi this landed in v0.5.1 https://github.com/pkyeck/socket.IO-objc/commit/79655e713d71ecd7c04ebb2bc9df9c22c387b2ec\n. ``` objective-c\n// create socket.io client instance\nSocketIO *socketIO = [[SocketIO alloc] initWithDelegate:self];\n// pass cookie(s) to handshake endpoint (e.g. for auth)\nNSDictionary properties = [NSDictionary dictionaryWithObjectsAndKeys:\n                              @\"localhost\", NSHTTPCookieDomain,\n                              @\"/\", NSHTTPCookiePath,\n                              @\"auth\", NSHTTPCookieName,\n                              @\"56cdea636acdf132\", NSHTTPCookieValue,\n                              nil];\nNSHTTPCookie cookie = [NSHTTPCookie cookieWithProperties:properties];\nNSArray *cookies = [NSArray arrayWithObjects:cookie, nil];\nsocketIO.cookies = cookies;\n// connect to the socket.io server that is running locally at port 3000\n[socketIO connectToHost:@\"localhost\" onPort:3000];\n```\n. @maziyarpanahi are you sure that you have the current version? pls doublecheck.\nshouldn't throw an exception if you're setting the cookies like this:\nsocketIO.cookies = cookies;\n. glad I could help\n. @sp4rkbr could you check if this gets rid of the crashes?\n. but this is from SockerRocket right!? never saw this snippet before :)\n. thanks @rsattar - didn't know about this.\nwill definitely have a look at it.\n. use have to create a delegate method. e.g.:\nobjective-c\n- (void) socketIO:(SocketIO *)socket didReceiveEvent:(SocketIOPacket *)packet\n{\n  NSLog(@\"didReceiveEvent() >>> data: %@\", packet.data);\n}\nwhich handles the server-response\n. you have to #import SocketIOPacket.h of course.\n. > Ok that works now, thank you very much! do i have to import this three too?\n\nimport \"SocketIOTransportWebsocket.h\"\nimport \"SocketIOTransportXHR.h\"\nimport \"SocketIOTransport.h\"\n\nno, they are only used inside the SocketIO class.\n\nThe error is in SocketIOTransportXHR.m\n\nwhich error?\n. don't know where this comes from.\nyou can take a look at the example project that is included in the repo - it is sending events from the server to the clients ...\n. when does this warning come exactly?\nat first glance, it sounds maybe like a warning from SocketRocket ... but I've never seen this before.\n. merged in v0.4.0\n. It is possible that setTimeout is called while the timer is still running. This should \"reset\" the timer and prevent it from firing the timeout event. \nIf I remove the [_timeout invalidate] will the event still fire? I'd think that only \"nil\"ling the timer isn't enough. Correct me if I'm wrong.\n. SocketRocket is a submodule that I'm using. If you're downloading the ZIP you also have to download the ZIP from the SocketRocket repo.\nYou could just checkout the repository and also get the submodules:\nhttp://git-scm.com/book/en/Git-Tools-Submodules#Cloning-a-Project-with-Submodules\n. thanks\n. where exactly should this happen?\ndo you have an example?\n. fixed in v0.4.0\n. thanks, merged this manually.\n. what does the server logs say?\n. has this anything to do with this?\nhttps://github.com/pkyeck/socket.IO-objc/issues/65\n. no, sorry, it can't\n. thanks. will take a look at the fix and merge it eventually.\n. should work with v0.4.0\n. I tried to use the interval that was returned from the socket.io server but it was too short and the connection was closed by the client 95% of the time because the heartbeat wasn't in time.\n. added a comment:\nhttps://github.com/pkyeck/socket.IO-objc/blob/master/SocketIO.m#L676\n. if you change the heartbeat on the server it won't make a difference. I get the heartbeat from the server and used it, but the interval was just to short (even when using something like 20 seconds) because the heartbeat event wouldn't arrive in time. so I'm adding X seconds to the heartbeat the server returns when connecting to it as a kind of cushion.\nI don't know how it's handled on the server but I suppose the heartbeat is sent after the X seconds passed and with the \"small\" delay the communication over the wire takes to get to/from the client, it's just not enough time. Way back when I first started this lib I tried different values but 7 seconds was the one I stuck with - maybe today one could reduce this but I haven't tested it in a while.\n. as I said, I tested this a while ago (socket.io 0.7.2) so maybe they fixed this. But waiting 7 more seconds for the heartbeat (only if it doesn't arrive on time) isn't killing anyone ... so no need to clean this up just yet.\n. the easiest thing would be to add the error.code to the errorInfo then you can handle the \"handshake error\" differently depending on the errorcode in your application.\n. do you know since which version socket.io supports the forced disconnect?\n. ok, thanks.\nI couldn't get this working with the old v0.8.7 I had installed on my laptop, although it's supposed to be from end of 2011...\n. I named it - (void) disconnectForced instead of - (void) disconnectSync.\n. can I test this somehow in xcode?\n. fixed with 26748e0a0e535ee5fa8195868b3b5c7538d07dd1 - thanks.\n. this all sounds good to me - anyone with other feedback for this?\n. I'll have a look at it. thanks for the heads-up.\n. closed with b753a4a. thanks\n. update coming this weekend. thanks.\n. I also thought about removing the external stuff, but then decided against it because I read somewhere, that e.g. SBJson was faster that the NSJSON.\nshould we remove them nonetheless?\n. waited for some more feedback but I think it's enough. update coming this weekend. thanks everybody\n. update coming this weekend. thanks.\n. mmm, could be the server.\nmaybe try the [socketIO disconnectForced];\n. good to hear :)\n. nope, it just sets itself as delegate for SocketRocket.\nso I would also need to make sure to call the onData: on the main thread right?\n. @antonholmquist thanks for the help!\n. in the past it was enough to just tag the release in the repo and they updated it automatically. did anything change?\n. created PR (https://github.com/CocoaPods/Specs/pull/6975).\nnow we have to wait ... \n. merged ... and closing\n. No - at least - I have never used Sails.js.\nIf you get this up and running, please report back for other may run into the same problem.\nThanks\n. you're using the wrong callback - socket.emit() sends an event, so you have to use the\nobjective-c\n- (void) socketIO:(SocketIO *)socket didReceiveEvent:(SocketIOPacket *)packet\n{\n    NSLog(@\"didReceiveEvent\");\n}\ncallback instead.\n. ``` objective-c\n// event delegate\n- (void) socketIO:(SocketIO )socket didReceiveEvent:(SocketIOPacket )packet\n{\n    NSLog(@\"didReceiveEvent >>> data: %@, pId: %@\", packet.data, packet.pId);\n    // handle event ...\n    // ...\n// check for ack request\nif (![packet.pId isEqualToString:@\"\"]) {\n    // send acknowledge back to server\n    // you could also pass a NSArray as `args`\n    [socket sendAcknowledgement:packet.pId withArgs:nil];\n}\n\n}\n```\n. I just tried to compile it for OSX - as you say, it's currently not working. at least not, without any changes.\n1) you have to use the SocketRocket.framework for OSX instead of just the submodule\nsee: https://github.com/square/SocketRocket#installing-os-x\nbest way, I got this to work was as a subproject and I didn't have to add the \"copy file\" stuff.\n2) after \"importing\" the other framework, you have to fix the import-statement in SocketIOTransportWebsocket.h\n``` objective-c\n// replace\nimport SRWebSocket.h\n// with this\nimport \n```\nthen, everything should work.\nhope this helps.\n. @nunofgs thanks for the Cocoapods PR. I also made one for v0.5\n. taken from here #154 \n1. Install CocoaPods - http://cocoapods.org/\n2. Create a file 'Podfile' in your apps root dir contents should be:\nplatform :ios,  '5.0'\npod 'socket.IO',        '~> 0.5'\n1. run 'pod install'\n2. open your app with open appname.xcworkspace\n3. include the dependencies in your app \n. will be done today - didn't have the time yesterday.\n. PR submitted. just waiting to be accepted\n. no, I only knew about the \"fix\". thanks for the heads up.\nwill re-commit the new version.\n. will do.\n. no problem.\n. mmm, that's not my code. it's their's: https://github.com/square/SocketRocket\n. duplicate of #140. redundant because of 79655e7.\n. #65 was fixed a while ago - but this is just one of many possible reasons why the client is disconnected from the server.\nupdating to the newest version is a good idea - but watch out, there are I think 2 delegate methods that are not used anymore ... other than this, you shouldn't run into any problems.\nif updating fixes your problem, I can't say because I don't know the exact reason why it's happening in the first place ... sorry.\n. I just tried this with the current version\n``` objective-c\nNSMutableDictionary *dict = [NSMutableDictionary dictionary];\n[dict setObject:@\"test1\" forKey:@\"key1\"];\n[dict setObject:@\"test2\" forKey:@\"key2\"];  \n[socketIO sendEvent:@\"welcome\" withData:dict];\n[socketIO sendEvent:@\"welcome\" withData:@\"testWithString\"];\nNSArray *arr = [NSArray arrayWithObjects:@\"test1\", @\"test2\", nil];\n[socketIO sendEvent:@\"welcome\" withData:arr];\n```\nand on the server I had a listener for welcome:\njavascript\nsocket.on('welcome', function (data) {\n  console.log(data);\n});\noutput for the above calls was:\n``` javascript\n{ key2: 'test2', key1: 'test1' }\ntestWithString\n[ 'test1', 'test2' ]\n```\nso in my eyes everything is working as expected.\n. ok, now I see where you're coming from: you want the output to be\njavascript\n'test1', 'test2'\nfor the third example.\n. I double-checked this behavior with the current socket.io version like this:\n``` html\n<!doctype html>\n\n\n\nsocket.io tester\n\n\n    var socket = io.connect('http://localhost:3000');\n    socket.on('news', function (data) {\n      console.log(data);\n      socket.emit('welcome', [\"test1\", \"test2\"]);\n    });\n  \n\n\n\n\n```\nand the output was the same:\njavascript\n[\"test1\", \"test2\"]\nso we're handling it like they're handling it.\n. sorry, my mistake\n. socket.io v1.0 isn't final yet but I'll take a look at this. thanks for the heads up.\n. when fetching the current version from NPM, I still get the 0.9.16.\nhttps://www.npmjs.org/package/socket.io\n. ok, v1.0 landed, including some major changes that break the current version of the library.\nI don't have the time right now to implement the new protocol ... but maybe someone other than me wants to try ... \nI did take a look at v1.0 back in march and started to adjust the library but couldn't finish it - will check in the \"work in progress\" to a dedicated branch. maybe someone can use this as a starting point.\ncome august I'll have some spare time at my hands ... \n. @yosuke-furukawa no, not even the connection works anymore.\n@all others please stop +1-ing - I know that this would be great but I don't have the time right now.\nkeep you updated when this changes ...\n. @francoisp thanks for the link - he uses a javascript-bridge for the \"native\" implementation - clever ;) so there are multiple libraries that support 1.0. not fully right now but growing in scope. happy to see this. I'll link to your fork and the other link in the readme.\n. @Tejas-narola no, sadly not. but as I said before, if someone wants to contribute - be my guest\n. why are you downloading the ZIP?\neither check out the project using git and init the submodules or use cocoapods to install dependencies after cloning the repository.\n. there is a PR for this #169 - will take a look at this\n. singleton is one way, or you could create it somewhere else and pass it into the view classes and reuse the same instance everywhere\n. @starfalling thanks for jumping in.\n. that's coming from SRWebSocket.m - which is not part of the Socket.IO-objc library but a thing on its own.\n. the latest Socket.IO-objc version doesn't support v1.0.\nthere are some bigger changes and I don't have the time right now to implement those.\nI took a look at the new version some weeks back and made some first adjustments - maybe I'll check that into a dev-1.0 branch and anyone with time at their hands right now, can start from there ...\n. closing this - duplicate of #162.\n. right now, you can do this to access the data:\nobjective-c\n[[packet.args objectAtIndex:0] objectForKey:@\"status\"]\nI should add a more convenient method for this.\n. are you using socket.io version 1.x?\nbecause this library does not yet support the newest version ... \n. the handshake fails ... and after that the library has no URL for a forced disconnect - thus using NULL. try fixing the handshake first - after that the rest should work as expected.\n. maybe it is a timeout thing? maybe your phone takes too long to \"shake hands\" with the server and the call is aborted. never ran into this problem myself.\nyou could try and connect via\nobjective-c\n- (void) connectToHost:(NSString *)host onPort:(NSInteger)port withParams:(NSDictionary *)params withNamespace:(NSString *)endpoint withConnectionTimeout: (NSTimeInterval) connectionTimeout;\nand set the connectionTimeout to something bigger then 15 seconds.\n. Thanks @francoisTemasys for this PR.\nI'll take a deeper look at this in the coming days.\nOne thing I can say right now, I won't merge this directly/completely because I don't like the v0.9/1.0 stuff. I'd rather open up a new branch which is only compatible with v1.x and drop all the old stuff - whoever is using socket.io v0.9, can use the \"v0.9\" branch from then on ...\n. haven't tried it yet, but what I found:\nhttp://stackoverflow.com/questions/8618632/does-arc-support-dispatch-queues/8619055#8619055\nseems like this PR would break everything above iOS 6.0 or Mac OS X 10.8\n. you could update the submodule and make a pull request - at least then we would use the \"current\" version.\n. I could do the cocoapods PR after the merge\n. which socket.io version are you using?\n. Thought that you were maybe using a newer version that isn't compatible with this library ... but because that isn't the case, I can't tell :(\n. The phpsocket.io repo only supports socket.io v1.3.0 or greater. But this library only supports socket.io < 1.0.0 - so that is the problem.. I don't understand - if you use this lib, it doesn't support version >= 1.0.\nIf you use a different lib, than why are  you posting an issue here?. which version of socket.io are you using?\n. this library only supports socket.io < 1.0\n. @Dhaval3110 yep, socket.io 1.0+ was a complete rewrite and I didn't have the time to do all the adjustments needed for this lib to work with v1. . ",
    "remotevision": "thanks pkyeck. I'm not sure what was going on the first time either. I was able to get it working, although it wasn't clear what changed. It was for a 24 hour hack day project and ended up working perfectly, thanks!\n. ",
    "shakobyan": "Hi , could you show some simple code to use sendAcknowledgement\n. ",
    "ashottonoyan": "The readme snippet is only part of the story. It says how to call the acknowledgement call when the client send a message to the server.\nThe question was about to make the client send an acknowledgement back to the server, so the server side acknowledgement callback gets called.\n. Already figured that out. Just would be nice to have these in readme too :-)\n. ",
    "edolecki": "I am getting a clobber of NSURL url within WebSocket.m (- (void)onSocket:(AsyncSocket )sock didConnectToHost:(NSString )host port:(UInt16)port) - If I NSLog url as a number, I get one, but when url.host is used I get an EXC_BAD_ACCESS. So I can almost connect to a node.js server.\n. ",
    "tjrana": "I'm having trouble getting everything to run as well.\n. Ugh...\n. Can you at least upload it so it will help us? Please? :(\n. It would be helpful to have the complete project source code for socket.io-objc.\n. ",
    "darmen": "Subscribing\n. ",
    "ngoccuong291": "I got it running now, but there are so many tweaks that I had to do. I could not remember all of them now, and the code is in my project at the moment so it could be difficult to get it out. The trick is to read about each required library carefully. There is instruction for each sub-library on how to integrate it to your project. As far as I remember, only RegexKitLite has a tricky tweak that you have to do which involve modifying one of the key in the info.plist file. The other libs can be drag to your project easily. Good luck\n. This is my approach for Room Chat, hope it helps\n-(void) sendEvent:(NSString )eventName withString:(NSString ) message\n{\n    SEL function = nil;\n    NSMutableDictionary *dict = [NSMutableDictionary dictionaryWithObject:eventName forKey:@\"name\"];\n    [dict setObject:message forKey:@\"args\"];\nSocketIOPacket *packet = [[SocketIOPacket alloc] initWithType:@\"event\"];\nNSString *strTest = [dict JSONRepresentation];\npacket.data = strTest;\npacket.pId = [self addAcknowledge:function];\nif (function) \n{\n    packet.ack = @\"data\";\n}\n[self send:packet];\n[packet release];\n}\n. ",
    "bnadim": "Hi, may i suggest you check my fork/pull request. I removed dependency to regexkit (my version should work from iOS > 4.0) and asihttprequest. I also update so it's arc now. You will also find in my forks web socket updated to work with arc and latest GCDAsyncSocket  rather than asyncsocket. With my version you only need this, my web socket fork, jsonkit(already arc compliant) and GCDAsyncSocket. You will find a project using it in hubiquitus project (available on github)\n. ",
    "Nitrodist": "Why was this closed? This definitely needs to be supported in the client.. it's been in the Socket.IO js lib since at least 0.9.0 2 years ago.\n. ",
    "hegarty": "@ngoccuong291 Could you provide another example. I need to create dynamic rooms on the fly. I'd really appreciate your help\n. ",
    "nicolas-brousse": "Of course,\nI apologize for the response time\nViewController.h\n``` obj-c\nimport \nimport \"SocketIO.h\"\n@interface ViewController : UIViewController  \n{\n    SocketIO *socketIO;\n}\n@end\n```\nViewController.m\n``` obj-c\nimport \"ViewController.h\"\n@implementation ViewController\n\n(void)didReceiveMemoryWarning\n{\n    [super didReceiveMemoryWarning];\n    // Release any cached data, images, etc that aren't in use.\n}\n\npragma mark - View lifecycle\n\n\n(void)viewDidLoad\n{\n    [super viewDidLoad];\n    // Do any additional setup after loading the view, typically from a nib.\nsocketIO = [[SocketIO alloc] initWithDelegate:self];\n[socketIO connectToHost:@\"mysocket-server.com\" onPort:80];\n\n\n}\n\n\n(void)viewDidUnload\n{\n    [super viewDidUnload];\n    // Release any retained subviews of the main view.\n    // e.g. self.myOutlet = nil;\n}\n\n\n(void)viewWillAppear:(BOOL)animated\n{\n    [super viewWillAppear:animated];\n}\n\n\n(void)viewDidAppear:(BOOL)animated\n{\n    [super viewDidAppear:animated];\n}\n\n\n(void)viewWillDisappear:(BOOL)animated\n{\n    [super viewWillDisappear:animated];\n}\n\n\n(void)viewDidDisappear:(BOOL)animated\n{\n    [super viewDidDisappear:animated];\n}\n\n\n(BOOL)shouldAutorotateToInterfaceOrientation:(UIInterfaceOrientation)interfaceOrientation\n{\n    // Return YES for supported orientations\n    return (interfaceOrientation != UIInterfaceOrientationPortraitUpsideDown);\n}\n\n\n(void)socketIODidConnect:(SocketIO *)socket \n{\n    NSLog(@\"socket is connected\");\n[socket sendMessage:@\"Yahooooo\"];\n}\n\n\n(void)socketIO:(SocketIO )socket didReceiveMessage:(SocketIOPacket )packet \n{\n    NSLog(@\"socket send message : %@\", packet);\n}\n\n\n@end\n```\n. I finally dropped my socket.io app to Heroku and I installed it on my own server.\n. ",
    "rsattar": "socket.IO-objc doesn't currently support anything other than the websocket transport, unfortunately.\n. I've taken pkyeck's code and abstracted it to support XHR transport, but I need to make it a bit more generic before it's useful to others.\n. Sorry it's taken so long. I (re)used a custom wrapper for NSURLConnection of mine to handle the initial handshake (moving away from ASIHttpRequest) and subsequent XHR Requests, and so I should probably try and make a version of this using either ASIHttpRequest or custom NSURLConnection wrapper.\nOn Sep 18, 2012, at 7:10 PM, Alexander List notifications@github.com wrote:\n\nPing. Can you give an update? Do you need help writing this module?\n—\nReply to this email directly or view it on GitHub.\n. No problem, I didn't know about it either, until I caused our Socket.IO server to be sending lots of data quickly :). Other libraries crash when this happens, but your's treats it as a disconnect, it's a bit more stable :) \n\nHere's Socket.IO's own implementation (look for encodePayload and decodePayload (at the bottom of the file):\nhttps://github.com/LearnBoost/socket.io/blob/master/lib/parser.js#L120\n. ",
    "s5": "I just spotted some the beginnings of some XHR transport code. Any thoughts on when the final version will be available? I'm also using Heroku. Thanks!\n. ",
    "alist": "Awesome, keep up the good work!\n. Ping. Can you give an update? Do you need help writing this module?\n. SICK! Can't wait to pull this in! \nYou just enabled a billion or so heroku-based webapps to interface using your lib. \n. ",
    "nyx": "bumping this thread.  I am also interested in XHR long-polling fallback\n. ",
    "satishsampath": "ping.. registering my interest in xhr long-poll as well.\n. ",
    "emarashliev": "Yeah I'm agree, I cannot build cocoa-websocket for iOS :( \n. @JaviSoto Could you make fork , do this with submodules and make pull request, please ? I'll be so happy .\n. So nice, BIG Thank You guys !\n. How to build cocoa-websocket for iOS ?\n. Thank you so much :)\n. ",
    "JaviSoto": "Okay, I will do that :)\n. ",
    "Nadavrbn": "yes it works well normally but I'm trying to avoid blocking in order for the GUI to flow.\n. sortof, right now im developing using the simulator and im using a steady internet connection so the delay is like half a second. i'm just worried the about the experience of the app for users with low signal or slow connectivity on their phone.\n. I am also encountering the same issue in my app.\nI am working with a node.js server and the same error has happened on 3 different machines running the server(1 of the was a local server).\nIt happened while running on a simulator and on an iphone too.\nI can gain to the server through a web browser without a problem too.\nIt seems to me like the issue is more related to the cocoa-websocket project then this.\n. When I ran the server locally I remember having the same error, something with invalid websocket key.\n. @kayleg I would love it if you could commit your work and post a link back here.\n. Thanks a lot! So far I haven't had any problems.\n. ",
    "quintet": "Yes my socket server is running. Right now I am able to connect most of the time but on rare occasions (say once in about 6 tries) I am getting above mentioned error. The NSError *error parameter in \nwebSocket:(WebSocket *)ws didFailWithError:(NSError *)error \nis returning as nil. \nAnd in even rarer cases the same delegate fires with NSError time out error\n\nERROR: Connection failed with error ... Read operation timed out\n\nOne other thing I noticed the timeout error only fires after approximately 5 seconds of delay. But when NSError is nil, the delegate gets fired as soon as [_webSocket open]; is called. \n. Seems like you have updated the ARC version. Since our project runs on Non ARC version we couldn't run the changes. \n. Well this is the log we are getting, We are running non ARC version.\n\n2012-06-08 09:27:19.658 MyApp[585:11903] Connecting to socket with URL: http://50.97.85.225:80/socket.io/1/?>t=563613512\n2012-06-08 09:27:20.205 MyApp[585:11903] requestFinished() 10805291131983251033:60:60:websocket,xhr->polling,jsonp-polling,htmlfile,flashsocket\n2012-06-08 09:27:20.205 MyApp[585:11903] sid: 10805291131983251033\n2012-06-08 09:27:20.205 MyApp[585:11903] heartbeatTimeout: 67.000000\n2012-06-08 09:27:20.206 MyApp[585:11903] transports: (\n   websocket,\n   \"xhr-polling\",\n   \"jsonp-polling\",\n   htmlfile,\n   flashsocket\n)\n2012-06-08 09:27:20.220 MyApp[585:11903] Opening >ws://50.97.85.225:80/socket.io/1/websocket/16754975251191513560\n2012-06-08 09:27:21.958 MyApp[585:11903] ERROR: Connection failed with error ... (null)\n2012-06-08 09:27:21.958 MyApp[585:11903] onDisconnect()\n\nWe don't have any control over the server side, but already many desktop and web clients are running successfully under that server. \nWe used to get this error in infrequent intervals before but for the past 24 hours the connection is failing every time.\n. There was a proxy setup in our network and when we tried to connect under that , we never got it to connect. Every time we got message ERROR: Connection failed with error ... (null) . Then we removed the proxy setup for our iPhone, and it got connected sometimes. We never had any firewall rules. \nIt is still not connecting always, getting the same error about once in 6 tries.\n. We got that error sometimes but we are getting connected too. We don't think it is a server access issue. Also rather than Read operation timed out error, we are getting null error most of the time. \n@claaslange are you getting any server logs when xcode returns connection error with null value? You posted the logs when timeout error happens. We are thinking when null error happens the connection request is not getting to the server at all.\n. Have you updated non ARC version too? \n. ",
    "claaslange": "I'm having the same problem as quintet. My socket server is definitely running and there are no problems connecting to it witch Chrome on Mac OS X, Windows and Safari on iPad.\nWhen it fails I'm seeing either\nERROR: Connection failed with error ... Read operation timed out\nor\nERROR: Connection failed with error ... nil\nin Xcode's debug console.\nI switched to the new ARC-Version just 5 minutes ago and will see if the problem still persists. So far (about 9 tries) it seems to be working.\nEDIT:\nThe new version does not help. Still seeing the\nERROR: Connection failed with error ... Read operation timed outerror\n. I checked it, unfortunately the error still persists. Worked 14 times like a charm, but the 15th time I got:\n2012-06-06 11:37:33.133 App[2541:707] Connecting to socket with URL: http://home.pb:80/socket.io/1/?t=16807\n2012-06-06 11:37:33.309 App[2541:707] requestFinished() 1157881484256392746:60:60:websocket,flashsocket,htmlfile,xhr-polling,jsonp-polling\n2012-06-06 11:37:33.311 App[2541:707] sid: 1157881484256392746\n2012-06-06 11:37:33.315 App[2541:707] heartbeatTimeout: 67.000000\n2012-06-06 11:37:33.317 App[2541:707] transports: (\n    websocket,\n    flashsocket,\n    htmlfile,\n    \"xhr-polling\",\n    \"jsonp-polling\"\n)\n2012-06-06 11:37:33.322 App[2541:707] Opening ws://home.pb:80/socket.io/1/websocket/1157881484256392746\n2012-06-06 11:37:38.342 App[2541:707] ERROR: Connection failed with error ... Read operation timed out\n2012-06-06 11:37:38.343 App[2541:707] onDisconnect()\n2012-06-06 11:37:38.346 App[2541:707] -[KMLMainViewController socketIODidDisconnect:] [Line 327] Disconnected from socket\n. Currently working on the logs. Got some new error, seems to be the same quintet experiences.\n2012-06-06 15:43:38.206 App[3600:707] Connecting to socket with URL: http://home.pb:80/socket.io/1/?t=16807\n2012-06-06 15:43:38.387 App[3600:707] requestFinished() 9531394381379498557:60:60:websocket,flashsocket,htmlfile,xhr-polling,jsonp-polling\n2012-06-06 15:43:38.389 App[3600:707] sid: 9531394381379498557\n2012-06-06 15:43:38.392 App[3600:707] heartbeatTimeout: 67.000000\n2012-06-06 15:43:38.395 App[3600:707] transports: (\n    websocket,\n    flashsocket,\n    htmlfile,\n    \"xhr-polling\",\n    \"jsonp-polling\"\n)\n2012-06-06 15:43:38.400 App[3600:707] Opening ws://home.pb:80/socket.io/1/websocket/9531394381379498557\n2012-06-06 15:43:38.425 App[3600:707] Connection opened.\n2012-06-06 15:43:38.428 App[3600:707] onData 1::\n2012-06-06 15:43:38.430 App[3600:707] setTimeout()\n2012-06-06 15:43:38.456 App[3600:707] connect\n2012-06-06 15:43:38.457 App[3600:707] onConnect()\n2012-06-06 15:43:38.459 App[3600:707] onConnect() >> End points do not match, resending connect packet\n2012-06-06 15:43:38.460 App[3600:707] send()\n2012-06-06 15:43:38.462 App[3600:707] send() >>> 1::/Photos\n2012-06-06 15:43:38.470 App[3600:707] onData 1::/Photos\n2012-06-06 15:43:38.472 App[3600:707] setTimeout()\n2012-06-06 15:43:38.474 App[3600:707] connect\n2012-06-06 15:43:38.476 App[3600:707] onConnect()\n2012-06-06 15:43:38.477 App[3600:707] -[KMLMainViewController socketIODidConnect:] [Line 321] Connection with socket\n2012-06-06 15:43:38.479 App[3600:707] doQueue() >> 0\n2012-06-06 15:43:38.481 App[3600:707] setTimeout()\n2012-06-06 15:43:51.863 App[3600:707] ERROR: Connection failed with error ... (null)\n2012-06-06 15:43:51.865 App[3600:707] onDisconnect()\n2012-06-06 15:43:51.869 App[3600:707] Connection closed.\n2012-06-06 15:43:51.871 App[3600:707] onDisconnect()\n2012-06-06 15:43:51.873 App[3600:707] -[KMLMainViewController socketIODidDisconnect:] [Line 327] Disconnected from socket\n. @pkyeck I got the following logs on the server:\ninfo  - handshake authorized 19770665261693374496\n debug - setting request GET /socket.io/1/websocket/19770665261693374496\n debug - set heartbeat interval for client 19770665261693374496\n warn  - Invalid websocket key: \"wC I-q\"X`&4'73|$M 527  9 11\".\n info  - transport end (undefined)\n debug - set close timeout for client 19770665261693374496\n debug - cleared close timeout for client 19770665261693374496\n debug - cleared heartbeat interval for client 19770665261693374496\n warn  - Invalid websocket key: \")-B` h^[19\"'1 6(#584V r414\".\nThis caused the following error:\nERROR: Connection failed with error ... null\n. It's with the ARC version.\n. Here is the log for the time out error:\ninfo  - handshake authorized 968199958930396315\n   debug - setting request GET /socket.io/1/websocket/968199958930396315\n   debug - set heartbeat interval for client 968199958930396315\n   debug - client authorized for \n   debug - websocket writing 1::\n10.10.0.20 - - [Thu, 07 Jun 2012 10:47:16 GMT] \"GET /photos.json HTTP/1.1\" 200 - \"-\" \"PrismaViewer/1.0 CFNetwork/548.1.4 Darwin/11.0.0\"\n   info  - transport end (socket end)\n   debug - set close timeout for client 968199958930396315\n   debug - cleared close timeout for client 968199958930396315\n   debug - cleared heartbeat interval for client 968199958930396315\n   debug - discarding transport\nIn Xcode I see the following:\n2012-06-07 12:47:16.757 App[4430:707] Opening ws://home.pb:80/socket.io/1/websocket/968199958930396315\n2012-06-07 12:47:16.774 App[4430:707] #####################\n2012-06-07 12:47:16.775 App[4430:707] KEY:\n2012-06-07 12:47:16.777 App[4430:707] ^   J(*% U9D   '-' /7 /2545 680\n2012-06-07 12:47:16.779 App[4430:707] #####################\n2012-06-07 12:47:16.781 App[4430:707] #####################\n2012-06-07 12:47:16.783 App[4430:707] KEY:\n2012-06-07 12:47:16.784 App[4430:707] -+  J)L #!%20K95Y+8.4- 6756\n2012-06-07 12:47:16.786 App[4430:707] #####################\n2012-06-07 12:47:21.792 App[4430:707] ERROR: Connection failed with error ... Read operation timed out\n2012-06-07 12:47:21.794 App[4430:707] onDisconnect()\n2012-06-07 12:47:21.796 App[4430:707] -[KMLMainViewController socketIODidDisconnect:] [Line 328] Disconnected from socket\nThe ######## key thing is added by me. I'm currently looking if I can find a pattern in the not accepted keys.\n. ",
    "kayleg": "I was receiving this issue too, then I swapped out the cocoa-websocket with SocketRocket and haven't received it again.\ncocoa-websocket seems to have issues. \nIf people would like to try my fork and post back I will be glad to open a pull request.\n. Sure here it is:\nhttps://github.com/kayleg/socket.IO-objc\n. All fixed. The dispatch_async caused delegate methods to be called on the wrong thread. Missed the top level one when I removed the others.\n. I replaced cocoa-websocket with SocketRocket and made a few modifications and everything works. I didn't open a pull request because of the submodule change, but I can if you want me to.\nIf you want it is available in my fork: https://github.com/kayleg/socket.IO-objc\nFeel free to close issue\n. ",
    "taiyangc": "Seems to have resolved my issue as well. Thanks @kayleg \n. Hi, could you check if this is the correct way to deprecate? Also merged with master conflicts... is there a way to do this cleanly in the future after the pull request no longer refers to the original master head?\n. I am more than happy! Thanks!\n. Should have already been fixed: https://github.com/square/SocketRocket/issues/52\n@pkyeck could you update the submodule to SocketRocket's latest? I've been on it for a while now and everything seems smooth.\n. I am seeing the exact same issue. @mattmassicotte I tried your proposed solution in square/SocketRocket#78 but doesn't seem to help. Could you do a fork? Thanks.\n. Does this fix #89 ? Hope these fixes get merged soon! @pkyeck Thanks.\n. @pkyeck Could you take a look at this fix when you have time? Thanks.\n. ",
    "lyetz": "Solved by allocating _httpRequestData in initWithDelegate:\nobjective-c\n_httpRequestData = [[NSMutableData alloc] init];\n. Yeah, I noticed that too. Turns out it was because I was running everything within an IBAction. But after changing that, it seems like _httpRequestData was being released too soon (http://ca.ltz.im/H5Zx). Allocating _httpRequestData fixed the problem.\n. ",
    "yangzhu6263736": "it's the non-ARC version.\n. _socketIO = [[SocketIO alloc] initWithDelegate:self];\n     [_socketIO connectToHost:@\"192.168.1.125\" onPort:3737 withParams:[NSDictionary dictionaryWithObjectsAndKeys:@\"12\", @\"userId\",@\"xiaoqiang\", @\"userName\",nil]];\n. ",
    "IIStevowII": "I have the same problem where events are retrieved (Seeing from the log of the Socket.IO library) but not delegated.\nThe didReceiveEvent method is not called at al. This is strange because the socketIODidConnect is called. (And from there I send a new event, where the server in turn sends an event back).\n. ",
    "humbroll": "I have the same problem. \nEven I couldn't receive delegate callback method:- (void) socketIODidConnect:(SocketIO *)socket \nAny solution?\n. ",
    "krulll": "I have the same problem. \nEven I couldn't receive delegate callback method:- (void) socketIODidConnect:(SocketIO *)socket\nAny solution?\n. ",
    "freddy-sf": "Exaclty the same probem for me. I set breakpoints in the Socket.IO.m and the program didn't reach them.\nUPDATE: Found it. The delegate MUST be defined as \"strong\" in the header file. Everything works perfect.\n. Seems like your doing something wrong. A good starting point is trying to\nconnect via JavaScript to your server.\nmounibec notifications@github.com schrieb am Sa., 29. Nov. 2014 um 16:20:\n\nThere is no support for socket.io v1.0, take a look at this fork\nhttps://github.com/francoisp/socket.IO-objc.\nThere is another issue opened for supporting 1.0 #162\nhttps://github.com/pkyeck/socket.IO-objc/issues/162\n\nReply to this email directly or view it on GitHub\nhttps://github.com/pkyeck/socket.IO-objc/issues/212#issuecomment-64954951\n.\n. \n",
    "mattmassicotte": "This does - thank you!  I'm not going to be making use of the json-framework, but I didn't realize that SocketRocket uses ARC too.  No worries, our use-case is special anyways.\nI had noticed that the non-arc version is out of date.  Perhaps that should be called out in the README?\n. Gah - this was accidental!  It was supposed to be a pull into our own forked repo.  I wondered why we were getting comments on it.\nOf course we'll keep iOS 4 support.  I also intend to add 10.6 support.  This was just a short-term work around for a current problem we have.\nSorry about that - and, glad you closed it! \n. Changed per your recommendation.  I also took the opportunity make the coding style match the project more closely.\nDon't be shy on feedback, too.  I don't want to force any of this on you, and am happy to make additional changes.\n. I don't quite understand.  The SocketTesterARC target has a iOS Deployment Target of iOS 4.0.  Is something else messed up?\n. I'm on mountain lion/Xcode 4.4 unfortunately.  iOS 4 simulators are no longer shipping or supported.  But, I'll be able to test on a device next week I think.  In the mean time, could you post the failure - its probably something stupid.\n. This is what you get when you accept pull requests from idiots ;)\nhttps://github.com/pkyeck/socket.IO-objc/pull/32\n. I'm willing to bet that this bad access is caused by your delegate being released and deallocated before the SocketIO instance.  Are you certain the life-cycles of these two objects is correct?\n. No, the UIApplication's delegate should be alive for the lifetime of your app.  Sounds like the app's delegate is also the SocketIO instance's delegate?  If that's the case, this is weirder.\nAre you crashing in objc_msgSend?  If so, I'll still put my money on an issue with _delegate being released.  Just not sure how that is happening in your app.\n. In this case, the relationship I'm talking about would be between MyClassIO and SocketIO.  I guess MyClassIO's ownership of socketIO is strong as well?  I'm not super-familar with ARC, so I don't know what the implied rule is here.\nobjc_msgSend is the runtime function that actually invokes methods.  Can you post the full stacktrace from the crashed thread?\n. You need to understand how background processing works in iOS.  Pkyeck's advice is best - refer to the documentation.  You'll be able to read about how you can, in very specific circumstances, be allowed to perform background tasks.\n. I've got this code deployed without SBJson and never hit this crash.  I'm not sure why your data would be nil sometimes and mine never would.  My first guess is server differences.  Is data always nil for you?\nEither way, I think putting in a check to prevent nil is a good idea.  But, that has implications.\nGlancing at the code, it appears nil data is never expected.  I'm not sure what an appropriate way to handle this condition outside of SocketIOJSONSerialization would be.\n. That might work.  It does appear that other parts of the system are assuming that the return value of dataAsJSON is never nil.  Might be ok, might not.  Would like to hear @pkyeck's thoughts\n. This appears to be a different manifestation of a crash I'm seeing as well.  Check out https://github.com/square/SocketRocket/issues/78.\nI believe that issue to be an inherent thread-safety issue in the SocketRocket, not SocketIO.\n. @taiyangc I'm disappointed that didn't work.  SocketRocket's synchronization is complex, and I was hoping for a simple solution.  Unfortunately, I don't have the time to tinker with this at the moment.\nI'd also love to hear some thoughts from the SocketRocket maintainers about the problem.\n. This also appears to be identical to the SocketRocket race I've talked about:\nhttps://github.com/square/SocketRocket/issues/78\n. ",
    "kylefleming": "Yep thanks!\n. ",
    "mennopruijssers": "Never mind.\n. Server is a node.js server with socket.io version 0.9.9.\nI found the reason: I'm logging the dataAsJSON in the delegate's socketIO:didSendMessage:\nMaybe it's a solution to just return nil when calling dataAsJSON on a packet without data?\n. See pull request #50.\nHopefully it get merged :)\n. Any updates on this one? I have this problem too...\n. When sending event before the socket is connection it wasn't queued properly. It's fixed now ;).\n. I have no idea but the first commit of the specs (Mar 15, 2011) already contains the forced disconnect as a requirement.\n. I always nill-check my delegates but it isn't exaclty necessary. I'll remove the nill-checks.\n. Any updates on this one?\n. I never noticed any speed delays after switching to NSJSONSerialization in any of my apps. \n. Any updates on this one?\n. Any updates on this one?\n. ",
    "veereshkumbargs": "is this solved. what if port is concatinated in the host itself\n. ",
    "RyanCopley": "I took care of this by attempting to connect again in the onDisconnect function, while it is a patch, it works.\n. ",
    "rscott78": "I'm using the latest version of the arc code. So far,  I connect then send\na single message to the server (in the onConnect delegate) to basically\nestablish that my client is online. The sever in turn emits events back.\nWhen I get the error, it's happening right after I've send my initial\nmessage. It's almost like the server's first message arrives before the\nsocket client is completely ready for it.\nOn Oct 27, 2012 12:15 PM, \"Philipp Kyeck\" notifications@github.com wrote:\n\nwhich version are you using? the ARC one?\nand what are you doing? connecting and then just sending events over the\nwire? or any other fancy stuff?\n—\nReply to this email directly or view it on GitHubhttps://github.com/pkyeck/socket.IO-objc/issues/46#issuecomment-9838141.\n. Somewhat certain - though I admit that I still consider myself new to\nobjective-c... I've defined my socket class in the AppDelegate as a\nproperty. Does the AppDelegate ever get released by the OS? I'm guessing\nnot?\n\nOn Mon, Oct 29, 2012 at 5:55 AM, Matt Massicotte\nnotifications@github.comwrote:\n\nI'm willing to bet that this bad access is caused by your delegate being\nreleased and deallocated before the SocketIO instance. Are you certain the\nlife-cycles of these two objects is correct?\n—\nReply to this email directly or view it on GitHubhttps://github.com/pkyeck/socket.IO-objc/issues/46#issuecomment-9863716.\n. I've got my own class -- MyClassIO -- which is being instantiated from the AppDelegate.  MyClassIO holds the reference to the socketIO server.\n\nMyClassIO.m contains:\n``` objectivec\n@implementation MyClassIO  \n@synthesize socketIO;\n-(id) init {\n    self = [super init];\nsocketIO = [[SocketIO alloc] initWithDelegate:self];\n\nreturn self;\n\n}\n```\nAppDelegate.h\nobjectivec\n@property (nonatomic, strong) MyClassIO* myIO;\nAnd then in the AppDelegate.m I create/instantiate it in the app delegate's didFinishLaunchingWithOptions method.\nAlso, what is objc_msgSend? Not sure what you are referring to.\n. Yes, it's a (nonatomic, strong) property defined in MyClassIO. \nWhen the crash happens again, I'll post the full stacktrace. That's what is tricky about this one - it's very intermittent.\n. I suspect this is similar to the issue I submitted here: https://github.com/pkyeck/socket.IO-objc/issues/76\n. ",
    "justoneplanet": "I have same issue...\nIn the following condition, the disconnection is no problem.\n- [socketIO isConnected] == 1\n- [socketIO isConnecting] == 0\nIn the following condition, the disconnection bring on a crash.\n- [socketIO isConnected] == 0\n- [socketIO isConnecting] == 1\nI think it is a problem in narrow networks like 2G~3G because it may be disconnected before it is completed to connect.\nobjc\n- (void)viewDidAppear:(BOOL)animated {\n    [super viewDidAppear:animated];\n    [socketIO connectToHost:self.host onPort:self.port withParams:nil];\n}\n- (void)viewDidDisappear:(BOOL)animated {\n    [super viewDidDisappear:animated];\n    [socketIO disconnect];\n}\n. ",
    "wangpeng1": "but i see some app can receive message at background.  the  didReceiveEvent methods not receive event  when my  app at  DidEnterBackground.is there other methods to let the didReceiveEvent can receive message?\n. sorry i cannot understand your said,can you detai to said me.i post http://stackoverflow.com/questions/13584267/how-to-reconnect-socket-io-ios-client-when-wifi-is-switched-off-then-enabled-aga/13584402#13584402\n. i call at  - (void)applicationWillEnterForeground:(UIApplication )application\n{\n    socketIO = [[SocketIO alloc] initWithDelegate:self]; //socketIO.useSecure = YES; [socketIO connectToHost:@\"localhost\" onPort:80]; \n}\n. i received :[SocketIO webSocket:didFailWithError:] ERROR: Socket failed with error ... The operation couldn’t be completed. Socket is not connected   when no wifi.but connect wifi not reconnect\n. through,the issuer is solve the discorrent problem,but when i run my app,sometimes it crash :- (void) connectionDidFinishLoading:(NSURLConnection )connection\n{\n    NSString *message = [[NSString alloc] initWithData:_data encoding:NSUTF8StringEncoding];\n    DEBUGLOG(@\"response: %@\", message);\n```\nif (![message isEqualToString:@\"1\"]) {\nNSArray *messages = [self packetsFromPayload:message];\n[messages enumerateObjectsUsingBlock:^(NSString *message, NSUInteger idx, BOOL *stop) {\n    [delegate onData:message];\n        }];\n\n}\n// remove current connection from pool\n[_polls removeObjectForKey:connection.description];\n[self checkAndStartPoll];\n```\n}\nthe [messages enumerateObjectsUsingBlock:^(NSString message, NSUInteger idx, BOOL stop) {\n            [delegate onData:message];\n                }];  give exc_bad _ACCESS\n. ",
    "SivaDotRender": "Did you ever figure this out? I have a socketIO server running on Heroku. I'm unsure what port I'm suposed to be listening to be listening to. My javascript client works when I don't specify a port number. With this library, I don't have the option of not specifying a port number. \n. @ShreyasSA  I fixed my problem but it was something trivial. If you give me more information I can help you debug your problem. \n. I think a common mistake is to not omit the \"http://\" part of the host url when using the connectToHost method. This is added automatically. So instead of \"http://www.example.com\", use \"example.com\". \n. ",
    "ShreyasSA": "Does  this error got resolve ?\nAny Solution ?\n. ",
    "anuradhavasudeva": "Hey guys,\nI'm facing the same issue here. When I connect to the server on a browser using the same URL it works fine but when I try to connect thru my Xcode program it throws an error! Any guess why this could be happening? \n. BTW, I altered my code to send a proper URL...as follows. I think Socket IO\nappends http on its own ..so sending http is redundant..so my call to\nconnecttohost looks like this :\n[_socketConnection connectToHost:@\"bubbleme.azurewebsites.net\"\nonPort:80 withParams:nil withNamespace:@\"\"];\nI get the error below now...\nWarning: Error creating LLDB target at path\n'/Users/anuradhavasudeva/Desktop/Buzz/Complete/CWPAYou/Build/Products/Debug-iphonesimulator/CWPAYou.app'-\nusing an empty LLDB target which can cause slow memory reads from remote\ndevices.\n2014-10-02 21:40:12.355 CWPAYou[11590:340614] Can't find keyplane that\nsupports type 5 for keyboard iPhone-Portrait-PhonePad; using\n2870935746_Portrait_iPhone-Complex-Pad_Default\n2014-10-02 21:40:26.335 CWPAYou[11590:340614] Connecting to socket with\nURL: http://bubbleme.azurewebsites.net:80/socket.io/1/?t=1412257226336\n2014-10-02 21:40:31.194 CWPAYou[11590:340614] send()\n2014-10-02 21:40:31.194 CWPAYou[11590:340614] queue >>>\n5:1+::{\"args\":[{\"key2\":\"test2\",\"key1\":\"test1\"}],\"name\":\"join\"}\n2014-10-02 21:40:31.415 CWPAYou[11590:340614] didReceiveResponse() 400\n2014-10-02 21:40:31.415 CWPAYou[11590:340614] ERROR: handshake failed ...\nServer returned status code 400\nSent from my Google Nexus Phone\nOn Oct 3, 2014 12:08 PM, \"Sivathmican Sivakumaran\" notifications@github.com\nwrote:\n\nI think a common mistake is to not omit the \"http://\" part of the host\nurl when using the connectToHost method. This is added automatically. So\ninstead of \"http://www.example.com\", use \"example.com\".\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pkyeck/socket.IO-objc/issues/55#issuecomment-57749523\n.\n. \n",
    "yunas": "@anuradhavasudeva I suspect the port you have used is wrong.\n. That's probably because of different versions of socket io js files\n. ",
    "IOSLZZ": "@anuradhavasudeva Does this error got resolve ?\nAny Solution ?\n. ",
    "jbaez": "198 Namespace fix\n. Support for socket.io 1.0.x #197\n. Looks that there is now a native implementation of the client for 1.0: https://github.com/socketio/socket.io-client-swift\n. #198 \n. :+1: \n. I have deployment target 7.1 and the described leaks appeared on the leaks profiler. \nAfter merging this fix the leaks are gone.\n. ",
    "hongkongkiwi": "This is not a special case. It's used when we don't want to pass the auth parameters over query strings (this is HORRIBLE!).\nI'm trying to do this too...\n. I currently use this on a very old version of the code.\nWill submit a pull request in about a week using current code base.\nIt's easy to implement.\nOn Wednesday, November 20, 2013, frranck wrote:\n\nWell, I used the Params:fields instead... thanks for the lib.\n—\nReply to this email directly or view it on GitHubhttps://github.com/pkyeck/socket.IO-objc/issues/63#issuecomment-28833376\n.\n\n\nSent from Gmail Mobile\n. The reason this is incredibly useful is because often URL requests are logged by servers, so if they contain sensitive data like passwords then these would also go into server logs, using this method and passing a NSDictionary of key-value data we are able to make sure that it's not logged (usually cookie data is considered sensitive and not logged).\nOn the other end, you need some code to split out the cookies from the header and process them.\n. Is this backwards compatible with Socket.IO 0.9?\n. ",
    "frranck": "me too... anyupdate on that ?\nwhat's the withParams:fields for ?\n. Well, I used the Params:fields instead... thanks for the lib.\n. ",
    "maziyarpanahi": "Guys any news? Has this been solved/added? I couldn't solve the problem and still get \"failed connection to socket.io: No session found\".\nMy iOS app has Facebook, Twitter reverse authentication and even local strategy implemented and works fine. I just need to some how pass the session so it understands the user has been logged in. So far no luck.\nPlease let me know if anybody has had any luck with this :)\nThanks a lot\n. @pkyeck  Thanks Philipp, I guess I have 0.4.1! \nJust to double check, I just need to get my existing cookie and pass it as a parameter right?\nNSHTTPCookie cookie;\n    NSString CookieSession;\n    NSHTTPCookieStorage *cookieJar = [NSHTTPCookieStorage sharedHTTPCookieStorage];\n    for (cookie in [cookieJar cookies]) {\n        if ([cookie.name isEqualToString:@\"connect.sid\"]) {\n//some how make this cookie into NSDictionary and pass it withParams?\n}\nSorry I'm on the way and haven't looked at the changes that's why I'm asking.\nReally happy to see this feature,\nGreat job everyone! :+1: \n. @pkyeck Hi Philipp, appreciate the code. Really simple and clean.\nI am getting this error:\n2014-05-27 17:19:32.665 24hrs[90504:60b] -[SocketIO setCookies:]: unrecognized selector sent to instance 0x10bf219f0\n2014-05-27 17:19:32.667 24hrs[90504:60b] *** Terminating app due to uncaught exception 'NSInvalidArgumentException', reason: '-[SocketIO setCookies:]: unrecognized selector sent to instance 0x10bf219f0'\nI just downloaded the master and replaced them with old files. Am I missing something else?\n. By current version do you mean the master? I can see this in header file:\n@property (nonatomic) NSArray *cookies;\n. Thanks very much @pkyeck that was my fault. I created the socketIO variable as a property wrongly. \nSorry my bad. \n0.5.2 works perfectly\nGreat effort.\nAppreciate the time Philipp :+1: \n. Hi, I'm on iOS 7 in a development stage. I find it useful to observe app states like DidEnterBackgroud or DidBecomeActive. I disconnect if it goes to background and connect again when it becomes active. It can be even simply going out of the app by pressing home button. When they back to app the app sends UIApplicationDidBecomeActiveNotification and I connect them again.\nI really wanna stop people of connecting and disconnecting because it puts a pressure on a server but for now I found this way the most stable way to make sure users can aways connect. \nOne question regarding connectToHost and disconnect, how do you manage your connections between different viewControllers? Do you connect to the host in each view Controller to get the data or you just connect once and just send event in each viewController to get the data in that channel?\nI have few ViewControllers and each have their own data and if I connect in each view that means one user has 4 connections to my server! \nThanks\n. That's what I thought. So the object it is. \nOne more question, do you have 'socket didReceiveEvent'  in your object and you send the data to your viewControllers right away from there? I was thinking to send the name of the event and other info from viewController to my object and from there I use socketIO sendEvent to start the stream and get what I need in that viewController and do the same with other views.\nThat was pretty good advice, thanks I really appreciate it. \nUpdate: one more thing that I forgot to ask you. I can call my function to [self.socketIO connectToHost] and it works fine but I can't this one never works in my NSObject even though it works fine in viewController: [self.socketIO sendEvent:@\"\" withData:@\"\"];\nAm I missing a delegate or something in my NSObject? Have you faced the same problem? Cause if I can solve this I can manage events from each viewController by calling this with the events I want and send the data.\nThanks a lot mate :+1: \n. Hi @breaklee, You mind if I ask have you tried using latest version of socket.IO-obj with new Socket.IO (1.0)? Are there only new features missing or it doesn't work the way it should?\nI am currently on 0.9 and will check this later on dev machine, just curious to see whether you have tried this.\nThanks.\n. yep, working for me too. For developing purposes we developers usually are use to test the broadcast with the same socket that created the connection. Have two connections open and test with one to see the result on the others.\nOtherwise you can have join/leave and join the user to the room and use io.sockets.in(\"room\").emit to send the msg to all the users in that room.\n. Were you be able to connect to you socket.io before or is it your first time? What is you Socket.io version? This is only compatible with Socket.io version 0.9.x\n. You sure you didn't your Socket.io on your server? Double check the version of socket.io on your npm see what is the version?\n. Guys lets be a little more informative here. What is the iOS version of your app? Because if it is iOS 6 and later (or even OS X 10.8 later) there is no memory leak.\nAnd I am seeing \"dispatch_release\" in your code which I can quote this from documents:\n\"If your app is built with a deployment target of OS X v10.8 and later or iOS v6.0 and later, dispatch queues are typically managed by ARC, so you do not need to retain or release the dispatch queues.\"\nSo maybe it only leaks in older versions which are not supporting ARC? In this case better test a version of the iOS first then use release.\n. But that's really interesting to see the exact same development spec with the same version of this library and I have no leak memory. I really care about the memory and I always check it so I didn't miss it. I am using this library heavily in my app and have never had memory leaks.\nI just can't get my head around the idea of the same environment and some have leaks and some don't. Are you guys using the latest version of this library? \ntnx\n. I talked about this in here: https://github.com/pkyeck/socket.IO-objc/pull/195\nWe have been seeing more memory leaks reports and I don't think there is any memory leaks in iOS7 by using ARC. I always check it and my usage is heavy.\nIf we sure there is no memory leaks in iOS7+ARC it should be something in reading about this in READ.ME to prevent reporting this issue over and over again.\n. ",
    "bridger": "I think I may have found the issue here. I am not sure if it should be fixed here or on Socket Rocket. \nSocketIOTransport is the delegate of SRWebSocket, but the property definition of SRWebSocket's delegate property isn't set to weak. The delegate pointer doesn't get nulled out when SocketIOTransport is dealloced. It can be fixed (I think) by correcting the property definition of SRWebSocket to be weak or by adding this line to SocketIOTransport\n- (void)dealloc {\n    [_webSocket setDelegate:NULL];\n}\n. ",
    "ghost": "Thank you so much! Well on my first post I said I created both immortal instances of SocketIO and SocketIODelegate and after some tests I found out they were diying anyway, so I fixed it, made them really immortal and just some rare crashes here:\n// If we get closed in this state it's probably not clean because we should be sending this when we send messages\n                    [self _performDelegateBlock:^{\n                        if ([self.delegate respondsToSelector:@selector(webSocket:didCloseWithCode:reason:wasClean:)]) {\n                            [self.delegate webSocket:self didCloseWithCode:0 reason:@\"Stream end encountered\" wasClean:NO];\n                        }\n                    }];\nSo I commented those lines and haven't had any crash since then, hahah. I'm going to uncomment them and add that line and check if it crashes!\n. Yes! It's on SRWebSocket.m\n. ",
    "Sef1995": "When i try to use that method i get this error 'property data cannot be found in forward class object 'SocketIOPacket'.. it has something to deal with 'packet.data'\n. //\n//  ChatWindowViewController.h\n//  SupLive\n//\n//  Created by Sefa Sentürk on 09-01-13.\n//  Copyright (c) 2013 Focus Websolutions. All rights reserved.\n//\nimport \nimport \"SocketIO.h\"\nimport \"SocketIOPacket.h\"\n@interface ChatWindowViewController : UIViewController  {\n    SocketIO *SocketIO;\n}\n@end\nOk that works now, thank you very much! do i have to import this three too?\nimport \"SocketIOTransportWebsocket.h\"\nimport \"SocketIOTransportXHR.h\"\nimport \"SocketIOTransport.h\"\nAnd when i'm trying to connect to my node.js server it crashess after a while i get this error:\n2013-01-09 15:58:04.901 SupLive[11363:c07] xhr polling supported -> using it now\n(lldb)\nThe error is in SocketIOTransportXHR.m:\n- (void) connectionDidFinishLoading:(NSURLConnection )connection\n  {\n  NSString message = [[NSString alloc] initWithData:_data encoding:NSUTF8StringEncoding];\n  DEBUGLOG(@\"response: %@\", message);\nif (![message isEqualToString:@\"1\"]) {\n      [delegate onData:message]; // ERROR >>> Thread 1: EXC_BAD_ACCESS (code=1, address=0x70000008)\n  }\n// remove current connection from pool\n  [_polls removeObjectForKey:connection.description];\n[self checkAndStartPoll];\n  }\n. if (![message isEqualToString:@\"1\"]) {\n[delegate onData:message]; // ERROR >>> Thread 1: EXC_BAD_ACCESS (code=1, address=0x70000008)\n}\nThread 1: EXC_BAD_ACCESS (code=1, address=0x70000008)\n. solved: http://stackoverflow.com/questions/14278578/trying-to-read-and-parse-my-json-in-xcode-objective-c\n. The warning comes when i call in [socketIO disconnect]\nOn 13 jan. 2013, at 09:08, Philipp Kyeck notifications@github.com wrote:\n\nwhen does this warning come exactly?\nat first glance, it sounds maybe like a warning from SocketRocket ... but I've never seen this before.\n—\nReply to this email directly or view it on GitHub.\n. Well i think i know a solution but i do not know how to apply it in my code, what i'm thinking about is this:\n\nI have multiple views where i need a socket IO connection, what i do now is when the user changs from a view in the void view will disappear i call in the function [socketIO disconnect]; and when the other view appears i call in the void view will appear and establish a new connection.\nIsn't it possible to connect to the socketIO once but have the variable available in all your view's? I think that will solve my problem. Thanks in advance.\n. No One?\n. ",
    "funkyboy": "I think a singleton is what you want\n. I think you have to wait at least a time out before reconnecting. I have a similar problem. If I go offline and then quickly on the server does not receive the \"reconnect\" event.\n. ",
    "heiko-s": "This warning appears on the server and not on the client. Whenever I call socket.disconnect() in iOS, the disconnect-event on the server is raised correctly, but the iOS app still keeps polling - thus causing the warnings. \nAs long as the iOS app keeps running after that, the server log gets flooded with warnings (client not handshaken client should reconnect & transport end (error)). Seems like XHR-Polling keeps running forever.\nNode 0.10.5\nSocket.io 1.2.18\nTransports: XHR-Polling only\n. Excellent, works for me too. Thanks Alex.\n. ",
    "ngzhongcai": "Hi Helko, \nI ran into the same error \"warn  - client not handshaken client should reconnect\" upon issuing [socketIO disconnect] command on iOS. \nBut I am unable to detect disconnect-event on the server, as in below is not triggered.\nsocket.on(\"disconnect\", function() {\n        console.log(socket.id + \" DISCONNECTED\");\nIm on the latest node and socket.io with XHR polling\n. disconnectForced\n. case 7: {\n                DEBUGLOG(@\"error\");\n                if([packet.data isEqualToString:@\"1+0\"]) {\n                    [self disconnectForced];\n                }\n}\n. But still getting a string of \"warn  - client not handshaken client should reconnect\" on server side\n. did some time profiling, \"checkAndStartPoll\" from SocketIOTransportXHR was still firing after \"[self disconnectForced]\"\n. It's quite dirty...\nI made 2 modifications.\n1. In SocketIO.m, I added \n   \"case 7: {\n   DEBUGLOG(@\"error\");\n   if([packet.data isEqualToString:@\"1+0\"]) {\n   [self disconnectForced];\n   }\n   }\" to \"onData:(NSString )data\"\n2. In SocketIOTransportXHR.m, I added\n   \"if(![message isEqualToString:@\"7:::1+0\"]) {\n       [self checkAndStartPoll];\n   }\"\n   to \"connectionDidFinishLoading:(NSURLConnection )connection\"\nThis stops it client from bombarding the server with \"client not handshaken client should reconnect\". \nBut hoping for more cleaner fix?\n. I'm reporting the same issue. But I just submit to apple anyways\nSent from my iPhone\n\nOn 3 Oct, 2013, at 2:51 pm, \"Adrian Holzer\" notifications@github.com wrote:\n@freak4pc the app is iOS 7 ready and compatible back to iOS 6.1\n—\nReply to this email directly or view it on GitHub.\n. Yeah, no issues \n\nSent from my iPhone\n\nOn 15 Nov, 2013, at 6:16 am, \"nullco\" notifications@github.com wrote:\nSame problem here, did it pass the apple review for you? @ngzhongcai\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "alexleutgoeb": "Experiencing the same problems with xhr-polling, anyone got a fix for this?\nThanks,\nAlex\n. Ok, got to fix this with changes from #109, hopefully this one gets merged in near future. :+1: \nAlex\n. ",
    "Olivia2013": "thanks. \n. ",
    "anthonywebb": "Seems similar to what this guy was seeing: https://github.com/square/SocketRocket/issues/49\n. Some more good commentary regarding socket lifecycle management: https://github.com/square/SocketRocket/issues/17\n. ",
    "guange2015": "@rscott78 \ni got the same problem with you. \nthis is my resolved code:\n```\n[self performSelector:@selector(reconnect) withObject:nil afterDelay:10.0];\n\n(void) reconnect {\n    [socketIO disconnect];\n    [socketIO connectToHost:@\"192.168.1.139\" onPort:3000];\n}\n```\n. why don't meger ????? author !!!\ni debug it use some hours.\n. \n",
    "magickaito": "hi guys, I am facing very similar issues, my problem is, this objective-c client goes crazy after server restarted. And it doesn't fire any disconnected delegate at all.\nSteps to reproduce\n- run server\n- run SocketTesterARC sample xcode project to connect to this server\n- restart server\nExpected behaviour\n- client should fire \"socketIODidDisconnect:(SocketIO *)socket disconnectedWithError\" or any other error delegates, so that our codes can attempt to reconnect/re-authenticate with server automatically \nObserved behaviour\n- client never fire any disconnect or error delegates, even though it prints out a lot of error messages:\n2013-03-19 16:39:27.494 MangaChat[3050:907] noop\n  2013-03-19 16:39:37.520 MangaChat[3050:907] onData <!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\">\n  <html>\n  <head>\n   <meta http-equiv=\"content-type\" content=\"text/html; charset=ISO-8859-1\">\n   <style type=\"text/css\">\n  html, body, iframe { margin: 0; padding: 0; height: 100%; }\n  iframe { display: block; width: 100%; border: none; }\n   </style>\n   <title>Application Error</title></head>\n   </head>\n   <body>\n   <iframe src=\"//s3.amazonaws.com/heroku_pages/error.html\">\n   <p>Application Error</p>\n   </iframe>\n   </body>\n   </html>\n   2013-03-19 16:39:37.522 MangaChat[3050:907] start/reset timeout\n   2013-03-19 16:39:37.523 MangaChat[3050:907] ERROR: data that has arrived wasn't valid\n   2013-03-19 16:39:40.905 MangaChat[3050:907] onData 7:::1+0\n   2013-03-19 16:39:40.906 MangaChat[3050:907] start/reset timeout\n   2013-03-19 16:39:40.907 MangaChat[3050:907] error 1+0\n   2013-03-19 16:39:41.618 MangaChat[3050:907] onData 7:::1+0\n   2013-03-19 16:39:41.619 MangaChat[3050:907] start/reset timeout\n   2013-03-19 16:39:41.620 MangaChat[3050:907] error 1+0\n......repeating forever....\nNote:And then when the client went crazy like this, the restarted server is printing out this \"warn: client not handshaken client should reconnect\" repetitively..\nWhat is wrong here?\n. anyone?\n. found the reason. manually hacked the library to listen for the 1+0, then we reset the socket and throw the error delegate.\n. Hi\nActually when server restart, the previously connected clients are still\nconnecting to server using old connections and the server didnt recognise\nthem anymore.\nAt this moment, the server is actually sending a data packet to these\nclients\n\"1+0\"\nYou will be able to catch these data repetitively on the clients and it\nmeans the Server is telling us to disconnect and reconnect.\nSo I modified the client library so that when it sees 1+0 in the data, it\nwill throw an error and our client code should then gracefully disconnect\nand reconnect to the server again.\nThis has been working for me.\nTerrence\nOn 7 Apr, 2013, at 1:35 PM, heroicman84 notifications@github.com wrote:\n@magickaito https://github.com/magickaito\nCan you please tell me how to fix it?\n—\nReply to this email directly or view it on\nGitHubhttps://github.com/pkyeck/socket.IO-objc/issues/87#issuecomment-16009867\n.\n. Btw\nI have a forked version here:\nhttps://github.com/magickaito/socket.IO-objc/commits/master\nTerrence\nOn 7 Apr, 2013, at 1:35 PM, heroicman84 notifications@github.com wrote:\n@magickaito https://github.com/magickaito\nCan you please tell me how to fix it?\n—\nReply to this email directly or view it on\nGitHubhttps://github.com/pkyeck/socket.IO-objc/issues/87#issuecomment-16009867\n.\n. I was informed that this question is duplicate with https://github.com/pkyeck/socket.IO-objc/issues/65\n. ",
    "MobDeveloper": "facing the similar issue :\nBelow is the detail:\nServer Log:\ndebug - client authorized\ninfo - handshake authorized 16734788022033017528\ndebug - setting request GET /socket.io/1/websocket/16734788022033017528\ndebug - set heartbeat interval for client 16734788022033017528\nwarn - websocket connection invalid\ninfo - transport end\ndebug - set close timeout for client 16734788022033017528\ndebug - cleared close timeout for client 16734788022033017528\ndebug - cleared heartbeat interval for client 16734788022033017528\ndebug - client authorized for\nWhile error on xcode Log :\ndidReceiveResponse() 200\nconnectionDidFinishLoading() 16734788022033017528:15:25:websocket,htmlfile,xhr-polling,jsonp-polling\nsid: 16734788022033017528\nheartbeatTimeout: 22.000000\ntransports: (\nwebsocket,\nhtmlfile,\n\"xhr-polling\",\n\"jsonp-polling\"\n)\nwebsocket supported -> using it now\nonDisconnect()\ndisconnectedWithError : Error Domain=SocketIOError Code=-4 \"The operation couldn’t be completed. (SocketIOError error -4.)\"\n. even removing this line dosn't make any difference .\nis this because i'm using port 8000?\n. ",
    "nikunjpatel143": "Hey \ntry to remove this commented line in \"/ SocketTesterARC / ViewController.m\"\nsocketIO.useSecure = YES;\nits work for me.....\n. Not necessary, but yes u can switch your port to 8080 and test.\nThe best way is to open new request ..... with this issue\n. Also check the security configuration on server side.\n. ",
    "yapiskan": "I tried on both socket.io v.0.9.10 and v 0.9.13 both returns the same result. I guess on xhr calls socket.io returns the data by joining multiple events/messages/jsons which this version does not support.\n. i guess also this is a related issue.\nhttps://github.com/LearnBoost/socket.io/issues/816\n. ",
    "fforres": "You can put them inside a json and send the json as the only argument :)\n. ",
    "heroicman84": "@magickaito \nCan you please tell me how you fix it?\n. ",
    "cthomaschase": "Hi. I've been trying solve an issue I'm seeing on the server where i get a bunch of \"warn: client not handshaken client should reconnect\" logs. I also see the client not connecting to the server, even though no connection errors are being triggered. I'm wondering if this is the same issue I was having. Did the reset function work for you?\n. I have a similar issue, but it does it for me even when on WIFI.\nI've noticed that if my server is slow to respond to a websocket connection, once successful, I'm not receiving the connection data. I'll receive the normal heartbeat data \"2::\" but not \"1::\".\n. ",
    "objectiveSee": "To explain further: I have an object (EAServer) which allocs a SocketIO in init. When the SocketIO is released in EAServer's dealloc method (via ARC) then the last reference to the SocketIO object is released. SRWebSocket still has a weak reference to the SocketIO object so the next message sent to it causes the crash. \nI guess I have an architecture bug, but can somebody recommend to me a better design for my EAServer object?\nHere is the source for EAServer.m: https://gist.github.com/anonymous/5210904\nSide note: The timer inside of setTimeout was actually the last reference to SocketIO object so calling invalidate on the timer was releasing the last reference. \n. You should not make multiple connections. Use the same connection by having an object that manages the connection for you. You can pass that object between view controllers, or make it a singleton like we did. \nRegarding backgrounding, we start a background task when the app enters the background. We keep the connection open until the background task will expire  about 10 minutes, but use the expiration handler for the task) and then we allow the backup task to end and the socket would disconnect. This greatly improves the amount of time that your socket is connected, and most of the time that the user returns to the app they will already be connected. \n—\nSent from Mailbox for iPhone\nOn Wed, Jan 8, 2014 at 9:57 PM, Maziyar Panahi notifications@github.com\nwrote:\n\nHi, I'm on iOS 7 in a development stage. I find it useful to observe app states like DidEnterBackgroud or DidBecomeActive. I disconnect if it goes to background and connect again when it becomes active. It can be even simply going out of the app by pressing home button. When they back to app the app sends UIApplicationDidBecomeActiveNotification and I connect them again.\nI really wanna stop people of connecting and disconnecting because it puts a pressure on a server but for now I found this way the most stable way to make sure users can aways connect. \nOne question regarding connectToHost and disconnect, how do you manage your connections between different viewControllers? Do you connect to the host in each view Controller to get the data or you just connect once and just send event in each viewController to get the data in that channel?\nI have few ViewControllers and each have their own data and if I connect in each view that means one user has 4 connections to my server! \nThanks\nReply to this email directly or view it on GitHub:\nhttps://github.com/pkyeck/socket.IO-objc/issues/123#issuecomment-31898705\n. Yes, our singleton will parse each event in didReceiveEvent (as well\nas didReceiveJSON:) and then update some value in the singleton, and then\npost a NSNotification. The view controllers listen to this notification and\ncan then check the values that we saved.\n\nOn Wed, Jan 8, 2014 at 11:02 PM, Maziyar Panahi notifications@github.comwrote:\n\nThat's what I thought. So the object it is.\nOne more question, do you have 'socket didReceiveEvent' in your object and\nyou send the data to your viewControllers right away from there? I was\nthinking to send the name of the event and other info from viewController\nto my object and from there I use socketIO sendEvent to start the stream\nand get what I need in that viewController and do the same with other views.\nThat was pretty good advice, thanks I really appreciate it.\n—\nReply to this email directly or view it on GitHubhttps://github.com/pkyeck/socket.IO-objc/issues/123#issuecomment-31901124\n.\n. \n",
    "marcomonteiro": "I'm running up against this problem too.  I've been digging through the SocketIO and SocketRocket code for a few hours.  A quick note, changing the delegate property from unsafe_unretained to weak in SocketIOTransportWebsocket.h will stop the crash because when the SocketIO object is deallocated it'll automatically become a nil reference for the transport.  \nFrom what I can tell the crash is caused because the transport receives data AFTER the SocketIO object is deallocated and it tries to call onData, which in turn tries to set a timer, which will try to retain the SocketIO object ---> but it's deallocated by this point and therefore there's a crash.\nThis is just a temporary workaround as the real problem is that the SocketIOTransportWebsocket is over-retained somehow and ultimately the SocketRocket object isn't being released either.  This will leak I'm sure, but I don't have time to resolve it alone.  If anyone comes up with anything let us know.\n. Just noticed that if you want until you've received the - (void) socketIODidDisconnect:(SocketIO )socket disconnectedWithError:(NSError )error before releasing or nil'ing your SocketIO object this crash is also avoided.  Not ideal but a better work around and enough for my needs right now.  Hope that helps.\n. @jlukanta What words did I miss.  That's a delegate method.  Wait until the SocketIO calls that method before releasing the SocketIO object and you wont see this crash.  Moot point though as the problem runs deeper than that.  I've switched to AZSocketIO in the meantime.\n. ",
    "jlukanta": "@marcomonteiro Your first sentence (of the second post) seems to miss a couple of words. I have a hard time understanding you. Can you explain what should we do again?\n. Thanks. I may have found a fix for this (un-tested). Add these in [SocketIO dealloc] just before _transport = nil:\n_transport.delegate = nil;\nif (_isConnected || _isConnecting)\n{\n    [_transport close];\n}\nWhen your socketIO object was deallocated, SRWebSocket still has pending calls for SocketIO's _transport object. The _transport object notifies the now deallocated SocketIO, and crashes the program.\n. ",
    "wtimme": "Hey pkyeck, thanks for your response and your time and effort with this interface!\nSure, if your server does not send the heartbeat in time the connection will get closed a lot which can be really annoying. The Socket.IO protocol states that the server configures the heartbeat timeout. Maybe it would be good to add a hint for this modification to the interface's documentation?\n. Thanks for your addition. Rather than explaining this in the code I'd go for an more open and transparent approach by making this information available in the interface's documentation. After all and strictly speaking, modifying the heartbeat timeout on client-side results in the interface not behaving as intended by the Socket.IO developers. One might better try to increase the heartbeat timeout on server-side. What do you think?\n. Currently I am developing an application that allows for real-time communication between different devices (e. g. iOS device, Android devices and browser). The way I know it is that the server communicates the conditions of the connection during the first response (see the comment on the server's response). I completely removed the 7 seconds from the interface and it works just as expected. Maybe it's your server's configuration? Have you tried establishing a connection directly, e. g. when on the same network?\nWhen using my application on the go (e. g. on the sub) it sometimes does not receive the heartbeat on time, but that is due to my bad reception. It's annoying, but in my opinion the interface should not compensate a bad connection.\n. Well, for an application that really depends on the time (e .g. some time-based multiplayer game) the 7 seconds will cause problems. One can of course search the source and remove the line themselves. I just wanted to point out that this might cause some headache. Thanks again for your work, I really appreciate it.\n. ",
    "RevCBH": "bump\n. ",
    "l0c0luke": "on the device that is creating the invalid connection, goto http://websocketstest.com/ and see what comes up. I was trying o use port 80 and found that ATT customers here inthe states could not accept websockets on port 80.\n. ",
    "hboylan": "@prajapatimoti Same here. You figure this out?\n. ",
    "vandutran": "Same here. It connects, handshake, then onDisconnect() is called. I don't get the \n\"disconnectedWithError : Error Domain=SocketIOError Code=-4 \"The operation couldn’t be completed. (SocketIOError error -4.)\" \nin my log tho.\nEDIT: It works not, I reject WebSocket and used Long Polling. I think it's because the iPhone simulator was not over wifi but was on iPhone hotspot so it doesn't work with WebSocket?\n. Have you tried not using WebSocket and use Long Polling instead? I commented out the if statement for WebSocket and has the Long Polling as the first option.\n. In xcode search for the string \"using it now\" in the project codes. It'll bring you to the code:\n```\n    // get transports\n    NSString t = [data objectAtIndex:3];\n    NSArray transports = [t componentsSeparatedByString:@\",\"];\n    DEBUGLOG(@\"transports: %@\", transports);\n/*if ([transports indexOfObject:@\"websocket\"] != NSNotFound) {\n    DEBUGLOG(@\"websocket supported -> using it now\");\n    _transport = [[SocketIOTransportWebsocket alloc] initWithDelegate:self];\n}\nelse*/ if ([transports indexOfObject:@\"xhr-polling\"] != NSNotFound) {\n    DEBUGLOG(@\"xhr polling supported -> using it now\");\n    _transport = [[SocketIOTransportXHR alloc] initWithDelegate:self];\n}\nelse {\n    DEBUGLOG(@\"no transport found that is supported :( -> fail\");\n    connectionFailed = true;\n    error = [NSError errorWithDomain:SocketIOError\n                                code:SocketIOTransportsNotSupported\n                            userInfo:nil];\n}\n\n}\n```\n. ",
    "kevinvavelin": "I've got the same issue, I just implemented a server-side socket for Facebook and I get this error after my log to Facebook. \n. No idea here ? I get this error in random way now :/ I don't know how this happened. How can I avoid this error ? I run socket.io on my device so I don't think this is a problem with the simulator...\n. And how you did that ? I searched but never found :/ I think that my problem comes from the Facebook token who is really too long for the socket so I decided to not send it in the same event and send it with another event. It's really bad but I don't have my socket closed like that :)\n. Done but now, I don't have what I'm supposed to get from my socket. Now I get my html instead of my socket. To prevent deconnexion from Facebook connexion, I used sendEvent:withData:andAcknowledge: method, and with long polling I get a serie of error, start/reset message in log. I don't know what to do actually. Why this websocket closed so suddenly ?\nEdit: Deconnexion appears even if I used sendEvent:withData:andAcknowledge: , I use the socket on my website so it works really great. I can't understand why I get a deconnexion here :/\n. With more investigation it looks like the problem comes from SRWebSocket where NSInputStream get NSStreamEventEndEncountered without any reason, or I don't understand the function _innerPumpScanner, it looks good but how we reach the end of NSInputStream if the connection is not close ?\n. ",
    "mcastilho": "Any luck figuring this one out ?\n. ",
    "entire": "I'm getting this same exact issue. Connection, handshake, then onDisconnect and SocketIOError -4. Also, it happens randomly. Weirdly, sometimes it works, and sometimes it doesn't and I have absolutely no idea why. \nAnyone else have any idea why this isn't working? \n. ",
    "Sophally": "Does anyone get it working? I've got the same error and normally it happens when we connect to internet via a Captive Portal. The long-polling technique isn't working as expected for me. \n. I've got my problem solved by just changing the port to 443. It seems that there are firewall or anti-virus eats my packet on port 80. The port itself is not closed but the packet from websocket cannot bypass this port.\n. ",
    "swapnilmishra-globussoft": "I am getting same error. After connecting to host it gets disconnected. Anyone got this working? or any alternative to SocketTesterARC??\n. Did you find the solution?\n. ",
    "mamaral": "Any updates to this? Same exact issue on my end.\n. Slight progress, not sure how relevant it is:\nLooking at line 757 of SocketIO.m:\nif (webSocketTransportClass != nil && [transports indexOfObject:@\"websocket\"] != NSNotFound) {\nI noticed that if I printed out transports, my array of transports included the [\"websocket\"] rather than \"websocket\". I changed that line of code to match what I have below, and I seem to be at least making progress to where I was previously. Will share more if I find anything else out.\nif (webSocketTransportClass != nil && [transports indexOfObject:@\"[\\\"websocket\\\"]\"] != NSNotFound) {\n. The information appears to not be either formatted or parsed correctly:\nIn SocketIO.m:\nDEBUGLOG(@\"connectionDidFinishLoading() %@\", responseString);\nNSArray *data = [responseString componentsSeparatedByString:@\":\"];\nresponseString is: 97:0{\"sid\":\"xxxxxxxxxxxxxxxxxxxx\",\"upgrades\":[\"websocket\"],\"pingInterval\":25000,\"pingTimeout\":60000}\nAnd data is\n(\n97,\n0{\"sid\",\n\"CVmcruBxFAgpV3pMAAAA\",\"upgrades\",\n[\"websocket\"],\"pingInterval\",\n25000,\"pingTimeout\",\n60000}\n)\nThat seems wrong to me, but I'm definitely no expert...  Shortly after that code we grab the _heartbeatTimeout, which when you take the above mangled array ends up as 0{\"sid\", which is obviously formatted wrong and thus connectionFailed is true:\n_heartbeatTimeout = [[data objectAtIndex:1] floatValue];\n if (_heartbeatTimeout == 0.0) {\n    // couldn't find float value -> fail\n    connectionFailed = true;\n}\n..and then a few lines below that when it tries to parse the transports it gets that all wrong..\nCould some of this be due to the implementation here: https://github.com/pkyeck/socket.IO-objc/blob/master/SocketIO.m#L706 ?\n. Same issue here, any resolution?\n. ",
    "crashbell": "I changed method\nobj-c\n- (void) sendEvent:(NSString *)eventName withData:(id)data andAcknowledge:(SocketIOCallback)function\nto:\n``` obj-c\n- (void) sendEvent:(NSString )eventName withData:(NSArray)data andAcknowledge:(SocketIOCallback)function\n{\n    NSMutableDictionary *dict = [NSMutableDictionary dictionaryWithObject:eventName forKey:@\"name\"];\n// do not require arguments\nif (data != nil) {\n    [dict setObject:data forKey:@\"args\"];\n}\n\nSocketIOPacket *packet = [[SocketIOPacket alloc] initWithType:@\"event\"];\npacket.data = [SocketIOJSONSerialization JSONStringFromObject:dict error:nil];\npacket.pId = [self addAcknowledge:function];\nif (function) {\n    packet.ack = @\"data\";\n}\n[self send:packet];\n\n}\n```\nAnd it worked with \nobj-c\n[socketIO sendEvent:@\"event_name\" withData:@[@\"param1\", @\"param2\"]];\n. ",
    "icykey": "Yes, the above change will work.\nCan we consider merge this change in? thanks.\n. ",
    "mattstone": "worked for me.. also should..\n- (void) sendEvent:(NSString *)eventName withData:(id)data {\nalso be changed to..\n- (void) sendEvent:(NSString )eventName withData:(NSArray )data {\nas well?\n. Thanks for the effort in explaining this - really appreciate it.\n. ",
    "shekhei": "seems like under the connection errors, apple has a lot of different error codes...\nkCFURLErrorUnknown   = -998,\n   kCFURLErrorCancelled = -999,\n   kCFURLErrorBadURL    = -1000,\n   kCFURLErrorTimedOut  = -1001,\n   kCFURLErrorUnsupportedURL = -1002,\n   kCFURLErrorCannotFindHost = -1003,\n   kCFURLErrorCannotConnectToHost    = -1004,\n   kCFURLErrorNetworkConnectionLost  = -1005,\n   kCFURLErrorDNSLookupFailed        = -1006,\n   kCFURLErrorHTTPTooManyRedirects   = -1007,\n   kCFURLErrorResourceUnavailable    = -1008,\n   kCFURLErrorNotConnectedToInternet = -1009,\n   kCFURLErrorRedirectToNonExistentLocation = -1010,\n   kCFURLErrorBadServerResponse             = -1011,\n   kCFURLErrorUserCancelledAuthentication   = -1012,\n   kCFURLErrorUserAuthenticationRequired    = -1013,\n   kCFURLErrorZeroByteResource        = -1014,\n   kCFURLErrorCannotDecodeRawData     = -1015,\n   kCFURLErrorCannotDecodeContentData = -1016,\n   kCFURLErrorCannotParseResponse     = -1017,\n   kCFURLErrorInternationalRoamingOff = -1018,\n   kCFURLErrorCallIsActive               = -1019,\n   kCFURLErrorDataNotAllowed             = -1020,\n   kCFURLErrorRequestBodyStreamExhausted = -1021,\n   kCFURLErrorFileDoesNotExist           = -1100,\n   kCFURLErrorFileIsDirectory            = -1101,\n   kCFURLErrorNoPermissionsToReadFile    = -1102,\n   kCFURLErrorDataLengthExceedsMaximum   = -1103,\n. well i suppose that can be done too, but that wouldnt be a very accurate representation of the true error wouldnt it? And this is a very general error, that is triggered by NSURLConnection. Of course, arguable since the only thing NSURLConnection is doing currently is for handshake?\nI actually forked and implemented something similar to what I suggested and it seems to work, so what is your call for this? Since i think this really does cause certain problems in the long run, like for my case, if handshake failed I unauthenticate the app and if it cannot be reached it will just run offline mode\nEdit: I meant if this is not fixed it can e a problem for some people in the long run\n. ",
    "apdarshan": "I got it by issue #66 ,\nI Should import SocketIOPacket,\nimport \"SocketIOPacket.h\"\nThanks pkyeck\n. ",
    "pkc456": "Thanks apdarshan\n. ",
    "antonholmquist": "I figured this issue could happen under these circumstances:\n1 The _timeout timer is currently running and retaining the SocketIO-object.\n2. The owner of the SocketIO-object no longer needs it and releases it.\n3. The timer is now the sole owner of the SocketIO-object, and when it is invalidated on line 372, the SocketIO-object is deallocated, and hence, referencing the _timeout variable results in a bad access.\n. One interesting observation it that it crashes on a background thread.\nsetTimeout is not thread safe. @pkyeck, does the rest of this library take into account that SocketRocket data callbacks  apparently arrive on a background thread?\n. According to SocketRocket, the default queue to receive delegate callbacks is the main queue. This makes me wonder why your callbacks somehow end up on a background queue.\nhttps://github.com/square/SocketRocket/blob/master/SocketRocket/SRWebSocket.h#L56-59\n. Okay. Yes, SocketRocket supports background queues, but this library isn't compatible with it since it expects the callbacks to come on the main thread. I realise my comment above was somewhat ambiguous and edited it now.\n. @chadbag, did you try dispatching to a background queue after you received the data from the SocketIO delegate? It would be interesting for you to know where the actual bottleneck on the main thread is. Is it your own data processing, or is it in the internal workings of the SocketIO onData:method.\n. ",
    "psineur": "Yep. My crashes were from timer. \nLooks like #89 is exactly the same issue\nÎòïðàâëåíî ñ iPhone\n18.06.2013, â 0:51, Eric Chen notifications@github.com íàïèñàë(à):\n\nDoes this fix #89 ? Hope these fixes get merged soon! @pkyeck Thanks.\n—\nReply to this email directly or view it on GitHub.\n. wow, it's declared in BlocksKit, my bad - didn't check this in standalone project\nLooks like it's not needed then\n. Instead of _handshake.delegate = nil it's better to do [_handshake cancel] then\n. \n",
    "masterkain": "I'm afflicted by this as well, +1\npossibly will fix also #104 which does contain another solution for this.\n. ",
    "Nalum": "I'm seeing this behavior also.\nIn the console output I'm getting the following:\ninfo  - handshake authorized 3OVZct2cHa8Ye0N1Uaf4\n   debug - setting request GET /socket.io/1/websocket/3OVZct2cHa8Ye0N1Uaf4\n   debug - set heartbeat interval for client 3OVZct2cHa8Ye0N1Uaf4\nBut not getting the console.log message that I have setup for all connections. There also doesn't seem to be any sending or receive of messages between the iOS client and the node.js socket.io server.\n. ",
    "richo": "Yeah, I've given up on this since. I just used raw sockets and my life got a lot easier.\n. ",
    "elwerene": "Compile a test with debugging enabled and one for archive (RELEASE build). The binary built for archive should not output socket.io debug messages\n. ",
    "pbihler": "How is your \"time\" value transmitted in the handshake URL? Did you miss to include it in line 140?\n. shouldn't you replace rand() by time?\n. ",
    "scottaj": "Is there a reason this hasn't been updated per @pbihler's comment and merged? I just hit the same bug and this code fixes it for me, I would love to see this get into master.\n. ",
    "freak4pc": "Check your Target's Build Phases and make sure all files exist and aren't marked as red or have duplicate entires. \n. @EliasNaranjeeSani You probably forgot to Install SocketRocket like the README says. \nhttps://github.com/square/SocketRocket#installing-ios\n. Its not my tool, I'm just trying to help out. \nPlease read the README for any app you're trying to Install. \nAs the README clearly states dependencies are SocketRocket and json-framework/jsonkit (optional). \n. @aholzer Which version os iOS are we talking about? I'm guessing less then iOS 5 ... otherwise it would use NSJSONSerialization and not fall to JSONKit... \nDo you even have JSONKit enabled there? \n. Hey @mitsBhadeshiya  ... this isn't really an issue with the library, its more a support request... \nTry not to open support requests in the Issues section - That's what Stackoverflow is for.\nI think the example code is enough to get started : https://github.com/pkyeck/socket.IO-objc/blob/master/SocketTesterARC/ViewController.m\n. ",
    "ElyasNaranjeeSani": "@freak4pc : I found some files red in compile sources and I can't add them to the list because they don't exist in project folder : like base64.c and more files! \n. @freak4pc : I didn't add your tool in my project yet. I just downloaded your project zip file and tried to build your sample code. Does it need any installation too?\n. @freak4pc : Your are right. Big thanks for your helps.\n. Socket 1.x support would be great.:+1:\n. ",
    "tybro0103": "I'm hosting on Heroku so I have to use long polling, and I ran into the same issue. I think your fix is as clean as it can be without significantly modifying things.\nI wanted to automatically reconnect in this situation so I added this to SocketIO.m:\nObjective-C\n-(void) reconnect {\n    [self connectToHost:self.host onPort:self.port];\n}\nand call it after disconnectForced:\nObjective-C\nif([packet.data isEqualToString:@\"1+0\"]) {\n    [self disconnectForced];\n    [self reconnect];\n}\n. hah, I just ran into this as well... silly mistake\n@pkyeck please fix!\n. ",
    "p1nt0z": "https://github.com/monder/socket.IO-objc has forked similar function but i want to know NSTimer is good option for this ? i want your suggestion Multiple  Timer Function may effect performance, even if we invalidate is on ack timeout and ack received events ?\n. ",
    "Elshad": "change \nNSMutableDictionary errorInfo = [NSDictionary dictionaryWithObject:error forKey:NSLocalizedDescriptionKey];\nto\nNSMutableDictionary errorInfo = [[NSDictionary dictionaryWithObject:error forKey:NSLocalizedDescriptionKey] mutableCopy];\n. ",
    "aholzer": "@freak4pc the app is iOS 7 ready and compatible back to iOS 6.1\n. ",
    "nullco": "Same problem here, did it pass the apple review for you? @ngzhongcai \n. ",
    "dmanrke": "i have same issue . any solution ?\n. ",
    "sneakyness": ":+1: \n. IIRC, SBJson used to be much faster with large, repetitive JSON structures, but I haven't been able to find any recent benchmarks. \n. ",
    "igrampe": "I think there is no sense to keep SBJSON\n. ",
    "jasonsilberman": "+1, there is no reason to keep SBJSON\n. ",
    "refaelos": ":+1: \nIs this going to be in the next version?\n. ",
    "mustafaibrahim989": "Thank you, i have updated to the latest version and it is worked fine now \n. ",
    "chadbag": "That is my \"fault.\"  We are passing large blocks of data and doing the onData: on the main thread disrupts the UI.  I modified SocketRocket to set the _delegateDispatchQueue to be a queue I created so that the data came in on a different thread.  I asked about it in the SocketRocket \"issues\" section on github and no one said anything and it seems to work most of the time. This timeout crash did not start happening right away and does not happen most of the time so I thought I was good to go.\nMaybe forcing the stuff that gets called back into using _delegateDispatchQueue in SocketRocket, that needs to be run on the main thread, back on to the main thread would work.\nIdeally we would not care about the SocketRocket implementation (in an ideal world).\n. @antonholmquist   SocketRocket comments in the section you refer to mention that the default is the main queue.  It does not indicate, to me, that it has to be the main queue, rather, that is just the default.   \nFrom the public header: \n// Delegate queue will be dispatch_main_queue by default.\n// You cannot set both OperationQueue and dispatch_queue.\n- (void)setDelegateOperationQueue:(NSOperationQueue*) queue;\n- (void)setDelegateDispatchQueue:(dispatch_queue_t) queue;\n. @antonholmquist Got ya.  I am looking into adjusting it for me to make it work.  I'll see about a more generic fix to the library sometime later, once the work deadlines I am on with my project are passed and I can spend some time on learning the internals of socket.IO-objc.  Seeing what needs to be done to either make it threadsafe or force the parts that need to be to run on the main thread/in the main queue.\n. @antonholmquist It has been a couple weeks, but IIRC, I tried what you suggested first.  Ie, just put my handling into a background queue.  That helped, but did not solve the UI responsiveness issues.  The issue is that the data being passed can be pretty large (being modified this week to be somewhat smaller by streaming chunks instead of the whole data at once [base64 encoded images]).  So the actual receipt of the data and whatever was being done with it before I got it had an effect on responsiveness.  It has been a couple weeks so the details escape me at the moment.  But I dug in and figured out how this worked underneath and set the SR delegate queue to be non main and that helped even more.    And since I did not get the setTimeout crash here reliably, it seemed to be a good solution.   Obviously, there was some subtle stuff that I missed that cropped up, hence this thread.\nI am testing some @synchronized blocks around the timeout stuff in socketIO-objc to see if that helps. We'll see what happens in the next week with that.\n. ",
    "jonathanpdiaz": "This looks like an auth problem. check this http://howtonode.org/socket-io-auth. And, check how to add the cookies from connect to the handshake. That might solve the problem.\nTo make a quick test, I would recommend you to setup the auth function to return true.\nGood luck.\n. ",
    "svenroy": "Hmmmmm.....thank you very much @jonathanpdiaz. Just before your answer I downloaded a little demo from https://github.com/saturngod/Socket.io-with-iOS. Just like you said its the auth and the cookieParser/session secret combo are giving me issues. I'd do as you say but for now I'd just use that guy's code. Thanks :)\n. ",
    "fattalgazi": "thank you, great work, but you forgot to say:\nin delegate class add this:\n-(void)socketIORequireReconnect:(SocketIO*)ula\n{\n    [ula connectToHost:@\"host\" onPort:@\"port\"];\n    NSLog(@\"connection is in disconnected status, trying to reconnect.\");\n}\n. ",
    "ibru": "I am relatively new to CocoaPods, but it seems to me that people are submitting pull request to CocoaPods when they release new version of their library. Probably it does not happen automatically any more.\nhttps://github.com/CocoaPods/Specs/issues\n. thank you\n. ",
    "njunghans": "Thanks a lot for the reply.\nimport  worked ;)\nseems like you need to write \\< > on github\n. Ok, i was completely wrong. This has nothing to do with threads.\nI am actually receiving this error because i am using a custom resourceName, and in SocketIOTransportWebsocket and SocketIOTransportXHR there is no custom resourceName possible. Causing the disconnect without error.\n. Thanks a lot,\nI would suggest to implement it in the @protocol SocketIOTransportDelegate  next to host,port and sid ;)\nI still have a question for my NSCondition problem though.\n```\n-(OperationResult *)OpenConnection{\n[socketIOClient setUseSecure:NO];\n\n[socketIOClient setResourceName:@\"NotificationService/socket.io\"];\n\n[socketIOClient connectToHost:[configuration.ServiceBaseAddress host] onPort:port];\n\nif([openResetEvent waitForSignal:((NSInteger)configuration.ServiceRequestTimeoutInMilliseconds/1000)]){\n    [self ForceCloseConnection];\n    OperationResult* res=[[OperationResult alloc] init];\n    res.ErrorCode=OperationResultCodeServiceNotReachable;\n    res.ErrorMessage=@\"Could not open Connection. Reached timeout.\";\n    return res;\n}\nConnectionStateType=ConnectionStateTypeConnected;\nreturn [[OperationResult alloc] initWithResult:nil];\n\n}\n-(void)socketIODidConnect:(SocketIO *)socket{\n       [openResetEvent signal];\n   }\n```\nI want to wait until the event is fired in the connection method, but the thread is locked and the client can only connect after the NSCondition timed out.\n(openResetEvent is my NSCondition handler)\nDo you have an idea to overcome this ?\nThanks a lot !\n. ",
    "nunofgs": "If you use Cocoapods, there are no changes required. To that end, I've created a pull request on the Cocoapods Specs repo to add support for OS X. I hope that wasn't out of line.\n@pkyeck, can you include OS X support for further versions of the podspec?\n. It seems your commit was reverted. It was discussed here.\nJust commenting in case you were not yet aware.\n. Also, please add support for OS X as discussed here. It would be one less PR to the Specs repo :)\n. ",
    "SamB2B": "How do you install using CocoaPods?\n. This is very strange, there are no warnings in the SocketRocket submodule in the Github repo but as soon as I copy them over there is the same warning?\nWould installing with CocoaPods help at all?\nIf yes then could someone please help me that I don't know where to start\n. ",
    "FilipLukac": "My bad, sorry, I wrongly implemented code, close this issue. thx\n. ",
    "nkalkounis": "@SamB2B \n1. Install CocoaPods - http://cocoapods.org/\n2. Create a file 'Podfile' in your apps root dir contents should be:\nplatform :ios,  '5.0'\npod 'socket.IO',        '~> 0.5'\n1. run 'pod install'\n2. open your app with open appname.xcworkspace\n3. include the dependencies in your app \n. +1, need support for v1.0\n. ",
    "naveenkumard": "Can you guys tell me the disconnection issue is fixed in latest version? It is little bit urgent for us to fix this issue in our app. Please do the needful.\nThanks.\n. Ok thanks for your inputs, Now I start using the latest version and give a try.\n. ",
    "nikkis": "Thanks mattstone! This seems to fix the problem with args.\n. ",
    "gisxy": "thanks\n\n祝：工作顺利\n行业技术部  宋向阳\n分享地理价值\nESRI中国信息技术有限公司西安分公司\n地 址：西安市高新区科技路48号创业广场B座F层 1404A \n邮 编：710075\n电 话：029-8669 8900-119\n传 真：029-8669 8900-122\nEmail：lizt@esrichina.com.cn\n公司网址：www.esrichina.com.cn\nArcGIS资源中心：http://resources.arcgis.com/zh-cn\nAt 2014-03-22 21:45:12,g8production notifications@github.com wrote:\nHi,\nI have created the SocketIO.framework (for iOS 5 and later, with arm64 support).\nAdded bundle target\nAdded aggregate target\nUpdated Readme.m\nThank you.\nDaniele.\nYou can merge this Pull Request by running\n  git pull https://github.com/gali8/socket.IO-objc master\nOr view, comment on, or merge it at:\nhttps://github.com/pkyeck/socket.IO-objc/pull/160\nCommit Summary\nsocket.io framework iOS5 and arm64 ready\nreadme update\nreadme update\npush framework\nFile Changes\nAProducts/SocketIO.framework/Headers (1)\nAProducts/SocketIO.framework/Resources (1)\nAProducts/SocketIO.framework/SocketIO (1)\nAProducts/SocketIO.framework/Versions/A/Headers/NSData+SRB64Additions.h (24)\nAProducts/SocketIO.framework/Versions/A/Headers/SRWebSocket.h (114)\nAProducts/SocketIO.framework/Versions/A/Headers/SocketIO.h (121)\nAProducts/SocketIO.framework/Versions/A/Headers/SocketIOJSONSerialization.h (28)\nAProducts/SocketIO.framework/Versions/A/Headers/SocketIOPacket.h (49)\nAProducts/SocketIO.framework/Versions/A/Headers/SocketIOTransport.h (47)\nAProducts/SocketIO.framework/Versions/A/Headers/SocketIOTransportWebsocket.h (33)\nAProducts/SocketIO.framework/Versions/A/Headers/SocketIOTransportXHR.h (36)\nAProducts/SocketIO.framework/Versions/A/Headers/SocketRocket-Prefix.pch (27)\nAProducts/SocketIO.framework/Versions/A/Headers/base64.h (34)\nAProducts/SocketIO.framework/Versions/A/Resources/Info.plist (0)\nAProducts/SocketIO.framework/Versions/A/Resources/en.lproj/InfoPlist.strings (0)\nAProducts/SocketIO.framework/Versions/A/SocketIO (0)\nAProducts/SocketIO.framework/Versions/Current (1)\nMREADME.md (18)\nMSocketIO.h (1)\nASocketIO/SocketIO-Info.plist (46)\nASocketIO/SocketIO-Prefix.pch (8)\nASocketIO/en.lproj/InfoPlist.strings (2)\nMSocketTesterARC.xcodeproj/project.pbxproj (306)\nPatch Links:\nhttps://github.com/pkyeck/socket.IO-objc/pull/160.patch\nhttps://github.com/pkyeck/socket.IO-objc/pull/160.diff\n—\nReply to this email directly or view it on GitHub.\n. ",
    "yosuke-furukawa": "Can we connect socket.io server@v1.0  using master brunch?\nI need not to use new features (like binary support), however, socket.io v0.9.16 has problems (like memory leaks)...\nSO we would like to upgrade socket.io servers to v1.0.\nIf you don't have time to support v1.0, I would like to check your work in progress branch.\n. ",
    "notedit": "+1,  socket.io v1.0  looks cool.\n. ",
    "koenbud": "I agree, support for socket.io 1.0 would be awesome :+1: \n. @pkyeck The people +1'ing are not pressuring you to do it, they are just expressing the need for an update. Developers looking to do something worthwhile might pick up on it and start committing new code.\n. ",
    "alexpiezo": "+1\n. ",
    "mkny": "I've tried to implement just the Handshake Url's but didnt work well.. Hope you got some time to work it out @pkyeck \n. ",
    "Micka33": "We are thousands to hope for it, but it seems that few of us are able to get it done...\n. ",
    "sweinertjr": "+1 - 1.0+ support would be great. It is much smoother than previous versions.\n. Agreed - this is awesome. Thank you.\n. ",
    "ctlacko": "It seems that they've offloaded the transports and browser incompatibilities into a separate module.\nHere's a link to the new protocol definition:\nhttps://github.com/automattic/engine.io-protocol\nAnd the corresponding blog post:\nhttp://socket.io/blog/introducing-socket-io-1-0/#new-engine\n. ",
    "mehtatejas": "+1 - 1.0+ support would be great. It is much smoother than previous versions.\n. ",
    "tslater": "+1\nAlso, @sweinertjr! Sup!\n. ",
    "rauberdaniel": "I also would love to see 1.0+ support. Thanks for your work, @pkyeck!\nDoes anyone know if it’s possible / easy to port everything to swift, so that it’s not necessary to use the Obj-C bridge?\n. ",
    "jklinson": "Waiting for 1.0 support and also for swift support. :+1: \n. ",
    "TofPlay": "@jklinson: Waiting for 1.0 support and also for swift support. :+1:\nMe too :+1: \n. Found it must add the library: libicucore.dylib\n. ",
    "mounibec": "It'll be really great to have support for 1.x.\n. There is no support for socket.io v1.0, take a look at this fork https://github.com/francoisp/socket.IO-objc.\nThere is another issue opened for supporting 1.0 https://github.com/pkyeck/socket.IO-objc/issues/162\n. ",
    "francoisp": "I forked francoistemasys's great fork (it provides some socketio1.0 support) to add ack callback support to it(txt only, not binary). In the process I broke some 0.9 support (see comment in socketiopacket.m easy to fix)\nhttps://github.com/francoisp/socket.IO-objc\nAlso, I just came accross this, linked on the socketio's ws but not ranking v high with google, it might be of interest if 0.9 support is not required: https://github.com/MegaBits/SIOSocket\n. Acks are supported in my fork of a fork, just not terribly tested.\nbest,\nF\nOn Oct 15, 2014, at 12:14 PM, bimusiek notifications@github.com wrote:\n\nHey guys, what needs to be done to merge this PR? I think a lot of people would really use it, even if acknowledgments are not supported.\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "Tejas-narola": "@pkyeck Just for knowledge , do you think you will have time to create library support for v1.0 ? \n. ",
    "b9AobJ": "thx for @francoisp ,it fix my demand,i want to create static library with use oc,if i use socket.io-client-swift to dynamic library,it will increase 70M+ libSwiftBridge.framework to my project😂. @marcuschoong \nI give up use this pr,and use this cpp project into my workspace,\nhttps://github.com/socketio/socket.io-client-cpp. @marcuschoong \nit is very long time to build it.so i don't remember how to rebuild it . I try to build  it today but failed.maybe you could try this:\nhttps://github.com/socketio/socket.io-client-cpp/blob/master/INSTALL_IOS.md\ni know the cocoapods is ok and you can use this.\nand option 3 i can't rebuild it now.. @tooolkit @marcuschoong \ntry this: \npod 'SocketIO-Client-CPP',\nor use pod search SocketIO-Client-CPP, get other version;\nSocketIO-Client-CPP (1.6.1)\n   SocketIO-Client-CPP\n   pod 'SocketIO-Client-CPP', '~> 1.6.1'\n   - Homepage: https://github.com/hfossli/SocketIO-Client-CPP-iOS-Builds\n   - Source:   https://github.com/hfossli/SocketIO-Client-CPP-iOS-Builds.git\n   - Versions: 1.6.1, 1.6.0, 1.5.0.1, 1.5.0 [master repo]. @tooolkit sorry, i use this to create project is 2016/11,and i forget about this project that how to use,i think is very simple for you ,maybe you could try to learn his API \nhttps://github.com/socketio/socket.io-client-cpp/blob/master/API.md\nAnd learn this\nhttps://socket.io/docs/. ",
    "marcuschoong": "@b9AobJ I'm using https://github.com/francoisp/socket.IO-objc and tried to connect to my socket server but couldn't connect. following is the log file.\n2018-04-12 15:29:31.518 SocketTesterARC[98538:14802812] Connecting to socket with URL: http://2cad7a38-ff.zzz.info/socket.io/1/?EIO=2&transport=polling&t=1523518171516&role=visitor\n2018-04-12 15:29:31.703 SocketTesterARC[98538:14802812] didReceiveResponse() 200\n2018-04-12 15:29:35.076 SocketTesterARC[98538:14802812] connectionDidFinishLoading()\n2018-04-12 15:29:35.082 SocketTesterARC[98538:14802812] VERSION 10x\n2018-04-12 15:29:35.082 SocketTesterARC[98538:14802812] Response {\"sid\":\"ive1ab-NpEVYlpdBAAAT\",\"upgrades\":[\"websocket\"],\"pingInterval\":25000,\"pingTimeout\":5000}\n2018-04-12 15:29:35.082 SocketTesterARC[98538:14802812] websocket supported -> using it now\n2018-04-12 15:29:35.082 SocketTesterARC[98538:14802812] Received All information:\n    sid: ive1ab-NpEVYlpdBAAAT\n    heartbeat: 25.000000\n    Transport: \n2018-04-12 15:29:38.436 SocketTesterARC[98538:14802812] start/reset Heartbeat\n2018-04-12 15:29:38.437 SocketTesterARC[98538:14802812] Prepare to send()\n2018-04-12 15:29:38.437 SocketTesterARC[98538:14802812] queue >>> 2probe\n2018-04-12 15:29:42.761 SocketTesterARC[98538:14802812] onDisconnect()\n2018-04-12 15:29:44.823 SocketTesterARC[98538:14802812] socket.io disconnected. did error occur? Error Domain=org.lolrus.SocketRocket Code=2132 \"received bad response code from server 400\" UserInfo={NSLocalizedDescription=received bad response code from server 400}\ni would like to create static library with objective C as well, do you able to achieve it?. @b9AobJ \nThanks for the suggestion, the best option might using the libsioclient.a directly but the documentation for implement is not clear. \nCurrently I'm having problem with the websocketpp/client.hpp not found problem.\nPossible you can show me the step to use this source?\nThousand thanks.\n. @b9AobJ \nI need to create the project as cocoapod static library, by using pod for CPP allow me to create the project as static library? if yes, how should I include the pod into static library?. I haven't solve the problem.\nOn Fri, Jul 13, 2018 at 7:12 PM, sai notifications@github.com wrote:\n\n@marcuschoong https://github.com/marcuschoong hi, i also need to create\na static library using socket i.o, have you solve the problem?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/pkyeck/socket.IO-objc/issues/162#issuecomment-404803268,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AZpNerwq57DtUYRfnwE6tUoWkT3darqaks5uGICpgaJpZM4Btvvj\n.\n\n\n-- \nBest Regards,\nMarcus\n. ",
    "tooolkit": "@marcuschoong hi, i also need to create a static library using socket i.o, have you solve the problem?. @b9AobJ thx, i had choose the cpp version ,but i'm not familiar with cpp ,i can contact the server and when emit  i can receive data.  but i don't know how to get the data . have no idea how to cast objc type like NSDictionary to cpp.   thank you very much.. @b9AobJ thx for your replay. you are so kind. i have solve the problem cast data between std::map and NSDictionary. thank you very much. but maybe socket.io-client-cpp cant use in a static library. so many problems even i create a new project and just use socket.io-client-cpp. i made a issue to them .   thank you very much.. ",
    "bhartsb": "I found versions of the missing files at: https://code.google.com/p/sizecircle/source/browse/trunk/DXQ/WebSocket/SocketRocket/?r=40\nthe version of SRWebSocket is different, but I didn't note specifically the diffs.  I used the more recent socketrocket .m and .h and then the rest from the above link.  I had to rename the .c .m to rid of some compiler errors, and then was able to build successfully.\n. In the past I've used SVN and haven't used git except from within XCode for\nthe project I'm working on.  Submodules sound interesting and I'll try it\nout.   I guess I'll need to check out cocoa pods since I keep running into\nit.\nOn Mon, Apr 7, 2014 at 12:13 AM, Philipp Kyeck notifications@github.comwrote:\n\nwhy are you downloading the ZIP?\neither check out the project using git and init the submodules or use\ncocoapods to install dependencies after cloning the repository.\n\nReply to this email directly or view it on GitHubhttps://github.com/pkyeck/socket.IO-objc/issues/163#issuecomment-39701673\n.\n. Hi Philipp,\n\nRegarding the following properties that are used as a cookie:\nNSDictionary *properties = [NSDictionary dictionaryWithObjectsAndKeys:\n                               @\"localhost\", NSHTTPCookieDomain,\n                   @\"/\", NSHTTPCookiePath,\n                   @\"auth\", NSHTTPCookieName,\n                   @\"56cdea636acdf132\", NSHTTPCookieValue,\n                    nil];\nHow in the context of a IOS app's websocket connection is\nNSHTTPCookieDomain and NSHTTPCookiePath used ?\nOn the server when I call console.log(socket.handshake.cookie) all I see is:\nauth=56cdea636acdf132\nAlso, per including & using socket.IO-objc in my project what do you\nrecommend?  It is not being built as a library per se.  I only see the app\nas the target.\nThanks,\nBrian\nOn Tue, Apr 8, 2014 at 1:20 AM, B Hart bhartsb@gmail.com wrote:\n\nIn the past I've used SVN and haven't used git except from within XCode\nfor the project I'm working on.  Submodules sound interesting and I'll try\nit out.   I guess I'll need to check out cocoa pods since I keep running\ninto it.\nOn Mon, Apr 7, 2014 at 12:13 AM, Philipp Kyeck notifications@github.comwrote:\n\nwhy are you downloading the ZIP?\neither check out the project using git and init the submodules or use\ncocoapods to install dependencies after cloning the repository.\n\nReply to this email directly or view it on GitHubhttps://github.com/pkyeck/socket.IO-objc/issues/163#issuecomment-39701673\n.\n. My mistake please remove this issue.\n. \n\n",
    "niksmac": "+1\n. ",
    "edeckers": "Pull request for wrong branch.\n. ",
    "aldevet": "It actually allows it but it was sending all parameters as one object. Here there's a more elegant solution: https://github.com/pkyeck/socket.IO-objc/pull/208\n. I was having issues with multiple parameters like:\nsocket.on('publish', function (options, sdp, callback) {\nBecause of the double-wrap all data will go to first parameter. This pull request solves it, hope it merges!\n. Just found debugging the answer: setting correctly a boolean: \nself.socket.returnAllDataFromAck = true;\n. ",
    "metcorne": "I need this PR, I will use your code until this is merged\n. ",
    "crespoxiao": "singleton \n. thanks above \n. ",
    "starfalling": "You may set it in the server config, make a try\nhttps://github.com/LearnBoost/Socket.IO/wiki/Configuring-Socket.IO\n. ",
    "fwhenin": "that's returning nil :-/, but I see it in debug and NSLog the packet.args, but not when I do objectForKey\n. got it...closing this\n. ",
    "ndrewh": "~~I was able to resolve the error by commenting out SocketIO.h:64~~ Never mind, that breaks things.\n. Yeah I got it to work eventually also with that line commented out. I had my own issues that made me think I broke it. (I forgot to retain my SocketIO object, so I was surprised when I wasn't getting the delegate calls :smile:) \nYeah the delegate @property should make a _delegate ivar also, which is why I thought commenting out that line would would work (and it does).\n\nOn Jun 11, 2014, at 10:17 AM, Antoine Quint notifications@github.com wrote:\nWell, commenting out this line works for me, my app behaviour is unchanged, SocketIO behaves as expected.\n—\nReply to this email directly or view it on GitHub.\n. While you're at it, try removing all of the other ivars that correspond with an @property. They shouldn't be needed, but I do not know what affect (if any) they have.\n. \n",
    "graouts": "Huh :)\nCommenting that line for me at least makes SocketIO build, I'm no ARC expert, but I don't understand what the ivar declaration __weak id<SocketIODelegate> _delegate; brings that the property declaration doesn't already stipulate with @property (nonatomic, weak) id<SocketIODelegate> delegate;\n. Well, commenting out this line works for me, my app behaviour is unchanged, SocketIO behaves as expected.\n. I don't think that issue should be closed until the source works as-is. I'll send pull request, and hopefully someone who understands the issue will decide to pull it in or not.\n. @NerdYouDontKnow I'd rather keep this change minimal for now, I don't feel confident enough to propose a larger change.\n. ",
    "ethanhann": "+1\n. ",
    "aleclarson": "+1\n. ",
    "edwinckc": "http://stackoverflow.com/questions/10342681/whats-the-difference-between-io-sockets-emit-and-broadcast\nIt seems to be working to me. Emit sends to everyone including the device that connected, whereas broadcast sends to everyone except the socket that created the connection.\n. Jarda's probably right, it's what I got too with v1.0 of socket.io. You'll have to install v0.9 instead if you want to use this implementation. It looks like Philipp won't have time to update this for now:\nSee here for v1.0 support\n. ",
    "wo664881680": "so that~thank you~ i will try again~\n. ",
    "jardakotesovec": "Are you using version 0.9 on the server? I think I got similar error when tried to connect to 1.0, which is not supported yet.\n-- Jarda Kotěšovec\nOn Monday 16 June 2014 at 06:51, leongwq wrote:\n\n2014-06-16 12:50:14.312 Axion[1295:60b] Connecting to socket with URL: http://localhost:8888/socket.io/1/?t=1402894214312\n2014-06-16 12:50:14.402 Axion[1295:60b] didReceiveResponse() 400\n2014-06-16 12:50:14.403 Axion[1295:60b] ERROR: handshake failed ... Server returned status code 400\n2014-06-16 12:50:14.405 Axion[1295:60b] onError() Error Domain=SocketIOError Code=-6 \"The operation couldn’t be completed. (SocketIOError error -6.)\" UserInfo=0xb078cd0 {NSUnderlyingError=0xb0793f0 \"Server returned status code 400\"}\nHow do i solve this error?\n—\nReply to this email directly or view it on GitHub (https://github.com/pkyeck/socket.IO-objc/issues/191).\n. \n",
    "geraldWilliam": "Thank you. That was partially the issue. I also found that _httpRequestData was nil when the lib attempted to append to it in connection:didReceiveData:. I fixed that by simply checking for nil and allocating anew in that callback. Thanks again. \n. ",
    "sardana19": "Ya.....i was able to connect before.....but now its showing this error\nKapil Sardana\nOn Jun 20, 2014 7:37 PM, \"Maziyar Panahi\" notifications@github.com wrote:\n\nWere you be able to connect to you socket.io before or is it your first\ntime? What is you Socket.io version? This is only compatible with Socket.io\nversion 0.9.x\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pkyeck/socket.IO-objc/issues/193#issuecomment-46681631\n.\n. How to check the version number and how to change it\n\nKapil Sardana\nOn Jun 20, 2014 7:56 PM, \"Maziyar Panahi\" notifications@github.com wrote:\n\nYou sure you didn't your Socket.io on your server? Double check the\nversion of socket.io on your npm see what is the version?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/pkyeck/socket.IO-objc/issues/193#issuecomment-46683773\n.\n. \n",
    "matthewpalmer": "Never mind. I was being an idiot and trying to send the event inside a function that would only be called when the view reloaded. \nThanks for the library! :)\n. ",
    "sroze": "+1 !\n@jasonbodie can you squash your commits ?\n. ",
    "jasonbodie": "Had to create another pull request. When trying to squash made a few learnings. :) The new pull request should show as a single commit now.\n. I'm using XCode5.1.1, building with IOS SDK 7.1 and the leaks appear while running in the profiler. It also seems to address some of our app's long running memory issues. \nThe documentation you are referencing also says: \"calling this function on global dispatch queues has no effect.\" Yet it seems to have an effect... So no real harm either way. The code resolves the largest memory leak our application had, and allows me to pinpoint some of the smaller ones so we're keeping it for now ;)\nWe've been running this code in our prior two app releases. \n. I've been trying to answer the same question for myself. I'm surprised I'm the first person that has noticed this issue. At this point my suspicion is that we are exercising the library in a less common way.\nYes I am using the latest version of the library. \n. @sroze This is the updated pull request.\n. @maziyarpanahi I closed my original request prior to your earlier comments and created this request because I was asked to squash down to one commit. So essentially this is the original pull request not an \"over and over again\"...\nThis change does not cause problems when compiling and according to the apple documentation should, at worse, have no effect. Yet it does resolve the memory leak we are seeing in the profiler.  I am also using iOS7 and ARC.\n. ",
    "dqj": "You are right. The handshake fails. And I think the reason is the network condition is not good, as i change the carrier from the 3G to GPRS/ EDGE.  After I change the carrier to 3G, the app runs well.\n. Since my app can not shake hand with the server, the app can not send a forced disconnect request to server. While the reason the handshake fails is my app can not connect to server under 2G or 2.5G network. Right? \n. I've set the default connectionTimeout to 30s. But the \"shake hands\" also fails.  Have you ever test the library under these type of carrier network, such as GPRS or EDGE? \nThanks!\n. ",
    "bocodigital": "I'd love to get this, when do you plan to merge this in?\n. sweinertjr you can just down load his fork it works great\n. ",
    "tsuncp": "can you implement Acknowledgement function :(\n. ",
    "francoisTemasys": "@pkyeck I understand your remark but here it's possible to have everything all together so why not?\n@tsuncp Can you give me an server example with acknowledgement message? I'll see if I have time\n(Please quote my name on the PR, I'm not checking this page every day)\n. Hi, Thanks for the support. As you can see I don't really have much time to put on that. But with your help I can quickly fix the issue you are reporting.\n@ploddi I commited your change\n@Gargam It's true that the server is waiting first for the '5' message. What I don't understand is that I do the following: when the websocket gets open it launch the message '5', no matter the version (https://github.com/francoisTemasys/socket.IO-objc/blob/master/SocketIOTransportWebsocket.m#L114). The '2' is an heartbeat, one workaround would be to fix a certain delay when starting the heartbeat timer (and let the upgrade start): https://github.com/francoisTemasys/socket.IO-objc/blob/master/SocketIO.m#L465\nFor the acknowledgement, that's really not my priority now.\n. ",
    "ploddi": "PR is actually bugged.\nOn line 67 in SocketIOTransportWebsocket.m:\naddOnVersion = @\"?EIO=2&transport=websocket&sid\"\n= is missing after sid, and server treats transport connection as new one (on server side you will get 2 connection with different sids).\n. ",
    "Gargam": "@francoisTemasys Hello, thanks for your work !\nFor acknoledge support here a simple sample on how to do it from the server\nsocket.on('signin', function (nickname, callback) {\n    // Check if nickname is available \n    if (isAvailableNickname(nickname))\n    {\n        // do stuff\n        callback(true); // pass some data to the ack, here just a simple boolean but can be json \n    } else {\n        callback(false); // pass some data to the ack, here just a simple boolean but can be json \n    }\n});\nAnd from the javascript client\nsocket.emit('signin', 'testNickname', function (isAvailableBoolean) {\n    // availableBoolean is the var sent by server when using callback(var);\n    if (isAvailableBoolean) \n    {\n        // all good\n    } else {\n        // something went wrong\n    }\n});\n. @francoisTemasys I test your code but @ploddi is right there a missing = in your file :).\nI've got the following bug using socket.io 1.1.0, not present on socket.io 1.0.6\nEDIT: Not related to the version, I've got it on 1.1.0 and 1.0.6 as well.\nWhen I try the lib with this fix I'm disconnected by the server at the first sendHeartbeat call (I think it is because the lib want to send a message to the server).\nHere's my log from the app.\nFound a cached session\n Session opened\nConnecting to socket with URL: http://localhost:3000/socket.io/1/?EIO=2&transport=polling&t=1410602002285\ndidReceiveResponse() 200\nconnectionDidFinishLoading()\nVERSION 10x\nResponse {\"sid\":\"ewebI7xBd6uFuDD7AAAG\",\"upgrades\":[\"websocket\"],\"pingInterval\":25000,\"pingTimeout\":60000}\nwebsocket supported -> using it now\nReceived All information:\n    sid: ewebI7xBd6uFuDD7AAAG\n    heartbeat: 25.000000\n    Transport: <SocketIOTransportWebsocket: 0x7fd318793e10>\nstart/reset Heartbeat\nPrepare to send()\nsend() >>> 2\ndidSendMessage >>> data: (null)\nPrepare to send()\nqueue >>> 2\nonDisconnect()\nDisconnected Error Domain=SocketIOError Code=-4 \"The operation couldn’t be completed. (SocketIOError error -4.)\"\nAnd here's the server code (really simple :p)\n```\nvar app = require('express')();\nvar http = require('http').Server(app);\nvar io = require('socket.io')(http);\napp.get('/', function(req, res){\n  res.sendfile('index.html');\n});\nio.on('connection', function(socket){\n    socket.on('disconnect', function () {\n        console.log('disconnect');\n    });\n    // socket.emit('test', { hello: 'world' });\n    console.log('a user connected');\n    console.log(socket.conn.id);\n});\nhttp.listen(3000, function(){\n  console.log('listening on *:3000');\n});\n```\nEDIT2:\nI think I have figured out what happened, it's related to your missing =.\nWhen you add this missing = the transport is succesfuly upgraded to websocket, but your heartbeat (packet @\"2\") will trigger before the \"upgrade packet\" (@\"5\") is sent. The server see @\"2\" instead of @\"5\" and disconnect it.\nI'm looking on a simple workaround but that's not really my stuff.\n. ",
    "ethanmick": "Hey all,\nSocket 1.x support would be great, I really want to update my servers to support the new version. I understand this is a big change, so maybe I'll take a look at this PR.\nI highly like @pkyeck's idea of dropping old cruft. In another year or so, having 0.9 support really won't matter.\n. ",
    "bimusiek": "Hey guys, what needs to be done to merge this PR? I think a lot of people would really use it, even if acknowledgments are not supported. \n. ",
    "breaklee": "this is available on ARC?\ndispatch_release(_timeout); this statements is not allowed on ARC.\n. thats good article. ill try it\n. maybe i think, \"JSONStringFromObject\" function use memories.\nwhen call 'JSONStringFromObject', memory has increased, but not freed.\n. i've found that what's the probrem is.\npacket.data = [SocketIOJSONSerialization JSONStringFromObject:dict error:nil];\ndataWithJSONObject function in JSONStringFromObject is autoreleased object.\nso, this object is registered in Main RunLoop AutoreleasePool.\nbut until called drain, this is not released and cause increase memory.\nso i've fixed code under blow.\n- (void) sendEvent:(NSString )eventName withData:(id)data andAcknowledge:(SocketIOCallback)function\n  {\n  @autoreleasepool {\n      NSMutableDictionary dict = [NSMutableDictionary dictionaryWithObject:eventName forKey:@\"name\"];\n// do not require arguments\n      if (data != nil) {\n          [dict setObject:[NSArray arrayWithObject:data] forKey:@\"args\"];\n      }\nSocketIOPacket *packet = [[SocketIOPacket alloc] initWithType:@\"event\"];\n  packet.data = [SocketIOJSONSerialization JSONStringFromObject:dict error:nil];\n  packet.pId = [self addAcknowledge:function];\n  if (function) {\n      packet.ack = @\"data\";\n  }\n  [self send:packet];\n}\n  }\n. ",
    "solomon23": "You have to anchor it or it will get dealloc'ed before connection can be fired:\n```\nvar socketIO: SocketIO!\noverride func viewDidLoad() {\n    super.viewDidLoad()        \nsocketIO = SocketIO(delegate: self)\nsocketIO.connectToHost(\"127.0.0.1\", onPort: 3000)\n\n}\n```\n. ",
    "apizzini": "Thank you. It solved the problem...\n. ",
    "thartzheim": "The following link has a very good example of how to get rooms to work with socket.IO. \nThis still requires a backend sails service that takes req.socket and subscribes it to a selected room.\nhttp://stackoverflow.com/questions/25081188/sending-socket-request-from-client-ios-android-to-sails-js-server\n. ",
    "jnoring": "It's possible I'm not understanding how this code works, but I have some server communication using socket-io that expects the args argument to be something like \"[NSDictionary_, NSString_]\" (which is likely bogus, but nonetheless, what I have to work with).  If there's another way to do this, I'm all ears.\n. ",
    "rajat143": "Thanks \n. ",
    "kevinrenskers": "Having the same problem but it seems to be https://github.com/square/SocketRocket that's at fault. Sadly they haven't released a new version since January 2013. Even worse is that socket.IO-objc is using an even older version.\n. That wouldn't help if you install socket.IO via cocoapods though, would it? https://github.com/CocoaPods/Specs/blob/master/Specs/socket.IO/0.5.2/socket.IO.podspec.json\n. ",
    "rick711003": "hi pkyeck ! I have same problem , Could u help me how can I do just can fix it \n. ",
    "longzhang": "How about  try to encode it by utf-8? \n. ",
    "otaviokz": "I apologise for opening this issue. The actual problem was in the server.\n. ",
    "JannyFoo": "socket.io 0.9.6 library\n. Any ideas?\nThanks,\nJohn\n. ok thanks,\nJ\n. ",
    "freynolds": "Bump, any news on this?\n. ",
    "headstream12": "I use library, which full supports socket v1 and > \nThis library has 2 variants. One without support v 1, another with. ",
    "NyeinEiEiTun": "for the server side? I think server side is using socket.io version 1+. Actually, server side wants me to use this version of socket.io library https://github.com/socketio/socket.io/. But for the client side, i still need to support ios 7. That's why I used objective-c library for socket.io.. i got it. Thanks :). ",
    "Dhaval3110": "@pkyeck Is there any special reason to library not working with socket IO v 1.0?  . ",
    "mhisham": "Yes, ios break all socket connections when your app goes in background, for that reason you have to support Push notification for important actions or get the updates every time your app reconnect again. Hope that helps\n  . ",
    "MichaelScaria": "Whoops, you're right. I had already fixed that in the app I was working on, I had to copy all my changes into the forked repo I had cloned so I guess I had accidently left that out...\nMichael\nSent from my iPhone\n\nOn Aug 29, 2013, at 8:53 AM, pbihler notifications@github.com wrote:\nIn SocketIO.m:\n\n@@ -135,6 +135,8 @@ - (void) connectToHost:(NSString )host\n         // do handshake via HTTP request\n         NSString protocol = _useSecure ? @\"https\" : @\"http\";\n         NSString port = _port ? [NSString stringWithFormat:@\":%d\", _port] : @\"\";\n-        NSTimeInterval time = [[NSDate date] timeIntervalSince1970];\n-        time = time * 1000;\n       NSString handshakeUrl = [NSString stringWithFormat:kHandshakeURL, protocol, _host, port, kResourceName, rand(), query];\n  shouldn't you replace rand() by time?\n\n—\nReply to this email directly or view it on GitHub.\n. \n"
}