{
    "spacecowb0y": "Thank you @thibaultCha! Great job!\n. I fixed the problem with the flags. I'm gonna merge the request then push the fix.\n. @Ostanin thank you very much for your support. It would be great if you translate the * legal disclaimer* as well so the translation is complete.\n. Thank you Manu! It's nice to see you around!\n. Hi @sisqbates. Thank you very much for your support!\n. Thank you!\n. @pyprism thank you very much for your support buddy! Could you please translate legalDisclaimerResponsible, legalDisclaimer and subtitledIn so I can merge this?\n. Well done buddy! Thank you!\n. ",
    "Patineta": "Thanks for the translation! We'll launch it on the next release.\n. We'll launch this during the next release. Thanks for the translation!\n. Thanks for the translation anyway!\n. Awesome!\n. BTW, @nicoandrade , querés agregar algo para la #15 mientras terminamos la nueva descripción? El code lo tenés en la sidebar (está comentado).\n. We've already included it! (we used the pastebin link). It's on pt.json and will be available on the next release. Thanks for the translation!\n. Thanks for adding the portuguese subs!\n. Thanks for the change!\n. Merged! It'll be available on the next release. Thanks for the translation!\n. It's just been fixed in another pull request. Thanks anyway!\n. Thanks for translating the installer! We'll get started on the other languages as well, but this will be available on the next Beta.\n. Te pasaste :D\n. Thanks for the translation! It'll be available on the next release.\n. Thanks for the fix!\n. Thanks for the changes!\n. @abadfederico , this one's all yours.\n. Had to do a manual merge since it clashed with quite a few things. Included your changes and also split app.scss into more manageable modules. Let me know if everything looks right (and feel free to move modules that don't quite fit).\n. Hi Gabriel, Thanks for the cleanup! I have a few comments to make:\nSome of the packages (superagent and peerflix) require quite a few modifications in order to work properly, specially since peerflix is not being maintained anymore and has some seriously outdated dependencies. That's why we put node_modules in the repo, so you can run the app without fiddling with a ton of packages. The right way of doing this, of course, is to refactor the code and put those customized packages outside node_modules, which we haven't done yet.\nThe same goes for node-webkit, as it requires a very specific .dll / .so to run videos. This is less of a PITA, but it simplifies the build process a lot.\nREADME also is outdated, as we're using node-webkit v 0.9.2, which fixes a huge issue with CPU usage.\n. Thanks for the change! Somehow I forgot to add the languages in the .iss file.\n. Thanks for adding the extra subs! The next release will be coming very soon.\n. Thanks for the translation!\n. That was a great improvement over the previous system! It was just merged into master and will be released on the next beta. Thanks a lot!\n. We've included your changes in the repo, but it was faster to redo it than solve the merge conflicts, so we gave you a shout in the commit instead. Thanks!\n. Thanks for he translation! It'll be available On The next release.\n. Thanks! We had to hurry up with Beta 2 so we left a few translation issues in our wake. This'll go on the next release.\n. I'm checking the original .isl file and it doesn't seem to have encoding issues (in UTF-8). I do see some changes regarding languages though, but I want to know what's being fixed.\nCan you limit this PR just to the installer? The open effect no longer applies (we completely redesigned the movie details view, so those modifications are no longer necessary).\nThanks!\n. Nice find! Merged\n. I don't believe we have Japanese subtitles readily available, but we'll add your Japanese translation on the next release. Thanks!\n. Thanks for the portuguese fixes! I'm closing the issue, but welcome any changes in category names, as I see there's a bit of discussion regarding those.\n. Great! This should settle things with the portuguese translation. Thanks!\n. We've commented on this issue on #92 . We had to modify some packages (peerflix and superagent) and we've scheduled a refactor so we can get rid of node_modules.\n. Love the new subs! Thanks!\n. That was fast. Thanks!\n. Great! This helps a lot for the next release\n. Great! This helps a lot for the next release\n. Great! This helps a lot for the next release\n. Great! This helps a lot for the next release\n. Thanks for the translation!\n. Thanks for the bugfix!\n. The language names are of the things that's bugging me. Maybe it's possible to create a basic list with common stuff (like language names, which should be in their original names) and then extend individual languages with that so we don't repeat ourselves. \nDo you want to add this so everything's tidy before the merge?\n. That was fast. Thanks!\n. We have Italian at last! Thanks a lot for the translation.\n. Thanks for the fix!\n. Thanks for the new subs!\n. Thanks for the improvements!\n. Merged! Thanks for the improvements!\n. Thanks for the pull request! We've scheduled the settings panel for Beta 4, and since we're releasing Beta 2.5 today (with many hotfixes) we'll wait until then to add the settings module.\n. Thanks a lot! Those compass line comments were very annoying too.\n. This is probably the best one-liner we have. That was a weird bug. I'll ask for confirmation from the people who reported it. Thanks a lot for the fix!\n. Fantastic! Thanks!\n. Merged! Thanks for the fixes + refactor!\n. That was a great contribution. Thanks a lot for resolving #62!\n. It's a few more (we're changing that in a bit), but some categories don't have many movies that can be streamed without issues.\n. Thanks for the fix! That alert() was really annoying.\n. Hi @uberspot . Can you provide a simpler pull request? (just the .json file). Checking out custom modules makes merging pull requests very time consuming (and we've just gotten rid of all dependencies). Thanks!\n. @uberspot Thanks for the translation! I just went ahead and added the .json file so you don't have to send another PR.\n. Thanks!\n. Thanks!\n. There's always one more of these to fix. Thanks!\n. Thanks for the translation! It will be available on the next release.\n. Wasn't that fixed on a previous PR? I merged it anyway, but if we needed a second fix there might be something else going on with that file.\n. Thanks for the fix and tiny refactor!\n. Thanks for the translation! We'll add it on the next release.\n. @gutigen thanks for translating the app! We'll release this on the next version.\n. We're getting a ton of translations today. Thanks! This'll go on the next release.\n. That's a great find! We got one report of this previously, but as it seems to happen on very specific platforms and we couldn't replicate it, this should help with that. Thanks for the fix!\n. This is great! Marked #6 as fixed and we'll release this on Beta 3.\n. Te puedo aceptar startingDownload y horror en particular. Las otras son muy localizadas para nuestro gusto (y tampoco podemos dividir en es-es, es-ar, etc, a diferencia de Brazil con el Portugués). Creás otra PR con esos dos?\n. Careful with the JS linter. The comma at the end is not allowed in proper JSON.\n. @HeyTech I added it manually since we couldn't do a straight merge. Thanks!\n. I added it manually since it's simpler than merging. Thanks!\n. We're going to add a license when we figure out exactly which ones we can use and what's the best one, since this is something we have to research and we're quite busy focusing on the product right now. Thanks for the PR anyway!\n. @mccraveiro I added a few of these changes manually since we couldn't do a simple merge (there were a few conflicting pull requests). Thanks!\n. @vinkla Thanks for the changes! Make sure you don't leave trailing commas, as that causes issues when reading raw json.\n. Thanks for the translation! We'll add it on the next release.\n. Thanks! We'll add it on the next release.\n. Thanks! We'll add it on the next release.\n. Somehow we missed a few languages. We'll add them in a bit. Thanks!\n. @P0ssi merged it manually (both PRs). Thanks!\n. @hamecoded We just merged another one. You can modify the existing translation if you see anything out of place. Thanks!\n. We've already merged this pull request. Thanks @Nirlah!\n. Great! We'll release this on the next version.\n. @smoky-jr we merged #366, but modifications and improvements are welcome (though you should check with other users so this doesn't become a pull-request-fight)\n. @P0ssi be careful with the linter. Trailing commas are not valid in json.\n. Thanks! Subtitles are loaded in a different module (now it's on js/frontend/player.js). That's the list of supported subittles.\n. Thanks for the translation!\n. Thanks! Seeing that you're at this, can you add pagination on the popular page? It now covers pretty much every film on the list and it would be a good improvement.\n. That affected the design quite a bit. Thanks!\n. Thanks anyway!\n. Awesome! Thanks!\n. Thanks @razzer77!\n. @EvandroZanatta We did a fix with underscore's .isEmpty() . Thanks for the report!\n. @jpalumickas thanks for both PRs!\n. @Nirlah awesome. We get a lot of language PRs and it's very hard to figure out which ones are the most accurate, so we usually just merge them in order. Thanks!\n. @danielhusar great job! We'll add this on the next release.\n. @DirectorX I accepted the @Nirlah one. If there are any outstanding issues, feel free to talk them out and send a PR our way. Thanks!\n. @luuse you make a good point. This should help a small subset of developers. Thanks!\n. Cool, thanks!\n. @hunscream We just added hungarian support. Thanks! You can take a look at the current translation and send a PR if you want.\n@hugodias You're probably on the wrong ticket, but that's an issue we are fixing, as the differences between Brazilian and Portugal's Portuguese were more marked than we assumed when adding subtitles.\n. @1ace we just wanted to add that. Thanks!\n. @zeppelin Great job, guys! That's one of the most extensive translations I've seen yet. Merged and we'll use it on the next release.\n. @neuromancer I can't accept this, as it's an important part of our product right now (telemetry helps us find issues with the app that aren't reported). However, we are adding a way to disable tracking on the next release, which should fix this issue in a better way. Thanks!\n. Much appreciated. Thanks!\n. @WikiDZe we changed all language files to two spaces. Can you change just the modified line and resubmit? This makes the merge a bit more complicated otherwise. Thanks!\n. @thefuture2092 Thanks for the change!\n. @zbrox @gsamokovarov Thanks for the translation!\n. @tlqmj Great fix! Thanks!\n. @LightDust Thanks for the fix! That's something we wanted to add (lots of 4-star movies otherwise)\n. Thanks for the bugfix / correction!\n. @wilhelmmatilainen Thanks for the translation! We'll add it on the next release.\n. @ivantodorovich Loved the feature -and complementary refactor- (a ton of people have been requesting that feature for a while). Thanks a lot for this PR!\n. Thanks for the fix!\n. @web93onv Thanks for the translation! We'll use it on the next release.\n. We just got it merged from another pull request.\n. @cimox Thanks!\n. @LuckyThirteen This is a good idea. Thanks!\n. We're merging this one just to get this out of the way. Thanks!\n. @HeyTech You have to modify the SCSS in the .scss file and then run _compass compile on the root folder of the project to update the .css. It'll get overwritten otherwise. Thanks!\n. #528 should have fixed this issue. Thanks! We can reopen this if the issue persists.\n. This is a surprising oversight from our part. Thanks!\n. We might make this into a setting, but it's a very strong default to ship with the app. Thanks anyway!\n. @axot Can you translate the disclaimer as well? That should make for a complete translation. Thanks!\n. @azot we merged another pull request. Feel free to resubmit if you have any changes.\n. @Jackmoo Awesome! The InnoSetup guys would probably love this as well, so you should throw them a PR too. Regarding the .json files for translations, they are always in lowercase for compatibility.\nIf it's not too much to ask:\n- Rename the file to Chinese.isl so it's consistent with the other languages.\n- Just translating the lines we use for the installer is enough for now. We're releasing a new Beta in a few days, so the sooner we get this in the better.\n. @Jackmoo You can try TraditionalChinese.isl / SimplifiedChinese.isl, which is what we're doing with Portuguese and it seems to work well. Thanks!\n. @Jackmoo Merged! Thanks a lot for this translation, it was a ton of work and we really appreciate it! You should try sending it to the InnoSetup guys, who'll be more than happy to merge it into their github as well.\n. @mzgcz Already done!\n. @samccone Quick question: How well does this work and which issues does it fix/improve? (For instance the Popular > Other Category > Popular flow ruins the popular page right now, which is due to what we call the Pages Clusterfuck).\nWe're working to get the issues to a more manageable level ASAP and reviewing pull requests for quality takes a very long time, so this would be of huge help. Thanks!\n. @samccone Thanks a lot! Also I've seen you added the fix for the Windows 8.1 crash, which is very nice as well.\n. @montogeek Thanks for fixing the issue!\n. @pvieito Great small fix!\n. @trakais Thanks for the new translation!\n. Great! we'll wait until the next fix before merging.\n. ",
    "furkanayhan": "And realized that someone did this before me: https://github.com/popcorn-time/popcorn-app/pull/56\n. ",
    "nicoandrade": "@Patineta dale buenisimo. Justo vi que estaba hecho el codigo. \nHoy a la noche lo hago en front-end ;)\n. ",
    "alevizio": "@nicoandrade sos groso!\n. ",
    "Jiiieeef": "Thanks for the icon :)\n. ",
    "fabe": "Here: http://c.fabe.im/UBsx\nEDIT: Not sure but the icons should be from here: https://www.gosquared.com/resources/flag-icons/ (24x24)\n. ",
    "nickdima": "Thanks Fabe! Adding it now.\n. OK, icon added, pull request complete.\n. Thanks for merging my pull request!\n. ",
    "abadfederico": "Works like a charm! thank you :D\n. Thank you for this refactoring! yes im working right now with the scss files and is a mess. \n. Look that the new version of substitles wont use opensubtitles! \n. There is a little glitch in the animation, when the poster of the movie is animated, only the image is resized not the container (with borders and shadow). I like this idea but adds a little bit of noise to the UI \n. Doesn't work for me :( \nPlease test it again. Im on Mac OS\n. I like this new version. But you must edit the scss files not the css! \nI would love to see this implemented. \n. My bad!\nThank you for this :D\n. Great job!\n. Thank you :D \n. you update the app.css but for the next time change the scss files! i already updated in the original files :D \n. Hey dude! no problem we are all here to learn and help! Read this if you dont know what a scss file is and how to compile http://sass-lang.com/\nThis is also my first time working with SASS, in the past i only worked with LESS\n. Thank you! the previous refactor of scss was a little bit messy to merge. Sorry if you broke something in the middle. \nWith the refactor of scss its all more easy :D\n. The full screen button has no style and is over the close button, with this update i cant minimize or maximize or even close the application because the button is over this controls (i can only access them in full screen)\nIf you want i can merge this pull request and adjust this problem and add an icon.\n. \n. Thank you :D \n. Thank you. Will be in the next beta :D\n. Thank you for this update :)\nI don't really know why was a kiosk mode and not fullscreen :P\n. Thank you <3 \n. thank you :)\n. Nice! I like it. we need a settings view as soon as possible! \n. Strange bug that gradient!\n. That was fast (again) ! thank you\n. Thank you :D\n. thank you!\n. Blue it is!\n. I love this new sidebar, but the flags are ok? i im doing something wrong? \n\n. @kerberoS you are such a nice guy <3\n. We need to talk about the UI :P\n. ",
    "jeremybarbet": "No problem. The best thing is to have something more easily to maintain and improve, no matter if you merge my commits. :-)\n. Great!\n. Oops something went wrong with these flags. :)\n. ",
    "GonzaGonza": "Nice!\nAlso take a look at the branch https://github.com/popcorn-time/popcorn-app/tree/no_modules\n. I couldn't agree more.\nI think we should work this on a separate branch. no_modules\nThe repo is bigger and bigger, and if the PR from @jhbruhn Added support for grunt-node-webkit-builder works fine this is the way we should go.\n. @gabrielstuff I was working on this on the no_modules branch\nhttps://github.com/popcorn-time/popcorn-app/blob/no_modules/\nTake a look at it and make any suggestion.\nThanks!\n. @jhbruhn Sorry for not using this PR. I was working on removing node-modules from the app. And also using our own fork of every required module. Could you check what i did in https://github.com/popcorn-time/popcorn-app/tree/no_modules\nNow i see what you did, maybe you have some suggestion for what i did here:\nhttps://github.com/popcorn-time/popcorn-app/blob/no_modules/Gruntfile.js\nThanks!\n. Thanks for your Pull Request! But the Gruntfile.js has changed with the new branch no_modules.\nIm closing this and you can do a new pull request with new changes. After we merge no_modules with master.\nBy the way, i dont think that we need load-grunt-task. Its cleaner, thats true, but its another dev node-module\n. i will work on it from here. Thanks for the PR :+1: @tapajos \n. I love the idea @joneath \nGrunt Tasks for testing/debugging nice! but this files changed since you did this PR. You can modify this, or we will be taking this idea into a future release.\nThanks!\n. Nice\n. Nice! Sorry for bother but could you review your pull request so we can Automatically merge this pull request. https://github.com/popcorn-time/popcorn-app/blob/master/js/frontend/app.js#L52\nTell me if you can't :+1: \n. We are not using opensubtitles anymore.\nFeel free to add Italian subtitle support on the file: yifysubtitles.js\n. We need to optimize how we are handling the downloading of subtitles, to avoid downloading too much files from yifysubs. Thats why we are holding this \"full subtitle support\".\n. We should talk about this on #219 \nI think that link to trailer will be nice, but we should discuess where we should put it.\nIf you see the linked issue you will see that there are some changes in the UI. \nYou did a really nice work! I will let this PR open (we cant automatically merge this PR) but the UX will be different, maybe we can grab from here the \"play trailer\"\nThanks!\n. Install grunt globally\n$ npm install -g grunt-cli\nInstalled the node modules:\n$ npm install\nBuilt with:\n$ grunt nodewkbuild\nRight now the linux32 version is not tested, feel free to modify the file Grunt.js before build and sepcify which versions do you want to build.\nCheck the lines in Grunt.js\n        mac: true, // We want to build it for mac\n        win: true, // We want to build it for win\n        linux32: false, // We don't need linux32\n        linux64: true // We don't need linux64\nGood luck!\n. Nice, thanks!\nOn Tue, Mar 11, 2014 at 3:33 PM, C-A de Salaberry\nnotifications@github.comwrote:\n\nFrom github help wikihttps://help.github.com/articles/which-remote-url-should-i-use,\nit makes sense to change to https.\nUse these URLs for users that are behind a firewall or proxy. Many\nfirewalls will block the ssh URLs from working.\nAlso\nTip: You don't have to enter your password every time you use an HTTPS\nURL, check out this guidehttps://help.github.com/articles/set-up-git#password-cachingfor more info.\nBasically it allows not dealing with ssh keys.\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/431#issuecomment-37332446\n.\n. Good idea!\nCould you do this in the meantime?\n\ngrunt nodewkbuild --platforms=win,linux32,linux64,mac\nThose are the platforms. But, if you run the command without the --platforms argument, then it build it for every platform. What do you think?\nThanks!\n. Yes! @luuse and @zbrox i agree, but as i read on @luuse PR he was having problems with a regex detecting the platform.\nI will put this PR on hold until someone can resolve the issue detecting each platform.\nAnd again, Thanks!!! nice work! \n. Nice Work @luuse you rock!\n. This looks promising! Let me test it! Thanks!!\nYes as you saw, yesterday @Patineta did some clean up with the files we had.\nWe still need some error handling in both methods (local srt and downloading a zip with subs)\n. This PR is closed :( ... i will copy your changes and try it on a local branch.\nIf everything goes fine i will commit changes. (i will credit you in the comments @ivantodorovich )\nThis looks promising :+1: \n. Lol, yes its pushed by @Patineta . Thanks @ivantodorovich . Maybe i need some sleep :+1: \n. Thanks!\nIt seems yesterday there was a PR with changes from git url to https and\nthat break things.\nOn Wed, Mar 12, 2014 at 12:52 PM, Charles Lehner\nnotifications@github.comwrote:\n\nI was getting errors from npm about things being \"not a package\", but\napplying this patch allowed the dependencies to install properly. node -v\nv0.10.26, npm -v 1.4.3, OS X 10.9.2\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/540#issuecomment-37425188\n.\n. i will check it out\n. \n",
    "impronunciable": "We should fork the modules that need modifications and use our own versions. Until that we have to keep the modules here.\n. This is a fix for PT-Br. We can add a more general regionalization feature instead with little effort.\n. What I mean is let's fix it for future regions too. Maybe you can set up an\narray for region (i.e. es-es, es-ar, pt-pt, pt-br...).\nOn Mar 9, 2014 10:41 AM, \"Ronaldo Cesar Paggi\" notifications@github.com\nwrote:\n\n@danzajdband https://github.com/danzajdband But which other\nregionalization problem we have? Lets fix it :D\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/258#issuecomment-37127204\n.\n. Also thanks for contributing :)\nOn Mar 9, 2014 1:16 PM, \"Dan\" dan.zajdband@gmail.com wrote:\nWhat I mean is let's fix it for future regions too. Maybe you can set up\nan array for region (i.e. es-es, es-ar, pt-pt, pt-br...).\nOn Mar 9, 2014 10:41 AM, \"Ronaldo Cesar Paggi\" notifications@github.com\nwrote:\n\n@danzajdband https://github.com/danzajdband But which other\nregionalization problem we have? Lets fix it :D\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/258#issuecomment-37127204\n.\n. \n\n",
    "gabrielstuff": "I'm doing this for some of my projects, waiting until one day the owner will merge :)\nThis is fast and very smart.\nYou could fork to your organization and update the package.json.\nI can do that, up to you !\nwe should rewrite commit history to remove any node_modules / config.js and thus win on size of the repo and security of the API Key.\n++\n. I can confirm that this fork https://github.com/isra17/popcorn-app works perfectly with a nice redesign for scrapping torrent. Should be faster to integrate new torrent search for legal copy or anything else :)\n. ",
    "rpaggi": "This need more changes in the search system. But this slightly improves\n. Sorry, this change is broken, i'll work better on this\n. Oh yes, i'll wait\n. I'm sorry\nI'm newbie LOL \nIt will not be repeated\nIn next year i'll go to Argentina, tell me indications on Buenos Aires if u have :D\n. Sorry the varios commits\n. In subtitle system?\nI don't see any change about it\n. Now the subititle system download subtitles in Pt-BR and Pt-PT\n. Now i remove the catch, leaving only the try.\n. :/\n. @danzajdband But which other regionalization problem we have? Lets fix it :D\n. Oh really, i forgot that, because i focused only in my language, so sorry.\nLet's work on all languages available on subtitle api\n. @danzajdband why this change aren't merged? Any think are wrong?\n. True, when i go to home i'll change this\nEm 06/03/2014 12:25, \"Jerome Lefeuvre\" notifications@github.com escreveu:\n\nIn js/frontend/providers/cache.js:\n\n@@ -63,7 +63,21 @@ App.Cache = {\n         db.transaction(function (tx) {\n             tx.executeSql('CREATE TABLE IF NOT EXISTS ' + provider + ' (key TEXT, data TEXT)');\n-            tx.executeSql('INSERT INTO ' + provider + ' VALUES (?, ?)', [key, data]);\n-            //Implementation to check if exist registration in db and update instead of insert\n-            //Does a SELECT on Provider\n-            tx.executeSql('SELECT data FROM ' + provider + ' WHERE key = ?', [key], function (tx, results) {\n-                try {\n-                    if (results.rows.length) {\n-                        tx.executeSql('UPDATE ' + provider + ' SET data = ? WHERE key = ?', [data, key]);\n-                    } else {\n-                        tx.executeSql('INSERT INTO ' + provider + ' VALUES (?, ?)', [key, data]);\n-                    }\n-                } catch (e) {\n\nWhy do you need a catch ? Possible to broke all ?\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/216/files#r10345675\n.\n. Or if you can change for me :)\nEm 06/03/2014 12:25, \"Jerome Lefeuvre\" notifications@github.com escreveu:\nIn js/frontend/providers/cache.js:\n\n@@ -63,7 +63,21 @@ App.Cache = {\n         db.transaction(function (tx) {\n             tx.executeSql('CREATE TABLE IF NOT EXISTS ' + provider + ' (key TEXT, data TEXT)');\n-            tx.executeSql('INSERT INTO ' + provider + ' VALUES (?, ?)', [key, data]);\n-            //Implementation to check if exist registration in db and update instead of insert\n-            //Does a SELECT on Provider\n-            tx.executeSql('SELECT data FROM ' + provider + ' WHERE key = ?', [key], function (tx, results) {\n-                try {\n-                    if (results.rows.length) {\n-                        tx.executeSql('UPDATE ' + provider + ' SET data = ? WHERE key = ?', [data, key]);\n-                    } else {\n-                        tx.executeSql('INSERT INTO ' + provider + ' VALUES (?, ?)', [key, data]);\n-                    }\n-                } catch (e) {\n\nWhy do you need a catch ? Possible to broke all ?\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/216/files#r10345675\n.\n. \n",
    "jhbruhn": "Your Gruntfile looks really good. I haven't tested it but your solution about dealing with the additional libraries is better than storing the complete node-webkit build. \n. ",
    "alexismarquis": "I updated the css, it should be working now.\n. I edited the scss ;)\nlook at  _layout.scss \n. Happy to hear that ! Love that project :-)\n. You need to compile the _layout.scss\n. Why do you use KioskMode, and not the Fullscreen mode?\n. ",
    "jeromelefeuvre": "Ah ah ok, thanks. \nHard tab is always a shit to manage ^^\n. yes you can, you can fork i18n-node too and add a pull request of your changes too\n. :+1: \n. @Gnuns Added some improvments to your PR (https://github.com/Gnuns/popcorn-app/pull/1) and it's not UI :trollface: \n. :+1: \n. You know you can use the same pull request ;)\njust do your changes, do a git rebase -i sha_numbers and git push -f to your git project\n. I think you have something wrong with your PR (4022 files changed), Please review it or explain why :smile: \n. after that, will be :+1:  !!\n. good refactor.\nLast question, do you think will be better to display 1h 27min or 1 hour 27 minutes ?\nPersonnally, short is better (and take less spaces), WDYT ?\n. 1h 27min\n. seems good except fr.json. Indentation is fucked ;(\n. :+1: \n. :+1: \n. Why do you need a catch ? Possible to broke all ?\n. bad tabulation ^_^\n. Please use locale files\n. same\n. I'm pretty sure you can add this method in i18n.js module and used it like i18n.getLocales().\n. same here for adding a new function like:\ni18n.isValid(Settings.get('app_language'))\n. language ;)\n. you can remove all lines with Settings.set('app_language', ...)' and adding l.110 :\nSettings.set('app_language', I18n.getLocale());\n. I forgot to add a return, it could break here. @Gnuns can you add it for me ?\n. That's only true with osx, why if windows or linux ? \nis it possible to use grunt-node-webkit-builder module ?\n. Please read i18n-node module for singular and plural. you can use this:\n\"unit\": {\n        \"one\": \"%s minute\",\n        \"other\": \"%s minutes\"\n    }\nand call :\ni18n.__n(\"unit\", \"units\", 1) display 1 minute\ni18n.__n(\"unit\", \"units\", 3) display 3 minutes\n. seems this is wrong, remove line 63-70\n. please verify your tabulations\n. ",
    "vinkla": "Thanks!\n. @sirmackan +1\n. Oops, sorry about that. Good catch @sirmackan!\n. Ah okey, sorry about that.\n. ",
    "byCedric": "Haha, it came out sooner than I expected. Thanks!\n. ",
    "c0b41": "\nIf the first two will be added to handle the installer fixes and new translations can be added to words only\n. ",
    "PerfectSlayer": "You're welcome =)\n. Yep I could.\nJust gimme some minutes…\n. The merge commit was added. Should be fine now.\n. Subtitles should be checked only when the details of a movie is shown, not in the movie list.\nAnd subtitle files only downloaded when the user request to display it (and only the lang he choose).\n. Yep, I could have a look ;)\n. I have a working prototype but I need more tests before pushing.\n. Could be fine if the infinite scroll fixes be merged.\nI could continue to improve UX and rendering about it.\n. Infinite scroll is available for each categories and popular movies (not for search).\nI'm trying to improve CSS animation but the page and genre variable bug does not help to make tests…\n. :+1: \nGood idea ! Hurry to try it ;)\n. :+1: Thanks\n. :+1:\nSubtitles should be sorted by language translation, not by language.\nOtherwise, they will not be ordered on display.\n. :-1: I like the capability to pause video on clicking it (like youtube).\nMoreover, I saw an other issue with click / doubleclick event.\n. ",
    "alandawi": "Japanese, Italian ... never say never right?. You have to think big.\n. ",
    "gnuns": "Acho uma boa ideia também trocar \"sci-fi\" por \"Ficção científica\", \"thriller\" por \"Suspense\" e \"western\" por \"Faroeste\".\n. Ok @jeromelefeuvre, thanks for the comments.\nI was in doubt if I could change the i18n.js, so...\nI will fix all this ;)\n. We can also create a 'languages.js' file with a var listing all available languages, something like:\nvar languages = {\n    'en' : 'English',\n    'pt-br' : 'Português/BR'...\n. Yes, sure. :P\n. Hey @Patineta, have you seen this? :X\n. Ok!\n. :+1: \n. nice, but please check ja, tr, sv, ro and pt-br language files.\n. :+1: \n. done!\n. ",
    "caarlos0": "Oh, sorry... I searched for gitignore and find nothing... I should have search for node_modules also.\nCheers!\n. ",
    "caiodias": "This is already implemented.\n. I'm sorry rpaggi, I just translate the language packs for the interface. Just forget my comment.\n. Yes, but at moment I do not have time to implement this.\nOn Tuesday, March 4, 2014, Thibault notifications@github.com wrote:\n\nIn js/app.js:\n\n@@ -33,7 +33,7 @@ var\n var i18n = require(\"i18n\");\n i18n.configure({\n   defaultLocale: 'en',\n-  locales: ['en', 'de', 'es', 'fr', 'nl', 'pt', 'ro', 'tr'],\n-  locales: ['en', 'de', 'es', 'fr', 'ja', 'nl', 'pt-br', 'pt', 'ro', 'sv', 'tr'],\n\nDon't you think it's better to make that dynamic? So next time we don't\nforget a language by mistake?\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/185/files#r10286032\n.\n\n\nCaio Dias\nhttps://about.me/caiodias\n. ",
    "eduardofiorezi": ":+1: \n. ",
    "melonboy": "\"Supenso\" is wrong, the correct word is \"Suspense\". The translation for \"All\" is \"Todos\" but \"Popular\" is more appropriate.\n. La verdad que yo también veo mejor usar \"Thriller\" ya que tanto en España como en Latinoamérica es usado y hay que buscar la traducción más neutra posible. También añadir que en España \"Suspense\" es la traducción correcta. http://lema.rae.es/drae/?val=suspense\n. ",
    "Foxandxss": "Yup yup, I agree with @melonboy \n. I am Spanish native (from Spain) and I never heard someone saying: Vamos a ir a ver una pelicula de suspenso.\nI see you're from south america, maybe there is called that way. Maybe we should do two different spanish, latin and spain one.\n. Yeah, it is just a difference between latin spanish and spain spanish :)\n. I agree 200% with that, I would just leave Thriller, at least on Spain that is really really used.\n. :+1: for me. Even when it depends on the country, they sounds quite better for me.\n. ",
    "icsvortex666": "The correct translation to Thriller would be \"Suspenso\" in spanish, I know that because I'm a native spanish speaker and at least that's the spanish name for that genre in particular. Suspense is an english word and the proper translation would be that of \"suspenso\", for us, the spanish speaker users.\n. I agree with Popular, but then again, you could have both, Popular by the users and All, to see the whole library. Just a thought\n. Y tampoco una película de suspense\n. Even Thriller fits better than suspense. These days almost everyone know that word. But I'm pretty sure, Suspenso is the correct word for this. I mean take it or leave it, but that should be the word.\nCheers :)\n. And also In latin america. Thriller it is.\n. ",
    "dimartiro": "Me sumo para apoyar la decision de dejar Thriller, todo el mundo sabe lo que significa.. Aunque es cierto que al menos en america latina suspenso es valido y muchas veces se escucha decir \"vamos a ver una película de suspenso\"\n. +1 Blue\n. Hay algunos que los veo innecesarios, pero otros vienen bien. También depende del país\n. can't wait\n. Great :+1: \n. Yo preferiría dejar \"Bélica\" y el cambio de \"está\" por \"estas\" es muy \"argentino\" no tan latinoamericano, me parece que \"está\" es bastante genérico \n. genial :+1: no puedo esperar para que se haga el merge y verlo funcionando\n. Tengo la ultima version de master y todavía no veo la feature :cry: \n. Impecable lo bajo desde tu fork entonces y lo miro (no se xq no se me ocurrió antes)... estoy en mac las rutas son distintas pero igual ubico! Gracias por la feature!\n. +1 @nquiroz  mejor que quede genérico\n. ",
    "emerleite": "+1\n. ",
    "andrewvergel": "Good \n. ",
    "caffo": "+1\n. ",
    "fabiojansen": "+1\n. ",
    "caruccio": ":+1: Yellow is definitely the best color for subtitles. It would be nice to allow user to select the color too.\n. ",
    "HatScripts": "I certainly prefer white as my subtitle colour. It would be really nice to have a full-on customisation interface (colour, size, font, outline, shadow, etc.) for subtitle appearance, like the one in VLC.\n. The class names you added are all called flag-italian; should probably be flag-arabic, flag-swedish, etc.\n. Does this mean there will be a slight delay in playing/pausing (Approximately the amount of milliseconds that the double-click speed is set to in the Control Panel)?\n. ",
    "tapajos": "I'm still trying to figure out why it is triggering the event twice.\n. ",
    "EvandroZanatta": "@HatScripts +1\n@tapajos you have my support (+1)\n. @GonzaGonza this will be implemented for version 3?\n. :+1: \n. +1\n. what data should be inserted into JSON. I'll update the version pt-br\n. :+1: :\n. https://github.com/brai4you/popcorn-app/pull/1\n. \"Eu concordo\" would be used to accept terms of use. Have \"Eu entendi\" or \"Eu compreendo\" would be more correct because the user is reading a warning and then he says he understood what is being told.\n. I believe that the term \"Pesquisar\" is used more in Brazil than \"Procurar\".\n. @wopaum you think we should leave the way it is? \nI think I'll redo my commit with only other changes without changing \"legalDisclaimerAccept\" and \"search\".\n. @mccraveiro  agrees to keep only the other changes, and leave it all translations of \"legalDisclaimerAccept\" and \"search\"?\n. @mccraveiro but analize and see that my upgrade was made based on her. I created a \"fork\" of your code and changed a few things more. For example words with drop cap which is not the beginning of the sentence and it is not the name of something.\n. @mccraveiro  @wopaum I'll redo my commit, directly in main file, without changing more delicate things.\n. ok, thanks, had no idea how to implement this correctly\n. :+1: \n. From what I saw the trailers are working properly. But the trailers are displayed in English without subtitles. \nUnable to translate the summaries, there is a problem I'm using the \"pt-br\" version?\n. @abadfederico believe it can still be implemented in version 3, just needs some improvements and translations. \nBeing able to see the trailer before deciding which movie to watch brings a better experience for the user. At least I enjoyed it.\n. @brai4you  I'll redo the sentence. Have you implemented the code to translate or provide summaries in other languages​​?\n. @brai4you translation function of the synopses is now working in all languages \nYesterday I downloaded the code from your \"fork\" and was unable to test this function.\n. @brai4you I am soon going to check the code again\n. ok, I will test it now\n. man, this is very, very good. Just missing settling the question of the color of the button and translate it. \n@abadfederico @Patineta I believe that this may already be available in version 3.\nTranslation Looks great, no errors. Gave to perfectly understand what was being said.\n. ",
    "maracaipe": ":+1: \n. I think change the cursor style to cursor: pointer to improve the UX in the \"X\" button is a great idea! What do you think?\n. This is related to third point on issue #308.\n. Don't like it, i play/pause the video by clicking the player, but the current mode is bad. I made a pull request (#389) to change from onMouseDown to onMouseUp.\n. ",
    "fpgentil": "+1 \n. ",
    "davidgumberg": "Hey! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. Hey @HJerem! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. Hey! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. Hey @brai4you ! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. Hey! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. Hey! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. Hey! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. Hey! Thanks for the contribution! Unfortunately this project is no longer being maintained, but it is being forkd by the very reputable folks at YiFy, so please resubmit your pull request to: https://github.com/Yify/popcorn-app\n. ",
    "pvieito": "Indeed, and it's really annoying. Luckily this time I can change the code of the app but other times I have to enjoy the flickering... ;)\n. ",
    "sirmackan": "I say keep the language names native in all languages, don't translate them.\n. Original issue in #62, great job!\n. I tried it out now, it looks really nice! (y)\nFor me it only loads 100 movies though? :)\n. Short version looks better :)\n. Remove the \",\" för the last value?\n. ",
    "thibaultcha": "I didn't quite get what's your idea, sorry ^^ Could you develop a little?\nMy idea about this yesterday was to put those languages in the reference language (let's say en.json as I set it or es.json if you want to change it later) and have a property:\n\"genres\": {\n  ...\n},\n\"languages\": {\n  \"english\": \"English\",\n  \"french\": \"Français\",\n  ...\n}\nand so on. Only for the ref language, and in the test cases we handle it (and we test that the ref language has those language properties also)\nBut we can't access it from other languages... Mhhhh.......\n. > and then extend individual languages\nIf I think right, you want to extend a basic language file (with languages props) for each language. Yes, that would be the best but I can't see a way to do this with JSON files.\n. Yes but it would be separated from the i18n module which only works with JSON files I think.\nBut after all why not, since this is no translation anymore, why would we want to let them in the language section... We could have a custom JSON file with those language names string and load them via a custom method rather than using i18n.\n. Should I do that then? Or do you want to merge and do it later on your own?\n. New commit to dynamically load languages, so we are sure we don't forget one along the way, plus it's easier for future contributors to translate the app without having to search in the code, especially if they're not familiar with it.\n. I see everybody translating languages names, adding languages, and creating a new PR just to add the language in app.js, new PR just to translate the new language names... (see 0c98379) it's a bit chaotic...\n. Don't you think it's better to make that dynamic? So next time we don't forget a language by mistake?\n. ",
    "rixlabs": "Italian translation!!!\nlet me know if you need something else\n. ",
    "barraponto": "Red is better ;) :bike: \n. ",
    "wsyms": "Red is in my opinion too Youtube-ish, this helps Popcorn Time create it's own identity. But in the end the community decides not just me. ;)\n. Great, can't wait to have this merged to the branch!\n. ",
    "luizfonseca": "+1. \nI second that @wsyms\n. ",
    "ivanhovic": "Cierto, también depende del país. ;)\n. ",
    "HJerem": "My first commit, so honored it's for this awesome app :). Thanks a lot to you guys !\n. Ok thanks, I will make a new pull request.\n. There are some things I don't understand on Github :smile: \n. I prefer the second one :disappointed: \nAnyway, I can change it, it's not important. \nSo let's take 1h 27min\n. 1h 27min or 1 h 27 min ?\n. Done :white_check_mark:\nBut we will need to add new languages...\n. I added all new languages. Is something missing ?\n. It's not commited yet so I don't know if you have to do that.\nOtherwise, you can add\n\"durationUnitM\" : \"[TRANSLATED]\",\n\"durationUnitH\" : \"[TRANSLATED]\",\n. ",
    "eduardomartines": "@wsyms :+1:\n. @Patineta my pleasure ;)\n. :+1: \n. :+1: \n. ",
    "download13": "For the other two commits, one just turns all the separate preventDefaults into one, and the second makes checkInternetConnection use a HEAD request.\nShould I have just kept the url lib in the function or was it okay to put it in the top?\n. ",
    "gigitux": "Ok, thanks :) \n. ",
    "ghost": "I fully endorse this idea. VOD in Poland is utter shit and this could be a nice solution until Netflix or Hulu decides to grace us with their presence :)\n. @Patineta \nTranslation was made by @SaperR  not me, but your welcome :P\n. Nice\n. Ya te lo podes descargar y usarlo desde github\nIgual encontré un bug bastante grande, en que a veces no es el trailer de la pelicula que seleccionas pero ya encontre una forma de fixearlo y estoy en eso\n. Ahora uso otro metodo con el API the youtube y muestra bien todos los trailers de todas las peliculas.\n. Para evitar errores incluyo el año de la película en la búsqueda del trailer\n. Es que tienen que aceptarla ellos para que salga en su repo.\nMientras tanto podes descargarla de aca: https://github.com/brai4you/popcorn-app\ne ir a \"C:\\Users[user name]\\AppData\\Roaming\\Popcorn Time\\app\" y remplazar con lo que tenes en el .zip para activar la feature\n. yep, i added\n. I understand, when the new design is ready I will adapt the code\nthx for read\n. Exactly! :)\n. I think it should be UA not UK\n. Sorry, my bad.\n. @EvandroZanatta \ni dont have idea how to says \"translate synopsis\" in pt-br \nIf i search trailers with subtitles, it is possible false positives\n. yep, all languages availables in api.yandex.com\nIs set depending on the language used in the system\n. @EvandroZanatta maybe it was editing something\n. or probably you downloaded the master \ntry download this: https://github.com/brai4you/popcorn-app/tree/translate-summary\n. FYI: https://github.com/popcorn-time/popcorn-app/pull/441\n. FYI: https://github.com/popcorn-time/popcorn-app/pull/441\n. @montogeek git.popcorntime.io\n. this api could get false-positives\nex: http://trailersapi.com/trailers.json?movie=12%20years%20a%20slave (12 years a slave) get trailer of \"How to Train Your Dragon 2\"\n. ",
    "jkaberg": "Why not just add all the available subtitle languages on yifysubtitles.com?\n. ",
    "jpalumickas": ":+1: \n. @Patineta no problem :wink: \n. ",
    "giulianodipace": "+1 por Terror.\n. ",
    "HeyTech": "how to add a picture to the flags?\ni want to add this flag to the arabic subtitle i.imgur.com/Jh6SlI3.png\n. @web93onv i made a new repo and sync the files to it.\nhttps://github.com/HeyTech/popcorn-app3/blob/master/images/arabic.png\nhow can i submit it to this repo?\n. can't you make it with every category? \n. add this too\n'arabic' : 'العربيه / Arabic'\n. @Patineta i have already modified everything. \nUpdate _moviedetails.scss #565 \n#538 #537 #536 #535 #534\nand the pictures here\nhttps://github.com/HeyTech/popcorn-app3/tree/master/images\n. @haneefmubarak sorry my man, i will think about it next time ^^\n. thanks for notice\ncouldn't edit it so i made a new one. #565 \n. ehh noo, what about if i want to surf during the movie? \n. @kerberoS that isn't correct, well it's understandable but it's not correct .. either you change it back or \"vänligen vänta...\" \n. Sorry i don't know how to commit them all together :/\nUpdate yifysubtitles.js #637 \nUpdate torrents.js #636 \nUpdate opensubtitles.js #635 \nUpdate player.js #634 \nUpdate app.css #633 \nUpdate sidebar.js #630 \nUpdate _moviedetails.scss #629 \n. Sorry i don't know how to commit them all together :/\nUpdate yifysubtitles.js #637 \nUpdate torrents.js #636 \nUpdate opensubtitles.js #635 \nUpdate player.js #634 \nUpdate app.css #633 \nUpdate sidebar.js #630 \nUpdate _moviedetails.scss #629 \n. Sorry i don't know how to commit them all together :/\nUpdate yifysubtitles.js #637 \nUpdate torrents.js #636 \nUpdate opensubtitles.js #635 \nUpdate player.js #634 \nUpdate app.css #633 \nUpdate sidebar.js #630 \nUpdate _moviedetails.scss #629 \n. Sorry i don't know how to commit them all together :/\nUpdate yifysubtitles.js #637 \nUpdate torrents.js #636 \nUpdate opensubtitles.js #635 \nUpdate player.js #634 \nUpdate app.css #633 \nUpdate sidebar.js #630 \nUpdate _moviedetails.scss #629 \n. Sorry i don't know how to commit them all together :/\nUpdate yifysubtitles.js #637 \nUpdate torrents.js #636 \nUpdate opensubtitles.js #635 \nUpdate player.js #634 \nUpdate app.css #633 \nUpdate sidebar.js #630 \nUpdate _moviedetails.scss #629 \n. Sorry i don't know how to commit them all together :/\nUpdate yifysubtitles.js #637 \nUpdate torrents.js #636 \nUpdate opensubtitles.js #635 \nUpdate player.js #634 \nUpdate app.css #633 \nUpdate sidebar.js #630 \nUpdate _moviedetails.scss #629 \n. Sorry i don't know how to commit them all together :/\nUpdate yifysubtitles.js #637 \nUpdate torrents.js #636 \nUpdate opensubtitles.js #635 \nUpdate player.js #634 \nUpdate app.css #633 \nUpdate sidebar.js #630 \nUpdate _moviedetails.scss #629 \n. @mciparelli were should i put that code?\nand how can i send this picture to the pull?\nhttps://github.com/HeyTech/popcorn-app3/blob/master/images/arabic.png\n. @mciparelli i don't need to read, i learn by mistakes and someone tells me.. reading is boring... \nwhen i press \" compare across forks.\" i get the last i edited in my fork and not only the picture.. how can i delete the others? \nhttps://f.cloud.github.com/assets/6899838/2414390/013016ca-aaea-11e3-90ff-fd0bcf22422a.png\n. ",
    "web93onv": "You need to create a git repo locally, add your project files to that repo, commit them to the local repo, and then sync that repo to your repo on github.\n. Green button 'create pull request':\nhttps://github.com/popcorn-time/popcorn-app\nClick: compare across forks\nSelect: head fork - your fork\n. Missed comma fix - https://github.com/popcorn-time/popcorn-app/pull/505\n. No, UA = Ukraine (country).\nuk - ukrainian language.\nhttp://en.wikipedia.org/wiki/Language_code\nhttp://en.wikipedia.org/wiki/List_of_ISO_639-2_codes\n. ",
    "nfmelendez": "Please add this feature! or if you need more help, i can help you to improve the implementation\n. ",
    "pedrolucasmag": ";s no need to edit , it's just Synonyms\n. ",
    "mccraveiro": "@EvandroZanatta I do but these changes I've already done on #349 \n. ",
    "urtzai": "Great! I can't wait...\n. Gracias amigo! ;)\n. ",
    "Nirlah": "366 Already exists.\n. #366 Already exists.\n. #366 Already exists.\n. #413 has more hebrew fixes.\n. Not yet ready... Closing.\n. Both yifysubtitles & opensubtitles supports Hebrew subtitles.\n. ",
    "michaelh03": "for hebrew subtitles, you need to change the subapi.com response and this api is closed.\nonly the owner of this api can add more subtitles languages.\n. subapi can bring hebrew subtitles?\n. did you test this? i try also to add this code but the subtitles doesnt work :\\\n. ",
    "cmagan": "joining the request for hebrew subtitles\n. ",
    "amiad": "How I can add (or ask to add) Hebrew to subapi.com?\n. ",
    "harush": "joining this request\n. ",
    "KingYes": "+1 for this pull ! :)\n. ",
    "j0k3r": "PR no more valid since 6b586243d6de0313e4a51761548dce9cc6721166\n. ",
    "ivantodorovich": "Most desktop players don't play/pause on click. It's common on the web, but not so much on desktop. Its annoying when you try to drag the window, or when you doubleclick to go fullscreen.\nMaybe Play/Pause shouldn't be triggered by mouse click at all. What do you think?\n. https://github.com/popcorn-time/popcorn-app/pull/644 PR to fix a bug with maximize/fullscreen\n. That's ok. I thought It was already merged to master o_O (https://github.com/popcorn-time/popcorn-app/commit/096bd57f87026a594a4642a6d4ef83a42b273209 by @Patineta)\nAm I missing something?\n. Beware of bug. Line 233 should be:\nif (path.extname(this_.src_) === '.zip') {\nI saw @Patineta fixed this in another commit later on. (https://github.com/popcorn-time/popcorn-app/commit/10bba98cba5a2884d97b23a914ba1d8f6093bb48)\n. ",
    "JeffCost": "Does not apply anymore.\n. ",
    "prcastro": "I did the following (always on popcorn-app directory):\nInstalled grunt with npm:\n$ npm install -g grunt-cli\nInstalled the modules with:\n$ npm install\nBuilt with:\n$ grunt\nGot the following message:\nRunning \"compass:dist\" (compass) task\nWarning: You need to have Ruby and Compass installed and in your system PATH for this task to work. More info: https://github.com/gruntjs/grunt-contrib-compass Use --force to continue.\nInstalled grunt-contrib-compass with (as specified by the \"more info\" link):\n$ npm install grunt-contrib-compass --save-dev\nI already got ruby on my PC, so I runned Grunt again, and got the same message.\n. Thanks! The app was built, but I got into issue #403 \n. This issue can be closed now...\n. ",
    "comzeradd": "Fixes #325 \n. This repo is no longer maintained. The project has been forked here. I opened the same PR.\n. ",
    "ageorgios": "+1\n. ",
    "zzecool": "+1 please add this one\n. ",
    "yannisc": "+1\n. ",
    "nhsz": "I think it should be \"Descárgalo\", unless you're using es-AR.\n. El problema es que dice Popcorn Time a secas, entonces es ambiguo, le falta contexto para definir el género. En inglés no tenés ese problema porque diría \"download now\" y vale para ambos. Este es un texto que aparecería en el auto-update? Sino se puede cambiar la frase por\n\"Popcorn Time %s acaba de salir. ¡Descargar!\" \nó \n\"Popcorn Time %s acaba de salir. Click para descargar.\", etc.\n. ",
    "sergiotapia": "I agree, Descárgalo is even better.\n. If this said, La aplicacion then it would make sense to use Descargala. But since it's using Popcorn Time it makes better sense to use Descargalo.\n. ",
    "cadesalaberry": ":+1: \n. From github help wiki, it makes sense to change to https.\n\nUse these URLs for users that are behind a firewall or proxy. Many firewalls will block the ssh URLs from working.\n\nAlso\n\nTip: You don't have to enter your password every time you use an HTTPS URL, check out this guide for more info.\n\nBasically it allows not dealing with ssh keys.\n. ",
    "1ace": "\nGitHub doesn't officially support the Git protocol anymore.\n\nWhere did you see that?\n. Well, that change seems to have these consequences :/\nFor now I'll have to revert your changes locally…\n. @luuse ~~I did not encounter that peerflix problem, but if it's still an issue,~~ it's indeed related to that commit.\nNevermind, I just hadn't tried the result of my compilation :/\n. ",
    "vonbirdie": "Also they didn't mention port 9418 on this page before which made me mail them and ask why. Their response was that they didn't support it and that i should use HTTPS instead.\nAs far as i know you don't need to enter any credentials at all for HTTPS as long as you only need to read from the repo.\n. But regardless the port is still blocked by a lot of firewalls so it they won't be able to build it as it is now :)\n. @zachlatta the git protocol doesn't run on port 22, it runs on port 9418. SSH runs on port 22 but it never used SSH.\nWhile i mainly refer to corporate firewalls where Popcorn Time probably never will be built to begin with using HTTPS doesn't cause any problems and adds some security (the server will be verified with tls). Is there anything concrete about it you don't like?\n. @1ace yeah, sorry, that's my bad :/. Had forgotten to make it git+https. NPM thinks it's regular tarballs now. I made a new pull request that fixes that. The popcornflix/peerflix problem seems to be related to 10bba98cba5a2884d97b23a914ba1d8f6093bb48 though?\n. I've added support for linux32 and renamed linux to linux64.\nBut my reasoning for making it the default to only build for the current platform is that contributors and users probably only want to build for their current platform and making it as easy for them to do so as possible might help reduce the number of incoming questions.\nThe only ones that i can think of that cares about building it for all platforms would be core developers and maybe some Linux package maintainers that still need to worry about linux32 and both of these groups probably either read the documentation and quickly get accustomed to adding the --platforms flag when needed. If you want i could add this\ngrunt nodewkbuild --platforms=all\nto build for all platforms? Does that sound good?\nI can switch it to build for all platforms as default if that's what you want though?\n. @GonzaGonza it should detect all platforms correctly now and everything works as i would expect it to so i'd say it's ready to merge?\n. I added the option to build for all platforms with --platforms=all but i'd say everything is ready to be merged now :)\n. Thanks :)\n. @ohwhen I can't reproduce that and it doesn't feel like it has anything to do with this or? I agree with your that there probably should be a clean task\n. ",
    "zachlatta": "Honestly, if a firewall blocks the port for the Git protocol, it's likely they also block the ports for torrents.\n. @Patineta I don't think this was a good change. If port 22 is blocked, I'd be surprised if the ports for torrenting aren't.\n. ",
    "hugodias": "I believe that 95% of Portuguese subtitles are from the Brazil Portuguese, and not from Portugal. I'm saying that because i just watched like 20 movies already and none of it have a Portugueses (from Portugal) subtitle.\n. ",
    "kissferenc": "Mikor várható, hogy teljesen kész lesz?\n. ",
    "mmcdole": "@zeppelin, if you weren't ready to have this merged why did you submit the PR?  If I were you I would have your changes remain in your fork while this remains a WIP and submit the PR when you are done.\n. ",
    "zeppelin": "@mmcdole hey, sorry! It's customary for some OSS projects, to recieve early feedback. Might not be too helpful here, but I couldn't avoid the old habits ;)\n. @mmcdole ah, one more thing while we're here: can you help me to get the subtitles working? They doesn't seem to show up, do I miss something?\n. @hunscream I've seen a couple PRs from you, how about us joining forces? ;)\n. @hunscream en is :) A feliratokkal elvileg megvolnek, megsem mukodik...\n. @hunscream lehet, max nem ertik :)\nEsetleg Skype? Ugy gyorsabb. Usernevem: xeppelin\n. @mmcdole I see the app uses subapi.com, however their JSON doesn't include Hungarian. Is there any way to contact them?\n. @mmcdole Ready to merge.\n. While Hungarian subtitles are supported as of this commit in theory, currently subapi.com doesn't provide any. #294 \nNonetheless, It's good to have it in the app, because when the support for such subs arrive, it should automagically appear for the users.\n. @hunscream Updated language/hu.json with your suggestions. Thank you!\n. @zazo-hun @tothf @hunscream Replaced \"Mégsem\" with \"Mégse\". Thank you guys! :)\n. @bery08 https://github.com/popcorn-time/popcorn-app#building\n. @kisst Unfortunately @LuckyThirteen is right. Subs should appear as soon as it get supported by subapi.com.\n. ",
    "hunscream": "Well, I just want this awesome app in my native language. :)\n. Lehet itt anyanyelven is írni?\nSzóval, igazából csak úgy átfutottam a témán, nem néztem körül teljesen, vannak fájlok ahova még be kellene illeszteni a magyart, mint például a player.js-ben (egy sor), de most nézem utólag, te már megtetted.\nA feliratokat pedig egyeztethetnénk előre, például:\nMégse az legyen Mégsem, hivatalosabb.\nA language/hu.json-ban pedig hibát vétettél, az egyik sor szerepel angolul, és magyarul is.\nAnimált helyett lehetne Animációs, Krimi helyett Bűnügyi, de a Krimi is elfogadott, amit én írtam, az szintén csak magyarosabb.\nMystery lehetne Misztikus, mégiscsak magyar, és létező film műfaj.\n(Nem próbáltam ki az alkalmazást a magyar nyelvvel még.)\n. Great work guys! ;)\n. A Fantasy magyarra átírva (Fantasztikus) helyes döntés volt, a többi módosításoddal viszont nem értek egyet. Bűnügyi, mint szó, az magyar, nem pedig egy másik nyelvből áthozott szó.\n. Legyen, OK.\n. ",
    "tothf": "@zazo-hun Thanks that you've let me know. I've closed that PR.\n+1 for \"Mégse\" http://www.e-nyelv.hu/2010-12-28/megse-megsem/\nFranky\n. ",
    "norbert-berenyi": "Mivel tudom Buildelni a projektet?\n. ",
    "kisst": "@zeppelin Did you build it yourself and tested ? I just did with the latest version which already include this PR but no HUN subtitles are coming up.\nAbout the build I'm planing to update the wiki, it's not trivial enough yet (imho)\n. ",
    "mikkabouzu": "@kisst : I think subapi currenly doesn't support hungarian subs, that's why nothing shows up.\n. :+1: \n. @HatScripts exactly, there is a slight delay because of this unfortunately (300 millisec), when one is using click to play/pause (but on the other hand the spacebar works without delay).\n. :+1: \n. :+1: \n. ",
    "neuromancer": "Thanks for the clarification. Please consider to clarify any optional/mandatory tracking inside this app in the official website (probably in the FAQ). Just my two cents. \n. ",
    "ukd1": "@WikiDZe why change the indentation?\n. @WikiDZe you've also re-indented half the file - see L2 before and after. You should undo that and leave just your change.\n. ",
    "WikiDZe": "@ukd1 Correction of a sentence which has changed direction.\n. ",
    "jduncanator": "To be honest, I'd have simply colored the close button red to emphasize its presence. Then when hovered it can be tinted dark. That way you maintain style consistency and don't have slightly larger buttons here and there. What do you think?\n. Full screen overlays everything including the task bar. The maximise button simply fills the User space screen.\n. @popcorn-time Can we get this merged? I can't do anything at the moment unless I manually edit the packages.json file so I can pull in dependencies.\n. @simofacc No. You misunderstand how my pull request works  Under normal circumstances you would be correct, however npm's Git (and GitHub) support is lousy at best and screws up under most platforms. It also requires the user to have Git installed and in their PATH.\nThe method I have used actually uses npm's tarball install feature that will grab the tarball from GitHub, extract it, and install it from the tarball. This way, we aren't cloning an entire repository recursively, it removes the dependency for Git and also has better support across platform.\n. @simofacc Yea. I would have much rathered to have used the Git URLs however on Windows I just could not for the life of me get it to work. Browsing over the NPM source code it actually looks like using the GitHub feature of NPM (eg. \"package\": \"github-user/repo\") actually internally grabs the master tarball anyway (however that GitHub feature is even more broken than the Git one)!\n. @Sekhmet Did you even read my above comment?\n. ",
    "LightDust": "Your idea is good too.\nI thought the problem was that users could not guess what was green and yellow for.\nIn my opinion the green button is redundant with the fullscreen toggle.\n. Please @Patineta consider taking this patch into account as subtitles are not well sorted for the moment.\n. ",
    "martuanez": "Hi there the app is now here:\nhttps://github.com/popcorn-official/popcorn-app\n. Hi there the app is now here:\nhttps://github.com/popcorn-official/popcorn-app\n. ",
    "ihor-sviziev": "+1\n. ",
    "zbrox": "Most people will probably build only for their current platform. The --platforms=all option seems reasonable to me.\n. Доколкото виждам сме се дублирали - #462 И на мен не ми беше ясно за субтитрите, затова просто направих като теб и нацъках всичко. :)\n. Yeah, that would be great.\nTo be honest I wasn't sure if I should've kept them singular or not, I \njust had some sort of a \"return to the childhood\" moment and remembered \nhow they were in the local video rental store :) I agree it's best to be \nconsistent and keep 'em all in singular.\n\nGenadi Samokovarov mailto:notifications@github.com\nMarch 12, 2014 at 2:15 PM\nYeah, missed that. Sorry for the dup :)\nWanna combine the efforts? For example I love you flag (as my colors \nsucks), but I also like that the genres in mine translation are all in \nsingular form.\n/( Let's keep the conversation in English, so the other guys can \nfollow it as well :)/\n—\nReply to this email directly or view it on GitHub \nhttps://github.com/popcorn-time/popcorn-app/pull/513#issuecomment-37406364.\n. I pushed the genre translations from your bg.json file. I made two small changes - one fixed typo and also I changed the case of \"Научна фантастика\", because technically in Bulgarian only the first one should be upper case. I hope that seems ok.\n. \n",
    "localhots": ":+1: \n. ",
    "pavelbinar": "Tested - works well. :+1: \n. ",
    "gsamokovarov": "Yeah, missed that. Sorry for the dup :)\nWanna combine the efforts? For example I love your flag (as my colors sucks), but I also like that the genres in my translation are all in singular form. \n( Let's keep the conversation in English, so the other guys can follow it as well :)\n. :+1:\n. Yep, seems great.\n. Thats still a monkey patch. I don't override the onClick handler with a noop, because it will just waste CPU cycles. That way, at least, we don't respond to the mousedown event at all.\nIts hacky either way.\nEDIT:\nThis is a response to a comment that got deleted. It was:\n\n@gsamokovarov : you don't need to monkeypatch videojs if you want to disable the onclick play/pasue, you can just override the onclick itself:\nvjs.MediaTechController.prototype.onClick = function() {};\n\nLet it stay here for history's sake.\n. That's even worse. First it changes upstream (vendored) code, second those objects doesn't event respond to onMouseUp methods. (E.g. nobody bind events to such methods anywhere in those classes).\nI guess the patch was made directly from the GitHub interface (because of the patch-1 name) and it haven't been actually run. I ran it and it blows up the app with:\nUncaught TypeError: Cannot read property 'guid' of undefined\nSince the methods videojs wants to call are no longer defined.\n. ",
    "ahumellihuk": "This one fixes the issue. Good job!\n. ",
    "simofacc": "I think we also need to fix github URLs which I believe should be in the following format\n\"adm-zip\" : \"git+https://github.com/gpt-modules/adm-zip.git\",\ninstead of just \"adm-zip\" : \"https://github.com/gpt-modules/adm-zip/tarball/master\", otherwise I believe npm install would not work correctly and show errors.\n. Ok that is good then.\n. If we want to let the user choose if he wants to be tracked or not then it's fine, but otherwise it might not be needed.\nIn any case you should use a checkbox with the label \"Help us improve the application\" or something like that since the tracking is mainly used to track user actions.\n. Yes I agree completely.\n. ",
    "Sekhmet": "@jduncanator You should use git+https://, not https://\n. ",
    "mike1808": "+1\n. ",
    "Batistleman": "+1\n. ",
    "niyue": "+1\n. ",
    "ohwhen": "528 fixes it..\n. Oops...I just fixed it in my branch and submitted a duplicate pull request #531. Thanks for fixxing it, took me a little while to found out why my npm build didn't work. :)\n. @luuse perhaps there should be a clean task in the gruntfile, that cleans out the build folders? Because right now the build fails with a (ENOTEMPTY, directory not empty message. It should be possible with this grunt task https://github.com/gruntjs/grunt-contrib-clean\n. When you run the Grunt build twice, it gives me an error (for the Mac build) complaining that the folder is not empty.\nBut true, it isn't related to this PR...I hesitate to open up another PR before this fix is accepted.\n. This is a duplicate of #528 :)\n. ",
    "sanderversluys": "+1\n. ",
    "Link-": "This fix is better than the one referenced in #528 (Mac OS X 10.9.2)\n. ",
    "edgardz": "You need to put a 'git+' prefix before the dependency URL in package.json, like:\n...\n\"adm-zip\" : \"git+https://github.com/gpt-modules/adm-zip.git\",\n...\n. ",
    "gvangool": "If this is merged, it will also fix #516 and #521. But it will conflict with #540.\n. ",
    "ArtFeel": ":+1: \n. C opensubtitles.org\n. ",
    "rbhbokka": "добавить то добавили, а откуда они подгружаться будут?\n. ",
    "haneefmubarak": "@HeyTech next time, since these commits are related, you should do them all on one branch and then submit a single pull request for all of them.\n. (related to #533 #534 #535)\n. ",
    "ternel": ":+1: thx ;)\n. ",
    "clehner": "I was getting errors from npm about things being \"not a package\", but applying this patch allowed the dependencies to install properly. node -v v0.10.26, npm -v 1.4.3, OS X 10.9.2\n. ",
    "speedmax": "+1\n. ",
    "jayzeng": "@kerberoS why is this PR closed? zh-tw (traditional) is different than zh-ch (simplified)\n. May also try to pull Chinese subtitles (which is supported on opensubtitles.org)\nhttps://github.com/popcorn-time/popcorn-app/blob/master/js/frontend/providers/opensubtitles.js#L24 \n. ",
    "kristofferR": "@HeyTech That's exactly what this is for. This enables you to surf while the app is still visible in the corner of your screen.\n. @Patineta That's okay. However it is not that of a strong default setting, MPlayerX ships with it by default on OS X for example.\n. ",
    "sven777": "THX: azóta rájöttem hogy nem én vagyok az első\n. ",
    "maraoz": "Will try to make a more substantial contribution next ;)\nOn Wed, Mar 12, 2014 at 11:55 PM, Diego Peralta notifications@github.comwrote:\n\nThank you Manu! It's nice to see you around!\n\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/574#issuecomment-37495741\n.\n. \n",
    "mzgcz": "My pleasure!\n. ",
    "Jackmoo": "@Patineta Thanks! I've finished almost the whole translation in InnoSetup. However, since there's 2 types of Chinese, Traditional Chinese (used by HK, TW..etc) and Simplified Chinese(In mainland China), they used different LanguageID and CodePage(TW - BIG5, China - GB, not sure about HK). So It's better not to be confused with each other. \nOr maybe Chinese_Trad would be an option?\n. Thanks! I will contact them as well.\n. @Patineta I'm so sorry. Due to the browser/website auto-transformation, the content in icl was transformed from Big5 to unicode (I used the website for commitment ). That may cause some problems. I will fix this ASAP.\n. contributor used zh-tw not zh-TW in app/language/zh-tw.json\nnot sure if there's problem\n. ",
    "samccone": "How well does this work and which issues does it fix/improve?\n\nthis is a refactor of the movie tile view (improves the code and is non breaking), on a larger scale marionette is a collection of common design and implementation patterns. aka it will make writing and maintaining this app MUCH simpler. \n\nUsing raw backbone views is basically like reinventing the wheel, marionette takes the common patterns and abstracts them for you, while being super performant! \nLet me know if you have any other questions.\n. On a side note @Patineta I can fix this bug for you on the filter using marionette. Will do that next on this branch.\n. this needs to be \n@include animation(none);\n. Oh whoops! I was thinking we were using something like this https://github.com/ericam/compass-animation already.\nnm then! \n. ",
    "pyprism": "Ok . \n. Done\n. ",
    "juan1990": "I dont think so. It´s depends where are you from. Here in Argentina is descargala becouse the accent is in \"ga\"...so without tilde.\n. Yo lo dejaria como estaba antes, no lleva tilde ni \"video\" ni \"descagala\" por lo menos aca en argentina se acentúan en otra silaba o sea no lleva tilde. No lo toquemos.\n. bueno la app la crearon argentinos y por eso estaba escrito de esa forma y no hay errores de ortografía por lo tanto no era necesario cambiarla. Ahora ya no se sigue mas éste proyecto acá asi que no vale lla pena seguir con los comentarios. Si queres cambiarlo adelante.\n. no se sigue mas el proyecto aqui @montogeek podés seguir con https://github.com/popcorn-team/popcorn-app Saludos\n. yeah but I think is better the way it´s was before,  with usted or vos. I know that some people use different spanish but we can´t lost time with this...becouse we can´t all agree. It depends where are you from but there is no wrong words...so why to change? video, descargala y subtítulos quedaba mejor antes.\n. @cettox let´s us know when u can make the sub works please or someone who can.\n. ",
    "Madrigal": "Yep, I can see your point. If you guys are from Argentina is cool to keep it like that \n. ",
    "Potencial": "juan1990 el lenguaje dice \"español\" y esas palabras si llevan tilde en \"español\". Tu te refieres a \"español-argentino\".\n. ",
    "montogeek": "Chicos, ¿acá se puede seguir dialogando sobre esto o tenemos que movernos al otro repo?\n. :(\n. Both are accepted, I prefer vídeo.\n. That mixin doesn't exists.\n. Maybe in the future if the application has more animations would be a good idea to use it. Thanks :)\n. ",
    "mciparelli": "You could have asked?\ngit checkout -b css_js_fixes\ngit add 1.js\ngit commit -m 'patch-1'\ngit add 2.css\ngit commit -m 'patch-2'\ngit push -u <your-repo> css_js_fixes\nsend the pull request\n. @HeyTech are you really asking me where to put six lines starting with 'git'?\nI can only assume you don't know what git is even though you are writing here. \nI would recommend you to close your pull requests, have it a read, then use the code I gave you and come back with one pull request that includes all your translation changes.\n. ",
    "vigkrisztian": "Igazad van! A krimi helyesebb lenne.\n. \"crime\": \"Bűnügyi\" átjavítva \"crime\": \"Krimi\"-re.\n. ",
    "ucschrissy": "Hi, I've been following your work on building popcorntime for linux32, and is currently trying this method to make it work. \nJust a question though, but where do you local the file libffmpegsumo.so? I know that you have to replace it with daka90's file, but any idea which folder I can find it stored?\n. @myf i have the file from dako90 already, but where in my file system is the file that needs to be replaced?\n. Sorry, I realized that I am new to grunt and would really appreciate all the help you can provide me here.\nFrom the very first command (npm install), I am already getting an error. Here's the log file:\ninfo it worked if it ends with ok\nverbose cli [ 'node', '/usr/bin/npm', 'install' ]\ninfo using npm@1.1.4\ninfo using node@v0.6.12\nverbose config file /home/chris/.npmrc\nverbose config file /usr/etc/npmrc\nverbose config file /usr/share/npm/npmrc\nERR! Couldn't read dependencies.\nERR! Error: ENOENT, no such file or directory '/home/chris/Soft/Popcorn-Time/package.json'\nERR! You may report this log at:\nERR!     http://bugs.debian.org/npm\nERR! or use\nERR!     reportbug --attach /home/chris/Soft/Popcorn-Time/npm-debug.log npm\nERR! \nERR! System Linux 3.13.6-031306-generic\nERR! command \"node\" \"/usr/bin/npm\" \"install\"\nERR! cwd /home/chris/Soft/Popcorn-Time\nERR! node -v v0.6.12\nERR! npm -v 1.1.4\nERR! path /home/chris/Soft/Popcorn-Time/package.json\nERR! code ENOENT\nERR! message ENOENT, no such file or directory '/home/chris/Soft/Popcorn-Time/package.json'\nERR! errno {}\nverbose exit [ 1, true ]\nAny idea what seems to be the problem?\n. Hi, I've cloned and downloaded it. It make a new ./Popcorn-Time folder in Home\nNow, is this executable already, or do I still need to run/compile it with grunt?\nI tried to run it by using\nsudo run Popcorn-Time but doesn't seem to work.\nPerhaps you can give me a step by step here? :)\n. hi @myf oh, you mean literally run it like that. gosh. \nanyway, its running already and i'm just trying out if it's going to proceed to viewing after buffering is done.\nWe'll keep you posted and will surely follow your work. \nThanks brother!\n. @reddo try this:\ngit clone https://github.com/myf/popcorn_linux32 Popcorn_Time\nit should take about 5 mins to get all the files for that project to clone on your PC.\ngo to folder\nType ./Popcorn-Time\n;)\n. @myf hey man, with the compile that you gave me for the 32-bit, may I ask where the already watched movies are storing? \nwith the other source builds, it stores under /tmp/popcorn-time. However, i am running this build solely from the compiled github that you provided.\nAny ideas where the movies might be?\n. ",
    "myf": "Hi @ucschrissy , @dako90 's file is located in\nlibraries/linux32/libffmpegsumo.so\nOn Mar 13, 2014 8:56 PM, \"ucschrissy\" notifications@github.com wrote:\n\nHi, I've been following your work on building popcorntime for linux32, and\nis currently trying this method to make it work.\nJust a question though, but where do you local the file libffmpegsumo.so?\nI know that you have to replace it with daka90's file, but any idea which\nfolder I can find it stored?\n—\nReply to this email directly or view it on GitHubhttps://github.com/popcorn-time/popcorn-app/pull/648#issuecomment-37605142\n.\n. ah, in that case you have two choices,\n1) use the branch in this pull request https://github.com/myf/popcorn-app/tree/615_build_linux32 and run \nnpm install\ngrunt nodewkbuild\n\nthen you go to build/releases/Popcorn-Time/linux32/Popcorn-Time and run \n\n./Popcorn-time\n\n2) go to the master branch and run\n\nnpm install\ngrunt nodewkbuild\n\nthen you go to build/releases/Popcorn-Time/linux32/Popcorn-Time and replace the libffmpegsumo.so with @dako90 's file then run\n\n./Popcorn-time\n. hold on, let me give you a built version so you can use it in a bit\n. @ucschrissy i just created a new repo on github for the built version for lack of better ways to share...\n\nanyway here it is https://github.com/myf/popcorn_linux32\nclone it and run it by\n\n./Popcorn-Time\n. hi @ucschrissy , no worries, let's take it step by step :)\nonce you cloned it, just go to this folder (cd popcorn_linux32)\nthen you can see three files in this folder (if you do ls )\nthen all you need to do is type in your terminal\n./Popcorn-Time\n\nmake sure there is a dot and a slash preceding Popcorn-Time\nthen magic would happen :)\n. ",
    "cbeloni": "It's works! Thank you! \n. ",
    "reddo": "I've tried to run it as per your instructions, but mine get stuck on please wait screen and nothing happens, any idea why?\n. ",
    "Tuinslak": "Submit it here as well: https://github.com/isra17/popcorn-app\n. ",
    "isra17": "I started adding a settings page (https://github.com/popcorn-time/popcorn-app/pull/660). Perhaps this could be added there as well.\n. I believe it is a good practise to let the user knows his action are tracked by default and giving people the option to opt-out is quite important in my opinion. Especially in the case of Popcorntime where not everyone might like the fact they are sending usage data about illegal copyright infringment...\n. I think a fix could be to distinguish click from drag. A quick click should toggle the video and a drag should move the window without pausing the video. This should be doable by adding a small timeout after a mousedown event to see if there was a mouseup.\n. Duplicate: https://github.com/popcorn-time/popcorn-app/pull/344\n. ",
    "FGRibreau": ":+1: \n. ",
    "Subv": "I don't think video should have a tilde \n. ",
    "josemmo": "According to RAE, \"vídeo\" it's OK, but I think both words are accepted. http://lema.rae.es/drae/?val=v%C3%ADdeo\n. I agree with scumah. I propose creating two language files: \"es-419.json\" for Latin America and \"es.json\" for Standard Spanish.\nIn fact, most popular apps have both alternatives and movies are dubbed in Spanish for Latin America and Spanish for Spain.\n. Wait... I've just realised this project is closed. http://getpopcornti.me\n. ",
    "scumah": "In my opinion, with the app having no country-specific languages support, Standard Spanish, used mostly everywhere in this cases, should be the choice. Of course, since the team is based in Argentina, they may feel more confortable using their Spanish, which is completely rightful.\n. That comma! Cuidao! :D\n. ",
    "pepijn809": "Awesome :+1: \nIts seems the development as in forks is moving this way\nhttps://github.com/isra17/popcorn-app\nWill anyone move along?\n. I don't know if they already fixed it but it would be awesome if many people joint the project of isra. So that we are united at last. Having many different version/forks and revisions is not where i would personally like to be.\n. ",
    "schaitanya": "@pepijn809 +1\n. ",
    "cettox": "I was unaware that they also used yts.re api to replace notworking subapi.com, will look at https://github.com/isra17/popcorn-app\n. @thiagocifani I had to disable subtitles in order to get it working, but I am working on a subapi.com replacement to get it working as previous state.\n. @juan1990 @thiagocifani subtitles are back online https://github.com/cettox/popcorn-app/releases\n. @codexgit check out some legal torrent sources at http://wiki.vuze.com/w/Legal_torrent_sites, but many of them lack api's so you have to parse html and get torrent files.\n. @ale110 thanks.\n. ",
    "raulghm": "This fork is working, thanks!!\n. ",
    "thiagocifani": "Why I am not finding any subtitle option anymore? any thoughts?\n. ",
    "kirashi3": "@pepijn809 Yup I think that's the fork to move on to. Happy to help out any way I can, knowing little about programming but much about web design/HTML/CSS.\n. ",
    "notpushkin": "Pulled this into my fork, thanks!\n. ",
    "jakefb": "Hi, I'm hoping to fork this and use it for an idea that I have had for a while now. My project has a similar goal to Popcorn Time but will focus more on using legal torrent content for creative purposes rather than being purely for entertainment. I have been wanting to do this for quite a while now because YouTube has become more commercial what makes it difficult for people to share there content, especially if it gets taken down because of YouTube's strict policy for enforcing copyright - most recently for video games. I have been trying to integrate torrent videos into a browser but don't know how to do it without using a browser plugin like btapp. I don't like having to install browser plugins (especially flashplayer) so I think it is best to go entirely web based (HTML5 and JavaScript) or cross-platform client based. Peerflix works very well so I think I will have use a client for the time being. I found out about Popcorn Time after it had stopped working but the GUI looks nice so I thought I might be able to use that. I don't know much JavaScript but know a bit of C I am learning it as I go along. If anyone has suggestions or would like to help me I am open to it. Cheers.\n. @cettox Thanks I'm also trying to find a good way for people to upload torrent videos this could work http://burnbit.com/\n. ",
    "greg0ire": "After discussing with @L-P, it turns out there should be a better solution with an mkstemp javascript equivalent\n. ",
    "yate": "I have a question about asynchronous programming.  If findTrailer took forever to get a response back,  and you wrote var trailer = model.get('trailer') right after this.setTrailer(); on line 75, would trailer be undefined?  How can you avoid that?\n. "
}