{
    "mkuklis": "Thank you for reporting it! It should be fixed now.\n. Hi @rrevi sorry for the delay. I was able to look at your demo but I don't see the green color when I press the button. Were you able to fix it? If so would you mind posting here what was wrong?\n. Great thank you for the feedback. I will try to review it tonight.\n. It seems like JQM is not applying the right swatch in case of the data-role=\"button\". When I look at the source I see swatch c instead of g:\nhtml\n<a href=\"#\" data-role=\"button\" data-corners=\"true\" data-shadow=\"true\" data-iconshadow=\"true\" data-wrapperels=\"span\" data-theme=\"c\" class=\"ui-btn ui-shadow ui-btn-corner-all ui-btn-up-c\"><span class=\"ui-btn-inner\"><span class=\"ui-btn-text\">Yes</span></span></a>\nThis seems to be a JQM issue (not css). As a work around you can try to explicitly set data-theme=\"g\" to data-role=\"button\" elements.\n. Hey @kk86bioinfo I just added ttf font versions. Please give it a shot and let me know if it works for you. (Thanks for reporting this). \n. Thanks this should be now fixed.\n. hi @kenlaw we want to focus on >= 1.3. \n. @WayneHiller can you post an example  maybe in jsfiddle? Thanks.\n. @WayneHiller it seems like the mini versions do work for me. Please take a look here: http://jsbin.com/ocutec/1\nThis is based on jqm v1.3.0. Maybe the issue here is v1.3.1. I haven't tested it under v1.3.1 yet.\n. @WayneHiller I just upgraded to 1.3.1 and the problem seems to disappear. Could you give it a try and see if you can reproduce it? I love your idea about the store for jqm themes. Something similar to http://www.elegantthemes.com Are you a designer?\n. @WayneHiller this works fine if you remove jquery.mobile-1.3.1.css http://jsfiddle.net/pe54u/1/\nThe only css you need is jquery.mobile.flatui.css\n. @hessius you don't need to include jquery.mobile-1.3.1.css jquery.mobile.flatui.css is all you need.\n. @aboudard @arcoirislabs thank you guys for reporting and investigating it. I will look into it this tonight. \n. Thanks for reporting it. Would you mind creating a pull request? Thanks!\n. Thank you for the fix @nickycakes! \n. I think we are open for adding support for additional font icons but we would have to find an easy way to do it. Ideally it would be great to add support for any icon from http://fontello.com What do you guys think?\n. No this is not currently used but it would be great to replace the current setup with this kind of automated build. I will look into that maybe this evening. \n. @commadelimited, @aboudard apology for not getting back sooner. @commadelimited I like http://jqmiconpack.andymatthews.net/#/ and I will try to follow a similar path. It looks like fontello has an api we could use. I would like to integrate it into a build process to make everything dynamic / configurable. I'm in the process of creating a grunt task for fontello api. I think the next step will be to add the jqm css hooks like you've mentioned @commadelimited. I will get back to you guys here when it's done. \n. @sn3p @jonathannaguin we haven't tested it with 1.3.2 yet. We are not sure what will break with 1.4 but we will get there when it will get released.\n. We ran into a couple of rather bigger issues with 1.4 because their markup changed a lot. We are still working on it when we have a free time. We hope to release something soon. \n. @DURK sounds good. I would really like to wait for the official release just in case things change but will look into it this week and get back to you. Just out of curiosity how does the angular perform in the mobile environment? Would be curious to learn more.\n. guys some initial work has been done for jqm 1.4 you can see it here: https://rawgithub.com/ququplay/jquery-mobile-flat-ui-theme/master/demo/index.html There are likely some issues. My time if very limited lately so if you find something which doesn't work right please consider fixing it contributing back.\n. @edasque we focused our time on a new premium theme but we hope to come back and refresh this one at some point in the future. @tlkh it's nice to see your progress. Nice job! \n. @edasque I agree I wouldn't either. If you go to our store http://store.ququplay.com there is a preview of the theme. @tlkh I'm glad you are taking it further. Cheers!\n. this is early version but it is 'normal' for now. \n. Thank you!\n. thank you!\n. anybody interested in pull request?\n. @HazCod could you share your html page somewhere perhaps on http://jsbin.com/ We haven't touched this theme in a while so there could be a bug. What version of JQM are you using?\n. @HazCod thanks I'm busy with some other work right now but will take a look this evening and get back to you.\n. ",
    "rrevi": "Hi @mkuklis no worries. I fixed issue by adding the following code to color swatch C:\n.ui-btn-up-c.ui-btn-hover-c.ui-btn-active { color:#000;border: 1px solid #909090;background:#909090}\nCode above fixed issue in desktop browsers (Chrome and Safari on Mac OS X) but not on mobile browsers (Safari on iOS) so I then edited the following CSS class near line 294 .ui-btn-active with same property values (though that changes active button properties for all other color swatches)\nyou can view my edited jquery-mobile-flat-ui CSS File\nThank you for making this great jquery mobile theme!\n. ",
    "jvanulden": "Any progress on this? Using JQM 1.3.1 BTW.\n. ",
    "kk86bioinfo": "I think there is a typo in font.css that causes failure to link the ttf fonts. Please check. \n. ",
    "tomkuk": "I just fixed src path. It should be fine now. \n. ",
    "WayneHiller": "http://jsfiddle.net/pe54u/\n. Ya I agree I think it is due to jqm 1.3.1. Everything else seems to be fine so far. I will do some investigation and see what is causing the issue. Great work your doing by the way. There is a real shortage of modern jqm themes. It seems like we need a company to start building jqm themes and selling them, or at least have a place where designers could all share the themes in one place.\n. I did reproduce it in jsfiddle. I try it again. No I'm not a designer thats why I search the net looking all the time lol. I love this flatui and am using it in a large project. Im sure there are many developers out there like me that are great coders but not so great designers. I sure many would pay for good designs I know I would. \nMichal Kuklis notifications@github.com wrote:\n\n@WayneHiller I just upgraded to 1.3.1 and the problem seems to\ndisappear. Could you give it a try and see if you can reproduce it? I\nlove your idea about the store for jqm themes. Something similar to\nhttp://www.elegantthemes.com Are you a designer?  \n\nReply to this email directly or view it on GitHub:\nhttps://github.com/ququplay/jquery-mobile-flat-ui-theme/issues/7#issuecomment-18450995\n\n\nSent from my Android phone with K-9 Mail. Please excuse my brevity.\n. ",
    "hessius": "Doh! \nIf only every problem was this simple\nThanks!\n. ",
    "aboudard": "it works fine for me for the fixed position, though there seems to be like one pixel under the footer, it looks like it's not exactly on the bottom of the page ... did not investigate further\n. Can't seem to reproduce the pixel \"bug\" :| ... don't spend the night on this, if I run on it I would give you screenshots !\nThank you too !\n. Hello ! nice idea for sure !\nActually we could add icons based on the native icons of mobiles, and there are many that prove themselves very useful !\nI work on android and I could add some icons to this theme.\n. Oh great tool fontello !\nI think there should be a starter pack of icons and the possibility to build a add-on, I don't know, maybe the starter is irrelevant if the build is easy to use !\n. Yes you're right, that's why I thought that it could be some kind of add-on.\nThe initial project comes with the original CSS and the icons bundled and then user could build a specific css / images pack.\nGreat tool by the way !\n. ",
    "chrismeyersfsu": "Please adopt this patch!\n. ",
    "nickycakes": "Finally forced to learn git.  Will do.\n. ",
    "commadelimited": "Is that what you're using to generate the TTF file? Is there a way to add icons to a font, then save that build? Then users could generate the base font, but add their own on the fly.\n. The main problem is that the theme explicitly defines the available icons in the CSS file. If the user is responsible for building the whole thing then the theme becomes less usable straight out of the box. Perhaps something like my project http://jqmiconpack.andymatthews.net/#/ might be effective? This actually generates a CSS file with jQuery Mobile hooks already set up. Then you just include the font and the CSS. This could work really well in tandem with this theme.\nThoughts?\n. ",
    "sn3p": "+1\nDid anyone test this with jQuery Mobile 1.3.2 ?\nDocs/source tell me it currently runs on 1.3.1.\n. ",
    "DURK": "+1\nAny updates on this? JQM 1.4 has had its first Release Candidate so the final version might be released soon :)\n. Ah, I thought it'd be a big operation when I saw that they were focussing on performance, by reducing the number of dom-elements and operations. I'm working on a project in which we use this theme (or actually, the 'jquery-mobile-square-ui' variant) and we really want to upgrade to jqm 1.4 (possibly using angular-jqm).\nSo maybe we can help with whatever needs to be done to get this working with 1.4 :)\n. ",
    "0xfcryowbk2ca65z": "Jquery mobile 1.4 now supports it?\n. ",
    "edasque": "@mkuklis , is the work for 1.4.x complete at this point? Is this still being maintained?\n. @tlkh awesome, I'll take a look! Thank you\n. @mkuklis understood. I just wouldn't buy a jQuery mobile theme without being able to test it first.\n. ",
    "tlkh": "@edasque Since there's been little activity and author seems to have moved on to premium themes, I've been working on my own fork of this theme for a while now.\nhttps://github.com/tlkh/jquery-mobile-flat-ui-theme\nFully working with jQM 1.4.5, a few design tweaks, SVG icons instead of PNG (much better looking on high-res devices) and a new spinner icon.\n. @mkuklis thanks for laying all the ground work for this! Anticipating your future work indeed.\n. ",
    "fdummert": "The error cause is a dangling comma in following selector (file build_swatch.styl, line 119):\ncss\n    .ui-btn.ui-checkbox-on.ui-btn-{swatch}:after,\n        background-color: primary_color\nRemoving the comma and rebuilding fixes the issue.\n. ",
    "atti84it": "yeeeeppp!!! it works!\n. ",
    "MichaelReiter": "Didn't work for me.\n. ",
    "Happykiller": "I see same bug\n. ",
    "shamrocksu88": "@mkuklis Me ;)\n. @mkuklis Tried fix suggested here(http://stackoverflow.com/questions/15737575/double-scroll-bars-when-using-the-panels-of-jquery-mobile-1-3-in-asp-net-mvc-4) in my local. But didn't' work. Would be great if someone could help out.\n. @emetselaar Ya in mac the issue is not reproducible but in all Windows based browser I could see double scroll bars.\nTested in : Windows XP\n. @mkuklis Any temporary fix available?\n. ",
    "emetselaar": "I just tried it (Chrome Mac and iOS simulator / Safari) and did not see this.\nCould it be a specific browser issue?\n. ",
    "vamsiikrishna": "even tried with the min-height , way to fix it.\nstill getting 2 scrollbars( Ubuntu Chrome , Firefox )\n. ",
    "HazCod": "Update: I tried fiddling around a bit and it seems the radio buttons only work when placed directly under a div with role \"page\". (with a fieldset etc)\nIf you don't mind logging in via facebook/google/... (it's via auth0, so no worries); http://d00med.net/cordova/#question?id=4\nPage src: https://github.com/HazCod/Quackr/blob/master/js/templates/question.html\nIndex src: https://github.com/HazCod/Quackr/blob/master/index.html\nEdit: Could also be I'm doing the scaffolding wrong. hm.\n. @mkuklis ,no need to check anymore! I found it was because I was (somehow) using a controlgroup as a container for every page!\nThank you for your swift reply. jQuery mobile UI classes are confusing..\n. ",
    "lorenzosfarra": "Same here, any news after all this time?\n. ",
    "murillojorge": "I support this fix.\n. "
}