{
    "rafaelconde": "You are absolutely right! I've added it back along with a new Lockscreen artboard ;)\n. Actually it's still not updated to beta 6.\nOn iOS there's only beta 5 so far, and the Control Center background changed slightly, very very subtle, and I'm waiting for the GM to address it :+1: \n. Thanks Jason!\n. Thanks Mikko,\nThose guys did an awesome job, no doubt about it, and I got some ideas for elements to add in the future from them.\nThanks for sharing 👍\n—\nRafa\nOn Wed, Sep 24, 2014 at 8:10 AM, Mikko Tapionlinna\nnotifications@github.com wrote:\n\nThank you for the great resource!\nI had an idea for if you want to add more content and do not want to take screenshots yourself. Check out if this helps:\nhttp://mercury.io/blog/ios-8-illustrator-vector-ui-kit-update\nIt's sadly not in Sketch format, but it's the most extensive resource I've found so far. I do not mean that you should do everything in it, more like use it as a reference. :)\nReply to this email directly or view it on GitHub:\nhttps://github.com/rafaelconde/ios8-ui-kit/issues/5\n. Can you help me figure out what changed? :)\n. Are you kidding, it's the least I can do :)\n\nThank you.\nOn Thu, Oct 2, 2014 at 7:50 PM, Matt Sephton notifications@github.com\nwrote:\n\nHey, no need to name me in the readme. Happy to have helped and learnt some Sketch along the way.\nReply to this email directly or view it on GitHub:\nhttps://github.com/rafaelconde/ios8-ui-kit/pull/6#issuecomment-57683152\n. Hum... opens just fine here on my machine. Are you running the latest version of Sketch (3.1)?\n. I'll update the README file to say that 3.1 is required. Thanks guys 👍\n. I completely agree, and I plan to do so right after I get an iPhone 6 for myself (so I can get the screenshots the way I need them). \n\nIn the meantime I did the Homescreen for the 6 and 6 Plus, it's something :p \n. Thank you so much 👍\n. ",
    "mdznr": "Awesome. Thanks!\n. ",
    "gingerbeardman": "I added a new file with my changes, so you can cut and paste into the main file. See the files changed tab, above.\nWhat did I do? I took the bitmaps of the keyboards, and created vector versions.\n. Hey, no need to name me in the readme. Happy to have helped and learnt some Sketch along the way.\n. ",
    "chrysb": "I was having the same issue. Upgrading to 3.1 fixes this.\n. ",
    "Spacelapp": "+1\n. ",
    "edwellbrook": "+1\n. "
}