{
    "rap2hpoutre": "Good idea ! I will do something ASAP for this\n. I think it's a little more readable now (line breaks, etc.)\n. Ok thank you, merged !\n. Ok thanks ! Fixed in v0.1.10 :)\n(you only have to run composer update)\n. You can try this :\nRename your LaravelLogViewer class into MyLaravelLogViewer\nand add use Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewer;\n. Ok, thanks a lot for contributing. :)\nI'm sorry, but I won't accept this pull request for several reasons:\n- \"replace offet 0 error with no log files available message\": you wrote return 'No error files available.';. This is not only error files, it's log files.\n- About file suppression. Laravel log viewer is a log viewer, not a log manager. So I don't think it needs file management (delete, etc.) features. I think it will be only a viewer. Log rotate can be configured elsewhere I think. And deleting file can open security issues, so I'm scared about this (what if someone forges URL to delete a framework file ?)\n- I prefer one pull request for one fix/add if you can.\nCheers,\nRaph\n. Ok you can try something else:\nAdd this at the end map function in app/Providers/RouteServiceProvider.php\n$router->group(['namespace' => 'Rap2hpoutre\\LaravelLogViewer'], function($router) {\n    Route::get('logs', 'LogViewerController@index');\n});\nAnd remove the line you added in routes.php.\nIt should work. I will update README instructions asap.\n. Great (thanks for your working code :+1: )\n. Thanks!\nYou don't need to do this trick anymore in laravel >= 5.1. Documentation is already updated, just use:\nRoute::get('logs', '\\Rap2hpoutre\\LaravelLogViewer\\LogViewerController@index');\n(don't forget the first backslash)\n. Hi !\nThanks !\nI saw @AnthonyPorthouse made a fork to add overridable views : https://github.com/AnthonyPorthouse/laravel-log-viewer/commit/b92876c47fc17bc32325fbca73cc0c1abbc90ad4\nI hope he will do a pull request :) because I think it will help you to customize view.\nI don't know if you method will work with laravel 5 so I will wait before adding this to readme.\n. Ok, merged. I will create a release with this PR (now it's only on master) after some tests (@billionsales you can test too, if you want, it should work for you)\n. Release created, you can update to v0.2.0 now\n. 2.5GB ;) !! Ok I will try to optimize this. You can try to split your file\n. I will keep optimization in mind. Thanks you :)\n. Thanks !\n. (merged)\n. Ok thank you ! :)\n. @peppeocchi :D\nOk, you can submit a pull request for this if you want ! Thank you for contributing :)\n. Ok resolved in v0.2.1 (thank you !)\n. Thanks !\n. Hi,\nThanks for your feedback. The service provider was added by this pull request (https://github.com/rap2hpoutre/laravel-log-viewer/pull/11). The reason we add this is not to add support for Laravel 4 (this log viewer supports Laravel 4 anyway). The reason was some people wanted to add their custom view (example: https://github.com/rap2hpoutre/laravel-log-viewer/issues/9), and it was not easy. So now, thanks to @AnthonyPorthouse, it's possible. About your problem, if you don't want to use this package in production environnement, you can conditionally load the service provider.\nIn other words, I don't want to remove the easy \"customizing view\" possibility, I think it's a good improvement. I understand your problem, but I think it's not critical. I did not know Taylor Otwell said we should support L4 and L5 in separate branch, but I need to understand why. I made this package compatible with L4 and L5 because I wanted to make it simple as possible for users (that was my first goal from the beginning of this project)\n@JosephSilber @AnthonyPorthouse What's your opinion ?\nThanks for your feedback, hope we will find a solution.\n. Hi,\nWhat's your laravel version ? (it will help me to understand your problem) Can you try in a local environnement (with debug \"true\") ?\n. OK, I tried different things on fresh installs and I think I understood your problem.\nDid you add 'Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider' in config/app.php file (in providers section, line 147 on a fresh install) ? I hope it will solve your problem\n. :)\n. OK what is your laravel version and your log viewer version?\n. On a laravel 5.1 install you should write Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class,\n. Cool!\n. @xavierpernalete\nDid you add 'Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider' in config/app.php file (in providers section, line 147 on a fresh install) ?\nAfter that, run php artisan config:cache if it still does not work and you use config:cache . Ok, thanks. But what if I don't want this route ? (I want to use another, or protect it by middleware ?)\nBTW, In the first line of readme, I wrote : \"No public assets, no vendor routes, ...\". I think it's better to let user choose their routes :)\n. Ok, so I should not merge your PR, right ?\n. Ok, thanks.\nI'm sorry, but I won't merge, I think we don't need more complexity (default route, command, etc.) in this small package. It's really easy to install (3 steps), we don't need to add/modify steps.\nAnyway, thanks for contributing :beers: \n. Thank you :).\nI don't know what to think about this request. Why should we remove the pagination ? It's not better without: it seems less messy with it IMO. I think (not sure) people may not understand why we removed it. \nSo, the pagination is not needed (as you said, I agree) and there is no performance gain. But what will be the benefice if we remove this pager for everybody ? I don't know. What is your opinion ?\n. Not a solution, just a note: \nIn v0.2.3, it now uses local storage to save entry count per page (you can have a look at #22 ). So you can set entry to 100 to show more elements per page.\n. @osugregor Without answer, I will close this PR, OK for you ?\n. Thank you ! I ran it again and it's OK ! \nBut Scrutinizer found project got worse (https://scrutinizer-ci.com/g/rap2hpoutre/laravel-log-viewer/inspections/a0481537-cd50-4da7-a538-e85a060a084f) :'(, I will try to understand why, then accept your PR (because I think it's a good PR anyway)\n. Nevermind I will fix it later ;) !\n. Can you explain a little more? I'm not sure I understand why.\n. Ok\n. Resolved in v0.2.3 (run composer update)\n. Oops :/\n. Quick fix in v0.2.4 (I failed to replicate the bug, so it's just a try)\n@briedis Can you retry ?\n. Phew!\n. Ok it works with white-space: pre-wrap\nResolved in v0.2.7\nThanks :) !\n. Thanks ! Resolved in v0.2.5 (run composer update)\n. It's a good idea, but I don't know where I should display this feature\n. Any idea ?\n. OK !\n. Ok, done! You can update to v0.3.0 :)\n. Thanks for your suggestions :)\n\nWhen you say DataTable, do you mean https://www.datatables.net/?\n\nYes.\nAbout \"Live Stream Log\": \nI think auto update is risky: what if I'm on second (or third, etc.) page when it's update ? Or what if I doing a search or a filter on the result table ? It could be annoying if the page content is changing while I'm browsing or reading. Maybe just a notification (something like this in left menu) ?\n. About \"Live Stream\", after thinking, I think I will not add this feature in Laravel Log Viewer for many reasons. Hope you will understand. Laravel Log Viewer must be kept simple, light, easy to install, to extends, and to understand. I don't want to add too much complexity. \nFirst question about this suggestion is \"why?\". It's fun (that's why I first wanted to accept it !). But who will keep an eye on a log waiting for new log ? (not me) It's a log viewer, not a notifier. I think if you need to be notified about new log warning, you should use slack notifications (https://github.com/maknz/slack) or something else, not check every five minutes a log reader (\"is there any new log info ?\"); It's rather for searching an info or check once a day, not for wait for new errors.\nOne other argument (maybe the most important) is about performance in parsing log data (my bad). It's really slow (too many regular expression, etc.). Some users (see https://github.com/rap2hpoutre/laravel-log-viewer/issues/10) have huge logs, or sometimes just big logs (a few MB). Parsing same log every 2 or 3 seconds can be catastrophic on production server, if someone keeps a tab open on its browser. This 2 or 3 seconds are not configurable, it's dangerous (and I don't want to add config options (complexity for users once again)) \nSome people (https://github.com/rap2hpoutre/laravel-log-viewer/issues/9) extends views. If we add to many JS code in view(about 50 in PR https://github.com/rap2hpoutre/laravel-log-viewer/pull/28), it will be harder to understand and extend. And there is some duplication between JS and HTML, so it will be harder to maintain too.\nI really (really) appreciate your contribution effort :beers:, it was very interesting :), but I think I will close this ticket (if you are OK)\n. Ok, thanks.\n{{ trim($log['stack']) }} is already escaped.\nAccording to documentation,  everything within {{ }} is escaped, if I want to unescape, I need to write {!! trim($log['stack']) !!}\nDid I miss something ?\n. Oops. Sorry about that :/\nThanks to you :), I fixed it, it's OK now with v0.2.8 (just run composer update)\n. Thanks ! I will have a look ASAP :)\n. Answer in #26\n. > I think the problem is underlying that the log files are large in size\nThat's what I think too. Can you give me the size of the last file ? (if it's 10MB, I will try to fix it, but if it's 2GB, I won't ;) )\n\nif you load them all in one time, it will not able to display.\n\nYes I'm actually thinking about a solution for this problem\n. 400mb is to huge. I don't know how to fix it. It could read file line by line, but just after it has to parse file with regex, send it to view, and render it. So it won't work. Now, I have added a feature in v0.3.0: it does not display files >50mb, but there is a download link in this case. So, no bug but less feature. Sorry :/\n. There is no database in laravel log viewer, only a file parsing, so I don't know how to implement this feature right now :/ (without adding to much complexity and constraint)\n. Good point! I will try to do something for this.\n. I don't know if we can get blade file name by view file name. I did not found anything about this. And I don't know if it's possible: a view is composed of many blade files. So no solution for your problem right now, sorry.\n. Deleting log can be dangerous (\"oops !\"). Thanks to log rotate, i don't need to delete logs in nginx, syslog, laravel, etc.\n. @UnrulyNatives @rtconner Ok, I though again about this request, and I decided to quickly add this feature. You can now delete logs, just update to v0.4.0. Hope it will help you :)\n. Ok, so maybe not using blade is a solution, just raw php, I will think about it. You can extends view if you want to use your own blade delimiter, so it can be a solution for now. I'm curious: why did you need to change blade delimiter?\n. Ok thanks! Did you know that you have a (cleaner) alternative: \nhttp://laravel.com/docs/5.1/blade#displaying-data -> Blade & JavaScript Frameworks\n. Ok, thank you. I keep this ticket open, feel free to send a PR if you want, I don't know how to fix it right now.\n. Anyway, replacing blade delimiters seems to be an outdated and undocumented method (nothing about this in 5.1 docs). It's the way in old posts, but not now (http://ericlbarnes.com/simplest-way-use-laravel-blade-angularjs-together/, https://laracasts.com/discuss/channels/general-discussion/angularjs-and-blade, http://stackoverflow.com/a/28918055/978690, https://www.reddit.com/r/laravel/comments/2d6op8/laravel_angularjs_have_you_all_been_using_them/).\nThanks for contributing, if you found an easy solution you can post it as a pull request, but right now I close this issue\n. Ok thanks :)\nWhy should we delete log?\n. There were some problems with PSR2/code format in your Pull Request, so I started a new one from scratch. The delete feature is now implemented, just update to v0.4.0\n. There is no \"auto refresh\" feature, unless I am mistaken. Can you clarify your request? Is it about a long page load time, because your log are big?\n. > I feel the pagination is not really working, it seems to load everything?\nYes :/\nI will try to fix it in this issue: https://github.com/rap2hpoutre/laravel-log-viewer/issues/43\n. Ok thanks :)\n. Thank you!\n. I think it will maybe open security issue (https://www.owasp.org/index.php/Log_Forging or https://www.owasp.org/index.php/Log_injection) because it's unescaped.\n. Some people uses laravel-log-viewer in production environment (with middleware that only allows administrator). A user can type a malicious html code in a mail or wathever (without access to log-viewer, just by typing his name or something like that), then, when you open your logs, if the code is unprotected, it will be executed. So the administrator will run the code that the user wrote. Writing unvalidated user input to log files can allow an attacker to forge log entries or inject malicious content into the logs. Hope it's clear, are you Ok with this?\n. Ok, I think I understand your needs. You can send a PR or fork the project. Actually, I think this project is  more a log \"text\" viewer than a log \"html\" viewer. I'm not sure we will add configuration option (I want to keep this project light), so I'm not sure I will accept the PR. You can try, and we will discuss about it, but maybe you will have to work on your fork.\nThanks again for contributing :)\n. You can customize views if you want to have your own layout: https://github.com/rap2hpoutre/laravel-log-viewer/issues/9\nI'm not sure I want to add config file because I want to keep this package as simple as possible.\n. Yes that's a good idea! Could you open a new ticket (or a Pull Request if you want) for this need? Anyway, thanks a lot, I think it would improve this log viewer! \n. Thanks !\n. Yes, it's possible! You can have a look at this two posts: https://github.com/rap2hpoutre/laravel-log-viewer/issues/39 & https://github.com/rap2hpoutre/laravel-log-viewer/issues/9\n. Ok, thanks, I've just try something (removing extra space and trying to preserve readability). You can update to v0.4.2.  About big log file, there are several problem with it (https://github.com/rap2hpoutre/laravel-log-viewer/issues/35, https://github.com/rap2hpoutre/laravel-log-viewer/issues/29, https://github.com/rap2hpoutre/laravel-log-viewer/issues/10, etc.) and my only answer right now is... try to make it smaller! (do you use daily log rotate?)\n. Ok thank you! I'll have a look at this as soon as possible. I think there are two problem in this log viewer on big log files: loading in server side (I don't know how to improve it right now) and loading in client side (your suggestion could improve it).\n. It's a good idea, thank you! Would you like to work on it and send a PR? ;) I could too, but I don't know when.\n. I agree. What about just adding sections?\n. Any suggestion about what section I should add? I don't need to build my own view so I have no idea where I should add sections. I'm open to PR, if there is none in a few days I will make my own section hoping it's OK.\n. Yes! Could you please make a Pull Request for this? Thanks!! (If you don't want just tell me and I can do it myself)\n. Ok thanks. If you use log rotate (http://laravel.com/docs/5.1/errors), this will be probably useless: you don't want to keep your old empty file I think. Anyway, why recreate a file could be a problem?\n. Ok thanks. Resolved in v0.4.3 (just run composer update)\n. Ok thanks!\n. Thanks for your suggestion!\nAnyway, should we remove lines from a log? I think a log should not be modified: think about access log or syslog or even error log. Could you explain why you need this?\n. Ok, I understand. This package is just a small log viewer, maybe you could use a bug tracking system for this need (we are using bugsnag in my team, we just use this log viewer to dig into/analyze logs). I want to keep this log viewer light and simple. Maybe ARCANEDEV's LogViewer has this feature, I did not tried it.\n. Thank you!\n. Ok thanks! :+1: Available in v0.5.1\n. Resolved in v0.5.2\n. Ok thanks!\nI'm curious: How can you have directory in logs directory? Is there a way to do this with Laravel?\n. Ok thanks @melihovv! \nSorry for the late answer. So you should use this \"fork\" instead if you need directory support (not really a fork though, more like a copy/paste with modifications). This branch has conflict, I close the PR, sorry about that. Let me know if I have done something wrong, I would be happy to have your thought.. Ok what's your php version?\n. The class keyword was added in PHP 5.5, so it will not work with your version. You should replace this (in your config/app.php in providers section):\nRap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class,\nby this:\n'\\Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider',\nAnd it will work. Source: \nhttp://php.net/manual/en/language.oop5.basic.php#language.oop5.basic.class.class \n. (or you could update your php version to 5.5, 5.6 or 7.0)\n. Resolved. Available in v0.5.3 (thanks to @CharlesHenry)\n. Ok thanks! Does this work from laravel 4.2 to laravel 5.3?\n. Ok thank you! Available in v0.5.3\n. Thanks!\nOk for \"validate log file path\" I would like to merge it!\nBut why did you replace Request by Input? Here is the story:\n- https://github.com/rap2hpoutre/laravel-log-viewer/pull/50 (replace Input by request())\n- https://github.com/rap2hpoutre/laravel-log-viewer/pull/55 (replace request() by Request)\n. Thank you!\n. Available in v0.6.0\n. There was a similar issue here: https://github.com/rap2hpoutre/laravel-log-viewer/issues/17\n\nDid you add 'Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider' in config/app.php file (in providers section, line 147 on a fresh install) ?\n. @sciracioglu Does it solve your problem?\n. Ok, thanks for contributing. :)\nI'm not sure I want to add config file because I want to keep this package as simple as possible.\n\nIf you don't want to see them, you could just move (or remove) these huge log files. Tip: this log viewer does not look into subdirectories, so you can just make a subdirectory, then move your huge files in that subdirectory. Do you really need this feature?\n. Ok thanks!\n. It is not compatible with Lumen right now (I have never tried it with Lumen). I will take a look at this problem asap. Anyway, feel free to send a PR if you find a solution.\n. Could you please add the backtrace? It's a problem about fully qualified name but I don't know where to fix it in Lumen's framework code.\n. Fixed: https://github.com/rap2hpoutre/laravel-log-viewer/pull/66\n. PR here: https://github.com/rap2hpoutre/laravel-log-viewer/pull/62 (thank you!)\n. Ok thank you! Does it work with a fresh install of laravel 4.2 and 5.*? (let's say 5.2 is enough for your tests)\n. Ok thank you! Could you explain a why? I'm not sure it will be a benefits for everyone, so I need to understand first.\n. > Its be very nice if we create a config file, and configuring the timezone and format inside it.\nI want to keep this package lightweight and as simple as possible (no config, 20 lines max readme and not too much code), so I don't think we will add config options.\n. Ok thank you :)\n. Ok thank you. I think addition to the readme will be a bit confusing for most users. I want to keep the readme as simple as possible. What do you think of only adding this to a wiki?\n. 2 years old PR with conflicts now, close it. Sorry for the time you spent and my lack of answer. Feel free to tell me if you feel I've done something wrong.. Ok thanks. You can update to v0.7.0\n. ping @abarreir \n. You are right, but I'm so sad now: this package was 100/100, and now only 37/100. But who cares ? ;)\n. I give up :). You could have a look to this issue https://github.com/rap2hpoutre/laravel-log-viewer/issues/57\n. Did it solve your problem?\n. @schonhose Thanks!\n. OK thank you! :+1:\n. Ok thanks!\n. I think it's easier to read the logs when they are in DB (with tools like adminer). This package was made for the text files which are not really easy to read but are the default in Laravel.\n. Thanks! I'm happy you like it! \nThat's a good idea, not sure if it will be useful for everyone though. I'm curious: why do you want to know the file size?\n. Ok!\n. Too old, I close sorry.... Ok thanks for contributing! :beers: \nThere are some problem with this PR, I can't merge it, sorry:\n- Weird choice for multilang support (why only Bulgarian and english ?)\n- Back button is not a multilang option\n- Disabling author name is not a multilang option\n- Does this package really need to be translated? (I'm not english and I don't care, there are only a few words)\n- Poor text edit and formatting in README\n- Typo in README\n- Non-PSR code format\n- Non stashed 4 commits\nAnyway, thanks! I will not merge a multilang option for this package, but you could use your own fork if you really need bulgarian log viewer (and I will star it ;) ).\n. I've just tried with a fresh install of Lumen 5.3, and it works. Did you missed this step?\n\nEnable facades by uncommenting this line in bootstrap/app.php:\n$app->withFacades();\n. @elghobaty Thank for your analysis and the workaround! redirect() helper does not seem to exist in Laravel 4.2 and this package is still compatible (I hope) with Laravel 4.2, that's why I don't want to change it. Maybe we should use redirect() if it exists and Redirect façade if not? Feel free to submit a PR if you think it's OK and I will merge it.. Fixed in v0.7.1 (thanks to @elghobaty). Thank you!\n. Thanks for contributing! 👍 \n\nI'm really sorry but same response as here: https://github.com/rap2hpoutre/laravel-log-viewer/pull/74#issuecomment-249589663 (because same problems)\nFell free to use and promote your fork!\n. Thank you, you are right! I will add a \"FAQ\" section mentioning this and some other frequent questions asap. Thanks 👍 \n. Fixed: https://github.com/rap2hpoutre/laravel-log-viewer/commit/75d0261b817d13e354df6c652a1ce0207ad88b89\nThank you again!. Thank you very much!!. Available in v0.7.1. Thanks! \nDoes it work for both Laravel 4.2, 5.x and Lumen ? I want to keep this package compatible with all versions. Can you just check at least 4.2 and 5.3?\nGreat work anyway! :). Thank you 👏! Merged!. Ok, sorry! Replace:\n$app->register(Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class);\nBy:\n$app->register(\\Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class);\nIn other words, add a leading backslash. Thank you, I will edit the readme soon!. The backslash must be added in bootstrap/app.php. Not in routes. Is it what you have done?. Oops. Ok I did not misread the error message. Sorry about that. I have to understand and fix the bug.. Fixed (PR merged): https://github.com/laravel/lumen-framework/pull/541\nThanks for your contribution!. @ToujouAya It was a problem with Lumen. I fixed it here: https://github.com/laravel/lumen-framework/pull/541\nNow we just have to wait for Taylor Otwell (creator of Laravel & Lumen) to release a version with this fix. I may be released in a few days.\n3 solutions for you:\n - Wait for the new version and update lumen\n - Use my fork of Lumen (which includes the fix): https://github.com/rap2hpoutre/lumen-framework\n - Edit the file just like @chmdznr. @oknixus Hi! What's in your bootstrap/app.php?. Thank you for your contribution!\nYou could try one of these solutions: https://github.com/rap2hpoutre/laravel-log-viewer/issues/82#issuecomment-271247972\nIt seems the fix has been included in Lumen 5.4, maybe you could just upgrade.. You're welcome!. Thank you!. Available in v0.8.1. Thanks!. @ryanvade It's not about permission, it's the regex I use to parse the logs. I need to rewrite this regex to make it work with this kind of logs too.. Fixed thanks to @ricardocino . Ok thanks!!. Available in v0.9.0. Thanks for contributing! I'm not sure to understand what you mean? Could you explain a bit more?. ping @yaoshanliang . Thanks!! 🥇 . Available in 0.10.0. Thank you!!. I'm not sure but I think your fix broke something. \nFirst, I had a scrutinizer notification about a new issue introduced by your fix.\nThen this issue was opened and it can be related to this fix.\nBTW, thank you for your security fix! I really appreciate contributions and I though it was a good fix, because this package needs to be more concerned about security (I use it only for technical super admin in my projects, but not sure everybody do the same).\nI had to rollback it. Feel free to send a new fix after reading the scrutinizer analysis and the new issue opened. See also: https://github.com/rap2hpoutre/laravel-log-viewer/pull/59 and https://github.com/rap2hpoutre/laravel-log-viewer/pull/47. Thank you!!. Ok, sorry! I think it's because of a recent untested change. I just tried to \"fix\" it (rollback). Could you update (composer update) then retry?. Ok, thanks for contributing! I'm not sure to understand what you wrote. Anyway maybe I should not display .gz files.. Fixed via https://github.com/rap2hpoutre/laravel-log-viewer/pull/96. @Omranic Don't know why scrutinizer has failed with your commit. An clue?. Thanks!!. Thanks for contributing! What version of Laravel do you use?. @akoepcke & @irkfdb I can't reproduce the problem (I just tried on my 5.4.28 and everything is OK). Could you just try something and tell me if it works: run composer install (or composer update if you prefer) then re-run php artisan vendor:publish --provider=\"Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider\" --tag=views. Does it work? Thanks a lot for your help!!. Ok sorry for the late answer. I tried with your repository and it still works for me. This is what I have done:\ngit clone https://github.com/akoepcke/test.git debug-github-llv\ncd debug-github-llv\ncomposer install\ncp .env.example .env\nvi .env\nphp artisan key:generate\nphp artisan vendor:publish --provider=\"Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider\" --tag=views\nll resources/views/vendor/laravel-log-viewer/\nIt displays:\n\n-rwxr-xr-x  1 raphael  staff   5,3K 22 aoû 12:04 log.blade.php\n\nSo the file is created. Could you tell me what you tried (or if I am doing something wrong)?. Got it! \nYou are using an outated version of Laravel Log Viewer (v0.8). Update to v0.10+ and it will work! Thank you for your detailled steps to reproduce, I understood now. I just tested by modifying composer.json of your project then run again the publish process and it works.\nMore info: https://github.com/rap2hpoutre/laravel-log-viewer/pull/87. Thanks for contributing! Would you like to submit a PR for this?. Ping. Closed for lack of activity.. Ok, thank you for contributing! I'm sorry about that crash! (and sorry for my late answer). \nIMO, blanking the file is a bit weird (as a user you asked for \"deleteting\", and it just blanked something). And it will polluate the list of file on the left menu. Still, I understand your need. So I don't know what to do... Any thought?. See https://github.com/rap2hpoutre/laravel-log-viewer/pull/141. Fixed via https://github.com/rap2hpoutre/laravel-log-viewer/pull/141\nThanks @dobrik!. Available in v0.17.0. Hi! Thank you for contributing! (and sorry for late answer)\nThere is no plan to add charts in this lib. The purpose of this package is to be really lightweight and to stay easy to install, easy to configure, easy to use (and to be fair, I still don't understand the value of a chart showing error percent by type, but it's just my opinion, I don't judge anyone, and I don't know the needs of others).\nStill, ARKANEDEV has created a better Log Viewer than mine with charts and so on! It should contain everything you want! Feel free to use it if it better fits your need!. Whoops, something went wrong in this PR. Could you submit a new one with only one commit?. Is it related to this one: https://github.com/rap2hpoutre/laravel-log-viewer/pull/105 ?. You have to remove this line from conf/app.php:\nRap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class,. Ok thank you! There is some mess in this PR, could you explain and/or fix it?\n - A .env file is there, I don't understand why?\n - There are .idea files. It has no clue here, it should not be commited.\n - Two blank lines are added to the readme, I don't think it has something to do with the PR\n - Why orchestra/testbench was added?\n - Why is there a Log::debug('设置自定义配置成功!'); line?\n - You may not re-indent a whole file when adding a new feature. Please send separate commits.\n - There is a lack of explanation this implementation and the design choices (i.e. I don't know how to use the new feature you added, neither why it was added and implemented like this)\n - Does it work either with Laraval 4.2, 5.5 and Lumen (last version)? All these versions should be tested because this log viewer is compatible with them.\n - Still I'm not totally sure this log viewer needs configuration. I mean the whole objective of this lib is to just give a minimal and easy to use log viewer. If someone want to customize, she can use https://github.com/ARCANEDEV/LogViewer which has more feature. But I'm ok to discuss this.. Thank you! I just have a few questions:\n - Does this still work if there is no parameters in query (I not sure because I only see & operator)\n - Does it still work with Laravel 4.2, Laravel 5.5 and Lumen (last version)? I'm not totally sure it does because of this: $this->request->getRequestUri().\nCould you check this?. Closed (lack of activity+branch conflicts). Sorry, you can reopen a new one if you want.. Maybe the best option is to split/rotate your logs.. Thank you! Merged!. Available in v0.11.0. Oops, sorry, late answer.\n@ricardocino is right. \n@rainbowhat This package is just a small tool to help starter projects. Consider using something like bugsnag, sentry or even new relic if you want to get notified in telegram. Anyway, self-promotion about a small package I made for Slack with some more informations (not sure it will help you though): https://github.com/rap2hpoutre/laravel-epilog it can help you if you want to build your own package.\nI close this issue, let me know if I misunderstood something.. Thanks! It just need one fix, and I will merge it!. No activity, conflict, close.. Oops, sorry to late answer! Did you find any solution for your problem? If not, could you format your issue for better understanding?. Ok thanks!. Thank you for contributing! \nYou are right, but I don't know what to do. What do you suggest?. Thank you!. Thanks for your contribution. I'm sorry, I can't accept your PR: almost every line is re-indented so it's complicated to review (and I prefer 2 spaces indentation for HTML, just like bootstrap recommands). Could you rebuild your PR with only relevant changes?. Thank for your contribution. Since it's not a problem about the log viewer itself, I prefer to close this question. You may consider post this as a general question on Stackoverflow or even reddit. Let me know if I'm wrong.. Thank you!. Thank you!!. Available in v0.11.1 (since I consider it's not a change, but a minor fix). 😄  \"Obsolete\" is barbaric, you are right! Sorry about that. \nStill, Laravel 5.6 is now shipped with bootstrap 4. So it's the new \"standard\" I guess.. Fontawesome is great, It's my default choice too. Maybe there are some better/lighter alternatives (but I don't know which one is good)...\n\ni am actually working through this right now within a project of mine, and if i can abstract it back out to your package i'll be happy to share.\n\n👍 . Thanks!. Thank you!. Available in v0.11.2. 👏 BRAVO! Great PR: well explained, clean code, and I just tested it, it works and it's pretty. Thank you!. I'm not sure I understand. I use https://admin.myproject.localhost in one of my project and \"it works\" (I mean I'm still on the same subdomain, no redirection: I can access to https://admin.myprojects.localhost/logs).\nAnyway, you are free to declare routes to the log viewer as you want. You can even create multiple route to the log viewer and handle domain prefix or wathever. Just add new routes to the controler.\nphp\nRoute::get('logs', '\\Rap2hpoutre\\LaravelLogViewer\\LogViewerController@index');\n//...\nRoute::get(\n    'alternate-route-to-logs', \n    '\\Rap2hpoutre\\LaravelLogViewer\\LogViewerController@index'\n);\n// And you can even route subdomains.\nStill I'm not sure I understood your request, feel free to post a new comment if I'm wrong!. I think @cino is right. I close this issue, feel free to comment if you think we are wrong!. Thanks! Still this branch has conflicts. Could you please fix the conflicts then squash your commits?. Yes, of course!\n2018-03-14 21:49 GMT+01:00 Mohamed G.Hafez notifications@github.com:\n\nMay I work on this feature ?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/rap2hpoutre/laravel-log-viewer/issues/125#issuecomment-373169757,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ABgMCuo8TrVr2uyQc-TdWLcGA4BwlfJsks5teYJugaJpZM4SgJt1\n.\n. @elminson Thank you for your suggestion! If you want to refactor some code, you can try and send a PR. Be sure I will read it carefully, though maybe I would not accept it. So be prepared for this, I don't want to disappoint you! Keep in mind that the main goal of this package is to be simple (code and usage), so think about this when you create your PR. . Fixed via https://github.com/rap2hpoutre/laravel-log-viewer/pull/160. Ok thanks! \n\nIt's not a problem about Lumen, it's something broken in Laravel Log Viewer, that uses Crypt now (which is not accessible in Lumen). I fixed it via https://github.com/rap2hpoutre/laravel-log-viewer/commit/6789caf0ecfae14f7238b3d20832d961f503351f (thanks to you). Could you try to update to v0.14? Let me know if it's OK now!. Woops. Ok fixed! Could you try with v0.14.2?\nThank you for your patience!. Woops. I commit bugs in each commit today (because I don't take time to read and test, hum. I must be tired). Sorry. \nOk, @mikemand (the original creator of log viewer!): do you want to submit a PR? (I can try to fix it myself if you prefer!). Thanks @mikemand ! \n@mhousser The fix is available in v0.14.3.. What a day! Usually, the Log Viewer's life is a bit boring: today, it reached 1 million download and crashed much more than usual 🤔\nThank you so much for your help!. Ok thank you! It just need one more step and I will merge it!\nYou wrote:\n```php\n<?php\n/\n    |--------------------------------------------------------------------------\n    | Log Viewer Pattern\n    |--------------------------------------------------------------------------\n    |\n    | This value is for specify the log viewer pattern.\n    |\n    /\nreturn [\n    'pattern' => env('LOGVIEWER_PATTERN', '.log'),\n];\n``\nIt's not at the right place: your comment is aboutpatternnot thereturnstatement. Also, the opening comment signs/` is not indented. So you could fix by doing this:\n```php\n<?php\nreturn [\n    /\n    |--------------------------------------------------------------------------\n    | Log Viewer Pattern\n    |--------------------------------------------------------------------------\n    |\n    | This value is for specify the log viewer pattern.\n    |\n    /\n    'pattern' => env('LOGVIEWER_PATTERN', '*.log'),\n];\n``` \nAlso, you could consider be more descriptive in the comment: why it does exists and what you could do with it (and explaining the default behavior). Random example from Laravel:\nphp\n    /*\n    |--------------------------------------------------------------------------\n    | SMTP Host Address\n    |--------------------------------------------------------------------------\n    |\n    | Here you may provide the host address of the SMTP server used by your\n    | applications. A default option is provided that is compatible with\n    | the Mailgun mail service which will provide reliable deliveries.\n    |\n    */\nAnyway, thank you! Feel free to ask me anything!. @mg-freelancer Any news?. @mg-freelancer Still there?. @elminson Yes feel free to send a PR! Thank you!. OK you are right, I think I broke something in v0.14. Please use v0.13 I will fix it soon.. Fixed! Update to v0.14.1. The problem was due to this commit https://github.com/rap2hpoutre/laravel-log-viewer/commit/47a428f7bb6aaa70bb26b5fb0b9be4a2c04cc2d9 and fixed via https://github.com/rap2hpoutre/laravel-log-viewer/commit/f5135771d0f1ae0078d95e3f8ea72a3fdd0d73df\nThanks!!. Links changed from base64 to Crypt (see https://github.com/rap2hpoutre/laravel-log-viewer/commit/cda89c06dc5331d06fab863d7cb1c4047ad68357). It should work, don't know why it fails. Could you give me some more context:\n - Laravel (or Lumen) version\n - Do you see a base64 (short) url when you click a link or an encrypted thing (long)?\n - Did it fail on a fresh installation of Laravel for you?\n - Full backtrace\nThanks!. It seems like you have an old version of the view. Could you run php artisan cache:clear then refresh the base page (without the payload) of the logs?\n(thanks for your time). Great! Thank you for your help!. Thank you!!. > Is this the intended sort order?\nNot at all! I noticed it some times ago and forgot about it. The default sort should be date (descending) I guess.. Wow! Thanks again!. Ok. Could you please list the file (with their size) in the log dir? (with ll or something like that). Also could you tell me what is your current memory_limit?. @comlaterra Any news?. Closed (lack of activity). Thank you! It seems it misses some files (view, etc.), am I wrong?. Thanks for your contribution and sorry for late answer! I feel like it does not need to be an option but a decision by design in the library. And I'm OK with you: with the whole line clickable, it's hard to select text. But, some time ago, I accepted a PR for this: https://github.com/rap2hpoutre/laravel-log-viewer/pull/91. I accepted it because some people up-voted it (with emoji thumb up), so I thought: \"Ok, people prefer this\".\nSo basically: I don't want to add an option for this, but make a decision; I prefer the whole line not to be clickable, but I'm not sure I will change it...\nI close this for now, feel free to ask for reopen.. Thank you for your contribution!\nI think it will be considered as a breaking(!) change for most people. Currently it break on hyphen and spaces and it's OK for common cases (log with dates in filename).\nWith word-wrap: break-word (current) on one of my app:\n\nWith word-break: break-all (your PR):\n\nSo it's not better (see the word raphael which is weirdly broken), and it will make some dates (separated by hyphen) less readable.\nSide question: why do you have such a big filename in your log with no hyphen?. Is it a filename like this: logs/eyewitness_cron_xxxxxxxxxxxx.cron.log?\nIf so maybe we could open a PR on Eyewitness to change this line https://github.com/eyewitness/eye/blob/56eeebc5259ddb9d273c9db279714125edae3920/app/Scheduling/Event.php#L157:\n$this->output = storage_path('logs/eyewitness_cron_'.sha1($this->mutexName()).'.cron.log');\nTo: \n$this->output = storage_path('logs/eyewitness-cron-.sha1($this->mutexName()).'.cron.log');\nWhat do you think?. @meijdenmedia Any news?. (I just opened an issue). @meijdenmedia Fixed via https://github.com/eyewitness/eye/pull/41 Hope it will fix your problem. Just update eyewitness!. What version of laravel log viewer do you use?. Thank you! Maybe there is something about view cache (not sure though). Could you remove everything in storage/framework/views/ then try again?. @rwattogl Could you try to reload the views cache? Just run:\nphp artisan view:clear. @rwattogl Ok. I still think there is a problem in the view. You have base64 strings coming from the view, and this does not exists anymore in the view, that's why I asked to clear the cache... But, according to your answer, you already cleaned he cache. So maybe the is a view somewhere else: did you changed the default view? Or did you published the view? \nCould you check in your resources/views/vendor folder if you find something about the log viewer? If so, remove it. \nThere is no base64 encoding in the current view: https://github.com/rap2hpoutre/laravel-log-viewer/blob/master/src/views/log.blade.php\n(thank you for your patience). @Cyclops0571 Did it solved your problem?. It seems it's OK now.. Yes you can. You can either use a package like this one or read the Laravel documentation about logging.. Thank you for your contribution! Yes it's a good idea. Feel free to submit a PR for this need.. Yes! Thank you!. Fixed via https://github.com/rap2hpoutre/laravel-log-viewer/pull/159. Thanks for your contribution, and sorry for late answer!\nSome thoughts:\n\nI really appreciate the work you have done and I feel it looks better with your changes! 👍 \nTwo \"by rap2h\" is too much! I think we should just keep one! ;) The one in the bottom of the page seems more appropriate.\nAbout the bottom of the page, I think it's a good idea to add \"github\" and \"issues\" in the footer! Good job! 👏 \nThe only thing I don't like is the file selector on the top of page. I feel like it introduce some problems:\nYou can not see the whole list of logs, so you have no idea before clicking about the log list length (and content)\nYou don't see it at first glance. If you have a large screen, you could miss it.\nWhen you want to check logs one by one (open one, check, open another one, check, etc.), you have two click for each step. I feel like it's a regression.\n\nAnyway, thank you so much. Don't give, up, feel free to answer!. @dobrik Thank you for your contribution! It fixes this old issue: https://github.com/rap2hpoutre/laravel-log-viewer/issues/100 🎉. As @mikemand said (thanks again), the log viewer has changed since a vulnerability was found (see: https://www.cvedetails.com/cve/CVE-2018-8947/). So basically, you have to replace base64_decode by Crypt::decrypt and base64_encode by Crypt::encrypt. Could you please fix this before I merge your PR?\nP.S: Sorry for the late reply.\n. @dobrik OK, thank you! Anyway, Laravel Log Viewer actually uses crypt/decrypt, so I think it's ok to change base64* with *crypt.. @dobrik Thank you!!. Available in v0.17.0. Thank you!. Available in v0.15.0. Thank you for your contribution! What do you mean by \"scrolling\"? Do you want to \"hide\" the last entries and add a scroll bar? Add a pager system for the file names? Something else? . Thank you @elminson for your help! I added some comments in the PR (https://github.com/rap2hpoutre/laravel-log-viewer/pull/167).\n@rajjanorkar Sorry for the (long) delay, hopefully @elminson helped you!. Thank you for your contribution! This is a great suggestion, feel free to submit a PR if you want! (I could code it myself too, as you wish). Thank you! Available in v0.16.0. Thank you! I answered in the PR #161. Thank you for your contribution!\nAs a workaround, you can extends the original controller and add your own rules : \nphp\nclass MyLVController extends \\Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerController {\n    public function index()\n    {\n        // do some stuff, then:\n        parent::index()\n    }\n}\nThen use your controller in your route:\nphp\nRoute::get('logs', '\\Path\\To\\MyLVController@index');\nOne other approach could be to use middleware, if you need to \"support some kind of authorization\":\nphp\nRoute::get(\n    'logs', \n    '\\Rap2hpoutre\\LaravelLogViewer\\LogViewerController@index'\n)->middleware('auth_or_something_else');. Hi @sdeering! Thank you for your contribution! This package is only a log viewer, it can't handle rate limits nor the way logs are written/treated. Maybe you could check on reddit or stackoverflow, not sure where to ask.... Hi! Thank you for your contribution! I will not merge this PR 😢 because I want to keep the README as simple as possible, each new word make it harder to read. The addition you wrote is an optional information and is not required to make it work in Laravel >= 5.4. Still, thank you for your work and your suggestion. Feel free to answer if you feel like I should not have closed your PR (sorry about this). Thank you so much! It's super!. Thank you!!. Available in v0.19.0. @Nowi5 Woops. Sorry about that. I should have read carefully and test the PR before merging :/ (or add unit tests: the lack of tests is the main problem of this log viewer)\n@elminson Ok thanks a lot for your work! I wait for your PR :) (I can fix it myself if you prefer, as you want). @Nowi5 Fixed (thanks to @elminson) available in v0.19.1 (just update via composer). Thank you for your contribution!. Thank you!! Available in v0.18.1. @elminson Thank you! You could have done the last fix (https://github.com/rap2hpoutre/laravel-log-viewer/pull/159/commits/7c4069f4e3a4dc27f313dcddfc40357512497f54 and https://github.com/rap2hpoutre/laravel-log-viewer/pull/159/commits/b592805cfecf66e2a03c0ea13d02e61441853e28) in another PR but it's OK, we need to fix the package which is broken :) so I will merge the whole PR (Log Location customization + fix on #156). It's a bit late (in France) and I have to go to bed because I have a train early in the morning so I have to merge the fix now. Maybe we will do some refactoring after that (I can do it myself). Anyway, thank you for your wok on various subjects today :)\n@mikemand Thank you for your help and your review! About unit tests, this lib is a shame: no test, and I not sure where to start: it's really highly coupled to the framework and a specific context. I started some refactoring some days ago (yesterday maybe), it's a required step before testing. One day, there will be tests in this lib and we will be proud of it, not today though.\n@elminson @mikemand  Thanks to both of you!. @elminson FYI, two small parts were broken, I fixed it in https://github.com/rap2hpoutre/laravel-log-viewer/commit/364cd46e977ed2f894c47842ea3470bc183a3173 (because 0 == null with loose comparison but 0 !== null, so it crashed when trying to access getPattern('something', 0) with Array to string conversion) and https://github.com/rap2hpoutre/laravel-log-viewer/commit/3790892b2b912e7ebaf9ce9868bbe93d542309c7 (because storage_path() . '/'.$this->storage_path is like storage_path() . storage_path() which is a invalid path). \nThank you again!. Thank you!\n\nnot sure if i have to do a rebase\n\nYou don't need to do a rebase, because I can squash in one commit and merge. But maybe you could restart with a fresh base if you want to avoid multiple commits in each PR.\nMaybe the comments could be improved in a near future to be more precise, but it's a good start!. @elminson Hi, and thank you for your contribution 😄 !\nI just checked and I'm sorry I can't \"approve\" the actual PR 😢. I think we should try to avoid mixing different enhancements/fix in a same PR: the risk is it will be never accepted by the reviewer, since every single line could lead to a discussion. For example, where I use to work (we use PR system too, with code review, etc.), we try to make PR small as possible, with only one concern. Not sure it's the right way, but it seems to work for years. A ~big PR addressing various issues could be merged, but it's risky to submit such a PR because it could takes a long time to be accepted. \nIn this particular case, as a reviewer I start to be a bit lost: there are some comments that are not answered, then new commit about a new subject. Be sure I still appreciate your work.. @elminson Thank you!! About reducing class complexity, I feel like I must think by my side first about what I want. I will try to improve it a bit myself before accepting PR. Thank you for the other PR ;). @elminson PR #161 is about reducing class complexity, not multitenancy, did I missed something?. @elminson Thank you!\n@Nowi5 Fixed, available in v1.1.0. Thank you for your contribution. AFAIK, there is only a few lines of logs displayed on each page, so it does not matter if the file is big or small: since there is a paginator, there is no need to scroll more than a bit to access this buttons. Did I missed something?. @ionesculiviucristian I understand your problem, but I think I will not change anything (sorry about that). I will try to explain why below, feel free to answer. \nAdding a line on the top of the page as suggested by @elminson could be a good solution but it make the UI more heavy IMO, and we could loose the \"simplicity\" of this package. One of my goal is to keep this package simple (in term of code, features and interface). So I try to limit the things directly visible on the page, in order to give users a quick view to the most relevant info (in this case, it's the log lines). With a list of not-so-useful buttons on the top on the page, only here to address a problem when there is too much logs, we risk penalizing all users that are not concerned by this need. My advice is to ...uh... wait for the whole page to load, then go to the bottom in this particular case 😅 (or maybe log less things)\nBTW, sorry for the delay. Feel free to AMA.. @idan003 Since it's a problem with lumen, the solution given by @elminson could not work, (still the analysis is good, thank you so much @elminson: you are right, it's about app key) so maybe you could have a look at https://stackoverflow.com/questions/30344141/lumen-micro-framework-php-artisan-keygenerate. . @idan003 I close this issue. Let me now if there is anything else!. Hi @DrackThor! It seems there is no connection with the log viewer itself: this lib does not introduce anything about authentication (you have to manage it yourself). You could check if you configured some middleware on your side (you could have a look at your routes files).. You are welcome!. @phpapi I just fixed your issue via https://github.com/rap2hpoutre/laravel-log-viewer/commit/201db49dac4c8dc359c4ceea86d2a2dc4097142f. Could you please update to v0.20.0 and test again?\n@elminson It was a problem in the library itself due to the changes introduced in this PR: https://github.com/rap2hpoutre/laravel-log-viewer/pull/146. It may be fixed now! Thanks for your help!. @phpapi OK, I close it for now, feel free to leave a comment if something went wrong!. @acodercat Thank you for your contribution! Could you provide the whole error backtrace please?. Hello! Thanks again for your contribution!\nThere seems to be mixed commits in this PR. By example, it includes the PR #161. Could you please clean the PR with only the relevant commit so I could review it? I feel the relevant part is in the blade file. I can't actually merge it because it includes various work (6 commits)\nSide note: sorry for the delay, I was in vacation. Thank you! Available in v0.21.0. I will try it ASAP (I need some tests before merging).\nThank you!. WOW! That's a big move! \nI'm sorry I have not so much time currently (job is hard!) to review and merge your PRs, be sure I really appreciate your contributions! This one is so cool, I thought this lib would have no test ever! I have blocked some time in the next week to review and merge your PRs!. Thank you so much!! Available in v0.22.0 \nhttps://travis-ci.org/rap2hpoutre/laravel-log-viewer/jobs/425032068. Thank you for your contribution! Fixed, available in v0.22.1. It looks good (just read it quickly though) but it seems it's again mixed with other code (the unit test one). Could you send a PR with only the relevant part? (I know that you are putting many effort in your work, so thank you!). Or if you prefer, I can create a PR myself to fix it and discuss with you.... Side note: I just have seen this PR https://github.com/rap2hpoutre/laravel-log-viewer/pull/145 which seems to have the same goal as yours... Did you see it? What do you think of the implementation suggested?. Hi, thank you for your contribution. Could you please explain the purpose (and the design choices) of this suggestion? I'm not sure to understand what problem it solves and what it does by reading the code.. thank you @elminson (and sorry for the long delay!). Hi, thank you for your contribution! The default view file in LaravelLogViewer is a standalone view, it should not be mixed with other views. Are you using your own blade file for displaying the log viewer? If so, you will have to fix it yourself (it may be a conflict between bootstrap version). Yes I totally agree! I should not have accepted this PR: https://github.com/rap2hpoutre/laravel-log-viewer/pull/91 😅. Still it was asked a few time. Maybe users will complain if I remove it now... I don't know what to do!. Thank you for your contribution!. There is no way to change the date format via Log viewer, because the log viewer just reads the log files and displays it. So you will have to configure it in the log writer which is provided by Laravel. See https://stackoverflow.com/questions/52117102/laravel-customize-log-formatter and https://laravel.com/docs/5.7/logging#advanced-monolog-channel-customization. Hi and thank you for your contribution! Please have a look at https://github.com/rap2hpoutre/laravel-log-viewer/issues/164 https://github.com/rap2hpoutre/laravel-log-viewer/issues/126 and https://stackoverflow.com/questions/30344141/lumen-micro-framework-php-artisan-keygenerate if you are using lumen). Thank you @yevhenlisovenko !. Thank you!!. Hello, thank you for your contribution!\nI works only with plain text files, not gzipped files.. Thanks! (cc @elminson). Could you fix it here to?\n. Could you fix it here to?\n. Could you fix it here to?\n. Use spaces (not tab) please\n. Use 2 spaces (not tab) please\n. Ok thx. Could you move this whole block to a \"Additional steps for lumen\" or something like this? I want to keep this readme as simple as possible for most case.\n. It should be failed here, not 'failed' => 'warning'. Since this lib is compatible with Laravel and Lumen, you can't just use the encrypt helper, you have (sorry about that) to use the full \\Illuminate\\Support\\Facades\\Crypt::encrypt way :/. Please use \\Illuminate\\Support\\Facades\\Crypt::encrypt. Please use \\Illuminate\\Support\\Facades\\Crypt::encrypt. Please use \\Illuminate\\Support\\Facades\\Crypt::encrypt. Please use \\Illuminate\\Support\\Facades\\Crypt::encrypt. Please use \\Illuminate\\Support\\Facades\\Crypt::encrypt. Please use \\Illuminate\\Support\\Facades\\Crypt::encrypt. Sorry about that: the class is not static anymore (just a recent change). Please use private $patterns instead of private static $patterns and $this->patterns vs self::patterns. current_log_data_first and current_log_data_first is a bit bizarre. What about this: \nphp\n'current_log_data' => [\n    '/^\\[(\\d{4}-\\d{2}-\\d{2} \\d{2}:\\d{2}:\\d{2}([\\+-]\\d{4})?)\\](?:.*?(\\w+)\\.|.*?)',\n    ': (.*?)( in .*?:[0-9]+)?$/i',\n]\nWhat are your thoughts?. There is a tiny indentation problem here. About keys consistency: \nYou suggest: all_log_data, current_log_data_first, current_log_data_second and get_files. There is a mix of verbs and descriptive words (and plural vs singular)\nWhat do you think of logs, current_log and files? (there is still a mix of singular and plural though...). This key does not exist, it will bug.. Maybe this pattern may not be separated and should leave here. Not sure though... Do as you want!. OK so go on if you want!. OK!. This comment does not describe the $log_data, it seems you mixed the previous variable comment with this one ;)!. The indentation is a bit weird here. We could just keep the one line version for now and maybe later refactor this line.. Unless I mistake, the return that was present before will not work anymore as expected. Previously, if there was no log files, the all method returned an empty array: \nphp\n            if (!count($log_file)) {\n                return [];\n            }\nNow with the changes you posted, the all method will not return [] anymore, so I guess it's a breaking change, and I feel like it will not work anymore with empty folder.. I'm not sure this part has to be split (but maybe you are right). BTW, the function does not only set the file property, as you can see from line 130 to 132. I have no suggestion, maybe we could leave it as it.. You are right, it's more readable with brackets 👍 !. Maybe change this:\nphp\n//make sure $file is set\nto:\nphp\n// Make sure $file is set. Indentation is bizarre here. Maybe:\nphp\npreg_match(\n    $this->pattern->getPattern('current_log', 0) . $level . $this->pattern->getPattern('current_log', 1), \n    $h[$i], \n    $current\n);\nOr:\nphp\npreg_match(\n    implode(\n        $this->pattern->getPattern('current_log', 0),\n        $level,\n        $this->pattern->getPattern('current_log', 1)\n    ),\n    $h[$i], \n    $current\n);. $current param should be an empty array?. Previously, stack could be empty, now it requires $this->log_data[$index] in order to work. Is this a breaking change?. Maybe:\nphp\n$files = glob(\n    $this->storage_path.'/' . $folder . '/' . $pattern, \n    preg_match($this->pattern->getPattern('files'), $pattern) ? GLOB_BRACE : 0\n);. Github recommend one empty line at the end of the file. I'm not totally sure this function makes the code more readable (but maybe I'm wrong). I mean it adds a bunch of ternary operators (7 ternary operator) and is more complex to read. It avoid repetition of keys, good point, but it adds some complexity IMO. And there is a new function with 5 params which are not really simple to understand TBH. I don't actually think it's more readable, but I understand your idea. What are your thoughts?. This will create a strange behavior. Assuming the user has two files with the same name: dir1/laravel.log and dir2/laravel.log (which is possible in multitenant app), the function will return... one of them (a \"random one\")... So it will be really bizarre for users.. Why not if/else?. Why not if/else?. Why not if/else?. Yes you are right about pointing this:\n\nThe method getFolders uses an else expression. Else is never necessary and you can simplify the code to work without else.\n\nStill, it does not mean it should be replaced by another if. They says that it could be simplified. The usual example for this is replacing:\nif ($a) {\n    return 'a';\n} else {\n    return 'b';\n}\nWith: \nif ($a) {\n    return 'a';\n}\nreturn 'b';\nThis simplifies the code. Replacing else with if (!thing_i_tested_before()) hacks the Codacy detector but does not simplify code I think (but maybe I'm wrong). Indentation is broken from here line 59 to line 66.. Don't know why it appears in this PR? I think there is a mix between two PR, maybe due to a merge.. Maybe replace: \n\\Illuminate\\Support\\Facades\\Crypt::encrypt($current_folder.\"/\".$current_file)\n With:\n\\Illuminate\\Support\\Facades\\Crypt::encrypt($current_folder ? $current_folder . \"/\" . $current_file : $current_file)\nfor backward compatibility.. See previous comment.. See previous comment. ",
    "ChristopherDosin": "Now i paced this to my RouteserviceProvider\n```\n    public function map(Router $router)\n    {\n        $router->group(['namespace' => $this->namespace], function($router)\n        {\n            require app_path('Http/routes.php');\n            Route::get('/backend/logs', 'Backend\\LogViewerController@index');\n        });\n}\n\n```\nAnd this is my App/Http/Controllers/Backend/LogViewerController.php\n```\n<?php\n/*\n * @package   tips\n * @author    Pixelianer http://www.pixelianer.de\n * @copyright Copyright (C) Hostianer Media UG\n * @license   http://www.gnu.org/licenses/gpl.html GNU/GPL\n /\nnamespace App\\Http\\Controllers\\Backend;\nuse Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewer;\nuse Illuminate\\Support\\Facades\\View;\nclass LogViewerController extends \\Illuminate\\Routing\\Controller\n{\n    public function index()\n    {\n        if (\\Input::get('l')) {\n            LaravelLogViewer::setFile(base64_decode(\\Input::get('l')));\n        }\n        $logs = LaravelLogViewer::all();\n        View::addNamespace('laravel-log-viewer', DIR.'/../views');\n        return View::make('laravel-log-viewer::log', [\n            'logs' => $logs,\n            'files' => LaravelLogViewer::getFiles(true),\n            'current_file' => LaravelLogViewer::getFileName()\n        ]);\n    }\n}\n```\nNow i get a \"View [log] not found.\"\nThis is the complete Error:\nhttp://laravel.io/bin/mGvmE\n. Ok i create now my own view and now it works !\nThank you for your help and your awesome Package :+1: \n```\n<?php\nnamespace App\\Http\\Controllers\\Backend;\nuse Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewer;\nuse Illuminate\\Support\\Facades\\View;\nclass LogViewerController extends \\Illuminate\\Routing\\Controller\n{\n    public function index()\n    {\n        if (\\Input::get('l')) {\n            LaravelLogViewer::setFile(base64_decode(\\Input::get('l')));\n        }\n        $logs = LaravelLogViewer::all();\n    return View::make('backend.log.index', [\n        'logs' => $logs,\n        'files' => LaravelLogViewer::getFiles(true),\n        'current_file' => LaravelLogViewer::getFileName()\n    ]);\n}\n\n}\n```\n. ",
    "fasthold": "Yeah, it works!\nBut the working code is:\nphp\n$router->group(['namespace' => 'Rap2hpoutre\\LaravelLogViewer'], function($router) {\n    $router->get('logs', 'LogViewerController@index');\n});\nThanks a lot!\n. ",
    "younes0": "I can't think of a single app not requiring this, should you add this to the README.md maybe?\nnice startup btw\n. ",
    "AnthonyPorthouse": "Hey,\nIn my fork the code was added to the service provider to allow overriding the view in Laravel 5, however to make it also backwards compatible with 4.2 it would probably need some work such as method_exists checks.\n. I noticed this when I was setting up the test environment for overriding views in 4.2, its sort of self fixing though as you'll only ever see it once, then it logs the error and it fixes itself.\n. Conditionally loading a service provider is something you'd have to do to any packages you wanted to only use within development. For example with barryvdh/laravel-debugbar you have to add a service provider so it has the correct bindings and can correctly hook itself into the system.\nIn this case the service provider quite literally just registers the view location against the package name so we can override them.\nI do agree that for most packages the versions of Laravel should be separated away, especially if making the packager support L5 would hugely break backwards compatibility. However in this case as the package itself is very simple and hasn't even hit 1.0.0 then keeping a branch just for L4 would be overkill and perhaps even detrimental because it could massively complicate trying to add the package through composer (Is the most recent version L4 or L5?)\n. ",
    "driade": "didn't know, thanks!\n. Confirmed, working in 4.2, out of the box, thx.\n. ",
    "barryvanveen": "Notice that Laravel (I'm running 4.2) has a build-in way to override package views. You can place your custom view in /app/views/packages/ap2hpoutre/laravel-log-viewer and it will automatically be used instead of the view in /vendor/ap2hpoutre/laravel-log-viewer/src/views.\nThis only worked for me when the views were placed in there default folder, so /app/views for L4.2. My views were moved to /resources/views and that didn't work out. \nAlso see http://laravel.com/docs/4.2/packages#package-views\n. ",
    "maarten00": "To be fair, I'm not expecting that it will be able to render the whole thing, let alone search it. Maybe it should have a (configurable) max amount of lines it will parse.\n. Should definately be in the readme, as that is where most users would be looking for 'basic' configuration options like this. \nPerhaps the 'Optional' part should be in the title as \nConfig (optional)\nOther then that +1 for this feature!. ",
    "peppeocchi": "Yes, I find it very annoying because every time I deploy to elastic beanstalk (the logs folder is in the gitignore, I have no need to save the log files in -eg- an s3 bucket and I'm happy to have no logs every time I deploy), so the first thing I do after a deploy is checking the logs = first log error is the logviewer itself :D\n. ",
    "xwiz": "@JosephSilber My guess is that the package would still grow to the point where there will be need for a ServiceProvider. I wanted a configurable access key to access the log view for example and ended up having to register commands and include package routes. This way it's considerably easier to dispose of the package and stuff associated with it when no longer needed as well as get it running faster once installed.\n. Yes, also working on that. I'm using /logviewer route currently, and plan on adding query string 'key=default_config_key' currently. This way, the route is easily protected, and users can easily configure the key (and in a way the route for this). \n. Yeah, will submit a new one in a giffy.\n. ",
    "ravaboard": "Laravel version - latest. The environment is set to local on my .env file.\n. Thanks, your extension is awesome!\n. ",
    "snoyface": "Using newest version installed, added \nRap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider' in config/app.php Using in local environment.\nStill recieving error local.ERROR: exception 'InvalidArgumentException' with message 'No hint path defined for [laravel-log-viewer].\n. Laravel 5.1, most recent stable build (0.4.3). \nThank you, that did it!\n. ",
    "xavierpernalete": "I have this problem when using.\nInvalidArgumentException in FileViewFinder.php line 112:\nNo hint path defined for [laravel-log-viewer].. \nThank you I had to run  command artisan. ",
    "Jeroen-G": "According to the  docs, vendor:publish would do the same trick if the service provider is configured right.\n. ",
    "osugregor": "Thats fine, its just faster to scroll and navigate/search on a single page.\nI commonly use control-f and assumed others do as well. \nIt really just comes down to user preference. I wont be hurt if its not integrated.\n. ",
    "eblount": "I don't see why this failed. I could certainly be wrong, but it looks like a problem with the CI service. It says \"This task was aborted because another task already failed.\", but the other tasks are green.\n. Awesome, thanks!\n. ",
    "briedis": "This is reset to 10 every time I reload the page, but I usually view 25 logs per page.\n\n. Hmm, could be a new bug:\nhttps://ziedlejas.lv/screenshots/img.2015.04.10.MYnNyT.png\nI'm failing to expand logs..\n. Looks like it works, thanks! :)\n. I don't know, we need an artist :D\nMaybe something like this? https://ziedlejas.lv/screenshots/img.2015.05.07.01ADAk.png\n. ",
    "laurencei": "Yeah - this would be super useful. I agree with Briedis screenshot - just a 'download log file' link (or button) in the view is all you need.\n. 400mb for a log file? That seems exceptionally huge. Most of my sites only run at a few mb... perhaps you are logging too much?\n. ",
    "CWSpear": "In my research, I found jasonlewis/resource-watcher, which just polls every second.\n. There's always https://github.com/reactphp/react!\nBut again, maybe extra work (and work to set up just to get logs running for the end user!)\nWhen you say DataTable, do you mean https://www.datatables.net/?\n. There are a lot of different places you could approach this from a UX perspective: You could remove paging and you could have a tail -f like experience, where it just loads the last ~10 items (and you could load more) and then if you're scrolled to the bottom, it adds more items to the bottom as they're automatically added (and it keeps \"scrolled to bottom\"). Then if they are not scrolled to the bottom, it just maintains they're position (and you could have notifications, or badges, etc).\nOr maybe it's a checkbox to \"stick to bottom.\" etc, etc.\nBut yeah, that'd be extreme. But there's lots of different ways you could solve it if you felt like you really wanted to embrace this feature.\n. No, I think you could still keep the filter/search options just client-side. In fact, it's very rare that I want to search the backlog. I mean, this is how the Clear Display button (another feature that could be nice!) works in Mac's Console.app. If it's not visible, it's not searched/filtered.\nI guess we're maybe considering two different kinds of use-cases: the one where there's an error in production and you want to take a look at what happened, and the other where you're developing, and you want to see all logging (as some may be debug output) as it's happening, and be able to clear the display as to make it obvious that \"these messages happened since I last cleared,\" etc.\n. :+1: I think that sounds good! =)\n. ",
    "RobinHoutevelts": "Only PHP CLI is suited for long-running apps.\nIt's even mentioned on  jasonlewis/resource-watcher\n\nResource Watcher is best used from a console.\n\nHowever, you could write something in javascript that polls the controller which checks the log and returns the new lines.\nThen back on the client-side you would append this to the page.\nOn the PHP's side it's fairly little work.\nSomething like this https://gist.github.com/RobinHoutevelts/1f143d4554dc210dedd0 might already do the trick ( sorry for the code style ).\nThe difficult part would be to append it into the DataTable on the javascript-side.\nI guess you could just insert the logs into the table and re-run the $('#table-log').DataTable call.\n. > what if I'm on second (or third, etc.) page when it's update ? Or what if I doing a search or a filter on the result table ?\nIf you inject the log-rows directly into the DataTables object this won't be an issue. \njavascript\nvar dataTable = $('#table-log').DataTable();\ndataTable.row.add([col1,col2, col3, ..]);\nThe \"difficult\" part I was talking about is maintaining the layout.\nfor example: <td class=\"text-{{{$log['level_class']}}}\">\nTo accomplish this you'll have to use the createdRow option.\nI've created a JSbin that shows nearly all the work.\nAs you can see the rows are dynamically added from the data variable AND the td-elements are manually updated.\nI'm swamped with work right now but I'll see if I can find the time to create a pull request.\nEdit: Pull request made. I have no idea why Scrutinizer fails.\nAnalyzing composer.json/composer.lock files to determine dependencies of the root package.\nEdit²: Had a bug where I went over the rows that were added by Blade. This forced Scrutinizer to re-analyze and all is green :+1: \n. That's hell if you want to keep the filter- and search options.\nYou'll need to re-query the server every time you filter or search because you don't have everything loaded on the client side.\nI fixed this by keeping count of how many rows I'm already showing. Every 2.5s I query the server and tell it how many rows (n) I already have.\nThe server then responds like usual but cuts of the first n rows leaving us with the new rows.\n. > In fact, it's very rare that I want to search the backlog.\nIn my case the search-option would be used to see how often an event occurred. Having all the logs available is necessary.\n\nNo, I think you could still keep the filter/search options just client-side. ... If it's not visible, it's not searched/filtered.\n\nThat would nullify the reason I'm implementing this into my project.\n\nI guess we're maybe considering two different kinds of use-cases\n\nI agree.\nI'm currently implementing laravel-log-viewer so the lone sysadmin can lookup issues mentioned by the staff.\nWhile I'm developing I just have the log file open in my IDE and clear it myself from time to time.\nIMO the primary goal of this package should be to make it easier for non-developers to view the log-file.\n\nClear Display button (another feature that could be nice!)\n\n:+1:  I agree that this could be a useful feature, and one that somewhat merges the two use-cases together.\nWhen you are developing you could have the page open, press Clear Display to remove the old logs from the screen.\nThen with this live stream log feature you would only be seeing the new lines being added in real-time.\n \nWould this work for you?\n. > One other argument (maybe the most important) is about performance in parsing log data (my bad).\nNo worries, that's a decent argument!\nHaving to parse all logs also feels wrong to me but I didn't want to rewrite the internals just for this modification.\n\nbut I think I will close this ticket (if you are OK)\n\nGo ahead. I'll just update our composer.json to use my fork then :+1: \n. ",
    "Hawkeye66": "That's not the behaviour using Laravel 4.x. Double {{}} does NOT escape,\nyou have to use triple {{{}}} in 4.x (see\nhttp://laravel.com/docs/4.2/templates) or else - and for safety - wrap it\nin htmlentities() regardless.\nNice package by the way - just the above took me ages to work out why\nstrange things were happening! One of my log messages had \"",
    "libern": "Well, I have check my log, they are all around 400MB or some smaller like ~150MB.\nI think the solution is that you read files line by line and only read those lines needs to be displayed.\nIf the next page, or different log file, just reread again, without using javascript to achieve.\n. It might be because my app is huge and there are tons of components. Which will generate same exception repeatedly depends on how many visitors \n. ",
    "UnrulyNatives": "I noticed that the names of the view files in storage are the same in production and in my local copy. \nWe would have to determine if the names are purposefully obfuscated, or are easy to reverse. \nI guess we could find a place where they are rendered and store the corresponding names(source name and the looks-like-random name in a DB or text array. \nIt is beyond me to do such a thing, but sooner or later I wil certainly get to it.\n.  you are right. \nHow about hiding all logs except the most recent one?\n. ",
    "rtconner": "I want this feature also. Please don't force your lack of features on me because you think it's dangerous. Just make it a config option. Let me make my own security decisions.\n. Yeah this request is more than I'd expect from a log viewer. Kind of opens up a whole can of worms of crazy features that most people would never use.\n@ffsantos92 you should really look at an enterprise solution like NewRelic or GetSentry or Bugsnag.\n. ",
    "linxgws": "Its common for AngularJS frontends to change the default Laravel delimiters because Angular uses the same {{ }} delimiters by default.\n. Good tip. Still not ideal though, requires extra work for frontend devs to remember the @ symbols everywhere.\nA lot cleaner to just change Laravel's to [[ ]] since the vast majority (99%) of expressions for an Angular based project will be using Angular's way over Laravel's.\nI did fix this problem on my own by recreating the entire log page and rerouting to it instead of the default one included by laravel-log-viewer.\nJust thought it was worth a look to see if there was an easy way to avoid using (or change dynamically) the Laravel braces in case any other Angular devs out there decide to use your package.\n. ",
    "nikolasfr": "Its useful for development when you are using daily log files ;) \n. ",
    "newtonianb": "ah ok, then it must be because I have too many entries sometimes it feels like its refreshing/crashing.\nShowing 1 to 10 of 12,152 entries\nI feel the pagination is not really working, it seems to load everything?\nWe use the logs for outputting SQL queries so it gets big really fast and its really slow.\nMaybe then disabling pagination would actually make things faster so it doesn't have to process through it all.\n. Ah that would make sense why it's so slow if it's trying to load everything. Thanks a lot!\n. ",
    "rafaelbeckel": "Before the PR, I think I need to print the subject and headers in a prettier way, and also give the option for the user to see the raw log.\n. I see. In my case, the \"/logs\" route has a middleware that only allows execution in local environment and debug set to true. Anyway, there are safer ways to do that, like allowing only specific sets of html tags and manually rendering them, instead of outputting the entire unescaped text as-is.\n. Well, but who will ever use the \"Log\" driver in a production environment? In production, all mail go to Mandrill or SMTP or whatever. It never gets logged. Log driver is only meant for development envs.\nIt's pretty damn useful for fast iteraction of mailing development: just go to whatever route that dispatches an e-mail job, then go to /logs and click on some URL contained in the e-mail body (confirm your account link, for example).\nIf there's some tiny detail to adjust in the e-mail template, just fix it and go to the route again, then update the logs tab. It's just handy and fast.\nIn the last message, I commented about cherry-picking and allowing just specific html tags, like ,  and ; and escaping everything else. It wouldn't use the dangerous {!! !!} constructors, but instead it would prepare the output in an array and show it carefully. Also, most transactional e-mails does not contain user-generated info.\nWe can put this option (disabled by default) in a config file and let the developer decide. I'll push a PR when I have some time, taking care of those security issues, then you can evaluate if it's safe enough. ;)\nCheers\n. ",
    "antonkomarev": "Oh, thank you!\nIt's enough to create folder /resources/views/vendor/laravel-log-viewer and put there a file log.blade.php.\nIt works.\n. ",
    "judgej": "I personally think that just splitting the view into two - a layout view and a content view - would be a great update to this package. That way people can choose to continue to use the core view, unchanged (getting updates as needed) and still use their own wrapper/layout view.\n. Daily log rotates are on, yes. I had an error (with a 55-line stack dump) every minute on a scheduled job over the weekend, so you can imagine how quickly that built up, even with daily logs.\n. There are suggestions on how to efficiently count the lines in a file here:\nhttp://stackoverflow.com/questions/2162497/efficiently-counting-the-number-of-lines-of-a-text-file-200mb\nWatch out for line ending characters though. This can be expanded to extract N lines starting at line L.\nQuerying would be a little more work - starting at line L you need to extract N lines that match the query string, or you reach end of file. Probably not too difficult though. The main problem with this is that the log files are not indexed, so you are doing a full table scan every time. But then, the current non-AJAX approach does that anyway.\nSo given the start line, the number of lines, and any query string (all passed in as GET parameters through a Datatable, the lines of the log file are put into a simple JSON response and that's it. I think it would be relatively straight-forward without needing to us any third-party packages.\nUsing Datatables like this, all your initial page would deliver is the table headers and the JS to map the returned data onto the table columns, then Datatables does the rest.\nI'll see what kind of demo I can knock together. I'll check the other forks first though, as there are a few of them, and someone may already have done this.\n. Been looking around for solutions to this, but not come up with anything yet. The problem with taking sections, i.e. pages, from a log file, is indexing; the logfiles are not indexed.\nEach logfile has has many entries, each being a variable number of lines but starting with a matching pattern (that may vary, depending on laravel settings). The order of the logged messages is backwards, so the last entry should be top of the first page. So you cannot could lines in the file to find a particular error log entry, unless it has been previously indexed. The index may be the key in the end - a list of timestamps, and byte-count offset at which those lines start. If each had a timestamp, that would be something else that could be range-searched on.\nA text search of everything in the file would involve a full-table scan, so there is no much we can do about that, but it's the reverse order that is always going to be the problem - you can't just start at the end and work backwards.\nSo I'm looking for tools that will index a text file, given that some entries in that file will cover multiple lines.\n. I'm still thinking about how the files can be read without loading the whole thing into memory. I think it has to include pre-processing to index the file to achieve this. Given a two-way index of file line numbers to error record numbers, it is possible to seek directory to record number in order to read however many records are needed, without loading the whole file into memory.\nPaging through a search result is a little more tricky, but would be helped if the start record of each page were scanned for and cached when a search is first performed.\nI realise log files should generally not be too big anyway, but when things go wrong they can grow in size quickly, and that happens to be when you need to be able to view them the most.\n. So could your excellent laravel datatables package be used here for rendering? Or does your package focus more on linking the tables to eloquent?\nEffectively it just needs to be able to treat a log file like a database table. Hmm, that's a thought - a text file driver for eloquent that handles parsing and indexing...\n. monolog can write direct to sqlite which is one way to get access to the logs through eloquent. It seems safer writing logs to raw text, so maybe the logfiles can be parsed and new log entries pushed into an sqlite database - that's all the indexing, queries, searches etc, sorted.\nI'll just leave that idea hanging there, and come back to it later :-)\n. Yes, this would be the usual way to provide hierarchical structure to the views.\n. As a general point, hard-coded strings and other values would certainly benefit from being properties of the controller, whether they are changed by overriding the controller or through some kind of setter or injected config. So this is certainly a good idea anyway, allowing the main entry point to the log viewer page to be changed easily.\nThe main point of this issue though, was to split the single view up into embedded layers, that can be put together in other ways, or have layers overridden without having to override the entire page view. As well as the page wrapper, there is the main log table, and also the side-bar list of log files. All these would ideally be partials (views included in views) IMO.\nI should be getting back to my project that uses this later in the Summer, so can create a PR then, if someone else hasn't already done so.\n. ",
    "7henry767": "Thanks\n. ",
    "yajra": "Guys, I just implemented the server-side processing of datatables for this awesome package on my own controller. And instead of toggling, I used modal box to display the full error stack message. If you like, I can create a PR for it. \n@rap2hpoutre thanks for this great package. \nBelow is the snippet I used:\n_Controller_\n``` php\npublic function logs(Request $request, Datatables $datatables)\n    {\n        if ($request->input('l')) {\n            LaravelLogViewer::setFile(base64_decode($request->input('l')));\n        }\n    if ($request->input('dl')) {\n        return response()->download(LaravelLogViewer::pathToLogFile(base64_decode($request->input('dl'))));\n    } elseif ($request->has('del')) {\n        File::delete(LaravelLogViewer::pathToLogFile(base64_decode($request->input('del'))));\n\n        return redirect()->to($request->url());\n    }\n\n    $logs = LaravelLogViewer::all();\n\n    if ($request->wantsJson()) {\n        return $datatables->collection(collect($logs))\n                          ->editColumn('stack', '{!! nl2br($stack) !!}')\n                          ->editColumn('level', function ($log) {\n                              $content = $this->html->tag('span', '', [\n                                  'class' => \"glyphicon glyphicon-{$log['level_img']}-sign\",\n                              ]);\n\n                              $content .= '&nbsp;' . $log['level'];\n\n                              return $this->html->tag('span', $content, ['class' => \"text-{$log['level_class']}\"]);\n                          })\n                          ->addColumn('content', function ($log) {\n                              $html = '';\n                              if ($log['stack']) {\n                                  $html = '<a class=\"pull-right expand btn btn-default btn-xs\"><span class=\"glyphicon glyphicon-search\"></span></a>';\n                              }\n\n                              $html .= $log['text'];\n\n                              if (isset($log['in_file'])) {\n                                  $html .= '<br>' . $log['in_file'];\n                              }\n\n                              return $html;\n                          })\n                          ->make(true);\n    }\n\n    return view('administrator.utilities.log', [\n        'logs'         => $logs,\n        'files'        => LaravelLogViewer::getFiles(true),\n        'current_file' => LaravelLogViewer::getFileName(),\n    ]);\n}\n\n```\nJS Script:\n``` js\n    $(document).ready(function () {\n        var oTable = $('#table-log').DataTable({\n            \"order\": [1, 'desc'],\n            \"serverSide\": true,\n            \"processing\": true,\n            \"ajax\": \"\",\n            \"stateSave\": true,\n            \"columns\": [\n                {data: \"level\"},\n                {data: \"date\"},\n                {data: \"content\"},\n                {data: \"text\", visible: false},\n                {data: \"in_file\", visible: false},\n                {data: \"stack\", visible: false}\n            ]\n        }).on('click', '.expand', function () {\n            var tr = $(this).parents(tr);\n            var data = oTable.row(tr).data();\n            $('#stack-text').html(data.text);\n            if (! data.in_file) {\n                $('#stack-file').hide();\n            } else {\n                $('#stack-file').show();\n                $('#stack-file').html(data.in_file);\n            }\n            $('#stack-details').html(data.stack);\n            $('#stack-modal').modal('show');\n        });\n    $('#delete-log').click(function () {\n        return confirm('Are you sure?');\n    });\n});\n\n```\nModal Box\nphp\n<div class=\"modal fade\" id=\"stack-modal\">\n        <div class=\"modal-dialog modal-lg\">\n            <div class=\"modal-content\">\n                <div class=\"modal-header\">\n                    <button type=\"button\" class=\"close\" data-dismiss=\"modal\" aria-hidden=\"true\">&times;</button>\n                    <h4 class=\"modal-title\" id=\"stack-text\"></h4>\n                </div>\n                <div class=\"modal-body\">\n                    <div id=\"stack-file\" class=\"lead\"></div>\n                    <div id=\"stack-details\"></div>\n                </div>\n                <div class=\"modal-footer\">\n                    <button type=\"button\" class=\"btn btn-default\" data-dismiss=\"modal\">Close</button>\n                </div>\n            </div>\n        </div>\n    </div>\n. Good point at trying to pre-process the log file and I don't have any idea how to do it ^_^. \nBut for displaying purposes ATM, the performance significantly improved when I converted this package to server-side pagination and search.\n. @judgej Yes, you can use the snippet above to implement your own log viewer like what I did. $logs = LaravelLogViewer::all(); returns an array and the trick is to just convert it to collection using collect() helper method.\n``` php\n$logs = LaravelLogViewer::all();\nif ($request->wantsJson()) {\n    return $datatables->collection(collect($logs))->make(true);\n}\n```\n. ",
    "fabiofdsantos": "+1\n. In situations when log is viewed by more than one person, this could be a nice feature to mark errors as solved.\n. I agree with @rtconner. I'll try GetSentry or Bugsnag :smiley: \nping > @pedrogrou\n. ",
    "bert-w": "perhaps an even better solution:\nRap2hpoutre\\LaravelLogViewer\\LogViewerController\n- Create protected variables named $viewLogFile(string) and $viewLayoutFile(string) which are used in View::make($viewFile...)\nThis allows you to simply create your own LogViewerController which extends the Rap2hpoutre one. Then just set the $viewLogFile or $viewLayoutFile to use your own view-container as the parent.\n. https://github.com/rap2hpoutre/laravel-log-viewer/pull/65\n. where do they find the wiki? Personally I would add it to the readme on the very bottom, and stress it is an \"optional\" config.\nAs long as people know the feature exists :)\n. ",
    "wangkaibo": "We use the monolog to record the important operation logs and save in the laravel logs directory.\n``` php\nnamespace Loopeer\\QuickCms\\Services\\Utils;\nuse Monolog\\Handler\\FirePHPHandler;\nuse Monolog\\Handler\\StreamHandler;\nuse Monolog\\Logger;\nclass LogUtil {\n/**\n * Get log object\n * @param $name\n * @param $dir\n * @return Logger\n */\npublic static function getLogger($name, $dir = null) {\n    $logger = new Logger($name);\n    $date = date('Ymd', time());\n    $file_name = $name . '_' . $date . '.log';\n    $path = storage_path() . '/logs/' . ($dir ? ($dir . '/') : '') . $file_name;\n    $stream = new StreamHandler($path, Logger::INFO);\n    $fire_php = new FirePHPHandler();\n    $logger->pushHandler($stream);\n    $logger->pushHandler($fire_php);\n    return $logger;\n}\n\n}\n```\n. ",
    "keneasson": "This works perfectly for me with Monolog! \n[Edit]\nI now see all my logs in the left Nav, however clicking on a Nested Log file results in the first Log being opened.\nI note the Hash in the URL changes for each link, but the actual log content doesn't change.\n. I fixed my issue above with the following change:\npublic static function pathToLogFile($file) {\n$logsPath = storage_path('logs');\nif (File::exists($file)) { // try the absolute path\nreturn $file;\n}\n$file = $logsPath . '/' . $file;\n// check if requested file is really in the logs directory\n-        if (dirname($file) !== $logsPath) {\n+        if (strpos(dirname($file), $logsPath)) {\nthrow new \\Exception('No such log file');\n}\nreturn $file;\n}\n. ",
    "melihovv": "+1 for such functionality!\n. In my fork I implemented such functionality.. ",
    "ghost": "PHP 5.4.45\n. Thank you for your answer !\n. ",
    "pawanshetty": "Even I am getting the same error , \n. ",
    "CharlesHenry": "This also seems to break Laravel v5.0 since laravel-log-viewer v0.5.0\n. @rap2hpoutre, yes it's using the Request class.\n@mikemand I agree with you but I think that's a different change to what I'm doing here. That issue you are highlighting already existed before I made my change and it's functional how it is.\n. ",
    "apreiml": "Additionally: Use https for files loaded from content distribution networks like datatables.js\n. Ok, switched back to Request::input, I'm not entirely sure why I moved to Input.\n. It should be ok now. Or did I still miss one? :D\n. ok, regarding the scrutinizer: It was a scope error on my side. \nI see, I didn't now that you can manually set the filename. My first thought is that you should then only be able to load such a file. It may be also convenient to set the path to the config dir(s) and only allow to load files in those dirs.. ",
    "okaufmann": "Ok, if your goal ist to keep it as simple as possible I see your point.\nThen Il' close this PR.\nThanks for your work!\n. ",
    "arturmamedov": "This work for the default monolog format\n\"[%datetime%] %channel%.%level_name%: %message% %context% %extra%\\n\"\none thing is that i not undersant from where you get 'stack' that you use after for open close the information about log message.\n. Yes it work with Laravel 5.1.35 in my case, and it has a fallback if no extra options is used in monolog. I adjust the indentation and check in Laravel 4.2 and the new 5.3.x\n. Its be very nice if we create a config file, and configuring the timezone and format inside it.\n. Yes you right! In my case i wont to see the log datetime in locale format and timezone. But for many developer this thing can be a over do. (P.S. if someone need to show logs to end user to(customer), for complete control over web application, i think its better, convert to the local timezone and format)\n. ",
    "morfin": "Found solution:\nmake sure 'storage/framework/views' exists.\nhttps://laracasts.com/discuss/channels/general-discussion/errorexception-in-filesystemphp-line-75\n. ",
    "greabock": "Lol... bots are so bots. It's is not a bug but just a trick\n. ",
    "schonhose": "This is generally caused by a caching error.\nphp artisan config:cache solves this problem. The readme should be updated to include this solution.\n(note: I experienced the same problem, came here through a google search but found the solution elsewhere).\n. yw, great log viewer! Works like a charm.\n. ",
    "gocanto": "This is how it worked for me php artisan clear-compiled.\nJust in case somebody else ran into the same issue. \nThanks! . ",
    "mallardduck": "I've submitted #70 that addresses this request.\n. ",
    "seblavoie": "Well sometimes when things go sour, apps can start logging errors on a loop and make the logs gigantic. Which can result in server memory saturation. I think this would be a way to easily locate log file that has become too big.\n. ",
    "mstaack": "yeah i do have facades activated....weird...i am getting this error\n. ",
    "hieugroup": "this error occurred while deleting a log file\n. ",
    "elghobaty": "@mstaack  Since version 5.2, Lumen uses a different Redirector class (other than Illuminate's) and no longer offers a container alias for the Redirector class or the Redirect Facade out of the box. So you should do them yourself.\nIn your bootstrap/app.php,  add the following code\n$app->withFacades(true, [\n    'Illuminate\\Support\\Facades\\Redirect' => 'Redirect'\n]);\n$app->bind('redirect', 'Laravel\\Lumen\\Http\\Redirector');\n\n@rap2hpoutre In the LogViewerController, you may want to consider using redirect() helper function instead of the Redirect facade since the it will have the same behaviour in both Laravel and Lumen without extra configuration.. ",
    "tssujt": "See LaravelLogViewerServiceProvider:\nif (method_exists($this, 'loadViewsFrom')) {\n            $this->loadViewsFrom(__DIR__.'/../../views', 'laravel-log-viewer');\n        }\nMake 'log.blade.php' file in 'resources/views/vendor/laravel-log-viewer/' dir to use custom view.\n. ",
    "Agontuk": "Don't know about 4.2, but I'm positive it works on laravel & lumen 5 versions. Okay, I'll check in 4.2. Last commit makes it compatible with 4.2. response helper method was not available in 4.2, so I used the facade for 4.2 only. anytime :). ",
    "chmdznr": "Still got the same error even after adding a backslash. The whole route:\n```\n$app->get('/', function () use ($app) {\n    return $app->version();\n});\n$app->get('/what', function () use ($app) {\n    return \"what the heck....\";\n});\n$app->group(['namespace' => '\\Rap2hpoutre\\LaravelLogViewer'], function() use ($app) {\n    $app->get('logs', 'LogViewerController@index');\n});\n. Yes, it is. This is my `bootstrap/app.php` (just the service provider regist. part):\n$app->register(App\\Providers\\AppServiceProvider::class);\n// $app->register(App\\Providers\\AuthServiceProvider::class);\n// $app->register(App\\Providers\\EventServiceProvider::class);\n$app->register(\\Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class);\n```. Wow!\nYour patch on lumen is really working (while waiting for the merge, I edited the problematic file and test it by myself)!\nSo, it's lumen problem.. ",
    "ToujouAya": "@rap2hpoutre \nI got same problem like this\nI have config like this in bootstrap\\app.php file\n$app->register(\\Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class);\nand in app\\Http\\routes.php file\n$app->group(['namespace' => '\\Rap2hpoutre\\LaravelLogViewer'], function() use ($app) {\n    $app->get('logs', 'LogViewerController@index');\n});\nHow to fix it? \nThanks \n. @rap2hpoutre\nI understood, thanks . ",
    "oknixus": "Sorry, I encountered the same problem. But my lumen framework is 5.5; \nHow can I fix it ?\nThanks a lot.. @rap2hpoutre Thanks for your attentions. I tried two ways:\n$app->register(\\Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class);\nand \n$app->register(Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class);\nbut the problem  always exists;. ",
    "bret-2600": "Upgrading worked!  Thanks a ton!. ",
    "cino": "Awesome, thanks for merging this PR this fast! . As you closed this yourself, would you also want to explain what you did to fix the issue for others who might experience the same? :). Somewhere I messed up, these first 2 commits shouldn't have been there. Since they are already in the repo. . To be honest I don't think this package is made for something like that. I suggest you take a look at Sentry. Looks like you're not using the right class name, you should use it like this:\nRoute::get('logs', '\\Rap2hpoutre\\LaravelLogViewer\\LogViewerController@index')\n( See the difference from your error, it says LogViewerController and not just Controller ). @galdazbiz From reading this issue I'd say this feature is not the purpose of a package like this. I'd suggest installing it in all the different Laravel applications. In that way it would also be separated for each of your applications.  . Solution would be to fix the code that's causing the error being thrown.... ",
    "ahuggins": "This PR will make the whole row clickable: https://github.com/rap2hpoutre/laravel-log-viewer/pull/91. \n. I saw this uses Bootstrap 4.0.0, so I thought moving the logs and the name of the package to a navbar would be a little nicer. This gives the logs more horizontal width which should make looking at logs a little nicer.\nI also added a footer, with links to the Repo and the Issues, cause I know sometimes I have an idea and would like to quickly get to the repo to make an issue or just see the docs. Adding these links makes that easier.\nIn order to make it look good, I made the Logs a Select box instead of a list. I'm not sure I myself am thrilled with it....but maybe there is a solution we can come up. I had to add a tiny bit of JS to handle the \"change() for the select\" in order for it to work like navigation for multiple files.\nOpen to feedback if you want to change something, so let me know.. Cool! No problem on timing, that's how open source goes.\nYeah, the dropdown log file selector felt a little weird to me too. I'll take a look and see if I can figure out a way that works with just links. Thanks for the feedback, I'll try to get something back in a couple days.. OK, finally had a minute to address the concerns raised. Since you said the \"by rap2h\" at the top was not needed. I changed the selector items to be a simple Bootstrap navbar. My thinking here is that you have the name of the package and then the log files as navigation. It seems to work, but I could see there being a potential concern if log names are long...or you have a lot, like in a scenario where you do daily logs for 7 days or something.\nBut I do like the easy access and I think it is pretty obvious what the nav items are representing.\nIf not as nav items, I almost think a bar underneath the top bar could work...but with long names or with lots of logs, we would again face the same problem.\nOf course, the original list to the side of the log entries feels like the obvious choice, but that was also one of the main things I was aiming to change with the design changes. Allowing the viewer to see more of the message by the width being wider.\nI guess I am going to leave it for now, and see what feedback comes back this time. Feels close, and for most situations it would work fine...just those couple cases where log names are really long...and if you had like 7 daily logs. Though I just created some sample ones to see how it works...and I think it's sort of ok.. \nSample of the new changes. \nWith many log files. ",
    "ryanvade": "I'm seeing the same issue. The log is being generated by jobs run via supervisor. Perhaps it is a file permission issue. . ",
    "kevyworks": "If possible, if the regex fails just display line-by-line instead.. ",
    "macecchi": "Nice work. The changes look solid and worked here.\n@rap2hpoutre when is this getting merged?. ",
    "seanlai": "thanks, the error went away with v0.10.2. ",
    "Omranic": "It's all green there despite the Errored flag! Try to re-run the analysis again, Scrutinizer sometimes has internal issues like this... ",
    "akoepcke": "Ok, that's weird. I'm using v5.4.28 . Started developing with a slightly older version, but composer updated to newest version today. After that, I tried to publish the log view and it would not work.\nIt just occurred to me, that maybe I should try it again on a vanilla Laravel install, and it worked without a problem. Although I have no idea what I possibly could have done to mess with Laravel's publishing system.. No, still doesn't  work, not with composer install and not with composer update.\nI cloned my project and created a new repository on GitHub( which you can find here ), downloaded and  freshly installed it again, and tried to publish again, still no luck. It just says Publishing complete., doesn't publish any files but doesn't give me an error either.\nThe project is still pretty basic, and doesn't contain too much extra packages, so I have no idea where things could have started to go wrong. My best bet would be it having something to do with the order of packages in composer.json or config/app->providers, but to the best of my knowledge, that shouldn't make too much of a difference either.. Ok, I'm sorry for that one. I checked again and noticed that I submitted my test repo with the log.blade.php already in it 🤦🏼‍♀️\nSo what I tried again just now, is the following:\nlaravel new debug-log\ncd debug-log\nEdit the composer.json to require the following:\n\"require\": {\n        ...\n        \"caouecs/laravel-lang\": \"~3.0\",\n        \"laracademy/interactive-make\": \"^1.1\",\n        \"laravelcollective/html\": \"^5.4\",\n        \"percymamedy/laravel-dev-booter\": \"^0.1.2\",\n        \"rap2hpoutre/laravel-log-viewer\": \"^0.8.1\",\n        \"spatie/laravel-permission\": \"^2.1\"\n    },\n    \"require-dev\": {\n       ...\n        \"barryvdh/laravel-debugbar\": \"^2.3\",\n        \"deployer/deployer\": \"^5.1\",\n        \"deployer/recipes\": \"^4.0\"\n    },\nAdd ServiceProvider to config/app.php\nRap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider::class,\nRun\ncomposer update\nAnd finally, try again:\nphp artisan vendor:publish --provider=\"Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider\" --tag=views\nAgain, as a result I get Publishing complete, but it doesn't give me the file and doesn't tell me the file name of the (non-)published log.blade.php \nedit: I also ran php artisan vendor:publish without any of the flags, just in case I misspelled something, which gives me vendor\\mail, vendor\\notifications and vendor\\pagination, but no log-viewer.. Perfect! No idea, how I ended up with the wrong version, as I didn't set the project up too long ago, but it's working now.\nThank you for your time!. ",
    "irkfdb": "Same thing occurred with me too on php artisan vendor:publish \\\n  --provider=\"Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider\" \\\n  --tag=views it just says Publishing complete.\nbut view is not available in vendor folder.\n[edited] - my bad missed out adding the package in app.php\n~~Also when i hit the route /logs getting following exception~~\n~~(1/1) InvalidArgumentException No hint path defined for [laravel-log-viewer].~~. ",
    "rajatsharma94": "Sorry, just noticed, this has been solved in the newer build.. ",
    "DarkCobalt": "Ah sorry I have too much case on head, but now i have free time then i will create PR for this :). ",
    "marabesi": "I think Laravel creates a new one if it doesn't exists, right?. Fair enough, thank you!. ",
    "watermelonjuice": "It may do such a check on first run. It is not doing such a check if it is deleted while artisan is accessing it. . You can blank the log file if it is the current day. Crashing servers is worse than weird behaviour. The weird behaviour can be justified in documentation.. ",
    "maig81": "May I suggest a new button  that will save/rename the old log file and start a new one (create a blank file)? That would be great for backup purposes. . ",
    "Edison6351": "ok resolved it thanks for reply and i think you can trying to merge my pr :). ",
    "luqmanrom": "I am checking\nOn 28 Sep 2017 3:45 p.m., \"Raphaël Huchet\" notifications@github.com wrote:\n\nThank you! I just have a few questions:\n\nDoes this still work if there is no parameters in query (I not sure\n   because I only see & operator)\nDoes it still work with Laravel 4.2, Laravel 5.5 and Lumen (last\n   version)? I'm not totally sure it does because of this:\n   $this->request->getRequestUri().\n\nCould you check this?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/rap2hpoutre/laravel-log-viewer/pull/106#issuecomment-332755972,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AGIwAw0qF1jXWJkXAt3gZY28PlKHvkigks5sm061gaJpZM4Pmq5R\n.\n. \n",
    "stefkes": "https://laravel.com/docs/5.5/middleware#assigning-middleware-to-routes. ",
    "GabrielDeveloper": "@rap2hpoutre, this is a great feature, can you examine if it's viable? . ",
    "alanwillms": "Sorry, I was in a bit of a hurry at that time but now I was able to fix it. Please review my pull request.. ",
    "sarfraznawaz2005": "okay i have updated so only additions are there keeping existing whitespace intact. thx. ",
    "jeremykenedy": "Maybe this will help:\nLumens app.php\nhttps://github.com/laravel/lumen/blob/master/bootstrap/app.php\nMy modified Laravelapp.php to separate the logs:\nhttps://github.com/jeremykenedy/laravel-auth/blob/master/bootstrap/app.php\nLaravels app.php\nhttps://github.com/laravel/laravel/blob/master/bootstrap/app.php. ",
    "bharatvaggu": "I want to generate different log level in daily log(single file). \nCurrently I am generating log like year/month/day. Every time lumen generating error log level not like Warning, Info etc.\nEx. Its generating only error log level.\nlumen.ERROR: Symfony\\Component\\Debug\\Exception\\FatalThrowableError: Parse error: syntax error, unexpected '$username' (T_VARIABLE) in lumen/app/Http/Controllers/Login.php:28\nI want like lumen.INFO, lumen.Warning etc\nMy code is -\n$app->configureMonologUsing(function ($monolog) {\n    $currentDate = Carbon\\Carbon::now()->toDateTimeString();\n    $getYearMonth = explode('-',$currentDate);\n    $path = storage_path('logs/'.$getYearMonth[0].\"/\".$getYearMonth[1].'/lumen.log');\n        $rotatingLogHandler = (new RotatingFileHandler($path))\n        ->setFormatter(new LineFormatter(null, null, true, true)); \n    $monolog->setHandlers([$rotatingLogHandler]);\n    return $monolog; \n});. ",
    "withArtur": "After one month of Bootstrap 4 stable, the 3ird is yet obsolete? \nGuys how many sites you develop?. ",
    "mattlibera": "i am actually working through this right now within a project of mine, and if i can abstract it back out to your package i'll be happy to share.\none thing we lose with bs4 is glyphicons - docs recommend using a 3rd party font library instead. do you have a preferred font library? i personally use fontawesome but that's just out of habit at this point. 😃 . sounds good to me! i'll dig in and see if i can get you an ETA. there are already libraries for datatables that support bs4 so that part is easy to drop in.. PR is in! happy to discuss anything / everything. #122 . Thanks for the kind words! I'm glad it was helpful, and happy to have the chance to contribute.\nCheers - thanks for this package. It helps us a lot in our enterprise Laravel apps.. ",
    "galdazbiz": "Thank you so much for your quick answer!!!\nI think you got my idea, I have a parent folder called myprojects with all my webs, one of them is the folder oneFolder where I have the laravel app. Another folder is adminFolder which has it's own laravel independent app where I can admin my webs. So once I install your app in adminFolder the questions are:\n1) Is it possible to read the logs files from myprojects/oneFolder instead of the logs from myprojects/adminFolder. Doing something like /../oneFolder/logs/laravel.log or /myprojects/oneFolder/logs/laravel.log that it's the correct source log\n2) Or imagine I want to manage several logs files from several domains, is it mandatory to install the vendor on each domain, or can I do something like admiFolder.com/logsForOneFolder, admiFolder.com/logsForSecondFolder\nSo I think in my previous post I wasn't very clear ;) because additionally in my nginx config, I have  separated routes for each subdomain, I'm not using the laravel subdomain routes to not mess the admin side (several apps) with the production side.. well @rap2hpoutre , still not lucky, if you have any tip it will be welcome haha, sorry to ask but when I try by myself and I'm stuck... ",
    "elminson": "Hello @rap2hpoutre  can I work to extract all the \"pattern\" for the preg_match_all parameters?  I'm not sure if this is a good idea but having the \"patterns\" all over the class instead of having all the patterns on a class (or a config file)  for the preg_match.. Thanks @rap2hpoutre. All the time I keep in mind how to make code simple, reusable and readable. If you don't accept it is ok, I will try again until you like it :) lol. I will submit the PR in a few minutes.. @rap2hpoutre this is enough for this documentation? \n``\nreturn [\n    /*\n     |--------------------------------------------------------------------------\n     | Pattern and storage path settings\n     |--------------------------------------------------------------------------\n     |\n     | The env key for pattern and storage path with a default value\n     |\n     */\n    'pattern' => env('LOGVIEWER_PATTERN', '*.log'),\n    'storage_path' => env('LOGVIEWER_STORAGE_PATH', 'logs'),\n];. If the PR is ok then we can mark as solved(closed) this issue @rap2hpoutre . @rap2hpoutre Can I do this? This friend forgot this 2 month ago :) . @rap2hpoutre  could be something like this        $storage_path = function_exists('config') ? config('logviewer.storage_path', 'logs') : 'logs';\nand in logviewer.php (config)    'storage_path' => env('LOGVIEWER_STORAGE_PATH', 'logs'),\n`\nI have the code ready i will submit the PR in a few . Should we mark this issue as solved(closed)? @rap2hpoutre. Hello @rajjanorkar and @rap2hpoutre I just finish this, I will create a PR soon \n:). PR opened look like this \n\n\n. Your welcome @rajjanorkar, now @rap2hpoutre have to approve the PR 👍 . @rap2hpoutre  Comments addressed 👍 . This requirement can be closed, PR merged https://github.com/rap2hpoutre/laravel-log-viewer/pull/168. @rap2hpoutre  what do you think about extract all the setters and getters as inherit class? I will love to start this enhancement. . I just send a PR with function getArrayLog reusing the log array creation and setFileAll to make sure $file is set. @rap2hpoutre any comment in the PR? . @rap2hpoutre  all comments were corrected, Thank you! . Fixing now, will be available in few hours,. I just fixed :) submitting the PR in a few! . @rap2hpoutre I test it my self, all is working good. Error fixed in PR https://github.com/rap2hpoutre/laravel-log-viewer/pull/159 @rap2hpoutre  pending for been merge! Thanks. . I will double check now I will let you know if a fix is needed and prevent this error. \nThanks for the report @Nowi5 . @Nowi5 I just update and run and all is working good. \n\n\nPlease can you debug the line 224 as follow\nand post in what line is getting back the error. so I can chheck what part of the line is causing the error\n```$pattern = function_exists('config') ? config('logviewer.pattern', '.log') : '.log';\n        $path = $this->storage_path.'/' . $folder . '/' . $pattern;\n        $files_pattern = $this->pattern->getPattern('files'); \n        $files = glob($path, preg_match($files_pattern, $pattern) ? GLOB_BRACE : 0);\n. It should be enough but to be super sure you can do  php artisan config:cache or/and sudo rm -r ./storage/framework/cache.  :). Sounds perfect! Really good catch! Thanks\nOn Tue, Jul 17, 2018 at 1:40 PM Micheal Mand notifications@github.com\nwrote:\n\nThe only problem with this is what if someone is storing their logs\noutside of the storage directory entirely? The storage_path() helper\ngives you a path like: /home/forge/domain.com/storage.\nI would suggest setting the $this->storage_path to something like this:\n$this->storage_path = function_exists('config') ? config('logviewer.storage_path', 'logs') : storage_path('logs');\nAnd then only use $this->storage_path, not\nstorage_path($this->storage_path) in the code.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/rap2hpoutre/laravel-log-viewer/pull/159#issuecomment-405665991,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ACXI_iSlVPrLbrVZZW7G9MeFppKkNshqks5uHiGVgaJpZM4VTEXu\n.\n. What about create some test cases on unit test?\nOn Tue, Jul 17, 2018 at 2:41 PM ELMINSON DE OLEO edeoleo@gmail.com wrote:\nSounds perfect! Really good catch! Thanks\nOn Tue, Jul 17, 2018 at 1:40 PM Micheal Mand notifications@github.com\nwrote:\n\nThe only problem with this is what if someone is storing their logs\noutside of the storage directory entirely? The storage_path() helper\ngives you a path like: /home/forge/domain.com/storage.\nI would suggest setting the $this->storage_path to something like this:\n$this->storage_path = function_exists('config') ? config('logviewer.storage_path', 'logs') : storage_path('logs');\nAnd then only use $this->storage_path, not\nstorage_path($this->storage_path) in the code.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/rap2hpoutre/laravel-log-viewer/pull/159#issuecomment-405665991,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ACXI_iSlVPrLbrVZZW7G9MeFppKkNshqks5uHiGVgaJpZM4VTEXu\n.\n\n\n. @rap2hpoutre check the code and let me know if need some adjustment! \nThanks . Perfect!  @rap2hpoutre  Teamwork! . Not sure if this is ok (all the commits) please @rap2hpoutre  check this! not sure if i have to do a rebase . @rap2hpoutre  any comments on this?. Thank you for your comments, I will check all and let you know. \n. @rap2hpoutre any time to check this? :) . @rap2hpoutre I understand, I will recreate the PR and separate enhancements. \nProbably will get the PR in the next 2 days. Hi, @Nowi5 sounds really good, let me see if I can come with something! . Hello  @Nowi5, I just post a PR  #161 https://github.com/rap2hpoutre/laravel-log-viewer/pull/161 (@rap2hpoutre  have to review first) that allow multiple log files locations \nnow you can use \nphp\n    'storage_path' => [env('LOGVIEWER_STORAGE_PATH', 'logs'),'storage/app/tenancy/tenants'],\n. @Nowi5 you are right :) I will try to create a PR for the multiple config files settings, do you agree @rap2hpoutre ?. Clean PR Created @Nowi5 @rap2hpoutre  💯 . I suppose he gets this from a low-resolution screen or small screen, can\nyou confirm Lonescu ?\n\nOn Mon, Jul 30, 2018 at 4:45 PM Raphaël Huchet notifications@github.com\nwrote:\n\nThank you for your contribution. AFAIK, there is only a few lines of logs\ndisplayed on each page, so it does not matter if the file is big or small:\nsince there is a paginator, there is no need to scroll more than a bit to\naccess this buttons. Did I missed something?\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/rap2hpoutre/laravel-log-viewer/issues/163#issuecomment-409003922,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ACXI_uUvYFy4yEIyOeGPNv9ccq5ECh1nks5uL3BNgaJpZM4ViFsU\n.\n. @ionesculiviucristian Can you upload a big log file to any services (Dropbox, google drive)?, I just want to test it and see if is possible just load the content by line (ex. from line 100 to 200 paginated by 10) and track the load timing and not load the complete file for a JSON result. . @ionesculiviucristian  not sure why in your case have to wait until the browser renders ALL the entries. \nI imagine you need something like in the image, in my personal opinion I don't care to repeat this delete links in the top. What do you think @rap2hpoutre ? \n\n. Please follow this \nphp artisan key:generate\nphp artisan config:cache\nhttps://github.com/laravel/framework/issues/9080. @idan003 any update with this?\n. Yes @rap2hpoutre, Lumen doesn't have the command, so needs to add an app key to .env,\nto generate one you can use one of these:\ndate | md5\ndate | md5sum\nopenssl rand -base64 24\nphp -r \"echo password_hash(uniqid(), PASSWORD_BCRYPT).\\\"\\n\\\";\"\nYou can close this issue :) \n. Hello, @DrackThor thanks for you for share this. \n\nPlease provide a screenshot, of the login credentials screen. \nyou can post any log, this can help us to figure out what is happening and in what level. \n. Thanks Carey for you report. Can you elaborate what parameter are you\npassing to reset(), line, screenshot ? Please remove any sensitive\ninformation. Thanks.\nOn Wed, Aug 15, 2018 at 3:31 AM Carey Wang notifications@github.com wrote:\n\nI got this error after git pull, my local is fine\nErrorException (E_WARNING)\nreset() expects parameter 1 to be array, null given\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/rap2hpoutre/laravel-log-viewer/issues/166, or mute\nthe thread\nhttps://github.com/notifications/unsubscribe-auth/ACXI_lyZgVDSzWiamrmqz1aqhBkm32EGks5uQ85LgaJpZM4V9rrT\n.\n. The call for reset is on line 70 from file /src/controllers/LogViewerController.php\n$firstLog = reset($data['logs']);\nthis reference to $data['logs']) filled on line 57 \nphp\n        $data = [\n            **'logs' => $this->log_viewer->all(),**\n            'folders' => $this->log_viewer->getFolders(),\n            'current_folder' => $this->log_viewer->getFolderName(),\n            'folder_files' => $folderFiles,\n            'files' => $this->log_viewer->getFiles(true),\n            'current_file' => $this->log_viewer->getFileName(),\n            'standardFormat' => true,\n        ];\nthis mean that $this->log_viewer->all()  is returning null.\n\ncalling all from $this->log_viewer = new LaravelLogViewer(); \nFinally  public function all() from class LaravelLogViewer() is retuning null and not an array, \nyou can check\n1) print out $data and check the content (logs element must be an array even if is empty)\n2) permission on the store folder\n3) check the /var/log errors_log(apache or ngnix) and see if have more details about the error. \nplease post any update on this issue. \n. Canceling this PR\nanother PR created to for just the #143. Welcome back from Happy Vacations! . @rap2hpoutre any change to check this? :) . @rap2hpoutre I hope that you like this PR :) (just joking) \nbest\nElminson. After approving this PR, I will like to show the folder path in the display log name in that way the user can know from where the file is coming. I will create an issue just for tracking the feature with this same comment :). @rap2hpoutre any update on this? any test cases where I can help you?. Hello @rap2hpoutre, I know you are busy :) is not easy when working but any chance to check the PR this week?. I will close this PR and open a new one with clean code. Will have the same code but cleaned! . @rap2hpoutre Please check this first commit for PHPUnit, we can work to put more test cases, in that way we can create new features or fix bugs without breaking what is working.\nI use https://github.com/orchestral/testbench to emulate the laravel/framework without installing. I'm open to change any suggestions \nThanks . @rap2hpoutre thanks for your comments :) I also add tests/laravel.log file to be used for test cases, not sure if we can create dynamic folders (for multi-locations logs files) and delete after the test cases run (in the teardown).\nI'm really happy to see all the improvements that we can do together. \n. Hello, @thureos  I will try to replicate the issue and then try t fix it.. I just test it, clean installation Laravel 5.6 and is not showing \"Connection Reset\"\ncan you please provide more info ( screenshot, log files, any other resources) to see why this is happing . You can Fix the PR and we can discuss about it :) . > Side note: I just have seen this PR #145 which seems to have the same goal as yours... Did you see it? What do you think of the implementation suggested?\nNot sure about this PR, is from June and we already have some changes on master, you can take a look over the code and let me know if you like the #145 more than this, we can talk about. No problem. I will try to fix your comments this week (if you don't do it before hahahha lol ) . Please submit screenshot, log if any, laravel version, php version and modified code to try to identify the issue.. Hey @rap2hpoutre I hope you don't forget about this PR :) . Hey @rap2hpoutre I see you forgot about this PR :) lol\n. Your Welcome @rap2hpoutre! I will keep looking over the issues and request to continue help with this!. This is tracked by issue #171 @rap2hpoutre, the files could have the same name and can be confusing, in this way the user can see the actual path for each file log. . \n\nSome screenshots . I like your suggestion :) . Well, this files pattern(files) can be used in another function in the future, my suggestion is to move it and in this way can be used for future functions.. Yes you are right  :). I miss that one :) good catch! . No, preg_replace if $this->log_data[$index] return empty will work perfect. \nBTW we need the test cases ASAP, maybe we can work  on that this weekend :) . I like your approach :). cool ;)\n. What about this approach\nphp\n$log[] = $this->getArrayLog([\n                    'index' => '',\n                    'current' => [],\n                    'level' => '',\n                    'key' => $key,\n                    'line' => $line\n                ]);\nAnd the function \nphp\n/**\n     * Create array data from log\n     * @param $data\n     * @return array\n     */\n    protected function getArrayLog($data)\n    {\n        $index = $data['index'];\n        $current = $data['current'];\n        $level = $data['level'];\n        $key = $data['key'];\n        $line = $data['line'];\n. :). Fixed :). Fixed :). I will take a look over this :) excellent observation!. Can this be solved by this issue I open https://github.com/rap2hpoutre/laravel-log-viewer/issues/171 but I was waiting on this PR be merge. \n ??\n\"After approving PR #169 I will like to show the folder path in the display log name in that way the user can know from where the file is coming. I will create an issue just for tracking the feature with this same comment :)\" . Codacy recommends \"The method getFolders uses an else expression. Else is never necessary and you can simplify the code to work without else.\"\nI just put it back (Still checking the comment above, I will write some test cases for that) . @rap2hpoutre with $value . '/' . $file the code will verify if the file (with the folder associate) exists (not a random one) $value is equal to the folder. Maybe rename the variable to be more clear. Also I just fix some issue with the view and the content when have multiple location. \n<a href=\"?l={{ \\Illuminate\\Support\\Facades\\Crypt::encrypt($file) }} should be \n<a href=\"?l={{ \\Illuminate\\Support\\Facades\\Crypt::encrypt($folder.\"/\".$file) }}\nI will push the changes and we can discuss after . ",
    "mhousser": "On 0.14.1, now it's this error:\nCall to undefined function Rap2hpoutre\\\\LaravelLogViewer\\\\config_path(). 0.14.2 still gives me the same error:\nCall to undefined function Rap2hpoutre\\\\LaravelLogViewer\\\\config_path(). The only supported ciphers are AES-128-CBC and AES-256-CBC with the correct key lengths. (View: \\/var\\/www\\/server\\/vendor\\/rap2hpoutre\\/laravel-log-viewer\\/src\\/views\\/log.blade.php)\nI'm not sure if this is still a bug or something that we haven't done in our upgrade to the latest Lumen 5.6.*..?. Nevermind. APP_KEY needed to be 32 characters long, and it was not immediately obvious. There is no artisan key:generate in Lumen, so most of the Google search results for this were also useless.\nIt's working now. Laravel/Lumen log viewer is back up and running it looks like. :). ",
    "mikemand": "Hi @rap2hpoutre, I think this is where @mhousser's problem is: https://github.com/rap2hpoutre/laravel-log-viewer/blob/3ee40c9e4bf357de83f96d7b60672e17b3aa5e4a/src/Rap2hpoutre/LaravelLogViewer/LaravelLogViewerServiceProvider.php#L34. Hi @rap2hpoutre, I will attempt a fix shortly. :)\nLumen is great for some things, but it's so stripped down it's hard to support both Laravel and Lumen in the same package sometimes. :(. Not a problem. Thank you for continuing where I left off. :). You should probably follow the (recent) convention of using Crypt::encrypt/Crypt::decrypt instead of base64. As far as I remember, there was a security issue with using base64.. The only problem with this is what if someone is storing their logs outside of the storage directory entirely? The storage_path() helper gives you a path like: /home/forge/domain.com/storage.\nI would suggest setting the $this->storage_path to something like this:\nphp\n$this->storage_path = function_exists('config') ? config('logviewer.storage_path', 'logs') : storage_path('logs');\nAnd then only use $this->storage_path, not storage_path($this->storage_path) in the code.. @elminson I missed a spot! I'm sorry!\nshould be:\ndiff\n- $this->storage_path = function_exists('config') ? config('logviewer.storage_path', 'logs') : storage_path('logs');\n+ $this->storage_path = function_exists('config') ? config('logviewer.storage_path', storage_path('logs')) : storage_path('logs');. Unit tests would be a great idea, that way it can't be broken somewhere down the line.. @rap2hpoutre Yeah, I'm not sure where to even start testing this either. Orchestral's Testbench might help, since they allow you to tap even deeper into mocking/stubbing things in the framework.\nI know that Nicolas Widart uses it to test nWidart/laravel-modules, and there are a lot of filesystem interactions with his modules package.. This should be Request::has('l').\n. Same for here. Request::has('dl')\n. The config helper has an optional second parameter that is used as default if the config key doesn't exist:\nconfig(self::$configFile . '.view.log', 'laravel-log-viewer::log')\n. ",
    "mg-freelancer": "I'm sorry I can't read your comments at pervious days, I will do it now. ",
    "avesgit": "Thanks for you very fast reaction . 1. 5.5 and 5.6\n2. Yes logs?l=bGFyYXZlbC0yMDE4LTAzLTE1LmxvZw==\n3. 5.5 old 5.6 2 days ago\n4.\n0 /var/www/site/vendor/laravel/framework/src/Illuminate/Encryption/Encrypter.php(134): Illuminate\\Encryption\\Encrypter->getJsonPayload(NULL)\n1 /var/www/site/vendor/laravel/framework/src/Illuminate/Support/Facades/Facade.php(221): Illuminate\\Encryption\\Encrypter->decrypt('bGFyYXZlbC0yMDE...')\n2 /var/www/site/vendor/rap2hpoutre/laravel-log-viewer/src/controllers/LogViewerController.php(24): Illuminate\\Support\\Facades\\Facade::__callStatic('decrypt', Array)\n3 [internal function]: Rap2hpoutre\\LaravelLogViewer\\LogViewerController->index()\n4 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Controller.php(54): call_user_func_array(Array, Array)\n5 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/ControllerDispatcher.php(45): Illuminate\\Routing\\Controller->callAction('index', Array)\n6 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Route.php(212): Illuminate\\Routing\\ControllerDispatcher->dispatch(Object(Illuminate\\Routing\\Route), Object(Rap2hpoutre\\LaravelLogVi$\n7 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Route.php(169): Illuminate\\Routing\\Route->runController()\n8 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Router.php(658): Illuminate\\Routing\\Route->run()\n9 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(30): Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n10 /var/www/site/vendor/ultraware/roles/src/Middleware/VerifyRole.php(39): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n11 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): Ultraware\\Roles\\Middleware\\VerifyRole->handle(Object(Illuminate\\Http\\Request), Object(Closure), 'admin')\n12 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n13 /var/www/site/vendor/barryvdh/laravel-cors/src/HandleCors.php(36): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n14 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): Barryvdh\\Cors\\HandleCors->handle(Object(Illuminate\\Http\\Request), Object(Closure))\n15 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n16 /var/www/site/vendor/matthewbdaly/laravel-etag-middleware/src/ETag.php(24): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n17 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): Matthewbdaly\\ETagMiddleware\\ETag->handle(Object(Illuminate\\Http\\Request), Object(Closure))\n18 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n19 /var/www/site/app/Http/Middleware/LangMiddleware.php(26): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n20 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): App\\Http\\Middleware\\LangMiddleware->handle(Object(Illuminate\\Http\\Request), Object(Closure))\n21 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n22 /var/www/site/vendor/laravel/framework/src/Illuminate/View/Middleware/ShareErrorsFromSession.php(49): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n23 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): Illuminate\\View\\Middleware\\ShareErrorsFromSession->handle(Object(Illuminate\\Http\\Request), Object(Closure))\n24 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n25 /var/www/site/vendor/laravel/framework/src/Illuminate/Session/Middleware/StartSession.php(63): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n26 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): Illuminate\\Session\\Middleware\\StartSession->handle(Object(Illuminate\\Http\\Request), Object(Closure))\n27 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n28 /var/www/site/vendor/laravel/framework/src/Illuminate/Cookie/Middleware/AddQueuedCookiesToResponse.php(37): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Re$\n29 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): Illuminate\\Cookie\\Middleware\\AddQueuedCookiesToResponse->handle(Object(Illuminate\\Http\\Request), Object(Closur$\n30 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n31 /var/www/site/vendor/laravel/framework/src/Illuminate/Cookie/Middleware/EncryptCookies.php(59): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n32 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(149): Illuminate\\Cookie\\Middleware\\EncryptCookies->handle(Object(Illuminate\\Http\\Request), Object(Closure))\n33 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Pipeline.php(53): Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}(Object(Illuminate\\Http\\Request))\n34 /var/www/site/vendor/laravel/framework/src/Illuminate/Pipeline/Pipeline.php(102): Illuminate\\Routing\\Pipeline->Illuminate\\Routing\\{closure}(Object(Illuminate\\Http\\Request))\n35 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Router.php(660): Illuminate\\Pipeline\\Pipeline->then(Object(Closure))\n36 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Router.php(635): Illuminate\\Routing\\Router->runRouteWithinStack(Object(Illuminate\\Routing\\Route), Object(Illuminate\\Http\\Request))\n37 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Router.php(601): Illuminate\\Routing\\Router->runRoute(Object(Illuminate\\Http\\Request), Object(Illuminate\\Routing\\Route))\n38 /var/www/site/vendor/laravel/framework/src/Illuminate/Routing/Router.php(590): Illuminate\\Routing\\Router->dispatchToRoute(Object(Illuminate\\Http\\Request))\n39 /var/www/site/vendor/laravel/framework/src/Illuminate/Foundation/Http/Kernel.php(176): Illuminate\\Routing\\Router->dispatch(Object(Illuminate\\Http\\Request))\n. i did that same. i deleted old files new file open thx. need rename/delete file resources/views/vendor/laravel-log-viewer/log.blade.php. ",
    "bayareawebpro": "I'm using it for ajax requests with the Quasar Framework DataTable Component instead of blade.. ",
    "meijdenmedia": "Break on all characters accidently also came in with this PR, will remove that tomorrow. . Hmm I see what you mean, that’s pretty ugly. Will try to find a better solution soon. Do you have any ideas/suggestions?\nI’m using eyewitness to monitor my Laravel applicatio, they created that file. . ",
    "serdarsaygili": "I tried 0.14.3 to 0.11.2 one by one. 0.11.2 worked others did not worked. I was using 0.10.* and when I see the secury issue I tried to update package but it did not worked out.. ",
    "rwattogl": "Confirm I am getting the same issue with Laravel 5.6\n\"laravel/framework\": \"5.6.*\",\n\"rap2hpoutre/laravel-log-viewer\": \"~0.14\",\nI also tested with ~0.11. It was definitely working previously, but some update since (possibly to Laravel?) has broken it.\n(1/1) DecryptExceptionThe payload is invalid.\n--\nin Encrypter.php (line 191)\nat Encrypter->getJsonPayload(null)in Encrypter.php (line 134)\nat Encrypter->decrypt('bGFyYXZlbC0yMDE4LTA0LTI0LmxvZw==')in Facade.php (line 221)\nat Facade::__callStatic('decrypt', array('bGFyYXZlbC0yMDE4LTA0LTI0LmxvZw=='))in LogViewerController.php (line 24)\nat LogViewerController->index(). Sorry, forgot to mention I had already done that (and have tried manually clearing the directories too). We update new versions of the site automatically via ansible and clear all the caches on updating, so any of those are unlikely to be the issue. If you're not able to reproduce the issue yourself, I should have some time to investigate later this week and will report back.. Ah, you're completely correct - I forgot we had a customised view in there, which hasn't been updated in line with the latest version of the code. I replaced the base64 functions with the new style references to  \\Illuminate\\Support\\Facades\\Crypt::encrypt and it all works perfectly again. It could be worth @Cyclops0571 checking in there as well, especially if they've been jumping around versions and had also published that view.. ",
    "eternal365": "@rap2hpoutre +1 for php artisan view:clear. ",
    "ayolana": "Thanks. ",
    "dobrik": "@rap2hpoutre Yes of course, I will fix it in the near future.. Some troubles with using encrypt\\decrypt in lumen framework. I was create new issue in Lumen Framework repository https://github.com/laravel/lumen-framework/issues/781. I waiting for response.. I apologize, as it did not notice that I have different versions of the code. Pull request updated.. ",
    "rajjanorkar": "The list on left hand side is very long in my case 90 log files.\nso it would be great if we can display how much we can fit on page and hide others and add scroll bar to see other entries on scroll.. @elminson  thank you so much thats what exactly i wanted it.. ",
    "larsbo": "Oh yes, thanks a lot for pointing me in the right direction! I forgot that the controller can simply be changed in the routes file 😄 . ",
    "sdeering": "Ok thanks yeah need to further investigate this,. ",
    "fzyzcjy": "PR created: https://github.com/rap2hpoutre/laravel-log-viewer/pull/154. It seems that I cannot fix the \"Codacy Quality Review\" check without changing the previous logic in the code.... @rap2hpoutre Hi! Is there any explanation of why it is closed?. ",
    "sskl": "Awesome, thanks for merging this PR.. Sorry about this changes, i forgot Lumen library support, . ",
    "Nowi5": "\"rap2hpoutre/laravel-log-viewer\": \"^0.19.0\",\nCannot use object of type Rap2hpoutre\\LaravelLogViewer\\Pattern as array\n\n. That is quick. Thank you so much!. Hi guys, maybe I make something wrong?  \n\nUpdating rap2hpoutre/laravel-log-viewer (v0.19.0 => v0.19.1): Downloading (100%)\n\nconfig:\n<?php\nreturn [\n    'pattern' => env('LOGVIEWER_PATTERN', '*.log'),\n    'storage_path' => env('LOGVIEWER_STORAGE_PATH', 'logs'),\n];\n\n\nphp artisan cache:clear\n\n\n==> \n\n. Thanks solved - somehow my config cache file were not deleted. Isn't cache:clear not enough?\n$pattern\n\n\n. Thank you very much. And here is the reason why:\nhttps://laravel-tenancy.com/docs/hyn/5.2/logging\n'storage_path' => [env('LOGVIEWER_STORAGE_PATH', 'logs'), 'storage/app/tenancy/tenants']\nMaybe it is enough to come up with another pattern for the storage_path and searching sub folders automatically.\nIn this case I would create different Controller, one on global level (for platform admin) and local (for tenant admin).\nThanks :-). Wow... that is awesome. Thank you very much! Will have a look soon!. I would guess that the multiple config files setting is a nice side effect ;-). ",
    "ionesculiviucristian": "I cannot use the buttons until the browser renders ALL of the entries and then shows the pagination. When there are many items it takes a while for the results to get \"paginated\".. You can generate a 10k file and see for yourself :D. I don't have any around right now.. The idea was to quickly delete the log from the interface without having to wait for the DOM to fully load in order to have access to the functionality (aka buttons). I'll figure out something eventually. Anyway, thanks for the reply and for this great package :thumbsup:. ",
    "einnar82": "I think, this UX will improve via hacktoberfest? 👍 @rap2hpoutre . ",
    "DrackThor": "Hi @rap2hpoutre @elminson ,\nthanks for your reply. I figured that indeed the lib works perfectly when I use a different uri than '/logs'.\nIt probably clashes with some other installed libs - thanks for your help! :). ",
    "phpapi": "@rap2hpoutre @elminson  All right, I'll try  it, Thanks.. ",
    "acodercat": "0.21.0 hava reset() expects parameter 1 to be array. ",
    "joshuasmall": "Hi,\nIt adds a dropdown allowing you to filter out the log level, I found it useful to view only certain log levels, i.e. errors.\nI modified the DataTable dom option here as it allowed me to render the select on the same line as the entries dropdown and the search box.\n\n. ",
    "zeetabit": "+ why a huge amount of logs not particualy loads?\nHow can I divide ajax load a log file, for example, if file contain 2GB of logs ?. ",
    "raksa": "i understand, should be a toggle button on top right side to expand or collapse. ",
    "tornadofay": "after you publish views\nphp artisan vendor:publish \\\n  --provider=\"Rap2hpoutre\\LaravelLogViewer\\LaravelLogViewerServiceProvider\" \\\n  --tag=views\ngo to resources/views/vendor/laravel-log-viewer/log.blade.php\nChange \n$('.table-container tr').on('click', function () {\n      $('#' + $(this).data('display')).toggle();\n    });\nTo\n$('.table-container button').on('click', function () {\n        $('#' + $(this).data('display')).toggle();\n      });\nnow the small fa-search button will be toggle to expand row.\nAlso you can change \n<button type=\"button\"\n        class=\"float-right expand btn btn-outline-dark btn-sm mb-2 ml-2\" \n        data-display=\"stack{{{$key}}}\">\n        <span class=\"fa fa-search\"></span>\n</button>\nfa fa-search to fa fa-expand or fas fa-expand-arrows-alt if you are using Font Awesome 5+ for better UX.. ",
    "YogSharma": "thanks\nOn Fri, 11 Jan 2019 at 12:47, Raphaël Huchet notifications@github.com\nwrote:\n\nClosed #182 https://github.com/rap2hpoutre/laravel-log-viewer/issues/182\n.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/rap2hpoutre/laravel-log-viewer/issues/182#event-2067783933,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ApY1nIcsD0FHpADZAwU0A8bBRs6RvhfEks5vCDcdgaJpZM4Y__Tk\n.\n. \n",
    "Cherry-Pie": "@laravelcoder \nTry to add DataTable option \"pageLength\": 50, here: https://github.com/rap2hpoutre/laravel-log-viewer/blob/fd0821b073771f3e7256664417055a8bbb091059/src/views/log.blade.php#L198\nDataTables manual reference. ",
    "laravelcoder": "Thank you . ",
    "yevhenlisovenko": "Hi,\nI have the similar issue in Lumen, APP_KEY already there (integrated key:generate command).\nAny ideas how to fix this?\nThanks.\n```\n(2/2) ErrorExceptionUndefined index: key (View: /app/vendor/rap2hpoutre/laravel-log-viewer/src/views/log.blade.php)\nin EncryptionServiceProvider.php line 42\nat CompilerEngine->handleViewException(object(ErrorException), 0)in PhpEngine.php line 45\n(1/2) ErrorExceptionUndefined index: key\nin EncryptionServiceProvider.php line 42\n```. Found a solution. Maybe it will help somebody...\nJust need to add to config/app.php\n```\n    'key' => env('APP_KEY'),\n'cipher' => 'AES-256-CBC',\n\n```. "
}