{
    "jrom": "Should we see 348 commits in this pull request? I guess you only want 5957e45185fa318d9bb22f14f3b621f42191fd86 to be pulled...\n. I'm pulling this feature, but this pull request is an unbelievable mess, so I'm going to close it. Please try to make better pull requests next time!\n. Pulled! Thanks\n. Hey, thanks for the effort! Given that you didn't continue the translation, I'm not pulling it for now. If you're willing to translate Teambox in Swedish, please get in touch with us at http://teambox.com/community before!\nThanks,\nJordi\n. Which is the commit you want us to look at? Just the last one? Can you please document a bit the issue and the fix?\nPlease try to open another pull request detailing this issues and if possible, just the affected commit: http://help.github.com/pull-requests/\n. Pulled, thank you very much Maximilian!\n. This was pulled by @unixcharles earlier today.\n. Pulled! Thank you Marius!\n. Hi there, can you give me a link to the commit you want us to pull? Thanks!\n. Thanks Florian! Applied.\n. Thank you @denisnovikov! I'll add a test for this case, but I know this was needed, just experienced this bug right now (again).\n. Hey Florian, cool! I'll check it later today! Thanks :)\n. Thanks!\n. Hey @mrtorrent, that's awesome. Let me check it and pull it if it makes sense!\n. ",
    "nvier": "Yeah, here is a list of commits:\nhttp://github.com/denisnovikov/teambox/commit/5957e45185fa318d9bb22f14f3b621f42191fd86 -- organizations filters\nhttp://github.com/denisnovikov/teambox/commit/150ef16ebab44c669ee7866fff28e07bc7d0ebf5 -- variable name typo\nhttp://github.com/denisnovikov/teambox/commit/ef0d241c3223aa65765bc2048daa58368fbb9578 -- a little bit of styling for popup calender (not really cross-browser I think)\nhttp://github.com/denisnovikov/teambox/commit/22e86c9553f090402a55b0205073b9446402333b -- few fixes in translations regarding calendar\nAfter these changes merged there will be only one difference -- configurable project slug length, if you need it also hit me back I'll give a proper revision number.\nSorry, didn't manage how to pull request on a single commit, there was no choice given for me or I didn't see it.\n- Denis\n. What's it? o_O\n. It was quite blown within a few commits, I will find a patch later today (hopefully I have it somewhere)\n. It's extending https://github.com/teambox/teambox/commit/014eaa32697615daaadb2921f4b16bdc7059cd34 fix :)\n. And details on this were here: https://teambox.com/projects/teambox/tasks/332866\n. You're welcome. There is another one issue like this described and fixed here: https://github.com/denisnovikov/teambox/commit/820dd90faa6295e8673196adb2d25b2a8b4b41f9\n. And now, why all those comments are here? o.O\n. Closing it.\n. ",
    "saimonmoore": "Forgot to mention, I also added the beginnings of a greek local file (30% as I forked off english). I'll update it often until I get it to 100%\n. Replaced by: http://github.com/teambox/teambox/pull/3\n. Replaces: http://github.com/teambox/teambox/pull/2\nHas additional commit to show task title and also continue/cancel timer once stopped.\n. I've fixed this issue in https://github.com/teambox/teambox/commit/7cfeb9b2fcd51baac36f3e50627aa7242e417620. Test it but you shouldn't have any issues any more. Reopen if you do.\n. Thanks Ian. I'm afraid master is running quite a bit behind our main branch which is now dev. In this branch, we have rewritten the auth controller. You should take a look.\nThanks again for the contribution.\nRegards,\nSaimon\n. Yes. We periodically update master from dev so you should wait for the next release for production apps (unless you feel adventurous ;) )\n. yeah thanks for this @mrtorrent. We kept meaning to look into this but hadn't found the time\n. ",
    "unixcharles": "Hi @anhtuanvan, sorry for being so long. \nThe commit was not pulled because there was no test for it but nobody took the time to tell you! I'm really sorry about that. We're all for un-hardcoding stuff, english word in the code is evil.\nMerged and I wrote a spec for it\n. Hey @flov, sorry for being so long.\nWe could'nt agree on this one because we like rvm but we don't like using rvm in production.\nI added .rvmrc to the .gitignore, so that anyone can deal with it like they want\n. We had to use some SQL trick to do this on teambox.com due to size of our database, but in most case its probably not required.\nI'll write an active record alternative for this one, so that its completely database agnostic, its now on my todos list\n. Thanks, pulled\n. hmm, I should setup postgres and try to run the test on it once in a while :/\nLet me know tomorrow\n. See pull request 18\n. Hi @mmehnert, thanks for contributing.\nWe have a fix for this one in the edge branch (dev), its going to be part of the next release.\nIf you don't want to wait until the next release, I suggest you to cherry-pick the fix.\nMake sure you have the dev branch fetched\ngit fetch\nAnd cherry pick this commit\nThis fix use Arel to generate the query instead of SQL to make it database agnostic.\ngit cherry-pick 7cfeb9b2fcd51baac36f3e50627aa7242e417620\nThis commit take advantage of the latest immortal gem, if you have issue after cherry-picking, you might have to bump the immortal gem to the latest version. I'm not sure its available on the immortal version version of master branch.\n. thanks @denisnovikov for the fix\nI don't know the details of the bug, this need a failing test so it won't happen again. Can you explain me the bug so I can write spec or it or provide us a failing test?\n. I tried to make capybara-webkit working for us in april, but the test where alway failing after a few scenario. The webkit process would eventually die randomly\n. thanks, got that fixed in the dev branch but master hasn't been merge in a long time now. It was especially annoying since it break Heroku rake task for example.\n. Yes, dev is the branch you can see on teambox.com. This is where we do daily development, its a bit confusing\n. Merci Pierre, c'est bien apprécié.\n. Teambox.com et la version community sont pas toujours synchronisé, je vais regarder ça.\n. O_o\n. Ça c'est drôle! :)\n. ",
    "mislav": "Thanks for the nice addition. I've improved it and tested in aea092855acd5a45a8a5dbf8801c32db4e97df50\n. ",
    "MPV": "Sure, no problem. \nAs it turned out, we settled with using Teambox in English during our project period, which now is over. \nUnfortunately Teambox wasn't used as much as we had hoped, a Facebook group took over most of its role.\nBut we certainly enjoyed trying it out, thanks for making a good product!\n. ",
    "sunny": "This pull request should probably be closed now that codaset.com is no more...\n. May I add that this is a live security hole ?\nAnybody can see the list of data exports from other people's account. The \"space150 scrum\" project I'm referring was probably made by @space150 and by poking into other export ids you can get to a lot of exports : https://teambox.com/datas/1045 https://teambox.com/datas/1045 https://teambox.com/datas/1985 https://teambox.com/datas/2009 …\n. Cough.\n. Yearly cough.. ",
    "petrblaho": "Yes, of course.\nI have stopped using codaset a while ago so I did not know that they ended.\nClosing now.\n. ",
    "anhtuanvan": "Sorry for the confusion. Yes, it is only the last commit: 919cdd1a9d4627370b0cb3f7dd33814ccfcf7dc1\nHow do I make a pull request for only one commit?\nThe issue is that the incoming script fails silently. If I reply to a conversation or if I post a new task per mail to the Inbox task list then the mail still remains in the inbox of the teambox mail account. So I run the incoming script manually and add some more detailed exception information (see comment of 919cdd1a9d4627370b0cb3f7dd33814ccfcf7dc1). The exception says that the log method of the Activity class is unknown. Though I suggest that the whole Activity class is unknown to the log_activity method in the Project class.\nBut I don't know if my commit fixed the root of the problem. So maybe you can have a look what is going on, because you are the experts ;)\nThe second issue is that exceptions and errors in incoming.rb are not logged to any log file or maybe I couldn't find it. So it is really hard to see if and why an error occurs.\nThanks in advance.\n. ",
    "jamesu": "\n. ",
    "mmehnert": "oh :-) thanks.\n. Haha. How funny is that. I reinvented my own wheel. \nAt least I did it differently this time. \nThis is the same as pull request 18 :-D\n. ",
    "fortran01": "Looks to be a similar issue in migrate/20110125200118_add_uniqueness_index_to_people.rb\nIn heroku,\nPGError: ERROR:  syntax error at or near \"people\"\nLINE 1:       DELETE people\n                     ^\n:       DELETE people\n      FROM people\n      LEFT OUTER JOIN (\n         SELECT MIN(id) as id, user_id, project_id\n         FROM people\n         GROUP BY user_id, project_id) as KeepRows ON\n         people.id = KeepRows.id\n      WHERE\n         KeepRows.id IS NULL\n. ",
    "scsmith": "Charles I've just looked and this actually undoes the request that fixed postgres. I will check it tomorrow and fix if it does.\n. Yep works for me in postgres and sqlite\n. ",
    "micho": "I want this to be pulled. It's annoying that we require a full page load and another click to unwatch from an email.\n. ",
    "ianmurrays": "Ok. Will do. If I wanted to update my teambox install should I use master or dev? (I assume master =P)\n. ",
    "mrtorrent": "My pleasure, glad I could help.\nOn Sep 20, 2011 10:59 PM, \"Saimon Moore\" \nreply@reply.github.com\nwrote:\n\nyeah thanks for this @mrtorrent. We kept meaning to look into this but\nhadn't found the time\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/teambox/teambox/pull/32#issuecomment-2150370\n. Should I be developing against the dev branch? Is it tracking the\ncurrent teambox.com release?\n\nOn 21/09/11 10:23, Charles Barbier wrote:\n\nthanks, got that fixed in the dev branch but master hasn't been merge in a long time now. It was especially annoying since it break Heroku rake task for example.\n. Several more fixes. I'll apply these to the dev branch in a minute as well\n. Added a fix for output redirection in the receive_email script to prevent bounce messages\n. Added a commit to fix Upload.inherit_privacy, which didn't handle the situation where an upload's comment_id and associated comment exists but is marked as deleted, in which case the association would not load. This would cause the GenerateUploadTokensIfMissing migration to break. Apologies for not including a test case.\n. Hi guys, just wondered if you had a chance to look at this pull request (and the equivalent on master)? It fixes several breakage issues with Whenever/cron jobs, receiving e-mail, rake, and a migration.\n. Rebased on top of recent commits and added a fix for output redirection in the receive_email script to prevent bounce messages\n. \n",
    "pimpin": "Avec plaisir Charles, ce fût ma première pull-request sur Github... et même si elle est modeste je suis heureux d'avoir pu apporter ma contribution à un projet comme Teambox ;-) Il faudrait que je vois comment insérer les lignes qui ne sont pas encore traduites, car au-delà de la correction de la traduction, il y'a pas mal de texte qui n'est pas traduit (du moins dans le version hébergée en saas).\n. Oups, reste encore une correction à porter ici : \"...assignez-les aux membres du projet.\"\n. ",
    "dustalov": "Please, please accept this pull request. It is impossible to use /trimmer/*.js on Heroku without this patch.\n. ",
    "masj": "I have no idea why they haven't pulled this but just struggled a lot with teambox until I found your pull request!\nIf anyone is facing this issue on Heroku:\nErrno::EACCES (Permission denied - /app/public/trimmer)\nPlease use the pull request above to your teambox setup and your trimmer errors will be gone. Could the teambox folks please pull this into the source ?\n. ",
    "nambrot": "+1 please pull\n. ",
    "teamboxdev": "@micho @masylum could you review and merge?\n. "
}