{
    "digggggggggg": "Same problem here.\n. ",
    "kerphi": "Nobody for a patch to correct this issue ?\n. ",
    "Krinkle": "I saw a patch for this at some point but lost it. I'm terrible at regexes but I think the problem is in the isAlphaNum function.\nBelow is what the function looks like in the current master:\nprotected function isAlphaNum($c) {\n    return ord($c) > 126 || $c === '\\\\' || preg_match('/^[\\w\\$]$/', $c) === 1;\n. ",
    "jaydiablo": "I added the mif.tree library (1.2.6.4 as of this writing) as a test case in my fork on js-min-php and it passes against the C version of jsmin.  The output from my fork doesn't exhibit a JS error, possibly an outdated bug?\nhttps://github.com/jaydiablo/jsmin-php\n. I added your snippet as a test case in my fork of this project:  https://github.com/jaydiablo/jsmin-php\nIt passes (which means that the output of the PHP version matches the output of the original C version).\n. In my branch of this project (https://github.com/jaydiablo/jsmin-php) I added modernizr to the test case, and it passes (which means that the minified version of the library matches the JSMin (original C library) minified version).  Give it a shot if you'd like.\n. ",
    "nevstokes": "This problem is documented by Douglas Crockford on JSMin page so I'm unsure if this is actually a valid issue:\nhttp://www.crockford.com/javascript/jsmin.html\n. ",
    "rgrove": "I'll definitely take 546bf3b. Thanks!\nHave you measured the speedup from d9f1909?\nRegarding d9f1909 and a47c82a: my goal with jsmin-php (at least in the main branch) is absolute parity with jsmin.c (even bugs) so that developers can rely on the output from one always matching the output from the other. I may pull these and other original changes into a separate branch though, for the sake of people who want an improved JSMin port.\nThe .gitignore changes are probably best kept in your own global gitignore config, since they don't pertain to this project specifically.\n. Cherry-picked 546bf3b into master and merged the rest into a new \"extras\" branch. Thanks!\n. If you want jsmin.c's license changed, please contact the author of jsmin.c. I'm not interested in being your middle man.\nI should warn you, though, that people have been asking Douglas to change the license for years. I wouldn't expect him to do it now.\nhttp://wonko.com/post/jsmin-isnt-welcome-on-google-code\n. Update URL. [Closed by bb0a2df4cbd32e42f93f0e2abbd9a28a670db733]\n. Have you tried using the latest jsmin.php from git? This sounds like the issue that was fixed by this commit: https://github.com/rgrove/jsmin-php/commit/e71eac35ce7a0f191d199be9e35a8d12f1f999fd\n. No worries.\n. Thanks!\nI handed Minify over to Steve Clay years ago, and pretty much everything that's awesome about it is stuff he's implemented since then. If I remember correctly, the jsmin.php in Minify is a fork of this one that Steve created since I wanted to keep my version a faithful port of jsmin.c rather than adding custom improvements.\n. Please file an issue against Douglas Crockford's canonical JSMin repository here: https://github.com/douglascrockford/JSMin\njsmin.php is meant to be a faithful port of jsmin.c, not a fork with new functionality.\n. jsmin.php itself is a library, not a command line tool, but you could certainly write a command line tool that wraps it and does this. It would just need to prepend any desired comments to the output of JSMin::minify.\nAlternatively, you can do this in your scripts:\n$js = '/* My awesome comment */' . JSMin::minify($js);\n. Please provide an example of some code that causes a failure.\n. That's a PHP string containing the text company's, which is not valid JavaScript by itself. JSMin can't minify invalid JavaScript.\n. Thanks @eriknyk.\n. Thanks!\n. To paraphrase Mr. Crockford: don't do that.\n. Couple of things here:\n1. This is easily the single most-reported \"issue\" with JSMin, but it's not a bug. JSMin was specifically designed not to care about significant whitespace, because relying on significant whitespace in JS is generally a bad idea.\n2. jsmin-php is a direct port of jsmin.c. jsmin.c has this behavior, therefore jsmin-php has this behavior. Reporting it here won't change anything. I recommend not bothering Douglas about this either, since he'll just tell you to use JSLint before using JSMin.\nSucks that this happens in third-party code that you don't control, but I strongly recommend filing an issue against the author of that code. Suggest that they use the unambiguous \"string\" + (++someVariable) or \"string\" + (someVariable += 1) instead.\n. Don't do that. See the advice at http://www.crockford.com/javascript/jsmin.html\n. ",
    "josepsanzcamp": "Hi.\nSorry by the question. With the latest jsmin.php works as expected. I get as reference the version string located found in the header file (1.1.1). I understand that I must compare the entire file to detect an update from your project.\nThanks and sorry for the inconvenience.\nJosep.\n. I don't do that. I trying to minify all libraries used by my project: SaltOS. Libraries are provided by other developers as you and I. I understand that the bug is a real bug. The minify code must accept and rewrite correctly the example as \"var k2=1- --k;\".\n. ",
    "andrerom": "Ok, got it.\nWas some downstream request about adding these things from Steve's fork:\n- Comments containing IE conditional compilation are preserved, as are multi-line\n- comments that begin with \"/*!\" (for documentation purposes). In the latter case\n- newlines are inserted around the comment to enhance readability.\nBut might make sense to switch to that fork then, as they would require either adding it to jsmin.c first or deviate.\n. ",
    "adamjimenez": "JSMin gives a command line option to include comments.\ne.g.\njsmin jslint.js \"(c)2002 Douglas Crockford\"\nCan this be included?\n. ",
    "craigcosmo": "$str = \"company's\";\n$this->jsmin->minify($str);\njust default usage, no config\n. ",
    "cagianx": "same error with the same library (fullcalendar) and also with Modernizr (http://modernizr.com/downloads/modernizr-2.5.3.js)\n. ",
    "eriknyk": "Since @rgrove has abandoned this project I'm created a new repo based on top of @rgrove's port https://github.com/eriknyk/jsmin-php/\nand that issue that you report to leave copyright notices like /! copyright notices.... / is solved on there.\nthanks to @rgrove for start this php port.\nRegards.\n. ",
    "greg0ire": "I solved my problem by using the uncompressed version of the code, which is unambiguous, as you describe. Thanks for the detailed answer. I'm not sure if this should be considered a bug, I think now that what is bad is chaining js compressors. They are probably not meant to be.\n. ",
    "tedivm": "Thanks!\n. "
}