{
    "RomainPiel": "Not sure how the iOS version works but I don't see any other way to do that on android without custom views. So I could add classes for button and edittext if you want.\n. Ok I have an idea to solve that but I'm not sure you'll be able to apply that to titanium as you need at least a paint to apply the effect to. I'll see that next week.\n. Looking good mate. I'm going to leave the focus on the TextView and add a way to apply the effect on arbitrary views. Thanks anyway\n. Added ShimmerButton in version 1.2.0 if you need a custom view. I won't add a more complex way for this purpose.\n. Awesome thanks!\n. Hey\nYes I know the linear gradient thing was going to be an issue at some point. I didn't think of LRU caching, nice one.\nThanks for your comments I'll work on that asap.\n. @eveliotc regarding the LRU cache,\n- Do you have any recommendations? I'm not sure how to use LruCache for a View itself. I guess it should be external and shared between the different views.\n- Isn't it a little overkill for this specific problem? Ideally I'd like to reuse the shader but it seems that it can't be done (the logic is on the NDK side)\n. Actually I have a better idea. I can reproduce this effect with a single shader\n. Yep I just got it working with a single linear gradient and playing with the local matrix. I'm cleaning it up and will submit an update later on.\n. fixed in version 1.1.0\n. Yep it's on my todo list.\n. fixed in version 1.1.0\n. Hmm interesting but I'm not sure I want to set that at the view level. It's a property related to the animation and not to the view itself. Right now the ShimmerTextView has no idea it's animating.\nI was planning to convert my Shimmer.animate() to a builder and add that kind of feature.\nThanks for the PR anyway. I'll see what I can do tomorrow.\n. linking that to #4 \n. fixed in version 1.1.0\n. Yes this is a tricky one. I guess we would ideally want two separate builds on maven central, one with noa api 8+, one without noa api 14+. I'll think about a clean way to organize that with gradle flavors.\n. Nah don't worry it's definitely possible. Example: https://github.com/chrisbanes/ActionBar-PullToRefresh is pushing 3 different artifacts for the same library.\n. Hi, that looks correct. Could you base your PR on branch develop though? It's pretty different from master and it makes more sense in terms of workflow. Thanks\n. Thanks for changing branch.\nI think we can remove what we have in onAttachedToWindow(). Your code will call callback.onSetupAnimation() twice when the view is built.\n. yep. I guess it would make sense you add that to the pull request as it comes with your change. I'll merge after that. cheers!\n. Hmm well I'm not sure I want to go this way, see #6 for more details\n. This is definitely an issue with the way you set up the library. Please refer to the README file and then to Stack Overflow if you need help.\n. Well what do I need to fix? Just add that line to your project's proguard file.\n. Duplicate with #6 \n. I don't think this PR is very consistent. I'll apply the second commit separately.\n. @claust check out https://github.com/RomainPiel/Shimmer-android/commit/c11990869b40d8a0b9cf804bf0a7f78bd3b7daf5 I've just uploaded a new version 1.4.0\n. Hmm I think search.maven.org is not synced. But it's definitely up: https://repo1.maven.org/maven2/com/romainpiel/shimmer/library/\n. sorry for the (long) delay. I've updated and uploaded the library with some other changes. Thanks!\n. Looks good, thanks\n. like any other libraries, use xmlns:app=\"http://schemas.android.com/apk/res-auto\"\n. that error should have been solved in version 1.3.0 Please use version 1.4.0 and it should fix it. I noticed I didn't update the README with that info.\n. or just update the lib to 1.4.0\n. Sorry guys I don't have much time to spend on shimmer at the moment. I'll\ntry to spend some time this weekend but I can't promise anything.\nOn 1 Sep 2015 4:42 pm, \"James Wahome\" notifications@github.com wrote:\n\nEasiest way to solve this is by adding tools:replace=\"android:icon\" in the\napplication tag of your manifest\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/RomainPiel/Shimmer-android/issues/23#issuecomment-136765135\n.\n. I don't have much time to spend on Shimmer anymore and it's not a very complex library. Feel free to fork or copy the classes you need into your project.\n. I'm sorry about that, I don't have time to maintain shimmer anymore so feel\nfree to play with it. You'll see the code is not really complicated\nOn 17 Nov 2015 5:09 a.m., \"vhenriques\" notifications@github.com wrote:\nThe shimmer animation doesnt work on android 5.1+\nive tested on my moto g running 5.1 and nexus 5 running 6,\nit runs properly on ym samsung kitkat device\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/RomainPiel/Shimmer-android/issues/24.\n. \n",
    "yuchi": "In iOS I can put inner views in the Shimmer view and they will be shimmed too. If you provided a simple View I could put whatever I want inside it and make them shimmed.\nHint: I’m not developing on Android, but on Titanium SDK, which has its own Button/TextView etc.\n. Actually I made it work. https://github.com/yuchi/TiShimmer/blob/master/Android/src/it/ti/shimmer/ShimmerView.java#L199 As you can see it is also possible to actually shim the view without using an overlay.\n. The only problem I’m facing is that it shims away the whole canvas, also the underlaying (parent) views…\n. Don’t worry, already solved this re-inventing the wheel :) That’s a shame that Android does not have a separate concept for views-hierarchy and rendering-tree, on iOS it’s way easier.\n. ",
    "eveliotc": "@RomainPiel yeah they are immutable; as I remember you can't translate/zoom the canvas as they are anchored to the window but they do have a local Matrix you could try modifying it (resize and translate)\nPretty sure someone will go crazy and use it in an AdapterView then complain about jank\n. :+1:\n. ",
    "mattlogan": "Just submitted a pull request for this feature.\n. It makes sense that it's a property of the animation, not the view.  In MainActivity you would then have something like Shimmer.animate().rightToLeft(), or Shimmer.animate().direction(\"rtl\").\nI just thought it would be easy for the user to define the shimmer direction in the same place they set the text and color (in the xml), but your explanation makes more sense from a design standpoint.\n. ",
    "yhpark": "I just looked through android gradle document and found this:\n\nImportant: When enabling publishing of non default, the Maven publishing plugin will publish these additional variants as extra packages (with classifier). This means that this is not really compatible with publishing to a maven repository. You should either publish a single variant to a repository OR enable all config publishing for inter-project dependencies.\nhttp://tools.android.com/tech-docs/new-build-system/user-guide#TOC-Library-Publication\n\nSo I guess it is not possible right now :(\n. ",
    "Keanu": "Sorry it's my fault, I will send a new PR based on branch develop. Thanks.\n. Hi, I think the onAttachedToWindow() could be removed.\nWhatever the view is GONE or INVISIBLE, it will finally go through onSizeChanged() when the view is \"ready\" with VISIBLE, so we can just call callback in onSizeChanged().\n. Hi, just updated changes for this pull request, please check that, thanks.\n. ",
    "amenon": "Yeah I agree it would be nice to have two separate packages on maven central. I'll close this one.\n. ",
    "Jaymo": "Were you able to find a solution for this?\n. Easiest way to solve this is by adding  tools:replace=\"android:icon\" in the application tag of your manifest \n. ",
    "stormzhang": "Also remove application attributes, or Manifest merger failed\n. ",
    "claust": "If you have the time, please consider pulling this change, @RomainPiel. I can't seem to avoid the manifest merger error.\n. Looks excellent! Thanks! Not available on the Maven repository yet, though?\n. Yep, it's available and working now. Thanks again!\n. As ff0o0 pointed out, this issue seems to remain in the 1.4.0 available from the mvn repo.\n@RomainPiel Any chance the repo has not been updated properly? The date says Jan 12th 2015: http://mvnrepository.com/artifact/com.romainpiel.shimmer/library/1.4.0\n. ",
    "thedumbtechguy": "But the library doesn't have a launcher Icon. \n. I don't know if this will work, but it should. \nCreate hdpi mdpi xhdpi and xxhdpi versions of your icon.  Or simply copy the original into these dirs. It should override the lib. \n. ",
    "ff0o0": "@frostymarvelous yes, i have different size icon.\n@RomainPiel  updated, it not work. Does the library have the dir named 'drawable-hdpi-v4' ?\n\n. i have solved by adding dir named 'drawable-xxhdpi'.\n. ",
    "fimh": "Yes, claust was right. I also encountered the same problem in 1.4.0.\n. ",
    "vnh1991": "@Jaymo \ntools:replace=\"android:icon\"\ndidnt work\n. ",
    "casperbang": "I also ran into this issue, the ic_launcher was removed from the repository itself but a 1.5 Maven release would be beneficial. \n. ",
    "xcqwan": "gradle 1.2.3\n. ",
    "JamieFarrelly": "Got the exact same issue, due to a duplicate file (ic_launcher.png). Came across someone that had the same problem on StackOverflow too: http://stackoverflow.com/a/30071864\n. ",
    "DenisShov": "The same problem with a duplicate file (ic_launcher.png)\nPlease delete c_launcher.png from repository project 'com.romainpiel.shimmer:library:1.4.0@aar'\n. ",
    "aviadmini": "I used shimmerTextView.setTypeface(...)\n. ",
    "lawloretienne": "Here is what the leak looks like :\nhttps://gist.github.com/lawloretienne/66ed381b89d543bff6ede5016a0d0ce0\n. ",
    "RockyLin": "Same problem here! . ",
    "nieldeokar": "Shimmer shimmer = new Shimmer();\n... \nshimmer.start(tvShimmerText);\n...\nCancel shimmer in onDestroy() might help you. \n@Override\n    protected void onDestroy() {\n        super.onDestroy();\n        if (shimmer!=null) {\n            shimmer.cancel();\n            shimmer = null;\n            tvShimmerText = null;\n        }\n    }. "
}