{
    "schneiderandre": "Thanks for this improvement, Eric!\nUnfortunately, there is a shortcoming if you drag the image while it is scaled up. You have to touch the image 2 times to scale it up again, because scaledUp only gets updated in touchUpInside:, which isn't called if you pan the view.\nThis can easily be solved if we implement it as follows:\nobjc\n    if (self.isScaledUp) {\n        [self scaleDownView:sender];\n        return;\n    }\n    [self scaleUpView:sender];\nand set the proper scaledUp value in scaleDownView: and scaleUpView:.\nDoes this look good to you?\n. Another solution can be to simply pause the animation in touchDown:.\n. The last two animations should serve as examples for the downside of pop. Pop isn't able to animate complete new Constraints, only the constant of a Constraint. constant is the only readwrite property declared in NSLayoutConstraint and therefore animatable with pop.\n. Facebook pop needs at least the deployment target 6.0. This example project uses some features only available with 7.0 – Thus, it is not possible to make the whole project run under iOS 6.\n. I think your question is not related to this project.\nPlease look at the iOS developer library or google for your specific question.\n. My first guess would be that you opened the Popping.xcodeproj instead of Popping.xcworkspace.\n. 👍\n. Hey thanks for your pull request and sorry for my late response. I updated the project to the newest pop version 1.0.7 in e59ec266fb516e9023b4f65dd4171c52c849db6d.\n. Thanks for your pull request. I updated the pop library to version 1.0.7 with CocoaPods 0.34.4 and included the changes in commit e59ec266fb516e9023b4f65dd4171c52c849db6d.\n. Thanks. The spec addition is already included in the pod update in commit e59ec266fb516e9023b4f65dd4171c52c849db6d.\n. Hey, the project in now up to date with pop version 1.0.7. See e59ec266fb516e9023b4f65dd4171c52c849db6d.\n. You will find a mail with some thoughts in your inbox :).\n. I'm sorry, but I will not add new animations to this project, since I'm currently more focused on Swift.\nBut maybe this will help you: https://github.com/fastred/HamburgerButton\n. This project is not a library. It is intended to show the possibilities offered by pop.\n. Hey @wangmchn thanks for you kind words and reporting this issue with a pull request included! :+1:\nI created and referenced another pull request, tell me what do you think and if it works for you. It saves a few lines of code and avoids the use of another instance variable.\nThanks :smile:\n. Great! Thanks again! :+1: \n. Hey @jhowardjr, thanks for your interest :smile:. I didn't release this one as an own framework, but maybe I'll revisit it sometime, rewrite it in Swift and polish the API. But to be honest, I can`t promise anything.\nHave a great day! André\n. ",
    "denadai2": "And is there a way to present the uiviewcontroller in a popup without transtions etc (only avaiable in iOS7)?\n. ",
    "RyanLii": "got it.I would say it's awesome .Thanks for sharing bro~\n. ",
    "rivera-ernesto": "Probably you didn't open the Popping.xcworkspace file but the Popping.xcodeproj (which contains no Pods project reference).\n. Sure. Still happens to me from time to time ;)\n. ",
    "dcbenji": "Doh! Thanks, sorry for the silly mistake\n. ",
    "Perjan": "Thanks to you for providing these awesome examples :).\n. ",
    "warpling": "Awesome! :+1: \n. ",
    "wangmchn": "It's cool! Thanks~ 😃\n. "
}