{
    "shu223": "Added version tags and the podspec! Thanks!\n. Yes!\nhttps://github.com/CocoaPods/Specs/tree/master/PulsingHalo\n. Please try to use animationDuration, pulseInterval, thanks!!\n. SVPulsingAnnotationView may be useful as a reference.\n. Sorry I haven't tried yet, however it supports dynamic framework for now: https://github.com/shu223/PulsingHalo/releases/tag/0.1.1\n. Please try the new release 0.0.6. It supports dynamic changing for animationDuration.\n. Thanks, it's so cool update!!!!\n. Please try the new release 0.0.6.\n. Thanks, it has been already fixed.\n. I created updated version named \"Pulsator\" which is written in Swift.\nhttps://github.com/shu223/Pulsator\nThis problem has been fixed at the repo. Usage is almost same.\n. I've merged, thanks!\n. Please try the new release 0.0.6.\n. Thank you so much! :+1: \n. I created updated version named \"Pulsator\" which is written in Swift.\nThis problem has been fixed at the repo. Usage is almost same.\n. Please try the new release 0.0.6.\n. Thanks!!!!\n. @acegreen Yes, already updated. Is there something wrong?\n. Thanks, however it seem not to be completed. For example, PulsingHalo.h doesn't import PulsingHaloLayer.h.\nI created new commit to support Carthage: https://github.com/shu223/PulsingHalo/commit/807f317776969bae7c78c1f57d0326169746c748\nAnyway, much appreciated for your pull request :)\n. Hi, I updated the README.\n. I'm sorry, it's updated now.\n. Thanks for your pull request! It has been merged!\n. Thanks!\n. Please use Pulsator which is the new version of this PulsingHalo written with Swift. It has stop method.\n. I created updated version named \"Pulsator\" which is written in Swift.\nhttps://github.com/shu223/Pulsator\nThis problem has been fixed at the repo. Usage is almost same.\n. I'm sorry for late, supported resuming on 0.2.4, thanks!. @bhushanb02 thank you so much for this PR. I supported resuming in the PulsingHaloLayer class now. thanks again!. @sandman4sure thanks, i didn't know that problem. I just updated the podspec, could you try this?. Fixed now, I'm so sorry for my late support.\nhttps://github.com/shu223/PulsingHalo/commit/255eacebdf7b4ba2314429649ae076aa104a07cb\nThe ios.deployment_target didn't work with the wrong order in the podspec.\nPlease try the  0.2.8 and let me know if there is still problems.. Fixed now, I'm so sorry for my late support.\nhttps://github.com/shu223/PulsingHalo/commit/255eacebdf7b4ba2314429649ae076aa104a07cb\nThe ios.deployment_target didn't work with the wrong order in the podspec.\nPlease try the  0.2.8 and let me know if there is still problems.. I could find the actual cause in the podspec thanks to this PR.\nhttps://github.com/shu223/PulsingHalo/commit/255eacebdf7b4ba2314429649ae076aa104a07cb\nThe ios.deployment_target didn't work with the wrong order in the podspec.. @nikhilolx I don't think this library uses \"GraphicsServices.framework\". I have used this library in some apps and have never be rejected for this library. Could you let me know the whole sentence from Apple (without any private/confidential info)?. ",
    "zdennis": "Awesome @shu223 ! I was just about to fork and do this! \n. @shu223 , have you pushed to cocoapods yet?\n. ",
    "dhmspector": "Awesomeness -  Thanks!\n. ",
    "simplelife-patrick": "Sorry, now I found the attribute \"speed\". Thanks, it's a wonderful lib.\n. ",
    "hezhk3": "\nHalo layer will move to front when press a UIButton。In codes I insert halo layer below to a UIButton (with a image), when I pressed on the button the halo layer will display above the button.\n\nUIButton.showsTouchWhenHighlighted show a simple feedback (currently a glow) while highlighted. Just put several single pulse halo together and let them have different timeOffset(phase) and color.. ",
    "ghost": "I have the same thought. Should be fairly simple to do but don't want to mess with your code unless necessary. \nGreat work!\n. ",
    "shannonchou": "Hello Michael, \nCurrently \"animationDuration\" of \"PulsingHaloLayer\" can not be changed when it's running, except \"radius\" and \"backgroundColor\".\n. ",
    "osagie": "I had what I assume is the same issue, something is probably off with the Podspec, it's pulling version 0.0.1 instead of the current version (right now) 0.0.4, switch the line where you have it in your Podfile to this:\npod 'PulsingHalo', :git => 'https://github.com/shu223/PulsingHalo.git'\nWorked for me...\n. ",
    "goelv": "Thanks! This helped me. \n. hey @shu223 would you be correcting this issue any time soon?\nThanks,\nVarun\n. @Unmute thanks a lot for your suggestion. I experienced the exact same issue as you and your suggestion about has helped me fix it.\n. ",
    "newton0214": "Thanks! This helped me too.\n. ",
    "unmutedev": "For us we see it going away even when you present a view controller over a view controller that has a pulsing halo.  Would love an explanation on this!\n. In the latest version there was an addition starting on line 105 in PulsionHaloLayer.m of the CAAnimationGroup delegate method.  This method seems to be called when pushing a view controller or presenting one which in turn removes the animation.  I added the if (flag) then remove the animations as that signals the animation is truly done.  I am unsure if this is correct but for now until I revisit the code it will have to do.  Below is my code for that method which would not remove the animation when a view controller is pushed or presented.\n- (void)animationDidStop:(CAAnimation *)anim finished:(BOOL)flag {\n  if (flag)\n  {\n      [self removeAllAnimations];\n      [self removeFromSuperlayer];\n  }\n  }\n. ",
    "ddewaele": "@Unmute I have a simple app where a new viewcontroller is pushed onto the stack via a navigation controller, and the pulsing halo (placed on the first viewcontroller) was also shown on the second viewcontroller. I thought this was normal behaviour.\nI had to remove it by executing the following code :\n[self.halo removeAllAnimations];\n[self.halo removeFromSuperlayer];\n. ",
    "genaks": "Does not work for me\n. same here\n. ",
    "markrickert": ":+1: \n. ",
    "JustinDMoore": "for (CALayer *layer in self.view.layer.sublayers) {\n            if ([layer isKindOfClass:[PulsingHaloLayer class]]) {\n                [layer removeFromSuperlayer];\n            }\n        }\nThis removes all layers that are of type PulsingHaloLayer.\n. ",
    "vishw3": "thanks will try this ......\n. ",
    "hdmchl": "Line 10 is fine. It looks like the central CocoaPods spec is a little old and needs to be updated (https://github.com/CocoaPods/Specs/blob/master/Specs/PulsingHalo).\n@shu223: Please see this guide for updating: https://guides.cocoapods.org/making/specs-and-specs-repo.html#how-do-i-update-an-existing-pod\nIn the mean time, we can use this in our Podfile: \npod 'PulsingHalo', :git => 'https://github.com/shu223/PulsingHalo.git', :tag => '0.0.5'\nEDIT: I dropped the :tag to actually get the latest version. 0.0.5 seems to be tagged to version 0.0.4\nSimilar to: https://github.com/shu223/PulsingHalo/issues/12\n. @simonbromberg @samjarman it works for me. I definitely had a similar issue (non-animating solid circle), but I can't quite remember what it was that fixed it. Have a good look at the example and make sure that's working for you.\nEDIT: I remembered. I was using:\nobj-c\n[_multiHalo setBackgroundColor:[[UIColor blackColor] CGColor]];\nWhen I should have been using:\nobj-c\n[_multiHalo setHaloLayerColor:[[UIColor blackColor] CGColor]];\n. ",
    "simonbromberg": "Does the MultiplePulsingHalo work for you? It just comes up as a solid, non animating circle for me\n. ",
    "samjarman": "@simonbromberg nah it didnt work for me\n. ",
    "revolter": "@shu223 Doesn't this mean that the color section from the documentation in the README is incorrect?\n. No problem :smiley: \n. I know this is not maintained anymore, but it would be awesome if it would be left in a working state.. ",
    "unseenmachines": "Same here, using iOS 8.4. PulsingHaloLayer works fine. I noticed that buildSublayers prints out \"sub count:0\"\n. ",
    "AndrewSB": "Same here\n. ",
    "legendstar177": "same here, i realized that when I put window or navigation.view addSublayer multiHalo just show a single one, but when i add it through view, it worked fine. But what I want is adding it into window :( . Help me\n. ",
    "andrey-lisovskiy": "Same problem, MultiHalo isn't working\n. ",
    "acegreen": "Are you guys going to update the master with this?\n. No its fine. Was not updated when I posted this (I think)\n. ```\n            var activityIndicator: PulsingHaloLayer!\n        self.activityIndicator = PulsingHaloLayer(layerNumber: 3)\n        self.activityIndicator.position = getCenterOfView(self.view)\n        self.activityIndicator.radius = self.view.bounds.height / 2\n        self.activityIndicator.backgroundColor = UIColor.grayColor().CGColor\n        self.activityIndicator.useTimingFunction = false\n        self.view.layer.addSublayer(self.activityIndicator)\n\n```\n. ",
    "harryworld": "+1\n. I am sending pull request here https://github.com/shu223/PulsingHalo/pull/35\n. ",
    "mouse-lin": "I think stop func is not exist.\nI remove PulsingHaloLayer when want it to stop and add it to super layer when want it to start\n. @shu223 ok, thx\n. ",
    "baallalAbderrahim": "i'm having the same issue , could you help please ?\nthanks\n. ",
    "sandman4sure": "When downloading the source for 0.25, the updated podspec file is not included.. @shu223 can you make a new branch with the podfile changes added? Latest branch you made didn't include your last change.. ",
    "TianDaGe": "@property (nonatomic, weak) CALayer prevSuperlayer;\nI fixed as like this\n@property (nonatomic, strong) CALayer prevSuperlayer;. ",
    "CavalcanteLeo": "@TianDaGe submit a pull request, that fixed... . ",
    "faimin": "stackoverflow had a solution: http://stackoverflow.com/questions/37160688/set-deployment-target-for-cocoapodss-pod , it works for me.\ncocoaPods\npost_install do |installer|\n    installer.pods_project.targets.each do |target|\n        target.build_configurations.each do |config|\n            if target.name == 'PulsingHalo'\n                config.build_settings['IPHONEOS_DEPLOYMENT_TARGET'] = '8.0'\n            end\n        end\n    end\nend\n. ",
    "lappp9": "@TianDaGe If you make that property strong you'll at least have a retain cycle until you remove the halo view from its superView. ",
    "mkdk": "actually, it works only with initial view :(. "
}