{
    "soffes": "Converting to something like EGO's gradient view using the CALayer instead of CG might be better.\n. Since it has been reimplemented, this is no longer an issue.\n. Raise an exception if the collection view data source doesn't return an item like UITableView does. Closed by 2a6faca7400fc9243ee5b8c7394b47c3828b4d32\n. Updated SSLabel defaults and fixed SSCollectionView demo. Closed by 95079fbf31cb59415d2280ea42b7495e56344295\n. That would be sweet. I was thinking it would probably be best and re-implement it. The only thing that sucks is that you would have to tell it which view to add itself to. Maybe there is some UIWindow hackery that we can do (which is how UIAlertView works).\n. Ture, but how would you guarantee that it says on top?\n. Awesome! Totally didn't realize that UIView had a window method.\n. Finished!\n. It would also be great if it handled being drawn vertically as well.\n. Added shadowOffset to SSLoadingView. Closed by 4baf0153b927d7eaab12047f5f1894a6599f3f40\n. Turns out I'm dumb and this was already there.\n. Re-layout when properties change. Closed by 499831d59f47b5a398cac3ab0d8f922c451d225d\n. There are a lot of parameters in drawing a radial gradient. That should be another class.\n. This has been implemented.\n. You should probably be using one of the following:\n``` objective-c\n/**\n @brief Sets the selected state of the item, optionally animating the transition between states.\n@param selected YES to set the item as selected, NO to set it as unselected.\n The default is NO.\n@param animated YES to animate the transition between selected states, NO to\n make the transition immediate.\nThe selection affects the appearance of labels, image, and background. When the the selected state\n of a cell to YES, it draws the background for selected items with its title in its\n highlightedTextColor.\n */\n- (void)setSelected:(BOOL)selected animated:(BOOL)animated;\n/**\n @brief Sets the highlighted state of the item, optionally animating the transition between states.\n@param highlighted YES to set the item as highlighted, NO to set it as\n unhighlighted. The default is NO.\n@param animated YES to animate the transition between highlighted states, NO\n to make the transition immediate.\nHighlights or unhighlights the item, animating the transition between regular and highlighted state if\n animated is YES. Highlighting affects the appearance of the items's labels, image, and\n background.\nNote that for highlighting to work properly, you must fetch the item's label (or labels) using the\n textLabel (and detailTextLabel) properties and set the label's highlightedTextColor property; for\n images, get the items's image using the imageView property and set the UIImageView object's\n highlightedImage property.\nA custom table item may override this method to make any transitory appearance changes.\n */\n- (void)setHighlighted:(BOOL)highlighted animated:(BOOL)animated;\n``\n. Closing this issue. If it's still an issue, please reopen.\n. Fixed in 676d7697731adc2814a73b636de0470f40b91329\n. SSViewController has been removed. The only reason this class existed was to provide a convenient subclass to match UITableViewController.\n. SSViewController has been removed.\n. Won't fix since you can do this with system stuff in iOS 5.\n. After further investigation, it appears that Doxyclean isn't carrying these across. I've been meaning to make my own. Probably my next project after I finish documenting the rest of SSToolkit.\n. All protocols have been documented! (except forSSModalViewController, which is deprecated)\n. Added in 26b6544c522a3a137bca8517c7010d71b409e4ce\n. Good catch. Fixed in abea88a2f3d6c417ea73c721f1aac6967bd2f667\n. This class has been removed from SSToolkit.\n. Turns out that this is so trivial, it's not even worth making. Yay?\n. This has been implemented. Forgot to close the issue.\n. Thanks!\n. Just noticed, ON appears to be shifted to the right.\n. Looks great! Merged!\n. Exactly. You can see a bit of blue or orange on the top right and bottom right corners. I was thinking that the on background should resize like the off background. It could just go to the middle of the handle instead of always to the right edge.\n. Oh, you're right. All four corners. Wanna tackle it? :)\n. @monoceroi thanks for the effort, but I'd like to avoid usingCALayerto do the clipping since that will have a big performance hit if the switch was in aUIScrollView.\n. I doubt many people would use it on its own. It's mainly for a cell accessory. I figured SSCatalog would just haveSSBadgeTableViewCell.\n. I cloned the one from Mail.app for the most part. They use images, but I useddrawRect:` so I could draw faster. Also drew the text instead of using a label for the same reason.\n. No worries man. Love it!\n. Leaving this issue open since the views still need documentation.\n. Thanks for documenting this!\n. Also, a demo in SSCatalog would be good.\n. Documented SSBadgeTableViewCell. Closed by 4d0fd296955893f6e94e1c33a33fef46a90d1c3d.\nFixed bug in SSCollectionViewItem.\n. That's the desired result. If you need to import both headers or:\n```\nimport \n```\nOnly including the minimum number of headers in header files and using @class when possible makes for faster compile times.\nGlad you got it figured out though :)\n. Good call. I was on the fence about adding that feature. I'll add it.\n. Haha just saw it. It totally looks like a chili :)\n. Automatically hide SSBadgeView if its text property is nil or empty. Closed by 9910ce548992170e403cf01bbb183200cab63a69\n. Thanks for you work, but I won't be merging this in. Promoting yourself a ton and asking for money in my framework isn't cool. Also, your DeviceHelper library already exists. If people need that functionality, the should just use your library.\n. I fixed the insetColor leak in 1ef2b7bacf4772d36ccbd69b1f18d1820f84ef92.\nInteresting about the colorWithWhite:alpha: leak. I'll have to check that out.\n. This has been implemented.\n. Documented new SSCollectionView methods. Closed by a68c5caeac6feac32f3bfeeecbd538fe0b0ae1ea.\nUpdated documentation style\n. Can you explain what you're doing where it makes sense to have a nil delegate? If you don't provide a delegate, the collection view can't draw anything since it doesn't know what size to draw things.\nI admit, this might not be the best design, but for now it will do.\n. Closing and going with your other solution. Thanks so much for you work!\n. Added to the SSToolkit website.\n. Looks great! Thanks so much. I'll merge it in shortly.\n. @stevebrewer there are timezones that aren't an hour off and this method doesn't make the test pass.\n. Got it. This is not an Apple thing by the way. If you look at the current code, its just using a function from time.h.\n. Thanks @Jilouc! I'm getting an error though. Any ideas?\nSSToolkit/NSDate+SSToolkitAdditions.m:28:9: error: implicit declaration of function 'strptime_l' is invalid in C99 [-Wimplicit-function-declaration,3]\n     if (strptime_l(newStr, \"%FT%T%z\", &tm, NULL) == NULL) {\n         ^\nSSToolkit/NSDate+SSToolkitAdditions.m:28:50:{28:9-28:49}{28:53-28:57}: warning: comparison between pointer and integer ('int' and 'void *') [3]\n     if (strptime_l(newStr, \"%FT%T%z\", &tm, NULL) == NULL) {\n         ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ ^  ~~~~\n1 warning and 1 error generated.\n. @Jilouc Awesome. Got it compiling, but the tests are failing. Any chance you could figure that out? There are 2 tests for this. The one that was failing is commented out. It would be amazing if both of them passed.\nThanks again for your help!\n. EPIC! Thanks so much @Jilouc!!! If you want to email me your address, I will send you a box of cookies as promised :)\n. @Jilouc by the way, using MIN was giving me a \"use of GNU statement expression extension\" warning. I just changed to fmin instead and it went away. I know that it doesn't need to be fmin since they are size_ts. Do you have a better solution?\n. Good call. I'm no C programmer. Stupid question: do you not have to free stuff that you do with strncpy?\n. That's what I was guessing. Thanks for the clarification!\n. There's a tests folder. Put it in the strings test file. Pull the latest if you don't see them.\n. I recently added tests in master and not stable. Not that the default branch is stable and not master. That way people don't pull stuff in progress.\n. You'll be listed here https://github.com/samsoffes/sstoolkit/contributors once it refreshes.\n. Ya, I've wanted to do this from the beginning. It's pretty difficult and there is also some complexities that Springboard doesn't have with scrolling and such.\nFor example, if you have a grid of 100 things with 3 on a row and want to move the last one to the first position. That would be pretty difficult to make it not feel cumbersome.\nAnyway, I definitely want to do this, but probably won't get to it any time soon. Feel free to fork and implement it though :)\n. Definitely want to do this. I'll add this to the top of my list.\n. Oh awesome, I hadn't thought of the centered uncomplete row (To Governor Becomes Law). I'd definitely want to add this soonish.\n. I'm going to have time to work on this anytime soon. Feel free to fork and implement :)\n. Definitely. I hate IB so much. Did you see how ugly that commit made things? sigh\n. This has been fixed. Forgot to close the issue.\n. I fixed this recently. Are you sure you're using the latest?\n. It was fixed on the 14th. Please pull the latest and try again.\n. I've experienced this as well. It's an issue with the internal cache that gets cleared by the system when the application goes into the background. I'm working on fixing this today.\nThanks for reporting!\n. Fixed in c4982ee583084ef1ada6485e82533f635912af53\n. There isn't. There is already an issue for documenting this.\n. Try using a different style. Some styles don't implement those views.\n. I'll investigate.\n. I'll work on implementing these soon. You're right, they totally don't do anything :)\n. Known issue. Fixing once it GMs since it has been broken different in each beta.\n. Sweet. I'll probably switch to that for my demo.\n. This has been fixed in b36fa467d3049b94e441d8ed2df3b63541b1c310.\n. Good call. Thanks Evan!\n. Thanks for your work fixing this! I'd prefer to add this functionality in the class itself instead of inheriting from UIControl since a badge is not actually a control. I do something similar in SSCollectionViewItem.\nI can add this, or if you want to and send me a pull request, I'd gladly merge. Thanks again.\n. Thanks so much :)\n. Ha. Easy enough :) Thanks again!\n. Good catch!\n. I was unable to reproduce this.\nIn a541bc731b1cda09e493fcd772de8b7d1f34deb1 I made some minor tweaks SCImageCollectionViewItem that I think will solve your problem. My guess is that some of the images aren't loading or haven't loaded yet and are reusing previously loaded ones. That commit will solve this.\nIf you are still experiencing after trying my new changes, please open a new issue and post a sample project that demonstrates this bug.\nThanks!\n. Are you using the latest version? I believe I recently fixed this.\n. Looks good. Do you want to go ahead and add those methods? Until I finish my everything I have planned for 1.0, I'm not too concerned about breaking stuff :)\nAlso, don't forget to run the tests :)\n. Bump.\nAny interest in finishing this up @johnezang?\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. If you noticed, the graph doesn't go down when you enter or leave any view controller. I'm not really sure why that is... I'll investigate further.\n. I ended moving SSCatalog to its own repo. Thanks so much for this though. I think keeping it in its own repo is a lot cleaner.\n. Ha. This is cool. Not going to merge since there are so many changes and since Xcode will start adding it back anyway. Definitely very cool. Thanks WhitespaceBot :)\n. I tried adding two SSTextViews to a view controller's view and could not reproduce this. Can you provide some sample code so I can debug this a bit?\n. This is an issue with UIViewController and (to my knowledge) is unrelated to SSCollectionView.\n. Thanks!\n. Interesting. I'm sorry you're having trouble with it. I am using this functionality in a few of my apps and it's working fine. I wonder if it's something Core Data related specific to your situation. Here's the code I use in my delegate:\n``` objective-c\n- (void)controllerWillChangeContent:(NSFetchedResultsController *)controller {\n    [self.collectionView beginUpdates];\n}\n\n\n(void)controller:(NSFetchedResultsController *)controller didChangeSection:(id )sectionInfo\n           atIndex:(NSUInteger)sectionIndex forChangeType:(NSFetchedResultsChangeType)type {\nswitch(type) {\n    case NSFetchedResultsChangeInsert: {\n        [self.collectionView insertSections:[NSIndexSet indexSetWithIndex:sectionIndex]\n                          withItemAnimation:SSCollectionViewItemAnimationFade];\n        break;\n}\ncase NSFetchedResultsChangeDelete: {\n    [self.collectionView deleteSections:[NSIndexSet indexSetWithIndex:sectionIndex]\n                      withItemAnimation:SSCollectionViewItemAnimationFade];\n    break;\n    }\n}\n}\n\n\n(void)controller:(NSFetchedResultsController )controller didChangeObject:(id)anObject\n       atIndexPath:(NSIndexPath )indexPath forChangeType:(NSFetchedResultsChangeType)type\n      newIndexPath:(NSIndexPath *)newIndexPath {\nSSCollectionView *collectionView = self.collectionView;\nswitch(type) {\n    case NSFetchedResultsChangeInsert: {\n        [collectionView insertItemsAtIndexPaths:[NSArray arrayWithObject:newIndexPath]\n                              withItemAnimation:SSCollectionViewItemAnimationFade];\n        break;\n    }\ncase NSFetchedResultsChangeDelete: {\n    [collectionView deleteItemsAtIndexPaths:[NSArray arrayWithObject:indexPath]\n                          withItemAnimation:SSCollectionViewItemAnimationFade];\n    break;\n}\n\ncase NSFetchedResultsChangeUpdate: {\n    [self _configureItem:[collectionView itemForIndexPath:indexPath] atIndexPath:indexPath];\n    break;\n}\n\ncase NSFetchedResultsChangeMove: {\n    [collectionView deleteItemsAtIndexPaths:[NSArray arrayWithObject:indexPath]\n                          withItemAnimation:SSCollectionViewItemAnimationFade];\n    [collectionView insertItemsAtIndexPaths:[NSArray arrayWithObject:newIndexPath]\n                          withItemAnimation:SSCollectionViewItemAnimationFade];\n    break;\n}\n\n}\n}\n\n\n(void)controllerDidChangeContent:(NSFetchedResultsController *)controller {\n    [self.collectionView endUpdates];\n}\n``\n. You should simply set thecontentInsetof the collection view instead.\n. I believe this has been fixed. If this is still a problem, please reopen this issue.\n. Good call. Thanks!\n. Amazing. Thanks so much!\n. Looks good to me. Thanks!\n. Great idea! Send me a pull request with that implemented and tests, and I'll gladly merge it.\n. I'm not sure what you're suggesting.Always Search User Paths` is correct by default. Are you needing to change it to make SSToolkit work?\n. I'm hesitant to start adding stuff like this. There are tons of build options. I'm sure if you start changing many of them from the default, it would cause problems. Also, if you're adding header search paths and then disable then with another option, it's kind of common sense in my opinion that you should enabled them.\n\n\nSorry for all of the resistance on this. Hopefully that StackOverflow post is googleable enough :)\n. I haven't experienced this. Are you using a custom font? Can you provide a sample application that demonstrates this?\n. A sample project that reproduces this issue would be excellent.\nI have used SSCollectionView with NSFetchedResultsController in a number of applications. It is definitely possible there is an issue somewhere in SSCollectionView, but in my experience these messages usually a mismatch of the datasource and NSFetchedResultsControllerDelegate are returning.\n. Thanks. I'll definitely add this in the future. I just spent the last hour fighting with appledoc. It keeps failing to create docsets. I'll have to hold off for now.\n. That would be excellent. If you can make the rake docs:publish work, that would be amazing.\n. Totally love everything here except the plural stuff. TTTLocalizedPluralString by @mattt is a much more complete solution. I'd let people use his fantastic library instead of starting to add support in SSToolkit since it is such a large problem.\nCan you send me a pull request without the plural stuff?\n. Thanks so much! Really great additions!\n. Everything is ARC and [super dealloc] is automatically added by the compiler.\nOn May 25, 2012, at 9:02 PM, Brian Hammondreply@reply.github.com wrote:\n\nin a bunch of places... \ne.g. SSAddressBarTextField.m\n- (void)dealloc {\n   self.reloadButton = nil;\n   self.stopButton = nil;\n// >>>> why no [super dealloc] here?\n}\nThese files don't appear to use ARC so I was kind of surprised to get these warnings.\nWhat am I missing? Thanks!\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/samsoffes/sstoolkit/issues/122\n. Strong and retain are synonymous. They should be strong but that doesn't matter. Sounds like an issue with the podspec. If you get it sorted out, I'd love a pull request. \n\nOn May 25, 2012, at 10:01 PM, Brian Hammondreply@reply.github.com wrote:\n\nHmm... In SSAddressBarTextField some of the properties are 'retain' not 'strong'. Also, I was trying to use SSToolkit via CocoaPods and that was not compiling the SSToolkit files with ARC... Problem with the podspec?\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/samsoffes/sstoolkit/issues/122#issuecomment-5944436\n. Good find. Thanks!\n. Invalid post v2.0.0.\n. Best. Commit. Ever.\n. Not a fan of this. The whole point of SSLineView is to draw an inset easily. With a vertical line, you can't really guess which way the inset goes. If you want a vertical line without an inset, it's easiest to just use a UIView with a background color.\n\nI would consider merging this there was an inset direction. Something like SSLineViewInsetDirectionBefore and SSLineViewInsetDirectionAfter.\nIt just feels so silly investing time into such a silly class :)\n. Thanks for the patch. I'll review this as soon as I get a chance.\n. Can you merge master into your branch so it merges cleanly\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. @nayefc this is a table view thing. Table view sets the background of each row to its background color. To avoid this, use @webdevotion's suggestion:\nobjc\nUIView *backgroundView = [[UIView alloc] init];\nbackgroundView.backgroundColor = [UIColor colorWithPatternImage:yourImage];\nself.collectionView.backgroundView = backgroundView;\nIt may be necessary to add this line. I can't remember off hand if it's needed or not.\nobjc\nself.collectionView.scrollView.backgroundColor = [UIColor clearColor];\n. Good call!\n. Looks great! Thanks!\n. Sorry about that. Glad you guys figured it out :)\n. Duplicate of #74\n. Weird. Can you post a sample project that reproduces this?\nOn Sep 17, 2012, at 2:32 PM, Nic Hubbard notifications@github.com wrote:\n\nI am using a SSCollectionView inside of a UIViewController. It seems that at random times collectionView:didSelectItemAtIndexPath: doesn't register a touch on one of the items. A second touch then does.\nDo I have a setting wrong where the touch area is smaller than the collectionViewItem?\nReally not sure what causes this but I can always reproduce it.\n—\nReply to this email directly or view it on GitHub.\n. I'll take a look when I get a chance. Pull requests welcome.\n\nAlso, maybe check out UICollectionView :)\n. Thanks!\n. Solid. Thanks!\n. I dislike this change since setting up your collection view will call reload 2 more times now. What are you trying to solve specifically?\n. Duplicate of #158\n. Looks great overall. Would be happy to merge if you can fix some minor coding convention things.\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. No idea. I don't use CocoaPods. If anyone wants to help figure this out, that would be awesome.\n. Great. Someone pull request me so I can update the spec in my repo when you get it sorted out. Thanks @subdigital!\n. Are you sure you have the latest? This was fixed in 4554f2c65af117402d3d326322389072f1304f47\n. Thanks!\n. Hilarious. I was talking about this with @calebmdavenport. He was working on a fix.\n. Please attach a test project that reproduces this issue using the latest version of SSToolkit\n. No. It is forbidden to call [super dealloc] when using ARC since it is called automatically for you.\n. Thanks!\n. Fixed. My bad.\n. I feel like this used to be here and I removed it for some reason. Can't remember why though. It makes sense to me.\nBy the way, you should really switch to PSTCollectionView if you're on < iOS 6.0 or UICollectionView if you're on iOS 6.0.\n. Thanks!\n. Not sure what I think about this. Since my categories aren't namespaced, I don't want to pollute. Ideally, we should namespace and add the import, but that would break a lot of apps.\n. Thanks!\n. SSCollectionView is deprecated. Please use UICollectionView or PSTCollectionView.\n. Wow, whoever wrote this is code did a great job... :trollface:\nI would love to improve the iPad version sometime. I know we don't really have a need for that right now. Anyway, great work man. Thanks for copying this over!\n. Thanks!\n. Updated the website and released a new version with this. Thanks!\n. Thanks!\n. Awesome!\nSo day, week, month, and year are interesting. It depends on the specific day, etc. If you changed those to instance methods, I'd be for it. You'd have to do something like:\nobjc\n[[NSDate date] secondsInDay];\nThoughts?\n. There is a different amount of time in this month than there is next month. I'm not sure how stuff like day light savings time effects weeks and days.\nAnyway, for month and year, it should definitely require a date. While you're at it, it would be cool to have quarter as well.\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. Thanks!\n. Like I said before, these are not always accurate. The number of seconds in a month greatly vary.\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. Good call.\n. It's a CocoaPods issue. According to @alloy, there is no workaround for this.\n. This issue is resolved in version 2.0.0\n. Amazing! Can you add some for the rest of the categories?\n. Sweet!\nA few things. Can you remove SSHUDWindow since that is a private class? Also, can you remove all of the collection view components and make one collection view sub spec?\nThe SSToolkit sub spec seems to be a bit redundant :)\n. Ya. If you look in the SSToolkit Xcode project, there are several private classes. Those should just be combined with their owner.\n. You can do pod spec lint --local to test it against your local copy.\n. Sweet! I'll review soon and get this merged. Want to take time to double check everything since it's such a big change.\nThanks again for your work on this!\n. On CocoaPods version 0.20.2 this post install hook fails.\n```\n[!] An error occurred while processing the post-install hook of SSToolkit (1.1).\nundefined local variable or method `target' for #\n/tmp/CocoaPods/Lint/Pods/Local Podspecs/SSToolkit.podspec:286:in post_install'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-core-0.20.2/lib/cocoapods-core/specification/dsl/deprecations.rb:24:inblock in singleton_method_added'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-core-0.20.2/lib/cocoapods-core/specification.rb:419:in call'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-core-0.20.2/lib/cocoapods-core/specification.rb:419:inpost_install!'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:474:in run_spec_post_install_hook'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:449:inblock (3 levels) in run_post_install_hooks'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:447:in each'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:447:inblock (2 levels) in run_post_install_hooks'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:445:in each'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:445:inblock in run_post_install_hooks'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/user_interface.rb:113:in message'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:444:inrun_post_install_hooks'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:112:in block in generate_pods_project'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/user_interface.rb:52:insection'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:108:in generate_pods_project'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:86:ininstall!'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:209:in install_pod'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:177:inblock in perform_extensive_analysis'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:173:in each'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:173:inperform_extensive_analysis'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:63:in validate'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:95:inblock in run'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:89:in each'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:89:inrun'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/claide-0.3.2/lib/claide/command.rb:206:in run'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/lib/cocoapods/command.rb:49:inrun'\n/Users/soffes/.rbenv/versions/2.0.0-p195/lib/ruby/gems/2.0.0/gems/cocoapods-0.20.2/bin/pod:19:in <top (required)>'\n/Users/soffes/.rbenv/versions/2.0.0-p195/bin/pod:23:inload'\n/Users/soffes/.rbenv/versions/2.0.0-p195/bin/pod:23:in `'\n```\n. There is an error in the podspec. You should be able to run that command just fine. The fact that the directory is missing means something is wrong with the post install hook. Maybe @alloy can help.\n. Does this spec actually work yet?\n. @sethfri how about we discuss this issue in this issue.\n. Like I said a month ago, if you have a podspec that actually works, I will merge this. \n. I believe this would also fix #187\n. @alloy May 11 on Twitter.\nThe amount of discussion to just write a podspec that works is completely ridiculous. If there is one that works, I will gladly merge it.\n. Maybe spend some time on documentation so this isn't necessary.\n. SSToolkit will no longer support Cocoapods.\n. If someone can write a spec that works, I'll gladly merge it. So far I haven't seen one.\nI am in the process of breaking this library up since CocoaPods has really poor support for libraries with resources. It's better to have things small and separate anyway. This library started with my first iPhone app in 2008. It was really hard to distribute libraries back then, so I put it all together to make things easier. I've learned a lot since :)\n. If you remove the podspec stuff from this, I'll gladly merge the fixes :)\n. git rebase\n. Sounds good. It's cool man.\n. I'd prefer isInteger. I think that's a bit more clear. Also, can you add some tests? :)\n. isInteger and isDecimal sounds good to me\n. I think\nobjc\nif (self.length == 0) {\n    return NO;\n}\nSince an empty string isn't a number.\n. Invalid post v2.0.0. Feel free to make a PR in the corresponding library.\n. What version of Cocoapods are you using?\n. This is a Cocoapods issue. They broke support for SSToolkit in 0.20.0. cc @alloy\n. Thanks!!\n. Most of drawing utilities is silly CGRect stuff. The stuff to draw rounded rects can be done with UIBezierPath. The only cool things in there are included in SAMGradientView.\n. Closed in c0b3154f7c99cb1efbde2a50c53e9834ec380b99\n. Would you mind making this contribution over at SAMCategories? These are going to be replaced by SAMCategories soon.\n. Checkout SAMTextView. It will be replacing SSTextView.\n. Yes. More info: https://github.com/soffes/sstoolkit/issues/189\n. yes please!\n. Invalid post v2.0.0.\n. Please simply use pod 'SSToolkit' or really just what you need of its dependencies. This library is deprecated.\n. Could you change your indentation to tabs to match the rest of the project? Also it would be great if your brackets matched the rest of the project's convention.\n. Could you change your brackets to match the rest of the projects convention?\n. Tabs instead of spaces should be used for consistency with the rest of the project.\n. ",
    "lukeredpath": "Just ran into this myself in a recently deployed app. Happy to help out with a fix.\n. Seeing as UIWindow is just a view, couldn't you always add it to the first window? \n. Would a method like this do the trick?\nhttps://gist.github.com/700304\n. Neither did I! On second thoughts, you might want to check which SDK that was added in. \n. ",
    "nnhubbard": "Is there currently no way to have a touchesBegan event on a SSCollectionViewItem?\n. Wonderful, looking forward to the fix.\n. Yeah, I see that, but it still doesn't look like they are added as subviews no matter which style you use.\n. Just wondering if this got fixed.  Looking forward to adding the fix to my project...\n. Sorry, you are right, I had not upgraded.  My bad.\n. Yeah.  Any luck on figure out what is going on?  I was hoping to release our app soon which uses SSCollectionView in this way, but i don't want to have memory issues.\n. Ok, I have a sample project file.  Just take a look at the Collection View demo, iPad, and turn it to Landscape.  Then, try touching the bottom right corner of some of the cells.  Sometimes they work, sometimes they don't.\nhttp://www.zedsaid.com/__data/assets/file/0003/3099/sscatalog.zip\n. Sorry, I have no idea how I closed this issue.  I uploaded an .zip example project. I can reproduce the issue quite easily.\n. Yep, sometimes it was the first click, sometimes the second.\n. ",
    "hramos": "Fixed at https://github.com/hramos/sstoolkit/commit/033edf04b69555ed6b958ba23d47870e4f2277a6\n. Reduce SSSwitch label mask width by 3 pixels on each side. Closed by 033edf04b69555ed6b958ba23d47870e4f2277a6\n. Just realized OFF text is now off by 3 pixels due to my change. Fixing.\n. Added the same 3 pixel offset to _onLabel and _offLabel frames.\n. I see a subtle difference in the background, although I can't quite place it. Do you mean that the blue/orange background leaks through the gray SSSwitch off background?\nReference pic: http://hram.us/4Hvz\n. Ahhh, I see what you mean: http://hram.us/4HV5\n. Where would you use a SSBadgeView? I'm coding up a demo in SSCatalog in order to understand it / document it.\n. Got it (I was going to ask if this would go in a cell!)\n. Added a basic demo to SSCatalog with three cells: default value (0), positive value, text value.\n. Also, let me know if I should rebase or otherwise commit differently -- I'm usually working on private repos with only one other collaborator, so I haven't got the hang of squashing commits properly.\n. ",
    "evadne": "I fixed a belated issue with overlapping images here:\nhttps://github.com/iridia/sstoolkit/commit/9451581298b3fd49b7da0213f927466855cc6811\n. I have four of them in a table view whose cells are rasterized for the\nrecord.  I guess we can take some profiling and see.\nOn Jun 9, 2011, at 1:53, samsoffes\nreply@reply.github.com\nwrote:\n\n@monoceroi thanks for the effort, but I'd like to avoid using CALayer to do the clipping since that will have a big performance hit if the switch was in a UIScrollView.\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/samsoffes/sstoolkit/issues/37#comment_1328493\n. \n",
    "srcshelton": "How about this?\n```\n--- SSBadgeView.m.dist  2011-02-05 22:06:51.000000000 +0000\n+++ SSBadgeView.m   2011-02-05 22:04:16.000000000 +0000\n@@ -61,6 +61,11 @@\n\n(void)drawRect:(CGRect)rect {\n    UIColor *aTextColor = nil;\n+\nif (!_text || 0 == [_text length]) {\nreturn;\n}\n+\n    if (_highlighted) {\n        [_highlightedBadgeColor set];\n        aTextColor = _highlightedTextColor;\n```\n. \n",
    "myell0w": "also [UIColor colorWithWhite:alpha:] somehow shows me a leak in Instruments, if I switch it to [UIColor colorWithRed:Blue:Green:alpha] the leak is fixed.\n. Thanks. It's really interesting, don't know why colorWithWhite:alpha: should leak, but it appeared as a leak in Instruments for me.\n. have a look at AQGridView, there's a springboard-sample that implements an edit-mode similar to springboard\n. ",
    "daikini": "I'm nilling out the delegate in my controller's dealloc method. For some reason that I've not been able to track down, the _itemSizeForSection is being called after my controller is released and because of this, the exception is being raised.\n. I've tracked down why _itemSizeForSection is being called when my controller is being released. It's because setting the collectionview's dataSource or delegate to nil causes the collection view to reload it's data when causes the _itemSizeForSection method to be called.\nI've fixed this issue in a different branch by checking that both the dataSource and delegate are set before reloading data so this fix in _itemSizeForSection is not needed.\n. Awesome, thanks for getting these merged in!\n. ",
    "stevebrewer": "Nuke the colon in the timezone and it will work:\n[yourString stringByReplacingCharactersInRange:[yourString rangeOfString:@\":\" options:NSBackwardsSearch] withString:@\"\"]\nNot sure if it's Apple not handling the spec correctly, or if the -08:00 isn't strictly valid.\n. Sorry, not a solution, just a direction. Rails formats times with a timezone and puts a colon in the timezone portion, Apple barfs on that (I think by the letter of the spec, rails is wrong, Apple is right, but most environments will work). Nuking the last colon is how you fix times in that very specific format, not all time strings. You'll have to write code to detect that format as an edge case. It's a pain in the ass.\nPartial zones:\n\"2011-02-01T10:57:55-08:30\" would become \"2011-02-01T10:57:55-0830\" and would work just fine.\n. ",
    "jilouc": "I struggled with this issue a while\nHere's what I came up with.\nEdit well, that's perfectly what stevebrewer described. Didn't see his comment before.\n```\n+ (NSDate)dateFromISO8601String:(NSString )iso8601 {\nif (!iso8601) {\n    return nil;\n}\n\n// remove the semicolon\nconst char *str = [iso8601 cStringUsingEncoding:NSUTF8StringEncoding];\nchar newStr[33];\nstrncpy(newStr, str, 22);\nstrncpy(newStr + 22, str + 23, 2);\n\nstruct tm tm;\n\nif (strptime_l(newStr, \"%FT%T%z\", &tm, NULL) == NULL) {\n    return nil;\n}\ntm.tm_isdst = -1;\ntime_t t; \nt = mktime(&tm);\n\nNSDate *date = [NSDate dateWithTimeIntervalSince1970:t];\nreturn date;\n\n}\n```\n. Sorry, you need to include both\n```\ninclude \ninclude \n```\n. Ok I forgot the case with the final Z for UTC.\nTransformed the Z into +0000. I've got both tests working now.\nI've also switched back to strptime instead of strptime_l since it was unuseful so no more need to include xlocale.h.\n```\n+ (NSDate )dateFromISO8601String:(NSString iso8601) {\n    if (!iso8601) {\n        return nil;\n    }\n// remove the semicolon\nconst char *str = [iso8601 cStringUsingEncoding:NSUTF8StringEncoding];\n\nchar newStr[24];\n\nstruct tm tm;\nsize_t len = strlen(str);\nif (len == 0) {\n    return nil;\n}\n\nif (len == 20 && str[len - 1] == 'Z') { // 2011-12-13T22:49:12Z \n    strncpy(newStr, str, len - 1);\n    strncpy(newStr + len - 1, \"+0000\\0\", 6);\n\n} else if (len == 24 && str[22] == ':') { // 2011-12-13T22:49:12+02:00 \n    strncpy(newStr, str, 22);    \n    strncpy(newStr + 22, str + 23, 2);\n\n} else { // 2011-12-13T22:49:12+0200 (and any bad-formatted date representation)\n    strncpy(newStr, str, MIN(24, len));\n}\nif (strptime(newStr, \"%FT%T%z\", &tm) == NULL) {\n    return nil;\n}\n\ntime_t t; \nt = mktime(&tm);\n\nNSDate *date = [NSDate dateWithTimeIntervalSince1970:t];\nreturn date;\n\n}\n```\nAnd thanks, I'll update my NSDate category too!\n. I should use pedantic warnings sometimes too :)\nIt disappears when I use the ternary len > 24 ? 24 : len instead.\n. No because no memory is allocated for newStr (via malloc/calloc/...), it lives on the stack.\nHere, strncpy is really just copying characters in a temporary place that won't exist anymore after the call to dateFromISO8601String:\n. ",
    "ma11hew28": "Yes, I could. :) Where should I write those? I looked for a place to put tests but didn't see where.\n. Oh, found it! I was looking in the stable branch. Interesting. How does that work when you want to pull changes from master into the stable branch but leave out the test stuff?\n. Oops. I closed this pull request because I was thinking I'd make a new commit with everything (tests too) in one commit and then squash both commits into one and make a new pull request. I can make the new commit with tests and all to master. I just cherry-picked stable into master so that I have that last commit I made.\nShould I keep the commits separate? Or, can I merge them into one?\n. fixed :)\n. I thought I fixed that by checking for NSNotFound.\n. Sweet! Thanks.. I should get rid of that other code. Let me know if you remember where it is. :)\n. Sweet! Glad it was of service to you. That's very nice of you for asking. You don't have to add me to the credits, but if you do, I'd be honored. Aside from that, feel free to venmo me some money (https://venmo.com/mattdipasquale), but again, no need to. :)\n. Hey, I wasn't sure how to go about it, so I made two separate commits. One on stable with just the methods (It's actually identical to the first commit on the pull request that I closed.), and one on master with the methods and the tests.\nThe only concern I have is that even though these two commits share much of the same code, they won't match up when git compares them because they'll have different SHA1's. So, for example, git will show each commit as not being merged into the other branch. And, if we ever try to merge branches or whatever, it should work cause their won't be any merge conflicts (since it's the same exact code), but there will be a merge commit and two commits for the trimming methods.\nI'm not sure if this would work, but perhaps it'd be better to also keep the test code in the stable branch, but only merge in the master branch into the stable branch when the master is stable? That way, all the commits would match up... so, kinda like treat the master branch as a dev branch.\n. their => there :)\n. Oops... Found a bug. It doesn't work on strings with just spaces in them. I'll fix now\n. fixed :)\n. ",
    "blackjack75": "stringByTrimmingTrailingCharactersInSet  crashes if  the string is \"\" and my trim string is also \"\" \n. My apologies. I thought I had the last version of the code but apparently I downloaded it from the wrong place. It works fine indeed.\n. Sad thing is if I actually knew where I got it I'd have gotten the right one in the first place :-)\nBTW, I am planning on using this in one of my apps. Aside from including the license, do you think there's someone else I should add to the credits outside of you and samsoffes?\n. ",
    "iamcam": "I saw that - looks like it could work. I really like SSToolkit, so I thought I'd at least throw it out there and see what sticks :)\n. ",
    "grgcombs": "Cool. I'm attempting to use it as a poor mans dynamic flow view, with skinny little item views posing as lines connecting the labeled box items. I like the idea of using the collection view because it will reorient on device orientation changes or on iPads vs iPhones to fit the new available view area. Before this I was trying to do it by hand with UILabels and it just plain sucked. \n. Here's a little pic of what I'm aiming for:\n\n. Ping ;-)\n. ",
    "sammcd": "Did this one kill you on the inside just a little?\n. ",
    "pripyat": "I downloaded it June 7th 2011.\n. ",
    "rknLA": "How is documentation built?  I took a stab at using headerdoc2html with no luck.\n. ",
    "jakemarsh": "Sadly, Peter is right, I haven't had much time to focus on JMImageCache recently and there are 1000 things that could be 1000x better about it. It's probably not a bad idea to find an alternative that is more actively supported and developed on. I'm a huge fan of what @gowalla has done with @gowalla/AFNetworking , their UIImageView+AFNetworking category is basically exactly where I wanted to take JMImageCache. \n. ",
    "ghost": "You're totally correct of course. I didn't know UITableViewCell would call setHighlighted on subviews that didn't inherit from UIControl. I'll submit a different pull request with the subclass change omitted.\n. ",
    "alloy": "Sure, I wasn't too sure about example part myself :)\nHowever, the podspec has nothing to do with the example. It's convenient to keep it in the repo so you can easily update it whenever you make changes that would affect it. And in the future this will allow us to install directly from the repo (HEAD).\n. @fabiotk Then please fix the spec by using the prepare_command and resources. Look through the existing specs for examples of how these are being used.\n. When you’re debugging, be sure to always specify --verbose. For the lint command there’s also an option to not remove the tmp dir after linting.\nIn this case I’m guessing that the problem is the use of sandbox_dir in combination with the fact that a local lint uses the :local option.\nIf I’m right, you should be able to switch to a pre_install hook and use the pod argument to get the real pod's root. See: http://docs.cocoapods.org/specification.html#pre_install.\n. @sethfri Yup. I would also drop support for the old version of CocoaPods.\n. @sethfri If you push your latest changes, I can probably check it out tomorrow.\n. Pushed a version that fixes this problem here: https://gist.github.com/alloy/5676777.\nPlease read the comments, because there are still other issues.\n. > I had originally planned on splitting SSToolkit up into several smaller repos since the only reason it was one giant one before was external dependencies were such a pain (this thing started in 2008).\n\n@alloy encouraged me to make subspecs instead and then @sethfri volunteered to add them shortly after.\n\nSay what? When did I do that?\nI personally hate that we have subspecs, the only reason we have them is because traditionally people created broad libs that covered more than one topic.\n\nWhat is the best course of action here?\n\nI would break up the actual lib, but otherwise use the subspecs.\n. By that tweet I did not mean I would personally not split up the library, just that that is what the subspec thing is for. Sorry for any confusion on that matter.\n\nThe amount of discussion to just write a podspec that works is completely ridiculous.\n\nI agree. As such I’m going to completely refrain from these tickets from now on.\n. We don’t support any lib specifically, we just improve overall support. If that means some libs no longer work at some point, then that’s a real pity, but it’s the way it is with finite resources.\n. ",
    "waheeda": "self.usernameTextView = [[SSTextView alloc] init];\n    self.usernameTextView.tag = 1;\n    self.usernameTextView.delegate = self;\n    self.usernameTextView.frame = CGRectMake(35, 86, 164, 78);\n    [self.usernameTextView setPlaceholder:@\"Enter semicolon separated ids.\"];\n    self.usernameTextView.font = [UIFont fontWithName:@\"Helvetica\" size:12.0];\n    self.usernameTextView.layer.borderWidth = 2.5;\n    self.usernameTextView.layer.borderColor = [UIColor colorWithRed:200/255.0 green:200/255.0 blue:200/255.0 alpha:1.0].CGColor;\n    [self.usernameTextView.layer setCornerRadius:5.0];\n    self.usernameTextView.autocorrectionType = UITextAutocorrectionTypeNo;\n    [self.view addSubview:self.usernameTextView];\nself.emailTextView = [[SSTextView alloc] init];\nself.emailTextView.tag = 2;\nself.emailTextView.delegate = self;\nself.emailTextView.frame = CGRectMake(35, 169, 164, 78);\n[self.emailTextView setPlaceholder:@\"Enter semicolon separated email addresses.\"];\nself.emailTextView.font = [UIFont fontWithName:@\"Helvetica\" size:12.0];\nself.emailTextView.layer.borderWidth = 2.5;\nself.emailTextView.layer.borderColor = [UIColor colorWithRed:200/255.0 green:200/255.0 blue:200/255.0 alpha:1.0].CGColor;\n[self.emailTextView.layer setCornerRadius:5.0];\nself.emailTextView.autocorrectionType = UITextAutocorrectionTypeNo;\n[self.view addSubview:self.emailTextView];\n. ",
    "P120D1GY": "Looks like it was an issue with our Core Data implementation. Thanks!\n. ",
    "hlfcoding": "Yea, somehow for me it was turned off. For example, it was part of QuickDialog instructions.\n. The thing is it was disabled by default in my newly-installed Xcode 4.3. I didn't change it. It may have to do with me using one of Xcode's iOS app templates, but until this issue I didn't even know that flag existed.\nNot including the instruction is fine. It's a super minor issue, but it prevents people like me who don't know the ins and outs of Xcode to get started with the lib (which is awesome, btw) with the smallest amount of friction.\n. This is useful. Why hasn't there been feedback?\n. ",
    "Kapeli": "Thanks! If you need help, let me know.\n. - Attempt 1: it worked\n- Attempt 2: it didn't work\nThe problem seems to be that Xcode checks for new installed docsets while starting up. So if you already have Xcode running, it looks like it doesn't work.\nI guess we need to find a way to force Xcode to load the docset even if it's running. I remember seeing an AppleScript that did that, let me look for it.\n. This is the AppleScript I was talking about. However, it might not be a good idea to use it, it looks like something appledoc should handle.\ntell application id \"com.apple.dt.Xcode\"\n    load documentation set with path \"$HOME/$XCODE_DOCSET_DIR/$BUNDLE_ID.docset\"\nend tell\n. ",
    "fictorial": "Hmm... In SSAddressBarTextField some of the properties are 'retain' not 'strong'. Also, I was trying to use SSToolkit via CocoaPods and that was not compiling the SSToolkit files with ARC... Problem with the podspec?\n. Indeed they are synonymous. I saw the 'retain' and your 1.2 milestone to add ARC and assumed this toolkit wasn't ARC yet and I was somehow missing what was up with the missing dealloc calls.  I bet you just need to add\ns.requires_arc = true\n. ",
    "massimoksi": "Having a quick look I think there are similar problems in other languages too...\n. ",
    "marcins": "As I've been using SSCollectionView in a project, and using it with IB, I actually just made this simple change in my fork. However I'd inadvertently done a previous pull request on my \"master\" branch and can't work out a clean way to re-organise it and have 2 pull requests without a lot of messing around (sorry, relatively new to git).  Anyway, it's only 3 lines, pretty trivial!\n. ",
    "thbonk": "I did the changes locally, but now there is another problem. In my xib file, I have a SSCollectionViewController object. The view of the controller has a SSCollectionView as subview. In IB I set the dataSource and the delegate of the SSCollectionView to the SSCollectionViewController object. When I start the application, an exception occurs in [SSCollectionView _itemSizeForSection] because _delegate is nil.  Any hints?\nThe structure in IB looks like:\nSSCollectionViewController\n|\n- UIView\n  |\n  +-- UIToolbar\n  |\n  +- SSCollectionView\n. ",
    "mattbischoff": "I knew you'd appreciate it.\n. Hmm, yeah. Good point on the namespacing issue. I wonder how much of a problem that pollution would be in real-world scenarios. Might be an unsolvable problem without breaking compatibility like you mentioned.\n. ",
    "sirbarrence": "Er... I meant to say \"longer than it is wide\".\n. ",
    "hanneskaeufler": "+1 very useful\n. I openend an issue here:\nhttps://github.com/CocoaPods/Specs/issues/702\nContains a temporary hack to get this working in development for me in the comments.\n. Omg, totally noticed this too on my current project. thought I was going mental ... You found any workaround?\n. ",
    "jonathan-beebe": "Sure, I'll try to do that this weekend sometime.\n. ",
    "webdevotion": "A possible, simple solution:\nSet the backgroundImage on your view, not on your collectionView and set the backgroundColor of the collectionView to [UIColor clear].  This will probably be a performance hit.  Up to you if it's worth it.  Shouldn't be an issue with a limited number of items.\n. Please post some code.\n. Thanks for the fast response.\nHowever: I did delete the libSSToolkit.a file from disk and did a new build.\nA new libSSToolkit.a file was generated ( using Xcode 4.5 ).\nSame problem persists.\nIf you think I'm doing something wrong, I would appreciate some pointers.\nThanks.\n. Thank you @mspasov.\nI'm up and running again!\n. This is some code from my project with smooth selections:\n[[self.collectionView itemForIndexPath:indexPath] setHighlighted:YES];\n[[self navigationController] pushViewController:playlistViewController animated:YES];\n[self.collectionView deselectItemAtIndexPath:indexPath animated:NO];\n. @nnhubbard so, what's your conclusion? Did you make a mistake?  Is it working?  Please enlighten us : )\n. I tested the example project on an iPad 2 with iOS 6:\n- rotation did not work for me\n- selection is cumbersome ( 2nd click not picked up )\n- the example project might be a bit outdated?\nThat said: it is working fine in my iOS 5+ project with ARC enabled.\nOnly one section though.\n. The fix is present in the git repo.\nReplace drawRect in SSHudWindow.m with the contents of:\nhttps://github.com/soffes/sstoolkit/blob/master/SSToolkit/SSHUDWindow.m#L51\nThe updated code deprecates the use of the old style which used a UIImage.\nThe image has been replaced by a at runtime generated graphic.\n``` objc\n- (void)drawRect:(CGRect)rect {\n    if (_hidesVignette) {\n        return;\n    }\nCGContextRef context = UIGraphicsGetCurrentContext();\nCGGradientRef gradient = SSCreateGradientWithColors(@[[UIColor colorWithWhite:0.0f alpha:0.1f], [UIColor colorWithWhite:0.0f alpha:0.5f]]);\nCGPoint centerPoint  = CGPointMake(self.bounds.size.width / 2.0 , self.bounds.size.height / 2.0);\nCGContextDrawRadialGradient(context, gradient, centerPoint, 0.0f, centerPoint, fmaxf(self.bounds.size.width, self.bounds.size.height) / 2.0f, kCGGradientDrawsAfterEndLocation);\nCGGradientRelease(gradient);\n\n}\n```\n. Glad I was able to help you :+1: \n. Started a new project today with similar specs. No problem using SSToolkit.\nI do have CocoaPods 0.16.1.\nI think your problem is not related to SSToolkit.\nfailed to attach is often caused by a hanging process.\nTry rebooting your machine.  Disconnect iDevices prior to the reboot.\n. Works for me.\n. ",
    "nayefc": "This didn't work. I get a white background now. Any other suggestions?\n. ",
    "mspasov": "This happens when using precompiled version of the library. You could recompile the library or change your application's arch to \"arm7v\" from the default \"$(ARCHS_STANDARD_32_BIT)\".\n. Open the xcode project file for SSToolkit and change the arch to the \"standard\" (which for Xcode 4.5 will resolve to armv7 and armv7s). Note that armv6 is no longer supported and you will not be able to link it to projects, which should run on iPhone 3G.\n. ",
    "atetlaw": "Submitted pull request: https://github.com/soffes/sstoolkit/pull/155\n. ",
    "makadaw": "Hello all, maybe first click work as selectItemAtIndexPath and second deselectItemAtIndexPath :)\nTry set allowsSelection to NO or make private method to proccess \n- (void)collectionView:(SSCollectionView )aCollectionView didSelectItemAtIndexPath:(NSIndexPath )indexPath and \n- (void)collectionView:(SSCollectionView )aCollectionView didDeselectItemAtIndexPath:(NSIndexPath )indexPath\n  in same way (second is wrong way :) )\n. ",
    "blackm00n": "In this change reloadData will return immediately without actual data loading if collection view is not set up completely\nI use collection view in storyboard; when its parent is loaded and initial size/autoresizing mask is applied setFrame method is called, reloadData is called from it. At this point delegates are nil and exception is thrown in _itemSizeForSection.\nI think reloadData should do nothing when delegates are nil, like UITableView does\n. ",
    "inamiy": "Oops. Now I fixed it, how is it?\n. ",
    "subdigital": "Who maintains the SSToolkit pod?\nAlso, @soffes why aren't you using CocoaPods yet? ;)\n. This ticket can probably be closed though.  @hanneskaeufler, would you mind opening an issue on the CocoaPods/Specs repo?  Be sure to include the full error if possible.\n. :(\n. ",
    "sarahhodne": "Sorry, turns out CocoaPods installed an old version. This is indeed fixed.\n. ",
    "calebd": "Yep haven't had a chance to build it yet. It's pretty easy though.\n. Are you installing with CocoaPods?\n. Thanks for the quick fix!\n. ",
    "djchung": "ran into the same issue - @calebd or @soffes - hints on how to fix it? would love to help \n. @hanneskaeufler one hack is to set your SSHUDView instance to hidden and then in your UIAlertView delegate method: alertView:clickedButtonAtIndex dismiss your SSHUDView\n. ",
    "egold": "+1 having this issue as well. Thanks @djchung for the workaround.\n. ",
    "peterwarbo": "My mistake, I had forgotten to clean my project after updating to the new version. Sorry.\n. ",
    "caughtinflux": "Ah, I'm sorry, I didn't realise it was using ARC. My flags are all wrong.\nThanks.\nOn 23-Nov-2012, at 10:24 PM, Sam Soffes notifications@github.com wrote:\nNo. It is forbidden to call [super dealloc] when using ARC since it is\ncalled automatically for you.\n—\nReply to this email directly or view it on\nGitHubhttps://github.com/soffes/sstoolkit/issues/150#issuecomment-10664829.\n. ",
    "keith": "I guess I also need to submit this pull request to @fictorial since his fork has been submitted as version 1.0.2\n. ",
    "aviell": "Hey, how come tag 1.0.2 was created 14 days ago but for example the iPhone 5 SSHUDWindow support is not there? is that intentionally? \n. ",
    "bobbytables": "Awesome, thanks! My solution was just to hide the vignette until I could figure it out. Time to turn it back on.\n. ",
    "ryan-w": "I'm having the same issue. The problem seems to be related to the fact that the \nobjective-c\n- (NSUInteger)numberOfItemsInSection:(NSUInteger)section\nmethod in SSCollectionView.m is caching the number of items so adding new items does not update the count.\n. ",
    "yimingtang": "No. I use git submodule.\n. ",
    "elitalon": "I don't understand :confused: Those methods return constant values: number of seconds in a day, number of seconds in a week, etc. In fact I was tempted to just put them as actual constants, something like:\nobjc\nFOUNDATION_EXPORT const NSTimeInterval SSDayInSeconds;\nbut thought that class methods were a more elegant solution. Now I am interested on what you want to achieve :eyes:\n. I've changed the \"secondsInPeriod\" methods to made them dependent on a given date. I'm not sure if tests are 100% accurate, because dealing with leap years, daylight saving times, etc. is complicated.\n. By the way, I think these methods can be refactored somehow. I'll see what I can do\n. I have finally refactored all those methods into a private method called secondsInPeriod:. I made it private because only a few date periods are supported and can't think of more reasonable date periods to get seconds for.\n. Would you mind if I open a new pull request with this stuff in a separate branch? I'd like to keep adding features to my fork and I'm kinda stuck in the master branch\n. That's why I changed the implementation. Now it's using NSCalendar and NSDateComponents to calculate the actual seconds on a given date:\nobjc\n[[NSDate date] secondsInMonth];\nshould now give you the seconds on May 2013 (the date of this post). The method returns the difference between the first second and the last second on current month. At least that's the intended behavior.\nI honestly don't know something more accurate in Foundation than NSCalendar for date calculations, but I'm open to suggestions :pensive:\n. I've added a category with a method to know the row where a UIView object has been added. Very useful when adding buttons to UITableViewCell objects, because you could do:\nobjective-c\n- (void)cellButtonTapped:(id)sender {\n  NSIndexPath *pathForButton = [self.tableView indexPathForRowContainingView:sender];\n}\nCredits to iOS Recipes's book as well.\n. ",
    "a2": "My bad. :)\n. ",
    "plu": "Fixed in: https://github.com/CocoaPods/Specs/commit/f9aec79c4f54811f28c896c45a2cdd89b6a356d3\n. ",
    "fabiotk": "I have the same issue\n. Thanks @alloy \n. ",
    "sethfri": "Absolutely! I was just taking a bit of a break and figured I'd go ahead and open up the pull request. Glad you like it!\n. Will do. Should I do the same thing for SSAddressBarTextField and SSRatingPicker?\nAnd sorry about the SSToolkit subspec; I was just typing away trying to get it all done and didn't really notice, hahah.\n. Ah, I see now. Great, I'll take care of it.\n. One thing is that I'm not sure how to update the version (or even which version number you would prefer - it's not a bug fix, so I'd suggest 1.1.0), as I get an error when I run `pod spec lint SSToolkit.podspec', the command that checks the podspec for validation. Is this something you can handle after the fact?\n. Here's what I'm getting:\n```\n[!] Pod::Executable fetch origin tags/v1.1 2>&1\nfatal: Couldn't find remote ref tags/v1.1\nfatal: The remote end hung up unexpectedly\n```\nThat's without --local.\n. Sam, I figured out the problem: We were missing a git tag for v1.1. I've added it, and this commit should be the last thing we need.\n. No problem at all! More than happy to help.\nOne more thing I added was a change that seemed to have been made on the CocoaPods/Specs repo some time ago, but it somehow never got merged into soffes/sstoolkit. Hopefully everything's in order now!\n. Try now. I can't be absolutely sure since I can't run pod spec lint --local (I apparently need the directory /tmp/CocoaPods/Lint/Pods/SSToolkit - not sure how to go about that), but according to the documentation, it should be good now.\n. @alloy Do you mean switch completely from a post_install hook to a pre_install hook? I'm fairly new at this whole podspec-writing business.\n. @alloy When I try to do the same thing in a pre_install hook, I get:\n```\n-> Installing SSToolkit (1.1)\n  - Running pre install hooks\nxcodebuild: error: 'SSToolkit.xcodeproj' does not exist.\n[!] An error occurred while processing the pre-install hook of SSToolkit (1.1).\n[!] Failed to generate SSToolkit resources bundle\n/tmp/CocoaPods/Lint/Pods/Local Podspecs/SSToolkit.podspec:291:in _eval_podspec'\n/tmp/CocoaPods/Lint/Pods/Local Podspecs/SSToolkit.podspec:287:inchdir'\n/tmp/CocoaPods/Lint/Pods/Local Podspecs/SSToolkit.podspec:287:in _eval_podspec'\n/Library/Ruby/Gems/1.8/gems/cocoapods-core-0.20.2/lib/cocoapods-core/specification.rb:404:incall'\n/Library/Ruby/Gems/1.8/gems/cocoapods-core-0.20.2/lib/cocoapods-core/specification.rb:404:in pre_install!'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:415:inrun_spec_pre_install_hook'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:390:in run_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:388:ineach'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:388:in run_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:386:ineach'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:386:in run_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/user_interface.rb:113:inmessage'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:385:in run_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:102:indownload_dependencies'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/user_interface.rb:52:in section'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:99:indownload_dependencies'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:85:in install!'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:209:ininstall_pod'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:177:in perform_extensive_analysis'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:173:ineach'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:173:in perform_extensive_analysis'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:63:invalidate'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:95:in run'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:89:ineach'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:89:in run'\n/Library/Ruby/Gems/1.8/gems/claide-0.3.2/lib/claide/command.rb:206:inrun'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command.rb:49:in run'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/bin/pod:19\n/usr/bin/pod:23:inload'\n/usr/bin/pod:23\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:417:in run_spec_pre_install_hook'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:390:inrun_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:388:in each'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:388:inrun_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:386:in each'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:386:inrun_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/user_interface.rb:113:in message'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:385:inrun_pre_install_hooks'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:102:in download_dependencies'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/user_interface.rb:52:insection'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:99:in download_dependencies'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/installer.rb:85:ininstall!'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:209:in install_pod'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:177:inperform_extensive_analysis'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:173:in each'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:173:inperform_extensive_analysis'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/validator.rb:63:in validate'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:95:inrun'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:89:in each'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command/spec.rb:89:inrun'\n/Library/Ruby/Gems/1.8/gems/claide-0.3.2/lib/claide/command.rb:206:in run'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/lib/cocoapods/command.rb:49:inrun'\n/Library/Ruby/Gems/1.8/gems/cocoapods-0.20.2/bin/pod:19\n/usr/bin/pod:23:in load'\n/usr/bin/pod:23\n```\n. @alloy All pushed.\n. @soffes Do you have a final opinion on all this?\n. @soffes I think the current dilemma is how many subspecs to do/if we want to do subspecs at all. See the comments over on @alloy's gist.\n. @soffes Just a heads-up, Gist apparently doesn't send notifications when you mention people, so you may have to use another method to get them to notice your comment hahah.\n. @soffes Hahah, that sounds like the best option.\n. @soffes Ok! I was just waiting to hear what your final opinion was before going to do what @alloy suggested on the Gist. I'll get it taken care of.\n. @alloy In the Gist, @orta mentioned programmatically adding the Core subspec at the end using Ruby. I'm aware of theeachconstruct, but it's not immediately clear to me what to loop through to do this. The documentation doesn't seem to list an array of subspecs that you can iterate over to add dependencies.\n. Same @subdigital \n. Dang, it tracked my commits from the other pull request. Definitely not intentional. Let's take care of the other one first.\n. Sure. Unfortunately I'm not sure how to back out of this state hahah. Is there an easy way of removing commits from a PR?\n. I did agit rebase -i HEAD~10` and deleted all of the commits related to the subspecs. When I pushed it up, however, things went wrong. Said my branch was behind and then apparently just added the commits anyway? Please forgive my lack of rebasing knowledge.\n. If it would be easier to start all over, just say the word. Really am sorry for the inconvenience.\n. ",
    "raylillywhite": "(my 2 cents) I hope these make it in - I'd like the ability to easily pick and choose components of SSToolkit to include.\n. ",
    "siuying": "Came across a similar issue on a different library. This version of the podspec will work. Hope this help others who might interested in writing podspec that run xcodebuild to create a bundle.\n``` ruby\nPod::Spec.new do |s|\n  s.name = 'SSToolkit'\n  s.version = '1.0.4'\n  s.platform = :ios\n  s.summary = 'A collection of well-documented iOS classes for making life easier.'\n  s.homepage = 'http://sstoolk.it'\n  s.author = { 'Sam Soffes' => 'sam@soff.es' }\n  s.source = { :git => 'https://github.com/soffes/sstoolkit.git', :tag => \"v#{s.version}\" }\n  s.description = 'SSToolkit is a collection of well-documented iOS classes for making life ' \\\n                   'easier by solving common problems all iOS developers face. Some really ' \\\n                   'handy classes are SSCollectionView, SSGradientView, SSSwitch, and many more.'\n  s.source_files = 'SSToolkit/*/.{h,m}'\n  s.frameworks = 'QuartzCore', 'CoreGraphics', 'MessageUI'\n  s.requires_arc = true\n  s.license = { :type => 'MIT', :file => 'LICENSE' }\n  s.preserve_paths = 'SSToolkit.xcodeproj', 'Resources'\n  s.prefix_header_contents = '#ifdef OBJC', '#import \"SSToolkitDefines.h\"', '#endif'\n  s.resource = 'SSToolkitResources.bundle'\ns.subspec 'NSArray+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSArray+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSMutableArray+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSData+SSToolkitAdditions'\n  end\ns.subspec 'NSBundle+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSBundle+SSToolkitAdditions'\n  end\ns.subspec 'NSData+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSData+SSToolkitAdditions'\n  end\ns.subspec 'NSDate+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSDate+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSBundle+SSToolkitAdditions'\n  end\ns.subspec 'NSDictionary+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSDictionary+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSString+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSData+SSToolkitAdditions'\n  end\ns.subspec 'NSMutableArray+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSMutableArray+SSToolkitAdditions'\n  end\ns.subspec 'NSNumber+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSNumber+SSToolkitAdditions'\n  end\ns.subspec 'NSString+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSString+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSData+SSToolkitAdditions'\n  end\ns.subspec 'NSURL+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/NSURL+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSDictionary+SSToolkitAdditions'\n  end\ns.subspec 'SSAddressBarTextField' do |sp|\n    sp.source_files = 'SSToolkit/SSAddressBarTextField'\n    sp.subspec 'SSAddressBarTextFieldBackgroundView' do |ssp|\n      ssp.source_files = 'SSToolkit/SSAddressBarTextFieldBackgroundView'\n      ssp.subspec 'SSAddressBarTextFieldBackgroundViewInnerView' do |sbsp|\n        sbsp.source_files = 'SSToolkit/SSAddressBarTextFieldBackgroundViewInnerView'\n        sbsp.dependency 'SSToolkit/UIImage+SSToolkitAdditions'\n      end\n  ssp.dependency 'SSToolkit/UIView+SSToolkitAdditions'\nend\n\nsp.dependency 'SSToolkit/SSTextField'\nsp.dependency 'SSToolkit/SSDrawingUtilities'\n\nend\ns.subspec 'SSAnimatedImageView' do |sp|\n    sp.source_files = 'SSToolkit/SSAnimatedImageView'\n  end\ns.subspec 'SSBadgeTableViewCell' do |sp|\n    sp.source_files = 'SSToolkit/SSBadgeTableViewCell'\n    sp.dependency 'SSToolkit/SSBadgeView'\n  end\ns.subspec 'SSBadgeView' do |sp|\n    sp.source_files = 'SSToolkit/SSBadgeView'\n    sp.dependency 'SSToolkit/SSLabel'\n    sp.dependency 'SSToolkit/SSDrawingUtilities'\n  end\ns.subspec 'SSBorderedView' do |sp|\n    sp.source_files = 'SSToolkit/SSBorderedView'\n    sp.dependency 'SSToolkit/SSDrawingUtilities'\n  end\ns.subspec 'SSButton' do |sp|\n    sp.source_files = 'SSToolkit/SSButton'\n  end\ns.subspec 'SSCategories' do |sp|\n    sp.source_files = 'SSToolkit/SSCategories'\n    sp.dependency 'SSToolkit/NSArray+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSMutableArray+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSData+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSDate+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSDictionary+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSString+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/NSURL+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIApplication+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIColor+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIControl+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIDevice+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIImage+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIScreen+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIScrollView+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIView+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIViewController+SSToolkitAdditions'\n  end\ns.subspec 'SSCollectionView' do |sp|\n    sp.source_files = 'SSToolkit/SSCollectionView'\nsp.subspec 'SSCollectionViewItem' do |ssp|\n  ssp.source_files = 'SSToolkit/SSCollectionViewItem'\n  ssp.dependency 'SSToolkit/SSLabel'\nend\n\nsp.subspec 'SSCollectionViewInternal' do |ssp|\n  ssp.source_files = 'SSToolkit/SSCollectionViewInternal'\nend\n\nsp.subspec 'SSCollectionViewItemInternal' do |ssp|\n  ssp.source_files = 'SSToolkit/SSCollectionViewItemInternal'\nend\n\nsp.subspec 'SSCollectionViewItemTableViewCell' do |ssp|\n  ssp.source_files = 'SSToolkit/SSCollectionViewItemTableViewCell'\nend\n\nsp.subspec 'SSCollectionViewExtremityTableViewCell' do |ssp|\n  ssp.source_files = 'SSToolkit/SSCollectionViewExtremityTableViewCell'\nend\n\nsp.subspec 'SSCollectionViewTableView' do |ssp|\n  ssp.source_files = 'SSToolkit/SSCollectionViewTableView'\nend\n\nsp.dependency 'SSToolkit/SSDrawingUtilities'\nsp.dependency 'SSToolkit/UIView+SSToolkitAdditions'\n\nend\ns.subspec 'SSConcurrentOperation' do |sp|\n    sp.source_files = 'SSToolkit/SSConcurrentOperation'\n  end\ns.subspec 'SSDrawingUtilities' do |sp|\n    sp.source_files = 'SSToolkit/SSDrawingUtilities'\n  end\ns.subspec 'SSGradientView' do |sp|\n    sp.source_files = 'SSToolkit/SSGradientView'\n    sp.dependency 'SSToolkit/SSBorderedView'\n    sp.dependency 'SSToolkit/SSDrawingUtilities'\n  end\ns.subspec 'SSHUDView' do |sp|\n    sp.source_files = 'SSToolkit/SSHUDView'\n    sp.subspec 'SSHUDWindow' do |ssp|\n      ssp.source_files = 'SSToolkit/SSHUDWindow'\n      ssp.dependency 'SSToolkit/SSDrawingUtilities'\n      ssp.dependency 'SSToolkit/UIImage+SSToolkitAdditions'\n    end\nsp.dependency 'SSToolkit/UIView+SSToolkitAdditions'\nsp.dependency 'SSToolkit/NSBundle+SSToolkitAdditions'\n\nend\ns.subspec 'SSLabel' do |sp|\n    sp.source_files = 'SSToolkit/SSLabel'\n  end\ns.subspec 'SSLineView' do |sp|\n    sp.source_files = 'SSToolkit/SSLineView'\n  end\ns.subspec 'SSLoadingView' do |sp|\n    sp.source_files = 'SSToolkit/SSLoadingView'\n  end\ns.subspec 'SSPickerViewController' do |sp|\n    sp.source_files = 'SSToolkit/SSPickerViewController'\n  end\ns.subspec 'SSPieProgressView' do |sp|\n    sp.source_files = 'SSToolkit/SSPieProgressView'\n    sp.dependency 'SSToolkit/SSDrawingUtilities'\n  end\ns.subspec 'SSRateLimit' do |sp|\n    sp.source_files = 'SSToolkit/SSRateLimit'\n  end\ns.subspec 'SSRatingPicker' do |sp|\n    sp.source_files = 'SSToolkit/SSRatingPicker'\n    sp.dependency 'SSToolkit/UIImage+SSToolkitAdditions'\n    sp.dependency 'SSToolkit/UIView+SSToolkitAdditions'\n  end\ns.subspec 'SSRatingPickerViewController' do |sp|\n    sp.source_files = 'SSToolkit/SSRatingPickerViewController'\n    sp.subspec 'SSRatingPickerScrollView' do |ssp|\n      ssp.source_files = 'SSToolkit/SSRatingPickerScrollView'\n      ssp.dependency 'SSToolkit/SSGradientView'\n      ssp.dependency 'SSToolkit/SSTextField'\n      ssp.dependency 'SSToolkit/SSTextView'\n    end\nsp.dependency 'SSToolkit/SSRatingPicker'\nsp.dependency 'SSToolkit/UIScreen+SSToolkitAdditions'\n\nend\ns.subspec 'SSTextField' do |sp|\n    sp.source_files = 'SSToolkit/SSTextField'\n    sp.dependency 'SSToolkit/SSDrawingUtilities'\n  end\ns.subspec 'SSTextView' do |sp|\n    sp.source_files = 'SSToolkit/SSTextView'\n  end\ns.subspec 'SSToolkitDefines' do |sp|\n    sp.source_files = 'SSToolkit/SSToolkitDefines'\n  end\ns.subspec 'SSWebView' do |sp|\n    sp.source_files = 'SSToolkit/SSWebView'\n    sp.dependency 'SSToolkit/NSString+SSToolkitAdditions'\n  end\ns.subspec 'SSWebViewController' do |sp|\n    sp.source_files = 'SSToolkit/SSWebViewController'\n    sp.dependency 'SSToolkit/SSWebView'\n    sp.dependency 'SSToolkit/UIImage+SSToolkitAdditions'\n  end\ns.subspec 'UIApplication+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIApplicaton+SSToolkitAdditions'\n  end\ns.subspec 'UIColor+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIColor+SSToolkitAdditions'\n  end\ns.subspec 'UIControl+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIControl+SSToolkitAdditions'\n  end\ns.subspec 'UIDevice+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIDevice+SSToolkitAdditions'\n  end\ns.subspec 'UIImage+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIImage+SSToolkitAdditions'\n  end\ns.subspec 'UIScreen+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIScreen+SSToolkitAdditions'\n  end\ns.subspec 'UIScrollView+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIScrollView+SSToolkitAdditions'\n  end\ns.subspec 'UIView+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIView+SSToolkitAdditions'\n  end\ns.subspec 'UIViewController+SSToolkitAdditions' do |sp|\n    sp.source_files = 'SSToolkit/UIViewController+SSToolkitAdditions'\n  end\ns.pre_install do |pod, target_definition|\n    Dir.chdir(pod.root) do\n      command = \"xcodebuild -project SSToolkit.xcodeproj -target 'SSToolkitResources' CONFIGURATION_BUILD_DIR=./\"\n      command << \" 2>&1 > /dev/null\"\n      unless system(command)\n        raise ::Pod::Informative, \"Failed to generate SSToolkit resources bundle\"\n      end\n    end\n  end\nend\n```\n. @lexrus I don't use this library, i had no idea if all these subspecs are right. It would be better for users of this library to do that. :)\n. ",
    "lexrus": "@siuying Your spec works! Would you like to push it to the master repo of CocoaPods?\n. ",
    "rolandleth": "And recreate the method to actually check for an integer, too. Then what about a currency field, where an integer wouldn't suffice? Shall I add both, isInteger and isDecimal (or name it something more clearer, maybe isFloat)?\n\nOn Jun 20, 2013, at 5:19 AM, Sam Soffes notifications@github.com wrote:\nI'd prefer isInteger. I think that's a bit more clear. Also, can you add some tests? :)\n—\nReply to this email directly or view it on GitHub.\n. It's done, but I wanted to ask your opinion on something, before I commit.\n\nI added an if (self.length == 0) return YES; because I think checking for the string's length should be done outside the method, preferably before calling it. That's how I'd do it (and notify the user, or return a \"0\" result), but I might be wrong. \nWhat do you think?\n. ",
    "aleufms": "pod --version\n0.20.2\n. ",
    "marcelofabri": "I like this approach a lot! (:\nIt would be great if you comment about discontinued components, though. Some of them are really obvious (like Collection View), but some aren't. I'm talking about Drawing Utilities mainly. Have you chosen to discontinue it because of namespace issues? \n. ",
    "bogardon": "Overkill in my opinion. Unless you plan on seriously expanding each of the components to rival other similar projects, I think it's better to just keep them together. That being said, as long as every component is kept up to date the SSToolkit podspec, it doesn't really matter haha.\n. ",
    "alexito4": "I really like this new approach. For example I usually only use a couple of controls (gradient, edittext). With that I can use only this and not import all the toolkit. And if anyone want all the toolkit they can have it too. \n;)\n. ",
    "orta": ":+1:\n. ",
    "Zhukn1": "Thanks. Are you planing to replace all the SSToolkit elements?  \n\nRegards,\nStas Zhukovskiy.\nпятница, 27 сентября 2013 г. в 18:28, Sam Soffes написал:\n\nCheckout SAMTextView (https://github.com/soffes/SAMTextView). It will be replacing SSTextView.\n—\nReply to this email directly or view it on GitHub (https://github.com/soffes/sstoolkit/pull/191#issuecomment-25248945).\n. But the drawRect method there also isn't supported in iOS7, I can make a pull request there, ок?  \n\n\nС уважением,\nСтас Жуковский\nпятница, 27 сентября 2013 г. в 22:59, Sam Soffes написал:\n\nYes. More info: #189 (https://github.com/soffes/sstoolkit/issues/189)\n—\nReply to this email directly or view it on GitHub (https://github.com/soffes/sstoolkit/pull/191#issuecomment-25268684).\n. \n",
    "jstart": "I believe this commit should be merged instead with https://github.com/soffes/SAMTextField as SSToolkit is being broken into seperate libraries.  Fork that repo and make the same changes, if you have time! It would be greatly appreciated!\n. ",
    "xzenon": "I see. Made proper changes and added pull request for SAMTextField. Thanks!\n. ",
    "gardenofwine": "I also got hit by this error. I managed to workaround the issue by specifying the exact commit hash (for 1.0.4) in my Podfile:\npod 'SSToolkit', :git => 'https://github.com/soffes/sstoolkit.git', :commit => '1403f02cb98f8357f4b8e43c59d9c69d608d7bed'\n. @sandeeplall-2009, what happens if you simply use pod 'SSToolkit' without the commit specification?\n. ",
    "vermont42": "Thanks, gardenofwine. I too hit this error and fixed it using your suggestion.\n. Thanks, gardenofwine. I too hit this error and fixed it using your suggestion.\n. ",
    "sandeeplall-2009": "I'm not able to do this it saying \"-bash: https://github.com/soffes/sstoolkit.git,: No such file or directory\". BTW I'm trying to install pod for xcode 6. please suggest me the correct way\n. "
}