{
    "toddtreece": "fixed by abc92d7f8c90bcd4817f3f2e4898838e8b483268\n. fixed by f0555a02150d45c766899c47bed6316c6f07204d\n. fixed by 1ed99e839de4f7abceb0b447e614b4493a791fc4\n. fixed by:\n- sparkfun/phant-manager-http@018e91145a6cfbe8cb224ae0ddbd595443f5032b\n- sparkfun/phant-meta-mongodb@8a7c81cdcd96439160085ba78411b6b671d5af12\n- sparkfun/phant-meta-json@05284c8e5a99147ec1c27494be4bca8124b11baf\n- sparkfun/phant-meta-test@84475534aebb7e395edd21fa4c04259de7bef195\n. fixed by sparkfun/phant-manager-http@47661e2dec895245a0d3b9f6c47403332551ae61\n. fixed by 507d2f850e6bcc1853ea9a7aedbf907662ae1ef4\n. fixed by sparkfun/phant-manager-http@ce452129ba5f936e3e8c078e0f7507214d732774\n. fixed by 6981da3f437ee3cc0249208edcf26154854044ed\n. fixed by:\n- sparkfun/phant-manager-http@b4d34479ddd148fa47a63d32fa6cb8ba49276ce3\n- sparkfun/phant-meta-mongodb@8a7c81cdcd96439160085ba78411b6b671d5af12\n- sparkfun/phant-meta-json@05284c8e5a99147ec1c27494be4bca8124b11baf\n- sparkfun/phant-meta-test@9075c856377134fa631af2f89b4f356de5783290\n. fixed by sparkfun/phant-manager-http@45cf6ed785bcdad926db6ea5e3259c4587c84fd7\n. this was added to sparkfun/phant-manager-http, and deployed to https://data.sparkfun.com\n. looks good\n. i make a couple minor tweaks to error message handling, but other than that it works great.  jshint was causing the build to fail because of missing semicolons, so make sure to run grunt before commits.  thanks for the help!\n. fixed by 340286e1f95024ec7c0aba8f1ecd643d6db27e14\n. completed:\n- phant-meta-json\n- phant-meta-test\n- phant-meta-mongodb\n. completed: phant-notify-email\n. closing this. the remaining modules without tests will be split out into separate issues.\n. This has been fixed by dcc184ac98dd24ac00e3d5afb611b73c5eb68e66, and it will be available when 7.0 is finished.\n. fixed by #26 \n. fixed by sparkfun/phant-notify-email\n. On data.sparkfun.com or your own instance of phant?  If it's your own instance, which manager are you using (Telnet or HTTP)?\n. I'm not sure what you mean by \"validate a HTTP for the Get Set\".  But, if you are looking for docs on HTTP input and output, try here:\nhttp://phant.io/docs/input/http/\nhttp://phant.io/docs/output/http/\n. phant.io is now live with basic docs.\n. @brennen give it a try on http://phantmqtt.sparkfun.com\nhttp://phantmqtt.sparkfun.com/output/n1W7MyLlMPULx5k7n8LocBgAo78.atom\n. added by #85, and deployed to https://data.sparkfun.com\n. I'm ok with killing it. You'd just have to remove the call to the markdown parser from the views in phant-manager-http\n. sounds good. it's easy to add again if we need to change it back.\n. removed by sparkfun/phant-manager-http@53d931ace1f504b5414e5ba5ae183ab5b38cd3c1\n. @caseydentinger I stripped express from http output, added a couple tests, and made sure all tests pass.  Want to take a look?  I think it's almost ready to merge.\n. the touch method looks good, but returning client there won't work because it's just a reference to the client object, and not an instance.  I'll try to rearrange the module tonight so it can emit events properly.\n. merging this so the input tests can be used on other branches\n. fixed by 21230aea40edd0cd50ac4441b562c5049899119b & 0d05fa8082533bef2e0f15117730983812950eda\n. fixed by sparkfun/phant-manager-http@3a7440c647072b01b72c7087bdb76b9e6d39408d\n. fixed by 23c0a3379263e32df4aea7eb4d74c829ff49da02\n. completed on master\n. fixed by d5887f979561785dde0dd1ba4ada0efd7bc4d27c\n. fixed by 6d1faa26b51a44e967a195371ac29d2f22e8822c & ba1b71b3d7f1024e9bc6038494206105089cff8d\n. added to stream list and tag list by sparkfun/phant-manager-sparkfun@2fc7cc218a67eee222dc96bbd5e704e567474d97 & sparkfun/phant-manager-sparkfun@e8d27245f3e40fc278f6fad8f27a2197a9490159\n. fixed by sparkfun/phant-manager-http@5f97a10875dbff8baae986c501575c0f1d33f784\n. Sounds good.  This might be a good service for feeds attached to sparkfun.com acounts since we don't store user email accounts with stream metadata.  What do you think?\n. That would work too.  Would you like data.sparkfun.com to have an authenticated section with feed management, or would you like SparkFun users to manage their feeds from their sparkfun.com account page?\n. That's the cleanest way to do it from my perspective, and it prevents us from collecting a bunch of duplicate info from users who want to keep track of their data streams.\n. fixed by sparkfun/phant-manager-http@4bc639d10026ffed56859ba94270a92ee4c3f9b9\n. looks good\n. fixed by sparkfun/phant-manager-http@c7d87335db2e3e8073a0e9700751ed09fe10f832\n. fixed by sparkfun/phant-manager-http@24165cf5cf091f9f0c6c41c4eee4c16d64ae3a98\nthe form should now retain the values posted after errors.  the error is happening because you have a space in the tag name.  i'll try to make that error a little easier to understand, but the main issue is fixed\n. I added a link to phant.io/docs to the end of the email. Eventually that site will have a ton of info about using data.sparkfun.com & hosting your own phant server.\n. Tags aren't required, so a bug must have been introduced somewhere.  I'll take a look.\n. fixed by sparkfun/phant-manager-http@f72760c0082cfbd73c2c30c2385c8d4097b4a88c\nthanks for catching that!\n. this was already changed in sparkfun/phant-manager-http.  documentation has been updated to match DELETE /streams/KEY\n. fixed by phant-stream-csv@7618f1c37bc97cb8dd09fd8c494df59916c663e7\n. By keys, do you mean field definitions or public/private/delete keys?\n. That's one feature we started with, but here are a few reasons why we now require field definitions:\n- Phant storage is modular. Dynamic field definitions work when the storage used is something like MongoDB or JSON, but doesn't work for something like CSV storage.  CSV is a good storage system because we can avoid having to include field names for every row, and that keeps the file size small.\n- Dynamic fields limit output formats.  TSV and CSV output wouldn't really work if you had new field definitions for every row, and those formats are handy for people that want to load the data into spreadsheet software.\n-  Field definitions allow us to validate sensor input.  If a device doesn't send the correct fields, we can alert the user because we know what to expect.  This can be very helpful when debugging.\nWe also wanted to make sure that the streams were described in some way (title, description) so users can browse the public stream list and find interesting data to play with.\nDweet looks very interesting.  Thanks for sharing the link!\n. @naikrovek I'm going to close this one, but feel free to reopen this if you have ideas for how to support things like CSV output with dynamic fields in every row.\n. @naikrovek I think these suggestions make sense for outputting CSV data, but phant uses CSV for data backend storage by default, not JSON.  It's set up this way because JSON files are huge compared to CSV, and if you have a sensor that's logging a bunch of data automatically storage size becomes important.  Because of this, I think trying to make CSV storage deal with dynamic fields would make it unstable.\nAdding other backend storage solutions like SQL based dbs would also be a problem if we allowed dynamic fields, because we'd have to ugly things like schema changes, or we'd have to serialize the data and shove it into one field.  I think you are definitely right if phant wasn't built to be completely modular, but since it is we have to try to come up with solutions that fit all possible backends... like thermal printer output.\n. @naikrovek Yep. Redis would work great, as would any NoSQL solution, but that's not really the point. The difference between phant and other solutions like dweet.io is that we hope to easily support any storage system or live output that you'd like to plug into it, and we wanted to make the default install have no dependencies other than node.js, and still perform well on single board computers like the Ras Pi or BeagleBone Black.\nIf you already run MySQL, and want to write a phant output module for MySQL so you can easily run queries against your logged data, you can. It should be fairly easy to do that currently, and I think the pattern you described would make it hard to query because you'd have to pivot the logged data in SQL or in code, which kind of goes against why you'd use a SQL based storage system in the first place.\nYou could use the same key/value scheme for dynamic field support when pushing data to phant.  It would work, but it's just not ideal.  Believe me, I want to support dynamic fields if users want it. It just would come at the cost of making a whole set of storage solutions that expect field definitions ugly to implement and use.\nI don't think this discussion is bad to have, and it's good to have it where others can get involved in the conversation.  We made a new forum for larger design discussions like this one.\nCheck it out: https://forum.sparkfun.com/viewforum.php?f=44\n. Yep. It looks like a bug.  Thanks for catching that!\n. fixed by: c6dc29ca9b4bcd4f94fd3d130593431ab2dd5054\nYou can get the fixed version (v6.1.0) by running npm update -g phant.  Let me know if that works for you.  Thanks again!\n. HTTPS is supported on data.sparkfun.com (if the client supports it), and you can send your key via a request header, but HTTPS is the best way to avoid that type of attack.  The main issue with HTTPS is that most IoT devices can't do HTTPS.\nWe are open to ideas if you have any.\n. We talked to @quartzjer about using telehash as a input, and I think that's still possible.  He had mentioned that he should be able to get it running on an Arduino, but I haven't had time to check in with him lately.\n. Public Key: Unique identifier for the data stream\nPrivate Key: Used with the public key to auth and post data\nDelete Key: One time use. Used to completely remove a stream and its metadata\nThis might not be the most secure thing in the world, but we were trying to make it simple to create a stream without requiring an account.  All data is public, and even if you hide your stream from the public list, someone can read it if they have the public key (and obviously write if they get the private key).\n. ...and eventually UDP, TCP, telehash etc.  The server generates the keys when the new stream is made and gives them to the user.  The user then uses the public/private pair to post data.\n. I think we might be causing confusion with our terminology.  We aren't using the term 'keys' to represent public key crypto, just keys to a locked thing.  It should probably be something like: ID, post   secret, delete secret.\nThe reason we aren't just using the private key to post, is because I wanted all of the routes to use the same format: /streams/public_key, /input/public_key, /output/public_key.  That way people wouldn't get confused and use the private key in places where they should be using the public key, or use the wrong private key and post to the wrong stream (if they have multiple streams).  It doesn't add security, but I think it helps standardize the HTTP request format.\nI think that this issue is much larger than phant or data.sparkfun.com, and I hope SparkFun can help encourage innovation in this area.  It would be great if we could make versions of WiFi and Ethernet shields that handled HTTPS, but I'm guessing that's a lot to ask for. \nAll I know is I'm definitely not the one to solve this.  I can barely deal with the keys to my house.\n. @jbdatko Yeah.  What about switching key to hash?  I think cookie could cause just as much confusion when sending HTTP requests. Or would changing the name private to something like push key or publish key, and changing public key to ID be less confusing?  I don't think it's going to be that hard to change either way, I just thought the lock and key analogy was something people would understand right away.\n. I honestly have no idea. We had this feature requested via email, and I was just making a note to check out the site. \n. I took a look at IFTTT's site, and it looks like they would need to add us as a channel.\n@Cougar https://github.com/cantino/huginn is the only thing I've heard of that seems close to IFTTT.\n. This already exists, and for the most part it's the same as what data.sparkfun.com uses: https://github.com/sparkfun/phant-manager-http\nI'll write a tutorial on how to add it to your local server soon.\n. No prob.  I'll leave this open as a reminder until I write the tutorial.\n. @smonami You can now easily add the HTTP manager to a custom downloadable configuration using the new config tool: https://data.sparkfun.com/config\nPlease reopen this if you are still having issues getting it running.\n. It looks like you might have some other web server running on the default port (8080)\n. I'm not really a Windows user, but this might help you tell what's running: http://stackoverflow.com/a/105448\n. yep. try running npm update -g phant to get the latest version of phant (it should be at least v6.0.4).\nonce you have upgraded, you can make a config file called .env in your favorite plain text editor and add PHANT_TELNET_PORT=8082 to the file.  change 8082 to whatever port you would like it to run on.  it doesn't really matter where you put the file, just as long as you remember where you put it.\nthis gist will show you how the file should look.\nthen you can run phant from the same directory as the .env file, and it should load the config from that file. i'll be writing docs about the stuff you can change with the .env file soon, but that should get you running.\n. it sounds like you have an old version of phant installed.  what's the output of npm list -g phant\n. yep. you'll need to run npm update -g phant to get the latest version (currently 6.1.4). there was a bug in the .env port numbers in that version.\n. Great!  Those example commands are for a linux/unix environment, and I should probably mark them as such.  Windows doesn't have a telnet client enabled by default, so you'll have to download something like PuTTY and use it as a telnet client.\n. Running phant from your local machine will allow you to post data and save it locally.  The basic server you just install uses telnet to manage streams (create & delete) instead of the web UI that you see on data.sparkfun.com.\nIn these two examples I'm going to use 8080 as your HTTP port, but you should use whatever port you set using the PHANT_PORT variable in the .env file.  Replace PUBLIC and PRIVATE with your keys, and FIELD and VALUE with your field name and the value you'd like to log.  You can add as many fields as you'd like by adding more parameters to the query string.  Here's more info about how to add data to your server: http://phant.io/docs/input/http/\nTo post data to your local machine:\nhttp://localhost:8080/input/PUBLIC?private_key=PRIVATE&FIELD=VALUE\nTo get that data back:\nhttp://localhost:8080/output/PUBLIC.csv\n. can you paste your .env file here?\n. So you'd use http://localhost:8080/input/ to post data.  PHANT_PORT defines what port the HTTP server runs on. PHANT_TELNET_PORT defines what port the telnet server runs on.\n. Thanks for the feedback.  I'll use our discussion to write up a small tutorial about starting the server on Windows. Sorry it was such a pain!\n. weird. i'll check it out tomorrow morning.\nthanks for the bug report!\n. I wasn't thinking about this last night, but backslashes aren't valid URL characters.  Some web browsers will automatically convert them to forward slashes.  After looking at node.js's core, it looks like the url module mimics that behavior for browsers that don't convert the slash.\nThe best way to handle this is to url encode your values if you are sending special characters.\n. Fixed by:\nMongoDB Stream Metadata: https://github.com/sparkfun/phant-meta-mongodb\nMongoDB Logged Data Storage: https://github.com/sparkfun/phant-stream-mongodb\nI'll write a tutorial on how to configure this, but you can find an example of a production server config that uses mongo for stream and metadata storage here: https://github.com/sparkfun/data.sparkfun.com/blob/stream-to-mongo/serve\n. I've personally never used MQTT, but I've been planning on seeing how to integrate it.  I'll let you know   once I take a look at how it works.\n. @jsilence & @johncohn:\nI have spun up a new test server with a new (hopefully better) topic format at http://phantmqtt.sparkfun.com.  You can test the server by downloading this Gist: https://gist.github.com/toddtreece/feb66ddef602c8ec0c1e\nYou'll need to run npm install and then node client.js from the extracted folder to start the client.\nTopics\nI'm going to use PUBLIC and PRIVATE as placeholders for your keys.  Replace the placeholders with the hashes given to you during the creation process.\nPushing data\nPayloads should be JSON encoded, and should only include the fields you defined when creating your stream.\nTopic for pushing data\ntxt\ninput/PUBLIC/PRIVATE\nPush confirmations\nConfirmations about the status of pushes can be subscribed to using the following topic.\nTopic for responses about status of pushed data\ntxt\nresponse/PUBLIC/input\nLive data output\nPhant can receive data from multiple sources (HTTP, TCP, UDP, MQTT, etc), so if you'd like to receive the data from all sources, you can subscribe to the stream by using the following topic format.\nTopic for subscribing to JSON encoded payloads with all fields\ntxt\noutput/PUBLIC\nIf you would like to subscribe to a specific field, you can use the following format and replace FIELD_NAME with the name of your field.\nTopic for subscribing to a specific field\ntxt\noutput/PUBLIC/FIELD_NAME\n. @johncohn \nhttp://phantmqtt.sparkfun.com is the instance of phant with the broker running on port 1883.  You shouldn't need to build anything if you have your own MQTT client.\n. MQTT over websockets is now live on data.sparkfun.com.  I'm currently trying to get the load balancer to forward tcp traffic to 1883 and 8883 for ssl. I'll close the bug when mqtt over tcp is live.\n. MQTT on data.sparkfun.com port 1883 is live, and I'm working on getting SSL enabled on port 8883.  I'm going to close this issue, but I'll post once SSL is enabled.\n. oops. thanks for the correction!\n. @randykarels could you take a look at this one?\n. @patrick-- I haven't written Python in a couple years, and @randykarels uses it daily here at Sparkfun, so I wanted him to check it over before we merge.  I'm sure it's great, but I'd like someone qualified (not me) to double check before I merge it into master.\nThanks for the submission!\n. based on feedback from issue #68, i'm going to merge this.  thanks again!\n. I wasn't aware that they offered SVG.  Thanks!\n. Yep. Phant (the server behind data.sparkfun.com) doesn't currently offer any sort of data processing, it's just a simple data store focused on making it easy to store data collected from internet connected sensors.\n. Try taking a look again, and refreshing the page.  A CSS fix just deployed.\nPlease let me know if that fixes your issue. Thanks for the detailed bug report!\n. There's a separate data output issue, but it's not related to this bug so I'm going to close this one.  That page should be fixed.\n. The examples are now using a new test stream.  Thanks for catching that!\nfixed by: 811ea2f46d68adc1fdbed9f8127753b95ce9b220\n. Yeah. I can add that for input and output, but I think we are going to keep stream creation locked down to data.sparkfun.com\n. @lectroidmarc added by #92 & deployed to https://data.sparkfun.com\n. @DoctorWho8 It looks like you have really old versions of node and npm installed.\nTry running:\nsudo apt-get update\nsudo wget http://node-arm.herokuapp.com/node_latest_armhf.deb\nsudo dpkg -i node_latest_armhf.deb\nIf you then run node -v after the install, you should have a 0.10.2x version installed.  Then you should be able to run npm install -g phant.\n. Sounds good.  I'll add this to the next release.\n. @kylethedude #85 adds limit and offset to output query string parameters.\n?offset=100&limit=50 would give you rows 100-150.\n. Hosted charts might become a feature on data.sparkfun.com down the road, but for now, check out this tutorial: http://phant.io/graphing/google/2014/07/07/graphing-data/\n. I'm going to close this one, since there is a bug here for charts: sparkfun/phant-manager-http#2\n. @marsselo Are you just looking for XML output?\n. @marsselo there is now a LabView example here: https://github.com/sparkfun/phant/tree/master/examples/LabVIEW%202012\nI'm going to close this, but let me know if that didn't help.\n. Cool. Let me know if that works.  I haven't had a chance to run his code\n. Thanks for letting me know. I'll merge it into master.\n. What browser & version were you using on the first computer?\n. @tryceattack i'm going to close this one, but please reopen it if you see it happening again.\n. Websocket output is currently live on data.sparkfun.com. Watch one of the active streams, and you'll see new data pop in. \n. @lectroidmarc There seems to be a bug in our load balancer config, but you can connect to the live data streams on your local machine using something like socket.io-client.  I could probably switch the server over to just plain websockets, but socket.io & engine.io provide a few nice fallbacks for clients that don't support websockets.\nWhat language are you using?\n. Check out this gist: https://gist.github.com/toddtreece/ee47c17cee30c90a3963\nIt's using socket.io-client to connect to one of the data.sparkfun.com webservers.  Once I get the load balancer issue fixed, you'll be able to use the DNS name instead of the IP.\n. Ah.  You are probably going to run into cross-domain issues.  I'm going to be adding CORS support soon, so hopefully that will fix the issue. I'll also look into converting the socket.io code to plain websockets, but no promises there if it doesn't perform well.\n. yep, you've got it. will that take care of your needs?\n. @JPhant this was added to the list of libraries here: http://phant.io/libraries, so I'm going to close this issue.  Hopefully someone will pick this back up in your absence.  Thanks for the info.\n. This will be added with the features requested in #67.\n. I'm going to close this one since #67 describes what you are looking for.\n. Thanks for catching that! I'll fix it in the next release.\n. @derekpitt this was fixed by 7bd3d04309ec4044075cc307787db74961f9ea57, and it should be deployed to data.sparkfun.com by the end of the day tomorrow.\n. Nope. Their color palette is similar to ours, but it's just a coincidence.\n. @Serasidis I think the server should always use UTC, but I could see why you would like this for data output. I'll try to figure something out so you can request data using the appropriate adjustment.\n. @Serasidis The additions in #91 allow you to use the IANA Time Zone Database name format to convert the UTC timestamp field to your local time.  You can request the conversion by adding ?timezone=VALUE to the output URL.\n. Sorry, I missed this one.  You can also create your own custom configuration using this tool: https://data.sparkfun.com/config\n. @ttstam I'm going to close this, but please reopen if you are having issues getting the custom server config up and running.\n. This is possible, be we are trying to discourage that on data.sparkfun.com because we don't one one person programmatically creating a bunch of streams and using all of the resources.  It's not ideal, but we want to continue offering it as a free service, and stopping abuse helps with that.\nWhat's your use case for creating them ad hoc?\n. Yeah. It shouldn't be an issue to add to the standard phant http manager.\n. @dt99jay You can now do this via the HTTP manager, and you can get a JSON response if you POST your new stream to http://localhost/streams/create.json.  If you need to configure a phant server with the HTTP manager enabled, you can now use this configuration tool: https://data.sparkfun.com/config\n. I like that idea quite a bit, but average wouldn't work for non-numeric fields.  Would every Nth record be ok?\n. @surfingsteve this was added in #85, and it's live on https://data.sparkfun.com.  You can tell the server to return every Nth record by adding ?sample=10 to the output URL.  Just change 10 to however many records you'd like to skip.\n. @liudr check out #126 for my response. Filters, offsets, & limits are currently possible.\nIn the next release of phant, graphing will be supplied by third party modules built into the system.  Users will be able to add their own module, and submit a pull request to get it included in the list of available plugins.\n. Do you mean the auto update when new data is added to the stream?  If so, that has been temporarily disabled while new features are being added to the site.  It should be turned back on early next week.\n. I'm going to start posting news updates on phant.io when I have to make changes like that.  I'll close this issue once it has been re-enabled.\n. @Serasidis the auto data push should be active again on data.sparkfun.com\n. @lectroidmarc the wss issue was fixed by sparkfun/phant-manager-sparkfun@ba66a0a57534decac2e8ae0b9df7d57580f58274.  \nI'm using the mows mqtt client on data.sparkfun.com, and am working on updating docs.  You can find a bit of documentation here and the current websocket code for data.sparkfun.com here.\n. @SilisRom you can only access the raw data if you installed phant using npm install -g phant.  if you'd like to download the data, try this: \nhttp://192.168.1.10:8080/output/MQxY9Oo09EF6aXOWNGG4TJ8M8rQ.csv for CSV\nhttp://192.168.1.10:8080/output/MQxY9Oo09EF6aXOWNGG4TJ8M8rQ.json JSON\nIf you'd like the same interface as data.sparkfun.com, then you'll need to configure a new instance of phant with the HTTP manager using the new configuration tool located at https://data.sparkfun.com/config.\n. You can extract it wherever you would like to. Once you have it extracted, cd into the directory and run npm install and then npm start to start the server.\n. I'm going to close this one, please reopen if you are unable to get the custom server config running.\n. Thanks. Fixed by sparkfun/phant-docs@d90c5f0c299222fa292b4aa74d775d40bdbea14e\n. Yeah. I was working on the servers until late last night.  Things should have stabilized a bit by ~11pm EST.\n. @emcniece you can use the new configuration tool to set up your server on port 80, and switch out the telnet manager for the http manager.\nAfter downloading your custom configuration, add your Procfile and configure it like this:\nweb: node index.js\n. @emcniece were you able to get that up and running?\n. @emcniece nice work! I missed the notification about your first reply. The body parser warning shouldn't hurt anything, but the heroku port thing makes sense.\nI'm guessing the callback you added to Phant.HttpServer.listen() was throwing a type error since that callback is referencing app.settings.env, which doesn't exist.\n. @MajicCat you can now also use the configuration tool found here to setup your server: https://data.sparkfun.com/config\n. There are instructions for installing in the downloaded zip or tar file.  Did you get any errors when you tried to download the package?\n. Could you give it a try in the latest Firefox or Chrome?  I haven't had a chance to test the tool in IE yet, but it's on my TODO list.\n. Are you using data.sparkfun.com or your own instance of phant?\n. @B504now can you do a Serial.println(phant.post()); for each of those, and paste them into a gist: https://gist.github.com/  There might be something wrong with the phant-arduino lib.\n. @B504now Do you have a link to the gist?\nI'm not familiar with the XBee WiFi modules, but I can take a look at the request and see if it's a problem with the server.  That will narrow it down a bit at least.\n. @B504now these should both result in 400 Bad Request because the post body is empty.  The library automatically clears the saved params after you call phant.post(), so you may need to remove any other calls to phant.post() in order to log the data.\n. @B504now I think you'd just need to remove the call that sends the data to the server in order to properly log the full request you are sending.  Because you are logging after the post to the server, the phant library clears the request and the next call to phant.post() shows up as empty when it prints out in the serial monitor.\nI'm not sure what your code looks like, but try logging with something like this:\n```\n// comment out post to server\n// xB.print(phant.post());\n// debug\nSerial.println(phant.post());\n``\n. @B504now are you logging the response from the server? If so, what does it respond with?\n. @B504now: this issue can now be tracked here: sparkfun/phant-arduino#1\n. This issue seemed to be resolved in #21, so I'm going to close this. Please reopen this if you are still having issues.\n. @liudr yep. that looks like a bug. I'll add it to my todo list to patch on master\n. @liudr I pushed the fix to master: 1f2488781f7d7f7ba9e13d118c326fb7ab0ed932, and it should deploy on data.sparkfun.com tomorrow.\n. Yep.  phant.add() accepts aString` as the first argument: https://github.com/sparkfun/phant-arduino/blob/master/Phant/Phant.h#L30\n. That stream doesn't exist on the server, so it might have been deleted.  Are you using someone else's stream?  I only ask because the gist was posted from a different GitHub account.\nWant to try creating a stream and giving it a shot with new keys?\n. I see what's going on here.  http://data.osbh.smartcitizen.me is hosting it's own copy of phant, and the streams exist on that server.  You'd just need to replace https://data.sparkfun.com with http://data.osbh.smartcitizen.me in any of your API calls.\n. @Amakaruk & @coloradobum:  That looks like a really interesting project!  Just so you know, you can use the server config builder if you want to use the http manager instead of telnet: https://data.sparkfun.com/config\n. I'm going to close this one, but let me know if you have any other issues.\n. Thanks, I added it to the list of clients on http://phant.io.\n. 1) phant.post() knows nothing about the request itself, it just generates a string for you to send using whatever device you'd like.  if you'd like to save the string, you could assign phant.post() to a variable.\n2) when sending data, they can be in any order\n3) assigning the result phant.post() to a variable is the best way to do this currently.\n4) phant currently requires you to send all variables, but they can be blank.  this might be changed in future versions.\nThis repo is used for issues with the server.  It would be helpful for me (and other users that are having issues with the arduino client) if you posted arduino specific issues here: https://github.com/sparkfun/phant-arduino/issues\n. No problem at all.  It will just help keep track of things if we keep the client and server issues separate.\n. It accepts an Arduino String object. Here are the method definitions: https://github.com/sparkfun/phant-arduino/blob/master/Phant/Phant.h#L30\nAnything found in the constructor section should work: http://arduino.cc/en/Tutorial/StringConstructors\n. @B504now & @ToniCorinne:  I'm going to close all of these separate bugs, and use sparkfun/phant-arduino#1 to track this issue since it is an issue with the Arduino client and not phant itself.\n. offset and limit also are live, and documentation is in the works.  You can find out more here: https://github.com/sparkfun/phant/pull/85\n. @imp-guru the REST API docs have been live for a while, but right now the API for the node.js modules  only includes metadata.\nEventually the plan is to include a more robust UI, but as of right now I'm spending most of my time building up the back end.\n. @imp-guru I'll rename the API section to 'node.js API' to avoid confusion. \n. @imp-guru you can select a date range using the new greater than and less than filters: https://github.com/sparkfun/phant/pull/90\nDate range query string example (in UTC): ?gt[timestamp]=2014-08-15&lt[timestamp]=2014-08-20\nYou might also be interested in timezone conversion on output: https://github.com/sparkfun/phant/pull/91\nYou can get the current size and page count from the stats response: http://phant.io/docs/output/stats/.\nThis isn't documented yet, but you can also get stream metadata in json by appending .json to the end of the public URL: https://data.sparkfun.com/streams/dZZg4xwVgjhwbYraLRlG.json\n. @imp-guru I forgot to mention, you can also do things like ?gt[timestamp]=now -2 months&lt[timestamp]=now -1 month\nday(s), week(s), month(s) and year(s) are supported.\n. @imp-guru This looks great!  How does it deal with non-numeric values?  The main reason I haven't added something like this to data.sparkfun.com is because it's currently hard to guess data content, even if the value is numeric.  i.e. the value may be a number, but it might represent a boolean or GPS coordinates.  Both of which don't make sense in graph form.  Would you be interested in merging this into https://github.com/sparkfun/phant-manager-http?\nThe data storage is FIFO, and currently the first page will fill up to ~250kb and then get rotated to page 2.  All of the existing pages shift one position until the cap is reached.  Once the cap is reached, the last page will be removed. When you request data, the server streams the data back LIFO, which is why page 1 is constantly changing size.\n. @imp-guru Yeah.  Dealing with data types will be a lot easier once the stream has metadata about the fields.\n@brennen and I have been talking about creating some sort of registry for JS plugins, so that users can dynamically add registered chart plugins, maps, etc to their public stream page.  So graphing will be a part of data.sparkfun.com soon, it just hasn't been a priority because the API still needs some work.\n. @imp-guru one other thing.  It looks like you are making JSONP requests for data.  Just so you know, CORS is now enabled for output, so you should be able to make standard JSON requests for data.\n. @imp-guru I caught that bug, and will be deploying that fix this weekend: https://github.com/sparkfun/phant-manager-http/blob/master/routes/stream.js#L129\n. I'm going to close this one.  I think all of the issues have been resolved\n. thanks!\n. This was added by https://github.com/sparkfun/phant/pull/85. Documentation should be up soon, but the URL looks like this: https://data.sparkfun.com/output/9JwJoYRzzmfvQAjv1V5r/latest.json\n. @nseidle requested this so users know when their device isn't sending the proper data.  Maybe a strict flag stored in metadata would be a good approach.\n. @dpjanes the timestamp is stored in milliseconds, so it's highly unlikely that the timestamp wouldn't be unique on a row given the extra time it takes to process each request.  the reason i didn't add a separate id originally is because it takes up extra space for every row, and i wanted to keep the row size as small as possible. if you think it's still essential, then we can add it, but it seemed like overkill to me.  let me know what you think.\n. @dpjanes I wasn't talking about forcing uniqueness, I just was saying that under normal use it doesn't seem like it would be an issue.  A config setting sounds like a good option, and i'm guessing a v1 GUID would work for the actual id value.\n. I think the way to guarantee the order is to download the full file.  I think a incrementing numeric ID is a good idea, but I'm not sure of the best way to ensure a solid incrementing ID across clustered instances of phant, or multiple phant servers behind a load balancer.  It could be done with something like increment feature of Redis, but that would require a separate implementation for the most basic of phant configurations (since we don't want any external dependencies).\nI'm not sure why GUID wouldn't work.  You could just go \"give me records 0-10\", then grab the last GUID from that set and say \"give me the next 10 records starting at this GUID\".  The server will always return them in order since it's just a stream of the stored data.\n. Sounds good.  I'll add it to the next release.\n. this sounds like a good idea for the 7.0 release.\n. This is going to be included in the 7.0 release, and I'm going to close this since it's the approach we are using for #67\n. Good call.  Merging\n. yeah, this is a simple bug in the output router. pushing a fix\n. @Hasco yeah. This one and a couple others are actually fixed on a big feature branch, they just haven't been merged into master yet.  I generally avoid fixing bugs on feature branches, but since it has diverged from master quite a bit, it was easier to fix separately.\nI pushed the fix to master, and it should 404 when you update to phant@6.7.2\n. @Hasco thanks for testing it out. Closing\n. @abiank Sorry, I missed this one.  Do you mean on your own site?  I think the websocket push is only enabled on data.sparkfun.com, but it could be easily ported to the standard phant http manager.\n. I'm checking into it right now. Thanks\n. Fixed by sparkfun/phant-meta-mongodb@f858817101a84df2b5250efa711959f260323103\nYou can update the version of phant-meta-mongodb to 2.2.1 in your package.json and run npm install to fix the issue.\n. Can you give me more info about your setup? Can you give me an example of the data you are posting? Are you using a local install or data.sparkfun.com?\n. For the plain text responder, you should get a 0 or 1 for success, followed by a space and a human readable error message.\nCan you post the full request with headers you are sending to the server?\n. @mtnscott I can't seem to replicate this issue by sending the same request using curl.  Are you sure there isn't a problem with the library you are using?\n. @piettetech for plain text, there is only success: 1 and failure: 0 with a human readable message\nThe other characters are a bug in phant or the client lib.\n. I'm going to close this, but please reopen if it happens again\n. Fixed by sparkfun/phant-manager-http@9107f9e836539f8c3d41ac13611ac61d831ace5e\nYou can update the version of phant-manager-http to 4.5.10 in your package.json, and run npm install to fix the issue.\n. I'm guessing that's another bug in the mongo module.  I'll take a look.\n. Not yet. I was traveling yesterday for work. I'll check it out this weekend\n. It looks like this is an issue with mongoose's readable stream implementation (they are using node v0.8 streams).  I'm pulling mongoose and switching to node-mongodb-native since mongoose is overkill for this module.  I'll push the new version in the next couple hours.\n. @Hasco the fix should be available if you update to phant-stream-mongodb@2.1.3\n. @Hasco feel free to post any issues with the update, or close the issue if everything works as expected.  Switching to the node-mongodb-native package added the extra benefit of increased speed.\nThanks for the bug reports!\n. Is this on data.sparkfun.com, or your own server? It should have been fixed by sparkfun/phant-manager-http@ffd710c723ab74e6f10ba99e4b2aba6c1683685b\n. @piettetech I don't think that client JS fix has been deployed yet, but you can use this until it is: https://data.sparkfun.com/streams/delete\n. @naikrovek This already exists.  Check out https://github.com/sparkfun/phant/pull/85 for more info.\n. @piettetech good call. this will be part of the 7.0 release.\n. I'm going to change up the storage backend, and that should fix the issue\n. @melonista & @Zppylock this should be fixed after the transition to new servers. Please reopen this if it is still happening.\n. this is a duplicate of #119\n. @Hasco I'm not sure what you are asking here.  Phant is licenced under GPL v3. \nCould you describe what you mean by \"regenerated whole front and back end\"\n. Yep. This is the best place right now to ask questions.  Feel free to file issues for the questions.\n. I'll take a look.  I'm guessing there's just a minor problem with one of the logged rows.\n. 1) The offset & limit params should take care of this.  Check out: https://github.com/sparkfun/phant/pull/85\n2) Check out: https://github.com/sparkfun/phant/pull/90 for filters & https://github.com/sparkfun/phant/pull/91 for timezone conversion.  The timestamp field can be queried using strings similar to PHP's strtotime.  i.e. ?gt[timestamp]=now%20-10%20minutes&timezone=America/Denver\n3) Great idea, but what about something like this:  Currently streams have metadata (stuff like title and description) & logged data (what you see when you request output).  What if I allow users to create/update/delete their own custom metadata values, and keep that separate from the logged data so they can use the metadata to control devices if needed.  My gut says that the key/value expiring is probably something that should be handled by the client with a delete request, but I could be convinced otherwise.\n. I'm guessing the metadata stuff would be a different request, and it could have its own REST interface.\n. @Hasco feel free to ask away here.  It might help others with similar questions\n. This is possible, but I'm not going to promise anything.  The storage modules, especially the file based ones like CSV and JSON, make it hard to change the sort order. All of the results would need to be buffered and sorted in code for those types of storage. Sorting in the storage modules that are backed by real databases is a lot easier and faster, but I would need to make sure that sorting worked for all storage modules to implement the feature.\n. thanks. on it\n. @imp-guru nope. it was a problem with a couple of the workers behind the load balancer going down.\n. Data is currently being migrated to new servers\n. I'm getting closer.  There was a memory bug in the transition script, and it's causing the transition to die halfway through. I have a little bit more testing to do before attempting the transition again.\n. @StereotypicalSquirrel it should take about 2 hours to run the transition script, and it is currently about 30 minutes in.  It has been dying about 1 hour in (which is why it takes so long to debug), but I think I found the issue. If all goes well, it should be back around 7 EST.\n. @StereotypicalSquirrel @SLPhant after a long battle, data.sparkfun.com is now running on 3 new faster servers, and is using a much more stable database as the storage backend.  Want to check your data and make sure everything is restored?\n. Great.  I'm going to close this one.  This database transition has needed to happen for a while.  Thanks for being patient while I moved stuff!\n. @annemukiri can you send me your 'Public Key'?\n. @annemukiri when did you create the stream?\n. @liudr you could fork sparkfun/phant-docs, and add a project section if you would like. If you need help getting that started, let me know.\n. @liudr Could you send me an example of what you would like to post via email? data@sparkfun.com\n. @DanOBrien you installed a really old version of node.\ntry this:\nuser@workstation:~$ curl -sL https://deb.nodesource.com/setup | sudo bash -\nuser@workstation:~$ sudo apt-get install -y nodejs build-essential\nuser@workstation:~$ sudo npm install -g phant\n. @neophyte-savant try loading http://localhost:8080 in a web browser. i enabled the http manager by default for you w/ 6.8 so it's easier to get going\n. @neophyte-savant i'm guessing you restarted the server after re-install, but try http://127.0.0.1:8080 and see if that works. i'm not very familiar with running node on windows, so i'm just guessing here. i'll try to get someone from sparkfun to help you debug this on a windows box\n. @DanwithArduino try @thcipriani's recent vagrant addition locally. you shouldn't need a separate package, and you can set the http port easily in the vagrant file.\n. @DanwithArduino it's not really that you are wrong, but your forked package will be harder to maintain if updates are pushed to the upstream phant repo. try downloading a config using the tool found here: https://data.sparkfun.com/config that way you can benefit from updates without having to merge them in.\nI think I see the bug in the phant http routing code that's throwing those errors. you can try to adjust your code to use a HTTP POST to avoid the routing bug.\n. @DanwithArduino yep. the custom config package you configured and downloaded is at version 1, and phant v6.8 is listed as one of its dependencies.\nit's a bit hard to explain because the phant ecosystem is really modular (probably to a fault currently), but phant itself is just a router between different phant modules. the configuration of phant with different modules is what gives you a working server, otherwise it has no inputs or outputs. if you take a look, the index.js file in the archive you downloaded from https://data.sparkfun.com/config looks a lot like the default server config in .bin/serve of the main phant repo. they are both server configs, and .bin/serve was included in the main repo so people could start up a server without messing with config options.\ni'm not sure if that info helps at all, but i'm glad you got it sorted.\n. yep. param() is part of express.  it merges query string, route variables, and req body\ni kind of like adding the processed variables to the the request object so we have the option of processing the request with multiple functions without having to pass around the vars.  does that seem cleaner to you?\n. it was a pain to read this diff on my phone, so sorry i just got to this.\nit should be included with req as part of req.headers (if it was sent by the client), and you can process it at any point before the clear and log actions are called.\n. yeah. i could see that being confusing, but i think as long as it's extending the request with a new property, it should be fairly easy to figure out in these small modules.  i'm guessing comments would help too (which i'm trying to get better at starting now).\n. ",
    "MajicCat": "Looking for more documentation on how to set up keys.. Any examples?\n. I am using a local server. Using Telnet for management and want to validate a HTTP for the Get Set once a stream is created.\n. The create worked as per the documentation:\nphant> create\nEnter a title> test1\nEnter a description> test data\nEnter fields (comma separated)> temp,color\nEnter tags (comma separated)> \nStream created!\nPUBLIC KEY: zrGp1oxz4ACmnMlGPEOEC0LV5pv\nPRIVATE KEY:  9oywN8LrAKSNlOPn6xzxsDaR3Gr\nDELETE KEY:  kQB1nZP4Xouje1woDOkOu5eMmDa\n \nSending \nhttp://localhost:8082/input/zrGp1oxz4ACmnMlGPEOEC0LV5pv?private_key=9oywN8LrAKSNlOPn6xzxsDaR3Gr&temp=99\nresults in error 400 \nSorry, I know this is basic, but there is little documentation examples... \n. Got it, both fields need to be present.\nhttp://localhost:8082/input/zrGp1oxz4ACmnMlGPEOEC0LV5pv?private_key=9oywN8LrAKSNlOPn6xzxsDaR3Gr&temp=100&color=3\nthat works. \n. I am setting up mongoDB for the first time. A tutorial for windows would be great. There is not much about where these files go. Sounds simple, but first timers need a primer. Much thanks. \n. Found the thread on .env configuration. Worked fine.\n. Not enough detail on how to deploy it. \"Dowload package\" did not down load anything and no instructions on npm publishing. Love the idea, but you need a little more info for new comers... \n. No error, just no download... On Windows 8.1 using IE\n. Chrome worked fine. Thx. \nAs I am new Ill ask some question that may help others. \nIt looks like these files pull the correct utilitis into the nodejs structure. The thing that has been confusing is the relationship between nodejs, npm and the directory in which one's terminal emulator is running and how Nodejs knows where to find phantconfig-custom...\nIt looks like I can i create a directory (anywhere), and name it anything, and place the files in it ,start npm and get everything pulled into that directory.\nHow then does a web service coming in via nodejs know where to look for the appropreate 'phantconfig-custom' service?\nCan I crease 2 service on different ports and have both be served?\n. Yes, using the npm shell and placing the downloaded file into a folder (any one), the proper modules are copied ('npm install') and one can start the server by 'npm start'. ..\nI now have the phant manager showing.. \n. ",
    "brennen": "\nThe reference states\"When making a HTTP POST request, you should send your PRIVATE_KEY using the Phant-Private Key request header\". Where is this defined?\n\nWhat language are you looking to log data with?  We can likely either create or point to an example.\n. Awesome.  I did just realize however that it doesn't seem to be populating the <dl>s.\n. I think the snippet thing is a good idea, but I have a suspicion that if this gets popular, people are going to want formatting, and Markdown is a pretty well-known standard at this point.\n. My personal gut reaction is that I favor an ecosystem with strong copyleft on at least a plurality of open code projects, but we'll have a conversation about this.\n. Sure thing - we've been hashing this out a bit internally, and I think we're pretty likely to stay with the GPL for the time being, but we do appreciate that this can be a sticking point for some users.  We'll keep thinking about it.\n. Yeah, we are definitely aware.\nSome discussion of what to do about this starting here and here.\n. (Heh, sorry 'bout overlapping comment @toddtreece.)\n. > Wait, the device needs Node.js to work right? So arduinos are out?!\nServers need Node.js; the goal is that clients should pretty well be able to run on anything that can put together an HTTP request.\n. Hey Josh - I think a terminology switch is in the works, if nothing else since \"key\" has so far only clouded conversation.\nI'm also not really thinking of the underlying issue as closed - I do think we're hoping to work out an input module with better security/identity/tamper-resistance properties.  Lotta discussions still to be had about this.\n. Todd, go drink a beer or something.\n. Hi marsselo.  Could you elaborate a bit on this one?  We're not super familiar with LabView.\n. > lib/field_stream.js\nHehe.\n. Neat!\nFor what it's worth, both pagination and sampling are already supported.  See here for paging, and here for sampling.\n. Yeah - and I think beyond that, if you need some other form of sequence guarantee within the same ms (like if you plan to later store stream data elsewhere in some non-ordered fashion, I guess), clients can increment some rotating counter and push that as a field for later use.  I concur that providing an absolutely guaranteed monotonically increasing id field is probably not worth the extra complexity and overhead.\n. ",
    "randykarels": "My vote: launch as plain text now and expand to Markdown+snippet later.\n. ",
    "nseidle": "That's an acceptable approach. Is there another way to offer the service? Perhaps an optional email field during account creation? Not ideal but I'm not sure how else to offer the 'Notify me when' service.\n. No preference. Which is easier and more seamless to implement? I would lean towards using data.sparkfun as the wild west of anon and sparkfun.com as the friendly area where you can tweak things like feed descriptions and notification options.\n. I think I got past the error by inputting a tag. Are tags required?\n. I do this on the device side on my Weather Station. I wanted to see when the data was getting pushed according to local time. You can see 'measurement time' on my feed. The Imp is capable of getting UTC from the net and then I do a conversion to local time (including daylight savings). I think it's best to keep the server timestamp UTC and let the user adjust on their own.\n. I've had this problem as well. Checkout my weather station tutorial. Best way to fix it is to create an extra column in your channel for your own local time stamp. The time stamp on phant will not be user modifiable; it's core to how phant works.\n. ",
    "bboyho": "Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ### Phant is No Longer in Operation\nUnfortunately Phant, our data-streaming service, is no longer in service and will be discontinued. The system has reached capacity and, like a less-adventurous Cassini, has plunged conclusively into a fiery and permanent retirement. There are several other maker-friendly, data-streaming services and/or IoT platforms available as alternatives. The three we recommend are Blynk, ThingSpeak, and Cayenne. You can read our blog post [ https://www.sparkfun.com/news/2413 ] on the topic for an overview and helpful links for each platform.. ",
    "kevinswiber": "@brennen Thanks.  I'm happy to see this project released as open source, regardless of license choice.  For my team (I work in the Labs division of my company), nearly all of our work is contributed to the open source community.  However, as is the nature of a Labs team, some of what we do will make its way into our commercial products.  GPL occasionally leads to hissing noises.\nAs we're not doing anything with phant at the moment, it's not a currently pressing issue.  Just noticed the license and thought I'd throw out the question.\nThanks again for your consideration!\n. No problem.  Thanks again!\n. ",
    "naikrovek": "field definitions.\n. feel free to close again; I wanted to write this here rather than in a private email.\nI don't see an issue with CSV output in this specific case.  One can assume that if a user has different fields regularly that they know what they're doing, and that they won't output with CSV, but with JSON.  In my mind this is simply a limitation of CSV and is probably partially why JSON is so effective for things like this.\nIf you must support CSV output in this specific scenario, then offer the user an option to map all the Phants' columns to exported spreadsheet columns (hard) or just export one column per unique field name and let the end-user munge the data themselves (easy).\nI have been operating on some assumptions which put me on a different plane than SparkFun in terms of expectations, and the expectation mismatch is my fault, not SparkFun's.\nMy assumptions:\n1. The end user will know how to deal with their data, whatever it is.\n2. The end user would rather not need to configure a Phant before it is used, or knows the data logged may change based on conditions which might not be known at configuration time.\n   - If it's raining, I don't need to log humidity.\n   - If a sensor fails, its data might not log at all.\n   - If I switch a sensor and the output format or scale or units of measure change, I don't want to create an entire new Phant to use it.\n   - If I decide I no longer want a Lux sensor at all, and want an ambient noise sensor instead, I don't want to create a whole new Phant to accommodate that. I also have 12 other sensors that I'd have to lose historical data on when I switch to a new Phant, or I'll have to merge the data later.\n   - If there is a bug in my code, and I spell a field name wrong, and I don't notice it right away, I'd rather the entire entry not fail because of that single typo.\nI don't know.  Maybe i'm way off base.  Go ahead and close if you like.\n. I am not a JavaScript developer.  I think object storage is what Redis does, though.  Maybe that would be more robust for storage?  I dunno.\nFor a relational DB, you could use the tuple design pattern.  Schema doesn't change based on data, and can be extended all you want. Uses LOTS of rows, though.\nI see LOTS of great potential for this software.  This (and dweet.io) are like twitter for machines.  \nI won't comment further.  My id@gmail if you want to continue without polluting this bug any more.\n. Isn't that up to the IFTTT people?\n. Cougar is looking for something like node-red.\nhttp://nodered.org \n. ",
    "jacgoudsmit": "To keep the system usable for small systems (think Arduino) it might be a good idea to let the device generate a random key (or use some unique identifier like a MAC address) and let the owner of the account determine which devices are accepted. Don't use the same private key for posting data as for doing important stuff like delete the stream. Maybe add a mechanism where clients and servers can call a plugin library (via callback function) to encrypt/decrypt/sign data. For many simple projects, the whole encrypting thing is probably not an issue so they would use no plugin, for others, it may be a lot more important to guarantee the integrity between client and server so they would plug in a library with something SSL-ish.\n. ",
    "jbdatko": "Solving the general problem: what encrypted transport can a IoT device use is difficult. @quartzjer has been working on Telehash for a while, which is an overlay network that supports encryption by default. It runs on the Pinoccio devices I believe. I'm not sure of how easily it is deployed though.\nBack to the more immediate problem. An ARM / Linux device like Beagles and PI will have no problem handling SSL. AVRs are another story. If you are willing to use hardware to solve the problem, then you could use the ATECC108s, like those on the CryptoCape to supply random and provide digital signatures. However, it's not the most open thing to require everybody buy an ECC108, (or a CryptoCape, although I wouldn't mind :p)\nAnother idea would be to use some like HOTP, like Google Authenticator, for one time passwords. But that might be awkward for unattended devices.\n. What is that private key and how is it used? Is the the server's private key or for the device? It looks like it is used just for a serial number? https://github.com/sparkfun/phant/blob/master/lib/http_input.js#L113\n. Ok, thanks that helps and I understand the challenge now.\nSo you don't need cryptography for confidentiality, since all data is\npublic, but you want to authenticate users and protect the integrity of\ntheir data. The constraints are that the device, connecting to the service\nis most likely an Arduino w/o any sophisticated crypto libs AND w/o a\nreliable random generator.\nThe problem is, people will probably assume that nobody can change their\nstream (fair assumption) and may rely on the data in the service. It sounds\nlike not a big deal if others can read it, but it might be a big deal if\npeople change the data. Big deal here means: 1.) they might not trust your\nservice anymore or 2.) may make incorrect decisions based on a hacked\nstream.\nRight now, the public / private key pairs are a bit overkill b/c you are\nusing them like a cookie. In fact, it may just be easier to do that: Server\npresents cookie to Arduino, Arduino gives it back. You have the same MITM\nproblem, but it's easier for all parties involved.\nThe cookie approach is not bad per se, but you should let users know that\nthis service is more like a public wall. i.e. You guys are offering a cool\nservice, it's fun, it's helpful, but don't rely on it for critical data\napplications.\nThe general problem: how to have a vanilla Arduino communicate securely\nwith a web service, probably shouldn't be tackled by this service.\nPersonally, I think that is ok as long as fix the expectations for your\nusers.\nAnyway, thanks for spinning this up. As always, SF is awesome.\nOn Thu, Jul 10, 2014 at 2:31 PM, Todd Treece notifications@github.com\nwrote:\n\nPublic Key: Unique identifier for the data stream\nPrivate Key: Used with the public key to auth and post data\nDelete Key: One time use. Used to completely remove a stream and its\nmetadata\nThis might not be the most secure thing in the world, but we were trying\nto make it simple to create a stream without requiring an account. All data\nis public, and even if you hide your stream from the public list, someone\ncan read it if they have the public key (and obviously write if they get\nthe private key).\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/49#issuecomment-48659954.\n. Wait, the device needs Node.js to work right?  So arduinos are out?!\n\nThe beagle should be generating the key pairs, posting the public key to the server. You can still use the cookie for ID/tracking, but the beagle should sign its posts and the server should verify them.\n. The only reason to use a public / private key pair is if you are going to sign, encrypt, or decrypt something. It doesn't look that's happening but it's being used as an ID.\nIf you want an ID, drop the key pairs, they aren't doing anything for you, use a cookie.\nIf you want to strongly authenticate users you either need to require them to not only generate a HTTP request, but perform cryptographic operations. This requirement will eliminate some devices.\nIf you don't want to eliminate some devices, then the device must either have a crypto library in addition to whatever they are doing, or add a chip like the ATECC108 which will generate private/public key pairs where the private key never leaves the chip.\n. At minimum can you change \"private key\" to \"cookie?\" When you code includes\na public \"private key\" in plaintext and you pass that over an insecure\nchannel, you are effectively throwing chum in the water and attracting\nsharks.\nOn Wed, Jul 16, 2014 at 3:09 PM, Nick Wilson notifications@github.com\nwrote:\n\nPhant and data.sparkfun.com already support SSL; the solution is to\nsimply not allow your requests to go over a non-SSL connection if you want\nto avoid leaking your private stream key.\nThere are absolutely methods which enable us to push data semi-securely\nover a non-SSL connection, such as using a TOTP\nhttps://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm\ncode, or by signing requests with the private key, but they all have their\nown issues. Ultimately, it's adding unnecessary complexity, and it's\nattempting to come up with a solution for an issue which is already solved.\nArduino devices are intended to be simple, cheap, and user-friendly, which\nmeans they aren't the most feature-rich platforms (granted, the Arduino Yun\ncan support SSL by means of the on-board AR9331 used for the WiFi stack).\nMany dev boards with an ARM processor are likely to have some form of SSL\nsupport (for example, NETMF http://www.netmf.com/ on the FEZ\nhttps://www.ghielectronics.com/catalog/product/450 or Linux on the RasPi\nhttps://www.sparkfun.com/products/12994//PcDuino\nhttps://www.sparkfun.com/products/12077/BeagleBone\nhttps://www.sparkfun.com/products/12857) if you want to stick with a\none-board solution which is comparably priced.\nIf it's really a problem and you have no other option, I'd recommend\nimplementing some kind of request proxy which handles your own layer of\nsecurity. Off the top of my head, an 'easy' 5-minute solution would be to\nidentically seed a random number generator on both ends and XOR your entire\nrequest. Could someone catch on to what you're doing and figure out your\nseed? Sure, but the effort required to implement something better\nbut-not-quite-ssl, such as telehash, on both ends likely far outweighs the\n$30 cost for a RasPi.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/49#issuecomment-49227475.\n. From what I've read of the architecture, publish key/ID sounds like a more\ndescriptive name.\nOn Jul 19, 2014 7:45 AM, \"Todd Treece\" notifications@github.com wrote:\n@jbdatko https://github.com/jbdatko Yeah. What about switching key to\nhash? I think cookie could cause just as much confusion when sending\nHTTP requests. Or would changing the name private to something like push\nkey or publish key, and changing public key to ID be less\nconfusing? I don't think it's going to be that hard to change either way, I\njust thought the lock and key analogy was something people would understand\nright away.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/49#issuecomment-49507242.\n. @liudr Can you write up you example on your wordpress.com blog and link\nback to the phant feed? There's a lot you can do with worpress.com blogs, I\nrun two of them! This would prevent you from having to deal with Github's\ninterface.\n\nOn Thu, Nov 20, 2014 at 11:19 PM, liudr notifications@github.com wrote:\n\nHey, sorry I have been a bit busy. I am not efficient with github\noperations. Downloaded it once and completely didn't understand how it\nworked. Maybe I need a CS degree for that. I don't even know how to\nproperly open the sparkfun/phant-docs. It's just a github site, not sure\nhow to get it to display as webpages :(\nI am probably better off with simpler solutions such as posting some\nthreads on sparkfun and arduino forums. The arduino forum seems to know too\nlittle about phant. I posted there and had no reply. I am a top member\nthere so this genuinely means there is no awareness of phant on arduino\nforum. I'll try another time.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/132#issuecomment-63928976.\n. re secondary question: You'll need a hosting provider that provides you a\nshell and root access. I don't use GoDaddy, but iirc, they don't do this\nexcept for VPS. Which, if you have, then you are fine. Otherwise, I'm quite\nhappy with Digital Ocean which is $5 a month.\n\nYou only need to do this if your Arduino needs to reach a public Internet\nserver. If your Arduino is behind a NAT device, on a private network, than\nyou can run a private Phant instance on a desktop/Pi/BeagleBone/whatever\nand that will all be fine. You could make your phant server Internet\nvisible and that's going to require some NAT forwarding.\nIn short, yes you can migrate this to shared server. But the specifics of\nhow to set this up on your network will be very specific to your personal\nsituation and goals.\nOn Wed, Jan 28, 2015 at 10:12 PM, neophyte-savant notifications@github.com\nwrote:\n\nThere is a very simple answer to all of this: simply install Ubuntu!! I\nloaded up Ubuntu desktop onto a thumb drive, hit my head against a wall for\na few minutes trying to get nodejs installed and updated (finally found a\ngood repository that i didnt write down... idiot!)... and then the server\nside functioned perfectly. I need to get my arduino booted up again - ive\nbeen in perf-board mode trying to make everything a little more permanent.\nwhen i get that finished (probably next week) i will report back to this\nissue thread.\nsecondary question: once i have everything working here - can i migrate it\nto a shared server (eg. godaddy - who hosts the main website and is\nhandling the domain name etc)? Would i be better off trying to host the\nserver myself on a standard desktop computer? Even if this gets deployed\nthere wont be a huge amount of traffic - barely megabytes a day. I would\njust need godaddy to point towards my own server - which would mean working\nthrough our business' ISP more than anything else, right?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/137#issuecomment-71970305.\n. \n",
    "Nick-W": "Phant and data.sparkfun.com already support SSL; the solution is to simply not allow your requests to go over a non-SSL connection if you want to avoid leaking your private stream key.\nThere are absolutely methods which enable us to push data semi-securely over a non-SSL connection, such as using a TOTP code, or by signing requests with the private key, but they all have their own issues.  Ultimately, it's adding unnecessary complexity, and it's attempting to come up with a solution for an issue which is already solved.\nArduino devices are intended to be simple, cheap, and user-friendly, which means they aren't the most feature-rich platforms (granted, the Arduino Yun can support SSL by means of the on-board AR9331 used for the WiFi stack).  Many dev boards with an ARM processor are likely to have some form of SSL support (for example, NETMF on the FEZ or Linux on the RasPi/PcDuino/BeagleBone) if you want to stick with a one-board solution which is comparably priced.\nIf it's really a problem and you have no other option, I'd recommend implementing some kind of request proxy which handles your own layer of security.  Off the top of my head, an 'easy' 5-minute solution would be to identically seed a random number generator on both ends and XOR your entire request.  Could someone catch on to what you're doing and figure out your seed? Sure, but the effort required to implement something better but-not-quite-ssl, such as telehash, on both ends likely far outweighs the $30 cost for a RasPi.\n. ",
    "abitmore": "\nThere are absolutely methods which enable us to push data semi-securely over a non-SSL connection, such as using a TOTP code, or by signing requests with the private key, but they all have their own issues. Ultimately, it's adding unnecessary complexity, and it's attempting to come up with a solution for an issue which is already solved.\n\n@Nick-W what's the issue of \"signing requests with the private key\"? \nIt's not needed to sign the whole request, but only to sign a one-time and always increasing magic number, then include the public key, the signature and the number in the request. This will need less computation on both client and server side than the HTTPS solution. Anyway this will require users to play with cryptography in application, thus not perfect especially when a TLS/SSL termination proxy device/solution is cheap/easy to deploy.\n. ",
    "Cougar": ":-D btw, is there any opensource IFTTT-like thing available? I usually do not trust any 3rd party apps to access my accounts even if it is done using OAuth or any other limited API. I'm very happy to see here some competition to Xively ;-)\n. Thanks, @naikrovek !\n. ",
    "smonami": "Perfect, thanks!\n. ",
    "tryceattack": "any way i could stop start the other processes, if its a good idea at all?\n. oh ok thanks. so turns out port 8081 is being used. is there a way i can tell phant to not use 8081 and use some other number? and what number would i use if that matters?\n. ok i did that but, now it is saying they are both running on port 8080. i tried changing both numbers , like phant_port to 8079, keeping it at 8080, phant_telnet_port to 8082 or 8083, and it would still say both are using port 8080.\nonce i remove the .env file it goes back to 8080 and 8081.\n. phant@6.0.3\n. sweet it's running. So now i'm following the rest of the README, i opened a new command prompt, ran as administrator, and i typed telnet localhost 8082, and it is telling me telnet is not recognized as an internal and external command\nedit: nvm just did a quick google search and found my answer. wasn't a problem with the package\n. Right on! So I managed to get to the phant terminal, and i was able to create a stream with the create command. But it seems like I can't access the url with my public key. I'm probably wrong in what I'm doing, but what i did was take the url https://data.sparkfun.com/streams/ and then append the public key. I think i should be using something with my ip address and telnet port number. Or perhaps I need to do something in ruby, perl or some php?\n. hmm i tried to connect to the localhost with just http://localhost:8082, as well as the full input of keys, and i seem to be getting nothing back, it's still in the \"waiting for localhost\" stage.\n. sure\nPHANT_PORT=8080\nPHANT_TELNET_PORT=8082\n. it works now!!! thank you for all help!\n. Twas no pain with your punctual response! Good learning experience for me, not having much experience with connections\n. i just looked at some of the pull requests, Patrick seems to have what i probably need. So i'll look at that for now.\n. it works very well!\n. ok that's strange, i'm using another computer, and nothings going wrong.\n. ",
    "johncohn": "+1 for mqtt.. I use it for everything. for many things I find it easier to use than REST (eg, no need to poll for input). It's also very light weight. \n. Todd,\n   I still can't build on x64 Win 7.. I will try to test at the end of the \nweek. In the mean time, do you have a broker set up on your end that I can \ntry to hit ? \n-jc\nJohn Cohn Ph.D, \nIBM Fellow , Corporate Technical Strategy\nphone 802-578-0985\nFrom:   Todd Treece notifications@github.com\nTo:     sparkfun/phant phant@noreply.github.com\nCc:     John M Cohn/Burlington/IBM@IBMUS\nDate:   08/12/2014 10:53 AM\nSubject:        Re: [phant] Consider MQTT input (#55)\n@jsilence & @johncohn:\nI have spun up a new test server with a new (hopefully better) topic \nformat at http://phantmqtt.sparkfun.com. You can test the server by \ndownloading this Gist: \nhttps://gist.github.com/toddtreece/feb66ddef602c8ec0c1e\nYou'll need to run npm install and then node client.js from the extracted \nfolder to start the client.\nTopics\nI'm going to use PUBLIC and PRIVATE as placeholders for your keys. Replace \nthe placeholders with the hashes given to you during the creation process.\nPushing data\nPayloads should be JSON encoded, and should only include the fields you \ndefined when creating your stream.\nTopic for pushing data\ninput/PUBLIC/PRIVATE\nPush confirmations\nConfirmations about the status of pushes can be subscribed to using the \nfollowing topic.\nTopic for responses about status of pushed data\nresponse/PUBLIC/input\nLive data output\nPhant can receive data from multiple sources (HTTP, TCP, UDP, MQTT, etc), \nso if you'd like to receive the data from all sources, you can subscribe \nto the stream by using the following topic format.\nTopic for subscribing to JSON encoded payloads with all fields\noutput/PUBLIC\nIf you would like to subscribe to a specific field, you can use the \nfollowing format and replace FIELD_NAME with the name of your field.\nTopic for subscribing to a specific field\noutput/PUBLIC/FIELD_NAME\n—\nReply to this email directly or view it on GitHub.\n. So fat so good . I can connect with the broker and publish\n-jc\nJohn Cohn\n+1 802 578 0985\n\nOn Aug 12, 2014, at 4:22 PM, \"Todd Treece\" notifications@github.com wrote:\n@johncohn \nhttp://phantmqtt.sparkfun.com is the instance of phant with the broker running on port 1883. You shouldn't need to build anything if you have your own MQTT client.\n—\nReply to this email directly or view it on GitHub.\n. I am out of the office until 09/02/2014.\n\nI am out of the office until 9/2/2014 having my  turboencabulator\nrefragulated. I will not have access to email. Talk to you then. Thanks !\nNote: This is an automated response to your message  \"Re: [phant] Consider\nMQTT input (#55)\" sent on 08/21/2014 19:06:10.\nThis is the only notification you will receive while this person is away.\n. ",
    "jsilence": "Was able to connect, subscribe and publish with the WMQTT Sample client (ia92).\nThank you for implementing this protocol!\n. ",
    "bbhoss": "I'm trying to publish to \"input/PUBLIC/PRIVATE\" to no avail. The server just immediately closes the connection without cause. Can someone confirm this still works?\nThanks\n. ",
    "hollie": "I'm using the MQTT interface to receive values from a datastream on data.sparkfun.com and it works well.\nOne question: would be possible to set the 'retained' flag to data that is posted to the MQTT broker? This way a new client gets an update of the last received value from the broker upon connecting. Otherwise the client needs to wait for a new value to be posted to the broker before it receives its first value. If there are only a few values posted per day then the client is in the blue about the status of the data source for quite an extended time. The retained flag solves this. See here for some more details on this.\nRegards,\n Lieven.\n. ",
    "q2dg": "Last suggestion is interesting.\nOn the other hand: \"I'm going to close this issue, but I'll post once SSL is enabled.\"...isn't it still?\nThanks!\n. Latest commit is from 3 Nov 2015. \nMmm...mmmm\n. Still waiting...come on, guys...\n. I've found and example from Adafruit.io (https://learn.adafruit.com/adafruit-io-basics-digital-output/arduino-wifi). It subscribes Arduino (via MQTT's library) to a feed made of the orders sent from the browser to their online service. It just an idea...\n. Last commit is from Nov 2015....\n. ",
    "erniberni": "I just tried to connect to my stream at data.sparkfun.com with a mqtt client and failed\nbroker: data.sparkfun.com\nport:1883\n(no connection to broker)\nWhat I'm doing wrong ?\nedit: now I get the connection, user and password has to be filled  but no data when I subscribe to \noutput/PUBLIC/FIELD_NAME\nedit: seems to work now. I don't know what was wrong\n. After some trials with Chromium MQTT Client and also Arduino I found the MQTT broker on data.sparkfun.com very unreliable. Most times the connection breaks after a while and not all messages (changes on the channel) are submitted to the subscribed client. \nThe same test arrangement is running with broker.hivemq.com very stable. \n. I know, but the service is working. Any alternative?\n. Same question for me\n. same for me \n. @chrigui: any progress on this ?\n. ",
    "patrick--": "@toddtreece Does something not look correct in my example?\n. @toddtreece Oh okay! I was just making sure I didn't need to change anything :)\nAlso, no problem. I love stuff like this and will continue contributing!\n. @DoctorWho8  try running:\n-  npm config set registry http://registry.npmjs.org/ \n- npm install -g phant\n. @marsselo Do you have to use XML for your LabView application? I have used the LabView JSON Toolkit and it works wonderfully. \n. @lectroidmarc I was able to view websocket traffic on this stream.\nIn chrome you can view websocket traffic in devtools. \n. ",
    "gebrits": "Ok thanks. Looks interesting!\n. ",
    "zshift": "It looks good now. I noticed it does not load existing entries, it only shows new entries. Is this expected? (behavior for this is the same on chrome and firefox)\n. ",
    "DoctorWho8": "Okay group all of that worked. Right now the little guy is busy installing the pachyderm, so we're off and running. Unless something else goes wrong and confirms Murphy does work there, we're done with this issue. This is what happens when someone goes and believes that Debian for any actually maintains updated releases. (They do have a probably working one in their unstable sequence, but getting the Pi to properly install it is a nightmare.)\n. ",
    "marsselo": "I don't know much. I know that LabView Web Service work with XML files. They have one file with the user paths in system and other with the users variables, that are called in the begin of the connection.\nThe third file is the variable values, that is called to update variables in LabView.\nI discovered using LabView for iOS connected with demo server.\n. ",
    "lectroidmarc": "Ah, I see.  Is it accessible publicly?\n. As far as I know, Socket.io exposes a session id in the pages it serves that's necessary to build a ws:// url.  This is great for allowing local code to access local sockets, but it makes things problematic for 3rd parties (which is probably by design).\nWhat I'm after is a Web Socket endpoint that can be accessed by 3rd party code (aka my code :)).  Something like ws://data.sparkfun.com/output/PUBLIC_KEY.\n. I'm using JS.\nI use data.sparkfun.com because it's damn convient and I don't want to set up my own server ;).  Socket.io is indeed slick for it's fallbacks, and for the cases where you don't want outside accessible to your own web sockets, but for public access, it's not so good.\n. I'm not in a Node environment, just a simple web browser.\nIt appears that socket.io-client is connecting to you via HTTP and getting the session ID and then establishing the web socket connection with it.  That's cool.  I'll spend some time with the socket.io docs and see what's going on here.  This seems to be a surmountable problem.\n. I've made progress.  I included\n<script src=\"http://54.88.72.77/socket.io/socket.io.js\"></script>\nAnd then I could set up a traditional web socket with var connection = io('http://54.88.72.77/');\nYup, ran onto cross domain issues when I used data.sparkfun.com but 54.88.72.77 seemed to connect OK.  Now what I seem to be missing is the public_key.  I'm not getting any messages, but I never gave it the public key so I think that's fair :).  I need to figure out where it goes.\n. Ok, got it:\nfunction initWebSockets () {\n  var socket = io('http://54.88.72.77/');\n  socket.on('connect', function() {\n    socket.emit('room', public_key);\n  });\n  socket.on('data', function(data) {\n    console.log(data);\n    // do stuff...\n  });\n}\nThe load balancer stuff should fix the url vs IP thing.\n. Yes indeed\n. My web code, using mows via Sparkfun, is here: https://github.com/lectroidmarc/gsm-tracker/tree/master/web\n. Um, Chrome is throwing the following error:\n[blocked] The page at 'https://data.sparkfun.com/streams/EJJX5oWDa4Tb8WX0o6Wr' was loaded over HTTPS, but ran insecure content from 'ws://data.sparkfun.com/mqtt': this content should also be loaded over HTTPS.\nAlso, is the new mqtt web socket stuff documented anywhere?\n. Excellent, all I needed.\n. Yay!\n. Thought I'd ping this again.\nI have a new project and would like to use Web Socket support on data.sparkfun.com, but it still seems to be turned off.\n. Yeah, there's websocket functionality in Phant itself which seems to be disabled on data.sparkfun.com, hence the repeated \"Uncaught Error: Connection refused: Not authorized\" in the console.\nThen there's also #168 which seems to be telling of something else, dead server in a cluster maybe?  I do concur that all these websocket connection attempts and connection timeouts can not be good for overall reliability :/.\n. ",
    "imp-guru": "I was testing this out tonight and having trouble.  I'm a noob with these websockets but I read this thread a few times and then stepped through the js code and found that it is using mows.\nI was able to grab mows via npm and then browserify it, that seemed to work ok (I think)\nSo here is the weird part.  If I paste the following code into a chrome js console when I have a data.sparkfun.com stream page open, it subscribes great:\ne = mows.createClient(\"wss://data.sparkfun.com\");\ne.subscribe(\"output/8dX9xNz1m3sOv044oz1m\");\ne.on(\"message\", function(a, d) {\n        d = JSON.parse(d);\nconsole.log(d);\n})\nif I paste the same code in a page with my localhost environment, I get:\nUncaught Error: Invalid subscriptions - invalid qos \nIs this related to CORS as mentioned before?\n. ok so I tried including \n   \ninstead of my browserified mows and the websocket appears to work.  Not a long term solution but a good datapoint.\n. Thanks, so I was able to get my compiled version of mows to work.  I ended up stepping through the code line by line until I found a really strange thing happening.  For some reason JS was evaluating a statement that was false as true!  A little scary...  Details are here:\nhttps://github.com/mcollina/mows/issues/17\nWith this \"fix\" in place, websockets, mqtt and mows are now working :)\n. try out imp.guru for data charting :)\n. I've had pretty good luck with highcharts, no stability issues really.  Of course when I bog them down with large time series, they get pretty slow but I believe that is to be expected with any library.  \nFor the most part if you don't plan to make money off your library, you can use the free and they are stable.\nGoogle charts in another option that I wanted to consider but I didn't think that they looked as good visually as high charts and it was just so easy to get highcharts running that I have not looked back.\nI'm basing 99% of my evaluation on desktop browsers not mobile, IMO most mobile charts are lacking at this point, highcharts is just ok as well.\nAs far as controls, highchart docs are good and really since it is web based and uses jquery, there is no limit to what you can do from a integration point of view.\n. Great!  Is it just me or did this documentation just go live a little while ago?  I could have sworn that when I looked at it a few days ago there was just docs for \"Metadata\" and \"Output\" or something like that.  In any case, the improvements are great and exactly what was needed.  \nI'm curious, is your vision for phant to be mostly a backend or do you see it eventually becoming a front end with plotting, etc as well?\n. Ohh I see what happened, I was referring exclusively to the  http://phant.io/api/ content but the info that I was interested in was in http://phant.io/docs/  I just falsely assumed that API implied \"REST API\" actually the REST info is in the \"docs\" where I would have thought that the node specific things were.  Thanks for the clarification.  \nBTW, I think that keeping phant to a fully featured backend with a rich API is a good way to go, then the front end stuff can be separate development(s).  Keeps things light.\n. Thanks, I think that would help other users as well.\nRegarding pages, it would be nice if I could send a request for a \"index of pages\" lets say that I send:\nhttps://data.sparkfun.com/index/dZ4EVmE8yGCRGx5XRX1W.json\nThe response back would be a JSON array with an entry for each page including page_number, first_timestamp, last_timestamp at a minimum.  This way I can provide a UI interface for the user to select the date rage.\nYou could also make it more broad so that the JSON included the feed name and description, last_updated and call it an \"info\" request.  Currently I get that info from doing a ATOM feed request but JSON would be more efficient to parse.\n. Stream Size link shown in the stream view would be great too:\n14% (6.61 of 50 MB) remaining\n. Todd, Many thanks for all of your help, I spent a lot of time this weekend implementing the new API and webdesign for imp.guru.  You can check it out at imp.guru and enter your own feed or simply look at http://imp.guru/f1 for one one my own.  Right now we do 2 things: shorten urls for easy sharing and 2 plot the data.\nI have one question about pages and how they fill.  I noticed in the f1 sample that I linked that it is currently at 3 pages, the first page has about 250 data points while pages 2 and 3 have about 6400.  This must mean that page 1 is always filling up and then subsequent pages remain static.  So what happens when the stream starts to overflow the 50MB limit, does the last page get deleted at once or is in more of a FIFO operation with the data shifting back through the pages.\nThe reason I ask is that I'm going to try to implement local storage of data, it would make this data management easier if the contents of a page never changed then I can store data page by page.\nSorry if that is a confusing question.\n. @toddtreece Thanks, at the moment, the implementation doesn't deal well with non-numerics, it just takes the key and does a javascript parseFloat().  Whatever is the output of that function is what gets plotted.  Things like timestamps and probably GPS coords will result in some number but pure strings return NaN which I don't think highcharts would like very much.  Booleans would work if they are encoded 1 or 0 but true/false would also be NaN.  One solution for this would be if when creating a stream, the user would specify a format or type so that we can interpret the type of visualization needed. \nI think what you are saying about the rolling pages is in line with what I am thinking, when overflow occurs, the entire last page is deleted and page 1 starts filling again, that makes it pretty easy to cache the pages.\nAbout merging the code to phant-manager-http, I would love to give back to your efforts, there is one technicality that my stuff right now is not cleanly separated between the Ruby of Rails MVC and the plotting javascripts.  The other thing is that I would like imp.guru as a site to be relevant to users, if this same functionality was on data.sparkfun.com, there really wouldn't be much use for imp.guru.  If we can figure out a way to solve this, I'm all for it.\n. @mikeboich Yes, this is definitely baked into the code that I have written so far, I just have not exposed it in the front end yet.  I just deployed some improvements for browsing public streams, I'll think about this next.  One thing that I was thinking of was that users may want their server identities to be private so I would need to have a user session to do that (also in the works)\n. Thanks for the comments Todd, I like the idea of accepting JS plugins, when this infrastructure is ready I would like to be a guinea pig for writing a plot plugin based on my experience with imp-guru.\nSo I notice that I can get JSON for the index of streams using https://data.sparkfun.com/streams.json this json however does not list the public key for the stream, just \"_id\"  is there a way to get Public Keys from this information?\n. Nice, you're the man!\n. Todd, I couldn't find your info to contact you privately but I wanted to check and see if it is something that imp.guru is doing that is causing the site to 504.  I just pushed some new code yesterday that will do multiple CORS requests simultaneously.  I did share the feature on a forum so there will be some load from it.  luke@imp.guru\n. Ok, well please don't hesitate to contact me if there is something that imp.guru is doing to cause issues with the service, we're very happy with what you are doing on data.sparkfun.com!\n. I can see this as well\n. ",
    "Serasidis": "@toddtreece Thank you!\n. Thank you toddtreece for your answer. That is the problem I am taking about :-)\nI will wait for re-enabling the refresh feature.\n. ",
    "freiguy1": "remade issue in phant-docs.\n. ",
    "SilisRom": "I changed the stream directory by editing the 'serve' file \n/usr/local/lib/node_modules/phant/.bin/serve\nChange the lines from: directory: process.env.PHANT_STORAGEDIR || 'phant_streams'\nto: directory: process.env.PHANT_STORAGEDIR || '/your_directory_path/phant_streams'\n. Thanks!\nCan you tell me please in which path should I extract the content  of phantconfig-custom.tar.gz file ?\n. ",
    "dt99jay": "Yes, can understand why you'd want to discourage this on data.sparkfun.com – though it could be a nice feature for people deploying Phant elsewhere.\nI don't have an urgent use, but I'm working on an open source power sensor (which I might produce in small volumes) and am looking for suitable repositories to post the data to.\n. ",
    "kulve": "it seems that by default a page is 500k and that can be adjusted by exporting PHANT_CHUNK.\n. ",
    "surfingsteve": "Yes that should work great. \n. That is great news.  Thank you.\nStephen\nOn Thu, Aug 21, 2014 at 3:01 PM, Todd Treece notifications@github.com\nwrote:\n\n@surfingsteve https://github.com/surfingsteve this was added in #85\nhttps://github.com/sparkfun/phant/pull/85, and it's live on\nhttps://data.sparkfun.com. You can tell the server to return every Nth\nrecord by adding ?sample=10 to the output URL. Just change 10 to however\nmany records you'd like to skip.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/80#issuecomment-52991208.\n. \n",
    "jjcf89": "Sample doesn't appear to be documented, is this still a thing?\nhttp://phant.io/docs/output/http/\n. ",
    "liudr": "Good stuff. Thanks for sharing. Are they using google API for their plots?\n. If phant can provide functions to extract data according to some criteria, such as say last 1024 data points etc programmatically, then the data can be sent to some google api for graphing etc. Right now I don't understand, the page=1 seems to retrive whatever last uploaded data that have not filled up a page yet. This is a bit arbitrary. Logging data with phant is great! Simple. I think to make phant great for everyone, extracting data must be as simple as \"start=-1&length=1024&direction=-1\" as an example to extract the last 1024 data points for plotting. Or you can do timestamp=123456&length=1024&direction=1\" to extract 1024 data points with time stamp 123456 or older. \n. Thanks imp-guru. The interface looks interesting and gives me some good ideas. I see that you are using highcharts.com for your charts. What can you tell me about them? Stability and availability? I am using google charts. There are controls that I wish I could use but I'm not very familiar with all the controls yet. \n. This is great! Thanks for the hard work!\n. I know this is a closed issue. I tested, the limit works as long as it is 20 or larger. If you go to 19 or less, the server times out.\n. I was doing some test at night (11/03-11/04 2014). The sparkfun server wasn't responding every time I did json query on my web page. Sometimes it responds slowly after a few seconds and sometimes it responds quickly then other times there were no responses. I was sending the same commands by hand multiple times inside IE 11 (hate its cheesy F12 interface). Wondering if there were some server maintenance or maybe there are too much traffic.\n. Thanks! It's working now. I emptied my test stream thinking maybe the problems were caused by the fact that the stream was full. Well, I'll fill it up in a few days ;)\nFYI, I was building google chart with selections of range of time to graph and density of data points to plot. It works nicely with the gte and lte.\n. To me the less than or lt produces the same result as less and equal to or lte. I checked a few times. The gt and gte are fine.\n. Great! Thanks.\n. I am pretty much a novice in this scene so by chunk do you mean the page=number option with the data download? If I understand correctly, the pages are static once a page fills. Say if page 1 is being filled, then page 2 will always be the same whenever you download, instead of a rolling page that is one page older than the most recent upload. Also, when data exceeds limit, they are deleted one page at a time, correct? \nAny way to download more specific ranges than one page at a time, say, m pages at a time or data uploaded between timestamp x and y? I don't know how to combine two pages with javascript, still learning. Never liked the loose cannon format or syntax in an around 2000. \nThanks. \n. Thank  you Todd! I am finding #85 very useful already. Will read #90 and #91.\nAbout the user-defined metadata, allowing users to create/update/delete will be awesome! I wonder as a data logger sending data, how to get the metadata, by requesting metadata or by looking into HTTP response header? I'm pretty new to this stuff.\n. Thanks. Will metadata stuff be available some time soon?\n. Another thought:\nFor the meta-data pair issue, we can also make a separate stream for commands. Maybe the user posts a command to this stream and the logger periodically retrieves the latest command to compare with time stamp to decide whether to execute it.\n. stil190,\nDo you mean an http address sample such as\nhttp://data.sparkfun.com/output/YGv7gG4M6RfwY8d8LapN.csv?limit=10&sample=4\nThat's one of my streams. You're welcome to take a look but please create your own stream for more testing with #85 issue related options. I'm using this stream quite frequently.\n. You mean ajax calls like this?\nvar jsonData = $.ajax({url: 'https://data.sparkfun.com/output/' + public_key + '.json',\n            data: {limit: 10, sample: 4},\n            dataType: 'jsonp',\n        })\nReplace public_key with your own public key.\n. Thanks! This is not a big issue. I was only asking to see if it would be easy to implement on the server side. I can use excel or open office calc to sort the data once I get them.\n. Hey, sorry I have been a bit busy. I am not efficient with github operations. Downloaded it once and completely didn't understand how it worked. Maybe I need a CS degree for that. I don't even know how to properly open the sparkfun/phant-docs. It's just a github site, not sure how to get it to display as webpages :(\nI am probably better off with simpler solutions such as posting some threads on sparkfun and arduino forums. The arduino forum seems to know too little about phant. I posted there and had no reply. I am a top member there so this genuinely means there is no awareness of phant on arduino forum. I'll try another time.\n. ",
    "bri-huang": "I don't know what api they're using for their plots. It's pretty slick, though! It is the one critical missing component to phant -- any help / suggestions on how to implement these into phant would be great!\n. ",
    "emcniece": "Just tested - I was able to use the config tool (awesome!) and have committed successfully, but now there's a router error coming out of the app. Big step in the right direction though!\nError:\n2014-08-22T22:49:29.793374+00:00 heroku[router]: at=error code=H10 desc=\"App crashed\" method=GET path=\"/\" host=xxx.herokuapp.com request_id=xxxxxxxx-xxxx-4e1f-be94-f7172f3xxxxx fwd=\"184.71.25.166\" dyno= connect= service= status=503 bytes=\n2014-08-22T22:49:30.311711+00:00 heroku[router]: at=error code=H10 desc=\"App crashed\" method=GET path=\"/favicon.ico\" host=xxx.herokuapp.com request_id=xxxxxxxx-xxxx-4e1f-be94-f7172f3xxxxx fwd=\"184.71.25.166\" dyno= connect= service= status=503 bytes=\nProcfile:\nweb: node index.js\npackage.json:\n{\n  \"name\": \"phantconfig-custom\",\n  \"version\": \"1.0.0\",\n  \"description\": \"A custom phant server configuration generated by data.sparkfun.com\",\n  \"main\": \"index.js\",\n  \"bin\": \"./index.js\",\n  \"dependencies\": {\n    \"phant\": \"^6.6.4\",\n    \"phant-stream-csv\": \"^2.1.1\",\n    \"phant-manager-http\": \"^4.2.0\",\n    \"phant-meta-nedb\": \"^3.1.1\",\n    \"phant-keychain-hex\": \"^1.0.0\"\n    },\n  \"scripts\": {\n    \"start\": \"node index.js\"\n  },\n  \"keywords\": [\n    \"phant\",\n    \"IoT\",\n    \"SparkFun\"\n  ],\n  \"license\": \"GPL-3.0\"\n}\nindex.js:\n```\n!/usr/bin/env node\nvar Phant = require('phant'),\n    app = Phant();\nPhant.HttpServer.listen(80);\n// METADATA\n// ========\nvar meta = require('phant-meta-nedb')({\n  directory: 'phant_streams'\n});\nvar validator = Phant.Validator({\n  metadata: meta\n});\n// KEYCHAIN\n// ========\nvar keychain = require('phant-keychain-hex')({\n  keyLength: 6,\n  publicSalt: 'feasdfzsxdvea4vafa4y56ybh7nu',\n  privateSalt: 'ba7e5a7ae7aeb57b7ae57bbbdz',\n  deleteSalt: 'zbdfhdfxt7xdrdx6dx45bdxexb75f3'\n});\n// STORAGE\n// =======\nvar stream = require('phant-stream-csv')({\n  directory: 'phant_streams',\n  cap: 52428800,\n  chunk: 262144\n});\napp.registerOutput(stream);\n// INPUTS\n// ======\nvar defaultInput = Phant.HttpInput({\n  validator: validator,\n  metadata: meta,\n  keychain: keychain\n});\nPhant.HttpServer.use(defaultInput);\napp.registerInput(defaultInput);\n// OUTPUTS\n// =======\nvar defaultOutput = Phant.HttpOutput({\n  validator: validator,\n  storage: stream,\n  keychain: keychain\n});\nPhant.HttpServer.use(defaultOutput);\napp.registerOutput(defaultOutput);\n// MANAGERS\n// ========\nvar PhantManagerHttp = require('phant-manager-http')({\n  validator: validator,\n  metadata: meta,\n  keychain: keychain\n});\nPhant.HttpServer.use(PhantManagerHttp);\napp.registerManager(PhantManagerHttp);\nconsole.log(\n  \"            .-..\\n        \\/\" +\n  \"     '.\\n   .-'\\/   (   a \\\" +\n  \"\\n  \\/      (    \\,   \\\\n \\/|\" +\n  \"       '---|\\\\ =|\\n \\    \\/\" +\n  \".-\\/  \\/  | |\\n   |  \\/ \\/ \\ \\\" +\n  \"  \\   \\\\  jgs\\n   |||  |_|\" +\n  \"__\\\\n  welcome to phant.\\n\\n\"\n);\n```\n. After a bit of searching I have discovered a few nuances.\nFirst: Though I am unsure of how necessary this is, there was an error with bodyparser. /node_modules/phant-manager-http/index.js line 100 needed the extended: true parameter added to look like so:\nexp.use(bodyParser.urlencoded({ extended: true }));\nThis was only a warning, but I changed it in the process of troubleshooting so I'm not confident that it is a bug persay.\nSecond: the main index.js file needs to listen on the provided Heroku port of process.env.PORT instead of 80 (as is declared by Phant.HttpServer.listen(80); There are many examples available in reference to setting a fallback configuration like this:\nPhant.HttpServer.listen(process.env.PORT || 80, function(){\n    console.log(\"Express server listening on port %d in %s mode\", this.address().port, app.settings.env);\n});\n... but attempting to run this locally resulted in a code 8 SIGKILL with no error messages. Only once I forced the process to start at Phant.HttpServer.listen(process.env.PORT); did it work remotely.\nHope that helps somebody out there! The app is running beautifully now, thanks for your support :)\n. ",
    "jallwine": "Did you ever get this working so your streams remain intact after a restart?\n. Would it be possible to add this to the streams end point?\n. ",
    "B504now": "The sparkfun instance. So all I had to change was the network parameters. \nThanks\nBill Dickenson\n302 521 3565\nOn Monday, August 18, 2014 7:25 AM, Todd Treece notifications@github.com wrote:\nAre you using data.sparkfun.com or your own instance of phant?\n—\nReply to this email directly or view it on GitHub.\n. I think I am closer but now I have an even more vexing problem. \nI have two identical programs except for 4 changes \nPublic/Private key \none field ! (ultra)\nand of course the stream definitions \nIf I have these fields in the program and on data.sparkfun it fails. \nphant.add(\"battlvl\", TESTDATA);\n     phant.add(\"cloud\", TESTDATA);\n phant.add(\"dailyrainin\", TESTDATA);\n   phant.add(\"humidity\", TESTDATA);\n       phant.add(\"lightlvl\", TESTDATA);\n phant.add(\"lightning\", TESTDATA);   \n  phant.add(\"pressure\", TESTDATA); \n   phant.add(\"rainin\", TESTDATA);  \n phant.add(\"tempf\", TESTDATA);  \n    phant.add(\"ultra\", TESTDATA); \n    /\n   phant.add(\"winddir\", TESTDATA);  \n  phant.add(\"windgust\", TESTDATA);\n  phant.add(\"windgustd\", TESTDATA);\n  phant.add(\"windspeed\", TESTDATA);\n  phant.add(\"windspeedavg\", TESTDATA);\n/\nThe program fails with a 502 error\nif I use these \n    phant.add(\"battlvl\", TESTDATA);\n     phant.add(\"cloud\", TESTDATA);\n phant.add(\"dailyrainin\", TESTDATA);\n   phant.add(\"humidity\", TESTDATA);\n       phant.add(\"lightlvl\", TESTDATA);\n phant.add(\"lightning\", TESTDATA);   \n  phant.add(\"pressure\", TESTDATA); \n   phant.add(\"rainin\", TESTDATA);  \n phant.add(\"tempf\", TESTDATA);  \n /\n   phant.add(\"ultra\", TESTDATA); \n   phant.add(\"winddir\", TESTDATA);  \n  phant.add(\"windgust\", TESTDATA);\n  phant.add(\"windgustd\", TESTDATA);\n  phant.add(\"windspeed\", TESTDATA);\n  phant.add(\"windspeedavg\", TESTDATA);\n/\nThe program succeeds with a 200\nAny clue why ? I thought the field limit was 15 ?\nBill Dickenson\n302 521 3565\nOn Monday, August 18, 2014 7:25 AM, Todd Treece notifications@github.com wrote:\nAre you using data.sparkfun.com or your own instance of phant?\n—\nReply to this email directly or view it on GitHub.\n. I think I just did ( I Hope)\n. Just a thought before you go digging into the libraries .... could it be a transmission limit with the Xbee WiFi ? I remember something about a buffer size. Just a thought\n. https://gist.github.com/B504now/7635bde2ba652cd641a0\n. Then I did something wrong - because it's posting every few minutes correctly. \nI will send you the two programs. It is clearly failing when I add the next data field. \nBill Dickenson\n302 521 3565\nOn Thursday, August 21, 2014 9:31 PM, Todd Treece notifications@github.com wrote:\n@B504now these should both result in 400 Bad Request because the post body is empty.  The library automatically clears the saved params after you call phant.post(), so you may need to remove any other calls to phant.post() in order to log the data.\n—\nReply to this email directly or view it on GitHub.\n. Lets close this for now. I'm getting the badly formed \nBill Dickenson\n302 521 3565\nOn Friday, August 22, 2014 11:56 AM, Todd Treece notifications@github.com wrote:\n@B504now are you logging the response from the server? If so, what does it respond with?\n—\nReply to this email directly or view it on GitHub.\n. I have a bit of a clue. I noticed in your example, the actual values were at the bottom of the stream. In my program, I get that too when it works, and a series of spaces when it doesn't. So I get the badly formed request from the Xb.print, and if they are all spaces, it is !\nso I believe that somewhere around 111 characters, we are hitting a limit. later on tonight, I am going to skinny down my variable names and see if I can get it lower and retry. I am starting to suspect that phant is chewing up some major memory. \nBut go ahead and close this and I'll move to the other forum. Once I finish this round of builds I will retest with a better set of data streams. \nThanks\nBill Dickenson\n302 521 3565\nOn Friday, August 22, 2014 3:19 PM, Bill Dickenson b504now@yahoo.com wrote:\nLets close this for now. I'm getting the badly formed \nBill Dickenson\n302 521 3565\nOn Friday, August 22, 2014 11:56 AM, Todd Treece notifications@github.com wrote:\n@B504now are you logging the response from the server? If so, what does it respond with?\n—\nReply to this email directly or view it on GitHub.\n. Thanks. My apologies. I'll post to the right place next time. \nBill Dickenson\n302 521 3565\nOn Friday, August 22, 2014 11:42 AM, Todd Treece notifications@github.com wrote:\nClosed #96.\n—\nReply to this email directly or view it on GitHub.\n. Hmmm. I don't think so since it's posting very nicely to my server here. Give me an example ? \nThanks\nBill Dickenson\n302 521 3565\nOn Wednesday, August 27, 2014 11:20 AM, Toni Klopfenstein notifications@github.com wrote:\n@B504now it looks like your example sketch is missing several lines of code for working with the Xbee Wifi modules (between this and issue #88). I'd recommend checking out this tutorial section here on logging using phant and the XBee Wifi modules. Keep in mind if you changed your hardware around or are using a different set up, that may also be affecting your code's functionality. \n—\nReply to this email directly or view it on GitHub.\n. The gateway error is a side effect of the problem with phant. I posted some new code this am. It's not the xbee thats causing the problem. But I have been through it , ran it, etc so if you see something I don't, tell me and I'll look. Thanks\nBill Dickenson\n302 521 3565\nOn , Bill Dickenson b504now@yahoo.com wrote:\nHmmm. I don't think so since it's posting very nicely to my server here. Give me an example ? \nThanks\nBill Dickenson\n302 521 3565\nOn Wednesday, August 27, 2014 11:20 AM, Toni Klopfenstein notifications@github.com wrote:\n@B504now it looks like your example sketch is missing several lines of code for working with the Xbee Wifi modules (between this and issue #88). I'd recommend checking out this tutorial section here on logging using phant and the XBee Wifi modules. Keep in mind if you changed your hardware around or are using a different set up, that may also be affecting your code's functionality. \n—\nReply to this email directly or view it on GitHub.\n. ",
    "coloradobum": "Thanks Todd- that did the trick!\n. ",
    "Amakaruk": "Thank you Todd - we really appreciate it.\n. Thanks so much Todd\nOn Thu, Aug 21, 2014 at 2:58 PM, Todd Treece notifications@github.com\nwrote:\n\nI'm going to close this one, but let me know if you have any other issues.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/94#issuecomment-52983483.\n. \n",
    "ToniCorinne": "@B504now it looks like your example sketch is missing several lines of code for working with the Xbee Wifi modules (between this and issue #88). I'd recommend checking out this tutorial section here on logging using phant and the XBee Wifi modules. Keep in mind if you changed your hardware around or are using a different set up, that may also be affecting your code's functionality. \n. Hey there - SparkFun employee here. We are actually in the process of getting a new developer up to speed with phant. Apologies that it's taking a while- there's several large code projects in the work here on our backend, so this is going slower than expected. \n. Our IT team is slowly working on cleaning up features on phant on our backend. They will be looking at more issues/feature requests on GitHub soon! \n. ",
    "mikeboich": "@imp-guru:  Have you considered taking an optional url, so that those who are running their own phant servers could also use your site?\n. ",
    "dpjanes": "I noticed this because I was getting duplicate timestamps on my computer. You could of course - as an alternative - define that all timestamps have to be unique but this is not only a hack but could lead to other issues.\n. It could be a configuration setting?\n. There should be a way that you are guaranteed to download the data exactly as it is stored on the server. If GUIDs are used, you don't get an ordering when there's a timestamp collision.\n. I think the _guid + \"get things after this _guid\" option works. My main concern is being able to download the complete stream in order, I think this basically satisfies this without adding any assumptions as to the contents of what the an ID would hold.\n. ",
    "ghost": "In case u r using mongodb. Todd has solved this, use latest phant ver.\n. Actually this kind failure I had at some other stage but just saw I saw now u r right.\nExhibit of success:\nhttp://localhost:8080/output/ABCDPUBLICKEYEFGH/asdasd/\nExhibit of server crash:\nhttp://localhost:8080/output/ABCDPUBLICKEYEFGH/asdasd/asdasd\n. @toddtreece error of this is:\nphant/node_modules/phant/lib/http_output.js:54\n    match.fn(req, res, match);\n          ^\nTypeError: Cannot call method 'fn' of undefined\n. @toddtreece Todd even on website of data.sparkfun.com using same URL I see:\n502 Bad Gateway\nThe server returned an invalid or incomplete response.\n. great!\n. simple things came be damn in the ass :)\n. It work fine. I just tested multiple / / / and server returns 404 indeed! Thanks for making this great!\nhttp://localhost:8080/output/ABCDPUBLICKEYEFGH/asdasd/asdasda/sdasd/asdsda\n. Thx!\nJust to add you must create at least one Create a Data Stream first in order to supplicate the issue.\n. Thx! wait forward for a fix.\n. Hi Todd, any update yet?\n. Thank you Todd, no rush just it will be great once solved.\n. Great! hopefully node-mongodb-native will not have some side affects influencing other features to fail? Wait forward for your new release to give it a try.\nThx!   \n. That is fantastic!  do I'm going out now, please give me time to verify if all is ok?\n. @toddtreece Change you made have definitely improved several things such speed you mentioned, better database structure etc.. Thanks everything woks just great for now. \n. @toddtreece I'm modifying whole phant module to fit my needs. Basically a solution for a large scale embedded industries world wide (military, med. etc..). As for licence GPL v3 I had a question if my changer and implementation  would conflict? or either I should use reference of phant code intact?\n. @toddtreece Hi, I have took some time to read GPL v3 its clear now for me. This can be closed.\n. @toddtreece Is there possibility to get app build similar to phant with some minor implementations? if yes A)how long it will take to get job done and B)what would be the price of?\n. closing this question.\n. I had similar issues and had to include the startup command with nohup and a null log file.  Here is my command.  \nnohup phant >/dev/null 2>&1 &\n. for reference is my log associated with curl\n| % Total | Total Data | % Recieved | Received Data | % Xferd | Xferd Data | Average Speed Dload | Average Speed Upload | Time Total | Time Spent | Time Left | Speed |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|  | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | --:--:-- | --:--:-- | --:--:-- |\n|  | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | --:--:-- | --:--:-- | --:--:-- |\n|  | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | --:--:-- | 0:00:01 | --:--:-- |\n| 100 | 12811 | 0 | 12811 | 0 | 0 | 5439 | 0 | --:--:-- | 0:00:02 | --:--:-- | 5437 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 34646 | 0 | --:--:-- | 0:00:04 | --:--:-- | 34657 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 27767 | 0 | --:--:-- | 0:00:05 | --:--:-- | 27769 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 23168 | 0 | --:--:-- | 0:00:06 | --:--:-- | 24506 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 19875 | 0 | --:--:-- | 0:00:07 | --:--:-- | 25334 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 17402 | 0 | --:--:-- | 0:00:08 | --:--:-- | 22348 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 15476 | 0 | --:--:-- | 0:00:09 | --:--:-- | 0 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 13934 | 0 | --:--:-- | 0:00:10 | --:--:-- | 0 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 12672 | 0 | --:--:-- | 0:00:11 | --:--:-- | 0 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 11619 | 0 | --:--:-- | 0:00:12 | --:--:-- | 0 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 10728 | 0 | --:--:-- | 0:00:13 | --:--:-- | 0 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 9964 | 0 | --:--:-- | 0:00:14 | --:--:-- | 0 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 9301 | 0 | --:--:-- | 0:00:15 | --:--:-- | 0 |\n| 100 | 136k | 0 | 136k | 0 | 0 | 8721 | 0 | --:--:-- | 0:00:16 | --:--:-- | 0 |\ncurl: (18) transfer closed with outstanding read data remaining\n. ",
    "piettetech": "Hi Todd,\nI am using a spark.core and data.sparkfun.com\nHere is a data stream of what I am sending --\nPOST /input/4JwJOg8xV9CLG4wGM8Zp HTTP/1.1\nUser-Agent: SparkCoreLibrary\nHost: data.sparkfun.com\nConnection: close\nPhant-Private-Key: b5y58raboNC5YmyY0rEl\nContent-Type: application/x-www-form-urlencoded\nContent-Length: 5\nint=2\nI have confirmed this with sending the data to a local machine on my\nnetwork.\nI wait for the response from data.sparkfun.com and this what I receive -\nHTTP/1.1 200 OK\nAccess-Control-Allow-Origin: *\nAccess-Control-Allow-Methods: GET,POST,DELETE\nAccess-Control-Allow-Headers: X-Requested-With, Phant-Private-Key\nContent-Type: text/plain\nX-Rate-Limit-Limit: 300\nX-Rate-Limit-Remaining: 298\nX-Rate-Limit-Reset: 1412881140.715\nDate: Thu, 09 Oct 2014 18:44:06 GMT\nConnection: close\nTransfer-Encoding: chunked\nSet-Cookie: SERVERID=phantworker4; path=/\na\n1 success\n0\nNow, If you look at my data stream\nhttps://data.sparkfun.com/streams/4JwJOg8xV9CLG4wGM8Zp\nYou will notice 'int' skips from \"1\" to \"3\" item 2 is missing, the remaining\nare ok.\nIn the response there is no indication that int=2 did not get processed.\nScott\nFrom:  Todd Treece notifications@github.com\nReply-To:  sparkfun/phant\nreply@reply.git\nhub.com\nDate:  Thursday, October 9, 2014 1:32 PM\nTo:  sparkfun/phant phant@noreply.github.com\nCc:  Scott Piette scott.piette@gmail.com\nSubject:  Re: [phant] Data not posting with successful response message\n(#111)\nCan you give me more info about your setup? Can you give me an example of\nthe data you are posting? Are you using a local install or\ndata.sparkfun.com?\n‹\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/111#issuecomment-58564562 .\n{\"@context\":\"http://schema.org\",\"@type\":\"EmailMessage\",\"description\":\"View\nthis Issue on \nGitHub\",\"action\":{\"@type\":\"ViewAction\",\"url\":\"https://github.com/sparkfun/ph\nant/issues/111#issuecomment-58564562\",\"name\":\"View Issue\"}}\n. Hi Todd, everything is working now.  I modified my code and don't experience the problem any more.\nThanks!\n. Good Morning Todd,\nI was trying to locate the Phant API response codes so I can code our\nsoftware to it.  I can't seem to find them online.\nI have seen \"a\\n1 success\\n\\n0\" and \"37\\n0 two values were sent for same\nfield: \\n\\n0\"\nI am the developer for the Open Source Bee Hive Project working with Aaron\nMakaruk and trying to finish up our implementation.\nThanks for your help.\nScott\nFrom:  Todd Treece notifications@github.com\nReply-To:  sparkfun/phant\nreply@reply.git\nhub.com\nDate:  Thursday, October 9, 2014 1:32 PM\nTo:  sparkfun/phant phant@noreply.github.com\nCc:  Scott Piette scott.piette@gmail.com\nSubject:  Re: [phant] Data not posting with successful response message\n(#111)\nCan you give me more info about your setup? Can you give me an example of\nthe data you are posting? Are you using a local install or\ndata.sparkfun.com?\n‹\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/111#issuecomment-58564562 .\n{\"@context\":\"http://schema.org\",\"@type\":\"EmailMessage\",\"description\":\"View\nthis Issue on \nGitHub\",\"action\":{\"@type\":\"ViewAction\",\"url\":\"https://github.com/sparkfun/ph\nant/issues/111#issuecomment-58564562\",\"name\":\"View Issue\"}}\n. Hi Todd,\nThe problem only occurred once.  I am unable to replicate it.\nI asked for a list of the API error codes, is that something you can provide\nor point me to where I can find them.\nThanks,\nScott\nFrom:  Todd Treece notifications@github.com\nReply-To:  sparkfun/phant\nreply@reply.git\nhub.com\nDate:  Monday, October 13, 2014 2:25 PM\nTo:  sparkfun/phant phant@noreply.github.com\nCc:  Scott Piette scott.piette@gmail.com\nSubject:  Re: [phant] Data not posting with successful response message\n(#111)\n@mtnscott https://github.com/mtnscott  I can't seem to replicate this\nissue by sending the same request using curl.  Are you sure there isn't a\nproblem with the library you are using?\n‹\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/111#issuecomment-58949483 .\n{\"@context\":\"http://schema.org\",\"@type\":\"EmailMessage\",\"description\":\"View\nthis Issue on \nGitHub\",\"action\":{\"@type\":\"ViewAction\",\"url\":\"https://github.com/sparkfun/ph\nant/issues/111#issuecomment-58949483\",\"name\":\"View Issue\"}}\n. Excellent, thanks!\nFrom:  Todd Treece notifications@github.com\nReply-To:  sparkfun/phant\nreply@reply.git\nhub.com\nDate:  Monday, October 13, 2014 3:38 PM\nTo:  sparkfun/phant phant@noreply.github.com\nCc:  Scott Piette scott.piette@gmail.com\nSubject:  Re: [phant] Data not posting with successful response message\n(#111)\n@piettetech https://github.com/piettetech  for plain text, there is only\nsuccess: 1 and failure: 0 with a human readable message\nThe other characters are a bug in phant or the client lib.\n‹\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/111#issuecomment-58958795 .\n{\"@context\":\"http://schema.org\",\"@type\":\"EmailMessage\",\"description\":\"View\nthis Issue on \nGitHub\",\"action\":{\"@type\":\"ViewAction\",\"url\":\"https://github.com/sparkfun/ph\nant/issues/111#issuecomment-58958795\",\"name\":\"View Issue\"}}\n. Yes, data.sparkfun.com\n. Just tried again today in case I was wrong.  Still just returns to the manage stream page and does not delete the stream.\n. Thanks Todd, that link takes care of my need for now.\n. Closing issue as it is a duplicate.\n. ",
    "mtnscott": "I send this to data.sparkfun.com -\nPOST /input/4JwJOg8xV9CLG4wGM8Zp HTTP/1.1\nUser-Agent: SparkCoreLibrary\nHost: data.sparkfun.com\nConnection: close\nPhant-Private-Key: b5y58raboNC5YmyY0rEl\nContent-Type: application/x-www-form-urlencoded\nContent-Length: 5\nint=2\nI receive this response -\nHTTP/1.1 200 OK\nAccess-Control-Allow-Origin: *\nAccess-Control-Allow-Methods: GET,POST,DELETE\nAccess-Control-Allow-Headers: X-Requested-With, Phant-Private-Key\nContent-Type: text/plain\nX-Rate-Limit-Limit: 300\nX-Rate-Limit-Remaining: 298\nX-Rate-Limit-Reset: 1412881140.715\nDate: Thu, 09 Oct 2014 18:44:06 GMT\nConnection: close\nTransfer-Encoding: chunked\nSet-Cookie: SERVERID=phantworker4; path=/\na\n1 success\n0\nBut the data was not in the stream when I checked.\n. I understand the HTTP response, but what is the 'a' before the '1 success'?  I noticed on another error (where I submitted the same field twice) it was a '37'.\n. ",
    "andygock": "@toddtreece @piettetech @mtnscott \nHi,\nDo you any of you know the cause of the \"a\\n1 success\\n\\n0\" response from the server? I am getting that response each and every time I see a response. It could also be \"a\\r\\n1 success\\r\\n\\r\\n0\", I didn't really check byte-by-byte.\nI'm creating the POST payload with Sparkfun's phant-arduino library, submitting via client.print(phant.post()) and my \"client\" library is from https://github.com/esp8266/Arduino\nThanks\n. ",
    "jmsaavedra": "...and on third reboot they are back -- i believe i was temporarily running a duplicate installation of Phant on my AWS box (was playing with compiling my own mods)\nI'm using forever to keep Phant up (seems like once ever 12 - 24hrs i would get a crash), and have it pointed to the correct instance now, so all green here now.\nThanks for the work, SF Phant team -- using this for an IOT class at the MFA Design and Technology program at Parsons School for Design in NYC. http://teaching.jos.ph/iotF14\n. ",
    "Zppylock": "This happens to me as well. I usually get a \"net::ERR_INCOMPLETE_CHUNKED_ENCODING\" when it occurs. I think this is a server issue? \n. ",
    "jma89": "Any luck finding a misbehaving row?\nIt's still giving me a fun time trying to pull data out.\n. All is good now. Thanks!\n. ",
    "stil190": "I am new to GitHub.  Collecting some data with my Arduino and Phant.  Seems this thread answers some of the questions about what I would like to do.  However I am not able to access any of the examples.  Any suggestions how to see the examples in thread #85?\n. Thanks \nI would like to see how you put the filters (ie... Limit) into the Ajax statement. I am unable to open the links in 85. \nHope this makes sense. \nThanks for ur reply. \nSent from my iPhone\n\nOn Dec 11, 2014, at 7:28 PM, liudr notifications@github.com wrote:\nstil190,\nDo you mean an http address sample such as\nhttp://data.sparkfun.com/output/YGv7gG4M6RfwY8d8LapN.csv?limit=10&sample=4\nThat's one of my streams. You're welcome to take a look but please create your own stream for more testing with #85 issue related options. I'm using this stream quite frequently.\n—\nReply to this email directly or view it on GitHub.\n. Thanks.  That is exactly what I was needing to understand.  Appreciate the help.\n      From: liudr notifications@github.com\n To: sparkfun/phant phant@noreply.github.com \nCc: stil190 shepherd_joe@yahoo.com \n Sent: Thursday, December 11, 2014 11:24 PM\n Subject: Re: [phant] How do we request a specific amount of data from phant? (#126)\n\nYou mean ajax calls like this?        var jsonData = $.ajax({url: 'https://data.sparkfun.com/output/' + public_key + '.json',\n            data: {limit: 10, sample: 4},\n            dataType: 'jsonp',\n        })\nReplace public_key with your own public key.—\nReply to this email directly or view it on GitHub. \n. ",
    "StereotypicalSquirrel": "Phew! My most recent data point is currently 2014-11-04T03:00:03.520Z - I kept meaning to back up.\n. Is there any update on when the migration will be complete? I could really do with getting a copy of my data\n. OK, Thanks.  I appreciate the response.\n. @toddtreece Thanks, will look into it now.  The column order of the CSV data has swapped (used to be alphabetical) so I need to change my gnuplot scripts.\n. @toddtreece I just modified my gnuplot scripts and Yes, it's all there!\n. ",
    "SLPhant": "Thank you, all my data survived in tact. I very much appreciate this service you provide!\n. ",
    "annemukiri": "My public key is Ajgj8Q4EdoCbdpawArrb\n. ",
    "DanOBrien": "Awesome, that did the trick!  Thanks!\n. ",
    "lironhef": "yes, it seems that they have cancel it, or maybe just have a problem.\nI was surprised too. \n. ",
    "git-hub-user": "I observe the same here. Filters do not seem to have any effect. Neither on our own instance of Phant, nor on public streams. for example, following the Phant io documentation, I would expect this to work:\nhttps://data.sparkfun.com/streams/4Jr1NG5a80t7X06yqKmO?eq[outdoortemp]=71.6\nbut does show all data.\nOn the other hand, \nhttps://data.sparkfun.com/streams/4Jr1NG5a80t7X06yqKmO?gt[outdoortemp]=71.0\nreturns HTTP 502 Bad Gateway.\nVery surprising that this basic functionality just doesn't work.. OK, think I found it. Since the examples in the documentation, like https://data.sparkfun.com/output/xROQyrNEMoU6xQA2wro1?grep[humidity]=2952$, return \n\n\"no data has been pushed to this stream\"\n\nI looked for other public streams. But the home page of a stream does not look at the query string. Change /streams/ to output and your filters will work. For example:\non public streams. for example, following the Phant io documentation, I would expect this to work:\nhttps://data.sparkfun.com/output/4Jr1NG5a80t7X06yqKmO?eq[outdoortemp]=71.6\nhttps://data.sparkfun.com/output/4Jr1NG5a80t7X06yqKmO?gt[outdoortemp]=71.0\nYou will get CSV by default, but can change this by specifying a format before the query string, like in: \nhttps://data.sparkfun.com/output/4Jr1NG5a80t7X06yqKmO.json?eq[outdoortemp]=71.6\nThe 502 Bad Gateway occurs frequently on the public server, but seems unrelated.\n. ",
    "franko553": "I am having the same issue.\nIs there a fix for this or a way to vote for this issue?\n. ",
    "rvnash": "Sorry franko,\nIt has been some long time since I submitted the issue and I have never\nreceived a satisfactory response. I moved on and rolled my own phant-like\nserver more suited to my needs. Good luck.\n- Rich\n- Richard Nash\nOn Thu, Jul 16, 2015 at 8:55 AM, franko553 notifications@github.com wrote:\n\nI am having the same issue.\nIs there a fix for this or a way to vote for this issue?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/136#issuecomment-121948444.\n. \n",
    "erikhallqvist": "Sorry about this and not being responsive to Phant issues. We have a new (for Phant, not new to SparkFun) developer digging into Phant and he will have this on his task list. It'll be a while longer before he gets to it, sadly, as he's out on vacation for a few more weeks.  \nPlease keep submitting issues as you run in to them, as we're about to give Phant some serious love again.\n. I think in the past, external feature/enhancement requests have been filed as issues, which isn't exactly optimal, but it does keep everything in the same place. I'm not sure I want to make decisions on behalf of the new guy responsible before he's got his workflow going, so if you could hold out another month or so (or if you think you're going to forget, maybe submit an issue), that'd be helpful.  \nI'll make sure to talk to the dev and the rest of the team about what we wants to do about feature requests once he gets back to work, though.\n. ",
    "blacktigersoftware": "erikhallqvist - where can I put enhancement requests.  I would've PM'd you, but I can't..... If Phant is going to  get some love, would like to submit a request... \n. Build just finished.  phant appears to be running fine.\nsteps I took.  Not optimal, as I got the wrong version of node.js, but still this is all the steps I took (from memory).  Should be cleaned up and tested for real.... :)\ninstall Ubuntu Server 14.04.02 x64 with only SSL selected\nsudo apt-get update\nsudo apt-get install nodejs\nsudo apt-get install npm\nsudo npm install -g phant\ncd ~\nmkdir tmpbuild\ncd tmpbuild\nwget https://nodejs.org/dist/v0.12.7/node-v0.12.7.tar.gz\ngunzip nodejs.org/dist/v0.12.7/node-v0.12.7.tar.gz\ntar -xf nodejs.org/dist/v0.12.7/node-v0.12.7.tar\ncd node-v0.12.7\n./configure\nmake\nsudo make install\nphant &\n. line numbers might not match up with what you got.  I had to rebuild node.js for my machine.  The only thing that was happening was that I was posting data from a device at the time.  I believe the real bug is ECONNRESET needs to be handled appropriately and not crash the service.\n. ",
    "DanwithArduino": "I have no idea what i changed, but i now sort of have a connection to the telnet. However, the formatting is quite messed up (with the character elephant) and all character key strokes are automatically entered, which gives an unrecognized input error. IE: typing any key is registered as if i hit enter right after i hit the key. The local http host is giving the expected 404 \"Expecting URLs starting with /input or /output\" message. \n. So i see the package.json was updated to 6.8, but im getting the same error problem. Here is a screenshot of the install and telnet launch, and the telnet response\n\n\nif anyone has any ideas, and general help for how to port this over to a shared server someplace, i would greatly appreciate it. \nthanks\n. I got a 404 error. I ran \"npm uninstall -g phant\" then redid the installation, same result. Using chrome. \n. still getting a 404 unfortunately. \n. There is a very simple answer to all of this: simply install Ubuntu!! I loaded up Ubuntu desktop onto a thumb drive, hit my head against a wall for a few minutes trying to get nodejs installed and updated (finally found a good repository that i didnt write down... idiot!)... and then the server side functioned perfectly. I need to get my arduino booted up again - ive been in perf-board mode trying to make everything a little more permanent. when i get that finished (probably next week) i will report back to this issue thread. \nsecondary question: once i have everything working here - can i migrate it to a shared server (eg. godaddy - who hosts the main website and is handling the domain name etc)? Would i be better off trying to host the server myself on a standard desktop computer? Even if this gets deployed there wont be a huge amount of traffic - barely megabytes a day. I would just need godaddy to point towards my own server - which would mean working through our business' ISP more than anything else, right? \n. Wow thanks for the quick/late night response. At some point this will go live and i'll need internet connectivity. i'll cross that bridge when it comes i guess. thanks for the note on digital ocean - godaddy wants $30/mo. \n. SOLVED: skip to end\nWent for broke and tried to install on ocean digital, says no such file or directory when running \"phant\". i ran the nodejs install as per the ocean digital page here: https://www.digitalocean.com/community/tutorials/how-to-install-node-js-on-an-ubuntu-14-04-server\nis this version of node too out of date? (10.25 vs 10.36)\n\nedit: \nran  the node install again, this time following an in-terminal prompt. now typing phant gives this:\n\ngoing to the IP of my stream :8080 yields \"webpage not available\"\nEDIT:\nreinstalled NODE from https://github.com/joyent/node/wiki/installing-node.js-via-package-manager , and now everything works. i went to my ip :8080 and it loaded the config screen etc. just need to test with my arduino but i think this git issues job is done. assuming im not missing something and i can go about implementing my streams as i did on my initial testing with sparkfun, this was way easier than i was making it. instructions readme should be updated to say \"forget windows, use linux on your desktop or go to a shared server host running linux\". \n. So i just spent the last few hours, in addition to last night, trying some troubleshooting. \nI can access the HTTP side to create my streams etc, so i made my stream and edited the contents of my working code. \nThe arduino-side  code im working off of is from the tutorial here: https://learn.sparkfun.com/tutorials/pushing-data-to-datasparkfuncom\nI've tried changing the library for the SFE_CC3000 to use port 8080, and i've tried changing the \"if ( !client.connect(server, 80) )\" to 8080. I've tried having the http:// in the server entry, without it, with \"/input\", and every single iteration/combination of the above. \nFor a verifcation that the problem is with the server connection, i changed my working code with data.sparkfun.com by mispelling the server - it resulted in the same error. \nI've experemented with cnaging the IP_ADDR_LEN for the length of the IP address in bytes from the default 4, to one above and one below. Still getting error 4, TCP. \nthanks for any help\nEDIT:\nI tried running the default Sparkfun CC_3000 web client test example from their library, and i got the same TCP error. The example worked on other websites. \n. So i changed my code from the server being a \"char\" to IPAddress, but its still failing. the following is my latest attempt to get this running \n```\ninclude \ninclude \ninclude \n//#include \ndefine CC3000_INT      2   // Needs to be an interrupt pin (D2/D3)\ndefine CC3000_EN       7  // Can be any digital pin\ndefine CC3000_CS       10  // Preferred is pin 10 on Uno\ndefine IP_ADDR_LEN     4   // Length of IP address in bytes\n// WiFi Constants //\n////////////////////\nchar ap_ssid[] = \"HOME-61B2\";                  // SSID of network\nchar ap_password[] = \"mypassword\";          // Password of network\nunsigned int ap_security = WLAN_SEC_WPA2; // Security of network\n// ap_security can be any of: WLAN_SEC_UNSEC, WLAN_SEC_WEP,\n//  WLAN_SEC_WPA, or WLAN_SEC_WPA2\nunsigned int timeout = 45000;             // Milliseconds\nIPAddress server = (###,236,2#1,#98);      // Remote host site \n// Initialize the CC3000 objects (shield and client):\nSFE_CC3000 wifi = SFE_CC3000(CC3000_INT, CC3000_EN, CC3000_CS);\nSFE_CC3000_Client client = SFE_CC3000_Client(wifi);\n/////////////////\n// Phant Stuff //\n/////////////////\nconst String publicKey = \"mypublickey\";\nconst String privateKey = \"myprivatekey\";\nconst byte NUM_FIELDS = 4;\nconst String fieldNames[NUM_FIELDS] = {\"inches\", \"name\", \"photo\",\"switch\"};\nString fieldData[NUM_FIELDS];\n//sensor info\nconst int photoPin=0;\nint light;\nconst int sonicPin=4;\nlong sensor,distance;\nconst int switchPin = 10;\n//string name line itmes\nString name = \"0000\";\nboolean newName1 = true;\n//post timer info\nint countdown = 0; //when countdown reaches 0 repost\nunsigned long\nsketchTime = 0L; //CPU miliseconds since last post\nlong previousMillis = 0;\nlong interval = 10000;  \nvoid setup()\n{\n Serial.begin(115200);\n// Setup Input Pins:\n pinMode(sonicPin,INPUT);\n// Set Up WiFi:\nSerial.println(F(\"=========== Ready to Stream ===========\"));\n Serial.println(F(\"Press the button (D3) to send an update\"));\n Serial.println(F(\"Type your name, followed by '!' to update name\"));\n}\nvoid loop()\n{\n// Read sensor\nsensor=pulseIn(sonicPin,HIGH);\ndistance=sensor/147;\nlight=analogRead(photoPin);\ntime();\n}\nvoid time()\n{\n unsigned long currentMillis = millis();\nif(currentMillis - previousMillis > interval) {\n // save the last time you blinked the LED\n previousMillis = currentMillis;\n setupWiFi();\n Serial.print(F(\"Inches: \"));\n Serial.println(distance);\n Serial.print(F(\"Lumens\"));\n Serial.println(light);\n dataPost();\n wifi.disconnect();\n}\n}\nvoid dataPost()\n{\n // Gather data:\nfieldData[0] = String(distance);\n fieldData[1] = String(digitalRead(switchPin));\n fieldData[2] = name;\n fieldData[3] = String (light);\n// Post data:\n Serial.println(\"Posting!\");\n// Make a TCP connection to remote host\nif ( !client.connect(server, 8080) ) //removed \", 80\"\n{\n // Error: 4 - Could not make a TCP connection\n Serial.println(F(\"Error: 4\"));\n}\n// Post the data! Request should look a little something like:\n// GET /input/publicKey?private_key=privateKey&light=1024&switch=0&time=5201 HTTP/1.1\\n\n// Host: data.sparkfun.com\\n\n// Connection: close\\n\n// \\n\nclient.print(\"GET /input/\");\nclient.print(publicKey);\nclient.print(\"?private_key=\");\nclient.print(privateKey);\nfor (int i=0; i<NUM_FIELDS; i++)\n{\n client.print(\"&\");\n client.print(fieldNames[i]);\n client.print(\"=\");\n client.print(fieldData[i]);\n}\nclient.println(\" HTTP/1.1\");\nclient.print(\"Host: \");\nclient.println(server);\nclient.println(\"Connection: close\");\nclient.println();\nwhile (client.connected())\n{\n if ( client.available() )\n {\n char c = client.read();\n Serial.print(c);\n }\n}\nSerial.println();\n}\nvoid setupWiFi()\n{\n ConnectionInfo connection_info;\n int i;\n// Initialize CC3000 (configure SPI communications)\n if ( wifi.init() )\n {\n Serial.println(F(\"CC3000 Ready!\"));\n }\n else\n {\n // Error: 0 - Something went wrong during CC3000 init!\n Serial.println(F(\"Error: 0\"));\n }\n// Connect using DHCP\n Serial.print(F(\"Connecting to: \"));\n Serial.println(ap_ssid);\n if(!wifi.connect(ap_ssid, ap_security, ap_password, timeout))\n {\n // Error: 1 - Could not connect to AP\n Serial.println(F(\"Error: 1\"));\n }\n// Gather connection details and print IP address\n if ( !wifi.getConnectionInfo(connection_info) )\n {\n // Error: 2 - Could not obtain connection details\n Serial.println(F(\"Error: 2\"));\n }\n else\n {\n Serial.print(F(\"My IP: \"));\n for (i = 0; i < IP_ADDR_LEN; i++)\n {\n Serial.print(connection_info.ip_address[i]);\n if ( i < IP_ADDR_LEN - 1 )\n {\n Serial.print(\".\");\n }\n }\n Serial.println();\n }\n}\nint freeRam () {\n extern int __heap_start, *__brkval;\n int v;\n return (int) &v - (__brkval == 0 ? (int) &__heap_start : (int) __brkval);\n}\n```\n. ok i think i finally did it. (and in the process fried one SFE_3000 wifi board from accidentally shocking it with my finger - good thing i have two...)\nI downloaded the repository from github for ver6.8. Then i went through and changed any reference i could possibly find to the port being 8080 to 80. I did not change the telnet port. I also changed the name in the package.json to \"phantdeftest\", as in phant default test. phantgittest might have made more sense, but whatever. \nI then followed the directions from github here: https://docs.npmjs.com/cli/publish to install it to the npm registry. \ninstallation to npm was done in W7 via node.js command prompt after i navigated to the local file position - all the way down to phant-master\nOne note for the noobs out there like me, the name must be all lower case. \nif anyone needs a port 80 phant, it can be found on npm at phantdeftest. \nUnfortunately, it seems to hang up an awful lot when posting. It'll start to type out \"http\" in the serial monitor then it locks up. I dont think that it was doing this when connected to the data.sparkfun server although it did occasionally lock up there as well but only after a few days. Im currently pushing data every 90seconds, when i was using the sparkfun server it was more like very 15minutes (which is where it will be when deployed). I wonder if Digital Ocean is too slow?\n\n. Was able to get that sorted. I had seen the vagrant file but it seemed harder to setup than the method i used. Ultimately I'm sure I'm wrong. In any event, my problem now is that it seems to hangup - where it will do several successful posts, but then the serial monitor reports \"posting!\", the next line should be \"http\" etc etc, but it just hangs up typing out an \"ht\" or \"htt\" etc. The message from the terminal when this happens is above, so i dont think that it is a problem with the arduino in either my hardware or the libraries? \n. Fair enough for the Vagrant - i didnt really understand it so i stuck with what i had a little bit of a grasp on. \nI tried using the config tool but the json that downloads with it reported version 1, instead of 6.8. This is why i downloaded the git as a zip and then went about changing the references in there (i think there are really only two that need to be changed, im assuming the \"test\" folder is not needed if you're not testing). My main fear now is that if i start posting the data and there is a good upgrade i might lose the data?\nIt looks like the arduino library on github uses POST, whereas the example uses GET. I'll load it up and see if it works better for me. \nEDIT: \nI think due to a complication with adafruit CC3000 and SFE library, having an SD card in the slot does some weird stuff. I did have this problem earlier and removing it solved it. Everything is working as it should now, as far as i can tell. \n. unfortunately no. have you found the bug yet?\n. ",
    "dctsystems": "This threw me too - I'm not a regular low level http. The clue is \"Transfer-encoding: chunked\".\n\"a\" means theres 10 bytes to follow, which is the success message. Then the 0 means there's 0 bytes no the final line http://en.wikipedia.org/wiki/Chunked_transfer_encoding\n. ",
    "StuartHickey": "Hi, I'm having something similar with a few errors being thrown when I start my Phant server. Did you get to the bottom of this issue? \n. ",
    "miketeachman": "+1\n. ",
    "jywarren": "+1 - this would be super useful!\n. I'd attempt changes/PR myself, but wasn't able to find the relevant code; https://github.com/sparkfun/phant/blob/master/lib/http_output.js doesn't seem to list the metadata responses. Perhaps it's not an application-specific response, but generated by one of the dependencies or something? Sorry, not that familiar with the codebase. \n. ",
    "SaintGimp": "On further inspection I see where the HTTP manager is supposed to be triggering a stream clear, but it's not working.  In any case the issue is probably not with the core Phant project so I'll close this issue and track it down elsewhere.\n. ",
    "d1runberg": "Hi,\nProbably the best way to backup your data is to download it on a periodic\nbasis or write a script to do so automatically. You can download in a\nnumber of formats, json or csv being probably the most useful for backing\nup.\nOn Mar 23, 2015 1:12 PM, \"mikewen\" notifications@github.com wrote:\n\nI am new to phant, is there a way to back up data ?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/147.\n. Are you running this on a linux machine, did you install globally or to a\nspecific location...i.e your node packages directory.\n\nSorry, what I mean if I install phant on my local server.\nHow can I backup all the data?\nWhich directory should I look for?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/sparkfun/phant/issues/147#issuecomment-85218117.\n. @lautiamkok The front end pages are built in handlebars and are present in the http manager. Once you install Phant (assuming globally) go to the directory you specified and navigate to the phant-manager-http module directory in your node-modules directory. Look for views. Go ahead and change away!\n. ",
    "mikewen": "Sorry, what I mean if I install phant on my local server. \nHow can I backup all the data?\nWhich directory should I look for?\n. Yes. I am running Ubuntu, path: /usr/local/lib/node_modules/phant\nphant@6.8.0 /usr/local/lib/node_modules/phant\n├── wez-telnet@0.1.1\n├── dotenv@0.2.8\n├── routes@1.2.0\n├── xml@0.0.12\n├── formidable@1.0.17\n├── qs@1.2.2\n├── async@0.9.0\n├── phant-keychain-hex@0.2.1 (hashids@0.3.3)\n├── JSONStream@0.8.4 (through@2.3.6, jsonparse@0.0.5)\n├── csv-write-stream@0.1.2 (through2@0.4.2)\n├── phant-stream-csv@2.1.1 (log-rotate@0.2.7, csv-string@2.2.5, mkdirp@0.3.5, csv-streamify@1.0.0, rimraf@2.3.2)\n├── datejs@1.0.0-rc3\n├── phant-meta-nedb@3.1.1 (node-uuid@1.4.3, lodash@2.4.1, nedb@0.10.11)\n├── moment-timezone@0.2.5 (moment@2.9.0)\n└── phant-manager-http@4.5.10 (serve-favicon@2.2.0, moment@2.9.0, body-parser@1.12.2, express@3.20.2, express-handlebars@1.2.2)\n. ",
    "cwray": "We have had a small problem with the service last week. Problem is fixed now. let us know if you have any more connectivity problems.\n. ",
    "adewinter": "I think my PR should fix the build not passing here.\n. Well.  For some reason the tests pass locally but not on Travis.  Investigating further.\n. Ok! Travis CI build passing!\n. @chaimleib what's the procedure for merging the code into master?   I don't have write access so doesn't look like I can do it myself.... Paging: @toddtreece or @zinefer . ",
    "sanderboele": "I want to know!\n. ",
    "rajshah4": "Thanks for posting the step by step instructions, they worked pretty well, here is my revised version:\nsudo apt-get update\nsudo apt-get install nodejs\nsudo apt-get install npm\nsudo npm install -g phant\ncd ~\nmkdir tmpbuild\ncd tmpbuild\nwget https://nodejs.org/dist/v0.12.7/node-v0.12.7.tar.gz\ngunzip node-v0.12.7.tar.gz\ntar -xf node-v0.12.7.tar\ncd node-v0.12.7\n./configure\nmake\nsudo make install\nphant &\n(Got an error, did some research and the following)\napt-get install nodejs-legacy\nphant &\n(it worked!!)\n. ",
    "chronoglass": "you can also ln /usr/bin/nodejs /use/bin/node as long as you don't plan on using the node radio software on the same machine. ",
    "mitmas": "Have had the same thing happpen to me. ??\n. Seems newly created streams are missing but older one are still there.\n. ",
    "JRDoty3": "I also cannot find a stream created on 30 July 2015 but can find the stream created on 18 July 2014.\n. ",
    "puckettgw": "We're looking into the issue -- thank you for your report! \n. ",
    "Sequoia": ":+1:\n. @blanchardmatt is your issue with websockets? Your issue seems to be related to general unavailability of data.sparkfun (which I have ticketed here) :)\n. ",
    "bmjbmj": ":+1: \nAny form of configurable triggers like on Cosm/Xively that 'calls' an URL or uses websocket or what ever is needed for alarms and to react to a new value by eg. open closing a shutter.\nThnx to the developers for there work!\n. ",
    "blanchardmatt": ":+1: \nThis seems pretty critical to me.. Currently seeing lots of \"Uncaught Error: Connection refused: Not authorized\" in the browser console log on all public streams. MQTT is failing repeatedly.\nj._handleConnack    @   phant-manager.min.js?rev=1445871468039:11\n(anonymous function)    @   phant-manager.min.js?rev=1445871468039:11\nc.emit  @   phant-manager.min.js?rev=1445871468039:13\nj._write    @   phant-manager.min.js?rev=1445871468039:11\nk   @   phant-manager.min.js?rev=1445871468039:12\nj   @   phant-manager.min.js?rev=1445871468039:12\nf.write @   phant-manager.min.js?rev=1445871468039:12\nc   @   phant-manager.min.js?rev=1445871468039:14\nc.emit  @   phant-manager.min.js?rev=1445871468039:13\ne   @   phant-manager.min.js?rev=1445871468039:12\nl.queue.l.push  @   phant-manager.min.js?rev=1445871468039:12\nd.onMessage @   phant-manager.min.js?rev=1445871468039:12\nIs there a good workaround for now?\n. @Sequoia - I'm definitely noticing general ups and (lots of) downs with availability and response time sitewide, but this issue is specifically and consistently arising in the MqttClient _handleConnack method (websockets related). \nOpen any stream on the site in your browser - https://data.sparkfun.com/streams/LQExmjVDdAfxozE5ZG9p for example. Open the browser Developer Tools network tab and note the unending repeated requests to wss://data.sparkfun.com/mqtt. These are all resulting in \"Uncaught Error: Connection refused: Not authorized\" in the console.\nI wouldn't be surprised if these unrelenting requests and errors are what is bringing the whole data.sparkfun.com site to it's knees.. \n. ",
    "manosv": "Yes i have the same problem as you\n. ",
    "Lucky7Chess": "Yeah same issue here......\n. ",
    "nealzip": "@benandrews54\nIf you add /usr/local/bin/phant & to your rc.local should work. I'm not sure what the @reboot is about.\nYou may want to run which phant to confirm phant is located in the .usr/local/bin directory. \nMine was in /usr/bin/phant/\nNeal\nDarn Spell Check keeps changing phant to plant!\n. Your rc.local file looks the same as mine. I am using it on AWS (Amazon) and it works. \nDoes phant work if you just type sudo /usr/local/bin/phant & ?\nDo you see website on port 8080?\nRegards,\nNeal\n\nOn Oct 6, 2015, at 5:11 AM, benandrews54 notifications@github.com wrote:\nHi Neal,\nThe @reboot is for crontab. I believe it specifies that the command should be run on startup. I wasn't very clear but when I originally placed the commands into rc.local it was without the @reboot.\nI have confirmed that phant is in /usr/local/bin and rc.local is pointing to the correct path.\nHere is my rc.local file:\n!/bin/sh -e\n\nrc.local\n\nThis script is executed at the end of each multiuser runlevel.\nMake sure that the script will \"\" on success or any other\nvalue on error.\n\nIn order to enable or disable this script just change the execution\nbits.\n\nBy default this script does nothing.\nPrint the IP address\n_IP=$(hostname -I) || true\nif [ \"$_IP\" ]; then\n  printf \"My IP address is %s\\n\" \"$_IP\"\nfi\n/usr/local/bin/phant &\nmodprobe i2c-dev\nCalibrate the clock (default: 0x47). See datasheet for MCP7940N\ni2cset -y 1 0x6f 0x08 0x47\nmodprobe i2c:mcp7941x\necho mcp7941x 0x6f > /sys/class/i2c-dev/i2c-1/device/new_device\nhwclock -s\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "benandrews54": "Hi Neal,\nThe @reboot is for crontab. I believe it specifies that the command should be run on startup. I wasn't very clear but when I originally placed the commands into rc.local it was without the @reboot.\nI have confirmed that phant is in /usr/local/bin and rc.local is pointing to the correct path. However, it is still not working.\nHere is my rc.local file:\n```\n!/bin/sh -e\n\nrc.local\n\nThis script is executed at the end of each multiuser runlevel.\nMake sure that the script will \"\" on success or any other\nvalue on error.\n\nIn order to enable or disable this script just change the execution\nbits.\n\nBy default this script does nothing.\nPrint the IP address\n_IP=$(hostname -I) || true\nif [ \"$_IP\" ]; then\n  printf \"My IP address is %s\\n\" \"$_IP\"\nfi\n/usr/local/bin/phant &\nmodprobe i2c-dev\nCalibrate the clock (default: 0x47). See datasheet for MCP7940N\ni2cset -y 1 0x6f 0x08 0x47\nmodprobe i2c:mcp7941x\necho mcp7941x 0x6f > /sys/class/i2c-dev/i2c-1/device/new_device\nhwclock -s\n```\n. ",
    "Vulpecula-nl": "You have to install the forever module in npm. For howto see bottom part of this page: http://phant.io/beaglebone/install/2014/07/03/beaglebone-black-install/#keeping-phant-running\nThis is written for the Beaglebone but I have tested on my Ubuntu 16.04 server and it works! For me it also solved an out-of-memory issue!\n. ",
    "adamfowleruk": "The above comments work if you don't mind running from boot as the root user. If, however, you've logged in as the 'pi' user and used phant, then you've already configured your streams as that user. Thus starting it from rc.local or init scripts means you 'lose' your stream configurations. Ideally we could do with an OOTB fix for this from the phant team themselves, to point out best practice without losing configuration.. ",
    "peruginim": "I haven't run any test but I can definitely say that requests are sometimes slow. I'm pulling data from my stream to graph with google charts, and completion times can be inconsistent and sometimes very long. My query isn't just pulling the first page, I'm using a filter (data: 'gt[timestamp]=now-1day'), so that will slow down the response time, but I still wish my request could complete faster.\n. ",
    "jsandv": "Nobody answering these posts? Its an easy question.....\n. ",
    "ozroc": "I have the same question.\nIs this feature already planned?\n. ",
    "m4ddav3": "You would need to find your target rows from the csv files directly. Take a backup first, as phant isn't very good at dealing with unexpected data/formatting/other\n. Yes, you can change any/all of the data -- it is just stored as CSV text in your phant_streams directory.\n. You would need to create a package specifically for this, and register it as an Output.\nTake a look at phant-stream-csv for an ideal as to what is needed.\n. @bsodmike phant stores data in the directory specified by PHANT_STORAGEDIR. This defaults to phant_streams, which is relative to your process' current working directory.\nI.e. I run phant looged in as myself, from my home dir, so it is ~/phant_streams\n. @lautiamkok Phant does not specify anything about the interface to listen on, except the port (http = PHANT_PORT, telnet = PHANT_TELNET_PORT). You should check your server configuration to find out what is happening.\nFrom the NodeJS documentation:\n\nthe server will accept connections on any IPv6 address (::) when IPv6 is available, or any IPv4 address (0.0.0.0) otherwise\n\nIf you have sudo access, lsof will tell you what it is listening on:\n$ sudo lsof -ni -P | grep node\nnode      26374    -----   12u  IPv6 1060604      0t0  TCP *:8080 (LISTEN)\nnode      26374    -----   13u  IPv6 1060605      0t0  TCP *:8081 (LISTEN)\nShows my server listening on all interfaces (*), on ports 8080 and 8081.\nYou can refine this by editing /usr/local/bin/phant around line 45.\nI added in my IP as a second parameter and lsof reports as I expected:\n$ sudo lsof -ni -P | grep node\nnode      26374    -----   12u  IPv6 1060604      0t0  TCP xxx.xxx.xxx.xxx:8080 (LISTEN)\nnode      26374    -----   13u  IPv6 1060605      0t0  TCP *:8081 (LISTEN)\nApart from these local interface tweaks, you should check any firewalls/iptables which might block access to those ports.\n. @lautiamkok You'll need to edit /usr/local/bin/phant and change all instances of HttpServer to HttpsServer\n. ",
    "fuchini": "Hi, could you expand please. Is it possible to change individual values?\n. ",
    "DarkLordZach": "I am getting this error too along with \n502 Bad Gateway\nI would really like to configure my phant before I deploy any help is appreciated!\n. ",
    "bcupps": "Any update on resolving the 502 error? Thanks!\n. ",
    "jonaslorander": "I'm getting the 502 and 504 errors as well. Have have been getting them for well over a week now. Any change you might fix this, or Point me in the direction of how to set up phant using MQTT without the configurator?\nThanks!\n. It doesn't seem to work if you run phant-manager-sparkfun (which is what's running on data.sparkfun.com) on your own server either :(\nIt would be really nice if this were fixed!\n. ",
    "datacute": "I've been experiencing the same thing, with a device reporting every 30 seconds (plus about 0.18 seconds to connect and post).\nhttps://data.sparkfun.com/streams/7JxJ1o039miyrl58703v\nGraphing the date reported in the server responses, I've drawn the conclusion that there are at least three different servers handling the requests, with three different clocks, and relative to the earliest clock, the other two clocks are about 30 and 41 seconds later, and that each server's clock's timestamp is recorded with the data.\nI also suspect that the shifting clocks are playing havoc with the rate limiter. I'm posting 30 times in 15 minutes, so well within the 100 limit, but after a number of hours my device falls into a pattern of 6, 11, 15, and 20 minute delays every hour and a quarter. (I haven't ruled out my code for that yet though.)\n. I found two solutions to my pattern of delays, one was to reset the esp8266 whenever the uptime reached one hour. The second was to restart the esp8266 wifi when the connection to data.sparkfun.com failed. These show that the problem is likely in the software running on my esp8266 devices.\nThe problem of the timestamps jumping around remains.\n. My guess is still that SparkFun is running multiple servers to receive the data, and that their clocks are not in sync.\n. SparkFun fixed this a few days ago: https://github.com/sparkfun/phant/issues/172\n. I had a very similar problem, which I tracked down to a bug in the ESP8266 Arduino tools I was using to send the float data to SparkFun. Updating the tools fixed the problem for me. SparkFun had been accurately recording the values I was sending with spaces in them.\n. I'm using Arduino IDE v1.6.5, and what fixed the problem for me was within Tools | Boards | Board Manager, updating the esp8266. I'm currently using v2.0.0.\nI originally suspected a problem somewhere because analog.io was only graphing temperature readings from my sensor in whole degrees, but showing the latest value with decimal places, The pressure readings were graphed correctly.\nThe pressure values were of the form \"1013.1234\", graphing correctly.\nThe temperature values were of the form \"23  .5678\", graphing as \"23\".\nI saw that I was sending bad data by adding\nSerial.println(phant.queryString());\nbefore calling post() or url().\n. ",
    "mperignon": "I may be having a similar issue with an ESP8266 posting to data.sparkfun.com. Timestamps that are not chronological, delays between posts that are very far off the supposed 30 seconds, and delays where the sensor keeps collecting data (increasing a counter) but they don't get posted. Using internet connection sharing is making it worse -- maybe it's adding one more unsynchronized clock to the mix. Have you tried changing the post rate? It would be interesting to see how the delay pattern changes with half or twice the post rate.\n. I think I found the problem with my setup. I was using the example code for posting to phant with the ESP8266. Like @datacute, the gaps in my data had a pattern, stopping every 40 minutes for 20 minutes. The data also had funky timestamps, with posts that were seemingly out of order and post spacings (according to the timestamps) that were as little as 9 seconds apart (instead of 30 seconds). I added a post counter to the data stream that increased by one every time postToPhant() was called and found that, during the gaps, the post counter jumped by an order of magnitude more than it should have had it been posting every 30 seconds.\nI think this was the problem: Starting in line 40 of the example code, loop() calls postToPhant() and increases the timer lastPost by postRate if successful or delay(100) if not. That means that, if posting fails, the ESP8266 will try to post again in 100 milliseconds and keep trying 10 times a second until it manages to post. If data.sparkfun.com is counting failed attempts towards the 100 post/15 minute cap, it would take as little as 10 seconds of bad connection to reach the limit, locking you out of the data stream for some time.\nMy solution was to increase the delay in loop() to 5000 milliseconds (5 seconds) in order to give the connection time to fix itself before trying to post again. I don't know why it sometimes can't post, but that was enough to avoid hitting the rate limit. If this hadn't fixed the problem, I would have removed the If loop in loop() so that the code increases lastPost by postRate after calling postToPhant() regardless of whether posting succeeds. I'd lose the data point but it would forcefully throttle the posting rate.\nAs for the bad timestamps, I added a RTC module to the Thing to post an independent timestamp along with the data. There is definitely variability between the RTC time and the server time but I have not looked for a pattern yet.\n@DrBit, hope this helps!\n. Of course, as I wrote this, the Thing stopped posting for the first time in five days. @datacute, how are you resetting the ESP8266?\n. @DrBit, yep, I couldn't find a similar issue to mine in your code. The fact that you are posting to ThingSpeak without trouble is illuminating.\nThanks for the info, @ToniCorinne . Hopefully it'll get sorted out soon.\n. ",
    "DrBit": "I'm also experiencing the same issue. I'm runing the example code for arduino.\nhttps://data.sparkfun.com/streams/xRvJ0wRd5qCQVpD5LdV0\n. Thanks @mperignon for your input but my code is taken from https://github.com/Serasidis/SparkfunDataClient/blob/master/SparkfunDataClient.ino i doesn't look like it contains the same issue you describe. I'm posting the same data in both sparkfun and thingspeak and they look good in thingspeak.\nhere my code: https://github.com/DrBit/arduino_energy_monitor/blob/master/energy_monitor.ino\n. confirmed! IT does work for me. \n. ",
    "thethereza": "Is anyone from spark fun looking at these bug reports?  Should I just migrate to thing speak?\n\nOn Dec 2, 2015, at 5:34 PM, DrBit notifications@github.com wrote:\nThanks @mperignon for your input but my code is taken from https://github.com/Serasidis/SparkfunDataClient/blob/master/SparkfunDataClient.ino i doesn't look like it contains the same issue you describe. I'm posting the same data in both sparkfun and thingspeak and they look good in thingspeak.\nhere my code: https://github.com/DrBit/arduino_energy_monitor/blob/master/energy_monitor.ino\n—\nReply to this email directly or view it on GitHub.\n. Spark fun, if you describe your infrastructure I'll tell you what's wrong and how to fix it.  \nOn Dec 3, 2015, at 8:33 AM, Toni Klopfenstein notifications@github.com wrote:\nHey there - SparkFun employee here. We are actually in the process of getting a new developer up to speed with phant. Apologies that it's taking a while- there's several large code projects in the work here on our backend, so this is going slower than expected.\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "ShawnHymel": "I've also noticed this issue. I've also added a separate timestamp field to my logs in order to compare it to the server-created timestamp. Every now and then, one of the server timestamps is off, as in, it thinks it's a few seconds in the future. I've added a screenshot - hope this helps!\n\n. ",
    "zinefer": "This should be fixed. Thanks for the reports!\n. Yes! We are working on a large overhaul.\n. ",
    "AlanBC7": "Hi Stephen,\nThis helps a lot, thank you.  The printout on data.sparkfun.com looks \ngood.\nThe data can be exported to analog.io and plots fine.\nPlease be a little more specific about what you mean by \"update the \ntools\"\nI am running Arduino 1.6.4 and checked today that 1.6.6 is available.\nOr, are you talking about files I downloaded with the Library Manager?\nOr, other tools?\nI am using the Sparkfun ESP8266 Thing Dev Board.\nThanks for the help.\nAll the best, Alan\nOn 2015-12-10 14:43, Stephen Denne wrote:\n\nI had a very similar problem, which I tracked down to a bug in the\nESP8266 Arduino tools I was using to send the float data to SparkFun.\nUpdating the tools fixed the problem for me. SparkFun had been\naccurately recording the values I was sending with spaces in them.\n\nReply to this email directly or view it on GitHub [1].\n*\nLinks:\n[1] https://github.com/sparkfun/phant/issues/174#issuecomment-163775592\n. \n",
    "SalvorinFex": "Four days later and no response, not what I expected!\nAlso, the web page https://data.sparkfun.com/config is still erroring out:\n504 Gateway Time-out\nThe server didn't respond in time.\n. ",
    "ADeeds": "wget -O - /dev/null \"http://<server>/phant/output/<key>.json?gt[timestamp]=now%20-7%20days&timezone=America/Los%20Angeles\" | tr -dc \"{\" | wc -c \nThat command takes ~6 seconds for me to execute, and wc -c finds 646 JSON objects\nwget -O - /dev/null \"http://<server>/phant/output/<key>.json?limit=646\" | tr -dc \"{\" | wc -c\nThat command takes 0.5 seconds and returns the same 646 JSON objects. If you watch the output as you download it (in browser or command line), it looks like all of the objects get downloaded, then it takes a really long time for the end of the list (the right square brace) to get sent. I haven't dug into the code,  but I suspect that filtering by timestamp isn't optimized at all (if you're using ?gt[timestamp], it should stop looking and finish sending data once it sees the first timestamp that is too old)\n. I submitted #207 , which makes filtering by timestamp significantly faster when you have lots of data and aren't planning on getting all of it\nWith the PR, the following command takes 0.7 seconds instead of 6.\nwget -O - /dev/null \"http://<server>/phant/output/<key>.json?gt[timestamp]=now%20-7%20days&timezone=America/Los%20Angeles\" | tr -dc \"{\" | wc -c\n. ",
    "maxmclau": "Same problem here\n. ",
    "matrixfox": "Wow, this issues old in technology years... I get this error when using a web browser and parsing data to sparkfun.... It's not pretty, but just delete phant inside of node_modules folder. Or delete node_modules all together.. ",
    "fohnbit": "ok, found the info.\nIt can use filters\nThank you!\n. ",
    "astroeng": "I will second this... Just created a new stream and the email did not come through. I created a stream back in July and the email worked fine for that one.\n. I have seen this a couple of times over the last few days as well. I have seen 504 as well, but I think that might be on my end. However, I have never seen it take my logging app 10 tries.\n. Any details?\n. The line of code you are referencing is from the nedb Node.js module. If you can I would suggest updating that module. something along the lines of \"npm update\" would be a good start\n. I am going to be doing a similar thing. I ended up adding a local date stamp (generated on my end) to the stream. At the moment though my code is still just uploading every 2 minutes. Internally my theory is to just queue up the messages and once enough are in the buffer send them all with one or two seconds between messages.\nhttps://data.sparkfun.com/easy_weather2\n. I have been getting a ton of 503 Service Unavailable messages recently. Inspired me to add a message buffer to my project.. I added a field to my stream that represents the date that the message was created. Uses the same format as the phant timestamp. There might be a better way but I found this to be pretty simple and work.\nInterestingly/Conveniently, this also allows me to figure out how long the phant server is taking to process messages.\nData Stream: https://data.sparkfun.com/easy_weather2\n`char timeDateString(char buffer, int buffer_len)\n{\n  char milliSecondsBuffer[4];\n  timespec rawTime;\n  struct tm * timeinfo;\nclock_gettime(CLOCK_REALTIME, &rawTime);\ntimeinfo = localtime(&rawTime.tv_sec);\nstrftime(buffer, buffer_len, \"%FT%T.xxxZ\",timeinfo);\nsprintf(milliSecondsBuffer,\"%03ld\",rawTime.tv_nsec / 1000000);\nmemcpy(strstr(buffer, \"xxx\"),milliSecondsBuffer,3);\nreturn buffer;\n}`. I too still see the issue from time to time. I stood up a google sheets API that allows my weather station to log data in a spreadsheet concurrently with the Sparkfun service. So far no missing data entries with google sheets, but Sparkfun occasionally misses one here and there.. I have seen the same thing. It gets worse the closer together the reports to the data service are. The closest my reports get is 30 seconds and recently the out of order issue has been getting worse. I previously had selected 30 seconds as it seemed to work most of the time. The nominal report interval for my stream is 120 seconds, which seems to always be in chronological order. \nIf I may speculate a bit I think the out of order issue has to do with what I suspect is multiple servers dealing with all of the devices sending in reports. I would bet that the synchronization between the servers is somewhat loose.. ",
    "Erik-k": "I created a stream recently (September 2016) and the email feature did not work. I included two emails, a personal @gmail.com one and a corporate one and neither received the email. \n. I'm curious too since the documentation says the next features will include using TCP to directly upload, rather than having to do the kludge of sending HTTP GET requests. \n. Do you mean customize the appearance of the stream's data (where do you find that by the way?) or the telnet interface? \n. ",
    "Pablo2048": "Any news?. ",
    "edmaher": "@zinefer I feel it would be much better for the users if there were more small incremental updates, regular releases, or if there is a major piece of work, it would be great if there was a visible branch. Accepting pull requests would be a great way to get more stuff done.. I have noticed this too, however, I think the issue is the timestamp generation, not the ordering.\nI am pushing data that includes an integer timestamp from the device, so i can see that the data is returned in correct order ( newest to oldest ..... btw I would prefer to be able to reverse this ). https://data.sparkfun.com/. ",
    "chrigui": "Bump\n. @erniberni Nothing yet, i have phant installed on a pi but i don't know how i can use the output there is no documentation for it.\ni found this: https://github.com/sparkfun/phant/pull/85\nanyone knows any things please share it!\n. ",
    "chaimleib": "I don't have access either. Someone from Sparkfun has to accept the PR and merge it.. Already in #190 \n. ",
    "bsodmike": "@lautiamkok did you also figure out where Phant persists data?  Thanks!\n. Oh, I'd assumed it would persist to a database (Postgres/MySQL) or say Redis; sound like they've designed it around a simpler concept.\n. ",
    "lautiamkok": "@m4ddav3 thanks for the reply. My issue above was caused by http/ https. I changed https to http when sending data from imp and it is now working.\n. @m4ddav3 thanks for the tip!\n. ",
    "chenmingzhang": "i received \n$phant\nprocess.env.PHANT_SERVER_STLE = undefined\nfs.js:640\n  return binding.open(pathModule._makeLong(path), stringToFlags(flags), mode);\n                 ^\nTypeError: path must be a string or Buffer\n    at TypeError (native)\n    at Object.fs.openSync (fs.js:640:18)\n    at Object.fs.readFileSync (fs.js:508:33)\n    at Object.app.credentials (/usr/lib64/node_modules/phant/lib/https_server.js:80:14)\n    at Object.app.listen (/usr/lib64/node_modules/phant/lib/https_server.js:42:41)\n    at Object. (/usr/lib64/node_modules/phant/.bin/serve:57:11)\n    at Module._compile (module.js:570:32)\n    at Object.Module._extensions..js (module.js:579:10)\n    at Module.load (module.js:487:32)\n    at tryModuleLoad (module.js:446:12)\nwhen i change HttpServer to HttpsServer.\nany updates? thanks. thanks Jim!\nthis might be a silly question, where to define process.env?\ncurrently i run the server and it says\n$phant\nprocess.env.PHANT_SERVER_STLE = undefined\nphant http server running on port 8080\nphant telnet server running on port 8081\nwhich means it is still running under http type.. just wish to give you an update:\nI have added \nprocess.env.PHANT_SERVERSTYLE='http'\n to serve file\nthe output is:\n$ phantj \nprocess.env.PHANT_SERVER_STLE = http\nphant http server running on port 8080\nphant telnet server running on port 8081\nwhile i add \nprocess.env.PHANT_SERVERSTYLE='https'\n to serve file\nthe output is:\n$phantj \nprocess.env.PHANT_SERVER_STLE = https\nfs.js:641\n  return binding.open(pathModule._makeLong(path), stringToFlags(flags), mode);\n                 ^\nTypeError: path must be a string or Buffer\n    at TypeError (native)\n    at Object.fs.openSync (fs.js:641:18)\n    at Object.fs.readFileSync (fs.js:509:33)\n    at Object.app.credentials (/usr/lib/node_modules/phantj/lib/https_server.js:80:14)\n    at Object.app.listen (/usr/lib/node_modules/phantj/lib/https_server.js:42:41)\n    at Object. (/usr/lib/node_modules/phantj/.bin/serve:56:11)\n    at Module._compile (module.js:570:32)\n    at Object.Module._extensions..js (module.js:579:10)\n    at Module.load (module.js:487:32)\n    at tryModuleLoad (module.js:446:12)\n. ",
    "jschulenklopper": "While this is a valid request for clarification on the documentation of the service provided at data.sparkfun.com, it is not an issue related to the code of phant powering the service.\nThe code does not specify that limit, the limit isn't mentioned in the documentation of the code AFAICT, and the home page of data.sparkfun.com isn't hosted in this repository at GitHub.\nMost likely an email to data@sparkfun.com should provide a resolution on this issue.\n. ",
    "botamochi6277": "I have the same problem (macOS Sierra, ver. 10.12, macbookAir, nodeJS v6.5.0).\nI seriously hope to fix the problem.\n\n. ",
    "AWROUND": "Identical issue on new install of local Phant server (Vagrant/VirtualBox on Windows 10 machine).\nNodeJS Ver 6.8.1\n. ",
    "bergvdm": "Same here after a fresh install (macOS 10.12 nodeJS v6.9.1)\n. I did a search on Stackoverflow and might found a solution by changing (validator.js) line 173 to\nif (!Object.hasOwnProperty.call(data, key)) {\nand line 196 to\nif (!Object.hasOwnProperty.call(data, stream.fields[i])) {\nSeems to work, no more errors on posts.\nAlso found that Peter Stojcsics did the same on his fork, also in some other files.\n. ",
    "stoto": "That's right. The main fork of Phant is made for an older version of nodejs. In the 6.x nodeJS, you can't call hasOwnProperty on any object, instead you have to use the mentioned syntax for the exact same thing. \nThe only thing I changed in my fork is this fix and I also removed the build status from the readme. You can fork it and use it ;)\n. ",
    "structure7": "That fix seems to be working with NodeJS v7.1.0, too.. Same. Although I think it's showing me 100% remaining.  \"100% (50.00 of 50 MB) remaining\"\n. A little shakey, but I think it's coming back (as of 2016-11-04 01:42Z).\n. Just wanted to share what I heard back from Sparkfun tech support:\n\nUnfortunately we don’t really have a concrete timeline for it. It should be marginally functional now, but our sysadmin is still has to go through and spin up a bunch more mongo database servers for storage and I think that should get everything up and running again (crosses fingers). They usually do things like that over the weekend or at night to minimize impact on how it effects our network, and I know that [the sysadmin] expressed interest in getting it back up and running ASAP – I would guess he has it done by Monday, but that’s just my personal guess.\n. I have installed on a Raspberry Pi that does nothing else, so I just phant in terminal and leave it be (headless remote with xrdp), however maybe that's an issue.\n\nI'll try forever when I can shut down phant. Playing with it on another rpi... I can't run forever unless I get into the phant folder and forever start index.js, but that's just something I need to learn more about! Thanks again.. ",
    "SwizzleMaster": "Changing the code didn't work for me. The other way to fix it is to downgrade to nodejs version 4.6.2. That version works fine for me. \nFirst you'll need to npm install a node version manager called n : \" npm install n \".\ncheck it out here: https://github.com/tj/n\nOnce the version manager is installed, you install the working version of node and the stable version. \" n 4.6.2 && n stable \".... then you choose which version you want to use: \" n\" then press the arrow keys up/down to select and the right-arrow key to set it as your version. you can verify that it worked by typing \" node -v \".\nAfter that you install phant and carry on as usual. you may or may not have to update your npm. check the readme in the n version manager github page about that.\ngood luck :). ",
    "davidcie": "Came across the same and even upgraded from v7.6.0 to v7.7.2. Perhaps README.md should not say \"requires the latest version of node.js\" if what it really needs is v4.6.2. Hoping that @stoto can submit a PR with his fixes so that fewer new users are caught by this issue.. Tried to submit data simply adding an ISO-formatted timestamp parameter &timestamp=2017-03-10T10%3A44%3A00.000Z (%3A being the url-encoded colon) but sadly that did not work.\nThis is important from a remote battery powered device point of view, where enabling RF, establishing connection, getting an IP and finally communicating with the server are by far the most energy consuming activites (~80-90mA over 5s) compared to data gathering which is almost instantaneous and needs very little with the sensors we use (~15mA over less than 1s). This capability would translate into months more use before we need to change batteries.. Turns out phant simply overwrites timestamp on this line. \nIn case anyone's interested I have a fork that tries to parse user submitted timestamp here and does new Date() only if none has been found or could not be parsed successfully. It is probably best to submit ISO-formatted timestamp (example above) but any Javascript compatible format will do. Just beware that if you do timestamp=2010,0,30,12,13,14 it will create a date of January 30, 2010 at 12:13:14 in your server's timezone, not UTC. If there's interest I might try to add a special path that does a new Date(Date.UTC(y,m,d,h,m,s)) if string contains six numbers separated by five commas. Perhaps looks a little easier on the eyes than url-encoded colons.. ",
    "ultrafez": "@stoto's PR is here for those interested.. ",
    "hawkz": "Giving up 🤕 . ",
    "utdrmac": "@astroeng via the HTTP API, how are you blast/bulk POSTing? What's your URL string for multiple data sets?. ",
    "tsayles": "Looks like all my streams also were reset. \n. @emmmitt Thanks for the update / back story. \n. ",
    "gmagiafas": "Same here. The weird thing is that is shows data usage 100% but only today's data are present!\n. ",
    "vadysoares": "My streams were reset too :(\nYesterday data.sparkfun.com was offline for a long time ...\n. The sever is offline again :( \nWe should backup our data ...\nEDIT:\nThey have recovered our data :D\n. ",
    "edusteinhorst": "Same here... 100% usage and no data. I hope they can get it back online, I had a lot of important data there\n. I think it is! I saw my data for a moment. All is not lost :)\n. ",
    "emmmitt": "We had some issues with our data aging system and our disks filled, this caused the system to become unreachable. \nWe changed the database to be on elastic block storage and spun everything back up, we then needed to migrate some data over. \nThanks for dropping us a note and for using phant. We are keeping an eye on it right now - hopefully we are stable again for a while. \n. ",
    "idcrook": "appears to be back up 2016-11-20T19:38:40Z\n. Guess it's provided a lot of inspiration. The downtime, etc. inspired me to dockerify phant too, so I can host a locally grown database quickly/painlessly. 😄  if interested: https://github.com/idcrook/phant \nA message buffer would be a generally useful client library addon for a IoT logging framework, I would opine. One caveat as I understand it is the phant-assigned timestamps at the server. Can/Does your message buffer account for that limitation? The reason I ask is that part of my requirements involve having the original time series represented alongside my data.... ",
    "iamchriskelley": "Are there any updates on this issue? I'm having the same problem, using an ESP8266 to post to Phant. Something like one in 30-50 posts is returning a 200 OK message but the data aren't showing up in the Phant stream. Kind of a big problem for a datalogging service.. ",
    "ebeeche": "Phant stores stream data and its corresponding headers in two different files (for each stream) their location is:\nphant-dir/phant_streams/XXXX/YYYYYYYY/headers.csv\nphant-dir/phant_streams/XXXX/YYYYYYYY/stream.csv\nWhere XXXX is a 4 positions hex number and YYYYYYYY is a 28 positions hex number .\nAs the .csv extension suggests, data inside those files is stored in comma separated values.\nTo my knowledge, both hex numbers are assigned arbitrarily by Phant.\nHope this helps.  And if it does, please close the issue because this is actually not an issue/bug.\n. Just like everyone here I did suffer all the mentioned problems, so at the end my solution was to rent a virtual server for $5 a month and host my very own phant server, headaches gone!.\nPhant is a great IoT platform I really like it, it's kind of sad to see Sparkfun is not interested to keep it alive.\nI am (slowly) learning the internal parts and bits of Phant just to be prepared to keep my server alive (and also to help other people if I can) in case Sparkfun finally pulls the plug.\nGreetings from sunny Costa Rica.\n. This issue has nothing to do with Phant, please post your vagrant problem in the approrpiate place (not here for sure).  And please close the issue in order to keep this place as clean as possible from non-related matters.  Thanks.\n(Due to the lack of context, please note that my reply is a friendly one, no flaming intention, cheers). ",
    "raenrfm": "Didn't realize you already implemented this.  Closing this issue.. ",
    "Samistine": "Merge. ",
    "gshafer": "I have node v8.0.0. Still have the crash problem on post.\nCan some post the steps required to fix this?\nI tried making the edits suggested earlier but no joy.. ",
    "strank": "can confirm that this pull request just fixed a broken vanilla phant/vagrant install for me. ",
    "tbitson": "How are you launching phant ? Directly via npm? 'kill' seems to work without errors.\nI personally use the forever script (https://github.com/foreverjs/forever), to start and stop phant with the added benefit that forever will do its best to keep phant running. Simply type 'forever start phant' or 'forever stop phant'. \n\nTim\n\n\nOn Mar 23, 2017, at 9:53 AM, structure7 notifications@github.com wrote:\nIt seems that any time I stop Phant (ctrl-c), then restart, I get an error. This error is usually something to do with datastore.js:61 if (err) { throw err; }. I'm guessing this is because, despite my best effort at timing the stopping of Phant, data was streaming in and corrupted something.\nTo date my successful workaround has been to edit streams.db down to only (what I'm calling) one entry per title ({\"title\":\"myTitle\",\"description\":\"myDescription\",\"tags\":[],\"fields\":[\"myField1\",\"myField2\"],\"hidden\":false,\"location\":{},\"id\":\"myId\",\"date\":1481547878295,\"last_push\":1486439379499,\"flagged\":false,\"_id\":\"someOtherId\"}). I then start Phant again and all is well.\nIs there a better way to stop Phant?\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n. \n",
    "rdrink": "Been seeing this all day (since about 10:30AM CST). No one at Sparkfun seems to have noticed (or at least done anything about it).\nMight be time to give up on phant. No significant updates in over a year.. ",
    "geertvw2": "Yes indeed. We lost in the meantime 24 hrs of our Internet of Bees project. Since this happened just after we made an important intervention we wanted to monitor, this makes us very unhappy. Please Sparkfun folks, get this solved quickly!!. ",
    "thcipriani": "To be clear, while I previously had write access to this repo, I do not now. I have no affiliation with SparkFun and the views of this pull request are entirely the perspective of an outsider who is still, because of laziness, getting notifications about this repo. This is not, necessarily, what SparkFun thinks the best course of action is in this case, and, who knows, there may be Big Plans™ in the works.. @jschertz howdy!\nHappy to have an update about this repo and to hear that it's a priority for SparkFun. I'll close out my pull request for the time being since it is evidently not the way forward (an update with the New Plan on the README would be awesome). There are also a number of issues that could be closed-out, and some good pull requests to merge.\nGlad to see SparkFun demonstrate its commitment to open source. I look forward to future updates :). ",
    "jschertz": "Thanks @thcipriani — I'm going to attempt to offer up a status here, I'm the software dev manager at Sparkfun, been with Sparkfun for about 11 months. Greetings.\nStatus:\n\n[x] Make a lot of people upset\n[x] Throw more AWS resources at the problem in the meantime (This is a war we'll lose eventually)\n[ ] Establish a team at Sparkfun to pick this project back up\n[ ] Have a lot of conversations both internally and with the phant community\n[ ] Build a v2 (likely a python lib) while maintaining the legacy project and api\n\nI can offer no timeline, but I can tell you that yes we're ready to move on Phant, it's a great project, the community has built a lot of cool stuff with it. We don't want to let that go. I'm going to bring myself up to speed on the project in the meantime and serve as a direct line of communication to Sparkfun. Yes, we hear you.. ",
    "katiehn14": "I don't know why my stream showed all the data were zero even in the laptop there are some actual values. Might be something wrong why sending data to the server. I'm sure what is going on. Any thought?\n. ",
    "khanafin": "Same issue here... shows '1 success' in response to curl GET command but data does not show.  CSV request shows no data. When looking using 'tags' it shows recent push.   Any clues?  \ncurl command and response is: \ncurl -X GET 'http://data.sparkfun.com/input/Davrxw2vbNSljpMA1J2X?private_key=Pnd05GYdEKsxYgqaBm0d&ard_ts=3221771&orp1=246.30&orp2=0.20&orp3=262.70&t00=23.50&t01=24.14&t02=24.89&t03=24.82&t04=24.38&t05=24.07&t06=23.83&t07=23.32&t08=23.44&r09=23.50&t10=23.20&t11=24.82'\n1 success\nThanks for any help!!. Workaround?  Made a small database that was able to save data to.  Renamed and replaced data fields to replicate the earlier stream... worked!\n. ",
    "rryansilva": "I am having the same issue with the stream:\nhttps://data.sparkfun.com/streams/6JVyY4a2WDF88ZA6r01m\nIt returns '1 success' but nothing is appearing in the stream.. Interestingly I set up another stream with the same parameters and it is behaving the same way:\nhttps://data.sparkfun.com/streams/GEGJARbxRjfW9MRVVbw8 AKA https://data.sparkfun.com/bekasi. I contacted Sparkfun customer service on this issue, and they indicated that they are aware that Phant is not running as successfully as it once did, and they have a new tech who is working on updating the platform, which has of course been in beta. \nI have some streams that are continuing to run successfully, but I am switching to Adafruit.io for new streams for the time being. I look forward to Sparkfun's updated offering and would be willing to pay for a premium tier to help support the project.. ",
    "PaladinEng": "I am also having this issue. I had a working stream. I even posted to it this morning, but now I'm unable to post any data to the stream. Also, I'm getting a lot of 502 Bad Gateway returns.\nI'm using postman to test my POST messages, and have simply re-sent previously successful messages to test. So I know that I do not have a formatting/construction issue on my end.. ",
    "jgpender": "I would also like to know why Phant periodically goes offline. I am posting data from an ESP8266 Thing Dev and it was working great earlier today and then went dead. The Serial window (Arduino IDE) shows the ESP8266 connecting with the local wifi and claims a successful post to Phant but no data is actually visible on Phant.\nI would also like to ask if it's possible to host a Phant server on an Arduino Yun. I have several Yuns on this same wifi network that could be logging the data from the ESP8266 (which is running on battery power and deep sleeps between each logging event, so boots fresh for each data point).. ",
    "NJJLClub": "I'm also having issues. I'm getting the '1 success' returned to me but I don't see the data showing up in the stream. I also very often see the 502 Bad Gateway message. Then I refresh my browser and I see my stream but it doesn't contain any data that I sent it.   This is my stream: https://data.sparkfun.com/streams/7vGGnEw1DmuZ23DrJ99E - I posted a number of Temp and Humidity numbers to it but don't see them.\nI was able to post Temp and Humidity to this stream with some success. https://data.sparkfun.com/streams/6JZbNolApzF4om2l9yYK but not the one I created.. ",
    "protchenkov": "Exactly the same issue here. Getting 1 success via postman and Arduino, but nothing appears in the stream: RvrWL47WpjHqj6K2mJo3\nI'm also getting 502 response once in a while. ",
    "rcnerd": "Same problem. Previous comment gives some explanation... and in return satisfaction that I am not going crazy. There is no way to up vote this issue so I am just leaving a comment.. ",
    "THALLIVA": "import RPi.GPIO as GPIO \nimport time            \nimport httplib, urllib \nimport socket           \nserver = \"data.sparkfun.com\" \npublicKey = \"vV582NgNM2uzAMjr03Gy\" \nprivateKey = \"aR1rD929ADhamg1MEPJz\"\nfields = [\"time\"]\nprint(\"Here we go! Press CTRL+C to exit\")\ndata = {}\ndata[fields[0]] = time.strftime(\"%A %B %d, %Y %H:%M:%S %Z\")\nparams = urllib.urlencode(data)\nheaders = {} \nheaders[\"Content-Type\"] = \"application/x-www-form-urlencoded\"\nheaders[\"Connection\"] = \"close\"\nheaders[\"Content-Length\"] = len(params) \nheaders[\"Phant-Private-Key\"] = privateKey\nc = httplib.HTTPConnection(server)\nc.request(\"POST\", \"/input/\" + publicKey + \".txt\", params, headers)\nr = c.getresponse()\nprint (r.status, r.reason)\ntime.sleep(1)\nI wrote the following code..I get 200,OK but didnt see data on the stream... ",
    "jmcgnh": "The keys are just a hash function applied to the stream ID, they're not stored anywhere.\nSince you're operating your own private instance of the server, you should be able to make the following change. This adds a 'listkeys' command to the telnet interface which you can use to recover the keys and then follow the normal procedures to delete them. It should go without saying that this function must not be made generally available and you should back out these diffs once you've done what you needed to do.\n*** telnet_manager.js:orig  Mon Feb 27 05:19:55 2017\n--- telnet_manager.js   Wed Jun 21 05:11:17 2017\n***************\n*** 181,186 ****\n--- 181,187 ----\n\n    w('\\n');\n    w('list       list public streams\\n');\n+   w('listkeys   list public streams with ID and keys\\n');\n    w('create     create a new stream\\n');\n    w('delete     remove a stream\\n');\n    w('help       display this dialog\\n');\n***************\n*** 363,368 ****\n--- 364,405 ----\n  };\n\n  /**\n+  * listkeys\n+  *\n+  * displays a list of the public streams with their IDs and keys\n+  */\n+ client.listkeys = function() {\n+ \n+   var self = this;\n+ \n+   self.write('\\nPublic streams:\\n');\n+ \n+   self.manager.metadata.list(function(err, streams) {\n+ \n+     if (err) {\n+ \n+       self.write('Error retrieving streams\\n');\n+ \n+     } else {\n+ \n+       streams.forEach(function(stream) {\n+         self.write(stream.title + ' - ' + stream.id + '\\n');\n+         self.write('PUBLIC KEY: ' + self.manager.keychain.publicKey(stream.id) + '\\n');\n+         self.write('PRIVATE KEY:  ' + self.manager.keychain.privateKey(stream.id) + '\\n');\n+         self.write('DELETE KEY:  ' + self.manager.keychain.deleteKey(stream.id) + '\\n\\n');\n+       });\n+ \n+       self.write('\\n');\n+ \n+       self.prompt();\n+ \n+     }\n+ \n+   });\n+ \n+ };\n+ \n+ /**\n   * command\n   *\n   * helper function that interprets client\n***************\n*** 386,391 ****\n--- 423,432 ----\n        this.list();\n        break;\n\n+     case 'listkeys':\n+       this.listkeys();\n+       break;\n+ \n      case '?':\n      case 'help':\n        this.help();\n\n. On linux, the install creates a link at /usr/local/bin/phant\nCheck to see if that's present on your system. It could be there but you might not have /usr/local/bin in your normal PATH variable, so just invoking \"phant\" won't find it.\nYou would need to provide more details about how you installed phant and show the full path to the node_modules folder where phant was installed for anyone to give more advice.. The .bin/serve file is the target of the link I see installed at /usr/local/bin/phant\nYou could try running either\n/Users/sophikravitz/.node_modules_global/bin/phant\n\nor\n/Users/sophikravitz/.node_modules_global/lib/node_modules/phant/.bin/serve\n\nto see if that gets the server started.\nIf it works, you could choose to make a link named \"phant\" in a directory that is in your PATH.. The name of the stream.csv files are derived from entries in the streams.db file. What do you see in your phant_streams directory and its subdirectories? Is it possible there's a permissions problem?. I didn't find a way to do this without modifying .bin/serve:\n3cc3895791e6ec7f552a8067084cab8fdc368a5c\nYou should be able to ignore the parts about Docker. My goal was to be able to switch between http or https with just env changes, once I merged in my changes to .bin/serve. I thought I had gotten that version working, but it's apparently not what I'm currently running.\nprocess.env is supposed to be created by the dotenv.load call close to the beginning of .bin/serve. I know I was having difficulty figuring out which directories were being looked at for the .env file.\nSo let me give you the some diffs for the more brute-force version:\n```\n45c46\n< Phant.HttpServer.listen(http_port);\n\n\nPhant.HttpsServer.listen(http_port);\n56,57c57,58\n< // attach manager to http server\n< Phant.HttpServer.use(httpManager);\n\n\n\n// attach manager to https server\nPhant.HttpsServer.use(httpManager);\n59,60c60,61\n< // attach input to http server\n< Phant.HttpServer.use(httpInput);\n\n\n\n// attach input to https server\nPhant.HttpsServer.use(httpInput);\n62,63c63,64\n< // attach output to http server\n< Phant.HttpServer.use(httpOutput);\n\n\n\n// attach output to https server\nPhant.HttpsServer.use(httpOutput);\n81c82\n< console.log('phant http server running on port ' + http_port);\n\n\n\nconsole.log('phant https server running on port ' + http_port);\n```\n\nYou also need to supply pointers to your cert. Other people have done this by modifying HttpsServer.js but I think I had it working by adding lines like the following to .bin/serve after HttpsServer is 'require'd but before it is instantiated.\n+    Phant.HttpsServer.cert = process.env.PHANT_CERTFILE;\n+    Phant.HttpsServer.key = process.env.PHANT_KEYFILE;\nwhere you can directly assign strings for the paths to these files on your server instance, unless you figure out how to do the dotenv processing to work better than I was able to do.\n=====\nAs you can see, I was trying to make changes that would allow a version of Phant that would be entirely configured from env files and could be packaged as a Docker container. Changes to .bin/env seemed unavoidable, but it seemed I could leave everything else untouched.\nAs with all too many projects, this moved further and further down the stack to the point where it was no longer making any progress. I like the approach Phant takes better than other loggers I have looked at because it has a fairly simple web-based API that can be implemented naively, without requiring extensive driver code in each implementation language. In some ways, it's fine that Sparkfun does not seem to have been making any changes or improvements to it. I still hope to get back to working on this task so that my occupation of the namespace with \"phantj\" is not for nought.. ",
    "Sophi": "Thanks. That path /usr/local/bin/phant is not present\nPhant is installed /Users/sophikravitz/.node_modules_global/lib/node_modules/phant/.bin/serve\nI installed phant in my node folder like this:\n\n. Thanks! That worked.. ",
    "floresta": "This is essentially the same (unanswered) problem that was previously posted in  #225, and #228.  \nI have been able to post in streams that I created earlier, but not in any that I have created in the past month or so.  Here is how I see the situation:\n\nA new feed can be set up with no new problems.  (The confirming e-mail is never received, but that is not new).\nA proper GET request results in a \"200 OK\" response.\nA proper HTTP request results in a \"1 success\" response.\nAfter either or both of the above, a check of the feed results in a page with no column headings and no data.\nA request for a CSV results in a \"no data has been pushed to this stream\" response\n\n. . It looks like some progress has been made as there is now some evidence that the problem has at least been recognized.\nThe link that formerly invited one to create a new stream now says: \"Sorry...phant is currently not creating new data streams\".. You probably should take a look at the information in the sections with a red background on the main 'data.sparkfun.com' page and draw your own conclusions.\nDon. ",
    "don": "Rather than change Phant, I set up a virtual host in nginx and proxy http and https traffic to 8080\nserver {\n  listen 80;\n  listen [::]:80;\n  server_name phant.example.com;\n\n  # SSL configuration\n  listen 443;\n  listen [::]:443;\n  include snippets/ssl-params.conf;\n  ssl_certificate /etc/letsencrypt/live/server/fullchain.pem;\n  ssl_certificate_key /etc/letsencrypt/live/server/privkey.pem;\n\n  root /var/www/phant/html;\n\n  # skip the proxy for letsencrypt\n  location /.well-known {\n  }\n\n  location / {\n    proxy_pass http://localhost:8080/;\n  }\n}.\n",
    "NiallHurley": "(on data.sparkfun). thanks - I saw that - i've been hitting 'refresh' on my pages every day - looks like i'll need to figure out how to do some HTTP requests on my electric imp... . ",
    "caseydentinger": "per commented chunk below, when will the private key arrive in the header?\n. i think express modifies the request because i get\nTypeError: Object #<IncomingMessage> has no method 'param'\ni am thinking i'll derive everything log and clear need in this block and modify those functions to take that data.  @toddtreece?\n. the only thing i think is having it named req is a little confusing because it's no longer the vanilla request after we've added some stuff to it.  but i dunno what else to call it because the request is what it represents.\n. "
}