{
    "rimusz": "fixed in v0.1.4\n. fixed in v0.1.4\n. what exactly happened there?\n. fixed in v0.1.4\n. @stevesloka yes vagrant sucks without network, this is why I made xhyve based one Apps.\nI'm thinking to convert my https://github.com/rimusz/coreos-osx-gui-kubernetes-cluster one to xhyve too, but xhyve is not so easy dealing with getting IPs. Will start working on it at some time as next week I'm going to San Francisco DevOps days and KubeCon, the Barcelona DockerCon and Distributed Matters. Need to find time for it :)\n. @stevesloka also take a look to https://github.com/rimusz/coreos-osx-gui which is great to build docker/rkt images and has built in docker registry, so you can use docker images for this App k8s cluster\n. @brendandburns it gets annoying to type the password twice:\n1) to get mac address via uuid\n2) to start VM with xhyve\nas both need sudo\nI'm looking for other solutions to get rid of asking/saving user's password to be used for sudo\n. @brendandburns maybe for the start I can ask at the install part to save or not to save the password and work from there with two different options\n. @brendandburns cool, I got keychain working fine, but a bit stuck on replacing python web server to go based\ngo based web server works fine for my other App, so the strange problem with this App :)\n. @brendandburns fixed with v0.1.8\n. @v1k0d3n  I need more details the steps you did.\nApp uses xhyve which comes with it.\nWhat do you mean about unclear instructions?\n. btw I will a new version soon, which does not save Mac user's password to the disk but saves to Keychain instead\n. Just under \"Setup\" you need to type your Mac user password, maybe that step was not right?\nas \"sudo\" needs to be used twice in the App, get macaddress to uuid and start xhyve\n. @ben I never had issues with DNS before, as I use xhyve for my two Apps. xhyve creates a network bridge on 192.168.64.1so DNS should resolve at no problem there. It might be your Mac network then, try to reboot it.\n. I use xhyve based Apps since xhyve came out, never had issues with DNS, try to stop dnsmasq and see what happens.\nBut I never use docker-machine, maybe the problem is there?\n. @ben told ya :)\n. @interstateone nice one, thanks\n. @gedw99 this is purely done for local kubernetes manifests as rc, services and etc testing.\nYou can point your kubectl to GCE cluster when you have tested locally and create kubernetes services in the cloud then.\n. oh my ..., big refactoring is done there :)\nI do not want to merge to the master yet, as I have travel a lot for the next few weeks, so do not want to break the App which I want to use for demos :) But would be nice to get merged at some point next month and reuse for my other Apps too :)\nNoticed a few errors in \n\n. also, are you good in converting to swift? that help also would be good :)\n. I tried to compile your repo master brach and got that error.\nAwesome regarding the Swift :)\nI have two Apps based on xhyve, both I would love to both to get refactored :) and convert them to Swift later. Then I can take one as a base and move my other Apps to xhyve & Swift :)\n. phew, finished with my conferences\nI have made some good improvements to the App, can you please rebase your changes against the latest master branch.\n. awesome job, thanks man\nI will merge it, then I need to do some refactoring of shells scripts :)\nWould you mind to do the same refactoring for my other xhyve based App https://github.com/TheNewNormal/coreos-osx please.\nThen we can move on to swift.\nWhen we have kube-solo ported to swift I can start working on https://github.com/TheNewNormal/kube-cluster-osx, xhyve based k8s cluster with master+ 2 nodes\n. @interstateone sure, not a big deal, you already have done an outstanding job :)\nI will use as a base kube-solo App for my future Apps, and will try to find some time to convert the coreos-osx one myself.\n. v0.2.2 will have this functionality \ncc/@v1k0d3n\n. selected stable and beta versions now can be installed \n. @v1k0d3n latest v0.2.6 fully supports of any kubernetes version install\n. sure, I will take a look, it should be possible to implement\n. @rroopreddy does not look that `kube-up.sh' creates any service account, it depends on the examples\nyou are trying to run needs. You need to create some service account e.g.:\napiVersion: v1\nkind: ServiceAccount\nmetadata:\n  name: somename\n. Can you please provide an example you are trying to run?\n. right, I do use 10.11.2 myself, need to so how to reproduce it.\nWhat kind of Mac do you have?\n. Also can you check if the root.img is in the ~/kube-solo folder?\n. try to reboot your Mac, as sometimes xhyve cannot start properly \n. xhyve is baked in to corectl tool, try- corectl ps\n. the binary of corectl is in ~/kube-solo/bin folder\ntry to clone corectl repo and run an example from there, might help us to find out why it is the VM is booting for you \n. @julienmarie thanks for your debug information, need to check why it is causing problems on stable channel. \n@AntonioMeireles you use 10.10.xxx, can you try to reproduce the problem?\n. @julienmarie I'm not able to reproduce the VM not booting (VM boots to format the disk and then restarts with another config, which saves on installing mke2fs tools) on stable on 10.11\n. @julienmarie can you the test for me, create and format root.img with mke2fs and label it with ROOT label then try to boot onto stable channel, thanks\n. @julienmarie please try the latest kube-solo v0.4.1, thanks \n. Root disk is not used anymore, so it's formatting should not be a problem \n. interesting issue, as it looks like the ~//kube-solo/kube/kube.tgz file (k8s binaries) does not get copied to VM when it was provisioned.\n@jchauncey can you show me the output when you the provision the fresh VM?\nYou should see there like this:\nInstalling Kubernetes files on to VM...\n[corectl] uploading 'kube.tgz' to 'k8solo-01:/home/core/kube.tgz'\n40.49 MB / 40.49 MB [======================================================================] 100.00 %\nDone with k8solo-01\n. it does upload, get the latest v0.4.2 with the fixed upload progress, and can you try beta/stable CoreOS?\n. even using the alpha?\n. sweet, thanks for testing \n. @jchauncey weird one, will try to reproduce it. Can you in mean time try to use another coreos channel e.g. stable and see if it works for you, thanks \n. I have tried all three channels on both Apps kube-solo and coreos-osx, both can ping outside \n. @olalonde which OS X 10.10 or 10.11 you have ?\n. yes, both projects are mine. the kube-solo is based on corect/xhyve so this why it got moved to the new thenewnormal github org, which is for corectltool and Apps based on it. I'm porting coreos-osx-kubernetes-cluster to corect/xhyve as well, so that project in future will removed to thenewnormal github org\n. no, it looks like you are having a problem with settings file and this is why the VM does not boot for you.\nCan you post the ~/kube-solo/settings/k8solo-01.toml content, please. thanks \n. @drcamp hmm, in your settings file there should be only one sshkey =..., as having more gives the error. Which App version are you using?\n. @zeroem you settings file looks fine, for some reason VM does not boot.\nWhich App version are you using?\n. @drcamp can you try new v0.4.7 version, please?\n. sudo is not needed there if you follow the right install procedure.\n@AntonioMeireles can we get your input here?\n. cool, can we close this then?\n. awesome \n. @jtblin kube-solo does not use the kubelet which comes with coreos.\nall files required by kubernetes get copied to VM when install is done\nand the ~/kube-solo/kube/kubeconfig has not server IP because the VM was not able to start \n. @esbenp ssh to kube-solo VM and check that the internet is accessible from there\n. @esbenp you have failed docker.service unit there, check it's logs\nand post it here\n. @esbenp can you journalctl -u docker.service -las the messages are cut\n. this is our problem lstat /var/lib/docker/volumes/65a7aad8ad1b612babb001d8cbdbe45775697d3ba5a73942e8740810aa70ef68: input/output error\nThe docker did not get mounted properly, I use ext4 there, will try to switch to btrfs in the next release.\nHeading to the KubeCon today, so will cut a new version next week\n@AntonioMeireles any advice on this problem?\n. guys can you try the latest https://github.com/TheNewNormal/kube-solo-osx/releases/tag/v0.6.0 to see if the problem still exists, thanks\n. Latest v0.6.3 addresses those issues\n. I will introduce in the next version of the App more checks and more detailed error messages to know what the problem is.\n. @chrislovecnm already tried to introduce nfsd restart and nfsd update without a luck :(\nwe hope with Antonio to have new version of corectl soon, which will have optional nfs as in most cases it is not needed on kube apps \n. the latest v0.8.0 should fix all these problems\n. I need to think how to use tmux, as I do not want to break App's work for everybody else who do not use tmux\n. this one https://github.com/TheNewNormal/kube-solo-osx/blob/master/src/up.command gets called the you do Up\n. @wstrange sudo password is needed for corectl/xhyve to boot VMs \n. @AntonioMeireles such message would be really nice to have and then the VM's boot should continue\n. @AntonioMeireles is working on some solution :)\n. @piepkrak NFS is disabled, so should not be the issue anymore\n. @jchauncey there is an option to change the password in Setup\n. @whitlockjc docker registry in CoreOS OSX App is configured to work without https, do not see any point of it for the private local registry.\nI do not include private registry in kube-solo as there is kube-cluster app too, which needs to access to docker registry.\ncoreos app is used to build docker containers and has the private registry docker images to be pushed to, then images can be reused by kube apps.\nIf there is a demand to have a separate docker registry App, I can make it up, but for now nobody else have asked for it.\n. I was thinking how to make better use of private docker registry. One more small I think will be too much to have.\nWhat I'm going to do is separate the coreos VM boot and docker registry start.\nI will add an extra menu options to coreos VM App to start/stop docker registry,\nthat will allow build docker images and push to registry, then stop coreos VM and\nstill able to reuse docker registry from kube Apps\n. docker registry works on CoreOS VM just fine, but just does not use the https, so use http and you will be fine.\nAs mentioned before I do not see any point use https for the local docker registry setup, no needs to complicate things\n. I use registry on CoreOS VM e.g. like this:\n```\n$ docker pull alpine\nUsing default tag: latest\nlatest: Pulling from library/alpine\n2314ad3eeb90: Pull complete\nDigest: sha256:d7201bdfa765bebed9a79c385db4378f55593e50dc8d002b9713810320ad93b9\nStatus: Downloaded newer image for alpine:latest\n$ docker tag alpine 192.168.64.1:5000/alpine\n$ docker push 192.168.64.1:5000/alpine\nThe push refers to a repository [192.168.64.1:5000/alpine] (len: 1)\n2314ad3eeb90: Image successfully pushed\nlatest: digest: sha256:dded5fb5deaf6f7b186a84841e76d2340391a202618dd9697688ef4d9a1b2f21 size: 1369\n```\nAs you see it works just fine \n. ah, docker-machine again, this is why I do not use it as I like my default shell to be clean.\nI will release a new version next week with DOCKER_TLS_VERIFY= DOCKER_CERT_PATH= in preset shell.\n. @whitlockjc https://github.com/TheNewNormal/coreos-osx/releases/tag/v1.2.2 automatically presets: \nDOCKER_TLS_VERIFY= \nDOCKER_CERT_PATH=\nPlease check it out and let me know if any issues you have encountered \n. related only for CoreOS VM App\n. yup, it does do that to ignore your ~/.kube/config and then kubectl can connect to kube-solo master correctly \n. @whitlockjc as I have mentioned above kube-solo does not touch your /.kube/config, when you open Preset OS Shell via App then $HOME/kube-solo/kube/kubeconfig is used. If you open another shell window not via App then your kubectl will look to /.kube/config. As in that way you can work with two k8s clusters at once.\n. @mbrevoort first able the Virtual Box is not needed for this App to function.\nAnd you cannot run the App directly from the dmg file, you  need to drag the App to your Desktop or Applications folder and run from there.\n. @mbrevoort latest App version v0.5.3 does not allow to start the from the DMG, it should be fix your problem \n. @mbrevoort your network setup just was messed up, maybe by virtualbox, rebooting should sort you out.\n@AntonioMeireles is any way why we can check with corectl it and reset the network ?\n. @puja108 yup, that's really annoying, but as my use case does not need any vbox/vagrant based setups\nI do not encounter such problems. I hope docker opens their Docker for Mac code, so we can reuse their fixes they have done for the xhyve.\n. @puja108 I do not want pure @AntonioMeireles to spend time fixing that problem :)\n. @puja108 we already saw that announcement and @AntonioMeireles is going to look more deeply to the fixes done there tomorrow \n. the latest version v0.8.0 should fix all these problems\n.  might be still in downloading of containers process\ncheck with kubectl --namespace=kube-system get po for pod kubernetes-dashboard-v1.0.0\n. @markTward Deis Apps usually are accessed in the case of Kube-Solo via router IP, as there is no LoadBalancer.\ne.g. app_name.kube-solo_ip.xip.io \n. it looks like the coreos image by corectl tool was not properly downloaded, try to delete the iso image in ~/.coreos folder, delete the VM's ~/kube-solofolder and run Up\n. @BrunoBonacci can you report that issue on https://github.com/TheNewNormal/corectl please, as the problem is related with corectl tool, thanks\n. this problem should be fixed with corectl v0.5.5 which is now included in kube-solo v0.5.9 release\n. @AntonioMeireles ping\n. @BrunoBonacci released https://github.com/TheNewNormal/kube-solo-osx/releases/tag/v0.6.0\n. @rodcloutier I see you are using pot 8888 in kubectl run hello --image=192.168.64.1:5000/hello-node:v1 --port 8888 but hello world example uses 8080\n. @AntonioMeireles ping\n. @chrislovecnm NFS is disabled, too many issues with it\n. @chrislovecnm it does have master services and node ones as well\n. I see, any prebuilt version from https://github.com/kubernetes/kubernetes/releases can be installed via 'Updates->Change Kubernetes version'\nSo basically you want to use locally built binaries, hmm it should be possible to automate, just need to find a time for that.\nAs a work around for now you can built binaries, copy OS X kubectl to /kube-solo/kube and update /kube-solo/kube/kube.tgz with your freshly built linux binaries, then via Setup->Destroy Kube-Solo VM and on next  Up the new VM will be created with kubernetes version in kube.tgz file\n. that hack/build-go.sh takes ages on my mac mini to run \n. @chrislovecnm take a look to https://github.com/TheNewNormal/kube-solo-osx/blob/master/src/functions.sh#L270-L338 and if you have time to hack a new function to build form source the git gist will be very welcome, I will do the rest to include it to the App\n. fixed by #61 \n. @chrislovecnm use $HOME/ instead of ~/\nWhat about the placing the file to ~/kube-solo/tmp/kubernetes.tar.gz and install from there?\n. @chrislovecnm I have changed that you have to copy the file to ~/kube-solo/tmp and it will be installed from there, no option to type the file's path\n. @kvacquier do you have local docker registry running?\n. nope, kube-solo does not have it. but you can use my other app CoreOS VM, with it you can build docker images and it has the local docker registry which is accessible for the kube-solo\n. this not the issue, so I'm closing it\n. need to test it out, to see that it does not break App's functionality \n. @whitlockjc no worries, thanks for the PR, and I'm happy you find the Kube-solo App useful \n. @mboersma can you provide the exact steps, so I can try to reproduce it. thanks\n. @AntonioMeireles ping, any ideas why the corectl could crash after running for 30 min, I'm not able to reproduce it yet.\n. @mboersma please try the latest v0.8.0 it is based on the latest corectl v0.7.x with a separate server daemon and client.\n. awesome\n. @theganyo did your VM start normally? \nYou should not be asked for the password.\n. @theganyo can you do the fresh VM install, something must be went wrong there\n. that's weird one, try to delete the whole app folder, I will look and try to find what could cause this problem\n. @theganyo can you confirm that this problem is still in the latest App version for you. thanks\nopen the issue if the problem persist.\n. @dmcnaught ssh to VM and check that the Internet is reachable from there\n. so you need to check what's wrong with you Mac networking then, try just simple reboot first\n. so something is still not right there, as the App uses xhyve based setup and network there is just a bridge.\n. no, it comes with the App as corectl tool, which is a wrapper around xhyve and made to control CoreOS VMs on Mac.\n. check https://github.com/TheNewNormal/corectl tool and the user-data is in ~/kube-solo/cloud-init\n. Internet check is in place in the lasted App version, the error message will pop up if internet is not accessible.\nI'm closing this one, as this issue is not really related to the App\n. @the-destro can you elaborate your problem?\n. try to use nip.io e.g. 192.168.64.2.nip.io on your phone\n. ping @AntonioMeireles \n. @AntonioMeireles any ideas on this one?\n. I'm not really a man in this case, @AntonioMeireles is, but was too busy recently to look to it.\nin TheNewNormal org all projects are our side/free time projects and we do not get much community help there, so sometimes it is hard to keep up.\n. ah, nice, keep me posted how it goes\n. @huggsboson we are going to make NFS as an optional very soon, that should make easier to use corectl based apps then\nhttps://github.com/TheNewNormal/coreos-osx/issues/76\n. dupe of #30 \n. currently k8s starts via fleet units which allows easily make changes redeploy the changed unit.\nwe can try option 1).\nnever used authn/authz  before, can you provide the kube master settings needed for the change, so i will look how to implement it\nthanks\n. @whitlockjc fleet might be gone from the next version, just do the systemd unit and add it to cloud-init file\n. @whitlockjc the latest version v0.8.7 has no fleet anymore, so update user-data file\n. @whitlockjc update the kube-apiserver.service in fleet folder, then it that folder run ' fleetctl destroy kube-apiserver.service && fleetctl start kube-apiserver.serrvice' and the kube-apiserver will redeployed\n. @whitlockjc corectl.app v0.2.1 works on macOS 10.10, so you can use it with the latest kube-solo v0.8.7. So update the cloud-init there to check authn/authz\n. no worries @whitlockjc \njust edit the kube-solo/cloud-init/user-data file and then halt and up, that's it.\nCan authn/authz stuff be enabled all the time and not used?\n. ok, then just drop your updated user-data file and instructions how to use to me by email, so if there are such needs I have it. :)\nthanks\n. awesome, thanks\n. too much hassle to implement as testing needs to be done for add-ons \n. implemented in v0.8.3\n. fixed\n. @cobrowserAlex kube-ui was replaced by kubernetes-dashboard a while ago already\n. yes, that's is correct, we had way too many problems with NFS.\nI'm going to make it optional in the next release.\n. here we go:\n```\n$ corectl ssh -h\nAttach to or run commands inside a running CoreOS instance\nUsage:\n    corectl ssh VMid [\"command1;...\"] [flags]\nAliases:\nssh, attach\nExamples:\n  corectl ssh VMid                 // logins into VMid\n  corectl ssh VMid \"some commands\" // runs 'some commands' inside VMid and exits\n``\n. the VM's name isk8solo-01. @cobrowserAlex here we go\n![NFS option](https://cloud.githubusercontent.com/assets/5215395/16741037/7b72e82e-4799-11e6-8ca5-ed6e2b4e71db.png)\n. @cobrowserAlex I just ported the code from coreos-vm app :)\nIt was in my plans anyway\nSo I think we can close this one\n. known issue it should be fix in the new Deis Workflow v2.2 release https://github.com/deis/builder/pull/382\n. let's keep it open, so other users can notice the issue\n. the new Deis Workflow v2.2.0 works fine now, so closing the issue\n. @kloudstudio can you explain your steps how got the error in more details, so I can reproduce the problem?\nthanks\n. @kloudstudio ok, I see that, thanks\nBy intentioncorectlfiles are put to/usr/local/sbinso that does not interfere  withcorectlfiles installed in other folders.\nbtw kube apps should only be used withcorectl.app` allow users (not hacky ones) to simplify Apps use.\nIf you want to use in your way, that's fine too, but I do not see this as the issue, so closing this one.\n. @kloudstudio I think I know what happened corectl.app \nAt the start it check that is the first install and opened a new terminal window to save your sudo and continued to start all processes but as the sudo password was not available yet, so corectl files had no chance to be copied to inexistent folder.\nWorking on that corner case.\n. @Tpbrown could you please update first-init.command and up.command as well?\nand test that the change works everywhere as I do not use fish stuff myself :)\n. Closing this one, as it was conflicting with my changes, but I have cherry picked your changes and implemented. Thanks for it :)\n. The corectl.app was made intentionally to avoid brew install corectl stuff. As there are three Apps depending on corectld having a dedicated corectl.app makes more sense.\nPlus we do not want people to force and install brew as not everybody is using it.\nAlso corectl.app has the option via menu Check for corectld updates which downloads the latest version of corectl tools so you do not have visit releases page and downloading and installing manually. \nThe visit releases page and downloading and installing only applies for corectl.app itself.\n. Sorry cannot accept this PR, as that will conflict will corectl.app features and our future plans to merge corectl.app and corectl into one project when we are ready to do delta updates.\nBut anyway thanks for your effort :)\n. you just can sym link /usr/local/bin/corectl to /usr/local/sbin/corectl and use brew installed corectl then\n. this is more question to @AntonioMeireles who is the wizard behind corectl tool used for the apps virtualisation \n. just use nfs volume /Users/my_user:/Users/my_user\n. those f..k Gremlins are always the problem :) \n. hmm, this is something todo with corectl.app, as it copies it's files to ~/bin folder.\nkube-solo app does not have those files by itself anymore\n. phew\n. sure, have that in my plans already, will do it next week\n. v0.9.3 got the cancel option\n. loadbalancer/external IP is cloud provider feature, it will only work with GCP, AWS and Azure. \n. it is nothing to do with the Kubernetes or this VM :)\n. yes, after app install you can use cli to control VM, as per readme:\nAfter successful install you can control kube-solo VM via ksolo cli as well. Cli resides in ~/kube-solo/bin and ~/bin foldersand has simple commands: ksolo start|stop|status|ip|ssh, just add ~/bin to your pre-set path.\n. we usually hang out at kubernetes slack\n. we can close this one, as it answered your question :)\n. sorry it is not me who does homebrew formula or nether anybody from our team. must be some other person does it time by time. so i'm closing this one\n. I used to have the iTerm as a requirement, but guys always forgot to install it and always there an issue opened that app does not work, so I included it with the app, so no needs to install by yourself. Most of user and myself found iTerm more user friendly comparing to Terminal.\nSure I will update docs that iTerm is needed, if not found it will be installed for you.\nPR is welcome to support both :)\n. readme updated \n. ups, forgot that all rcs were moved to deployments. \nI will update the install script with that\n. fixed in https://github.com/TheNewNormal/kube-solo-osx/releases/tag/v0.9.7\n. fixed in https://github.com/TheNewNormal/kube-solo-osx/releases/tag/v0.9.7\n. @AntonioMeireles ^^^\n. hey @seanknox this problem has nothing to do with kube-solo or kube-cluster apps, the problem is with kubectl which is compiled with go v1.6.x, on Sierra go binaries compiled with that go version spit those errors. Only go binaries compiled with go v1.7.x work fine there.\nhttps://medium.com/@gerred/kubectl-1-3-7-for-macos-sierra-ee2c483e283d#.2x4fuh2sj\n. @seanknox yes, that should solve the kubectl problem till we get k8s binaries built with go v1.7.\nI was not able to compile kubectl with go v1.7, as always so many go dependencies there, not really go expert.\n. also I need to update deis_install there (minio), to support latest workflow move from rc to deployments\n. @AntonioMeireles is it possible to add kube-dns Service IP address to /etc/resolve.conf?\nWhat I mean is it possible to add it via cloud config?\n. interesting issue, why the k8solo-01.toml is not there, need to add a check for that file, if not found, copy it from app's bundle.\nCan you try to delete /Users/mike/kube-solo folder and try again, please. thanks\n. interesting, as there is a shell command to create that folder.\nare you using bash, zsh, or other shell?\n. docker for Mac does not make any difference for kube-solo app,\nas corectl tool is based on Docker HypertKit too.\nBooth are using the same native macOS Hypervisor.\nIt looks like something really weird is going on on your mac.\nUsually I try the reboot and see what happens\n. still strange that happens for you only, will try to recheck the k8s initial install part, which was solid for months \n. phew, cool. yes I see that for corectl too, @AntonioMeireles is aware of it (he is corectl maintainer)\n. @mkarliner the kube-solo should not hang on waiting for Kubernetes cluster to be ready , fixed it in #146 \n. also looking to that corectl still doesn't start correctly on boot https://github.com/TheNewNormal/corectl.app/issues/39\n. sorry, have not updated helm install part yet, as it got changed again in upstream :)\n. fixed in https://github.com/TheNewNormal/kube-solo-osx/releases/tag/v0.9.7\n. @olalonde I can you explain the steps you did there, so I can try to reproduce it, thanks\n. added @viglesiasce comments from k8s helm channel:\nin order to work around that could you implement a static route at the OS level to point the service IPs to the vm ip?\nroute -n add 10.212.0.0/24 192.168.64.3\nwhere service ip range is 10.212.0.0/24 \ncould also be done for pod ips\n. @AntonioMeireles ^^^\n. we are already looking to it. this one is blocked by getting host networking vodooo more resilient (all working when vpn tunnels in use). ideal solution would be to consume docker’s vpnkit - mess is that it isn’t clear that it would be multiVM out of the box (as we are a bit more evolved than them)\n. The default Terminal would be easier to be used instead of tmux\nThe required terminal app could be stored in some settings file and used opening shell scripts\n. ok, cool\n. thanks for the PR, this only work for first initialisation, up.command will not use tmux as obj-c calls up.command shell script via iTerm.\n. thanks for spoting it, and for the PR, will cut a new release tomorrow\n. thanks for the PR 👍 \nbtw is the latest app version working fine for, specially VM's UP, as there is issue opened #151 whcih I cannot reproduce\n. sleep I know was the issue before for sure. @AntonioMeireles can you confirm/explain about sleep?\n. hmm, strange one, will make a new app dmg soon\n. @iamShantanu101 can you please download k8solo v0.9.9 again, I uploaded rebuilt version, thanks\n. can you provide some more detailed setup on your side\n. maybe so macos glitch\n. Loadbalancer is cloud provider feature, e.g.GCP, AWS, it will not work on any kube app or any vagrant based setup\n. yup\n. sure, was going to delete the old versions anyway\n. thanks for reporting, yes I get the same problem with the Dashboard after VMs reboot.\nHmm nothing works in kube-system namespace.\nNeed to investigate it why.\n. fixed in v1.0.0\n. it is not in panic mode, it is just encoded text :)\n. I will keep it open till we sort out qcow-tool dependencies in corectl\n. we hope to handle that with qcow-tool soon\n. thanks for PR. could you please remove macOS changes to OS X, as it is now called macOS\n. cool thanks, will review and merge later one, doing house duties right now :)\n. thanks, all good, I have merged it :)\n. thanks a lot @martinhoefling for this one, that missing docker binary was on my ASAP list.\ni will test PR tomorrow and cut new version then.\n. @martinhoefling could you replace curl -o ~/kube-solo/bin/docker https://get.docker.com/builds/Darwin/x86_64/docker-$DOCKER_VERSION.tgz to curl -O https://get.docker.com/builds/Darwin/x86_64/docker-$DOCKER_VERSION.tgz?\nas there is no .tgz downloaded.\nthanks\n. no worries, fixed it myself\n. could you try to delete SecurityContextDeny  https://github.com/TheNewNormal/kube-solo-osx/blob/master/src/cloud-init/user-data#L168 in ~/kube-solo/cloud-init/user-data and check if that fixes for you. if it does I will cut a new app version.\nthanks\n. i'm off this week, will do it when i'm  back. fixed in https://github.com/TheNewNormal/kube-solo-osx/releases/tag/v1.0.1. hey there, there are many different local k8s solutions. it is not up to me to tell users to use kube-solo app instead of minikube.. added a short text about kube-solo and minikube difference. it could be your network borked, VirtualBox loves to do that, just try to reboot your mac, thanks. sudo systemctl stop docker and sudo systemctl start docker is the way, strange it did not work for you. I do not see that as a big deal as usually I reboot VM for such needs.. @AntonioMeireles any idea what could be wrong with Openpgp there?\nWithout looking to logs I cannot tell why your iTerm2 crashes.. the crash report that popup when Iterm2 starts ones, please\ncan you try to install Openpgp and see if that helps?. ok, that's the iTerm crash log, no idea why that app crashes.\nwhich version of iTerm you have there?. /Applications/Kube-Solo.app/Contents/Resources/kube-solo-install.command is the script app starts, but it will not work from terminal on it's own.. try to reboot your Mac.\nAlso how did you install kube-solo and corectl? \nkube-solo needs corectl.app) which takes care of corectl install.\nWhat did you install with brew ?. ok, I see, the brew stuff is not mine, so I cannot comment what is wrong with the install.\nUninstall them and install from releases:\nhttps://github.com/TheNewNormal/corectl.app/releases\nhttps://github.com/TheNewNormal/kube-solo-osx/releases\nthen let me know, thanks . uninstall openpgp and try https://gpgtools.org/. GPGTools work just fine for me.\nmust something specific with your Mac setup. kube-solo menu has an option Preset OS shell which has all kubectl and docker settings set.\nThe file is:\nhttps://github.com/TheNewNormal/kube-solo-osx/blob/master/src/os_shell.command. please open an issue at corectl as kube-solo is just a wrapper around it.. do not think so @AntonioMeireles had a chance to get it working yet. yes, seen that a few times, not really easy to reproduce.\njust delete the data.img file and run Up from menu, in my case it works the second time.. hey there, you are using the wrong host path, which point to in memory folder.\nyou need to use /data one, so your data can persist.. you need to change your mongodb deployment to:\n...\n        hostPath:\n          path: /data/var/mongo\n...\n. really weird one, but wasn't able to reproduce it. sorry for the late delay, you can add the --insecure-bind-address or --basic-auth-file in this part https://github.com/TheNewNormal/kube-solo-osx/blob/master/src/cloud-init/user-data#L164-L179. where are you adding --basic-auth-file=/Users/weisburd/kube-solo/cloud-init/basicauth to?. you cannot point to file that way, copy that file to VM first. here is the part where you can add files https://github.com/TheNewNormal/kube-solo-osx/blob/master/src/cloud-init/user-data#L270 them use that path --basic-auth. thanks, merging it. 👍 . kube-solo only supports etcd v2 for now (needs work on it), kubernetes v 1.6 and v1.7 only work with etcd v3 . not sure that is really related to kube-solo, but apps they do behave differently on local and cloud deployment. we are going to cut a new https://github.com/TheNewNormal/corectl version hopefully tomorrow, to fix that issue\n. I'm waiting for @AntonioMeireles to release a new version of https://github.com/TheNewNormal/corectl . ",
    "slack": "Clicked App Dropdown -> Quit\nThen from a process listing, I still saw a bunch of xhyve instances running.\n. ",
    "stevesloka": "Awesome awesome good to hear. I'm completely new to xhyve so I will look to dig in and see what I can come up with. If there's ever something that I can help out with would love to. Thanks again for the really cool app!\n. Ohh very cool. I built a separate VM to do just that. I think I need to just figure out a way to deploy k8s on local CoreOS vms and I'll be happier, that way my restarts / shutdowns should be better. I'll check this out as well.\n. ",
    "brendandburns": "understood, but the security policy for my laptop forbids things like this, so I need some sort of solution no matter how annoying...\nMaybe you can use the OS X keychain somehow?\n. sgtm.  thanks\n. ",
    "v1k0d3n": "yes please! :+1: i saw mr. burns request, and i completely agree. outside of my company I am ok, but this is a sticking point for running on corp MBP. thanks for the addition!\nso I used the included project to compile the application and grabbed the final application artifact (.app file), ran it and used the menu bar \"Setup\" and \"Up\" menu items. Is there more to it?\nbtw. thanks for the quick response! :smile: \n. deleted the /Users//kube-solo directory and ran Setup again, and things skipped along happily. thanks for the awesome project! excited to see where this ends up going and having more features/options added in.\n. resolved. closing issue.\n. ",
    "ben": "A reboot hasn't fixed the issue, I wonder what's going on. I do have dnsmasq running on my OS X machine, but that shouldn't interfere with this. I also have docker-machine running with three VirtualBox-managed machines, but VB is v5.0.4. I've never before used xhyve on this system.\n. :confused: Disabling dnsmasq while the xhyve image boots makes it work. Weird. Thanks!\n. ",
    "ghost": "I mean gcloud. Oops\n. OK thanks. I will try it out\n. Absolutely:\n[k8solo-01]\n   uuid = \"90394897-5956-4F9D-AFC4-E274C45DAB31\"\n   channel = \"stable\"\n   volume = \"data.img\"\n   cloud_config = \"cloud-init/user-data\"\n   cpus = 2\n   memory = \"2048\"\n   local = \"true\"\n   sshkey = 'ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQClRyPOp59k2zrmwKTtOpQrUTBgITDEiGYF/HcRbxKnkApItsSZdVLrVM88gtegmJ8zc2y6MDliOGVDHmxoooGx3u2mIcBlyIt3k1UvpfhFAoZR3Jju1mkqevOP844JqvZSgZvpzHUT+lvXs6u9rpDOJugUnMxFM/xuYDpK/+ccN6xhFVm34Irb/jQv7Obhe5DkLdnM+Lijv8IJzRVLktBs4k//mTj3+LyQ387RUCoJmLEWQpNdgAS8qtvuKnDAe89j8PPEnpOZSeuzcIlZuqSGu8VbUkl4wG3j4ygQc9OrazabWkYq7WVj1CzEZ58wd68oFtF2LZ+XWopf2vL+dXWD dcvirt@dcvirts-Mac.local'\n   sshkey = 'ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQClRyPOp59k2zrmwKTtOpQrUTBgITDEiGYF/HcRbxKnkApItsSZdVLrVM88gtegmJ8zc2y6MDliOGVDHmxoooGx3u2mIcBlyIt3k1UvpfhFAoZR3Jju1mkqevOP844JqvZSgZvpzHUT+lvXs6u9rpDOJugUnMxFM/xuYDpK/+ccN6xhFVm34Irb/jQv7Obhe5DkLdnM+Lijv8IJzRVLktBs4k//mTj3+LyQ387RUCoJmLEWQpNdgAS8qtvuKnDAe89j8PPEnpOZSeuzcIlZuqSGu8VbUkl4wG3j4ygQc9OrazabWkYq7WVj1CzEZ58wd68oFtF2LZ+XWopf2vL+dXWD dcvirt@dcvirts-Mac.local'\n   sshkey = 'ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQClRyPOp59k2zrmwKTtOpQrUTBgITDEiGYF/HcRbxKnkApItsSZdVLrVM88gtegmJ8zc2y6MDliOGVDHmxoooGx3u2mIcBlyIt3k1UvpfhFAoZR3Jju1mkqevOP844JqvZSgZvpzHUT+lvXs6u9rpDOJugUnMxFM/xuYDpK/+ccN6xhFVm34Irb/jQv7Obhe5DkLdnM+Lijv8IJzRVLktBs4k//mTj3+LyQ387RUCoJmLEWQpNdgAS8qtvuKnDAe89j8PPEnpOZSeuzcIlZuqSGu8VbUkl4wG3j4ygQc9OrazabWkYq7WVj1CzEZ58wd68oFtF2LZ+XWopf2vL+dXWD dcvirt@dcvirts-Mac.local'\n. Using 0.4.6\nI started from scratch and get the same problem. The extra ssh entries were due to me retrying the setup after ctl-c and running /Applications/Kube-Solo.app/Contents/Resources/first-init.command.\n. @rimusz \nSame problem. Run setup as sudo, fleetctl is not getting installed. \n. @zeroem \nI can get past that issue if I ctl-c as soon as the script starts and run it via sudo, but get to the \"Waiting for Kubernetes cluster....\" and it hangs \n. UPDATE:\nRemoved all kube-solo bits, rebooted machine, installed with 0.4.7 and all is well thus far. Not sure what the issue was.\n. @rimusz \nYes, let's do. I will work on it tonight and start a new issue-thread if needed. \nThanks everyone,\n-DC\n. Any updated status on this, I am also getting the same issue with the latest release.. ",
    "interstateone": "Sounds good, I'll wait to hear back about any merge issues when you're ready. Regarding the errors you shared: are you seeing those on the head of this branch? Those should have been fixed.\nSwift: yes :smile: Can do that as a separate PR once this one is merged.\n. This PR is from my CodeOrganization branch to your master, my master hasn't been changed.\n. @rimusz I've rebased this onto your latest master and fixed the few conflicts there were.\n. Not sure I'll have time to refactor the other repo for a while, going to be taking an extended trip without much internet, which I need to prepare for. Hope I was able to help while I could :) All the best. \n\nOn Dec 9, 2015, at 1:25 PM, Rimas Mocevicius notifications@github.com wrote:\nawesome job, thanks man\nI will merge it, then I need to do some refactoring of shells scripts :)\nWould you mind to do the same refactoring for my other xhyve based App https://github.com/TheNewNormal/coreos-osx please.\nThen we can move on to swift.\nWhen we have kube-solo ported to swift I can start working on https://github.com/TheNewNormal/kube-cluster-osx, xhyve based k8s cluster with master+ 2 nodes\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "rroopreddy": "@rimusz This is getting created somewhere part of kube_up.sh invocation. , I see the following on on AWS Kubernetes cluster I started with \"kube_up.sh\"\n$:~/cluster-deployment/kubernetes$ ./cluster/kubectl.sh get secrets\nNAME                  TYPE                                  DATA      AGE\ndefault-token-kcb4i   kubernetes.io/service-account-token   2         7d\n$:~/cluster-deployment/kubernetes$ ./cluster/kubectl.sh get serviceaccount\nNAME      SECRETS   AGE\ndefault   1         7d\n. examples/cassandra from the kubernetes examples folder\nOn Tue, Dec 1, 2015 at 8:48 AM, Rimas Mocevicius notifications@github.com\nwrote:\n\nCan you please provide an example you are trying to run?\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/TheNewNormal/kube-solo-osx/issues/12#issuecomment-161027957\n.\n\n\nRegards,\n☼ Ravi\n. ",
    "julienmarie": "I'm on a macbook pro (1 year old). The root.img is there, 5.37Gb. \n. Had the same problem with coreos-osx\n. ok i try\n. Same. Here is what I have\n```\n/Applications/Kube-Solo.app/Contents/Resources/first-init.command; exit;\nSetting up Kubernetes Solo Cluster on OS X\nReading ssh key from /Users/julienmarie/.ssh/id_rsa.pub\n/Users/julienmarie/.ssh/id_rsa.pub found, updating configuration files ...\nYour Mac user's password will be saved in to 'Keychain'\nand later one used for 'sudo' command to start VM !!!\nThis is not the password to access VM via ssh or console !!!\nPlease type your Mac user's password followed by [ENTER]:\nThe sudo password is fine !!!\nSet CoreOS Release Channel:\n 1)  Alpha\n 2)  Beta\n 3)  Stable\nSelect an option: 3\nPlease type ROOT disk size in GBs followed by [ENTER]:\nCreating 5GB disk (it could take a while for big disks)...\n0+0 records in\n0+0 records out\n0 bytes transferred in 0.000015 secs (0 bytes/sec)\n```\nThen stuck for a few seconds\nFormating k8solo-01 ROOT disk ...\nThen nothing\n. If I do \nxhyve -h\nzsh: command not found: xhyve\nDoes it help?\n. installed xhyve via brew in case... no change\n. I upgraded to Capitan last night. No change.\nI was thinking it has something to do with dd.\nI ran some examples of corectl.\ncorectl runs works fine\nthis command doesnt work \ndd if=/dev/zero of=var_lib_docker.img  bs=1G count=1\ndd: bs: illegal numeric value\nthis works\ndd if=/dev/zero of=var_lib_docker.img  bs=1m count=1024\n1024+0 records in\n1024+0 records out\n1073741824 bytes transferred in 3.899426 secs (275358928 bytes/sec)\nthen the formatting works:\n```\n julienmarie@WiseBook-2  ~  /usr/local/Cellar/e2fsprogs/1.42.13/sbin/mke2fs  -t ext4 -m0 -F var_lib_docker.img\nmke2fs 1.42.13 (17-May-2015)\nEn train de créer un système de fichiers avec 262144 4k blocs et 65536 i-noeuds.\nUUID de système de fichiers=afb9f6b3-7f59-4c5a-9238-5f25166b79b7\nSuperblocs de secours stockés sur les blocs :\n    32768, 98304, 163840, 229376\nAllocation des tables de groupe : complété\nÉcriture des tables d'i-noeuds : complété\nCréation du journal (8192 blocs) : complété\nÉcriture des superblocs et de l'information de comptabilité du système de\nfichiers : complété\n```\nThe labeling works also\n/usr/local/Cellar/e2fsprogs/1.42.12/sbin/e2label var_lib_docker.img rkthdd\nSo I changed functions.sh create_root_disk:83 function to\ndd if=/dev/zero of=root.img bs=1m count=$[$disk_size*1024]\nNow I have this that seems better:\nCreating 5GB disk (it could take a while for big disks)...\n5120+0 records in\n5120+0 records out\n5368709120 bytes transferred in 17.840875 secs (300921848 bytes/sec)\nThen still stuck on\nFormating k8solo-01 ROOT disk ...\nMy ps aux | grep corectl shows : \njulienmarie     46265   0.0  0.0  2434836    748 s005  S+    9:01AM   0:00.00 grep --color=auto --exclude-dir=.bzr --exclude-dir=CVS --exclude-dir=.git --exclude-dir=.hg --exclude-dir=.svn corectl\nroot            41415   0.0  0.0        0      0 s006  Z+    8:56AM   0:00.00 (corectl)\nroot            41276   0.0  0.1 573431596  12472 s006  S+    8:56AM   0:01.01 /Applications/Kube-Solo.app/Contents/Resources/bin/corectl load settings/format-root.toml\nroot            41272   0.0  0.0  2454644   3044 s006  S+    8:56AM   0:00.01 sudo /Applications/Kube-Solo.app/Contents/Resources/bin/corectl load settings/format-root.toml\nCould it be possible to use mke2fs if it's installed instead?\n. When I execute just \nsudo \"${res_folder}\"/bin/corectl load settings/format-root.toml\nin functions/sh\nI get\nFormating k8solo-01 ROOT disk ...\n booting k8solo-01\n[corectl] stable/835.9.0 already available on your system\nAnd in the same time, \n/Applications/Kube-Solo.app/Contents/Resources/bin/corectl ps\n[corectl] found 0 running VMs, summing 0 vCPUs and 0MB in use.\n. I don't know it it helps \n```\nsudo /Applications/Kube-Solo.app/Contents/Resources/bin/corectl --debug load /Users/julienmarie/kube-solo/settings/format-root.toml\n\nbooting k8solo-01\n[corectl] stable/835.9.0 already available on your system\nError: stat cloud-init/user-data-format-root: no such file or directory\n\nUsage:\n  corectl load path/to/yourProfile [flags]\nExamples:\n  corectl load profiles/demo.toml\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\n```\n. Ok updated to 0.39 and used alpha channel. It works.\nStable channel doesnt\n. ",
    "jchauncey": "```\nFormating k8solo-01 ROOT disk ...\n\nbooting k8solo-01\n[corectl] alpha/899.1.0 already available on your system\n[corectl] '/Users' was made available to VMs via NFS\n[corectl] started 'k8solo-01' in background with IP 192.168.64.2 and PID 20962\nmke2fs 1.42.13 (17-May-2015)\nCreating filesystem with 15728640 4k blocks and 3932160 inodes\nFilesystem UUID: 09c3b47e-999d-4dae-b668-790db2614707\nSuperblock backups stored on blocks:\n    32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208,\n    4096000, 7962624, 11239424\n\nAllocating group tables: done\nWriting inode tables: done\nCreating journal (32768 blocks): done\nWriting superblocks and filesystem accounting information: done\n[corectl] successfully halted 'k8solo-01'\nROOT disk got created and formated...\nStarting VM ...\n\nbooting k8solo-01\n[corectl] alpha/899.1.0 already available on your system\n[corectl] '/Users' was made available to VMs via NFS\n[corectl] started 'k8solo-01' in background with IP 192.168.64.2 and PID 21003\n\nWaiting for VM to be ready...\nfleetctl list-machines:\nMACHINE     IP      METADATA\n4b99c2b8... 192.168.64.2    -\nInstalling Kubernetes files on to VM...\n[corectl] uploading 'kube.tgz' to 'k8solo-01:/home/core/kube.tgz'\n0 B / 40.49 MB [----------------------------------------------------------------------------------------------------------------------------------------------------------] 0.00 %\nDone with k8solo-01\nStarting all fleet units in ~/kube-solo/fleet:\nUnit fleet-ui.service inactive\nUnit fleet-ui.service launched on 4b99c2b8.../192.168.64.2\nUnit kube-apiserver.service inactive\nUnit kube-apiserver.service launched on 4b99c2b8.../192.168.64.2\nUnit kube-controller-manager.service inactive\nUnit kube-controller-manager.service launched on 4b99c2b8.../192.168.64.2\nUnit kube-scheduler.service inactive\nUnit kube-scheduler.service launched on 4b99c2b8.../192.168.64.2\nUnit kube-kubelet.service inactive\nUnit kube-kubelet.service launched on 4b99c2b8.../192.168.64.2\nUnit kube-proxy.service inactive\nUnit kube-proxy.service launched on 4b99c2b8.../192.168.64.2\nfleetctl list-units:\nUNIT                MACHINE             ACTIVE      SUB\nfleet-ui.service        4b99c2b8.../192.168.64.2    inactive    dead\nkube-apiserver.service      4b99c2b8.../192.168.64.2    inactive    dead\nkube-controller-manager.service 4b99c2b8.../192.168.64.2    inactive    dead\nkube-kubelet.service        4b99c2b8.../192.168.64.2    activating  auto-restart\nkube-proxy.service      4b99c2b8.../192.168.64.2    active      running\nkube-scheduler.service      4b99c2b8.../192.168.64.2    inactive    dead\n``\n. yeah it looks like it never uploads the tgz\n. ah k yeah i cna do that\n. so upgrading to 0.4.2 looks like it fixed my issue\n. yeah even using alpha\n. ok fromjournalctl` \nJan 12 18:47:32 k8solo-01 systemd[1]: Started Docker Application Container Engine.\nJan 12 18:47:32 k8solo-01 dockerd[909]: time=\"2016-01-12T18:47:32.771219079Z\" level=info msg=\"POST /v1.21/containers/create\"\nJan 12 18:47:32 k8solo-01 dockerd[909]: time=\"2016-01-12T18:47:32.771833277Z\" level=error msg=\"Handler for POST /v1.21/containers/create returned error: No such image: quay.io/cor\nJan 12 18:47:32 k8solo-01 dockerd[909]: time=\"2016-01-12T18:47:32.771861028Z\" level=error msg=\"HTTP Error\" err=\"No such image: quay.io/coreos/flannel:0.5.3\" statusCode=404\nJan 12 18:47:32 k8solo-01 sdnotify-proxy[5308]: Unable to find image 'quay.io/coreos/flannel:0.5.3' locally\nJan 12 18:47:32 k8solo-01 dockerd[909]: time=\"2016-01-12T18:47:32.773511934Z\" level=info msg=\"POST /v1.21/images/create?fromImage=quay.io%2Fcoreos%2Fflannel&tag=0.5.3\"\nJan 12 18:47:32 k8solo-01 dockerd[909]: time=\"2016-01-12T18:47:32.775719428Z\" level=warning msg=\"Error getting v2 registry: Get https://quay.io/v2/: dial tcp: lookup quay.io: Temp\nJan 12 18:47:32 k8solo-01 dockerd[909]: time=\"2016-01-12T18:47:32.777218513Z\" level=error msg=\"Handler for POST /v1.21/images/create returned error: unable to ping registry endpoi\nJan 12 18:47:32 k8solo-01 dockerd[909]: time=\"2016-01-12T18:47:32.777298281Z\" level=error msg=\"HTTP Error\" err=\"unable to ping registry endpoint https://quay.io/v0/\\nv2 ping attem\nJan 12 18:47:32 k8solo-01 sdnotify-proxy[5308]: Error response from daemon: unable to ping registry endpoint https://quay.io/v0/\nJan 12 18:47:32 k8solo-01 sdnotify-proxy[5308]: v2 ping attempt failed with error: Get https://quay.io/v2/: dial tcp: lookup quay.io: Temporary failure in name resolution\nJan 12 18:47:32 k8solo-01 sdnotify-proxy[5308]: v1 ping attempt failed with error: Get https://quay.io/v1/_ping: dial tcp: lookup quay.io: Temporary failure in name resolution\n. core@k8solo-01 ~ $ curl quay.io/v0\ncurl: (6) Couldn't resolve host 'quay.io'\ncore@k8solo-01 ~ $ curl http://quay.io/v0\ncurl: (6) Couldn't resolve host 'quay.io'\ncore@k8solo-01 ~ $ curl http://quay.io/v1\ncurl: (6) Couldn't resolve host 'quay.io'\ncore@k8solo-01 ~ $ ping quay.io\nping: unknown host quay.io\n. hrm looks like the vm doesnt have access to the internet..\ncore@k8solo-01 ~ $ ping google.com\nping: unknown host google.com\n. ive tried stable and beta both with the same problem. Making sure its not on my end right now.\n. yeah i think its on my end... which is weird because i havent had this issue before today.\n. Just don't symlink the kubesolo kubectl to your path and your fine.\nOn Apr 2, 2016 4:09 AM, \"Rimas Mocevicius\" notifications@github.com wrote:\n\n@whitlockjc https://github.com/whitlockjc as I have mentioned above\nkube-solo does not touch your /.kube/config, when you open Preset OS Shell\nvia App then $HOME/kube-solo/kube/kubeconfig is used. If you open another\nshell window not via App then your kubectl will look to /.kube/config. As\nin that way you can work with two k8s clusters at once.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly or view it on GitHub\nhttps://github.com/TheNewNormal/kube-solo-osx/issues/36#issuecomment-204671067\n. \n",
    "AntonioMeireles": "@olalonde hi, thanks for reporting! \nwhat did you had/have in /etc/exports before ? could you paste it here please ?. (also, you're running latest version of kube-solo-osx, right ?)\n. @olalonde i guess that if you comment the 1st line things would work. Can you confirm please ?(the issue here is that parent dir is already exported when we're trying to export just your $homedir). will try to figure a way to handle this smoothly. \n. @piepkrak \nHi! could you please paste here your existing /etc/exports ?. For some reason it isn't passing our smoke tests... And many thanks!\n. @piepkrak \nthe issue here is that corectl expects to be able to export via NFS ${HOME} and that fails because a subdir (actually in your case, quite a few ones) of it is already set as exported (via Vagrant). Unless there is a way,in OS X, that i'm unware of, of exporting at same time both a dir  and a subdir of it, i think that the best i can do here is just print a more meaningfull failure message telling that we're unable to export ${HOME} because some dir inside it is already exported.\n. @rimusz, \nlong(er) story short - having a warning/check is a good thing to have, OTOH allowing VMs to boot without ${HOME} being properly exported on host tricky as a lot of functionality ends depending on just that ... Will need a carefull deep look. \n. @rimusz commenting on https://github.com/TheNewNormal/corectl/issues/71 \n. fixed in https://github.com/TheNewNormal/corectl/releases/tag/v0.5.6\n. @BrunoBonacci can you plz paste here you existing /etc/exports ? thanks!\n. humm. just remove the file plz and try again.\n. df -k output please. (sorry lag - on the road this weekend)\n. ah! your homedir is under /home which is itself a mountpoint so it looks that nfsd is failing to export the homedir. will do some research and come back to you early monday. \n. yes, sorta... soon one will be able to define the mountpoint locations a la carte which workarounds this in some way... after that we plan to stop relying in NFS which will end this issue once and for all. \n. it is. the issue is how to do that in a simple/reliable way (i.e via some sort of machinery we provide). \nto do it manually one just need to have it available on host and on VMs side pass via custom cloud-config   a specific systems service set to mount it at boot (similar to the one that mounts inside the VM the host's homedir. \n. humm. this doesn't seem a deterministic issue here too. \n@mboersma - for context and to try to scope this issue - OS X version/RAM & hw version ?(not an hackintosh, right ?) . do you get anything in the system logs (command-space > console > search for corectl)  ? thanks!\n. @dmcnaught,  are you by chance behind a firewall ? (trying to isolate root issue)\n. brew install corectl\nsudo corectl run\ngist plz output of ifconfig, and systemctl list-units of the VM. (and THANKS for your patience) \n(to exit the VM run sudo halt)\n. @dmcnaught what Mac (model) are you running this ?\n. interesting as that definitivelly supports Vt-x/EPT. dmesg output plz.\n. doubt it as also use it :-) \n. better. for the 1st error  coreos pull -f would do the trick. \nfor the second ... paste your /etc/exports plz \n. strange. lack of image shouldn 't give us trap errors. will try to reproduce.\n. corectl version gives you what ? you are running 0.5.10 right ?\n. explained... too old. brew update && brew upgrade --all should set you right ... (/me crosses fingers) \n. about to go afk. what timezone are you in ? will reach you tomorrow to sort this out\n. ok. i'm in GMT-0. ping me on your morning. will be around. \n. @dmcnaught i'm n another live debug session atm .. will ping you here after that one :-) \n. @dmcnaught can you ping me in kubernetes' slack please ?\n. @dmcnaught fwiw the issue isn't VM's /etc/resolv.confbeing populated with nameserver 192.168.64.1 (where 192.168.64.1 is the address of vmnet's interface), that's macOS' default behaviour. The particular issue in your specific env is that somehow albeit traffic was getting to the outter world from inside the VM the mac wasn 't fwarding back to the vm the DNS queries it was receiving from it, so name resolutions wasn 't working out of the box breaing everything that depended on it. You ended workarounding it by pointing the the VM to a DNS server other than hosts one.\n. @cobrowserAlex try this...\ncorectl q k8solo-01 -j | jq -r \".[] | .InternalSSHprivate \"  >  ./foo\nrsync -ave \"ssh -i ./foo core@$(corectl q k8solo-01 -i)\" ./secret/ k8solo-01:/mnt/secret\nshould work ... \n. a) THANK YOU! \nb) try plz\ncorectl q k8solo-01 -j | jq -r \".[] | .InternalSSHprivate \"  >  ./foo ; chmod 700;\nrsync -ave \"ssh -i ./foo core@$(corectl q k8solo-01 -i)\" ./secret/ k8solo-01:/mnt/secret\n. LGTM\n. This is the right place. I am mostly offline this weekend but will look\ninto this Monday.\nThank you for reporting and have a great weekend\nAntónio\nOn Saturday, 6 August 2016, Raigadi notifications@github.com wrote:\n\nSimilar issue is reported at TheNewNormal/corectl#88\nhttps://github.com/TheNewNormal/corectl/issues/88\nIs there a forum where I can post my questions related to these tools?\n—\nYou are receiving this because you were mentioned.\nReply to this email directly, view it on GitHub\nhttps://github.com/TheNewNormal/kube-solo-osx/issues/121#issuecomment-238039182,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AAtYZx8krJQjjBDefqKit5r5JdygsGEdks5qdNUagaJpZM4JeMJm\n.\n. @railgadi can you ping me in kubernetes' slack (same id there as here) ?\n. @cobrowserAlex \n\nlong story short... at runtime corectld manipulates pf rules so that dns behaves bidirectionally (host to/from VMs) \nthat is achieved by running the embedded dns server (basically skydns) on port 15353 and then inserting in the pf chain a matching rule ...\n```\n\n\nsudo pfctl -s nat -a corectl-dns-forwarding \nrdr pass on bridge100 inet proto tcp from any to any port = 53 -> 192.168.64.1 port 15353\nrdr pass on bridge100 inet proto udp from any to any port = 53 -> 192.168.64.1 port 15353\n```\n\n\nthe other half is achieved by a macOS droppin in /etc/resolver/corectld along \n```\n\nThis file is automatically generated and managed by corectl\n\ndomain coreos.local\nsearch coreos.local\nnameserver 127.0.0.1\nport 15353\n```\nSo, can you paste ouput of sudo pfctl -s nat on your side plz and of sudo pfctl -s nat -a ${anchorName} for each anchor please ? \nAnd many, many thanks in advance for your care and patience!\n. @cobrowserAlex i don't see your rules above ... did you run (when capturing above) \nsudo pfctl -a com.apple/utun9nat -F nat\nRULE=\"nat on {utun0} proto {tcp, udp, icmp} from 192.168.64.0/24 to any -> {utun0}\"\necho \"$RULE\"  | sudo pfctl -a com.apple/utun0nat -f -\n?\n. interesting. will try to reproduce in next 24hrs. \n. @sputnick thanks for reporting!. going to look. \n. In the meantime run please brew install libev and that error will go\naway... looking at how to statically link that lib to the blob...\nThanks for reporting and for your patience. A great weekend too!\nOn Sat, 12 Nov 2016 at 22:37, Kamil Tamiola notifications@github.com\nwrote:\n\nI am still going through the logs on my mac, as I don't recall making any\nsubstantial changes. However, upon the VM re-initialization I got:\nCreating 30GB sparse disk (QCow2)...\ndyld: Library not loaded: /usr/local/opt/libev/lib/libev.4.dylib\n  Referenced from: /Users/kamil/bin/qcow-tool\n  Reason: image not found\n/Applications/Kube-Solo.app/Contents/Resources/functions.sh: line 133: 13075 Trace/BPT trap: 5       ~/bin/qcow-tool create --size=30GiB data.img\nI have reinstalled Corectl (version 0.7.18) and repeated the process of\nVM installation. Still no go!\n—\nYou are receiving this because you are subscribed to this thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/TheNewNormal/kube-solo-osx/issues/156, or mute the\nthread\nhttps://github.com/notifications/unsubscribe-auth/AAtYZ4YT0ivmav-e3sjK8jIywiAgaZC0ks5q9j-ngaJpZM4KwjCX\n.\n. \n",
    "olalonde": "Thanks for the reply. \nI'm on OS X 10.11 and using the latest version of kube-solo-osx. VirtualBox 5.0.0r101573\n@AntonioMeireles there was indeed something in my /etc/exports which I was using for my docker-machine setup (https://gist.github.com/olalonde/74de9d053448b977f77e).\nThis is the current content of my /etc/exports:\n```\n~$ cat /etc/exports\n/Users -mapall=olalonde:staff 192.168.0.104\n/Users -network 192.168.64.0 -mask 255.255.255.0 -alldirs -mapall=501:20\n```\n. Thanks that worked! \nBy the way, is this project related to https://github.com/rimusz/coreos-osx-kubernetes-cluster? They both seem similar though it's hard to tell which one inspired the other.\n. Thanks\n. Understood. Maybe if you could point me to the bash script I would need to edit to make this work, I could try to figure something out. If I need to touch Obj-C code though, I'm useless\n. After running the up command I got an error related to helm (/Users/olalonde/kube-solo/bin/helm: No such file or directory):\n```\nLast login: Sat Oct 29 02:18:47 on ttys002\n/Applications/Kube-Solo.app/Contents/Resources/up.command; exit;\n~$ /Applications/Kube-Solo.app/Contents/Resources/up.command; exit;\nStarting k8solo-01 VM ...\nData disk does not exist, it will be created now ...\nPlease type Data disk size in GBs followed by [ENTER]:\nCreating 30GB sparse disk (QCow2)...\nCreated 30GB Data disk\nStarting VM ...\n\nbooting k8solo-01 (1/1)\n---> 'k8solo-01' started successfuly with address 192.168.64.3 and PID 7993\n---> 'k8solo-01' boot logs can be found at '/Users/olalonde/.coreos/running/90394897-5956-4F9D-AFC4-E274C45DAB31/log'\n---> 'k8solo-01' console can be found at '/Users/olalonde/.coreos/running/90394897-5956-4F9D-AFC4-E274C45DAB31/tty'\n\nChecking internet availablity on VM...\nYes, internet is available ...\nInstalling Kubernetes files on to VM...\n2016-10-29 02:22:19.095492 I | uploading 'kube.tgz' to 'k8solo-01:/home/core/kube.tgz'\n101.24 MB / 101.24 MB [==============================================] 100.00 %\n                                                                                Files copied to VM...\nInstalling now ...\nDone...\nGenerating kubeconfig file ...\ncluster \"k8solo-01\" set.\ncontext \"kube-solo\" set.\nswitched to context \"kube-solo\".\nWaiting for etcd service to be ready on VM...\n...\nWaiting for Kubernetes cluster to be ready. This can take a bit...\n...\nWaiting for Kubernetes node to be ready. This can take a bit...\n...\nnode \"k8solo-01\" labeled\nCreating kube-system namespace ...\nInstalling SkyDNS ...\nreplicationcontroller \"kube-dns-v19\" created\nservice \"kube-dns\" created\nInstalling Kubernetes Dashboard ...\nservice \"kubernetes-dashboard\" created\nreplicationcontroller \"kubernetes-dashboard-v1.4.0\" created\nInstalling Helm Tiller service ...\nservice \"tiller-deploy\" created\nInstalling Helm Tiller...\n/Applications/Kube-Solo.app/Contents/Resources/up.command: line 144: /Users/olalonde/kube-solo/bin/helm: No such file or directory\nkubectl cluster-info:\nKubernetes master is running at http://192.168.64.3:8080\nKubeDNS is running at http://192.168.64.3:8080/api/v1/proxy/namespaces/kube-system/services/kube-dns\nkubernetes-dashboard is running at http://192.168.64.3:8080/api/v1/proxy/namespaces/kube-system/services/kubernetes-dashboard\nTo further debug and diagnose cluster problems, use 'kubectl cluster-info dump'.\nCluster version:\nClient version: v1.4.4\nServer version: v1.4.4\nkubectl get nodes:\nNAME        STATUS    AGE\nk8solo-01   Ready     12s\n```\n$ ls -al ~/kube-solo/bin\ntotal 134248\ndrwxr-xr-x  10 olalonde  staff       340 Oct 29 02:22 .\ndrwxr-xr-x  11 olalonde  staff       374 Oct 29 02:22 ..\n-rwxr-xr-x   1 olalonde  staff       290 Oct 29 02:22 etcdctl\n-rwxr-xr-x   1 olalonde  staff    155312 Oct 29 02:22 gsed\n-rwxr-xr-x   1 olalonde  staff      4753 Oct 29 02:22 install_deis\n-rwxr-xr-x   1 olalonde  staff    630720 Oct 29 02:22 jq\n-rwxr-xr-x   1 olalonde  staff       789 Oct 29 02:22 ksolo\n-rwxr-xr-x@  1 olalonde  staff  67235024 Oct 29 02:20 kubectl\n-rwxr-xr-x   1 olalonde  staff       286 Oct 29 02:22 rkt\n-rwxr-xr-x   1 olalonde  staff    691840 Oct 29 02:22 wget\n. Tried again from scratch and couldn't reproduce!\n. Indeed. Trying to make it work with tmux seems like a bit of a PITA. Another option would be to see if a flag can be passed to open -a iTerm.app \"$1\"/first-init.command to tell iTerm to ignore the \"send text at start\" setting. That would probably be ideal. What do you think? (asked here https://gitlab.com/gnachman/iterm2/issues/5288)\n. Looks like another way would be to chose a profile called \"kube-solo\" if it exists and otherwise use the default profile: https://www.iterm2.com/documentation-scripting.html. That way, I could create a \"kube-solo\" profile which doesn't send text at start.\n. Oh, looks like there will be a new option in iTerm to \"disabled text at start when opening a script\" https://gitlab.com/gnachman/iterm2/issues/5288. 👍 \n. ",
    "zeroem": "I'm in the same boat. Using OSX El Capitan, it looks like there's some issue with the downloading as there's no fleetctl in the ~/kube-solo/bin directory.\nInstall Log\nsettings.toml\n. @rimusz I was installing 0.4.6\nI'll try the newer version and report back.\n. Same boat with 0.4.7\nInstall Log and Settings\n. ",
    "jtblin": "I'm getting the same problem with 0.5.2. Upgraded an existing installation deleting kube-solo directory as indicated, after reboot I couldn't get kube-solo to work anymore. Removed the app rm -rf /Applications/Kube-Solo.app and kube-solo directory rm -rf ~/kube-solo and tried reinstalling but it's stuck on Waiting for Kubernetes cluster to be ready. This can take a few minutes....\n```\nLast login: Sun Feb 14 14:04:02 on ttys005\n/Applications/Kube-Solo.app/Contents/Resources/first-init.command; exit;\n~ $ /Applications/Kube-Solo.app/Contents/Resources/first-init.command; exit;\nSetting up Kubernetes Solo Cluster on OS X\nReading ssh key from /Users/jtblin/.ssh/id_rsa.pub\n/Users/jtblin/.ssh/id_rsa.pub found, updating configuration files ...\nYour Mac user's password will be saved in to 'Keychain'\nand later one used for 'sudo' command to start VM !!!\nThis is not the password to access VM via ssh or console !!!\nPlease type your Mac user's password followed by [ENTER]:\nThe sudo password is fine !!!\nSet CoreOS Release Channel:\n 1)  Alpha\n 2)  Beta\n 3)  Stable (recommended)\nSelect an option: 3\nPlease type VM's RAM size in GBs followed by [ENTER]:\nChanging VM's RAM to 2GB...\nPlease type Data disk size in GBs followed by [ENTER]:\nCreating 10GB disk ...\n  10GiB 0:00:15 [ 675MiB/s] [=====================================================================================================================>] 100%\nCreated 10GB Data disk\nStarting VM ...\n\nbooting k8solo-01\n[corectl] unable to guess the MAC Address from the provided UUID (90394897-5956-4F9D-AFC4-E274C45DAB31). Using a randomly generated one one\n[corectl] stable/835.12.0 already available on your system\n[corectl] NFS started in order for '/Users/jtblin' to be made available to the VMs\n[corectl] started 'k8solo-01' in background with IP 192.168.64.5 and PID 78398\nError: 'k8solo-01' not found, or dead\n\nUsage:\n  corectl query [VMids] [flags]\nAliases:\n  query, q\nFlags:\n  -a, --all    display extended information about a running CoreOS instance\n  -i, --ip     displays given instance IP address\n  -j, --json   outputs in JSON for easy 3rd party integration\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nError: 'k8solo-01' not found, or dead\nUsage:\n  corectl query [VMids] [flags]\nAliases:\n  query, q\nFlags:\n  -a, --all    display extended information about a running CoreOS instance\n  -i, --ip     displays given instance IP address\n  -j, --json   outputs in JSON for easy 3rd party integration\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nError: 'k8solo-01' not found, or dead\nUsage:\n  corectl query [VMids] [flags]\nAliases:\n  query, q\nFlags:\n  -a, --all    display extended information about a running CoreOS instance\n  -i, --ip     displays given instance IP address\n  -j, --json   outputs in JSON for easy 3rd party integration\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nInstalling Kubernetes files on to VM...\nError: 'k8solo-01' not found, or dead\nUsage:\n  corectl put path/to/file VMid:/file/path/on/destination [flags]\nAliases:\n  put, copy, cp, scp\nExamples:\n  // copies 'filePath' into '/destinationPath' inside VMid\n  corectl put filePath VMid:/destinationPath\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nError: 'k8solo-01' not found, or dead\nUsage:\n  corectl ssh VMid [\"command1;...\"] [flags]\nAliases:\n  ssh, attach\nExamples:\n  corectl ssh VMid                 // logins into VMid\n  corectl ssh VMid \"some commands\" // runs 'some commands' inside VMid and exits\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nError: 'k8solo-01' not found, or dead\nUsage:\n  corectl ssh VMid [\"command1;...\"] [flags]\nAliases:\n  ssh, attach\nExamples:\n  corectl ssh VMid                 // logins into VMid\n  corectl ssh VMid \"some commands\" // runs 'some commands' inside VMid and exits\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nDone with k8solo-01\nError: 'k8solo-01' not found, or dead\nUsage:\n  corectl ssh VMid [\"command1;...\"] [flags]\nAliases:\n  ssh, attach\nExamples:\n  corectl ssh VMid                 // logins into VMid\n  corectl ssh VMid \"some commands\" // runs 'some commands' inside VMid and exits\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nfleetctl is up to date ...\nDownloading latest version of helm for OS X\n  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n                                 Dload  Upload   Total   Spent    Left  Speed\n  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n100 4760k  100 4760k    0     0  1109k      0  0:00:04  0:00:04 --:--:-- 1787k\nInstalled latest helm 0.3.1%2Bd4c0fa8 to ~/kube-solo/bin ...\n---> Checking repository charts\nAlready up-to-date.\n---> Checking repository kube-charts\nAlready up-to-date.\n---> Done\n[ERROR] Remote kube-charts already exists, and is pointed to https://github.com/TheNewNormal/kube-charts\n---> Checking repository charts\nAlready up-to-date.\n---> Checking repository kube-charts\nAlready up-to-date.\n---> Done\nfleetctl list-machines:\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError retrieving list of active machines: dial tcp :2379: connection refused\nStarting all fleet units in ~/kube-solo/fleet:\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError creating units: error retrieving Unit(fleet-ui.service) from Registry: dial tcp :2379: connection refused\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError creating units: error retrieving Unit(kube-apiserver.service) from Registry: dial tcp :2379: connection refused\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError creating units: error retrieving Unit(kube-controller-manager.service) from Registry: dial tcp :2379: connection refused\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError creating units: error retrieving Unit(kube-scheduler.service) from Registry: dial tcp :2379: connection refused\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError creating units: error retrieving Unit(kube-kubelet.service) from Registry: dial tcp :2379: connection refused\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError creating units: error retrieving Unit(kube-proxy.service) from Registry: dial tcp :2379: connection refused\nfleetctl list-units:\n2016/02/14 14:07:03 ERROR fleetctl.go:216: error attempting to check latest fleet version in Registry: dial tcp :2379: connection refused\nError retrieving list of units from repository: dial tcp :2379: connection refused\nGenerate kubeconfig file ...\ncluster \"k8solo-01\" set.\ncontext \"default-context\" set.\nswitched to context \"default-context\".\nWaiting for Kubernetes cluster to be ready. This can take a few minutes...\n``\n. Content of~/kube-solo/settings/k8solo-01.toml`\n[k8solo-01]\n   uuid = \"90394897-5956-4F9D-AFC4-E274C45DAB31\"\n   channel = \"stable\"\n   volume = \"data.img\"\n   cloud_config = \"cloud-init/user-data\"\n   cpus = 2\n   memory = 2048\n   local = \"true\"\n   sshkey = 'ssh-rsa redactd jtblin@redacted.com'\n. kubeconfig server address seems weird:\n$ cat ~/kube-solo/kube/kubeconfig \napiVersion: v1\nclusters:\n- cluster:\n    server: http://:8080\n  name: k8solo-01\ncontexts:\n- context:\n    cluster: k8solo-01\n    user: \"\"\n  name: default-context\ncurrent-context: default-context\nkind: Config\npreferences: {}\nusers: []\n. After I deleted everything again and rebooted my MBP, I selected the Beta CoreOS release channel and I was able to install the latest version without issue. \nEither there was something weird going on and it needed a reboot, either kube-solo uses the kubelet installed on CoreOS to boostrap Kubernetes? kubelet is not part of the coreos stable release channel anymore: https://github.com/coreos/bugs/issues/985.\n. ",
    "esbenp": "I have the same error when trying to boot up my VM. I do not know if the two issues are unrelated, since this occurs on boots after the initial, and I do not get any fleetctl errors.\nIf i destroy my Kube-Solo VM and recreate it I can get it to work the first time. However, I am unable to get it up and running after I halt my VM.\nI get this error with both stable and beta version of CoreOS.\nI have a docker-machine VM installed as well, do not know if anything is conflicting there (stopping my docker-machine does not work)\nKube-Solo-OSX version: 0.5.3\nOSX version: 10.11\nOutput\n```\nLast login: Tue Mar  8 14:28:27 on ttys001\nEsbens-MacBook-Pro:~ esbenp$ /Applications/Kube-Solo.app/Contents/Resources/up.command; exit;\nStarting VM ...\n\nbooting k8solo-01\n[corectl] beta/899.9.0 already available on your system\n[corectl] '/Users/esbenp' was already available to VMs via NFS\n[corectl] started 'k8solo-01' in background with IP 192.168.64.2 and PID 45052\n\nWaiting for VM to be ready...\n```\nLet me know what files to output for debugging\n. Last login: Tue Mar  8 16:13:57 on ttys004\nEsbens-MacBook-Pro:~ esbenp$ /Applications/Kube-Solo.app/Contents/Resources/ssh.command; exit;\nLast login: Tue Mar  8 13:30:13 2016\nCoreOS stable (899.9.0)\nUpdate Strategy: No Reboots\nFailed Units: 1\n  docker.service\ncore@k8solo-01 ~ $ curl http://google.com\n<HTML><HEAD><meta http-equiv=\"content-type\" content=\"text/html;charset=utf-8\">\n<TITLE>302 Moved</TITLE></HEAD><BODY>\n<H1>302 Moved</H1>\nThe document has moved\n<A HREF=\"http://www.google.dk/?gws_rd=cr&amp;ei=0u7eVqwOqNHoBIXckvgM\">here</A>.\n</BODY></HTML>\n. CoreOS stable (899.9.0)\nUpdate Strategy: No Reboots\nFailed Units: 1\n  docker.service\ncore@k8solo-01 ~ $ journalctl -u docker.service\n-- Logs begin at Tue 2016-03-08 13:30:08 UTC, end at Tue 2016-03-08 17:39:37 UTC. --\nMar 08 13:30:12 k8solo-01 systemd[1]: Dependency failed for Docker Application Container Engine.\nMar 08 13:30:12 k8solo-01 systemd[1]: docker.service: Job docker.service/start failed with result 'dependency'.\nMar 08 13:30:22 k8solo-01 systemd[1]: Started Docker Application Container Engine.\nMar 08 13:30:23 k8solo-01 dockerd[1006]: time=\"2016-03-08T13:30:23.141345843Z\" level=fatal msg=\"Error starting daemon: lstat /var/lib/d\nMar 08 13:30:23 k8solo-01 systemd[1]: docker.service: Main process exited, code=exited, status=1/FAILURE\nMar 08 13:30:23 k8solo-01 systemd[1]: docker.service: Unit entered failed state.\nMar 08 13:30:23 k8solo-01 systemd[1]: docker.service: Failed with result 'exit-code'.\nlines 1-8/8 (END)\n. CoreOS stable (899.9.0)\nUpdate Strategy: No Reboots\nFailed Units: 1\n  docker.service\ncore@k8solo-01 ~ $ journalctl -u docker.service -l\n-- Logs begin at Tue 2016-03-08 13:30:08 UTC, end at Wed 2016-03-09 08:01:32 UTC. --\nMar 08 13:30:12 k8solo-01 systemd[1]: Dependency failed for Docker Application Container Engine.\nMar 08 13:30:12 k8solo-01 systemd[1]: docker.service: Job docker.service/start failed with result 'dependency'.\nMar 08 13:30:22 k8solo-01 systemd[1]: Started Docker Application Container Engine.\nMar 08 13:30:23 k8solo-01 dockerd[1006]: time=\"2016-03-08T13:30:23.141345843Z\" level=fatal msg=\"Error starting daemon: lstat /var/lib/docker/volumes/65a7aad8ad1b612babb001d8cbdbe45775697d3ba5a73942e8740810aa70ef68: input/output error\"\nMar 08 13:30:23 k8solo-01 systemd[1]: docker.service: Main process exited, code=exited, status=1/FAILURE\nMar 08 13:30:23 k8solo-01 systemd[1]: docker.service: Unit entered failed state.\nMar 08 13:30:23 k8solo-01 systemd[1]: docker.service: Failed with result 'exit-code'.\nI tried docker volume ls\ncore@k8solo-01 ~ $ docker volume ls\nAn error occurred trying to connect: Get http:///var/run/docker.sock/v1.21/volumes: read unix /var/run/docker.sock: connection reset by peer\n. ",
    "wstrange": "Not sure if this is related, but I can no longer bring up kube-solo. etcd wont start\nMar 14 23:31:13 k8solo-01 etcd2[1431]: read wal error (walpb: crc mismatch) and\nMar 14 23:31:13 k8solo-01 systemd[1]: etcd2.service: Main process exited, code=e\nMar 14 23:31:13 k8solo-01 systemd[1]: Failed to start etcd2.\nMar 14 23:31:13 k8solo-01 systemd[1]: etcd2.service: Unit entered failed state.\nMar 14 23:31:13 k8solo-01 systemd[1]: etcd2.service: Failed with result 'exit-co\nAnd I get errors related to ext4:\nEXT4-fs error (device vda): ext4_mb_generate_buddy:758: group 100, block bitmap and bg descriptor inconsistent: 1484 vs 1558 free clusters\n[   18.839329] EXT4-fs error (device vda): ext4_mb_generate_buddy:758: group 17, block bitmap and bg descriptor inconsistent: 890 vs 1363 free clusters\n[   18.840453] JBD2: Spotted dirty metadata buffer (dev = vda, blocknr = 0). There's a risk of filesystem corruption in case of system crash.\n[   18.841263] EXT4-fs error (device vda): ext4_mb_generate_buddy:758: group 18, block bitmap and bg descriptor inconsistent: 14094 vs 14097 free clusters\n[   18.842110] JBD2: Spotted dirty metadata buffer (dev = vda, blocknr = 0). There's a risk of filesystem corruption in case of system crash.\n[  308.232207] EXT4-fs (vda): error count since last fsck: 17\n[  308.232903] EXT4-fs (vda): initial error at time 1457989316: mb_free_blocks:1454: block 600816\n[  308.233672] EXT4-fs (vda): last error at time 1457998088: ext4_mb_generate_buddy:758\n. FWIW, I also had an issue with kube-solo and my /etc/exports. The install would bomb out.\nIn my case I just discarded the entry that Vagrant put in - so I don't have it anymore. I suspect there is an issue parsing the format.\n. A lateral thought...\nIs sudo needed just for /etc/exports?\nIt might be better to not save the sudo password.  The user presumably would need to provide it once to fix up exports - but after that it should not be needed. Might be safer.\n. Same issue for me.  I was using VBox - so it may have messed things up. \n. ",
    "openjack": "Switching to 'beta' got me passed the \"Waiting for Kubernetes cluster to be ready...\" issue.\n. ",
    "chrislovecnm": "@openjack I had to tank the install, and then go to beta.  From there I can start it.  At least start it once 😄 \n. Same thing @rimusz ... btw I switched the k8s version during \"Waiting for Kubernetes cluster to be ready...\" issue, and it fixed it.\n. @rimusz it would be good to have a check that nfsd is functioning correctly.\n. Let me see if I can ask this question better... Can I run the latest source code off of the master branch on k8s github repo?  Bleeding edge 😄 \ngit clone https://github.com/kubernetes/kubernetes\nhack/build-go.sh\nRun those binaries\n. @rimusz WOOP!!\n. FREE COOKIE FOR YOU!!\n. <facepalm>\n. I did both in the code 😄 \n. @rimusz does this meet your needs?  Works great for me\n. ",
    "vahidR": "I used the version v0.6.6 and the problem still exits.\nThe workaround for me, as others said, was to use the \"Beta\" version of CoreOS \n. ",
    "ayberk": "Can confirm the issue still does exist (macOS 10.11.15) and using \"beta\" was the fix.\n. ",
    "vichargrave": "I'm trying to use v0.6.6 on Mac OS 10.11.15, but it is still hanging at the Kubernetes startup cluster step.\n. ",
    "clubanderson": "try to restart nfs\nsudo nfsd restart\n. ",
    "piepkrak": "Hi! Hereby my /etc/exports file. I changed the names of projects for privacy reasons\n```\nVAGRANT-END: 1296 c54aa86a-465e-4f78-9aad-48a29863e115\nVAGRANT-BEGIN: 1296 15ac914e-c8b3-46ed-8941-0350ba2bd05e\n\"/Users/user/projects/vagrant/name/www\" 192.168.33.10 -alldirs -mapall=1296:20\nVAGRANT-END: 1296 15ac914e-c8b3-46ed-8941-0350ba2bd05e\nVAGRANT-BEGIN: 1296 a52297b2-6b9c-469f-9c0b-188a0dae00a5\n\"/Users/user/projects/vagrant/name/www\" 192.168.33.10 -alldirs -mapall=1296:20\nVAGRANT-END: 1296 a52297b2-6b9c-469f-9c0b-188a0dae00a5\nVAGRANT-BEGIN: 1296 c54aa86a-465e-4f78-9aad-48a29863e115\n\"/Users/user/projects/vagrant/name-name-name/www\" 192.168.33.30 -alldirs -mapall=1296:20\nVAGRANT-END: 1296 c54aa86a-465e-4f78-9aad-48a29863e115\nVAGRANT-BEGIN: 1296 7682421c-c919-42b5-9610-820797c79b01\n\"/Users/user/projects/vagrant/name/www\" 192.168.33.10 -alldirs -mapall=1296:20\nVAGRANT-END: 1296 7682421c-c919-42b5-9610-820797c79b01\nVAGRANT-BEGIN: 1296 4ae87ab9-16c5-424f-94a4-20ebce7e2c4b\n\"/Users/user/projects/vagrant/name/application\" 192.168.33.20 -alldirs -mapall=1296:20\nVAGRANT-END: 1296 4ae87ab9-16c5-424f-94a4-20ebce7e2c4b\nVAGRANT-BEGIN: 1296 f22e491f-73b1-47bc-8668-a25cc0f7ed69\n\"/Users/user/projects/vagrant/name/simplesamlphp\" 192.168.33.10 -alldirs -mapall=1296:20\n\"/Users/user/projects/vagrant/name/www\" 192.168.33.10 -alldirs -mapall=1296:20\nVAGRANT-END: 1296 f22e491f-73b1-47bc-8668-a25cc0f7ed69\n```\n. @AntonioMeireles Thank you for the explanation. I've never encountered this before. Will just swap the /etc/exports files for now.\n. ",
    "davidmankin": "Thanks.  This bit me too because I use Vagrant.  Would be nice to be able to make a special dir not under my homedir and export that to avoid conflicts. \n. ",
    "elementalvoid": "In my case the conflict is with https://github.com/nlf/dlite.\n```\nBEGIN: dlite\n/Users -network 192.168.64.0 -mask 255.255.255.0 -alldirs -maproot=root:wheel                                                                                   \nEND: dlite\n```\n. ",
    "cmoad": "I'm also experiencing a conflict with dlite as mentioned by @elementalvoid.\n. ",
    "whitlockjc": "I think I just found out you already do this: \"Kube-Solo App can be used together with CoreOS VM App which allows to build Docker containers and has a private local Docker registry v2 which is accessible from Kube-Solo App.\"  Feel free to close this once you confirm.\n. I'm an idiot.  I see that this VM along with the CoreOS VM App gives me what I need.  Sorry about the noise.\n. I'm going to reopen this because things still aren't working and I'd like to see if we can get this figured out.  When I run the CoreOS VM App, I do indeed have a Docker Registry.  But when I try to docker push, I get the following:\nThe push refers to a repository [192.168.64.1:5000/testing] (len: 1)\nunable to ping registry endpoint https://192.168.64.1:5000/v0/\nv2 ping attempt failed with error: Get https://192.168.64.1:5000/v2/: tls: oversized record received with length 20527\n v1 ping attempt failed with error: Get https://192.168.64.1:5000/v1/_ping: tls: oversized record received with length 20527\nIf I use http to access the Docker Registry API, it works fine.  (This test was performed via the browser.)\nAlso, the more I think about this the more I realize that the initial request is still somewhat valid.  It would be slick of kube-solo-osx had a private Docker Registry running in it and the Kubernetes configured to use it.\n. I get you.  There's no need to bulk up the kube-solo but I'm still wondering why my attempt to docker push results in errors and it appears to be because the Docker Registry isn't running via https.  I say \"appears\" because of the error and because I have no expertise in the area to confirm one way or another.\nI'm all for keeping two VMs for the reasons you stated but I do think we'll need to sort out the reason that docker push does not work with the Docker Registry running on the CoreOS VM.  Thoughts?\n. So what do I need to do for things to work?  I just run docker push right now and docker is the one forcing, or assuming, https.  I'll keep googling.  Thanks again.\n. Cool.  Maybe since I never used docker pull, something wasn't setup properly.  I just built an image locally and then tried to push it.  I'll try your approach and if you don't hear from me, things are working fine.\n. The fix was to unset DOCKER_TLS_VERIFY and DOCKER_CERT_PATH.  This could use some documentation and I'd be happy to add it if you want.  Here is a working example: DOCKER_HOST=tcp://192.168.64.3:2375 DOCKER_TLS_VERIFY= DOCKER_CERT_PATH= ~/coreos-osx/bin/docker ps  Of course, if I just run DOCKER_HOST=tcp://192.168.64.3:2375 ~/coreos-osx/bin/docker ps, that's when I get the error related to oversized record received with length 20527.  Every person on my team ran into this so I'm sure it's somewhat common, especially if you already run docker-machine as it's the tool that is setting these DOCKER_* environment variables.\n. I think that would help, or even documenting something to the effect of \"Coexisting with docker-machine\" or \"Migrating from docker-machine\".  Regardless, thanks for all of your help and I'm glad I was able to figure it out.\n. Is this still up for debate?  I just ran into this situation as well when attempting to update ~/.kube/config to connect to another k8s environment.  I updated the file as expected, tried to kubectl config use-context my-new-context only to have it fail.  I remembered setting my environment to use the kubectl from kube-solo and when I looked into it, it's a shell script that sets --kubeconfig to always use $HOME/kube-solo/kube/kubeconfig.  I'd really love to avoid having one k8s configuration file for kube-solo and another for the rest of my k8s environments but I defer to your judgement.\n. I tested everything locally but extra testing is a great idea.  Let me know if there is more I can do.\n. Thanks @rimusz.  This will make my life much easier.  :)  I have a ~/.kube/config that is configured for multiple clusters, including my kube-solo cluster, and being able to bounce contexts using kubectl config use-context ... was a pain before this.  Much appreciated.\n. Here are the pertinent links to the Kubernetes docs (this isn't an RTFM but since they've got documentation, it seemed simpler):\n- Authentication: http://kubernetes.io/docs/admin/authentication/\n- Authorization: http://kubernetes.io/docs/admin/authorization/\nThe problem I'm trying to solve first is I want to provide the necessary --oidc-* options to the apiserver upon startup so that I can enable token-based OpenID Connect authentication.\nI realize that this might not be something you want to support within kube-solo but if we can work together on an approach, I don't mind writing the documentation so that others could do this.  Being the optimist I am, I do bet there is some way we can make kube-solo pick up some configuration (environment variable, config file, ...) from the host system on an opt-in basis.\n. @rimusz If I've got kube-solo already running, how should I go about changing the fleet unit and getting it deployed?  I've not used fleet directly so I'm not even sure how to start.  I'm hoping I can use a kube-solo distribution and that I don't have to build/run a custom one.  If that is the case, do you mind pointing me in the right direction on getting started?\n. I just realized kube-solo ships with a fleet UI so I will start there.\n. So as things stand now, I could update ~/kube-solo/fleet/kube-apiserver.service and restart the VM to alter how the k8s apiserver is started.  But if fleet goes away, I'd instead update ~/kube-solo/cloud-init/user-data to do this by creating a systemd unit.  Is this correct?  I'm just trying to make sure I understand things correctly.\n. I've had trouble updating to v0.8.7 for now so until that is fixed, what is the appropriate flow to doing this?  I've tried altering ~/kube-solo/fleet/kube-apiserver.service and bouncing the VM but it doesn't seem to pick those changes up.  I've tried the reload/update fleet unit menubar item and it just overwrites my changes.  What is the suggested approach to do this with fleet since it's the only way to do it locally for me right now?\n. Thanks a lot @rimusz.  I did finally figure out the fleetctl process to get this working.  Now that I'm switching to the cloud-init approach, how do I follow the same flow to update the apiserver and redeploy it after changes?\n. I think it's possible to keep it enabled all the time but it would likely not make sense.  I wanted to test the OIDC support for authentication and now that I've done that, I want to switch back to the default kube-solo approach using a certificate.  I do think that if you want a simple kube-solo, you don't want extra authn/authz.  But if you find the need to test or use authn/authz, knowing how to enable it would be pretty useful.\n. You got it.  I'll go through the process to make sure the halt, up process just works and then we could easily document this as a So You Need a Custom API Server section or something.  ;)\n. Enabling authn/authz is the same.  You update your ~/kube-solo/cloud-init/user-data to provide the necessary enablement flags to the kube-apiserver.service.  Have you tried this?\n. That will work just fine, I forgot you were mounting this.  Thanks a lot.\n. I'm not sure this is working and it could be my own issue.  Whenever my service tries to start, I get this: /Users/notyou/workspaces/go/src/github.com/coreos/dex/bin/dex-worker: No such file or directory  I'm not saying there is a kube-solo issue but I'm not having luck.  Here is my modification to ~/kube-solo/cloud-init/user-data:\n- name: dex.service\n      command: start\n      content: |\n        [Unit]\n        Description=Dex\n        Documentation=https://github.com/coreos/dex\n        Requires=etcd2.service docker.service flanneld.service persistent-data-checks.service\n        After=etcd2.service docker.service flanneld.service persistent-data-checks.service\n        [Service]\n        ExecStart=/Users/notyou/workspaces/go/src/github.com/coreos/dex/bin/dex-worker \\\n          --tls-cert-file=/Users/notyou/kube-solo/certs/dex.pem \\\n          --tls-key-file=/Users/notyou/kube-solo/certs/dex-key.pem \\\n          --listen=\"https://0.0.0.0:5556\" \\\n          --issuer=\"https://127.0.0.1:5556\" \\\n          --clients=/Users/notyou/workspaces/go/src/github.com/coreos/dex/static/fixtures/clients.json.sample \\\n          --connectors=/Users/notyou/workspaces/go/src/github.com/coreos/dex/static/fixtures/connectors.json.sample \\\n          --email-cfg=/Users/notyou/workspaces/go/src/github.com/coreos/dex/static/fixtures/emailer.json \\\n          --users=/Users/notyou/workspaces/go/src/github.com/coreos/dex/static/fixtures/users.json.sample \\\n          --html-assets=/Users/notyou/workspaces/go/src/github.com/coreos/dex/static/html \\\n          --no-db\n        Restart=always\n        RestartSec=10\nOf course, I also updated apiserver.service to depend on dex.service.\n. I think I ran into some environmental issue that caused corectl.app to bust and kube-solo.app to bust as well.  Blowing them both away, reinstalling the latest versions and now /Users/notyou is mounted as expected.  No idea what Gremlins were in my machine but it appears to be fixed.\n. I think my corectl.app was borked.  I updated it too and when it started, it never prompted me for my password so I assume it just wasn't running.\n. It was weird because starting the newly updated corectl.app didn't prompt an error but once I saw that its status wasn't Server is running, I got the idea that maybe it was borked.  Force quit and restart seems to have fixed it.\n. ",
    "mbrevoort": "@rimusz I tried it again with the latest and running out of Applications and I'm seeing the same error :/\n```\nLast login: Mon Feb 22 08:13:39 on ttys007\n/Applications/Kube-Solo.app/Contents/Resources/first-init.command; exit;\n➜  ~  /Applications/Kube-Solo.app/Contents/Resources/first-init.command; exit;\nSetting up Kubernetes Solo Cluster on OS X\nReading ssh key from /Users/mike/.ssh/id_rsa.pub\n/Users/mike/.ssh/id_rsa.pub found, updating configuration files ...\nYour Mac user's password will be saved in to 'Keychain'\nand later one used for 'sudo' command to start VM !!!\nThis is not the password to access VM via ssh or console !!!\nPlease type your Mac user's password followed by [ENTER]:\nThe sudo password is fine !!!\nSet CoreOS Release Channel:\n 1)  Alpha (may not always function properly)\n 2)  Beta\n 3)  Stable (recommended)\nSelect an option: 3\nPlease type VM's RAM size in GBs followed by [ENTER]:\nChanging VM's RAM to 2GB...\nPlease type Data disk size in GBs followed by [ENTER]:\nCreating 10GB disk ...\n  10GiB 0:00:18 [ 548MiB/s] [==========================================================================================================================================================>] 100%\nCreated 10GB Data disk\nStarting VM ...\n\nbooting k8solo-01\n[corectl] stable/835.13.0 already available on your system\n[corectl] NFS started in order for '/Users/mike' to be made available to the VMs\n[corectl] started 'k8solo-01' in background with IP 192.168.64.2 and PID 60065\nError: 'k8solo-01' not found, or dead\n\nUsage:\n  corectl query [VMids] [flags]\nAliases:\n  query, q\nFlags:\n  -a, --all    display extended information about a running CoreOS instance\n  -i, --ip     displays given instance IP address\n  -j, --json   outputs in JSON for easy 3rd party integration\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nError: 'k8solo-01' not found, or dead\nUsage:\n  corectl query [VMids] [flags]\nAliases:\n  query, q\nFlags:\n  -a, --all    display extended information about a running CoreOS instance\n  -i, --ip     displays given instance IP address\n  -j, --json   outputs in JSON for easy 3rd party integration\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nError: 'k8solo-01' not found, or dead\n```\n. For what it's worth, I tried the kube-cluster project as well and had the same problem.\n. :weary: I restarted my machine... and I'm not seeing the error any more\n. ",
    "puja108": "It's a bit annoying, VBox (or Vagrant) seems to not be cleaning up after itself. Removing host-only nets (vboxnets) that were unused and rebooting fixed the problem for me. I'm just waiting for the next vagrant setup to break it again, though...\n. @rimusz Yeah, I was about to say that. I'm testing the Docker beta for Mac and it never has these problems. Hope they give a bit of that back to the community.\n. As we were talking about it, maybe the tools they just published could help: https://blog.docker.com/2016/05/docker-unikernels-open-source/\n. ",
    "ianwalter": "I think my laptop was on a shaky connection. I tried on my desktop and was able to get everything set up successfully.\n. ",
    "BrunoBonacci": "Hi @rimusz,\nas you can see from the output the image verification is successful, so it can't be a broken download (i've tried several times and deleted both .coreos and kube-solo directories).\nI think that the error message is the best clue:\nError: rename /tmp/coreos670171957/coreos_production_pxe.vmlinuz /Users/bruno/.coreos/images/stable/899.15.0/coreos_production_pxe.vmlinuz: cross-device link\nI assume that the underlying implementation of corectl is trying to do the following things:\n- download the image in the /tmp directory\n- verify the integrity with the signature\n- move the file in the appropriate location under .coreos\nnow the step i think it is failing is the last one.\nit uses the rename function (equivalent to ln shell tool),\nwhich it can only create a hard link if the target is in the same volume as the source.\nsee documentation here:\nhttps://developer.apple.com/library/ios/documentation/System/Conceptual/ManPages_iPhoneOS/man2/rename.2.html\nQuoting from the doc:\n\n[EXDEV]            The link named by new and the file named by old are on\n                   different logical devices (file systems).  Note that\n                   this error code will not be returned if the implemen-\n                   tation permits cross-device links.\n\nIn my case the destination directory in a different volume that my /tmp.\nThe corectl should probably copy and then unlink (similar to mv) or allow to customize where the /tmp is locate for example under ~/kube-solo/tmp.\n. Hi,\nI've just tried with kube-solo 0.5.9 and the problem is still there.\nMoreover the related ticket for corectl seems still open.\n. @rimusz do you have an ETA for a new release?\n. Thanks for the release. Now it works, but I'm hitting another problem\n```\n[corectl] stable/899.17.0 ready\nError: unable to validate /etc/exports ('[]')\nUsage:\n  corectl load path/to/yourProfile [flags]\nExamples:\n  corectl load profiles/demo.toml\nGlobal Flags:\n      --debug   adds extra verbosity, and options, for debugging purposes and/or power users\nAll flags can also be configured via upper-case environment variables prefixed with \"COREOS_\"\nFor example, \"--debug\" => \"COREOS_DEBUG\"\nVM have not booted, please check '~/kube-solo/logs/vm_up.log' and report the problem !!!\n```\nWhich seems been already reported https://github.com/TheNewNormal/kube-solo-osx/issues/30\n. @AntonioMeireles my /etc/exports it's empty.\n. done that, the error is the same and it creates a new empty /etc/exports\n. $ df -k\nFilesystem    1024-blocks      Used Available Capacity   iused    ifree %iused  Mounted on\n/dev/disk1      390262400  70713236 319293164    19%  17742307 79823291   18%   /\ndevfs                 184       184         0   100%       638        0  100%   /dev\nmap -hosts              0         0         0   100%         0        0  100%   /net\nmap auto_home           0         0         0   100%         0        0  100%   /home\n/dev/disk0s4    585509380 461681020 123828360    79% 115420253 30957090   79%   /Volumes/Data\n. Yeah, that was the same cause of the original issue in first place.\nSorry I probably should have made clearer from the beginning.\n. Hi @AntonioMeireles,\nany progress on this?\n. Great, looking forward to it. thx\n. ",
    "rodcloutier": "Doh... that solves it. Thanks!\n. ",
    "kvacquier": "Isn't it automaticaly launched ?\n. ",
    "mboersma": "@rimusz here's what I do:\n1. Install latest kube-solo\n2. Delete /etc/exports\n3. Go through kube-solo initial setup (allocate 4GB RAM, 30GB disk)\n4. Install the workflow-v2.0.0 chart with helmc\n5. Install the workflow-v2.0.0-e2e chart and let the tests run\nReliably, somewhere in the middle of the test run there will be an unexpected error, or the suite will just stall. Looking at kube-solo shows that the k8s API no longer answers because the VM is halted.\nThis is also reproducible through normal Deis Workflow usage for me, without running tests. I'm not able to keep the instance running for more than 20-30 minutes max without this occurring. Usually starting up the VM again makes everything available, but the problem will recur.\nAny specific logs or other info I can add?\n. I'll try again with v0.6.6 and add more detail here if I can reproduce the issue.\n. It did happen to me again with v0.6.6 of kube-solo, following the steps I described above. This time I used the workflow-dev and workflow-dev-e2e charts. At the start of the workflow-e2e tests, the VM apparently halted. The console app had this:\nconsole\n6/15/16 9:07:31.956 AM sudo[1782]:     matt : TTY=ttys001 ; PWD=/Users/matt/kube-solo ; USER=root ; COMMAND=/Applications/Kube-Solo.app/Contents/Resources/bin/corectl load settings/k8solo-01.toml\n6/15/16 9:07:33.216 AM InternetSharing[1787]: corectl: com.apple.NetworkSharing.broadcast-0 has been started\n6/15/16 9:07:33.217 AM InternetSharing[1787]: corectl: com.apple.NetworkSharing.broadcast-0 (idle) has been stopped\n6/15/16 9:07:33.752 AM InternetSharing[1787]: corectl: com.apple.NetworkSharing.broadcast-1 has been started\n6/15/16 9:08:30.000 AM kernel[0]: process corectl[1794] caught causing excessive wakeups. Observed wakeups rate (per sec): 785; Maximum permitted wakeups rate (per sec): 150; Observation period: 300 seconds; Task lifetime number of wakeups: 45012\n6/15/16 9:08:34.477 AM spindump[774]: Saved wakeups_resource.diag report for corectl version ??? (???) to /Library/Logs/DiagnosticReports/corectl_2016-06-15-090834_gradishar.wakeups_resource.diag\n6/15/16 9:25:58.122 AM InternetSharing[1787]: corectl: com.apple.NetworkSharing.broadcast-1 (idle) has been stopped\n6/15/16 9:26:14.024 AM sudo[3917]:     matt : TTY=ttys003 ; PWD=/Users/matt/kube-solo ; USER=root ; COMMAND=/Applications/Kube-Solo.app/Contents/Resources/bin/corectl load settings/k8solo-01.toml\n6/15/16 9:26:14.130 AM InternetSharing[1787]: corectl: com.apple.NetworkSharing.broadcast-2 has been started\n6/15/16 9:26:14.130 AM InternetSharing[1787]: corectl: com.apple.NetworkSharing.broadcast-2 (idle) has been stopped\n6/15/16 9:26:14.480 AM InternetSharing[1787]: corectl: com.apple.NetworkSharing.broadcast-3 has been started\nThe 9:25 has been stopped message seems to correspond with the VM halting, after which I chose the \"Up\" menu item in kube-solo to bring it up again.\nMacintosh is MacBook Pro retina 13\", late 2013, 2.8 GhZ Core i7, 16GB RAM, OS X El Capitan 10.11.5. Kube-solo got 4GB RAM, 30GB disk.\n. I haven't seen this happen with the new separate corectl. I'll keep an eye out. Thanks @rimusz!\n. ",
    "theganyo": "Yes, it seemed to:\n```\nStarting VM ...\n\nbooting k8solo-01\n[corectl] stable/1010.5.0 already available on your system\n[corectl] '/Users/sganyo' was already available to VMs via NFS\n[corectl] started 'k8solo-01' in background with IP 192.168.64.6 and PID 26243\n\nWaiting for VM to be ready...\n\\\nfleetctl list-machines:\nMACHINE     IP      METADATA\n68b74dfb... 192.168.64.6    -\n6b335431... 192.168.64.6    -\nWaiting for Kubernetes cluster to be ready. This can take a few minutes...\nkubernetes nodes list:\nNAME           STATUS    AGE\n192.168.64.6   Ready     20h\n```\n. Also, I attempted to launch the \"Kubernetes Dashboard\" and received this error:\n```\nInternal Server Error (500)\nthe server has asked for the client to provide credentials (get replicationControllers)\n```\n. Ok. Here's what I did:\n- Destroy VM\n- rm -rf ~/kube-solo\n- Initial Setup (Stable)\n  (The only error I got here was: \"[ERROR] Remote kube-charts already exists, and is pointed to https://github.com/TheNewNormal/kube-charts\")\n- Up\nAll of that seemed to go just fine.\nAlso, Kubernetes dashboard seems to work now.\nThe original issue with \"Preset OS shell\" remains, however. \nIs there anything else I could have cleaned up?\n. ",
    "dmcnaught": "Doesn't seem like it is @rimusz \nbash\ncurl http://google.com\ncurl: (6) Couldn't resolve host 'google.com'\n. I rebooted a few times as part of troubleshooting. I have had no other issues with networking, virtualbox...\n. Should xhyve be available on my system from the command line?\n. How can I view the VM settings?\n. @AntonioMeireles No - I'm in my home office.\n. bash\nsudo corectl run                                                                                                                                  255 ↵\n[corectl] alpha/1068.0.0 already available on your system\n                                                         [corectl] '/Users/duncan.mcnaught' was already available to VMs via NFS\n                                                                                                                                kexec: failed to load kernel /Users/duncan.mcnaught/.coreos/images/alpha/1068.0.0/coreos_production_pxe.vmlinuz\n                                                                               Error: signal: abort trap```\n. (after I removed /etc/exports)\n. MacBookMacBook Pro (Retina, 15-inch, Mid 2015)\n2.2 GHz Intel Core i7\n16 GB 1600 MHz DDR3\nrunning El Capitan v10.11.5\n. Could it be a problem with zsh?\n. https://gist.github.com/dmcnaught/99d6d647a2ed4917698ee015544023be\n. It's a weird progression:\nbash\nsudo corectl run\n[corectl] downloading and verifying alpha/1068.0.0\nError: Signature check for DIGESTS failed.\nbash\nsudo corectl run                                                                                                                                           255 ↵\n[corectl] alpha/1068.0.0 already available on your system\nError: unable to validate /etc/exports ('[]')```\n. No image in the alpha dir that was created before the error.\n. cat /etc/exports\n/Users/duncan.mcnaught -network 192.168.64.0 -mask 255.255.255.0 -alldirs -maproot=root:wheel\n. corectl pull -f                                                                                                                              255 ↵\n[corectl] downloading and verifying alpha/1068.0.0\nError: Signature check for DIGESTS failed.\n. ``` bash\n--- .coreos/images » tree\n.\n├── alpha\n│   └── 1068.0.0\n├── beta\n└── stable\n    └── 1010.5.0\n        ├── coreos_production_pxe.vmlinuz\n        └── coreos_production_pxe_image.cpio.gz\n5 directories, 2 files\n. bash\n--- .coreos/images » corectl version\nCoreOS over OSX made simple.\n - http://github.com/TheNewNormal/corectl\n   Copyright (c) 2015-2016, António Meireles\nRunning version: 0.5.4\n                 built with go1.5.3, 2016-01-28 03:16:27 +0000 PST\nLatest upstream: 0.5.10\n--- .coreos/images » which corectl\n/opt/boxen/homebrew/bin/corectl\n```\n. ok - VM running - here is output of the two commands:\nhttps://gist.github.com/dmcnaught/d9bd94144f7cfd100feb96e47fae5c32\n. on that host:\nbash\ncore@6095f71d-ff90-4cf0-8d37-6ec6706204c1 ~ $ curl http://google.com\ncurl: (6) Couldn't resolve host 'google.com'\n. USA:MT, ok - thanks\n. Ping @AntonioMeireles \n. ok\n. Worked with @AntonioMeireles in Slack - had to turn off Firewall on Mac (then fleet-ui.service starts ok), and also update /etc/resolv.conf in VM to 8.8.8.8 and restart fleet-units.\n. /etc/resolv.conf does keep getting re-written back to nameserver 192.168.64.1 though, so I don't really have a useable environment...\n. Ok, right - and that workaround doesn't really seem to persist while using kube-solo in a single session.\n. ",
    "the-destro": "Sorry @rimusz I was out of town. The issue is that if I have, say, a webserver running on the host and I want to view pages from the server from a different machine I am unable to. A key use case being viewing a responsive design using a phone.\n. hmmm, might not be able to due to corp rules. I was wondering if there would be a way to use the docker for mac vpnkit to allow that bridging.\n. Anything new on this or anything I can do to help?\n. I think I have an idea to use socat, but it might be a little ugly. I'll give it a shot and let you know\n. ",
    "huggsboson": "Note: I worked around by removing all lines from /etc/exports\n. ",
    "McCodeman": "@whitlockjc I'm also interested in enabling RBAC.  Have you posted your procedure anywhere?  I specifically have a need for some pods to be able to interact with the K8s API (currently they are getting denied).  After enabling RBAC, my thought was to create a service account with the appropriate roles bound to it that given them access to query the API.  Thanks for your input.  -- One additional thing... can the certificate approach allow a container process to access the API?\n. ",
    "cobrowserAlex": "Sorry, I meant kube-dashboard. So I guess it's loaded, just shows an error after a fresh install.\n\n. ok that's what that comment in the release notes meant. thanks.\n. @rimusz I was going to use this setup for local development, thus sharing code with k8s while developing, but with NFS not available that will prove a bit more tricky.\nAny idea how I could ssh into the VM? then I could use an rsync onchange with -e \"ssh core@....\" \n. @rimusz thanks.\nssh works like a charm, but rsync not yet:\n$ rsync -ave \"corectl ssh k8solo-01\" ./secret/ k8solo-01:/mnt/secret\n[ERROR] operation not supported on socket\nrsync: connection unexpectedly closed (0 bytes received so far) [sender]\nrsync error: error in rsync protocol data stream (code 12) at /BuildRoot/Library/Caches/com.apple.xbs/Sources/rsync/rsync-47/rsync/io.c(453) [sender=2.6.9]\n. ooh, probably something along the lines of docker ... like in the upload_docker_images.command\n. @AntonioMeireles thanks, almost:\nalexknol@Alexs-MacBook-Pro-2~/dev $ corectl q k8solo-01 -j | jq -r \".[] | .InternalSSHprivate \"  >  ./foo\nalexknol@Alexs-MacBook-Pro-2~/dev $ rsync -ave \"ssh -i ./foo core@$(corectl q k8solo-01 -i)\" ./secret/ k8solo-01:/mnt/secret\nThe authenticity of host '192.168.64.3 (192.168.64.3)' can't be established.\nECDSA key fingerprint is SHA256:18kjkADpaBRZdCy8Qs+rtXW/Vqpg1ugj+68umbuIrlA.\nAre you sure you want to continue connecting (yes/no)? yes\nWarning: Permanently added '192.168.64.3' (ECDSA) to the list of known hosts.\nbash: k8solo-01: command not found\nrsync: connection unexpectedly closed (0 bytes received so far) [sender]\nrsync error: remote command not found (code 127) at /BuildRoot/Library/Caches/com.apple.xbs/Sources/rsync/rsync-47/rsync/io.c(453) [sender=2.6.9]\nCongrats by the way on winning the EU football Cup ;-)\n. hahaha, Sorry @rimusz i didn't want to put any pressure on you. But Thanks!\n. I did this with VPN -> ON\n$ sudo pfctl -s nat\nNo ALTQ support in kernel\nALTQ related functions disabled\nnat-anchor \"com.apple.internet-sharing\" all\nrdr-anchor \"corectl-dns-forwarding\" all\nrdr-anchor \"com.apple.internet-sharing\" all\n$ sudo pfctl -s nat -a com.apple.internet-sharing\nNo ALTQ support in kernel\nALTQ related functions disabled\nnat-anchor \"shared_v4\" all\nrdr-anchor \"shared_v4\" all\n$ sudo pfctl -s nat -a corectl-dns-forwarding\nNo ALTQ support in kernel\nALTQ related functions disabled\nrdr pass on bridge100 inet proto tcp from any to any port = 53 -> 192.168.64.1 port 15353\nrdr pass on bridge100 inet proto udp from any to any port = 53 -> 192.168.64.1 port 15353\n$ sudo pfctl -s nat -a com.apple.internet-sharing\nNo ALTQ support in kernel\nALTQ related functions disabled\nnat-anchor \"shared_v4\" all\nrdr-anchor \"shared_v4\" all\n. yes, I did:\n```\n$ RULE=\"nat on {utun0} proto {tcp, udp, icmp} from 192.168.64.0/24 to any -> {utun0}\"\nalexknol@Alexs-MacBook-Pro-2~ $ echo \"$RULE\"  | sudo pfctl -a com.apple/utun0nat -f -\npfctl: Use of -f option, could result in flushing of rules\npresent in the main ruleset added by the system at startup.\nSee /etc/pf.conf for further details.\nNo ALTQ support in kernel\nALTQ related functions disabled\n$ sudo pfctl -s nat -a com.apple.internet-sharing\nNo ALTQ support in kernel\nALTQ related functions disabled\nnat-anchor \"shared_v4\" all\nrdr-anchor \"shared_v4\" all\n$ sudo pfctl -s nat -a corectl-dns-forwarding\nNo ALTQ support in kernel\nALTQ related functions disabled\nrdr pass on bridge100 inet proto tcp from any to any port = 53 -> 192.168.64.1 port 15353\nrdr pass on bridge100 inet proto udp from any to any port = 53 -> 192.168.64.1 port 15353\n```\nmaybe I have a syntax error in my part ?\n. great!\n. @AntonioMeireles were you able to find time to check this out?\n. ",
    "kloudstudio": "thanks for the info. will keep an eye out for it. \n. @rimusz apologies for the delayed response. \nI think I understand the issue now; I agree with you on putting files in /usr/local/sbin my point was on OS X .../local/sbin was not created after installing corectl.app. I had to create it manually. once I did that kube-solo app worked as expected.  \nretrospectively I should have opened a bug in corectl.app repo.\n. ",
    "tpbrown": "dammmmn you're fast!\n. @rimusz done.    I don't have XCode installed so I tested by copying the modified commands into Kube-Solo.app/Contents/Resources and re-ran setup, ran through up, and OS shell.\n. ",
    "raeesbhatti": "It will actually be easier to upgrade too, one could do a brew upgrade corectl rather than visiting the releases page and downloading and installing manually.\n. Ref: #117 \n. The size of Kube-Solo-OSX repo was in GBs which is why I dint clone it locally and edited files on GitHub. Please do a squash and merge.\n117\n. ",
    "railgadi": "Similar issue is reported at https://github.com/TheNewNormal/corectl/issues/88\nIs there a forum where I can post my questions related to these tools?\n. Thank you Antonio !\n. ",
    "harobed": "Same error here, I've reinstalled corectl.app but ~/bin/ is always empty.\n. ",
    "rrva": "Ok, I guess closing this one. It's unfortunate that some things are not available in the same way locally.\n. ",
    "rbellamy": "@AntonioMeireles I'm also anxiously awaiting word back from you about this...\n. ",
    "seanknox": "hey @rimusz! thanks for pointing me to that. Should I be compiling kubectl using go v1.7.x and then dropping it into ~/kube-solo/bin? And if so, should I do the same with https://github.com/TheNewNormal/kube-cluster-osx?\n. Sweet, I did just that and all is working now. For posterity the process was:\n1. Remove all versions of go via homebrew\n2. Install go v1.7.1 via homebrew\n3. Compile kubectl according to https://medium.com/@gerred/kubectl-1-3-7-for-macos-sierra-ee2c483e283d#.l9sop4jje\n4. Stop kube-solo and rm -rf ~/kube-solo to prepare for a fresh install\n5. Start kube-solo and start the initial setup\n6. At the first prompt asking for CoreOS version, copy the newly compiled kubectl to ~/kube-solo/bin`\n7. Resume kube-solo install\nThanks for your help!\n. ",
    "mkarliner": "I did delete and try again, the log was from the second attempt. I should also mention that the settings sub-directory is not being created either.\n. I'm using bash.\nI should also mention I'm using docker for Mac beta.\nAfter creating settings and copying k8solo over, my next attempt gave\nStarting VM ...\n[WARN] unable to run \"defaults read /Library/Preferences/SystemConfiguration/com.apple.vmnet.plist\" Shared_Net_Address ...\n[WARN] ... assuming macOS default value (192.168.64.1)\n[WARN] unable to run \"defaults read /Library/Preferences/SystemConfiguration/com.apple.vmnet.plist\" Shared_Net_Mask ...\n[WARN] ... assuming macOS default value (255.255.255.0)\n\nbooting k8solo-01 (1/1)\n[ERROR] stat /Users/mike/kube-solo/cloud-init/user-data: no such file or directory\n\nVM has not booted, please check '~/kube-solo/logs/vm_up.log' and report the problem !!!\nPress [Enter] key to continue...\n. Rebooted, re-initialised. This time it hangs on 'waiting for Kubernetes cluster to be ready' This can take a bit.\nAfter an hour I gave up.\n. I've now done an upgrade to 10.11.6 and I can start k8solo. \nIt's worth mentioning that corectl still doesn't start correctly on boot,\nit asks for a password and then cannot start the server. If I try to start \nagain, it then works.\n. ",
    "jgsqware": "cool thanks\nOn Tue, Oct 18, 2016, 11:35 Rimas Mocevicius notifications@github.com\nwrote:\n\nClosed #143 https://github.com/TheNewNormal/kube-solo-osx/issues/143.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/TheNewNormal/kube-solo-osx/issues/143#event-827193248,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ADJrq-svsUhIZ0wTo2tMrFgp1sYXQraCks5q1JLJgaJpZM4KYu9P\n.\n. \n",
    "IanGSY": "Thanks for accepting + merging.\n. I am not sure about #151 but I used to experience a bug where I was unable to re-connect to the cluster after letting my mac go to sleep. This is now working.\n. ",
    "ishantanu": "@rimusz Still same error.\n. @rimusz This was fixed when the I restarted the system. But the reason behind this is still unknown.\n. What about Nodeport?\n. ",
    "traceypooh": "oh, um, wow.  well, gee, thanks very appreciated!\n. ",
    "sputnick": "This is easily reproducible. I deleted kube-solo folder and started over and created a new \"cluster\" and waited until the dashboard was up. Then Halted and Up and now the dashboard doesn't work. I didn't install anything in between.\n. Ok \"good\" that it also breaks for you. And just FYI if this info matters from kubectl version:\n\nClient Version: version.Info{Major:\"1\", Minor:\"4\", GitVersion:\"v1.4.5\", GitCommit:\"5a0a696437ad35c133c0c8493f7e9d22b0f9b81b\", GitTreeState:\"clean\", BuildDate:\"2016-10-29T01:38:40Z\", GoVersion:\"go1.7.1\", Compiler:\"gc\", Platform:\"darwin/amd64\"}\nServer Version: version.Info{Major:\"1\", Minor:\"4\", GitVersion:\"v1.4.5\", GitCommit:\"5a0a696437ad35c133c0c8493f7e9d22b0f9b81b\", GitTreeState:\"clean\", BuildDate:\"2016-10-29T01:32:42Z\", GoVersion:\"go1.6.3\", Compiler:\"gc\", Platform:\"linux/amd64\"}\n. Hey @rimusz I deleted SecurityContextDeny and restarted the cluster and now it works to install Jenkins :). Well as long as you disable persistent storage but that's another story...\n\nWould be great to get this built into a new release.\ncheers\nEiki. ",
    "ktamiola": "The same here. Could the issue be related to etcd ?\n. Cheers @AntonioMeireles ! Happy weekend and thank you! I am back on the track. For others who might bum into that issue,\nbrew install libev\n. ",
    "franz-josef-kaiser": "@rimusz Let's just change this to a more relaxed voice. Does this sound like a plan? :)\n. See #157 for a matching PR.\n. @rimusz I did not know that. Thanks for the heads up! Will change.\n. @rimusz Renamed, rebased and squashed into a single commit. Looks good to you?\n. ",
    "rockycape": "Same issue here resolved successfully with  \nbrew install libev\n. ",
    "aterreno": "Resolved the same way - this problem appears also on kube-cluster. \nA good solution would be somewhere in the scripts to probe if libev.4.dylib is installed or not... \n. ok cool\n. ",
    "jghoman": "I've run into this problem as well but use macports, which installs libev.4.dylib in /opt/local/lib instead of /usr/local/opt/libev.  I created the latter directory and symlinked the file into it, which worked.\n. ",
    "jonmoter": "I'm getting the same error, and I have homebrew installing in a non-standard location. So even if I brew install libev, it doesn't create a file at /usr/local/opt/libev/lib/libev.4.dylib.\nI can probably get around the problem with some symlinking, but +1 on getting this fixed.. ",
    "mikeleonard": "Hi I'm similar to the OP, looking to run k8s on my mac for local development and have found minikube and kube-solo/kube-cluster. I would have also liked something to explain how they compare to the officially supported minikube. Please (re)-consider adding this.. (PS... I assume I can install both, but perhaps a note to say this or to warn people against it if they can't both exist side-by-side). ",
    "vincent-dm": "@rimusz I understand that you don't want to do marketing to try to convince people to use kube-solo (I applaud that attitude). Nevertheless, I believe that a short, objective list of what differentiates kube-solo from minikube, and the pros/cons of using it would be useful.. ",
    "spundun": "From minikube's docs https://kubernetes.io/docs/getting-started-guides/minikube/ here are some listed features. It'd be useful to assert whether all these are supported by kube solo or not and if there are any features on top of this that kube solo supports.\nMinikube Features\nMinikube supports Kubernetes features such as:\nDNS\nNodePorts\nConfigMaps and Secrets\nDashboards\nContainer Runtime: Docker, and rkt\nEnabling CNI (Container Network Interface)\nIngress\n. ",
    "zatricion": "I think this is the issue: https://github.com/docker/docker/blob/master/CHANGELOG.md#1123-2016-10-26. ",
    "cougil": "Related with that, I've renamed the ~/kube-solo folder and try to restart the setup of the Kube-solo VM (clicking on the setup option in the kube-solo app) and Iterm2 crashes. \nWhat can I do in order to re-start again?\n. Which logs do you want? I can share the crash report that popup when Iterm2 starts or whatever logfile you want.. in fact, I don't have Openpgp installed :-?\nHere you can see the crash report of the Iterm2 when I try to set the 'initial-setup of the kube-solo VM'\n```\nProcess:               iTerm2 [43202]\nPath:                  /Users/USER/Downloads/*/iTerm.app/Contents/MacOS/iTerm2\nIdentifier:            com.googlecode.iterm2\nVersion:               3.0.20161128-nightly (3.0.20161128-nightly)\nCode Type:             X86-64 (Native)\nParent Process:        ??? [1]\nResponsible:           iTerm2 [43202]\nUser ID:               501\nDate/Time:             2017-03-15 18:24:16.481 +0100\nOS Version:            Mac OS X 10.11.3 (15D21)\nReport Version:        11\nAnonymous UUID:        59847095-B05D-F3CA-40D0-29EF3223CD4B\nSleep/Wake UUID:       A572891A-7D4D-4433-A2BE-6E7C0CBD1413\nTime Awake Since Boot: 450000 seconds\nTime Since Wake:       2900 seconds\nSystem Integrity Protection: enabled\nCrashed Thread:        0  Dispatch queue: com.apple.main-thread\nException Type:        EXC_BAD_INSTRUCTION (SIGILL)\nException Codes:       0x0000000000000001, 0x0000000000000000\nException Note:        EXC_CORPSE_NOTIFY\nApplication Specific Information:\nCrashing on exception: -[PseudoTerminal touchBar]: unrecognized selector sent to instance 0x7fa65b8bcfa0\nApplication Specific Backtrace 1:\n0   CoreFoundation                      0x00007fff8af30ae2 exceptionPreprocess + 178\n1   libobjc.A.dylib                     0x00007fff93a47f7e objc_exception_throw + 48\n2   CoreFoundation                      0x00007fff8af33b9d -[NSObject(NSObject) doesNotRecognizeSelector:] + 205\n3   CoreFoundation                      0x00007fff8ae6c601 forwarding + 1009\n4   CoreFoundation                      0x00007fff8ae6c188 _CF_forwarding_prep_0 + 120\n5   iTerm2                              0x000000010fd1fbc6 -[PseudoTerminal currentSessionWordAtCursorDidBecome:] + 32\n6   iTerm2                              0x000000010fc53eba -[PTYTextView refresh] + 676\n7   iTerm2                              0x000000010fba20fc -[PTYTab setActiveSession:updateActivityCounter:] + 767\n8   iTerm2                              0x000000010fc52748 -[PTYTextView becomeFirstResponder] + 59\n9   AppKit                              0x00007fff8e1f5a9a -[NSWindow _realMakeFirstResponder:] + 431\n10  AppKit                              0x00007fff8db0c9db -[NSWindow makeFirstResponder:] + 123\n11  iTerm2                              0x000000010fd0fbb5 -[PseudoTerminal tabView:didSelectTabViewItem:] + 1233\n12  iTerm2                              0x000000010fb58da2 -[PSMTabBarControl tabView:didSelectTabViewItem:] + 144\n13  AppKit                              0x00007fff8dbd6f51 -[NSTabView selectTabViewItem:] + 1095\n14  iTerm2                              0x000000010fcfed2d -[PTYTabView selectTabViewItem:] + 52\n15  AppKit                              0x00007fff8dbd69a5 -[NSTabView _addedTab:atIndex:] + 148\n16  iTerm2                              0x000000010fcfecea -[PTYTabView insertTabViewItem:atIndex:] + 199\n17  iTerm2                              0x000000010fd1d153 -[PseudoTerminal insertTab:atIndex:] + 661\n18  iTerm2                              0x000000010fd1d3c9 -[PseudoTerminal insertSession:atIndex:] + 281\n19  iTerm2                              0x000000010fd21c62 -[PseudoTerminal addSessionInNewTab:] + 306\n20  iTerm2                              0x000000010fd217b6 -[PseudoTerminal createSessionWithProfile:withURL:forObjectType:serverConnection:] + 357\n21  iTerm2                              0x000000010fc74fe6 __57-[iTermOrphanServerAdopter openOrphanedSession:inWindow:]_block_invoke + 102\n22  iTerm2                              0x000000010fcb9db5 -[iTermController launchBookmark:inTerminal:withURL:hotkeyWindowType:makeKey:canActivate:command:block:] + 1678\n23  iTerm2                              0x000000010fc74f31 -[iTermOrphanServerAdopter openOrphanedSession:inWindow:] + 238\n24  iTerm2                              0x000000010fc74e0e -[iTermOrphanServerAdopter adoptOrphanWithPath:] + 250\n25  iTerm2                              0x000000010fc74ca6 -[iTermOrphanServerAdopter openWindowWithOrphans] + 212\n26  CoreFoundation                      0x00007fff8aeea70c __CFNOTIFICATIONCENTER_IS_CALLING_OUT_TO_AN_OBSERVER + 12\n27  CoreFoundation                      0x00007fff8aeea67f CFXRegistrationPostblock_invoke + 63\n28  CoreFoundation                      0x00007fff8aee9d47 _CFXRegistrationPost + 407\n29  CoreFoundation                      0x00007fff8aee9ab2 _CFXNotificationPost_block_invoke + 50\n30  CoreFoundation                      0x00007fff8aee3d42 -[_CFXNotificationRegistrar find:object:observer:enumerator:] + 1922\n31  CoreFoundation                      0x00007fff8add2145 _CFXNotificationPost + 693\n32  Foundation                          0x00007fff98590921 -[NSNotificationCenter postNotificationName:object:userInfo:] + 66\n33  AppKit                              0x00007fff8da9765d -[NSApplication _postDidFinishNotification] + 297\n34  AppKit                              0x00007fff8da973d3 -[NSApplication _sendFinishLaunchingNotification] + 203\n35  AppKit                              0x00007fff8da8e661 _DPSNextEvent + 2462\n36  AppKit                              0x00007fff8de5a943 -[NSApplication _nextEventMatchingEventMask:untilDate:inMode:dequeue:] + 454\n37  AppKit                              0x00007fff8da83fc8 -[NSApplication run] + 682\n38  AppKit                              0x00007fff8da06520 NSApplicationMain + 1176\n39  iTerm2                              0x000000010fb34dbe main + 110\n40  libdyld.dylib                       0x00007fff8b7665ad start + 1\nThread 0 Crashed:: Dispatch queue: com.apple.main-thread\n0   com.apple.AppKit                0x00007fff8dd90f86 -[NSApplication _crashOnException:] + 109\n1   com.apple.AppKit                0x00007fff8dd90ee0 -[NSApplication reportException:] + 140\n2   com.apple.AppKit                0x00007fff8da840de -[NSApplication run] + 960\n3   com.apple.AppKit                0x00007fff8da06520 NSApplicationMain + 1176\n4   com.googlecode.iterm2           0x000000010fb34dbe main + 110\n5   libdyld.dylib                   0x00007fff8b7665ad start + 1\nThread 1:\n0   libsystem_kernel.dylib          0x00007fff8779e6de __workq_kernreturn + 10\n1   libsystem_pthread.dylib         0x00007fff912e5729 _pthread_wqthread + 1283\n2   libsystem_pthread.dylib         0x00007fff912e3365 start_wqthread + 13\nThread 2:: Dispatch queue: com.apple.libdispatch-manager\n0   libsystem_kernel.dylib          0x00007fff8779eff6 kevent_qos + 10\n1   libdispatch.dylib               0x00007fff8f002099 _dispatch_mgr_invoke + 216\n2   libdispatch.dylib               0x00007fff8f001d01 _dispatch_mgr_thread + 52\nThread 3:\n0   libsystem_kernel.dylib          0x00007fff8779e6de __workq_kernreturn + 10\n1   libsystem_pthread.dylib         0x00007fff912e5729 _pthread_wqthread + 1283\n2   libsystem_pthread.dylib         0x00007fff912e3365 start_wqthread + 13\nThread 4:\n0   libsystem_kernel.dylib          0x00007fff8779e6de __workq_kernreturn + 10\n1   libsystem_pthread.dylib         0x00007fff912e5729 _pthread_wqthread + 1283\n2   libsystem_pthread.dylib         0x00007fff912e3365 start_wqthread + 13\nThread 5:\n0   libsystem_kernel.dylib          0x00007fff8779e6de __workq_kernreturn + 10\n1   libsystem_pthread.dylib         0x00007fff912e5729 _pthread_wqthread + 1283\n2   libsystem_pthread.dylib         0x00007fff912e3365 start_wqthread + 13\nThread 6:\n0   libsystem_kernel.dylib          0x00007fff8779e6de __workq_kernreturn + 10\n1   libsystem_pthread.dylib         0x00007fff912e5729 _pthread_wqthread + 1283\n2   libsystem_pthread.dylib         0x00007fff912e3365 start_wqthread + 13\nThread 7:\n0   libsystem_kernel.dylib          0x00007fff8779e6de __workq_kernreturn + 10\n1   libsystem_pthread.dylib         0x00007fff912e5729 _pthread_wqthread + 1283\n2   libsystem_pthread.dylib         0x00007fff912e3365 start_wqthread + 13\nThread 8:: com.apple.CFSocket.private\n0   libsystem_kernel.dylib          0x00007fff8779e176 __select + 10\n1   com.apple.CoreFoundation        0x00007fff8ae7e16a __CFSocketManager + 762\n2   libsystem_pthread.dylib         0x00007fff912e5c13 _pthread_body + 131\n3   libsystem_pthread.dylib         0x00007fff912e5b90 _pthread_start + 168\n4   libsystem_pthread.dylib         0x00007fff912e3375 thread_start + 13\nThread 9:\n0   libsystem_kernel.dylib          0x00007fff8779e206 semwait_signal + 10\n1   libsystem_c.dylib               0x00007fff902bcd17 nanosleep + 199\n2   com.apple.Foundation            0x00007fff9862ecfd +[NSThread sleepForTimeInterval:] + 156\n3   com.googlecode.iterm2           0x000000010fb51139 -[ProcessCache _run] + 239\n4   com.apple.Foundation            0x00007fff98760c6f __NSThread__start + 1351\n5   libsystem_pthread.dylib         0x00007fff912e5c13 _pthread_body + 131\n6   libsystem_pthread.dylib         0x00007fff912e5b90 _pthread_start + 168\n7   libsystem_pthread.dylib         0x00007fff912e3375 thread_start + 13\nThread 0 crashed with X86 Thread State (64-bit):\n  rax: 0x00007fa659c9aa00  rbx: 0x00007fa65bb86660  rcx: 0x0000000000000001  rdx: 0x0000000000000000\n  rdi: 0x00007fff500cc640  rsi: 0x00000000000010de  rbp: 0x00007fff500ccae0  rsp: 0x00007fff500ccad0\n   r8: 0x0000000000000000   r9: 0x0000000008000100  r10: 0x0000000000000000  r11: 0x00000000000049ff\n  r12: 0x00007fff93a384c0  r13: 0x00007fa6597d0bf0  r14: 0x00007fff93a384c0  r15: 0x00007fff7544e9d0\n  rip: 0x00007fff8dd90f86  rfl: 0x0000000000010202  cr2: 0x0000000117102000\nLogical CPU:     0\nError Code:      0x00000000\nTrap Number:     6\nBinary Images:\n       0x10fb33000 -        0x10fdcdff3 +com.googlecode.iterm2 (3.0.20161128-nightly - 3.0.20161128-nightly) <05ADC2D3-222E-3B02-B94D-53E611FE2AFD> /Users/USER/Downloads//iTerm.app/Contents/MacOS/iTerm2\n       0x110110000 -        0x110128fff  libaprutil-1.0.dylib (36) <135898DA-5A97-33A3-9676-1980AA6CC630> /usr/lib/libaprutil-1.0.dylib\n       0x11013a000 -        0x11030ce67 +se.ninemuses.NMSSH (1.0 - 1) <20D98288-7720-3A5D-9561-60F8932D3C75> /Users/USER/Downloads//iTerm.app/Contents/Frameworks/NMSSH.framework/Versions/A/NMSSH\n       0x11038b000 -        0x1103e7ff7 +com.growl.growlframework (2.0.1 - 2.0.1) <6C20B93B-75B2-30A4-8267-8C81BF90872B> /Users/USER/Downloads//iTerm.app/Contents/Frameworks/Growl.framework/Versions/A/Growl\n       0x11041a000 -        0x110446fff +com.googlecode.iterm2.ColorPicker (1.0 - 1) <350AC017-61DB-3B66-94B9-86EFAE7EDC8F> /Users/USER/Downloads//iTerm.app/Contents/Frameworks/ColorPicker.framework/Versions/A/ColorPicker\n       0x110464000 -        0x1104a0ff7 +org.sparkle-project.Sparkle (1.14.0 git-0e8fd06 - 1.14.0) <3E6C723A-1618-36B9-B575-AB19DF827A73> /Users/USER/Downloads/*/iTerm.app/Contents/Frameworks/Sparkle.framework/Versions/A/Sparkle\n       0x1104c3000 -        0x1104dcfff  libexpat.1.dylib (12.20.1)  /usr/lib/libexpat.1.dylib\n       0x1104ea000 -        0x110502ff7  libapr-1.0.dylib (36)  /usr/lib/libapr-1.0.dylib\n       0x113223000 -        0x113223fe7 +cl_kernels (???)  cl_kernels\n       0x1164e6000 -        0x116551ff7  com.apple.driver.AppleIntelBDWGraphicsMTLDriver (10.12.13 - 10.1.2) <1BE25C9C-D8B8-30C3-A8B9-6DB9C720E6C3> /System/Library/Extensions/AppleIntelBDWGraphicsMTLDriver.bundle/Contents/MacOS/AppleIntelBDWGraphicsMTLDriver\n    0x7fff6fadc000 -     0x7fff6fb13007  dyld (360.19) <9D05FDF4-65CE-3B53-86D4-ABE1A5BF35F3> /usr/lib/dyld\n    0x7fff83fa7000 -     0x7fff83faeff7  libcompiler_rt.dylib (62)  /usr/lib/system/libcompiler_rt.dylib\n    0x7fff83ffa000 -     0x7fff8400efe3  libCGInterfaces.dylib (317.9) <5079DE4F-3717-32FF-B76A-77F53236D17D> /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vImage.framework/Versions/A/Libraries/libCGInterfaces.dylib\n    0x7fff84014000 -     0x7fff84025ff7  libz.1.dylib (61.20.1)  /usr/lib/libz.1.dylib\n    0x7fff84026000 -     0x7fff84086fff  com.apple.QuickLookFramework (5.0 - 696.3)  /System/Library/Frameworks/QuickLook.framework/Versions/A/QuickLook\n    0x7fff84087000 -     0x7fff8412efff  com.apple.LanguageModeling (1.0 - 1)  /System/Library/PrivateFrameworks/LanguageModeling.framework/Versions/A/LanguageModeling\n    0x7fff8413a000 -     0x7fff8413aff7  liblaunch.dylib (756.20.4)  /usr/lib/system/liblaunch.dylib\n    0x7fff8413b000 -     0x7fff8414cff7  libsystem_trace.dylib (201.10.3)  /usr/lib/system/libsystem_trace.dylib\n    0x7fff8414d000 -     0x7fff84150ff7  libsystem_sandbox.dylib (460.30.1) <3E0036AF-FC64-3352-8DA4-6B550C2C2562> /usr/lib/system/libsystem_sandbox.dylib\n    0x7fff84151000 -     0x7fff843d7ff7  com.apple.CFNetwork (760.2.6 - 760.2.6) <653B1552-C1EC-36A5-85D0-9FC3ED3CCF72> /System/Library/Frameworks/CFNetwork.framework/Versions/A/CFNetwork\n    0x7fff8461d000 -     0x7fff84644fff  com.apple.ProtectedCloudStorage (1.0 - 1)  /System/Library/PrivateFrameworks/ProtectedCloudStorage.framework/Versions/A/ProtectedCloudStorage\n    0x7fff84645000 -     0x7fff8464afff  com.apple.TCC (1.0 - 1)  /System/Library/PrivateFrameworks/TCC.framework/Versions/A/TCC\n    0x7fff8464b000 -     0x7fff84930ff3  com.apple.CoreServices.CarbonCore (1136 - 1136)  /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/CarbonCore.framework/Versions/A/CarbonCore\n    0x7fff84a70000 -     0x7fff84aa3ff7  com.apple.MediaKit (16 - 809)  /System/Library/PrivateFrameworks/MediaKit.framework/Versions/A/MediaKit\n    0x7fff84aa4000 -     0x7fff84aa8fff  libcache.dylib (75) <6B245C0A-F3EA-383B-A542-5B0D0456A41B> /usr/lib/system/libcache.dylib\n    0x7fff84b49000 -     0x7fff84b49fff  com.apple.quartzframework (1.5 - 21) <5DC3D0D9-9E3F-3AA5-92F1-F229907A49B9> /System/Library/Frameworks/Quartz.framework/Versions/A/Quartz\n    0x7fff84b7e000 -     0x7fff84b94ff7  libLinearAlgebra.dylib (1159)  /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vecLib.framework/Versions/A/libLinearAlgebra.dylib\n    0x7fff84b95000 -     0x7fff84cb9fff  libsqlite3.dylib (216.4) <280D67B8-F93D-3587-A146-19F36C817548> /usr/lib/libsqlite3.dylib\n    0x7fff84cba000 -     0x7fff84cffff3  libFontRegistry.dylib (155.1) <593CC743-3785-3CC5-A229-D3846C51E054> /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/ATS.framework/Versions/A/Resources/libFontRegistry.dylib\n    0x7fff84d00000 -     0x7fff84d2eff7  com.apple.CoreServicesInternal (248.2 - 248.2) <7D0D2C65-C4C4-3FBD-89A7-12302EA444AA> /System/Library/PrivateFrameworks/CoreServicesInternal.framework/Versions/A/CoreServicesInternal\n    0x7fff84d74000 -     0x7fff84e1ffff  com.apple.PDFKit (3.1 - 3.1)  /System/Library/Frameworks/Quartz.framework/Versions/A/Frameworks/PDFKit.framework/Versions/A/PDFKit\n    0x7fff84e20000 -     0x7fff84e2cff7  com.apple.SpeechRecognitionCore (2.2.7 - 2.2.7) <8B6C0DB6-8744-3AEB-BD00-9FA6967E7125> /System/Library/PrivateFrameworks/SpeechRecognitionCore.framework/Versions/A/SpeechRecognitionCore\n    0x7fff84f37000 -     0x7fff84f66ffb  libsystem_m.dylib (3105) <26655445-CA97-321E-B221-801CB378D1AA> /usr/lib/system/libsystem_m.dylib\n    0x7fff84f67000 -     0x7fff84f78fff  libSparseBLAS.dylib (1159) <3C520738-8F54-36E4-B966-97D1F886F59E> /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vecLib.framework/Versions/A/libSparseBLAS.dylib\n    0x7fff84fff000 -     0x7fff8505dfff  com.apple.SystemConfiguration (1.14 - 1.14) <5A70115B-E346-3EBD-A617-9A11C61EEF2E> /System/Library/Frameworks/SystemConfiguration.framework/Versions/A/SystemConfiguration\n    0x7fff850f4000 -     0x7fff8515bfff  com.apple.framework.CoreWiFi (11.0 - 1101.20)  /System/Library/PrivateFrameworks/CoreWiFi.framework/Versions/A/CoreWiFi\n    0x7fff8515c000 -     0x7fff852dafff  com.apple.UIFoundation (1.0 - 436.1) <8C254BB0-1DED-36A2-AAAF-786EB19CCE39> /System/Library/PrivateFrameworks/UIFoundation.framework/Versions/A/UIFoundation\n    0x7fff85363000 -     0x7fff8544aff7  libcrypto.0.9.8.dylib (59)  /usr/lib/libcrypto.0.9.8.dylib\n    0x7fff8544b000 -     0x7fff8552bff7  unorm8_rgba.dylib (2.6.4.1) <6970FC46-0D13-3614-929D-9504AB54C740> /System/Library/Frameworks/OpenCL.framework/Versions/A/Libraries/ImageFormats/unorm8_rgba.dylib\n    0x7fff857f4000 -     0x7fff8585eff7  com.apple.framework.CoreWLAN (11.0 - 1101.20) <6A535459-6A8A-3D60-986B-EE7ED833A9C3> /System/Library/Frameworks/CoreWLAN.framework/Versions/A/CoreWLAN\n    0x7fff8591d000 -     0x7fff85920fff  libCoreVMClient.dylib (119.5)  /System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/libCoreVMClient.dylib\n    0x7fff8598e000 -     0x7fff85a79ff7  com.apple.QuickLookUIFramework (5.0 - 696.3) <8416C721-85D3-3F4A-9916-2CB4640BB0CB> /System/Library/Frameworks/Quartz.framework/Versions/A/Frameworks/QuickLookUI.framework/Versions/A/QuickLookUI\n    0x7fff85baf000 -     0x7fff85bafff7  libkeymgr.dylib (28) <09397E01-6066-3179-A50C-2CE666FDA929> /usr/lib/system/libkeymgr.dylib\n    0x7fff85bb0000 -     0x7fff85bb1fff  liblangid.dylib (122) <9CC4F0D1-5C51-3B69-BC8F-EE3A51FD0822> /usr/lib/liblangid.dylib\n    0x7fff85bbe000 -     0x7fff86e0fff7  com.apple.CoreGraphics (1.600.0 - 948) <1F017C08-E3D9-30CD-9896-C66C6410926C> /System/Library/Frameworks/CoreGraphics.framework/Versions/A/CoreGraphics\n    0x7fff86e4a000 -     0x7fff86e58ff7  libbz2.1.0.dylib (38) <28E54258-C0FE-38D4-AB76-1734CACCB344> /usr/lib/libbz2.1.0.dylib\n    0x7fff86e59000 -     0x7fff86e5ffff  com.apple.IOAccelerator (205.1 - 205.1) <9B56A248-FA12-3DB9-AD97-51EB4700E8A8> /System/Library/PrivateFrameworks/IOAccelerator.framework/Versions/A/IOAccelerator\n    0x7fff86e60000 -     0x7fff86e6efff  com.apple.opengl (12.0.40 - 12.0.40)  /System/Library/Frameworks/OpenGL.framework/Versions/A/OpenGL\n    0x7fff86e75000 -     0x7fff86ea5ff3  com.apple.CoreAVCHD (5.8.0 - 5800.4.2)  /System/Library/PrivateFrameworks/CoreAVCHD.framework/Versions/A/CoreAVCHD\n    0x7fff86ea6000 -     0x7fff86ed7fff  com.apple.GSS (4.0 - 2.0) <25DECD44-0905-3E53-9480-DE7BEB84DB83> /System/Library/Frameworks/GSS.framework/Versions/A/GSS\n    0x7fff87787000 -     0x7fff877a5fff  libsystem_kernel.dylib (3248.30.4) <9CEB6C3B-1CAF-3C32-A9FD-93BC72CBCEA1> /usr/lib/system/libsystem_kernel.dylib\n    0x7fff877a6000 -     0x7fff877e4ff7  libGLImage.dylib (12.0.40.6)  /System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/libGLImage.dylib\n    0x7fff87e29000 -     0x7fff87e52ff7  libxslt.1.dylib (14.1)  /usr/lib/libxslt.1.dylib\n    0x7fff87e62000 -     0x7fff87e68fff  com.apple.XPCService (2.0 - 1) <9A305622-14E1-3D9A-BE47-6524419BA58D> /System/Library/PrivateFrameworks/XPCService.framework/Versions/A/XPCService\n    0x7fff87ebc000 -     0x7fff87ec4fe7  libsystem_platform.dylib (74.10.3)  /usr/lib/system/libsystem_platform.dylib\n    0x7fff87ec5000 -     0x7fff87f21fff  libTIFF.dylib (1442) <28DF1565-3705-3ED3-B570-C9CB12376D2E> /System/Library/Frameworks/ImageIO.framework/Versions/A/Resources/libTIFF.dylib\n    0x7fff87f24000 -     0x7fff87f9aff7  com.apple.MMCS (1.3 - 351) <13D01D37-66F0-30BB-AA7E-D1D348F738E3> /System/Library/PrivateFrameworks/MMCS.framework/Versions/A/MMCS\n    0x7fff87fa1000 -     0x7fff881aeff7  com.apple.CoreImage (11.2.0 - 366.2.7) <344F1067-5F52-3626-8F6C-2B678DEB80A1> /System/Library/Frameworks/CoreImage.framework/Versions/A/CoreImage\n    0x7fff88204000 -     0x7fff88484ff3  com.apple.security (7.0 - 57337.20.44) <290E0078-464E-30EE-8288-8B29A875FFE3> /System/Library/Frameworks/Security.framework/Versions/A/Security\n    0x7fff88485000 -     0x7fff88692ffb  libicucore.A.dylib (551.41)  /usr/lib/libicucore.A.dylib\n    0x7fff88693000 -     0x7fff8869bfff  com.apple.frameworks.CoreDaemon (1.3 - 1.3)  /System/Library/PrivateFrameworks/CoreDaemon.framework/Versions/B/CoreDaemon\n    0x7fff8869c000 -     0x7fff8975bff7  com.apple.WebCore (11601 - 11601.4.4) <815CFF7F-3839-3FDE-9B82-79253BFB3624> /System/Library/Frameworks/WebKit.framework/Versions/A/Frameworks/WebCore.framework/Versions/A/WebCore\n    0x7fff8a6d3000 -     0x7fff8a7acfff  com.apple.CoreMedia (1.0 - 1731.15.33) <6109D83B-4E0B-3DE2-9856-9FD80EA51CE0> /System/Library/Frameworks/CoreMedia.framework/Versions/A/CoreMedia\n    0x7fff8adc2000 -     0x7fff8b238fff  com.apple.CoreFoundation (6.9 - 1256.14) <768A7FB7-9143-3148-8591-7C6ED3162D35> /System/Library/Frameworks/CoreFoundation.framework/Versions/A/CoreFoundation\n    0x7fff8b239000 -     0x7fff8b2a8fff  com.apple.datadetectorscore (7.0 - 460)  /System/Library/PrivateFrameworks/DataDetectorsCore.framework/Versions/A/DataDetectorsCore\n    0x7fff8b560000 -     0x7fff8b65cff7  libFontParser.dylib (158.4)  /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/ATS.framework/Versions/A/Resources/libFontParser.dylib\n    0x7fff8b665000 -     0x7fff8b666fff  libsystem_secinit.dylib (20)  /usr/lib/system/libsystem_secinit.dylib\n    0x7fff8b667000 -     0x7fff8b74dfef  unorm8_bgra.dylib (2.6.4.1)  /System/Library/Frameworks/OpenCL.framework/Versions/A/Libraries/ImageFormats/unorm8_bgra.dylib\n    0x7fff8b763000 -     0x7fff8b766ffb  libdyld.dylib (360.19)  /usr/lib/system/libdyld.dylib\n    0x7fff8b767000 -     0x7fff8b76ffff  com.apple.NetFS (6.0 - 4.0)  /System/Library/Frameworks/NetFS.framework/Versions/A/NetFS\n    0x7fff8ba40000 -     0x7fff8c0e6ffb  com.apple.JavaScriptCore (11601 - 11601.4.2) <33235884-914C-3A2B-AD91-142E5AB8899F> /System/Library/Frameworks/JavaScriptCore.framework/Versions/A/JavaScriptCore\n    0x7fff8c24a000 -     0x7fff8c278ff7  com.apple.DictionaryServices (1.2 - 250)  /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/DictionaryServices.framework/Versions/A/DictionaryServices\n    0x7fff8c279000 -     0x7fff8c4e6fff  com.apple.imageKit (2.6 - 932) <6738F065-3D55-3165-8D3E-33AA18D6E3EA> /System/Library/Frameworks/Quartz.framework/Versions/A/Frameworks/ImageKit.framework/Versions/A/ImageKit\n    0x7fff8c4e7000 -     0x7fff8c508fff  com.apple.Sharing (442.9.1 - 442.9.1) <672DE6DF-98E0-30A4-BA25-44BDE188D0BE> /System/Library/PrivateFrameworks/Sharing.framework/Versions/A/Sharing\n    0x7fff8c509000 -     0x7fff8c511fff  libMatch.1.dylib (27) <3AC0BFB8-7E69-3DBE-A175-7F3946FC4554> /usr/lib/libMatch.1.dylib\n    0x7fff8c51b000 -     0x7fff8c726fff  libFosl_dynamic.dylib (16.24) <363B7CEE-B662-32F3-9D7B-245E64927C35> /usr/lib/libFosl_dynamic.dylib\n    0x7fff8c792000 -     0x7fff8c8d7fff  com.apple.QTKit (7.7.3 - 2943) <6DD72D38-9449-3289-904E-B6E148993AA5> /System/Library/Frameworks/QTKit.framework/Versions/A/QTKit\n    0x7fff8c8d8000 -     0x7fff8ca7eff7  com.apple.audio.toolbox.AudioToolbox (1.13 - 1.13)  /System/Library/Frameworks/AudioToolbox.framework/Versions/A/AudioToolbox\n    0x7fff8ca82000 -     0x7fff8cb26fff  com.apple.Bluetooth (4.4.3 - 4.4.3f4)  /System/Library/Frameworks/IOBluetooth.framework/Versions/A/IOBluetooth\n    0x7fff8cb76000 -     0x7fff8cb78ff7  com.apple.SafariServices.framework (11601 - 11601.4.4)  /System/Library/PrivateFrameworks/SafariServices.framework/Versions/A/SafariServices\n    0x7fff8cd60000 -     0x7fff8cdeffff  com.apple.CorePDF (4.0 - 4) <6147B89F-46D8-38B2-A7D0-C5AABCE35BC6> /System/Library/PrivateFrameworks/CorePDF.framework/Versions/A/CorePDF\n    0x7fff8cdf0000 -     0x7fff8cdfbfff  com.apple.CrashReporterSupport (10.11 - 717) <474544AD-1199-3ECC-90E5-071847BA72C6> /System/Library/PrivateFrameworks/CrashReporterSupport.framework/Versions/A/CrashReporterSupport\n    0x7fff8cdfc000 -     0x7fff8d26dff3  com.apple.GeoServices (1.0 - 1151.2.13.9) <52A8FBB6-267C-3371-A516-264572B5800F> /System/Library/PrivateFrameworks/GeoServices.framework/Versions/A/GeoServices\n    0x7fff8d26e000 -     0x7fff8d270ff7  com.apple.xpc.ServiceManagement (1.0 - 1) <3777FD15-B6F3-32A2-A8E3-3E8CE3B8D5E7> /System/Library/Frameworks/ServiceManagement.framework/Versions/A/ServiceManagement\n    0x7fff8d271000 -     0x7fff8d517ff7  com.apple.CoreData (120 - 641.3) <65509AA2-A0E6-3EE3-BDFE-B9B120F744ED> /System/Library/Frameworks/CoreData.framework/Versions/A/CoreData\n    0x7fff8d518000 -     0x7fff8d5c8fe7  libvMisc.dylib (563.4) <621D84AA-C752-34EE-8B16-CF0C2DE722FA> /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vecLib.framework/Versions/A/libvMisc.dylib\n    0x7fff8d5c9000 -     0x7fff8d5f2fff  libsystem_info.dylib (477.20.1) <6513635B-4ADE-3B45-BF63-ED7AC565B0C9> /usr/lib/system/libsystem_info.dylib\n    0x7fff8d5f3000 -     0x7fff8d5fcff7  com.apple.DisplayServicesFW (3.0 - 378)  /System/Library/PrivateFrameworks/DisplayServices.framework/Versions/A/DisplayServices\n    0x7fff8d720000 -     0x7fff8d8c7ffb  com.apple.avfoundation (2.0 - 1046.9.2)  /System/Library/Frameworks/AVFoundation.framework/Versions/A/AVFoundation\n    0x7fff8d913000 -     0x7fff8d918fff  com.apple.ImageCapture (9.0 - 9.0) <33F7822F-1124-3D73-AF66-515EA32A4A47> /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/ImageCapture.framework/Versions/A/ImageCapture\n    0x7fff8d970000 -     0x7fff8d978ff7  libcldcpuengine.dylib (2.6.4.1) <5FFEDBEF-2EFE-3F91-BABC-1E73B28487A2> /System/Library/Frameworks/OpenCL.framework/Versions/A/Libraries/libcldcpuengine.dylib\n    0x7fff8d979000 -     0x7fff8d979fff  libenergytrace.dylib (10)  /usr/lib/libenergytrace.dylib\n    0x7fff8d97a000 -     0x7fff8da03ff7  com.apple.PerformanceAnalysis (1.0 - 1)  /System/Library/PrivateFrameworks/PerformanceAnalysis.framework/Versions/A/PerformanceAnalysis\n    0x7fff8da04000 -     0x7fff8e627ff7  com.apple.AppKit (6.9 - 1404.34) <467468E2-C551-3408-B351-414B21F57DEB> /System/Library/Frameworks/AppKit.framework/Versions/C/AppKit\n    0x7fff8e635000 -     0x7fff8e640fff  libcsfde.dylib (517.20.1) <42376761-F1B3-3086-AFBC-231507582BBE> /usr/lib/libcsfde.dylib\n    0x7fff8e641000 -     0x7fff8e646fff  com.apple.DiskArbitration (2.7 - 2.7)  /System/Library/Frameworks/DiskArbitration.framework/Versions/A/DiskArbitration\n    0x7fff8e657000 -     0x7fff8e67efff  com.apple.ChunkingLibrary (167 - 167) <508861C9-F5E6-343B-8DD0-D71DFE49ECFD> /System/Library/PrivateFrameworks/ChunkingLibrary.framework/Versions/A/ChunkingLibrary\n    0x7fff8e67f000 -     0x7fff8e6d1fff  com.apple.AppleVAFramework (5.0.32 - 5.0.32) <04AB634C-FB23-3538-937C-FF60E5E59DF8> /System/Library/PrivateFrameworks/AppleVA.framework/Versions/A/AppleVA\n    0x7fff8e6d9000 -     0x7fff8e702fff  libxpc.dylib (756.20.4) <61AB4610-9304-354C-9E9B-D57198AE9866> /usr/lib/system/libxpc.dylib\n    0x7fff8e747000 -     0x7fff8e90dfff  com.apple.ImageIO.framework (3.3.0 - 1442) <1AE1EF1A-EA91-3453-A6F4-C11BD91B8D66> /System/Library/Frameworks/ImageIO.framework/Versions/A/ImageIO\n    0x7fff8e928000 -     0x7fff8e94afff  com.apple.IconServices (68.1 - 68.1) <3ECAA762-1193-3D76-A25F-7680DB3A957E> /System/Library/PrivateFrameworks/IconServices.framework/Versions/A/IconServices\n    0x7fff8e94b000 -     0x7fff8e94bfff  libOpenScriptingUtil.dylib (169.1) <03BEF6F0-07CD-3EDC-9D11-32202C1857B6> /usr/lib/libOpenScriptingUtil.dylib\n    0x7fff8e94c000 -     0x7fff8e951fff  com.apple.AssetCacheServices (14 - 14) <33685005-A92A-3006-97F5-FBF8530925B2> /System/Library/PrivateFrameworks/AssetCacheServices.framework/Versions/A/AssetCacheServices\n    0x7fff8e957000 -     0x7fff8e958ffb  libremovefile.dylib (41)  /usr/lib/system/libremovefile.dylib\n    0x7fff8e959000 -     0x7fff8ea7eff7  com.apple.LaunchServices (728.6 - 728.6) <204CD7A1-D99C-3655-82D7-E8E89F9C666B> /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/LaunchServices.framework/Versions/A/LaunchServices\n    0x7fff8ea7f000 -     0x7fff8ea81ff7  libRadiance.dylib (1442) <1E42E394-4CD2-3E10-8591-9BB234829AC6> /System/Library/Frameworks/ImageIO.framework/Versions/A/Resources/libRadiance.dylib\n    0x7fff8ea82000 -     0x7fff8ea92fff  libbsm.0.dylib (34) <7E14504C-A8B0-3574-B6EB-5D5FABC72926> /usr/lib/libbsm.0.dylib\n    0x7fff8ea93000 -     0x7fff8eae5fff  com.apple.ImageCaptureCore (7.0 - 7.0) <68537DDB-383F-3D4D-8125-789053333B13> /System/Library/Frameworks/ImageCaptureCore.framework/Versions/A/ImageCaptureCore\n    0x7fff8eae6000 -     0x7fff8eee2fff  libLAPACK.dylib (1159) <7618C270-D895-345C-B08B-102286A05A55> /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vecLib.framework/Versions/A/libLAPACK.dylib\n    0x7fff8ef4d000 -     0x7fff8ef58fff  libGL.dylib (12.0.40.6) <2A13E40A-BFA1-34FD-925A-C7023FEF254C> /System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/libGL.dylib\n    0x7fff8ef59000 -     0x7fff8ef5dfff  libGIF.dylib (1442) <39FA0286-1616-3474-8215-7CD07109C9E5> /System/Library/Frameworks/ImageIO.framework/Versions/A/Resources/libGIF.dylib\n    0x7fff8ef85000 -     0x7fff8eff9fff  com.apple.framework.IOKit (2.0.2 - 1179.20.6)  /System/Library/Frameworks/IOKit.framework/Versions/A/IOKit\n    0x7fff8effa000 -     0x7fff8f027fff  libdispatch.dylib (501.20.1) <324C9189-2AF3-3356-847F-6F4CE1C6E901> /usr/lib/system/libdispatch.dylib\n    0x7fff8f4a1000 -     0x7fff8f4fefff  com.apple.CoreServices.OSServices (728.6 - 728.6)  /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/OSServices.framework/Versions/A/OSServices\n    0x7fff8f7b1000 -     0x7fff8f7e2ff7  libncurses.5.4.dylib (46)  /usr/lib/libncurses.5.4.dylib\n    0x7fff8f7e3000 -     0x7fff8f7e3fff  com.apple.Cocoa (6.11 - 22) <0A634D46-B468-3CBC-B2A0-16C381C11BF2> /System/Library/Frameworks/Cocoa.framework/Versions/A/Cocoa\n    0x7fff8f864000 -     0x7fff8f86cfff  com.apple.CoreServices.FSEvents (1223.10.1 - 1223.10.1) <7F5B7A23-BC1D-3FA9-A9B8-D534F1E1979A> /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/FSEvents.framework/Versions/A/FSEvents\n    0x7fff8fd48000 -     0x7fff8fd53fff  com.apple.AppSandbox (4.0 - 261.20.7) <0CA08EB7-D574-3E2F-A3AE-FEA80FF3F304> /System/Library/PrivateFrameworks/AppSandbox.framework/Versions/A/AppSandbox\n    0x7fff8fed3000 -     0x7fff8fed3fff  com.apple.Accelerate (1.10 - Accelerate 1.10)  /System/Library/Frameworks/Accelerate.framework/Versions/A/Accelerate\n    0x7fff8fed5000 -     0x7fff8fed7fff  com.apple.SecCodeWrapper (4.0 - 261.20.7)  /System/Library/PrivateFrameworks/SecCodeWrapper.framework/Versions/A/SecCodeWrapper\n    0x7fff8fed8000 -     0x7fff8feedfff  com.apple.AppContainer (4.0 - 261.20.7) <30414623-E68F-31A1-9794-1C052391E900> /System/Library/PrivateFrameworks/AppContainer.framework/Versions/A/AppContainer\n    0x7fff8feee000 -     0x7fff8fef6fff  libsystem_networkextension.dylib (385.20.6)  /usr/lib/system/libsystem_networkextension.dylib\n    0x7fff8ff13000 -     0x7fff8ff2bfd7  libcompression.dylib (25) <202CE8A7-3D5B-347A-BD22-F0CB589B29AF> /usr/lib/libcompression.dylib\n    0x7fff8ff2e000 -     0x7fff900fcffb  com.apple.QuartzCore (1.11 - 410.14)  /System/Library/Frameworks/QuartzCore.framework/Versions/A/QuartzCore\n    0x7fff900fd000 -     0x7fff90118ff7  libCRFSuite.dylib (34) <078B4CD8-6A8C-3067-B2BA-0C2A0BAB8AC3> /usr/lib/libCRFSuite.dylib\n    0x7fff9023d000 -     0x7fff902cafff  libsystem_c.dylib (1082.20.4)  /usr/lib/system/libsystem_c.dylib\n    0x7fff9039c000 -     0x7fff903ecff7  com.apple.Symbolication (1.4 - 58044) <2EC9F04A-4370-39C8-8549-FC6411D87463> /System/Library/PrivateFrameworks/Symbolication.framework/Versions/A/Symbolication\n    0x7fff9042a000 -     0x7fff90476ff7  com.apple.corelocation (1486.17 - 1615.38) <5AE891F7-ED25-3C6C-A8DD-5D702FB87DC7> /System/Library/Frameworks/CoreLocation.framework/Versions/A/CoreLocation\n    0x7fff904c6000 -     0x7fff905d4ff3  com.apple.desktopservices (1.10 - 1.10) <0BAED9FA-EFA5-3DA0-8715-043FD2400B77> /System/Library/PrivateFrameworks/DesktopServicesPriv.framework/Versions/A/DesktopServicesPriv\n    0x7fff905d9000 -     0x7fff905ecfff  com.apple.CoreBluetooth (1.0 - 1)  /System/Library/Frameworks/CoreBluetooth.framework/Versions/A/CoreBluetooth\n    0x7fff90601000 -     0x7fff9068edd7  com.apple.AppleJPEG (1.0 - 1) <9F0E8564-FCC4-33BE-9C6A-2BA926A33F6F> /System/Library/PrivateFrameworks/AppleJPEG.framework/Versions/A/AppleJPEG\n    0x7fff90d64000 -     0x7fff90d8dfff  libc++abi.dylib (125)  /usr/lib/libc++abi.dylib\n    0x7fff90f08000 -     0x7fff90f7cff3  com.apple.securityfoundation (6.0 - 55126) <11644DA4-F1CF-3FB1-86A0-0DA8E8C27148> /System/Library/Frameworks/SecurityFoundation.framework/Versions/A/SecurityFoundation\n    0x7fff90fa5000 -     0x7fff90fe6ff7  libGLU.dylib (12.0.40.6) <1C9899B5-4741-340F-A2D7-F9AF03B42A47> /System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/libGLU.dylib\n    0x7fff90fe7000 -     0x7fff90ff0ff7  com.apple.CommonAuth (4.0 - 2.0)  /System/Library/PrivateFrameworks/CommonAuth.framework/Versions/A/CommonAuth\n    0x7fff91119000 -     0x7fff91130fff  libmarisa.dylib (4)  /usr/lib/libmarisa.dylib\n    0x7fff91131000 -     0x7fff91133ff7  com.apple.securityhi (9.0 - 55006)  /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/SecurityHI.framework/Versions/A/SecurityHI\n    0x7fff9114c000 -     0x7fff9114efff  com.apple.EFILogin (2.0 - 2) <38150198-DD7F-3C73-BCAA-C74BB376393A> /System/Library/PrivateFrameworks/EFILogin.framework/Versions/A/EFILogin\n    0x7fff911aa000 -     0x7fff911b9ffb  com.apple.LangAnalysis (1.7.0 - 1.7.0) <0D1BCC13-76B9-3C19-85AA-D8DD8299F007> /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/LangAnalysis.framework/Versions/A/LangAnalysis\n    0x7fff911c4000 -     0x7fff911ccfff  com.apple.AppleSRP (5.0 - 1) <25775E90-1DBB-3BFA-B4B4-F8F262B9EC1F> /System/Library/PrivateFrameworks/AppleSRP.framework/Versions/A/AppleSRP\n    0x7fff911cd000 -     0x7fff911d8ff7  libChineseTokenizer.dylib (16) <998637AB-DC37-3A7C-A85C-F10FD98CAAD7> /usr/lib/libChineseTokenizer.dylib\n    0x7fff911d9000 -     0x7fff911d9ff7  libunc.dylib (29) <1D0F8265-F026-3CBD-93D3-F8DF14FFCE68> /usr/lib/system/libunc.dylib\n    0x7fff911da000 -     0x7fff912cafff  libJP2.dylib (1442) <50DD1F07-6517-372B-8244-2AD19702385C> /System/Library/Frameworks/ImageIO.framework/Versions/A/Resources/libJP2.dylib\n    0x7fff912cb000 -     0x7fff912e1ff7  libsystem_coretls.dylib (83.20.8) <75C97D88-0A63-3093-AE83-DE33EB7405CE> /usr/lib/system/libsystem_coretls.dylib\n    0x7fff912e2000 -     0x7fff912ebff7  libsystem_pthread.dylib (138.10.4) <327CECD0-B881-3153-8FCC-4FD4818B7F16> /usr/lib/system/libsystem_pthread.dylib\n    0x7fff912ed000 -     0x7fff91375fff  com.apple.CoreSymbolication (3.1 - 58048.1) <6436E5E0-B05C-36D6-942A-47026DD2D874> /System/Library/PrivateFrameworks/CoreSymbolication.framework/Versions/A/CoreSymbolication\n    0x7fff91407000 -     0x7fff914c1fff  com.apple.DiscRecording (9.0.1 - 9010.4.3)  /System/Library/Frameworks/DiscRecording.framework/Versions/A/DiscRecording\n    0x7fff914c2000 -     0x7fff914d2ff3  com.apple.ProtocolBuffer (1 - 242) <127AF54F-615B-362A-A221-3E758C46A235> /System/Library/PrivateFrameworks/ProtocolBuffer.framework/Versions/A/ProtocolBuffer\n    0x7fff914d3000 -     0x7fff914dbfff  libcopyfile.dylib (127)  /usr/lib/system/libcopyfile.dylib\n    0x7fff914dc000 -     0x7fff914deff7  libquarantine.dylib (80) <163CF63A-7455-3D1F-AE57-8C4475A9204C> /usr/lib/system/libquarantine.dylib\n    0x7fff914df000 -     0x7fff915d1ff7  libiconv.2.dylib (44)  /usr/lib/libiconv.2.dylib\n    0x7fff915d2000 -     0x7fff915e4fff  libsasl2.2.dylib (209) <02BF4226-23E9-34EC-A727-CF0E205395F8> /usr/lib/libsasl2.2.dylib\n    0x7fff915e5000 -     0x7fff91635fff  libcups.2.dylib (435) <28A05475-9DBF-35EA-B218-3432B69EA18B> /usr/lib/libcups.2.dylib\n    0x7fff91636000 -     0x7fff9165fffb  libRIP.A.dylib (948) <96E8F983-A8BA-3B0F-9035-E09642A63F6E> /System/Library/Frameworks/CoreGraphics.framework/Versions/A/Resources/libRIP.A.dylib\n    0x7fff91660000 -     0x7fff91663ff7  libCoreFSCache.dylib (119.5)  /System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/libCoreFSCache.dylib\n    0x7fff91664000 -     0x7fff91665fff  libffi.dylib (18.1) <5BA9612C-747E-33CE-9DB1-3C01ECF3041D> /usr/lib/libffi.dylib\n    0x7fff9166e000 -     0x7fff91670ffb  libutil.dylib (43) <4C9BFE8B-563B-3EEA-A323-8F4F14E0A46C> /usr/lib/libutil.dylib\n    0x7fff91671000 -     0x7fff9167afff  com.apple.icloud.FindMyDevice (1.0 - 1)  /System/Library/PrivateFrameworks/FindMyDevice.framework/Versions/A/FindMyDevice\n    0x7fff9167b000 -     0x7fff916cdfff  com.apple.CloudDocs (1.0 - 383.5)  /System/Library/PrivateFrameworks/CloudDocs.framework/Versions/A/CloudDocs\n    0x7fff91950000 -     0x7fff91951ff3  com.apple.print.framework.Print (10.0 - 266)  /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/Print.framework/Versions/A/Print\n    0x7fff9197e000 -     0x7fff91998ff3  liblzma.5.dylib (10)  /usr/lib/liblzma.5.dylib\n    0x7fff91999000 -     0x7fff919fcfff  libAVFAudio.dylib (161.2)  /System/Library/Frameworks/AVFoundation.framework/Versions/A/Resources/libAVFAudio.dylib\n    0x7fff919fd000 -     0x7fff91a19ff3  libresolv.9.dylib (60)  /usr/lib/libresolv.9.dylib\n    0x7fff922d7000 -     0x7fff922d7fff  com.apple.Carbon (154 - 157) <34263101-328D-3FE4-B212-14BD3CFF6965> /System/Library/Frameworks/Carbon.framework/Versions/A/Carbon\n    0x7fff922d8000 -     0x7fff922e4ff7  com.apple.OpenDirectory (10.11 - 194) <5409AC27-3B83-3F35-8EB5-51228B4604AE> /System/Library/Frameworks/OpenDirectory.framework/Versions/A/OpenDirectory\n    0x7fff922e5000 -     0x7fff922e7fff  com.apple.loginsupport (1.0 - 1) <9B2F5F9B-ED38-313F-B798-D2B667BCD6B5> /System/Library/PrivateFrameworks/login.framework/Versions/A/Frameworks/loginsupport.framework/Versions/A/loginsupport\n    0x7fff922e8000 -     0x7fff922eafff  libsystem_coreservices.dylib (19.2) <1B3F5AFC-FFCD-3ECB-8B9A-5538366FB20D> /usr/lib/system/libsystem_coreservices.dylib\n    0x7fff922eb000 -     0x7fff922ebfff  com.apple.ApplicationServices (48 - 48)  /System/Library/Frameworks/ApplicationServices.framework/Versions/A/ApplicationServices\n    0x7fff922ec000 -     0x7fff92436fc7  com.apple.coreui (2.1 - 365.2) <727C55D3-503A-3EC4-8A23-C984E320F65F> /System/Library/PrivateFrameworks/CoreUI.framework/Versions/A/CoreUI\n    0x7fff9247a000 -     0x7fff9247efff  libpam.2.dylib (20)  /usr/lib/libpam.2.dylib\n    0x7fff9247f000 -     0x7fff92483fff  com.apple.CommonPanels (1.2.6 - 96) <61E9D84F-435A-3C7B-A065-047B80775777> /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/CommonPanels.framework/Versions/A/CommonPanels\n    0x7fff92484000 -     0x7fff92487fff  com.apple.Mangrove (1.0 - 1) <7919AD18-0EDE-3408-A6AC-A9121B8D857F> /System/Library/PrivateFrameworks/Mangrove.framework/Versions/A/Mangrove\n    0x7fff92d29000 -     0x7fff92d4dfff  libJPEG.dylib (1442) <9616E8A5-60BA-3C70-8F37-A33055D227C8> /System/Library/Frameworks/ImageIO.framework/Versions/A/Resources/libJPEG.dylib\n    0x7fff92d4e000 -     0x7fff92d88ff7  com.apple.DebugSymbols (132 - 132)  /System/Library/PrivateFrameworks/DebugSymbols.framework/Versions/A/DebugSymbols\n    0x7fff92d89000 -     0x7fff92d8cfff  com.apple.IOSurface (108.0.1 - 108.0.1) <7B05B27A-5CC4-30D4-8A10-ED444A2807A2> /System/Library/Frameworks/IOSurface.framework/Versions/A/IOSurface\n    0x7fff92e41000 -     0x7fff92e4cff7  libcommonCrypto.dylib (60075.20.1) <766BC3F5-41F3-3315-BABC-72718A98EA92> /usr/lib/system/libcommonCrypto.dylib\n    0x7fff92e4d000 -     0x7fff92e52ff7  libheimdal-asn1.dylib (453.20.2)  /usr/lib/libheimdal-asn1.dylib\n    0x7fff92ecb000 -     0x7fff92ed3ffb  libsystem_dnssd.dylib (625.20.4) <945B5FB1-DA91-3D45-A961-A8FAD53C1E7E> /usr/lib/system/libsystem_dnssd.dylib\n    0x7fff92ed4000 -     0x7fff92f69fff  com.apple.ink.framework (10.9 - 214) <6B573126-A6E9-357F-B36A-AA5BDC0BEAF8> /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/Ink.framework/Versions/A/Ink\n    0x7fff92f6a000 -     0x7fff92f86ff7  libextension.dylib (78) <589FA312-F17C-3A8D-986F-FD995D0065D5> /usr/lib/libextension.dylib\n    0x7fff93004000 -     0x7fff93005fff  com.apple.TrustEvaluationAgent (2.0 - 25) <0239494E-FEFE-39BC-9FC7-E251BA5128F1> /System/Library/PrivateFrameworks/TrustEvaluationAgent.framework/Versions/A/TrustEvaluationAgent\n    0x7fff9300e000 -     0x7fff9301cfff  libxar.1.dylib (302) <03207F66-2C4A-3DBD-8D81-70F4C85903C4> /usr/lib/libxar.1.dylib\n    0x7fff93098000 -     0x7fff930a0fff  libGFXShared.dylib (12.0.40.6) <7E84C8A9-40DA-302A-A3DE-9AE3C61A3465> /System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/libGFXShared.dylib\n    0x7fff9360b000 -     0x7fff93986ffb  com.apple.VideoToolbox (1.0 - 1731.15.33) <33AED54A-87AE-330F-BAAD-FB8389C3E686> /System/Library/Frameworks/VideoToolbox.framework/Versions/A/VideoToolbox\n    0x7fff93a2d000 -     0x7fff93a36ff3  libsystem_notify.dylib (150.20.3) <243FADE1-255A-3B78-8033-F336CD64B817> /usr/lib/system/libsystem_notify.dylib\n    0x7fff93a37000 -     0x7fff93d99f3f  libobjc.A.dylib (680) <9F45830D-F1D5-3CDF-9461-1A5477ED7D1E> /usr/lib/libobjc.A.dylib\n    0x7fff93d9a000 -     0x7fff93d9bfff  libsystem_blocks.dylib (65) <49D42329-7DE9-3413-92C3-A473A7E9CF35> /usr/lib/system/libsystem_blocks.dylib\n    0x7fff93d9c000 -     0x7fff942f3fff  com.apple.MediaToolbox (1.0 - 1731.15.33) <16374746-DF5E-3103-994B-74CF151BD06A> /System/Library/Frameworks/MediaToolbox.framework/Versions/A/MediaToolbox\n    0x7fff94483000 -     0x7fff944c5ff7  com.apple.Metal (55.2.8 - 55.2.8)  /System/Library/Frameworks/Metal.framework/Versions/A/Metal\n    0x7fff944fa000 -     0x7fff94506ff7  com.apple.speech.synthesis.framework (5.4.12 - 5.4.12)  /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/SpeechSynthesis.framework/Versions/A/SpeechSynthesis\n    0x7fff94511000 -     0x7fff94525fff  com.apple.CoreDuetDaemonProtocol (1.0 - 1) <8D8A190B-3C08-3624-8DC6-E9EBE22BC3BB> /System/Library/PrivateFrameworks/CoreDuetDaemonProtocol.framework/Versions/A/CoreDuetDaemonProtocol\n    0x7fff94526000 -     0x7fff94594ff7  com.apple.ApplicationServices.ATS (377 - 394.3) <0DDD3503-3D74-3CCA-BD25-7F19B03C2579> /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/ATS.framework/Versions/A/ATS\n    0x7fff94820000 -     0x7fff9483cfff  com.apple.GenerationalStorage (2.0 - 239)  /System/Library/PrivateFrameworks/GenerationalStorage.framework/Versions/A/GenerationalStorage\n    0x7fff9483d000 -     0x7fff9483efff  libDiagnosticMessagesClient.dylib (100) <4243B6B4-21E9-355B-9C5A-95A216233B96> /usr/lib/libDiagnosticMessagesClient.dylib\n    0x7fff94841000 -     0x7fff94841fff  com.apple.audio.units.AudioUnit (1.13 - 1.13)  /System/Library/Frameworks/AudioUnit.framework/Versions/A/AudioUnit\n    0x7fff94867000 -     0x7fff94881fff  com.apple.Kerberos (3.0 - 1) <836358DE-2731-3ACD-98E3-E5FA48917728> /System/Library/Frameworks/Kerberos.framework/Versions/A/Kerberos\n    0x7fff94882000 -     0x7fff94b18fff  libmecabra.dylib (696.4) <0A1574F0-3222-3856-A1C6-D8BE20DC4C48> /usr/lib/libmecabra.dylib\n    0x7fff94b19000 -     0x7fff94b1fff7  com.apple.speech.recognition.framework (5.1.1 - 5.1.1)  /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/SpeechRecognition.framework/Versions/A/SpeechRecognition\n    0x7fff94b20000 -     0x7fff94bf6ff7  com.apple.DiskImagesFramework (10.11.3 - 417.2) <25BBE20C-E92B-360F-A326-093B61CC7B5E> /System/Library/PrivateFrameworks/DiskImages.framework/Versions/A/DiskImages\n    0x7fff94bfc000 -     0x7fff94bfdffb  libSystem.B.dylib (1226.10.1) <5A4257EF-3145-3BB3-87A4-0D2404A9462D> /usr/lib/libSystem.B.dylib\n    0x7fff94c09000 -     0x7fff94c98ff7  libCoreStorage.dylib (517.20.1)  /usr/lib/libCoreStorage.dylib\n    0x7fff94c99000 -     0x7fff94e00fff  libBLAS.dylib (1159) <8C24B8BC-E7D9-386D-97C8-929728AFE10B> /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vecLib.framework/Versions/A/libBLAS.dylib\n    0x7fff9522a000 -     0x7fff9526fff7  com.apple.coreservices.SharedFileList (24.4 - 24.5) <72156BE7-0804-3F90-9AF9-14C4739430C2> /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/SharedFileList.framework/Versions/A/SharedFileList\n    0x7fff9560f000 -     0x7fff95614ff3  libunwind.dylib (35.3) <124E0F05-2350-3774-A32C-7F5BF38EDE73> /usr/lib/system/libunwind.dylib\n    0x7fff95655000 -     0x7fff95666fff  libcmph.dylib (6)  /usr/lib/libcmph.dylib\n    0x7fff95799000 -     0x7fff957d3fff  com.apple.QD (3.12 - 302) <3F36A108-C557-353A-A3F7-80DDCB82BB37> /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/QD.framework/Versions/A/QD\n    0x7fff957e1000 -     0x7fff95830ff7  com.apple.opencl (2.6.9 - 2.6.9) <27643341-DC6F-3C2F-8B8B-637061979BF3> /System/Library/Frameworks/OpenCL.framework/Versions/A/OpenCL\n    0x7fff95831000 -     0x7fff95834ff7  com.apple.AppleSystemInfo (3.1.5 - 3.1.5) <2B3F04CE-3C7D-3F51-99F3-C7847D1E4277> /System/Library/PrivateFrameworks/AppleSystemInfo.framework/Versions/A/AppleSystemInfo\n    0x7fff95863000 -     0x7fff95868ff7  libmacho.dylib (875.1)  /usr/lib/system/libmacho.dylib\n    0x7fff95869000 -     0x7fff958b5ff3  com.apple.HIServices (1.22 - 549) <14FB5BB6-8456-39F9-A694-8A1C12426880> /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/HIServices.framework/Versions/A/HIServices\n    0x7fff958f8000 -     0x7fff95903fff  libkxld.dylib (3248.30.4)  /usr/lib/system/libkxld.dylib\n    0x7fff95907000 -     0x7fff95932ffb  libarchive.2.dylib (33.20.2) <6C370A21-63FD-3A68-B4B3-5333F24B770B> /usr/lib/libarchive.2.dylib\n    0x7fff95946000 -     0x7fff9596bff7  libPng.dylib (1442)  /System/Library/Frameworks/ImageIO.framework/Versions/A/Resources/libPng.dylib\n    0x7fff959b2000 -     0x7fff95a64fff  com.apple.cloudkit.CloudKit (481.8 - 481.8)  /System/Library/Frameworks/CloudKit.framework/Versions/A/CloudKit\n    0x7fff95b1e000 -     0x7fff95b23fff  com.apple.MediaAccessibility (1.0 - 79)  /System/Library/Frameworks/MediaAccessibility.framework/Versions/A/MediaAccessibility\n    0x7fff95b24000 -     0x7fff95c13fff  libxml2.2.dylib (29.2)  /usr/lib/libxml2.2.dylib\n    0x7fff95c14000 -     0x7fff95d23fe7  libvDSP.dylib (563.4)  /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vecLib.framework/Versions/A/libvDSP.dylib\n    0x7fff95e2d000 -     0x7fff95e44fff  com.apple.ScriptingBridge (1.3.3 - 68) <4C81A32D-9B9F-354F-9857-E5BD0852290A> /System/Library/Frameworks/ScriptingBridge.framework/Versions/A/ScriptingBridge\n    0x7fff95e45000 -     0x7fff95e5efff  com.apple.openscripting (1.7.1 - 169.1)  /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/OpenScripting.framework/Versions/A/OpenScripting\n    0x7fff95e82000 -     0x7fff95eb2ff7  libsandbox.1.dylib (460.30.1)  /usr/lib/libsandbox.1.dylib\n    0x7fff95eb3000 -     0x7fff95f01fff  libcurl.4.dylib (90)  /usr/lib/libcurl.4.dylib\n    0x7fff95f02000 -     0x7fff96194ffb  com.apple.RawCamera.bundle (6.21 - 879) <4F0A10FB-7C96-31E8-9A70-E30F615B2565> /System/Library/CoreServices/RawCamera.bundle/Contents/MacOS/RawCamera\n    0x7fff96195000 -     0x7fff961abfff  com.apple.CoreMediaAuthoring (2.2 - 953)  /System/Library/PrivateFrameworks/CoreMediaAuthoring.framework/Versions/A/CoreMediaAuthoring\n    0x7fff96246000 -     0x7fff96265ff7  com.apple.framework.Apple80211 (11.0 - 1110.33)  /System/Library/PrivateFrameworks/Apple80211.framework/Versions/A/Apple80211\n    0x7fff96266000 -     0x7fff96266fff  com.apple.CoreServices (728.6 - 728.6) <1FC9300C-6D3D-330C-829C-C8F094BC38C6> /System/Library/Frameworks/CoreServices.framework/Versions/A/CoreServices\n    0x7fff962e2000 -     0x7fff965d7fff  com.apple.HIToolbox (2.1.1 - 807.2)  /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/HIToolbox.framework/Versions/A/HIToolbox\n    0x7fff965d8000 -     0x7fff9666efff  com.apple.ColorSync (4.9.0 - 4.9.0) <8BB8DF19-C24F-39F8-8B90-AD186D74587C> /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/ColorSync.framework/Versions/A/ColorSync\n    0x7fff9666f000 -     0x7fff96672fff  libspindump.dylib (197.1) <61EB1BFE-8600-3420-B18E-1541D3C15C5C> /usr/lib/libspindump.dylib\n    0x7fff96673000 -     0x7fff96a4bfef  com.apple.CoreAUC (214.0.0 - 214.0.0)  /System/Library/PrivateFrameworks/CoreAUC.framework/Versions/A/CoreAUC\n    0x7fff96c93000 -     0x7fff96cdeff7  com.apple.CoreMediaIO (703.0 - 4791)  /System/Library/Frameworks/CoreMediaIO.framework/Versions/A/CoreMediaIO\n    0x7fff96d07000 -     0x7fff96d0aff7  com.apple.help (1.3.3 - 46) <62056D9B-A87C-3E4D-B4E2-7E1CDB74CE68> /System/Library/Frameworks/Carbon.framework/Versions/A/Frameworks/Help.framework/Versions/A/Help\n    0x7fff96d0b000 -     0x7fff97139fff  com.apple.vision.FaceCore (3.3.1 - 3.3.1)  /System/Library/PrivateFrameworks/FaceCore.framework/Versions/A/FaceCore\n    0x7fff9716c000 -     0x7fff971b8fff  com.apple.print.framework.PrintCore (11.2 - 472.2) <449D8AB5-7891-32D0-9DC5-C90FE10DC0BF> /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/PrintCore.framework/Versions/A/PrintCore\n    0x7fff972a8000 -     0x7fff972dcff7  com.apple.CoreVideo (1.8 - 191.2) <88D903C8-E608-320E-8ACD-11E5B3003C18> /System/Library/Frameworks/CoreVideo.framework/Versions/A/CoreVideo\n    0x7fff972dd000 -     0x7fff9732eff7  com.apple.audio.CoreAudio (4.3.0 - 4.3.0)  /System/Library/Frameworks/CoreAudio.framework/Versions/A/CoreAudio\n    0x7fff9734d000 -     0x7fff9734dfff  com.apple.Accelerate.vecLib (3.10 - vecLib 3.10)  /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vecLib.framework/Versions/A/vecLib\n    0x7fff9737f000 -     0x7fff97396ff7  libsystem_asl.dylib (322.30.1) <9B500E4E-E462-321E-828E-5524DC984C1B> /usr/lib/system/libsystem_asl.dylib\n    0x7fff97578000 -     0x7fff9790dfdb  com.apple.vImage (8.0 - 8.0) <4BAC9B6F-7482-3580-8787-AB0A5B4D331B> /System/Library/Frameworks/Accelerate.framework/Versions/A/Frameworks/vImage.framework/Versions/A/vImage\n    0x7fff97a66000 -     0x7fff97b1dff7  com.apple.CoreDuet (1.0 - 1) <20BDA287-415A-385E-BCB5-934D165BDAA4> /System/Library/PrivateFrameworks/CoreDuet.framework/Versions/A/CoreDuet\n    0x7fff97bdf000 -     0x7fff97c53fff  com.apple.Heimdal (4.0 - 2.0) <009F223D-B89B-376B-94F5-6D982CBEF771> /System/Library/PrivateFrameworks/Heimdal.framework/Versions/A/Heimdal\n    0x7fff98589000 -     0x7fff988ddff7  com.apple.Foundation (6.9 - 1256.1) <66106CC9-9D97-3846-88D8-4BF6BB508296> /System/Library/Frameworks/Foundation.framework/Versions/C/Foundation\n    0x7fff988de000 -     0x7fff988faff7  libsystem_malloc.dylib (67) <9EECAB18-F025-34C4-8E32-7EFFA6720EFC> /usr/lib/system/libsystem_malloc.dylib\n    0x7fff9893f000 -     0x7fff989effff  com.apple.backup.framework (1.7.2 - 1.7.2)  /System/Library/PrivateFrameworks/Backup.framework/Versions/A/Backup\n    0x7fff989f0000 -     0x7fff989f0fff  libmetal_timestamp.dylib (600.0.43.5) <4BA5B935-F932-3863-9B31-EF0A7DEAF15C> /System/Library/PrivateFrameworks/GPUCompiler.framework/libmetal_timestamp.dylib\n    0x7fff989f1000 -     0x7fff989f3ff7  libsystem_configuration.dylib (802.20.7) <5FD79070-36CC-3D02-BEA7-BB5D2AE97D5D> /usr/lib/system/libsystem_configuration.dylib\n    0x7fff989f4000 -     0x7fff98a49ff7  com.apple.AE (701 - 701)  /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/AE.framework/Versions/A/AE\n    0x7fff98a4a000 -     0x7fff98a54fff  com.apple.NetAuth (6.0 - 6.0) <19E44307-6F9F-3DEC-8C1A-4685BC252A35> /System/Library/PrivateFrameworks/NetAuth.framework/Versions/A/NetAuth\n    0x7fff98a55000 -     0x7fff98a79fff  com.apple.quartzfilters (1.10.0 - 1.10.0) <58FAFE0C-A2D8-3746-AC8F-BF553A7CDED7> /System/Library/Frameworks/Quartz.framework/Versions/A/Frameworks/QuartzFilters.framework/Versions/A/QuartzFilters\n    0x7fff98a7a000 -     0x7fff98db7ff3  com.apple.WebKit (11601 - 11601.4.4)  /System/Library/Frameworks/WebKit.framework/Versions/A/WebKit\n    0x7fff98ddf000 -     0x7fff98e16ff7  com.apple.LDAPFramework (2.4.28 - 194.5) <79D981F2-F70C-3E47-B124-DC0C90D45563> /System/Library/Frameworks/LDAP.framework/Versions/A/LDAP\n    0x7fff995d3000 -     0x7fff995f7fff  com.apple.MultitouchSupport.framework (304.10 - 304.10) <1E0206D9-34AD-3810-8ED0-29DC450D1485> /System/Library/PrivateFrameworks/MultitouchSupport.framework/Versions/A/MultitouchSupport\n    0x7fff995f8000 -     0x7fff995fbffb  libScreenReader.dylib (425.102)  /usr/lib/libScreenReader.dylib\n    0x7fff996ac000 -     0x7fff996f2ff7  libauto.dylib (186) <999E610F-41FC-32A3-ADCA-5EC049B65DFB> /usr/lib/libauto.dylib\n    0x7fff996f3000 -     0x7fff9981fff7  com.apple.CoreText (352.0 - 494.10) <9FD834B1-FF8E-3EB0-BB11-6E9120969086> /System/Library/Frameworks/CoreText.framework/Versions/A/CoreText\n    0x7fff999cc000 -     0x7fff99a6cff7  com.apple.Metadata (10.7.0 - 972.16) <3E42A570-BE32-396D-96E1-01B4A778D991> /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/Metadata.framework/Versions/A/Metadata\n    0x7fff99a7d000 -     0x7fff99a9aff7  com.apple.AppleVPAFramework (2.1.2 - 2.1.2) <2B459E1F-0563-30B2-A04D-CF1793426B66> /System/Library/PrivateFrameworks/AppleVPA.framework/Versions/A/AppleVPA\n    0x7fff99a9b000 -     0x7fff99b12fe7  libcorecrypto.dylib (335.20.1)  /usr/lib/system/libcorecrypto.dylib\n    0x7fff99b23000 -     0x7fff99b25fff  libCVMSPluginSupport.dylib (12.0.40.6)  /System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/libCVMSPluginSupport.dylib\n    0x7fff99c29000 -     0x7fff99c2bfff  libCGXType.A.dylib (948)  /System/Library/Frameworks/CoreGraphics.framework/Versions/A/Resources/libCGXType.A.dylib\n    0x7fff99ceb000 -     0x7fff99cedfff  com.apple.CoreDuetDebugLogging (1.0 - 1)  /System/Library/PrivateFrameworks/CoreDuetDebugLogging.framework/Versions/A/CoreDuetDebugLogging\n    0x7fff99d4d000 -     0x7fff99dbcfff  com.apple.SearchKit (1.4.0 - 1.4.0)  /System/Library/Frameworks/CoreServices.framework/Versions/A/Frameworks/SearchKit.framework/Versions/A/SearchKit\n    0x7fff99e42000 -     0x7fff99ea3ff7  libsystem_network.dylib (583.20.10) <865FE79A-A22D-3733-A14F-FC7B37F3AECD> /usr/lib/system/libsystem_network.dylib\n    0x7fff99efd000 -     0x7fff99f16fff  com.apple.CFOpenDirectory (10.11 - 194)  /System/Library/Frameworks/OpenDirectory.framework/Versions/A/Frameworks/CFOpenDirectory.framework/Versions/A/CFOpenDirectory\n    0x7fff99f31000 -     0x7fff99f84ff7  libc++.1.dylib (120.1) <8FC3D139-8055-3498-9AC5-6467CB7F4D14> /usr/lib/libc++.1.dylib\n    0x7fff99f85000 -     0x7fff99fbdfff  com.apple.RemoteViewServices (2.0 - 99) <596153FD-3CB9-3FED-9D63-1B73B01AC6DB> /System/Library/PrivateFrameworks/RemoteViewServices.framework/Versions/A/RemoteViewServices\n    0x7fff99fbe000 -     0x7fff9a4e0fff  com.apple.QuartzComposer (5.1 - 334) <0A407B05-5CF5-3084-93EF-F4619BDEEF8B> /System/Library/Frameworks/Quartz.framework/Versions/A/Frameworks/QuartzComposer.framework/Versions/A/QuartzComposer\n    0x7fff9a4e1000 -     0x7fff9a63cffb  com.apple.WebKitLegacy (11601 - 11601.4.4) <5CC2787B-FDD4-3025-BD63-4021F97787A8> /System/Library/Frameworks/WebKit.framework/Versions/A/Frameworks/WebKitLegacy.framework/Versions/A/WebKitLegacy\nExternal Modification Summary:\n  Calls made by other processes targeting this process:\n    task_for_pid: 2\n    thread_create: 0\n    thread_set_state: 0\n  Calls made by this process:\n    task_for_pid: 0\n    thread_create: 0\n    thread_set_state: 0\n  Calls made by all processes on this machine:\n    task_for_pid: 18965209\n    thread_create: 0\n    thread_set_state: 0\nVM Region Summary:\nReadOnly portion of Libraries: Total=291.6M resident=0K(0%) swapped_out_or_unallocated=291.6M(100%)\nWritable regions: Total=132.4M written=0K(0%) resident=0K(0%) swapped_out=0K(0%) unallocated=132.4M(100%)\n                            VIRTUAL   REGION\n\nREGION TYPE                        SIZE    COUNT (non-coalesced) \n===========                     =======  ======= \nAccelerate.framework               128K        2 \nActivity Tracing                  2048K        2 \nCG backing stores                 8236K        7 \nCG image                            88K       10 \nCG shared images                   592K       13 \nCoreAnimation                     7568K       17 \nCoreUI image data                 2488K       11 \nCoreUI image file                  192K        6 \nDispatch continuations            8192K        2 \nFoundation                          32K        3 \nImage IO                            64K        2 \nKernel Alloc Once                    8K        3 \nMALLOC                            74.0M       35 \nMALLOC guard page                   32K        7 \nMemory Tag 242                      12K        2 \nMemory Tag 251                      24K        2 \nOpenCL                               8K        2 \nProcess Corpse Info               2048K        2 \nSTACK GUARD                       56.0M       11 \nStack                             12.1M       13 \nVM_ALLOCATE                         80K       10 \n__DATA                            27.8M      264 \n__IMAGE                            528K        2 \n__LINKEDIT                        94.2M       13 \n__TEXT                           197.4M      268 \n__UNICODE                          552K        2 \nmapped file                      148.6M       27 \nshared memory                     16.3M       10 \n===========                     =======  ======= \nTOTAL                            658.7M      720 \n. When I press the Iterm crashes so I can't see anything else. The version I have is Build 3.0.15\nIt seems that for MacOSX there is no openpgp available. I have already installed gpg (GnuPG/MacGPG2) 2.0.30 with libgcrypt 1.7.0\nThere is no way to launch the 'initial-setup of the kube-solo VM' manually and see what is going on?. So? What do you recommend? should I pass some parameter to that shell script in order to try it? or may be I should reinstall `kube-solo` + corectl? I think I did it, at least with the 1st using `brew uninstall` without success. Hi.\nI've installed both using `brew` with:\nbrew cask install corectl-app\nbrew cask install kube-solo\nAfter that, it seems that something is broken with corectl-app because no core-OS VM is running and also is impossible to download it -`iTerm2` crashes again :-(- \nAny recommendation?\n. I verified that the versions of the applications that brew are installed are exactly the same as you have released.\nI found that I get the same problem after trying to download the stable image from CoreOS application: (`/Applications/corectl.app/Contents/Resources/fetch_latest_iso_stable.command`):\nFetching lastest CoreOS stable channel ISO…\n[WARN] /Users/.../.coreos/images/stable/1298.6.0/coreos_production_pxe.vmlinuz missing - stable/1298.6.0 ignored\n---> downloading and verifying stable/1298.6.0\n[ERROR] openpgp: invalid data: user ID packet not followed by self-signature\nYou already have the latest CoreOS ISO.\nPlease press [Enter] to continue.\n```\nAgain the problem with openpgp. As I said before, I don't have openpgp installed I have already have GPGTools installed. oh! It seems that finally I found the problem!\nDon't know why but the command ./fetch_latest_iso_stable.command tries to download and verify the sum of the file was incorrect. May be a corrupted/broken file? Then the problem (I suppose) is that the verification of the downloaded file it was impossible and that's the reason of the failed message. Here you have it:\n```\nFetching lastest CoreOS stable channel ISO…\n[WARN] /Users/.../.coreos/images/stable/1298.6.0/coreos_production_pxe.vmlinuz missing - stable/1298.6.0 ignored\n---> downloading and verifying stable/1298.6.0\n33.47 MB / 33.47 MB [=====================================================================================================================================================] 100.00 %\n---> SHA512 hash for coreos_production_pxe.vmlinuz OK\n235.47 MB / 235.47 MB [===================================================================================================================================================] 100.00 %\n---> SHA512 hash for coreos_production_pxe_image.cpio.gz OK\n---> stable/1298.6.0 ready\nYou already have the latest CoreOS ISO.\nPlease press [Enter] to continue.\n```\nSo, I supose that happens exactly the same problem with the ./kube-solo-install.command. Because after removing those coreosfiles it seems that the command and the VM with the cluster booted up successfully. \nBtw, finally, what kind of variables (and path) do we need in order to use kubectl from any other shell? And docker? I asking this that because Iterm2 still crashes when I try to SSH to the machine.\nBest,. ",
    "verystrongjoe": "any update about this?. ",
    "mikedeltalima": "I think this is due to a corrupt data.img. Running qemu-img check ~/kube-solo/data.img -r all and then corectl panic k8solo-01 (if necessary) and then ksolo start fixed the issue for me.. ",
    "jlinoff": "As noted in the original issue, this is already fixed so this can be closed. Is it worth adding to the docs?. ",
    "bw2": "Thanks, that makes sense.  I missed this line in the kube-solo REAMDE\nPersistent sparse disk (QCow2) data.img will be created and mounted to /data\nI want these directories to persist across VM destroy / init cycles, so ended up putting them in my home dir  (eg. /Users/bw2/data/postgres)\n. I tried creating a password file using  htpasswd and adding --basic-auth-file=/Users/weisburd/kube-solo/cloud-init/basicauth\nbut then VM startup stalls on \nWaiting for etcd service to be ready on VM...\n. to this list\nhttps://github.com/TheNewNormal/kube-solo-osx/blob/master/src/cloud-init/user-data#L164-L179\nin /Users/weisburd/kube-solo/user-data. sorry I don't understand re. user-data. Which directory should the file be placed in on the VM?\nI just tried SSH'ing into the VM and looking for it, but I again only see it in ~/kube-solo/cloud-init/user-data:\n``\ncore@k8solo-01 ~ $ sudo find / -name \"user-data\"\nfind:/data/var/lib/rkt/pods/exited-garbage/c6c28aca-c35a-4548-9cf0-046aad05b5b5/stage1/rootfs/opt/stage2/flannel/rootfs/sys/kernel/debug/tracing': No such file or directory\n/Users/weisburd/kube-solo/cloud-init/user-data\nand same thing in the repo:\nhttps://github.com/TheNewNormal/kube-solo-osx/search?utf8=%E2%9C%93&q=+user-data&type=. Just tried setting\n # Start API server\n        ExecStart=/data/opt/bin/kube-apiserver \\\n          --client-ca-file=/data/kubernetes/ca.crt \\\n          --tls-cert-file=/data/kubernetes/server.cert \\\n          --tls-private-key-file=/data/kubernetes/server.key \\\n          --admission_control=NamespaceLifecycle,NamespaceAutoProvision,LimitRanger,ServiceAccount,ResourceQuota \\\n          --service_account_key_file=/data/kubernetes/server.key \\\n          --service_account_lookup=false \\\n          --allow_privileged=true \\\n          --insecure_bind_address=0.0.0.0 \\\n          --insecure_port=8080 \\\n          --kubelet_https=true \\\n          --secure_port=6443 \\\n          --service-cluster-ip-range=10.100.0.0/16 \\\n          --etcd_servers=http://127.0.0.1:2379 \\\n          --bind-address=0.0.0.0 \\\n          --logtostderr=true \\\n          --basic-auth=/opt/basicauth\nand\nwrite-files:\n - path: /opt/basicauth\n   permissions: '0644'\n   content: |\n     weisburd:$apr1$8ikh...hash\n - path: /opt/sbin/wupiao\n   permissions: '0755'\n   content: |\n      #!/bin/bash\n   ...\n``\nit once again hangs at theWaiting for etcd service to be ready on VM...step,\nbut if I take out the --basic-auth=/opt/basicauth` line it does boot. ",
    "b-rajesh": "thank you . ",
    "peng051410": "Seeting up message:\nSetting up Kubernetes Solo Cluster on macOS\nReading ssh key from /Users/tomyli/.ssh/id_rsa.pub\n/Users/tomyli/.ssh/id_rsa.pub found, updating configuration files ...\nSet CoreOS Release Channel:\n 1)  Alpha (may not always function properly)\n 2)  Beta\n 3)  Stable (recommended)\nSelect an option:\nSet CoreOS Release Channel:\n 1)  Alpha (may not always function properly)\n 2)  Beta\n 3)  Stable (recommended)\nSelect an option: 3\nPlease type VM's RAM size in GBs followed by [ENTER]:\nChanging VM's RAM to 3GB...\nPlease type Data disk size in GBs followed by [ENTER]:\nCreating 30GB sparse disk (QCow2)...\nCreated  Data disk\nStarting VM ...\n\nbooting k8solo-01 (1/1)\n[WARN] /Users/tomyli/.coreos/images/stable/1409.7.0/coreos_production_pxe.vmlinuz missing - stable/1409.7.0 ignored\n---> downloading and verifying stable/1409.7.0\n33.74 MB / 33.74 MB [=================================================================================================================] 100.00 %\n---> SHA512 hash for coreos_production_pxe.vmlinuz OK\n110.53 MB / 241.97 MB [================================================>---------------------------------------------------------] 45.68 % 19m45s. My network error！. \n",
    "rbizzell40": "Ok\nOn Oct 3, 2017 10:35 AM, \"Rimas Mocevicius\" notifications@github.com\nwrote:\n\nwe are going to cut a new https://github.com/TheNewNormal/corectl version\nhopefully tomorrow, to fix that issue\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/TheNewNormal/kube-solo-osx/issues/183#issuecomment-333861963,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/ARKiLm58Fnp0g6aw6C4v71E-X5_Gbthbks5sokYwgaJpZM4PsLcD\n.\n. \n",
    "mtrimmatdyn": "likewise, i too am having this issue. ",
    "jgmize": "This handles the edge case of the password containing an escape sequence such as \\n\n. "
}