{
    "Elftortom": "I'm also interrested by this, I would like to limit as much as possible the calls to google. So what I would like to do is to load google api only once the user enters text in the input\n. ",
    "RaymondBenc": "I would love this feature as well. Would be awesome to not have to load the Google API on each page.\nAwesome plugin BTW!\n. ",
    "jgentes": "+1 for 2015\n. Worked like a champ, thanks for the tip. Here's my version:\n```\nvar requestInvite = function() {\n      $(\"#location\").geocomplete();\n};\n$.getScript(\"https://maps.googleapis.com/maps/api/js?sensor=false&libraries=places&callback=requestInvite\");\n```\n. ",
    "Eoler": "Async loading GMaps API with callback is a simple one-liner (excuse the embedded PHP):\nhttps://github.com/Eoler/mmGoogleMap/blob/master/googlemap.php#L45\n. ",
    "breerly": "It looks like you could append &language=en-US to the places api like so\nhttp://maps.googleapis.com/maps/api/js?libraries=places&sensor=false&language=en-US\n. ",
    "aemkei": "Right, you have to the language parameter to the script that refers to the Google Maps API. Otherwise it will use the user's locale.\n. Thanks for this addition!\n. Unfortunately it is not possible to disable or destroy the Places Autocomplete after it was created:\nhttps://developers.google.com/maps/documentation/javascript/places#places_autocomplete\n. When you use the location option, the plugin will try to find an address for that location. If it is a string \"lat,lng\" then the geocoder will do a reverse lookup which might result in slightly different location.\nTry to use mapOptions.center if you just want to set the original position:\njs\nmapOptions: {\n    center: setloc\n}\n. Okay, my fault: In the docs it says, that you can pass a LatLng value to the location.\nI'll have to update the plugin to not reverse geocode the location:\nhttps://github.com/ubilabs/geocomplete/blob/master/jquery.geocomplete.js#L219\n. Share it via Twitter, G+ or your blog. And feel free to fork and improve it! \nThat would be the best way to keep this alive.\n. Can you provide some more details (eg. a link or sample code)?\n. Feel free to submit a pull request. I'll have a look if I can merge it into the main project.\n. @ficho: Is this example working for you?\nhttp://ubilabs.github.com/geocomplete/examples/form.html\n. This is currently not possible. Will add it to the enhancement list.\n. The geocoder always uses the clients locale. To override this, add the language parameter to the Google Maps API script.\nFor more informations rad this: https://developers.google.com/maps/documentation/javascript/basics#Localization\nExample:\nhtml\n<script src=\"http://maps.googleapis.com/maps/api/js?sensor=false&language=ja\" type=\"text/javascript\" ></script>\n. Hey Heera,\nyou can access all properties by passing the name as an argument:\njs\nvar marker = $(\"#my_input\").geocomplete(\"marker\");\nconsole.log(marker.getPosition()); // logs the current position.\n. Can you provide some more details like sample code or a detailled error message?\n. Hey MrFoto:\nYou can already do this by adding position to the markerOptions:\njs\nthis.geocomplete({\n  map: '#map', \n  location: defLocation, \n  markerOptions: {\n    draggable: true,\n    position: defLocation\n  }\n});\n. Hey Jose,\nyou have to manually call the find method to update the details:\njs\n$input.geocomplete(\"find\", lat + \",\" + lng);\n. See https://github.com/ubilabs/geocomplete/issues/27\n. You can add any options to the plugin map constructor via mapOptions. \nTo add new controls, simply pass the options like this.\njs\n$(\".yourtextbox\").geocomplete({\n    mapOptions: { \n      panControl: false,\n      zoomControl: false,\n      scaleControl: true \n    },\n    //...other args\n});\nMore infos here: https://developers.google.com/maps/documentation/javascript/controls#Adding_Controls_to_the_Map\n. Nice!\n. That should be no problem! \nEG:\njs\n$(\"#geocomplete\").geocomplete(\"find\", \"Juliusstraße 25, Hamburg\");\n. If Google has information about that place, it will return street number.\nTry http://ubilabs.github.com/geocomplete/examples/form.html with \"Fernsehturm Berlin\".\n. This is not possible for now.\nFeel free to tweak the code around Line 196:\nhttps://github.com/ubilabs/geocomplete/blob/master/jquery.geocomplete.js#L196\n. Thanks for the additions! And feel free to tweak the docs ;)\n. Just add the key to the script tag.\nSee: \n- Obtaining an API Key\n- Hello, World\n. To get the map, call:\njs\nmap = $(\"#geocomplete\").geocomplete(\"map\")\nmap.setZoom(3);\n. Did you try to set the language parameter in the Google Maps API script?\nhttps://developers.google.com/maps/documentation/javascript/basics#Language\n. This should be fixed with the latest commit.\n. Unfortunately we can't change this behaviour. The Google geocoder and the places search sometimes return different results.\n. Can you please provide an example? I'll close this until we have more information.\n. Firefox Android was not on the list of supported browsers. \nSee: https://developers.google.com/maps/faq#browsersupport\n. Thanks for the addition! \nI use UglifyJS to create the minified version. And can you please set autoselect: false as the default?\n. Okay, I've merged your fork and updated the build.sh script. We now have version version 1.5 thanks to you!\n. Thanks for the hint!\n. You can get and resize the map by calling\njs\nvar map = $(\"#geocomplete\").geocomplete(\"map\");\ngoogle.maps.event.trigger(map, \"resize\");\n. Thank you!\n. You can do this by setting the options on the map or maker.\njs\nvar map = $(\"#geocomplete\").geocomplete(\"map\");\n...\nmap.setOptions({ draggable: false });\nRead more here: https://developers.google.com/maps/documentation/javascript/reference#MapOptions\n. Google Maps changed the behaviour of maps without a center.\nMake sure to pass center as an option or call setCenter on the map.\n. Should be fixed with the latest update. See: http://ubilabs.github.io/geocomplete/examples/form.html\n. But that is the expected behaviour! If you just search for a location, the ZIP code is not returned, as it might contain multiple codes. When you pass a street, the ZIP is provided.\nI'm going to close this issue as we have no control over the results from the Google APIs.\n. Just pass a styles property to the mapOptions and icon to markerOptions.\nSee: https://github.com/ubilabs/geocomplete#list-of-options\n. See this example: http://ubilabs.github.io/geocomplete/examples/form.html\n. Perfect!\n. Closing this until we have more info.\n. This is currently not supported by the Google Places API.\n. Thank you!\n. Thanks, but unfortunately this isn't that easy, as the format of street addresses is not always street_number route. It is correct for US, but in Germany it would be the other way around.\n. This should only happen, when running the files from the local file system.\n. I can't see your CSS. Have you set an height for the map container?\n. This is currently not supported. The Google Places Autocomplete always displays the country at the end. \n. Please provide some more info:\n- Do you use post processors?\n- Can you check, if the HTML is correct?\n- Can you provide a link to the application? \n. I'll close this until we have more information.\n. Unfortunately this is not possible at the moment.\n. Thanks for the hints! I've updated all version numbers and created a new release 1.6.4.\n. @christopher-hopper Not sure what exactly you are missing here. Check this URLs for the releases:\nhttps://github.com/ubilabs/geocomplete/releases\n. Here you go: https://github.com/ubilabs/geocomplete/releases/latest – Hope that helps!\n. Looks like this is an issue with the Places Library: https://developers.google.com/maps/documentation/javascript/examples/places-autocomplete\n. @diazruy Ok! I was wondering why I didn't saw it here. Ping me, when you are done with that.\nThanks!\n. Thanks or this!\n. Not sure about google.maps.event.clearInstanceListeners because it might cause some side effects. But I'll merge it and hope it will work for you!\n. D'oh (x.x).\n. @smcclstocks Done\n. Looks great! Only one comment …\n. Looks great and I really appreciate your help!\n. That is the right question!\n. Thanks for the Meteor package! But tell me: What do you need here? Please provide some more info (eg. text to put into the Readme).\n. Sorry, but you can't use the Google Maps API without an internet connection.\n. This is because a ZIP  code must be unique to show up in the field. \nAs \"New York City\" has a wide range of zip codes, we can't show it.\n. Very hard, if not impossible.\n. Thanks: Simple, but nice!\n. I like it! Thanks for that...\n. If you also show a Google Map, it is OK to hide the logo:\nhttps://developers.google.com/places/webservice/policies#logo_requirements\nYou can hide it using CSS:\ncss\n.pac-container:after {  /* Disclaimer: not needed to show 'powered by Google' if also a Google Map is shown */\n    background-image: none !important;\n    height: 0px;\n}\n. This is a great suggestion! Thanks for the work!\n. Thanks for the hint! It is now available here:\nhttps://www.npmjs.com/package/geocomplete\n. Many thanks for the fix!\n. Thanks and sorry for the long wait!\n. Thanks! I've merged that manually into the docs.\n. Thank you for the quick fix!\n. It is not. But I've updated both versions to 1.7. \n. As of June 22, 2016 Google made the following changes to the Google Maps APIs Standard Plan:\n\nGoogle Maps no longer support keyless access (any request that doesn't include an API key). Future product updates are only available for requests made with an API key. API keys allow Google to contact developers when required and help us identify misbehaving implementations.\n\nhttp://googlegeodevelopers.blogspot.de/2016/06/building-for-scale-updates-to-google.html\n. Please register your key here: https://developers.google.com/maps/documentation/javascript/get-api-key\n. Please open the Crome Dev Tools console and check, what they are saying. Usually it should give you some advice how to fix it.\n. Done. Thanks for the hint!\n. Closing this, because of missing description.. This is not possible, because the Google Maps API limits this to 5 results.. This is true for \"text search requests\" but looks like, AutoComplete is not affected: https://developers.google.com/maps/documentation/javascript/3.exp/reference#AutocompleteOptions. You have to make sure, that the Google Maps API was loaded before the Geocomplete script. So, first wait until the Google Maps API is loaded and then include your this file. This is a pure JS plugin. We won't add server or DB support.. We can't do anything about that. This is how Google returns the data.. No, Google does not return a geoid.. This is a known bug on Google's site and should be fixed, soon: \nhttps://code.google.com/p/gmaps-api-issues/issues/detail?id=11253&q=setComponentRestrictions&colspec=ID%20Type%20Status%20Introduced%20Fixed%20Summary%20Stars%20ApiType%20Internal. Thank you for this addition!. Unfortunately the layout will depend on the country. In some places it is route number in other places number route or number, route. \n. ",
    "bkrajendra": "I guess this must be possible as there is internal function called \"destroy\".\n. ",
    "haydenpitout": "I've just tested the change.  The center of the map looks to be correctly set, but the marker is missing.\n. ",
    "cosmos21": "Simple fix - in initLocation (roughly line 231), change:\nif (latLng){\n        if (this.marker){ this.marker.setPosition(latLng); }\n      }\nto\nif (latLng){\n        if (this.map){ this.map.setCenter(latLng); }\n        if (this.marker){ this.marker.setPosition(latLng); }\n      }\n. ",
    "ofamosomario": "This issue are fixed ? Because when i try to pass [\"lat\",\"lng\"] my map didnt work.\nAnd when i put $(\"#geocomplete\").geocomplete(\"find\", local); , i can't zoom in and zoon out in my map. Someone help me :)\n. ",
    "pincheira": "Yes, could please put your code on http://jsbin.com to give it a look? Thanks\n. ",
    "rajibs": "i have a page where i have ref to another simple php page to load on facebox,\n[ a href=\"mypage.php\" rel=\"facebox\"]somepage[/a]\non mypage.php i have a textbox using geocomplete\nnow ,\nif i click on somepage and the page opens on facebox, this time the geocomplete dosent work but,\nif i directly go to mypage.php then the autocomplete on the textbox is working fine\n. ",
    "BitFlipp3r": "worked for me with \ntypes: ['(cities)']\n. ",
    "mhoban": "I second this request. I'd mess with it myself, but it seems as though once the keypress event has vired, '.pca-container' is no longer visible. \n. ",
    "onurmatik": "You can unbind the keypress event handler by $(\"#autocomplete_input\").unbind('keypress') when ever needed, for example after receiving the results, and the enter keypress will be enabled. \n. I am having a similar problem. Triggering the geocoder via javascript as in examples such as:\n$(\"#examples a\").click(function(){\n    $(\"input[name=geo_autocomplete]\").val($(this).text()).trigger(\"geocode\");\n    return false;\n  });\nreturns a limited result set compared to selecting the same location manually. For example, the \"name\" attribute is occasionally populated, when when triggered via js.\n. I did some experiments on this. When a location is selected from the autocomplete list, request sent to the geocoding service is a PlaceService.GetPlaceDetails request with the location's ID. This returns the full result set. When geocoding is triggered via javascript giving a place name, even if the name is an exact match to the full name, the generated request is a GeocodeService.Search request, which returns a subset of the GetPlaceDetails request.\nApparently, the autocomplete drop-down has the ID of the location and builds the request based on that. But, as far as I can see, that ID is not provided in the results of a GeocodeService.Search request. So, making a search query, getting the id, and making another getDetails query won't seem to work neither. \nAny suggestions?\n. to get all the details, GetPlaceDetails should be called with the place id. there may be a way to query the geocoding service with name and retrieve the ID and then make the GetPlaceDetails request, i am not sure. otherwise, with the place name, you would do a GeocodeService.Search request and get a limited result about a place. at the time i was working on that, the id was not provided. it is probably still the same. good luck, and i'd appreciate if you share any updates on that. \n. I think this is very similar to #29.\n. $(\"#selector\").geocomplete('map') does the trick. thanks.\n. ",
    "kyoukhana": "send me the code \nSent from my iPhone\nOn Oct 3, 2012, at 11:04 AM, ficho notifications@github.com wrote:\n\nHi All,\nI don't know what I get wrong with the plug-in, but either through the examples or by running the code locally I feel I only get geocoding results.\nTo verifiy each time, I try to add the name of a bar in NYC which I know only gets returned by the places api: \"White Star, Essex Street\".\nIs there some type configuration option I'm not enabling or something I am missing?\nThanks a lot in advance!\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "cherifzouein": "Well it's the code from the examples.\nIn the simple one is the Places API => geocoder fallback supposed to be the normal behaviour?\n(Im a newb, just a heads up)\n. !!\nYes it does.\nAm I plain stupid or is there something different in there?\nFeel free to answer the former\n. Ok I just checked against the simple and multiple results examples for the following input: \"White Star Bar\".\nOnly the forms example provides a result.\nWhat differs between the 3?\n. ",
    "karan": "Any updates on this? Would be really useful\n. ",
    "hivearts": "Any updates?. Hello, does somebody found solution for this problem?\nI also need to use multiple markers on the geocomplete map.\nThanks. ",
    "mettini": "+1. ",
    "hoangnguyenasnet": "+1. ",
    "MichaelGregory": "Take a look at the draggable demo and how the geocode:dragged event is handled\nhttp://ubilabs.github.com/geocomplete/examples/draggable.html\n. ",
    "heera": "I saw the marker is reset is working ($(\"#geocomplete\").geocomplete(\"resetMarker\")) but how can I get the control over that marker so I can remove it or add a click event listener like, \nmarker=get_current_marker(); // a pseuido code\nmarker.addeentListener(...)\nThanks!\n. Hi  aemkei !\nThanks a lot. That's what I exactly looking for.\n. ",
    "sornapudisuresh": "Please see the link below for reference,\nhttp://luleabgr.varaminnessidor.se/memorial_page_service_info.php?memorial_page_id=380987&cat=ServiceInfo&sign=b6135a19a5447a74c865ae9930844757\n. ",
    "ggeiger": "I am experiencing the same issue using \n$(\"#geocomplete\").geocomplete({\n  details: \"form\",\n  types: [\"geocode\", \"establishment\"]\n});\nand\ninput name=\"street_address\" type=\"text\"\nThe street_address input field does not autocomplete.\n. Slightly updated the code from DreifGenov: each time he uses 'street_addr', I changed to 'street_address'. \nThis is working for me now, when using details: \"form\"\n. ",
    "JKoelman": "Just want to confirm that this solution works.  \nDid implement the script in a Joomla component and ran into the problem of not returning results. Luckily this issue was mentioned over here so now it works.\n. ",
    "mike-roberts": "So depending on the address, [0] can be the name of a business/building or an actual street address. I'm pretty sure an easier solution for this would be changing\njavascript\n      // Add infos about the address and geometry.\n      $.extend(data, {\n        formatted_address: result.formatted_address,\n        street_addr: result.formatted_address.split(',')[0],\n        location_type: geometry.location_type || \"PLACES\",\nto \njavascript\n      // Add infos about the address and geometry.\n      $.extend(data, {\n        formatted_address: result.formatted_address,\n        street_addr: data.street_number + ' ' + data.route,\n        location_type: geometry.location_type || \"PLACES\",\n. @aprice42 you're exactly right about concatenating the street number and route. I commented on #25 about how I did it.\n. ",
    "nlsrchtr": "Why is this issue closed, if the solution is not present? Even in the documentation it says, that there should be a \"street_address\" attribute. But I'm still missing this in the latest version.\nWould be great to see a fix like the above included.\n. @aprice42 Take a look at https://github.com/ubilabs/geocomplete/issues/25, helped me.\n. ",
    "morgler": "I might be mistaken, but you should be able to find the street_address in the address_components array (as documented in the Google Places API).\naddress_components = {}\nfor c in place.address_components\n  address_components[c.types[0]] = c.long_name\naddress_components.street_address\n. If you want to populate your page (form fields and map) with the data belonging to a place already stored from a previous geocomplete, you could do use the Google Places reference and do something like this (sorry, it's coffeescript):\n```\nSet the location from a Google Places reference\nupdateLocationFromReference: (map, reference) ->\n  service = new google.maps.places.PlacesService(map) \n  service.getDetails({reference: reference}, (place, status) =>\n    if (status == google.maps.places.PlacesServiceStatus.OK)\n      # Set your fields here …\n      @geocomplete_field.geocomplete('update', place)\n  )\n```\nThis code basically fetches the places details for your reference from google and updates geocomplete with it.\n. I have the same problem. If I select \"berghain\" or any \"Café\", the form is not populated. However, it still works for most regular businesses. I can also replicate this on the official example.\n. ",
    "EFXPROMedia": "Tread posted on Stackoverflow keep an eye for updates maybe a fix will come.\nhttp://stackoverflow.com/questions/28458933/jquery-geocomplete-street-address-not-working\n. DreifGenov answered correctly after some lessons of JS I could fix this easily hurray!\n. ",
    "archonic": "This is still an issue. Says right in the readme that street_address is returned.\nLooks like this pull request fixes it:\nhttps://github.com/ubilabs/geocomplete/pull/69\nAlso looks like that's 2 years old, quite behind and has conflicts. Still it's a decent approach to the lack of street_address. I was going to fork 2 repos (this and a rails gem wrapper) and get it all working but I found it a lot easier to just bind to the result and concat.\n$('#geocomplete').geocomplete\n    details: '#geo_details'\n    detailsAttribute: 'data-geo'\n    types: [\n      'geocode'\n      'establishment'\n    ]\n  .bind \"geocode:result\", (e, r) ->\n    $('[data-geo=street_address]').val r['address_components'][0]['short_name'] + ' ' + r['address_components'][1]['short_name']\n. ",
    "kenjione": "I think this solution would be a little better because here I consider the case when street address could be blank.\n``` coffeescript\n...\n.bind(\"geocode:result\", (event, result) ->\n    street = try result.adr_address.match(/([^<]+)<\\/span>/)[1] catch e then ''\n    $(\"[data-geo=street_address]\").val(street)\n  )\n```\nOr improvement of @archonic's solution \n``` coffeescript\n.on(\"geocode:result\", (event, result) ->\n    route = ''\n    street_number = ''\nresult.address_components.map (e, index) ->\n  route = e.long_name if e.types[0] == 'route'\n  street_number = e.long_name if e.types[0] == 'street_number'\n\n$(\"#{details_selector} [data-geo=street_address]\").val(\"#{route} #{street_number}\")\n\n)\n```\n. ",
    "mrfoto": "Ah, OK, tnx. Then it's just weird that if you call it with string it happens with marker and if you call it with anything else it doesn't.\n. ",
    "fieldly": "Great. This sets the map to lowest zoom. Is there a way to set it to zoom 14?\n. Is it possible to get updated address data in a simple way on this event?\n. ",
    "Joseanmola": "I have dowlonaded a version wich does it, but it does´nt work on IE :(\n. ",
    "poopsplat": "@omat - thanks for figuring this out. I've been trying desperately to parse the extra place details that are retained only with the GetPlaceDetails request (specifically formatted_phone_number). Are you saying that these details are not retrieved only when trigger the geocoder via javascript? I can't seem to figure out how or where they are retrieved either way.\n. Having a similar issue, but not in a bootstrap modal, but in a widget that expands and contracts on click before I added Geocomplete this code was working fine:\n$('#widget--resize').on('click', function () {\n        setTimeout(function () {\n          google.maps.event.trigger(map, 'resize')\n        }, 100);\n      });\nAnyone know how I can make the same thing happen with Geocomplete?\n. Placing this inside the .bind(\"geocode:multiple\", function (event, results) { worked for me:\nif (results.length >= 1){\n            $('#placeResultList').empty()\n          }\n$('#placeResultList:gt(4)').hide().last(\n            $('#moreButton').click(function () {\n              $('#placeResultLIst:not(:visible):lt(4)').fadeIn();\n            })\n          );\n. ",
    "martingg88": "The following solution may help. you can refer to this link for further details.\nhttp://stackoverflow.com/questions/27865483/google-maps-api-autocomplete-search-without-selecting-from-dropdown\nvar _this = this.input;\n                        google.maps.event.addDomListener(_this,'keydown',function(e){\n                            console.log(e.triggered)\n                            if(e.keyCode===13 && !e.triggered){\n                                google.maps.event.trigger(_this,'keydown',{keyCode:40})\n                                google.maps.event.trigger(_this,'keydown',{keyCode:13,triggered:true})\n                            }\n                        });\n. ",
    "sammyfa": "@ajarti:\nThis changes it to France:\nvar autocomplete = $(\".yourtextbox\").geocomplete(\"autocomplete\");\nautocomplete.setComponentRestrictions({ country: \"fr\" });\n. @andyscott12 Don't understand your question 1, but for question 2:\n$(\".yourtextbox\").geocomplete({\n    mapOptions: { scrollwheel: true },\n    //...other args\n});\n. ",
    "ajarti": "@sammyfa  You're the man ... Thank you so much :)\n. ",
    "Gitesh502": "Same problem with me \nadded $(\"#geocomplete\").geocomplete(\"find\", latLng.lat() + \",\" + latLng.lng());  line for updating the map after dragging the marker, but map is  zoom level is getting reset\n.  $(\"#geocomplete\").bind(\"geocode:dragged\", function (event, latLng)\n            {\n```\n            var latlng = new google.maps.LatLng(latLng.lat(), latLng.lng());\n            var geocoder = geocoder = new google.maps.Geocoder();\n            geocoder.geocode({ 'latLng': latlng }, function (results, status)\n            {\n                if (status == google.maps.GeocoderStatus.OK)\n                {\n                if (results[0])\n                {\n\n                    $(\"#geocomplete\").val(results[0].formatted_address)\n                    console.log(results[0])\n                    $.each(results[0].address_components, function (index, data)\n                    {\n                        if (data.types[0] == \"country\")\n                        {\n                            $(\"#country\").val(data.long_name)\n                            console.log(\"Country =\" + data.long_name)\n                        }\n                        if (data.types[0] == \"administrative_area_level_1\")\n                        {\n                            $(\"#administrative_area_level_1\").val(data.long_name)\n                            console.log(\"State =\" + data.long_name)\n                        }\n                        if (data.types[0] == \"administrative_area_level_2\")\n                        {\n                            $(\"#administrative_area_level_2\").val(data.long_name)\n                            console.log(\"District=\" + data.long_name)\n                        }\n                        if (data.types[0] == \"administrative_area_level_3\")\n                        {\n                            $(\"#administrative_area_level_3\").val(data.long_name)\n                            console.log(\"City=\" + data.long_name)\n                        }\n                        if (data.types[0] == \"country\")\n                        {\n                            console.log(\"Country=\" + data.long_name)\n                        }\n                        if (data.types[0] == \"postal_code\")\n                        {\n                            $(\"#postal_code\").val(data.long_name)\n                            console.log(\"postal_code=\" + data.long_name)\n                        }\n                        //alert(\"Location: \" + results[1].formatted_address);\n                    });\n                }\n            }\n        });\n\n```\n. When ever marker is dragged,map is getting reset and marker is moving to different city ..\n. ",
    "andyscott12": "Awesome thanks!\n. ",
    "tusharvikky": "+1\n. ",
    "xarliebrown": "+1\n. ",
    "EgbertMac": "i would like to know that! also. ",
    "alexissusset": "+1 on this issue, experiencing the same behavior\n. ",
    "Malgin": "Glad you like it :) I guess I should have updated readme file...\n. ",
    "alphydan": "I'm getting the same problem.  I'm using a modified version of the draggable example, which updates the formatted address as I drag the pin.  But the original zoom is insensitive to my mapOptions.zoom and reverts back to 14 when I search for a new address.  Any tips?\nHere's my code https://gist.github.com/alphydan/5478470\n. ",
    "hanneshapke": "Hi Ubilabs team, \nI experience the same problem. mapOptions are ignored when it is loaded with an address given.\nCan you please shed some light on this issue? Thank you!\n. ",
    "lokomass": "Hi, I have same problem. Please, can you fix it ?\n. ",
    "blake-simpson": "If you check the source code for that example you'll find that only the latitude and longitude values are meant to be updated on the \"dragged\" event. This is to demonstrate that a user may provide a correct address but the marker position may be slightly wrong initially, so they can drag to the correct position without invalidating the address.\n. ",
    "simplenotezy": "+1 I would like this aswell\n. Any updates on this?\n. Ping - I run the app in production and it is causing some serious issues.\nWould love if you could recommend a workaround or something.\n. ",
    "martinb07": "That's not what I mean.\nFor example, I search for the O2 Arena in Berlin and I want to populate the address field with street and number.\n. And how can I combine the route and street_number in one input field as a value?\n. ",
    "ghost": "It may be late.... but use the events\njavascript\n$(\"#geocomplete\")\n    .geocomplete()\n    .bind(\"geocode:result\", function(event, result){\n        var stno = result.address_components[0]['long_name'];\n        var stna = result.address_components[1]['long_name'];\n        $('#street').val(stno + ' ' + stna);\n    });\n. or even\njavascript\n$('#street').val(result.name);\n. Change that.... if the field is pre-populated - you will not get \"result.name\"\nand \"result.address_components[0]\" could be street number but it could be subpremise which means you need to check types array too.\ntry this way instead\njavascript\n        $(\"#geocomplete\")\n            .geocomplete()\n            .bind(\"geocode:result\", function(event, result){\n                var addressArray = result.address_components;\n                var street = \"\";\n                for (var j = 0; j < addressArray.length; j++){\n                    var typeName = addressArray[j].types[0];\n                    if (typeName == 'subpremise') {\n                        street += addressArray[j].long_name + '/';\n                    }\n                    if (typeName == 'street_number') {\n                        street += addressArray[j].long_name + ' ';\n                    }\n                    if (typeName == 'route') {\n                        street += addressArray[j].long_name;\n                    }\n                }\n                $('#street').val(street);\n            });\n. Thank you! I haven't had a chance to try this yet. Will do today!\n. i wasn't able to do this. wouldn't it immediately follow the geocomplete function?\n. > I guess for that you should use jquery in noconflict mode and also put geocomplete into noconflict mode inside the original code\nHello, I know this topic is already old, but I would like to know what would be the best way to adapt noConflict in the geocomplete.. I've solved it this way. Maybe something to consider for the next update.\n.pac-container {\n    z-index: 9999;\n}\n. ",
    "d1b1": "Getting the same issue with Bootstrap Modal Body. Looks like the zoom area is impacted by the pre-render size of the body. Any approaches would be great.\n. Leah,\nIts been a while since I worked on this. Looks like 'Change Location' on my\ncheese site has a bug. Fixing that tomorrow. I remember to remember that\nwhen I opened the modal with the geocomplete, I would see only part of a\ntile. Is the issue you are seeing?\nI will keep digging, but I think the issue I used was to place the modal\ncode below or outside the body of the bootstrap page.\nAlso I did some work a while back to make the geocomplete a backbone\nplugin. Now sure this would help. (\nhttps://github.com/d1b1/backbone.geocoder.plugin). There is a working\nexample. I actually need to get back to this soon.\nI will keep looking. I am hoping I did not need to hack the base\ngeocomplete code to get it working. The more I think about the issue, the\nmore of the issue comes back.\nNight,\nStephan\nThanks,\nStephan\nPhone: 617-953-7947\naim: StephanSmith93 | linkedin http://www.linkedin.com/in/stephansmithbc93\n | twitter https://twitter.com/d1b1ish | github https://github.com/d1b1\nOn Sun, Mar 9, 2014 at 3:26 PM, leahchandra notifications@github.comwrote:\n\n@d1b1 https://github.com/d1b1 Could I ask, do you remember where in the\ncode you added this to get it working successfully? I'm trying this to no\navail.\n\nReply to this email directly or view it on GitHubhttps://github.com/ubilabs/geocomplete/issues/45#issuecomment-37136060\n.\n. \n",
    "jeremyFreeAgent": ":+1: \n. ",
    "shouze": ":+1: \n. ",
    "lockeb": "Adding..\ngoogle.maps.event.trigger(this.map, \"resize\");\nto update: function (result) {\nFixed the issue in a Bootstrap modal (2.3.2)\n. ",
    "leahchandra": "@d1b1 Could I ask, do you remember where in the code you added this to get it working successfully? I'm trying this to no avail.\n. ",
    "ilyakatz": "I think the problem is with  google.maps.Geocoder, after it is used here, the input value in IE9 changes.\nhttps://github.com/ubilabs/geocomplete/blob/master/jquery.geocomplete.js#L165\nI haven't been able to figure out how to undo that behavior so far :(\n. ",
    "Paul75": "I have the same type of question. I want to give when I click to a choice the \"formatted_address\" intio the input...\nWhen I can di this ?\nI test :\n$(\"#adressetestGmap\").geocomplete()\n        .bind(\"geocode:result\", function(event, result){\n            console.log(result.formatted_address);\n            $(\"#adressetestGmap\").val(result.formatted_address);\n        });\nnot works....\nThanks\n. ",
    "faisall": "You can do it.All you need to do is after typing you should focus on the element by calling a function .focus().\n:smiley: \n. ",
    "MacWeber": "This behavior has nothing to do about this plugin. This different suggestion comes from google. Check it out how the result comes: http://maps.googleapis.com/maps/api/geocode/json?address=Россия,%20Новосибирская%20область,%20Новосибирск,%20улица%20Серебренниковская&sensor=true\n. I think the maintainer will merge a PR if someone sends a fix.\n. Closing this, as #95 fixes it.\n. ",
    "cpaulsen1812": "$(\"input[id='position[address]']\").blur(function() {\n$(this).val('some location');\n});\nalso not working\n. ",
    "climbak": "I am also running into this issue. Leda2610's solution works if you hit enter to select to first result instead of clicking on it. If you click on a result though, then the formatted_address from the drop down is what populates the search field.\nI did come up with a workaround though.\n$(\"#txtAddress1\").bind(\"geocode:result\", function(event, result)\n{ $(this).delay(someTime)\n    .queue(function(n){\n      n();\n      // set value...\n    }\n} );\n. I agree that different regions need different street address formats. Addresses are one of the largest headaches I've come across. I think it would be a good option for a user of this plugin to be able to fill the desired form field with the street address of their choice. I would propose to either offer multiple format types, such as street_number_route, route_street_number, etc., or give the option for multiple types in the data attribute on the input. For example, data-geo=\"street_number route\" which would fill with \"123 Main St\" or data-geo=\"route street_number\" which would fill with \"Main St 123\". It at least still gives the option for the user of the plugin to use the street address in the format they choose. I think the second option is cleaner. If either option is something you'd like to merge into the plugin, I'll see what I can do to get it done. \n. ",
    "khfayzullaev": "I found out how to solve the problem. Code example:\njavascript\n$(\"#selector\").geocomplete('map')\nThis returns the google.maps.Map - instance.\nExample:\njavascript\n...\nmap = $(\"#selector\").geocomplete('map');\nvar marker = new google.maps.Marker({\n  position: LatLng,\n  map: map\n});\n...\nPlease, close this issue!\n. ",
    "VitaliySoultan": "Just set max-width: none; to your map canvas:\nmap-canvas img {\nmax-width: none;\n}\n. ",
    "Anahkiasen": "-1 for that, there is a package manager for front-end libraries, Bower should be used instead.\n. ",
    "rkaartikeyan": "You can trigger the geocomplete after the ajax loaded the .geo-loc.\n. @simplenotezy did you found any solution for that? if yes please share with us.. ",
    "caschbre": "I'm experiencing the same issue.  I had originally tried using javascript to set the value of that field with the formatted address but that didn't solve it.\n. I'm running into the same thing.  I have three input fields each providing an geocompleted search for a specific column on the page.  Only the first instance works correct and after that using the enter key always populates with the value chosen from the first search.\nInterestingly... if in the first search the user uses the mouse to select an address, the enter key works on the next search... and then starts to break.\n. ",
    "Romz": "Subscribe\n. Find solution here : #18 \n. ",
    "Vitjk": "where is span's closing tag? \n. < script>\n    $(document).ready(function(){\n    $(\"#addInput\").click(function(){\n        $(\"#addInput\").after('');\n        $(\".geocomplete_input\").geocomplete({\n            details: \".form-data\",\n            map: '.map_place123'\n        });\n    });\n    });\n\nit work's\n. ",
    "tommedema": "+1, unfortunately I don't think this plugin is still being maintained\n. That's interesting, I'll have to play around with it. The problem I see at the moment is that I do not know if the user is going to enter the address in Chinese characters or in a western address. Therefore I cannot force the language parameter to either of them. However, by default it'll take the browser's language setting. I will test if this is appropriate enough by changing my language setting and then looking at the API's results.\nI'll close this issue for now and re-open it if your suggestion cannot be used as a viable solution.\n. I created this very ugly hack to workaround the issue, but it is very dirty.\n//FIX: do not change address input value on submit (see https://github.com/ubilabs/geocomplete/issues/78)\nfunction maintainGeoInput($geoInput) {\n    var lastVal = $geoInput.val();\n    $geoInput.keyup(function(ev) {\n        lastVal = ev.target.value;\n    })\n    .change(function(ev) {\n        lastVal = ev.target.value;\n    })\n    .bind(\"geocode:result\", function() {\n        var _this = this;\n        $(this).val(lastVal); //restore original input value\n        setTimeout(function() { //fix to restore autocomplete choices\n            lastVal = $(_this).val();\n        }, 0);\n    });\n}\nUsage:\n$(function() {\n     maintainGeoInput($(\"input#address\"));\n     $(input#address).geocomplete({...});\n}):\nIs there a better way to do this?\n. Any feedback would be highly appreciated.\n. +1\n. ",
    "ubu": "This would be an extremely useful feature.\nOur use-case: we're using the plugin inside a modal dialog to permit users to look up several types of locations. The first time the modal opens, everything works as expected (blank map canvas, empty geocomplete text field) but every subsequent load shows the map/marker from the previous lookup. Being able to call something like $('#selector').geocomplete('reset') in the modal's close() handler would be great.\nIn the interim, is there a way to achieve the same effect manually? I've tried nuking the child elements of the div element that I bind the map to but that stops the map from working altogether. Anyone have a suggestion?\n(note: apart from the above nice-to-have feature, this plugin has been a huge win for us. It has given us the ability to quickly add features that our users just adore So... thanks!)\n. ",
    "allinds": "I found a way to do this:\nUse the setComponentRestrictions() method of the autocomplete object. \n(see https://developers.google.com/maps/documentation/javascript/reference#AutocompleteOptions)\nLike so:\n$('#Country').change(function () {\n$(\"#Where\").geocomplete('autocomplete').setComponentRestrictions({country: $(\"#Country\").val()});\n});\nThis way you only change the country restrictions on the google maps autocomplete object.\nCheers\n//Alexander\n. ",
    "Jayaramki": "getting Uncaught TypeError: $(...).geocomplete(...).setComponentRestrictions is not a function when I tried setComponentRestrictions() method`. Any library need to make work this?\n. ",
    "cr3473": ":+1: \ni have the same problem.\nthe suggestion dropdown was being drawn behind my modal dialog (bootstrap).\nsolved with this:\ncss\n/* make the location suggest dropdown appear above dialog */\n.pac-container {\n    z-index: 2000 !important;\n}\nsimilar info here:\nhttp://stackoverflow.com/a/18559175/893859\n. ",
    "rnuernberg": ":+1: \ni have the same Problem with \"Hauptstraße, Freiburg im Breisgau\" - it returns \"Freiburg\" which is a different city. Using google maps will give me the correct results. \n. +1 I can confirm this - we have the exact same problem when blur is enabled.\n. ",
    "tomtomau": "Have you tried the following? Seems to work for me.\n$(selector).geocomplete({\n    ...\n    country: 'US',\n});\n. Maybe worth closing this one now that you found the solution :+1: \nhttp://stackoverflow.com/a/25755726\n. ",
    "rmeltonmi": "I have the same problem.   When I open the Chrome Dev tools the image resets itself. \n. The solution below resolved the Bootstrap tab issue.\nmapfind is ID for the button for updating the map from an address input box\n$(\"#mapfind\").click(function(){\n        $(\"input\").trigger(\"geocode\");\n        var map = $(\"#geocomplete\").geocomplete(\"map\");\n```\n    google.maps.event.trigger(map, 'resize');\n});\n```\n. ",
    "NicolasVanhecke": "Have you found a solution to this yet? I have a similar issue, my application has 1000+ users (which are not all as computer minded as me) and they just type a string in the field and don't even bother clicking the autocomplete google suggestions. How can I validate the users clicked AND the address is valid?. ",
    "tplessis": "this issue is still present in the last release. Any idea on how to improve that?\n. ",
    "gddabe": "bump again, any suggestion on this bug?\n. ",
    "di3sel": "It's not an issuue, you need to access values like this:\nvar lat = result.geometry.location.lat();\nvar lng = result.geometry.location.lng();\n. ",
    "daviestar": "+1\n. ",
    "maverickr77": "I'm attaching some screenshots to illustrate this. These were taken on Firefox (Android) on my Samsung Galaxy Tab 10.1\nWe are using geocomplete on our website (which has been great and extremely stable for the most part) but of late we've received several complaints from users about this issue on Firefox. I would greatly appreciate if the development team would take a look and comment on this issue.\nThanks in advance for your time and help.\nmaverickr77\n\n\n. Thanks for your feedback and the link. I wasn't aware that they didn't officially support it on FF Android so I logged a bug with Google. \nhttps://code.google.com/p/gmaps-api-issues/issues/detail?id=6965\nThey have accepted it but haven't provided a timeline on when they would fix this.\n. ",
    "vitaly": "Well, the previous behaviour was to always autoselect, so I think it should remain true by default. this option is to allow people to disable this default.\n. I tried using UlifyJS, but for some reason it produces a very different version for me, and a significantly larger one at that (7073 vs 5640 bytes). I think its safer for you to produce the minified version ;)\n. ",
    "negatif-negatif": "This work:\n$(\"input\").geocomplete({\n      componentRestrictions: { country: 'ro' }\n});\n. ",
    "alexjamesbrown": "Figured it out -\nMade a gist if anyone else runs into problems\nhttps://gist.github.com/alexjamesbrown/9118022#file-geocomplete-requirejs-html\n. @pcompassion - correctness of the order? what do you mean by that?\n. see https://developers.google.com/places/supported_types?csw=1#table2\ntable 3\nusing (cities) etc...\n. ",
    "pcompassion": "this seems to have a bug. you can't guarantee the correctness of the order \n. ",
    "cmwelsh": "I don't think there is an issue if geocomplete does not require Google Maps API to be loaded first... it just requires that you have the Google Maps API loaded before you call $.fn.geocomplete.\nHowever, just for safety, I load it like this...\nconfig.js:\ngeocomplete: {\n        deps: ['jquery', 'lib/gmaps']\n    },\nlib/gmaps.js:\n// convert Google Maps into an AMD module\ndefine([\n    'async!https://maps.googleapis.com/maps/api/js?libraries=places&sensor=false'\n], function () {\n    return window.google.maps;\n});\nmy app:\n```\nrequire('geocomplete');\nvar $ = require('jquery');\n$('#example').geocomplete();\n``\n. I've been seeing this too. Thanks for the tip.\n. This doesn't seem applicable to the current version - there's no difference between this hack and settingblur` to false. I definitely experience this issue though.\nIt's really frustrating because it grabs results from other countries and I want to limit to USA results...\n. This is what I came to suggest.\n. > But I'll merge it and hope it will work for you!\nIt looks like you closed this pull request without merging... :)\n. Try this:\n$location.geocomplete(options)\n        .bind('geocode:result', function (event, result) {\n            var addressComponents = result.address_components;\n. I use this CSS:\n.pac-container {\n    /* put Google geocomplete list on top of Bootstrap modal */\n    z-index: 9999;\n}\n. ",
    "mbariola": "Found it. setting types: ['establishment'] in the options.\n. ",
    "regis-leray": "https://github.com/ubilabs/geocomplete/issues/107\n. Sorry it was explain in the docs in the front page :( how to retreive the map\n. ",
    "newtonianb": "This can be reproduced through Google Chrome on desktop with iPhone Emulation setting.\nOk i found when this happens, it's when you click on the map before an address has been entered!\n. It happens here too\nhttp://ubilabs.github.io/geocomplete/examples/map.html\nOpen Chrome console and right click you will see the error arrive\n. ",
    "seanbfuller": "I am also seeing this. I was able to track it down to the this.find() call on line 195 (inside the bind of the blur event). I replaced that call with code from the placeChanged method (around line 456), that adds the selectFirstResult() return as a parameter for find. The end result looked like this:\nif (this.options.blur === true){\n        this.$input.blur($.proxy(function(){\n          //this.find();\n          var autoSelection = this.selectFirstResult();\n          this.find(autoSelection);\n        }, this));\n      }\nThis seems to be working for my purposes, but more testing may be needed.\n. ",
    "cuchac": "This solution works for me as well. Thanks!\n. To my knowledge there IS difference. If 'blur' is false, the 'blur' event is not bound on the input filed.\n. ",
    "sidazhou": "I've used the snippet from      seanbfuller commented on Apr 28, 2014\nand I've set \n              blur: true,\n              geocodeAfterResult: false,\n              restoreValueAfterBlur: true\nSo far it yields results I wanted, I've removed the find button, and I'm trying to restrict the input to always have a valid city. So when user blur, then auto-select the first selection.\n95 claims to fix this, but I get the problem still.\n. ",
    "bellierjonathan": "It was \"locality\" :dancer: \n. ",
    "crebuh": "try this \n.pac-container {\n    z-index: 2000 !important;\n    }\n. ",
    "packtloss": "I'll make an example. This combines/modifies the draggable example with the form example.\nHopefully this helps you/others. (Note the change to the draggable function).\nThe example drag function looks like this:\nhtml\n        $(\"#geocomplete\").bind(\"geocode:dragged\", function(event, latLng){\n          $(\"input[name=lat]\").val(latLng.lat());\n          $(\"input[name=lng]\").val(latLng.lng());\n          $(\"#reset\").show();\n        });\nYou need to reset the find in order to repoplate the form:\nhtml\n        $(\"#geocomplete\").bind(\"geocode:dragged\", function(event, latLng){\n            $(\"input\").geocomplete(\"find\", latLng.lat() + \",\" + latLng.lng());\n            $(\"#reset\").show();\n        });\nComplete html/js:\n``` html\n<!DOCTYPE html>\n\n\n$.geocomplete()\n\n\n\n      .map_canvas { float: left; }\n      form { width: 300px; float: left; }\n      fieldset { width: 320px; margin-top: 20px}\n      fieldset label { display: block; margin: 0.5em 0 0em; }\n      fieldset input { width: 95%; }\n    \n\n\n<div class=\"map_canvas\"></div>\n\n<form>\n  <input id=\"geocomplete\" type=\"text\" placeholder=\"Type in an address\" value=\"Empire State Bldg\" />\n  <input id=\"find\" type=\"button\" value=\"find\" />\n\n  <fieldset>\n    <h3>Address-Details</h3>\n      <a id=\"reset\" href=\"#\" style=\"display:none;\">Reset Marker</a>\n\n    <label>Name</label>\n    <input name=\"name\" type=\"text\" value=\"\">\n\n    <label>POI Name</label>\n    <input name=\"point_of_interest\" type=\"text\" value=\"\">\n\n    <label>Latitude</label>\n    <input name=\"lat\" type=\"text\" value=\"\">\n\n    <label>Longitude</label>\n    <input name=\"lng\" type=\"text\" value=\"\">\n\n    <label>Location</label>\n    <input name=\"location\" type=\"text\" value=\"\">\n\n    <label>Location Type</label>\n    <input name=\"location_type\" type=\"text\" value=\"\">\n\n    <label>Formatted Address</label>\n    <input name=\"formatted_address\" type=\"text\" value=\"\">\n\n    <label>Bounds</label>\n    <input name=\"bounds\" type=\"text\" value=\"\">\n\n    <label>Viewport</label>\n    <input name=\"viewport\" type=\"text\" value=\"\">\n\n    <label>Route</label>\n    <input name=\"route\" type=\"text\" value=\"\">\n\n    <label>Street Number</label>\n    <input name=\"street_number\" type=\"text\" value=\"\">\n\n    <label>Postal Code</label>\n    <input name=\"postal_code\" type=\"text\" value=\"\">\n\n    <label>Locality</label>\n    <input name=\"locality\" type=\"text\" value=\"\">\n\n    <label>Sub Locality</label>\n    <input name=\"sublocality\" type=\"text\" value=\"\">\n\n    <label>Country</label>\n    <input name=\"country\" type=\"text\" value=\"\">\n\n    <label>Country Code</label>\n    <input name=\"country_short\" type=\"text\" value=\"\">\n\n    <label>State</label>\n    <input name=\"administrative_area_level_1\" type=\"text\" value=\"\">\n\n    <label>ID</label>\n    <input name=\"id\" type=\"text\" value=\"\">\n\n    <label>Reference</label>\n    <input name=\"reference\" type=\"text\" value=\"\">\n\n    <label>URL</label>\n    <input name=\"url\" type=\"text\" value=\"\">\n\n    <label>Website</label>\n    <input name=\"website\" type=\"text\" value=\"\">\n  </fieldset>\n</form>\n<script src=\"http://maps.googleapis.com/maps/api/js?sensor=false&amp;libraries=places\"></script>\n<script src=\"http://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js\"></script>\n<script src=\"../jquery.geocomplete.js\"></script>\n\n<script>\n  $(function(){\n    $(\"#geocomplete\").geocomplete({\n      map: \".map_canvas\",\n      details: \"form\",\n      markerOptions: {\n        draggable: true\n      },\n      types: [\"geocode\", \"establishment\"],\n    });\n\n    $(\"#geocomplete\").bind(\"geocode:dragged\", function(event, latLng){\n        $(\"input\").geocomplete(\"find\", latLng.lat() + \",\" + latLng.lng());\n        $(\"#reset\").show();\n    });\n\n    $(\"#reset\").click(function(){\n      $(\"#geocomplete\").geocomplete(\"resetMarker\");\n      $(\"#reset\").hide();\n      return false;\n    });\n\n    $(\"#find\").click(function(){\n      $(\"#geocomplete\").trigger(\"geocode\");\n    });\n  });\n</script>\n\n\n\n```\n. ",
    "baptistedeleplace": "we're facing the same problem ...\n. @wideaparis did you manage to overcome this bug in any way ?\n. it's not :(\n\nand \n\n. but for ...\n\n... the postal code goes ok.\nweird\n. @anilastrio did you manage to overcome this bug ?\n. ",
    "xavicx": "Duplicated: https://github.com/ubilabs/geocomplete/issues/13\n. ",
    "tamanti": "I managed to solve the issue disabling blur on mousedown and arrow down/up if an item is selected.\nI passed blur=false as option and implemented a new function (here called blurFunction).\n$('#inputText') is the input text to apply the geocomplete plugin.\n```\nvar blurFunction = function(event, status){\n $('#inputText').trigger(\"geocode\");\n}\n$('#inputText').focus(function() {\n  $('#inputText').off(\"blur\"); // To prevent against multiple binding\n  $('#inputText').bind(\"blur\", blurFunction);\n});\n$('#inputText').keyup(function(e) {\n  if (e.keyCode == 40 || e.keyCode == 38) {  // Down arrow - up arrow\n    if ($(\".pac-item-selected\").html()) {\n      $('#inputText').off(\"blur\");\n    } else if ($(\".pac-item-selected\").html() == null) {\n      $('#inputText').bind(\"blur\", blurFunction);\n    }\n  }\n});\n// Remove event before clicking on menu\n$(\".pac-container\").live(\"mousedown\", function(event, status){\n  $('#inputText').off(\"blur\");\n  //$('#anotherInputText').off(\"blur\"); // if more than 1 geocode component in the same page\n});\n```\n. ",
    "ldanielduarte": "Hello tamanti,\nAlready tried your code and it works! It solves the multiple blur event. Thank you and gratz.\nBut, now I face another problem (maybe someone can help): I have to force the user to select a valid field.\nSometimes the user writes only half word and then change the focus (by clicking or tab);\nThen the find function is called and it searches for the closest word match;\nResult: it doesn't return any of the words presented on the DropDownList (the nearer spots).\n(in some cases it doesn't even return any word. Eg.: When we type \"Lisb\" for Lisbon and we loose focus).\nI created a function to return the first result of the list but this is not a clean way to do it!\nAfter the geocode function \"geocode: function(request){\" from the jquery.geocomplete.js script, I've added a custom function to search the first item of the list:\n```\n    // Get the selected result. If no result is selected on the list, then get the first result from the list.\n    selectFirstResult: function() {\n      var selected = '';\n      // Check if any result is selected.\n      if ($(\".pac-item-selected\")['0']) {\n        selected = '-selected';\n      }\n  // Get the first suggestion's text.\n  var $span1 = $(\".pac-container .pac-item\" + selected + \":first span:nth-child(2)\").text();\n  var $span2 = $(\".pac-container .pac-item\" + selected + \":first span:nth-child(3)\").text();\n\n  // Adds the additional information, if available.\n  var firstResult = $span1;\n  if ($span2) {\n    firstResult += \" - \" + $span2;\n  }\n\n  return firstResult;\n},\n\n```\nThen we can call the function with something like:\n$('#inputText').focus(function() {\n        $(this).unbind(\"blur\"); // To prevent against multiple binding\n        $(this).bind(\"blur\", function(){\n                setTimeout(function(){\n                        var autoSelection = $('#inputText').trigger(\"selectFirstResult\");\n                        $('#inputText').val( $('#inputText').trigger(\"find\",autoSelection) );\n                },300);\n        });\n    });\nNotice the \"setTimeout()\", it waits for the list to exists so that the selectFirstResult() function is able return a result.\nThis is not a clean way to do this... If someone have some idea of how this can be done, Please help!\nThank you in advance.\n. ",
    "adrienrn": "We've been experiencing the same.\nThank you for explaining what was happening.\n@ldanielduarte Your selectFirstResult seems to have been added to the project and the only fix we've done was the one explained here:\nhttps://github.com/ubilabs/geocomplete/issues/119 by seanbfuller.\n. ",
    "mike1011": "i got this working using setTimeout after the page loads\nsetTimeout('initialize()', 3000);\n. ",
    "wpscholar": "Your documentation states that 'street_address' is available, however, the parameter doesn't actually exist.  This patch ensures that it does exist and is properly set.\n. ",
    "LouisAmon": "Indeed, I'm having the same issue here.\nAs far as I know, Google Places Library returns the formatted_address when you bind it to an input field.\nGeocomplete, on the other hand, replaces the formatted_address with the locality !\nFor instance if I search \"12 rue de Rivoli\", the suggested result from Google Places (and expected result) is \"12 rue de Rivoli, Paris, France\" but instead the input is filled by Geocomplete and just indicates \"Paris\" (the latitude, longitude, etc. are correct though)\nI would be interested in seeing your code if you have a fix for this, otherwise waiting for a further patch.\n. ",
    "helmutgranda": "Samples work great on Mobile, maybe there is an issue on implementation?\n. ",
    "anilastrio": "@baptistedeleplace  I didnt solve the bug, but i used the entire \"formatted address\" and then split them into an array and extract the sublocality. Here is the code if you need it.: ... You might need to change the Add[3] to 2 or 4 depending on the country.\n// ADDRESS SPLITER & BIND TO MAP\n$(function () {\n    $(\"#geocomplete\").geocomplete().bind(\"geocode:result\", function (event) {\n        var GoogleAdd = $('#formatted_address').val();\n        var Add = GoogleAdd.split(', ').reverse();\n        $('[name=\"township\"]').val(Add[3]);\n    });\n});\n. ",
    "seemsindie": "Yeah, it was CSS, i am so sorry... Thank you so much.\n. ",
    "djedynak": "Hi martin, I posted the issue on stack overflow a few days ago. \nhttp://stackoverflow.com/questions/25517583/loading-javascript-file-from-rails-4-asset-pipeline\nLet me know if this provides sufficient information. Happy to provide more.\nThanks so much for your help. I'm really stuck on this one.\nGreat gem by the way!\nDave\nFrom: Martin Kleppe notifications@github.com\nDate: 29 August 2014 8:34:13 pm AEST\nTo: ubilabs/geocomplete geocomplete@noreply.github.com\nCc: djedynak david.jedynak@icloud.com\nSubject: Re: [geocomplete] geocomplete not working when uploaded to Heroku (i.e. production environment) (#151)\nReply-To: ubilabs/geocomplete reply@reply.github.com\nPlease provide some more info:\nDo you use post processors?\nCan you check, if the HTML is correct?\nCan you provide a link to the application?\n—\nReply to this email directly or view it on GitHub.\n. ",
    "kressly": "I guess for that you should use jquery in noconflict mode and also put geocomplete into noconflict mode inside the original code\n. Add your jquery file normally and then add the no conflict code. example\n<script  src=\"jquery-2.1.4.min.js\"></script>\n<script type=\"text/javascript\">\n$.noConflict();\n</script>\nAfter all that open the geocomplete file that you want to use and add the following code on top of it\njQuery( document ).ready(function( $ ) {\n// Code that uses jQuery's $ can follow here.\n///////////////////////////////////////////////////////////////////////////////\nAnd the following code at the bottom of it\n```\n///////////////////////////////////////////////////////////////////////////////\n});\n```. ",
    "bethge": "I believe Google does not directly supply the tools to make administrative_area_level_2 autocomplete-able. The same applies to country. I may be wrong, but it seems others have tried similar and failed:\nhttp://stackoverflow.com/questions/12918431/get-only-countries-to-autocomplete-from-google-maps-api\n. ",
    "epsa-dev": "<input hidden id=\"xyz\">\n. ",
    "christopher-hopper": "@aemkei , Thanks for addressing the inconsistent version numbers. \nQuestion\nAny idea on whether you could:\n\nprovide a canonical URL to the latest stable release verison for download?\n\nI'm happy to put this into a separate issue if you like. \nMy suggestion still stands, that you could just \"Publish\" the release tag on Github. That way it could be downloaded from a Latest Geocomplete Release URL and show up as a Latest Release link on the Geocomplete Releases page of Github. \nThere is an API so you can create Github releases from the command-line or a build script. Another benefit is that you can add some notes to the release, to let people know if there are any issues or changes they should be particularly aware of. You already do a changelog.txt, but the release notes can be a summary or just the most important note from the changelog. \nWhat we want to do, is create an easy way to grab the latest release of your library for use with Drupal. \nFurther reading on my suggested solution can be found at:\n- Creating releases \n- Linking to the latest release\n. @aemkei to demonstrate what I'm talking about, I've taken a fork of the library and created a published release. Compare the links below to see the difference. \nForked Version: \n- christopher-hopper Geocomplete Releases\n- Note this releases/latest path now takes me to the latest release for download. \nOriginal Version:\n- ubilabs Geocomplete Releases\n- Note this releases/latest path takes me to a list of every possible tag. \nWhy publish your releases? Let me try to explain.\nWhen you publish a release, it allows users of your library to use the URL path releases/latest to access the latest published release without knowing the exact version number. \nYour current releases list is just a list of tags. It doesn't indicate which is the current or latest release. I have to parse the list to work that out. Essentially the releases page offers no value. \nI wanted to code up a download and install of your library. I would like to know that if I request releases/latest I will get the latest release without having to parse a list of every tag, then pick the one that was either most recently pushed, or that has the highest version number, or whatever. \nThis is the primary reason behind the Github release page and is why Github provides both a releases page and a tags page. \nTake a look at:\n- Creating releases\n- Linking to the latest release\n. ",
    "jshimko": "Should be types: [\"cities\", \"addresses\"]\n. Where would the results data come from?\n. I don't know...  I suppose you could do something like a section at the end called \"3rd Party Install Options\" with a subheading for Meteor (like a lot of projects do for NPM, Bower, and Gems).  The install for Meteor is just meteor add jeremy:geocomplete and the Meteor specific usage docs are in my README.  \nAs an example, the guys that made the Materialize framework did something like that for Ruby/Meteor/Ember at the bottom of their getting started page.\nSo maybe...\nThird Party Install Options\nMeteor\nbash\nmeteor add jeremy:geocomplete\nMeteor-specific usage docs here.\n. I'm not sure this is an issue.  There are only so many results a given search can display at a time.  I also suspect your missing results could possibly have something to do with the IP based biasing that the Google Places API uses by default.\n\nNote: If you do not supply the location and radius, the API will attempt to detect the user's location from their IP address, and will bias the results to that location. If you would prefer to have no location bias, set the location to '0,0' and radius to '20000000' (20 thousand kilometers), to encompass the entire world.\n. \n",
    "aliz7": "[\"cities\", \"addresses\"] doesn't work!\ntried [\"(cities)\", \"address\"] and it didnt work.\n[\"(cities)\"] alone works and [\"address\"] alone works...\nbut when I combine them I get no results!\n. ",
    "KRav007": "read that this type are not possible\n. ",
    "diazruy": "@aemkei I had closed the PR because I realized I placed the trigger in the wrong place, or at least it needs a check for results.length === 0, otherwise it will trigger the event when exactly one result is found as well. I wanted to fix that first and test some more before reopening. Sorry for the confusion.\n. @aemkei I'm afraid you might have to revert the merge on master. It seems like the google.maps.places.Autocomplete doesn't trigger any events when there are no results. In order to achieve this, you would have to implement the dropdown yourself and use google.maps.places.PlacesService (which I presume is what Autocomplete uses under the hood), which will give access to the PlacesServiceStatus, which will indicate when there are no results.\nSorry for the incorrect \"fix\" I intially provided. My bad.\n. ",
    "satyapatidar": "I am too facing the same issue. \n. ",
    "ryanlntn": "I'm also having trouble getting this to work. Is rankBy compatible with the autocomplete API?\n. ",
    "tim-we": "Still not working on Windows Phone 8.1, please fix this!\nThanks @walbell for the long pressing tip!\n. Update: I did investigate this a bit and the problem is in the maps api, not in this jquery plugin\n(try this on your WP: https://developers.google.com/maps/documentation/javascript/examples/places-autocomplete )\n. ",
    "davidbernick": "Hi Lica,\nHow were you able to resolve this? I get pretty much the same issue...\n. ",
    "Ganasist": "Another option is I use geocomplete for my forms pages, but something like Gmaps4Rails for displaying more nuanced Gmaps on non-form pages....\n. ",
    "chuckers82": "I have no problem passing the value of the field onto the next form. The issue comes when it loads to the next form the field value is there but the Map is blank. You actually have to select the address field again in order for the map to pop up. \n. ",
    "Mike-Dax": "For those of you looking for an answer, just passlocation: 'PRESELECTED'into the geocomplete options. eg:\nthing.geocomplete({\n            map: '#map',\n            location: '123 sesame street',\n        });\n. ",
    "beloi": "```\n$('input')\n    .geocomplete()\n    .bind('geocode:result', function(event, result) {\n        var loc = result.geometry.location,\n            lat = loc.lat(),\n            lng = loc.lng();\n    console.log(lat, lng);\n});\n\n```\n. ",
    "RowanReid": "Perhaps it is an issue with the place name having non-ascii characters? Some kind of problem related to multibyte characters?\n. ",
    "smcclstocks": "+1\n. +1\n. would love to see this accepted. +1\n. +1\n. will you be bumping the version for bower folks\n. Thanks man.. appreciate it\n. ",
    "hinshun": "@aemkei\nI haven't encountered problems yet, but upon searching I found this related thread:\nhttps://github.com/dylanfprice/angular-gm/issues/4\nMay be worth changing those clearInstanceListeners to that implementation.\n. Thanks! I've made your suggested changes.\n. ",
    "zyphlar": "Will this be updated in the zip version? Glad to see the issue has been fixed.\n. ",
    "gandoulfe": "Did you find a solution ? I am getting the same issue. I don't know how to deal with it.\n. ",
    "voltagex": "Ah right, I misunderstood how it works.\nOn 27 Feb 2015 1:11 am, \"Martin Kleppe\" notifications@github.com wrote:\n\nThat is the right question!\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/ubilabs/geocomplete/issues/192#issuecomment-76183852.\n. \n",
    "xpluscal": "@tkbabu405 : Did you find a solution to this?\n. ",
    "aredridel": "You can dig out the actual instance of the class with the real implementation given an element el with $(el).data('plugin_geocomplete')\n. ",
    "NouranMahmoud": "Thanks, it works :thumbsup:\n. ",
    "flowcomm": "I am having the same issue here. Has there been any progress on this?\n. ",
    "matthlavacka": "👍 \n. 👍 Same here. What's the status on this?. ",
    "vladtco": "Add property types: [\"geocode\", \"establishment\"] to geocode constructor\n. ",
    "MehrasT": "Hey @tyshkev  Can you tell me how to add property types: [\"geocode\", \"establishment\"] to geocode constructor to Geocode constructor?\nyou input will be really helpfull for us\n. @tyshkev i added types to constructor but they Return ADdress now when selected\n. ",
    "yashwanthbabu": "@tyshkev Thanks. Works great \n. ",
    "jeroenvanhaeverbeke": "In most European countries one city has one postal code, so it is quite annoying that I can't grab this when only a city is entered.\n. ",
    "Arwany": "I would say it works with no issues, if it makes some issues, you should call the map resize.\nOne thing to remember: be sure that you are passing the correct map  object, getting that object is really tricky.\nThis is how I am making the call:\ngoogle.maps.event.trigger($('#geoComplete').geocomplete('map'), 'resize');\nI  am leaving this comment for others, even it came too late.\n. ",
    "rdetert": "Same with all modals I've tried. @cmwelsh suggestion did the trick. \n. ",
    "b2point0h": "Exact issue I just had. Thanks for the fix @cmwelsh, I would have never found that!\n. ",
    "selaias": "Thanks for the fix @cmwelsh\n. ",
    "UrSolutionsGuru": "Wow - thank you - that would have taken ages to figure out. ",
    "mbertheau": "@aemkei Sorry, I didn't include an updated .min.js in this PR.\n. ",
    "anandneema14": "Resolved\n. Thanks for your quick help.\n-Anand\n. It can be easily done.\nJust set Types: ['(regions)']\n-Anand\n. ",
    "robertodecurnex": "Really nice library!\nThose events are really useful for mobile (a lot of mobile/touch maps are\nbased on the map center/bounds rather than markers)\nRegards,\nRoberto Decurnex\nSkype: decurnex.roberto\nMobile: (+54 9 11) 61283955\nOn Fri, May 29, 2015 at 3:43 PM, Martin Kleppe notifications@github.com\nwrote:\n\nMerged #211 https://github.com/ubilabs/geocomplete/pull/211.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/ubilabs/geocomplete/pull/211#event-317513831.\n. \n",
    "EmirGluhbegovic": "I am using the following code:\n``` javascript\nif (GoogleMaps.loaded()) {\n            $(\"input\").geocomplete({ \n                details: \"form\",\n                map:\".map\",\n                mapOptions: {\n                    zoom: 12,\n                    zoomControl: true,\n                    mapTypeControlOptions: {\n                        mapTypeIds:\"ROADMAP\"\n                    },\n                    streetViewControl: false,\n                },\n                markerOptions: {\n                    draggable: false\n                }\n            }).bind(\"geocode:mapdragged\", function(event, result){\n            console.log(result);\n\n        });\n    }\n\n```\nBut am getting the following return on the latLng arguments:\n[Exception: TypeError: 'caller' and 'arguments' are restricted function properties and cannot be accessed in this context. at Function.remoteFunction (:3:14)]\nNot sure what I am doing wrong.\nAny help would be most welcome.\n. ",
    "baboforever": "When we set the types to [] the results are not the same. For me the problem was with the types set to geocode by default. When we pass an array of types ['geocode', 'address'] the result is no result.\n. ",
    "gusta21": "Hello, I was using google api directly and i cannot filter by country. I think is google api problem yo have to solve. I´m traying to update the map while user is completing the dropdowns with country, province, city and address. If i can figure out, i will reply with some help. Regards.\nI'm from Argentina, sorry for my english...\n. ",
    "agam16": "I am having the same issue. Did you solve it. Please let me know the solution what i need to do ??\n. ",
    "pachakamac": "Hi,\nI'm having the same problem.\nDid you solve it ?\nRegards,\n. ",
    "ludo": "I ran into this issue too, turns out all I had to do was set the detailsScope paramater:\n\ndetailsScope - Allows you to scope the 'details' container and have multiple geocomplete fields on one page. Must be a parent of the input. Default is null\n\n(from the README)\n. ",
    "plisvb": "Figured it out, IE Doesn't like svg markers, changed them to png's and all is well\n. ",
    "youradds": "Eugh, was me being stupid. The \"this_country\" param I was passing in, was \"en\"... but should have been \"uk\" ... duh!\n. ",
    "mwamzlee": "Or Squarespace? \n. ",
    "iruy": "On WP I did like this:\n\nwp_enqueue_script( 'google_maps_api', \"http://maps.googleapis.com/maps/api/js?sensor=false&libraries=places\", array( ), $this->_version );\nwp_enqueue_script( 'geocomplete', esc_url( $this->assets_url ) . 'plugins/geocomplete/jquery.geocomplete' . $this->script_suffix . '.js', array( 'jquery', 'google_maps_api' ), $this->_version );\n. \n",
    "NoSGR": "Hello,\nI'm trying to setup your scripts at my wordpress page on this URL: http://www.taxiguider.com/test/ for testing.\nAt this time i've added the scripts in footer of my template but map isn't showing up. Can you please help me to solve this?\nThanks in advance\n. ",
    "adleee84": "example of radius search using geocomplete like this website carousell.com\n. ",
    "aDarkling": "https://developers.google.com/maps/documentation/javascript/places-autocomplete\nYou have 5 options/combinations: geocode, address, establishment, (regions), (cities).\n['geocode', 'establishment'] is the same as NULL, which gets you everything.\n. ",
    "gerardp": "I have the same issue.\n. ",
    "mbsanga": "What is the solution for this issue? i have the same\n. ",
    "th3fallen": "+1\n. ",
    "zipang": "Oh yes. You're welcome, that's a pretty useful plugin ! :)\nThe editorconfig was something else, but i didn't include the jquery.geocomplete.min.js file in my Pull Request !\nCan you do that ?\nThanks again for your awesome work !\n. Closed with issue #240\n. This is a problem with the Google Places API response, not the plugin by itself.\nBut you should be able to access the .lat() and .lng() methods on the result.geometry.location object.\nhttp://stackoverflow.com/questions/13505928/google-places-api-why-does-it-returns-lat-and-lon-under-a-different-variable-eac\n. ",
    "adrienjoly": "Hi @federicolucca,\nHave you solved your problem?\nMy autocompleted queries don't provide coordinates in result.geometry anymore... So maybe our problems are related!\n. @federicolucca I figured out that the coordinates must be extracted using result.geometry.location.lng() and result.geometry.location.lat().\n. ",
    "3kwartappel": "I am not sure if this is the same issue, but my 'find' also returned the incorrect result. It seems it is because the 'bounds' are set before doing the lookup, and the wrong results are return. \nAs a workaround, I changed the \"jquery.geocomplete.js\" file  as follow, by adding this line:\nrequest.bounds = this.options.bounds;\njust before this line (352): \nthis.geocoder.geocode(request, $.proxy(this.handleGeocode, this));\n. ",
    "dariuszsikorski": "Bump, .find(lat,lng) still results in incorrect location. Results in nearby location to given coordinates, but never the exact location which was picked by user coordinates.. ",
    "braadworst": "Got the same issue but deviced are different.\nAndroid cordova app works\nIpad mobile browsers dont (chrome and safari)\n. I started using this https://github.com/lukemadera/meteor-autoform-googleplace\nWorks like a charm.\n. ",
    "williamabbott": "Same issue on ios\n. ",
    "timjcook": "I came to this thread with the same issue, on mobile safari, selecting an place from the autocomplete list would close the list but not populate the field with the selected place.\nThe place_changed event wasn't being fired on mobile, see this line\nIt wasn't being called because I was using the FastClick library in my app. This issue in the FastClick repo sorted it all out for me.\n. ",
    "bialesdaniel": "I have the same issue working with meteor + ionic I am not using the FastClick library.\n. Has anyone had any luck resolving this issue?\n. Hi I found a solution I used TillaTheHun0's solution from https://github.com/driftyco/ionic/issues/1798 combined with adding the following to the css: .pac-container {\n  z-index: 3000 !important;\n}\n.modal-open {\n  pointer-events: auto !important;\n} \n. ",
    "dhoff002": "bialesdaniel, can you post the code for your solution?  It would help us all!   I would love to see exactly how you implemented the solution!\nThank you!\nDan\n. ",
    "jtomaszewski": "+1, IMHO ok to merge.\n. ",
    "rubiety": "This pull request appears to break the case of calling geocomplete without any options at all. One cannot assume when calling options.types in that context that options is necessarily an object.\nSpecifically, the following works:\njavascript\n$(\"input\").geocomplete({});\nBut the following fails:\njavascript\n$(\"input\").geocomplete();\nThis is the JS error:\n\n. ",
    "tarunlalwani": "@rubiety , This one should fix it\nhttps://github.com/ubilabs/geocomplete/pull/259\n. ",
    "nwittwer": "I figured out a hacky way to do this in the meantime. Hope it helps someone.\nFirst, create the HTML elements. The initial input is where the Geocomplete form is generated. Nothing special there. The next inputs will grab the street_number and route, and then in #address we'll combine the input's values and have our final address (basically just a + b = c).\n<input type=\"text\" id=\"geocomplete\" data-geo=\"address\" placeholder=\"1234 Aleander St.\" required />\n<!-- grab the route -->\n<input type=\"hidden\" id=\"street_number\" data-geo=\"street_number\" value=\"\">\n<!-- grab the street address -->\n<input type=\"hidden\" id=\"route\" data-geo=\"route\" value=\"\">\n<!-- put them together -->\n<input type=\"hidden\" id=\"address\" name=\"address\" value=\"\">\nBut there's no logic there, so we'll add some basic jQuery:\n```\n// Setup the Geocompletion form\n$(function(){\n  $(\"#geocomplete\").geocomplete({\n    details: \"form\",\n    types: [\"geocode\"],\n    detailsAttribute: \"data-geo\"\n  });\n});\n//\n// On blur (lose focus) set the value of #billing-address and name=\"address\" to\n// the same value as the input address\n//\n$(\"#geocomplete\").on('blur', function() {\n  var a = $(\"#street_number\").val();\n  var b = $(\"#route\").val();\n  var c = $(\"#address\").val(a + \" \" + b); // combine with a space in between\n})\n```\nNow we have an input we can target with the desired address for when we send the form (name=\"address\"). We basically ignore the Geocomplete input information when submitting the form and instead use the combined address in #address.\n. ",
    "server-izetov": "I'm not completely understand why you use this construction: (new google.maps.LatLng(latLng.lat(), latLng.lng())).toString()). if you already have latLng object, try to use it without create a new one.\nAnd one more note, for some reason latLng.toString() return string with brackets, for example: (-33.87940222788091, 151.2546811516952)\nTry to use something like this:\n.bind(\"geocode:dragged\", function(event, latLng){ geocomplete.geocomplete(\"find\", latLng.lat()+\", \"+latLng.lng()); })\n may be it will be helpful for you.\n. ",
    "frandibar": "Hi, I had the same problem and solved it using this hack:\n$('input').geocomplete('options').componentRestrictions.country = country;\n. ",
    "anupalhub": "@frandibar ok i will try that. Thanks though.\n. ",
    "yopos": "Sorry, there was a mistake in my code, and it works correctly.\n. ",
    "BtM909": "NICE! thanks\n. ",
    "sanarena": "We are still hoping for a fix...\n. Bumb\n. ",
    "aaronhb": "i setup a test here to try and get the lat and lng to populate the custom fields on this pen http://codepen.io/abennington/pen/ONBBxW\n. ",
    "v1shky": "I am also facing the same issue !\n. ",
    "SoliloquyBlue": "I'm having the same problem. Whether I set the zoom level to 2, 12, or 20, the resulting map is exactly the same.\n. ",
    "Kinetic-Pulse": "Hey guys @v1shky  & @SoliloquyBlue ,\nSo currently this is working for me:\nTemplate.find.onRendered(function() {\n  this.autorun(function () {\n    if (GoogleMaps.loaded()) {\n      $(\"#geolocater\").geocomplete({\n        details: \"form\",\n        detailsAttribute: \"data-geo\",\n        map:\".map\",\n        mapOptions: {\n          mapTypeControlOptions: {\n            mapTypeIds:\"ROADMAP\"\n          },\n          streetViewControl: false,\n        },\n        markerOptions: {\n          draggable: false\n        }\n      }).bind(\"geocode:result\", function(event, result){\n        var map = $(\"#geolocater\").geocomplete(\"map\");\n        map.setZoom(15);\n      });\n    }\n  });\n});\nNotice the .bind I now to geocode:result. Now doing\n        var map = $(\"#geolocater\").geocomplete(\"map\");\n        map.setZoom(15);\nAllows me to control the zoom as compared to before.\nHope that helps :)\n. ",
    "vuma-tel": "We are having the same issue.\nThe GeoComplete is not working at all, until today there were no issues, now it is unusable.  This is on our live site and our customers are not able to search for their address.\nAnyone know of a fix - I am getting desperate \n. Thank you so much for your prompt responce.  Just generated a key and busy pushing to our production server.\n. So we have added API key and pushed but it is still not working.\nCould there be an issue with our domain?\n. Yeah I am getting no errors.  Just does not run.\n. So we managed to sort out the issue.  I must say thank you for your responses and support here.  It is really appreciated and I am happy we used your plugin - it works great.\n. Hi Elijoncurry2\nHave you enabled the different Google Maps API's under your Google API manager?  We had to enable all of them to get it working.  See screen shot below:\n\nThis may not be the issue but its worth a try.\n. ",
    "TheeAndre": "Tried adding the API and verified the domain that the autocomplete just won't work. No API Key errors or verified domain errors. \n. Not sure what it was but i had to enable anything Google Maps API related to the API. From Static Maps, Places API... Everything to get it to work.  \n@Webstar You can't add localhost on the allowed domain list anymore. It has to be a FQDN (Fully Qualified Domain Name). \n. @webstar You can add http://localhost and it should work. Working on localhost now.\n. ",
    "Kintabor": "With the key geocomplete works fine for me. Just be sure your key and the allowed domain are right. Just to test, allow all Domains to use the key. If would this configuration work, you know where yout issue is :)\nSome additional question: do you use your key by calling the script? You have to add the key on your Website. It isnt enough to generate the key and set a allowed Domain. Here's a tutorial: https://developers.google.com/maps/documentation/javascript/tutorial?hl=de#The_Hello_World_of_Google_Maps_v3\n. You're right. The problem is the places autocomplete, it doesnt work since I switch to https. Is there a workarround?\n. ",
    "webstar": "So it seems that (after adding the API key) it just doesn't work on localhost anymore, once I uploaded to an actual server it works fine.\n. @TheeAndre Oh interesting - I didn't add any domains at all, so assumed it just wouldn't work.\n. ",
    "eljoncurry2": "Not to beat a dead thread, but none of this has worked for me.  I have my api key and using the same code that has worked for over a year now and I cannot get this to work any longer.  No errors (or any output for that matter) show in console.\n```\n\n</p>\n<script>\n$(function() {\n    $(\"#location\").geocomplete({\n        details: \"form\"\n    });\n});\n\n```\nUntil my client notified me 2 days ago, this has always worked and populated the form fields I have set.  I have left the accepted IP's field blank for the api key and i've tried using the IP for the server.\nEdit: Usage for Google Maps JavaScript API shows no calls.\n. Yes, works just fine locally.  Either add localhost to your api credentials or leave it empty.\n. This has nothing to do with this plugin not working.  This is simply a 404 (not found) error for a favicon or image.\n. ",
    "vrodriguezf": "Hi,\nI do not know what I am doing wrong, but this is not working for me neither :(\nI have created a key for Google Maps API, and the Google API console shows that the key is making calls...but in my app nothing is shown.\nI am working in wodpress, I load the scripts in  a php file as follows:\n``` php\nwp_enqueue_script('gmaps',\n                            'https://maps.googleapis.com/maps/api/js?sensor=false&libraries=places&key=MY_KEY',\n                            array(),\n                            false,\n                            false);\nwp_enqueue_script('geocomplete',\n            PLUGIN_PATH . '/js/jquery.geocomplete.js',\n            array('jquery','gmaps'),\n            false,\n            false);\n\nAnd in the corresponding .js file, i simply write:\n(function($) {\n        $(\"property_address\").geocomplete();\n})(jQuery);\nAny help? In this post you talk about allowing domains to use the API key...but I am not sure how to to that.\nThanks in advance!\n. ",
    "TheBigK": "Just to be more descriptive : -\n[+] [-] are buttons that add or delete field, each with geo-data=\"locality\"\n[New York] [+] [-]\n[Paris] [+] [-]\n[Kolkata] [+] [-]\nIf I change, New York to \"Kassel, Germany\", then Paris and Kolkata would automatically get updated to \"Kassel\".  I need a way to tell geocomplete to populate only the field that's meant to be changed. \n. ",
    "chid": "https://developers.google.com/maps/documentation/javascript/geocoding#ComponentFiltering\nYou may want locality or postcode.\n. I think you need the API keys after enough calls.\n. ",
    "ninjz": "It seems to not be working when developing locally.. I have not been able to find a solution. It looks as if others have been experiencing this issue as well.\n. ",
    "chris74656": "+1\ndid you manage to solve this?\n. ",
    "troyshu": "@jaqueshere I'm having the same issue. Any solutions yet? Will continue to look.\nfwiw, when I work on my site locally, everything works fine (the dropdown comes down with suggestions). But, when I work on the exact same code but on a server, it doesn't. I'm running a Django app, I've already checked, ALLOWED_HOSTS (a Django specific settings variable) is fine.. I fixed it, at least in my case. \nLooking at the response of the actual request it was sending to Google in the Network tab of my browser console, I was getting ... This API project is not authorized to use this API ... go to https://console.developers.google.com/apis/api/places_backend?project=_. But I thought I had enabled what it was asking for.\nTurns out that while I had enabled the \"Google Maps JavaScript API\", I also needed to enable the \"Google Places API Web Service\". I enabled the latter by going to https://console.developers.google.com/apis/api/places_backend?project=_ and selecting the appropriate project.\nNot sure if the need to enable both Google APIs is in the documentation anywhere, or if this solves OP's issue, leaving this here in case it helps anyone else.\nUPDATE: After all this, I received ... This API project is not authorized to use this API ... go to https://console.developers.google.com/apis/api/geocoding_backend?project=_ in the Javascript console. Turns out I had to enable a 3rd API, the Google Maps Geocoding API... Google... hopefully that's it.. ",
    "sunildeveloper07": "i checked when i increase the z index of auto complete div then its showing\n.don't know proper solution\nOn Aug 4, 2016 8:43 PM, \"juliusvinton\" notifications@github.com wrote:\n\nI confirm this issue with the latest Bootstrap 3.3.7 and jQuery 3.1.0. Any\nideas for a fix?\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/ubilabs/geocomplete/issues/280#issuecomment-237584291,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AS1QEg5j3AAEU4zPkvowpUZ3cwEhcyeEks5qcgGRgaJpZM4JWHW5\n.\n. not to increase input zindex . increase the z index of div which was auto\ngenerated by auto completed.\nOn Sep 23, 2016 6:28 PM, \"Jirka1111\" notifications@github.com wrote:\nCan you write an example? I have increased z-index of text_field with\nautocomplete but it still doesn't show.\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub\nhttps://github.com/ubilabs/geocomplete/issues/280#issuecomment-249185134,\nor mute the thread\nhttps://github.com/notifications/unsubscribe-auth/AS1QEhly3nzuEWDrO3L9FOo78biF6KuVks5qs8zhgaJpZM4JWHW5\n.\n. \n",
    "Jirka1111": "Can you write an example? I have increased z-index of text_field with autocomplete but it still doesn't show.\n. Sorry guys, still don't get it:\nhttp://www.codesend.com/view/51a7281f4905c3e8eabda09b85928d33\nWhich one has to have big z-index?\n. Oh my god, I couldn't send it normally so sorry for the redirect.\n. Now i get it. Thanks you both! It was a .pac-container: 9999999999 !important\nI always use !important in case of Bootstrap...\n. I think this solution has to be mentioned in the description of that plugin...\nExplanation (sum up): Geocomplete works even in Bootstrap modal, but it is not visible. You have to set z-index of autogenerated div to something like 99999999999 with !important.\nSolution (by juliusvinton and sunildeveloper07):\n.pac-container {\n    z-index: 9999999999 !important;\n}\n.pac-container is autogenerated class of geocomplete plugin. You don't have it in your code, but it is visible in code inspector in Chrome.\n. So the solution was pretty simply (thanks Sravan from SO). First row is enough:\n$(\"cities\").geocomplete();\nBut be aware, this jQuery gem doesn't work in Bootstrap modal.\n. ",
    "Chef-Code": "Stupid mistake, The api key did not allow the variation of the url\n. ",
    "rhmkds": "yes thanks\n. ",
    "amakhrov": "Hmm... Looks like the deprecation notice is related to direct API usage, while google.maps.places.Autocomplete component is not affected.\n. ",
    "cheles": "@theromie I don't see the CSS. Don't forget to add something like: \n.map_canvas { \n  width: 600px; \n  height: 400px; \n  margin: 10px 20px 10px 0;\n}\n. ",
    "bahiamartins": "I was facing the same issue. This is how I did it:\nshow_map {\n    height: 248px;\n    width:100%;\n    -webkit-box-shadow: 0 2px 5px 0 rgba(0,0,0,0.2);\n    -moz-box-shadow: 0 2px 5px 0 rgba(0,0,0,0.2);\n    box-shadow: 0 2px 5px 0 rgba(0,0,0,0.2);\n    margin-bottom:10px;\n}\n\n$(function(){\n        $(\"#id_address\").geocomplete({\n            details: \"#infoform\",\n            map: \"#show_map\",\n            mapOptions: {\n              zoom: 16\n            },\n            markerOptions: {\n              draggable: true\n            },\n            location: [-23.55052,-46.633309],\n        });\n});\n    . Just solved. Change your input field from 'locality' to 'administrative_area_level_2'. Example:\n\n<input id=\"id_city\" name=\"administrative_area_level_2\" type=\"text\">. ",
    "lmachens": "Looks like it works here now. I didn't change anything.. ",
    "chrisli30": "I really like this library which saved me a lot of work on UI so I researched Google and made \"types\" work again in #301 .\n\n\nGoogle has changed the parameter from \"types\" to \"type\", but most of type values remain unchanged.\n\n\nRegardless, the only change we need to make is to explicitly call a new method setTypes() of AutoComplete. For example, I added this line right after autocomplete object initialization.\nthis.autocomplete.setTypes(options.types);. I did test locally but didn't check in test code due to lake of cleanness. Hope it helps!. \n\n",
    "iforgotbetter": "You will need the user to select an option from the drop down to get the lat/lng values. This is not an issue with geocomplete. What I would recommend is to set a flag on the input field to check if the geocode:result event has been called, and validate that flag before you try to send the values, forcing the user to select an option before they move on.\nPS. You would also have to check if the address if they decide to go back and edit before they send.. Just stumbling across, first off it looks like you need more then just the geocomplete functionality and might be better off using the complete maps v3 api with something like gmaps.js - a jQuery wrapper for the api. Second your default location is much to precise for being in the middle of the ocean. You should not need more then 9 decimal places. Read this answer here: http://gis.stackexchange.com/a/8674.\nIt looks like your problem has nothing to do with geocomplete as it does with your logic. If you have a problem, bring it to stack overflow and maybe be more precise about what you are trying to accomplish. . ",
    "airv-b": "+1 . I use Symfony, and if I change the name of the input, the data is not persist :(\nEdit for @kamov :\nYou can insert an id and add this in your script \ndetails: \"form\",\ndetailsAttribute: \"id\",\nExample for longitude:\n <input type=\"text\" id=\"lng\" name=\"yourname\" value=\"\">\nSee here -> https://github.com/ubilabs/geocomplete#populate-form-data. ",
    "kamov": "thanks! I will try, actually I use a function to autoupdate my other field , hidden. This don't fix my issue, because seem that you can't change the name of input, I mean change to:\nhtml\n<form>\n  Latitude:   <input name=\"location_lat\" type=\"text\" value=\"\">\n  Longitude:  <input name=\"location_lng\" type=\"text\" value=\"\">\n</form>. I am using map inside bootstrap tab, maybe is this reason?. I found this solution, but map is not defined:\n$(\"a[href='#location']\").on('shown.bs.tab', function(){\n    google.maps.event.trigger(map, 'resize');\n});. Also outside of bootstrap tab is not display, but check source code there is html as above screenshot, any idea?\n\n. was missing:\n.map_canvas {\n    width: 600px;\n    height: 400px;\n    margin: 10px 20px 10px 0;\n}\n:(\nHope help others\nbest. Thanks for info.\nAccording to this:\nhttp://stackoverflow.com/questions/832692/how-can-i-check-whether-google-maps-is-fully-loaded#7262773\nI do something like:\njs\n    $(\"#location\").geocomplete({\n        map: \".mapcanvas\",\n        details: \"form \",\n        markerOptions: {\n            draggable: true\n        }\n    }).bind(\"geocode:result\", function(event, result){\n        map = $(\"#location\").geocomplete(\"map\");\n        google.maps.event.addListenerOnce(map, 'idle', function() {\n            google.maps.event.trigger(map, 'resize');\n            map.setZoom(14);    \n            map.setCenter(result.geometry.location);\n        });\n    });\nSeem work fine now, however, sometime autocomplete not work in firefox, no error given, the map and autocomplete is just not loaded. @katiemccann be sure to not use async=\"async\" when you include google map script. when I removed this, issue never appear.. ",
    "katiemccann": "@aemkei Can you suggest the best way to ensure that the Google Maps API is loaded ahead of the Geocomplete script? I've suddenly started getting this error about 50% of the time now and I'm a JQuery newbie, so not sure how to best guard against it.. ",
    "dzaal": "yu can at least use the bounds option and make sure that the map is displaying that area.. ",
    "CamaroMan": "use this:\n$(\"#geocomplete\").geocomplete({\n           componentRestrictions: {\n           country: 'USA',\n          postalCode: '90807' / optional /\n  }\n              });\nthis u will find in the google API with much more. ",
    "shashank-saxena": "I was also facing the same issue with this plugin:\nJust need to add the country and type keys in the passed object.\nEarlier(with above error): \n```\n$mailingAddress.geocomplete({details: $(this), detailsAttribute: \"data-geo\"}).bind('geocode:result', function(event, result) {\n      $mailingAddress.attr('data-address', result.formatted_address);\n    });\n```\nFixed:\n$mailingAddress.geocomplete({country: \"US\", type: ['(regions)'], details: $(this), detailsAttribute: \"data-geo\"}).bind('geocode:result', function(event, result) {\n      $mailingAddress.attr('data-address', result.formatted_address);\n    });. ",
    "ivansammartino": "I have this error too, but my script is a simple $('.geocomplete').geocomplete(); and I have no clue how to fix this.... Thanks @johnrees : I'm from Italy so I added this (and it works, or at least I have no more that error)\n$('.geocomplete').geocomplete({\n                country: 'IT',\n                type: ['(regions)']\n            });. ",
    "johnrees": "@ivanhalen you need to specify a country's ALPHA-2 code.\nAssuming you're in the US, based on @shashank-saxena's answer your snipped would now become $('.geocomplete').geocomplete({country: \"US\", type: ['(regions)']})\nThere's an open issue dating back to 2012 asking Google to support multiple countries, https://code.google.com/p/gmaps-api-issues/issues/detail?id=4233\nI hope I'm wrong but it looks like country is the largest 'area' that you can filter with https://developers.google.com/maps/documentation/javascript/reference#GeocoderComponentRestrictions. Ah nice find @fwerner13 Yes that's working for me. Thanks. ",
    "fwerner13": "But what if you do not want to limit the country?\nI think this solution would be better: https://github.com/Mukhilan/geocomplete/commit/e0483797f002e07502b9333451e766bf2d72a634. ",
    "berny900": "Same here: @fwerner13 works for me too.\nSince the link doesn't work here is what to do:\nDelete this line in jquery.geocomplete.js:\ncomponentRestrictions: this.options.componentRestrictions. ",
    "cmalpeli": "@aemkei I don't think they plan on fixing it, it's a new format.\nIn order to clear it you can give this in your country restricts:\nautocomplete.setComponentRestrictions({'country': []});\n\nThis one works for both v=3.26 and v=3.27 and newer. Just [] will not work from v=3.27 and newer.\n\nSeems like this component should be updated to support the new format.. ",
    "helinW": "HI,\nHere are the notifications of Google about this problem :\nhttps://code.google.com/p/gmaps-api-issues/issues/detail?id=11253. ",
    "ClemArt": "Hi,\nThank you for the feedback.\nIt seems google actually fixed the issue in his v3.28, so you can close this PR as it's not needed anymore.. ",
    "judahnator": "I can confirm this issue. Sometimes it ignores the address and resets the field, sometimes it randomly selects a new address.. ",
    "pion139": "This code works in my case:\nvar geocoder = new google.maps.Geocoder();\n      $(\"#geocomplete\").bind(\"geocode:dragged\", function(event, latLng){\n        $(\"input[geocompname=lat]\").val(latLng.lat());\n        $(\"input[geocompname=lng]\").val(latLng.lng());\n        map.panTo(latLng);\n        geocoder.geocode({'latLng': latLng }, function(results, status) {\n          if (status == google.maps.GeocoderStatus.OK) {\n            if (results[0]) {\n              $(\"input[geocompname=formatted_address]\").val(results[0].formatted_address);\n            }\n          }\n        });\n      });. ",
    "rubenlpz": "The solution was to add the types option set to [] to returns all type of results (Default package value has this option set to only return geocodes).   Also I set the country (region in the original API) to return local results first.\n$(\"#myInput\").geocomplete({types:[], country:\"CA\"}); \nClosing issue.. ",
    "ToddismDotCom": "I hacked it by adding the jquery to the page.  No idea what's happening.. ",
    "papix2001": "button works with https. ",
    "klausi": "yay, thanks for merging!. ",
    "nduijvelshoff": "Solved: \n$(\"#addr\").geocomplete({\n          details: \"form\",\n          detailsAttribute: \"from\",\n          country: [\"nl\"],\n          types: [\"geocode\", \"establishment\"],\n        });. ",
    "serval92": "Hi. Try this :\n//geocomplete init\n$(function() {\n    $(\"#form #address\").geocomplete({\n        map: \"#map_canvas\",\n        mapOptions: {\n            zoom: 10,\n                        mapTypeId: \"satellite\"\n        },\n        markerOptions: {\n            draggable: true\n        },\n        details: \"#form\",\n    });\n});. ",
    "CarlosAlbertoSantos": "I have the same issue. The solution above does work for me.. ",
    "beejaz": "locality recently stopped working for me, instead i find the postal_town in respons from google. Please add support for this field. I tried replacing the locality with postal_town in the .js but it didnt work.. ",
    "Fenixmael": "resolved. ",
    "p3lewis": "I'm having this same issue, can someone give a comment on what they did to get around it please?. ",
    "flafla": "@juanmas07, @p3lewis  try this\n$('.geoloacation').geocomplete({\n   location: [123, 123]\n}). ",
    "ggabrovski": "You can try to force \"map resize\" and center the map after geocode:result event.\nFor example:\n$(\"#geocomplete\").geocomplete({\n  map: \".map_canvas\",\n  types: [\"geocode\", \"establishment\"],\n  })\n  .bind(\"geocode:result\", function(event, result){\n     var map = $(\"#geocomplete\").geocomplete('map');\n     google.maps.event.trigger(map, \"resize\");\n     map.setCenter(result.geometry.location);\n  })\n;\n. "
}