{
    "Valve": "Agree, get version 0.3, it's there.\n. https://github.com/Valve/fingerprintjs#minification\nDone :)\n. Thanks for letting me know, I'll fix it this evening.\n. I used non-strict equality with null to shorten otherwise lengthy obj === null || typeof obj === 'undefined'\nIm totally for explicitness, so please update the code with longer (and clearer) version.\n. > > if you are happy with the other changes I will revert\n\n\nthat back and add a comment instead to explain why that's the case.\n\n\nSure, please do, I'll merge it then.\nThanks.\n. I've read the Pixel Perfect research and came to the conclusion that Canvas fingerprinting serves its purpose only when other, more traditional fingerprinting methods aren't available. For instance on a Tor Firefox browser it's impossible to identify a user by fingerprinting, because all components would be the same, and fingerprinting will identify all Tor-enabled browsers as one.\nThis research says that canvas fingerprinting is orthogonal to traditional fingerprinting and should be used independently. \nAdditionally, the browserleaks.com collected statistics suggest that on average there is one distinct PNG CRC checksum per 8 user agent strings, which leads me to think of it as not sufficiently diverse set of crc values.\nThis fingerprinting library should be as general-purpose as possible, not catering to specialized browser packages.\nPlease let me know what you think.\n. OK, I'll implement it as an optional thing, similar to:\nvar fp = new Fingerprint({canvas: true});\nWhen passed the canvas: true option, the fingerprinting will use this method with others.\n. @prismspecs, to save the canvas image, you need to do similar to:\njavascript\nvar el = document.getElementsByTagName('canvas')[0];\nvar base64 = el.toDataURL();\nalert(base64);\nOnce you have the base64, you can save it with any server-side languages, by converting to byte array and saving to the disk.\n. @tanuj-github what users information are your referring to?\n. Canvas fingerptinting doesn't really care what text you draw there, the only thing that matters is applying all the colors (see here https://github.com/Valve/fingerprintjs/blob/master/fingerprint.js#L265)\nIn other words, it doesn't matter whether you draw abcefghjkl... or your app name and version\n. fingerptintjs uses a lot of browser capabilities besides image, but overall yes, the way it's built now is sufficient. Remember that fingerprint does not guarantee you the correct identification, it only gives 89-94% of uniqueness.\n. Thank you for your PR.\nNPM package name fingerprint has already been taken, so I published it as fingerprintjs\n. Fixed, grab version 0.4.2\n. Done, grab v0.4.3\n. Could you provide more information, your collision percentage, etc?\n. What percentage of IE10 did you have out of 3180 visits?\n. It may be hard to solve the problem, because I'd need to have a lot of IE10 browsers to see the results. I'll look into it. Thanks.\n. Of course, if you could share this info, it'd help me a lot :+1: \n. OK, I've found two things:\nFirst, the user agent shows that the PCs are Media Center PC, but most importantly, the plugins are not queried, this is a bug in the library. \nIE is different when it comes to getting the plugins information, there is no way to list them, only probe them one by one.  I'll add IE-specific code to do just that, give me a couple of days.\n. OK, I finally got some couple of hours to look closely into this. \nFirst of all, thank you for your feedback and information, it proved invaluable.\n1. You've found a bug in the library, it didn't detect properly the plugins available in IE browsers. Now it does for a list of plugins (see new readme). In order to use the IE plugins querying, add the ie_activex: true option to Fingerprint constructor. I'm always trying to maintain the backwards compatibility, that's why you'll have to explicitly add this option. Other users will still be getting unchanged fingerprints for IE.\n2. Screen resolution detection is now available too in building the fingerprint. To enable it, pass the screen_resolution: true to the options hash in Fingerprint constructor. First versions of the library used screen resolution, but one guy asked me to remove it, because he thought users might use external monitors and the library would detect them as different persons. In your case, you have a lot of uniformity within a IE share, so I suggest you add this option.\n3. Your agent string shows that the IE browsers are installed on a windows media PC, which might be either a standalone PC or a set-top box. In the latter case, the browsers will all be the same and be reporting the same fingerprint. If you find same collisions even after enabling ie_activex and screen_resolution options, I suggest you resort to other methods of identifications, such as cookies and/or IP address. \nIn any case, please use the new version 0.5.0 and let me know how it goes.\nHappy fingerprinting & coding! :heart: \n. Around one in 10-20 thousand fingerprints. It happens sometimes, it is normal.\n. Did you have luck fingerprinting IE10 with version 0.5.0?\n. OK, closing this issue, because you've said IE10 problems are fixed. If you will experience collisions with other browsers, please open a separate issue.\n. Thanks!\n. Thanks for the report, @levipage , I'll look at it.\n. OK, thanks again for you report, I've just pushed v0.5.1, with the fix. The problem was missing document.body. \nThis can happen in two cases: 1) - body isn't defined yet (script parsing and execution is in header for example). 2)\nbody was explicitly removed, for example this reproduces the issue document.body.parentNode.removeChild(document.body).\nNow all specs pass. \nThere is also a pending PR to cdnjs to upgrade to the new version: https://github.com/cdnjs/cdnjs/pull/2314\n. Thanks, I'll have a look at it. :)\n. Hi Cal, thanks for your PR.\nAdding font enumeration was something I wanted to add too.\nIf you could have a look at the issues below, I'd gladly accept the PR:\n1. Write tests to cover new functionality (tests should work in usual GUI browsers & phantomJS). Since travis CI env is linux based, a phantomjs + flash combination might be tricky, please let me know if you will have difficulties with that.\n2. Remove the jQuery dependency from Readme. jQuery is not required for SWFobject.\nStyle: \n3. Use camelNotation everywhere, for methods and fields.\n4. Do not use multi line comments /*...*/ for single lines.\n4. Always open curly brace on the same line.\n4. Define global stuff on context object inside closure, not outside with var something....\n5. Use strict comparison whenever possible, ie if(typeof bla !== 'undefined'){\nIn other words, I will try to follow a very good Airbnb JavaScript style guide, https://github.com/airbnb/javascript.\nI was a bit sloppy myself with this code, I will clean things up and make existing code airbnb compliant too. :smile: \nThere are also some bugs in your implementation:\n1. If I do not have flash installed/disabled/unsupported - new Fingerprint().get and new Fingerprint({flash: true}) should return same result. Currently they are different.\n. Hi, @calh \nDid you get a chance to finalize the PR?\n. @calh, would you like me to continue working on the PR? I could add specs & brush up the code and merge it. It's been hanging here for some time, I think we should either close it or finalize.\n. HI, \nWhat kind of problems are you having with 14px font? The problem with changing to 18px font is backwards compatibility, I can't break it, existing users should always get same fingerprints regardless of library version.\n. That's very weird, I'm sure font has nothing to do with it, it can be a representation of another issue or a bug. If you could reproduce the issue with two different fingerprints in the same browser and show the data the FP is collecting, ... that might help me investigate things. \n. @levipage, good point, thanks.\n. @jcastilloa, did you get a chance to gather some browser information for your cases?\n. OK, no response for a week, I guess the issue is no longer there, closing.\n. Hi @deanesaundersstowe, \nplease let me know which version of fingerprint.js you're using and which Windows version you're having this error on?\n. @deanesaundersstowe , it was IE issue in general, not only IE8. I covered this with tests now and run them on Windows. The new release is available here: https://github.com/Valve/fingerprintjs/releases/tag/v0.5.3\nor install it with bower.\n. Ok, thanks\n. What kind of error are you getting with old code? Just curious.\n. If it's not available in packaged apps, your code will return false as mine. Sorry, I don't understand the purpose of the change. Both ways will return false, or am I missing something?\n. Closing for now\n. What kind of error? This line is already inside a  try/catch block. Why isn't it working for you?\nI'm trying to understand your problem, rather than blindly merge the changes.\nI know that Firefox can throw SecurityError when cookies are disabled (http://stackoverflow.com/questions/10516767/access-of-local-storage-giving-security-error-after-cookies-are-disabled-in-fire) and when trying to access the local storage. \nBut I haven't seen such behavior with Chrome. \nPlease provide more information about your use case.\n. no problem, thanks for letting me know.\nClosing it for now, please reopen if you find more issues with this.\n. Thanks for the info, but I'm afraid there is not much I can do about it.\n. I don't know how to contact Microsoft about it and I'm quite perplexed, to be honest. For now I asked on one of their forums: http://answers.microsoft.com/en-us/protect/forum/mse-protect_updating/my-javascript-library-is-wrongly-detected-as-a-js/0d9c4bf6-a0e5-47b6-a7d5-575f049309e3?tm=1400067197123\nWill be waiting for answers.\n. Thaks, @thegyppo, I submitted a report there too.\n. Another update, submitted the lib for review as something that does not contain malware:\nhttps://www.microsoft.com/security/portal/submission/submissionhistory.aspx?SubmissionId=f09fcbef-1f04-443e-8cfe-ccc8c9df4e90\n. @levipage I have not received any updates from MS. \nThere is a chance that updated signature dbs may no longer report it as a virus, but I can't verify it, not on Windows.\n. @thegyppo , @levipage I was not able to reproduce it. I just installed Windows 7 and MS security essentials on it. After that I updated the db to the latest definitions. Then I downloaded the script and right-clicked on it \"Scan with Microsoft Security Essentials\" and it was green. \nSo this leads me to 2 possible conclusions:\n1. Either the antivirus databases were updated and no longer report the script as a trojan.\n2. I'm doing something wrong. \n@thegyppo , could you please verify that my testing method is correct. I haven't found a way to test a live webpage, only the JS file on disk.\n. Closing, because it no longer reports it as trojan, reopen if needed.\n. Thanks,\ndo you want me to release new version (0.5.4)?\n. @lukaszklis \nDone\n. Fixed\n. @levipage I'm a huge opponent of any dependencies myself. I think I will be able to handle v2 w/out the jquery, but the swfobject is still unclear. It's tricky to reliably load the swf files with custom js code. SWFobject is very tested and reliable in this sense. But if people don't need the font sniffing in the first place, then there is no necessity to use swfobject and v2 will be a no-dependencies script as before.\nAs for MS security essentials, the only viable solution as I see it is to install windows on a virtual box and try various script refactorings while keeping the backwards compatibility and testing it on the antivirus to see if the warning about trojan would go away. I'm going to do it on weekend, I think.\n.  I'll release a fingerprintjs2 if 10 users will vote for this, currently it's only 6.\n. @maceip thanks for the links, yes, I'll make it detect maximum features, all that I can implement.\n. New repo is here: https://github.com/Valve/fingerprintjs2\nPlease submit all ideas, thoughts as issues. Any help and criticism is greatly appreciated.\nThank you all, closing issue. \n. Hi, @arjunmenon,\nYou are correct, when installing/uninstalling/disabling plugins or changing the browser - the fingerprint will change. If you change the browser - the userAgent string will change and affect the fingerprint.\nIn reality, though, most users stick to one browser and use it. In my experience only geeks or security obsessed people switch browsers regularly. So if we're talking about an average user (non-programmer), their fingerprints can stay unmodified for months or even years.\n. @MichaelSchoebel it will.\nI guess I could make it a configuration settings to ignore the userAgent to make the fingerprint more durable.\n. That's right\n. @darshan047 thanks for the PR.\nIt breaks backwards compatibility, because currently the screen resolution is always [height, width], so your code will return new fingerprint in portrait. Please add new option screen_orientation (similar to screen_resolution) and enable your code only if this options is set to true. \n. thanks!\n. Yes, it's possible, of course. Fingerprinting is only ~90% accurate at the moment. That means that out of 100 random devices 10 fingerprints will be generated twice. You may want to combine IP address + fingerprint to get 100%\n. Hey @ipullrank,\nthanks for using the library. \nAs I understand it, cross-browser fingerprinting implies removing all browser-specific items and adding instead OS specific items, such as installed fonts. I don't understand why they still list installed browser plugins and the user agent usage on their website. Please clarify it.\n. No, no plans for this, sorry. This will remain a strictly browser fingerprinting library. For cross-browser (i.e. user) identification please try commercial products, such as augur.io\n. Could you please elaborate on your question?\n. Hi @drstyv,\nThank you for using the library.\nTo look into it, more details are needed.\nI'm currently on chrome and my FP is 3635934679\nPlease let me know the OS and chrome version you're having issues with.\nThanks\n. @jordii thanks, my chrome version is exactly 42.0.2311.90 (64-bit)\nI'm looking into it now.\n. @jordii, you have two different UserAgent strings in your example. Are the fingerprints different for these two browsers?\nI've just looked into FP generation on my laptop (Chrome 42 + latest OSX), everything seems normal:\n\"[\"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_3) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/42.0.2311.90 Safari/537.36\",\"en-US\",24,\"1200x1920\",-180,true,true,true,\"undefined\",\"function\",null,\"MacIntel\",\"1\",\"Widevine Content Decryption Module::Enables Widevine licenses for playback of HTML audio/video content. (version: 1.4.7.796)::application/x-ppapi-widevine-cdm~;Native Client::::application/x-nacl~,application/x-pnacl~,text/html~;Chrome PDF Viewer::::application/pdf~pdf;Shockwave Flash::Shockwave Flash 17.0 r0::application/x-shockwave-flash~swf,application/futuresplash~spl;Chrome Remote Desktop Viewer::This plugin allows you to securely access other computers that have been shared with you. To use this plugin you must first install the <a href=\\\"https://chrome.google.com/remotedesktop\\\">Chrome Remote Desktop</a> webapp.::application/vnd.chromium.remoting-viewer~;Chrome PDF Viewer::Portable Document Format::application/x-google-chrome-pdf~pdf\",\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACWCAYAAABkW7XSAAAYtklEQ…ypGJQESIDCYg+QAAkoQ4DCUqZUDEoCJEBhsQdIgASUIfB//dQeHsm1b7QAAAAASUVORK5CYII=\"]\"\n. @drstyv , @jordii , got it, I'll test it on windows with the latest chrome and will look into my own database too. Please add any information to help me debug the issue, it'd be very helpful\n. @jordii are the above keys from the invalid (common) FP or just from your browser? Can it be that for some reason a lot of Brazilian people have same OS + Browser setup? Like brand new Chrome (with default plugins)?\n. @jordii @drstyv I've found the reason: https://threatpost.com/google-shuts-off-npapi-in-chrome/112295\nChrome disabled NPAPI plugins in version 42\n. If I enable npapi in chrome flags and restart Chrome, the plugin string will become:\n\"Widevine Content Decryption Module::Enables Widevine licenses for playback of HTML audio/video content. (version: 1.4.7.796)::application/x-ppapi-widevine-cdm~;Native Client::::application/x-nacl~,application/x-pnacl~,text/html~;Chrome PDF Viewer::::application/pdf~pdf;Shockwave Flash::Shockwave Flash 17.0 r0::application/x-shockwave-flash~swf,application/futuresplash~spl;Chrome Remote Desktop Viewer::This plugin allows you to securely access other computers that have been shared with you. To use this plugin you must first install the <a href=\"https://chrome.google.com/remotedesktop\">Chrome Remote Desktop</a> webapp.::application/vnd.chromium.remoting-viewer~;Chrome PDF Viewer::Portable Document Format::application/x-google-chrome-pdf~pdf;Default Browser Helper::Provides information about the default web browser::application/apple-default-browser~;Google Talk Plugin::Version 5.41.0.0::application/googletalk~googletalk;Java Applet Plug-in::Displays Java applet content, or a placeholder if Java is not installed.::application/x-java-applet;javafx=8.0.31~,application/x-java-applet;version=1.4~,application/x-java-applet;version=1.2.1~,application/x-java-applet;version=1.2.2~,application/x-java-applet;version=1.3~,application/x-java-applet;version=1.8~,application/x-java-vm~,application/x-java-applet;version=1.1.1~,application/x-java-applet;version=1.2~,application/x-java-applet;version=1.7~,application/x-java-applet;version=1.4.1~,application/x-java-applet;version=1.1.2~,application/x-java-applet~,application/x-java-applet;version=1.1~,application/x-java-applet;version=1.1.3~,application/x-java-applet;version=1.6~,application/x-java-applet;version=1.4.2~,application/x-java-applet;deploy=11.31.2~,application/x-java-applet;version=1.3.1~,application/x-java-applet;jpi-version=1.8.0_31~,application/x-java-applet;version=1.5~;Google Talk Plugin Video Renderer::Version 5.41.0.0::application/o1d~o1d\"\n. So, the only advice I can give is to upgrade to fingerprintjs2, it has more FP sources (fonts/webgl) and more will be added over time. I don't know if anything can be done here with Chrome and 1st version of FP\n. @drstyv I don't think so, because nobody has started using it seriously (yet), I'll be working on it in the upcoming weeks. But currently it has more FP sources than version 1. As for stability - it's not well tested yet. To be more correct, I don't yet know if FP2 is better, because I haven't started using it yet seriously. \nIt also has optional Flash dependency (recommended) to enumerate all installed fonts\n. @drstyv, I don't, I'm working on it alone and I don't have much spare time\n. @lucasas . We've been having FP2 on prod for several months, no issues, so you can start using it.\nThe only reason I'm not releasing v 1.0 (yet) is the hard to fix FF behavior - it's very slow on FF on Android. The reason being the font detection with JS. I will fix it this month (I'll try very hard at least). By default, only like 50 most common fonts will be detected, and about 450 less common will be detected if passed a special flag. This should keep the font entropy, but be faster for most people.\nIf you're OK with lib being slow on FF+Android (500ms .. 5s depending on hardware), you can start using it in prod now. If you want a faster version, then you can either wait while I muster courage to implement the FF improvements or.. submit a PR to help me there. \n. @lucasas I've pushed v.1.0-rc1 of FP2. Please have a look at it. I plan to make it v.1.0 release in a week or so if it will have no issues on prod.\n. Since this is not a bug, but a fundamental deficiency of the library, I'll close the ticket. Issues like these should be discussed and solved in the FingerprintJS-2\n. Hi @yelled3 \nYou can substitute the hashing function easily and use 128bit one.\nUnfortunately I don't have much spare time, so I can only fix bugs in FP1. Whenever I have some free time, I try to develop the FP2 library.\nThanks\n. Oh, @yelled3 thanks for the PR. Unfortunately we cannot just replace the hashing function, because it will break other people fingerprints. Neither can we have 2 hashing functions in the library.\nSo I can't accept your PR.\nYou have 2 options: either use the 128bit hashing function externally (which FP1 allows to do), or use your own fork.\nThanks!\n. thanks!\n. Hi @SaberDevel. If OSes are identical and IE versions match, the Fps will be identical, that's normal.\n. Thanks!\n. Hi, \nThere is a configuration option for this. By default it's disabled. Please see lines 64 and 79\n. Yes, you can save the canvas.toDataURL in a variable here: https://github.com/Valve/fingerprintjs/blob/master/fingerprint.js#L278\nand paste the variable value into the browser address bar. The browser will render the URL as the image.\n. Hi @AungHlaingWin , I don't save fingerprint on your computer. It's not possible for me to save anything on your computer.  You should modify the source code of the library to save the canvas in a var.\nvar image = canvas.toDataURL();\nThen you can view the image variable in the developer tools debugger and click on its value. The browser will load the image in a new tab. Tested on Google Chrome\n. I recorded a short video showing how to do it.\nhttps://www.dropbox.com/s/vs4poviqiybsbxr/how%20to%20view%20image.mov?dl=0\nDownload it it should be clear what to do there\n. Seems like you're serving the file separately. uBlock has a rule for this:\n/fingerprint.js\n/fingerprint.min.js\nJust try to rename the file and it should work fine. If it won't, rename the constructor function (thus obfuscating it) and it should work.\n. @lexoyo thanks for letting me know. \nI've never used 'require' so cannot comment on this. Please feel free to contribute :)\n. Please let me know how to reproduce the issue, I cannot do it\n. No there is no chance of that, it has no access to host and does not depend on the page content.\nPlease compare the fingerprinting components that are generated in both cases and find the one which is different. This way I will be able to diagnose the issue further\n. I'll close the issue for now. Please feel free to reopen with a detailed instruction of how to reproduce it.\nCurrently the issue cannot be reproduced following your description.\n. @sundarseswaran, Thank you for using the library!\nIn your case, it may be that you have zoomed out (made everything smaller) for one of your websites where you're having this weird 1.79999 pixel ratio. Please verify the zoom level and let me know if it can be reset with Ctrl+0 and if it fixes the issue.\nAs a side note, zooming the webpage is really hard for FP - it's one of the hardest bugs for the library that I know of, I currently have no working solution for this.\n. Please see first point of this FAQ: https://github.com/Valve/fingerprintjs2/blob/master/FAQ.md\nFor identical devices fingerprints will be identical.\n. Please let me know what is Xilium. The library is for browser fingerprinting, not for PC identification. It should work consistently in the same browser, not across different browsers.\nClosing now.\nIf you have the library returning different results in the same browser, please submit a full issue with browser version, operating system and the component that is different for you.\n. thanks for letting me know, will look into it. thanks for letting me know. Which line throws the error? Are you using the latest version of the library?. you're using the minified version, it's a one-line file. You need to use full, unminified version to get the line which throws the error. No, there is no such project. C# will not work natively in the browser, because browsers require JavaScript to work so the only way to have this working in C# is via a transpiler.. I think this function is not necessary. If I rename the fingerprint.js to something else, like fp.js and reference the script in this way, I will get http://localhost:8888/undefined/flash/FontList.swf.\nI think that the default url for swf should be /fingerprint/FontList.swf with ability to override it via parameter (as you already have).\nWhy such default path? Since fingerprint is a bower package, all distribution files will be in fingerprint folder.\n. This is somewhat ugly, what would you say about this:\n1. Make a current property on Fingerprint function and set it to this before options parsing, something like:\njavascript\nFingerprint.current = this;\n// and then options parsing\nif (typeof options == 'object'){\n      this.hasher = options.hasher;\n      this.screen_resolution = options.screen_resolution;\n...\n...\nAnd then call the swfReady on current instance: \njavascript\n      var flashvars = { onReady: \"Fingerprint.current.swfReady\", swfObjectId: this.flash.id };\nThis approach will not create this new global object.\n. Consider above approach with current property.\n. ",
    "AnSavvides": "Ah that makes sense - if you are happy with the other changes I will revert\nthat back and add a comment instead to explain why that's the case.\nOn Aug 1, 2013 5:41 PM, \"Valentin Vasilyev\" notifications@github.com\nwrote:\n\nI used non-strict equality with null to shorten otherwise lengthy obj ===\nnull || typeof obj === 'undefined'\n—\nReply to this email directly or view it on GitHubhttps://github.com/Valve/fingerprintjs/pull/6#issuecomment-21950042\n.\n. Should be good to go now!\n\n:+1: \n. ",
    "sikjoy": "\"After plugins and plugin-provided information, we believe that the HTML5 Canvas is the single largest fingerprinting threat browsers face today.\" - Tor Project. Original research: Pixel Perfect: Fingerprinting Canvas in HTML5, demo: HTML5 Canvas Fingerprinting.\n. I don't think orthogonality implies that it should be used independently, rather that it is statistically independent. This is a good thing, in that the net gain in entropy, by adding the technique among the other tests, is the full amount, as measured, if the technique were applied by itself.\nLooking at the Pixel Perfect whitepaper, they did a small scale experiment with 294 tests which yielded 116 unique fingerprints despite having very little variation in browser and OS. They say this translates to an entropy of 5.73 bits, which is comparable to the entropy gain of the http accept test, which I believe you are currently using.\n. ",
    "prismspecs": "Valve, is it possible to save the image generated by canvas fingerprinting with this?\n. ",
    "tanuj-github": "Valve, how can we use the users information for creating images in canvas?\nI have seen many examples but those all are using some predefined values. I am still unable to understand that how can they differentiate users on these values.\nPlease help...\n. Thank you Valve for replying immediately...\nI am implementing device fingertprinting first time and I have studied we use user machine information like User Agent, App Name, App Code Name, App Version etc which we could get using Java Script.\nSo my question is how to create canvas image using this information?\nAnd how can we utilize that in Canvas Fingerprinting?\n. That means the image created this way itself contains the all information that we needed to identify a user machine over a network and we just need to store hash coded value in our database?\n. Thank you Valve.. This information would be very helpful for me.\n. Hi Valve.\nI am done with Canvas fingerprinting but each time I make change in browser config [like changing resolution, browser language setting etc] It is giving me a different hashcode. Then how can we identify a user uniquely?\n. ",
    "simonpucher": "Thats fine, this is how it works ;)\nMaybe this link is interesting for you: https://panopticlick.eff.org/browser-uniqueness.pdf\nYou should use canvas fingerprinting additional to other techniques like IP, Cookies, and so on.\n. The Fingerprint library works on every device if there is javascript enabled for the browser. Of course it can suppressed by disabling javascript or using a browser extensions like noscript. EFF did a pretty good overview on this you can find it here: https://panopticlick.eff.org/self-defense.php\n. ",
    "perwoll": "Privacy Manager from Ivan Iovation is what we have been looking for for many years.\nThis solve almoust any fingerprints, including canvas.\nIt is a manager for your own privacy that change everything in a natural way. so no more unique tracking are prossible.\nThey even change the graphics of the computer and hardware footprints.\n\n. Yes, is a software that solve all fingerprint problems not solved in the past. \nIt is a new pilot product from ivanovation.ro.\n. ",
    "AdKiller": "@perwoll what is this you are spamming about? closed source addon, with no reputation that costs $199 per month?!?!? . @perwoll ok but $199 per month?!? Does it cure cancer too? . ",
    "andreypopp": "That was fast, thanks!\nP.S. Cool username!\n. ",
    "NiftyXXL": "I had out of 3180 Fingerprints (all types of browsers except mobile ones) at least 26 Collisions from IE10 Users.\nMy logging is not detailed enough to give much more Information.\nIf you tell me exactly what you need i can try to get it.\n. I don't know the exact numbers. This fingerprints were collected over two days. The 26 Collisions where all the exact same fingerprint. I can identify the single Users as they have accounts on my website and i only check known Users.\nI have usual ~ 11.7 % IE10 users.\n. Would it be of any help for you if i log the sample keys before they go to the hash function ? It's not a big deal for me.\n. Ok, give me a few days.\n. Ok, i got the data.\nHere are 3 different Browsers, they all report exactly the same data:\n( It is a tar file including 3 Textfiles)\nhttp://ul.to/b4hhqhgo\n. Hey, thaths  good news.\nMany thanks.\n. Many thanks for your hard work & time. I will give it a go.\nRegards\n. Do you have a clue how much collision might be coursed by the hashing algorithm ?\nI have a identical fingerprint for a Firefox running on Linux and one running on Windows. I don't have more details on this, but this should never happen. I am running on 0.5.0\n. Yes, fingerprinting on IE10 works.\nMany Thanks\n. ",
    "jimaek": "Great job on the library. Consider using jsdelivr.com too.\n. ",
    "levipage": "Thanks for the quick turnaround. love this tool. Will give the new version a shot and let you know if I experience any issues.\n. Not to invade on the conversation but are you using any google fonts, font face, typekit or any javascript library on one page vs the other\n. Just a small suggestion.. i would be nice if when releasing new versions if you also included a .min version. It would say each person from having to minify it. I use a uglify tool online, but anyway would be a nice to have. \n. If you read the exploit information, you can see that this is a false positive. Does it happen with both the minified and un-minifed version? It could be that the Fiesta kit mentioned in the exploit used the fingerprint library or has code that is similar in some way. I would imagine that Microsoft could be contacted as this shouldn't be happening. If it can't be resolved, I don't see how anyone could use the library. I'll have to remove it from my product if this is really the case, which would be a huge shame. I could see someone submitting a script that is using it and microsoft marking the whole script as malware. This would be horribly bad for me.  i wonder if you changed certain aspects of the script if it would no longer be detected. Typically it will try looking for variable names, creating hashes, and looking for various patterns to identify a particular script. Fiesta kit is highly randomized which is why it's even weirder that this is being mistaken for it. \n. Do we know if there was any resolution on this issue?\n. Making jquery a dependency is a huge step backwards. It would make it unusable for us and probably others who don't want the bloat of jquery. One of the biggest complaints about SignalR for example is the use of jQuery and I think more and more people are moving away from it (including SignalR which has this in the works). I think the biggest initiative IMO should be resolving the security error from the Microsoft Security Essentials that was reported previously. I have discontinued the use of the fingerprinting for the time being because the risk of losing customers over the spyware notification is too great. Of course approving the uniqueness of the fingerprinting is always a plus and I assume this is your goal. I think the biggest weakness with the fingerprinting is in the mobile arena and it would be nice if there were ways to approve upon this. We had the fingerprinting disabled for mobile even when it was in use because of the lack of uniqueness in mobile builds and user agent strings.\n. That is good to hear. Looking forward to updates.\n. I think without the useragent you will have lots of duplicates, making it somewhat meaningless but not a bad idea if someone wants it. I think the thing to do would be to add setting to ignore browser version and make even add some setting to look at first X numbers of ip address, but if they drastically switch locations even prefix could change.\n. That only applies to mobile and I would say it is more unique than that. For desktop you are looking at more like 1 in 250,000 chance of duplicate. This is from general study and may not be the same for this tool. In my own uss I filter out mobile and use with desktop for great results.\n. ",
    "calh": "Thanks Valentin!  I'll work on these fixes in the next week or two.  \nI had skipped the tests because I had a problem with phantomjs on my older Ubuntu distro.  (It was phantomjs v1.4)  It gave me an error \"Can't open lib/phantom-jasmine/run_jasmine_test.coffee\", even though the file was there and the permissions were correct.  After upgrading to the latest 1.9 it seems to work correctly now.  \nOnce I get back to this project, I might ping you with a few annoying questions, if that's okay.  Javascript isn't my strongest language.  ;-)\nThanks!\n--Cal\n. No sorry. I've been swamped with other projects and haven't had the time to\nwork on this.\n. Sure, if you care to take a crack at it.  At this point I don't think I'll get to dedicate some time to this for another 2 - 4 weeks.  :-/  So feel free to just close it if you want, and I'll just submit a new pull request at some point in the future.\n. A couple extra dependencies are required, so I'm not sure if that's a deal breaker for you.\n. callback function is also compatible without using flash, so the API docs could altered to always use a callback.\n. Inspiration and examples for the Flash app has been shamefully stolen from @gabriel's font-detect-js\n. ",
    "jcastilloa": "I have a ecommerce website with huge load of javascript. I don't know the reason, but I'm getting a different device fingerprint depending of page (for the same browser). \nThe canvas fingerprint is different, and the problem is solved using Arial 18px instead Arial 14px :\\\n. @levipage: no, we aren't using google fonts. The javascript should be the same, I must check it with frontend staff.\n@valve: yes, tomorrow I'll post one console.log of all parameters.\nwhat kind of js library could affect to canvas draw?\nThanks for your help friends.\n. ",
    "ghost": "Version 0.5.2, and Windows XP (in a virtual machine that I use for compatibility testing.)\n. ",
    "xquezme": "javascript\nwindow.localStorage is not available in packaged apps. Use chrome.storage.local instead.\n. If you read localStorage property, Chrome throw error, therefore cast to boolean (!!) not working.\n. Sorry, Chrome treat this like not a real error and show simple error message via console.error. My bad.\n. ",
    "thegyppo": "I submitted a report here earlier: http://www.microsoft.com/security/portal/developer/contactus.aspx\nBut this was for our own Javascript file, before we removed fingerprint.js which stopped the file being marked as a virus.\nHope this helps.\n. ",
    "lukaszklis": "@Valve Hey, I've bumped up the version in bower.json. If you could push the tag, it would be great. :)\n. @Valve I think I forgot to bump the version in the source file\n. ",
    "petard": "Hey,\njust started using fingerprintingjs and one of the biggest pros for me is that it has no dependencies. So, if possible, it'd be great if you could make v2 work without any dependencies, keeping it lightweight as it is.\n. ",
    "thelinuxlich": "+1\n. Doesn't a paper states that the canvas identification alone is enough for identification?\n. ",
    "firetix": "+1\n. ",
    "theseyi": "+1\n. ",
    "argent-smith": "+1 \n. ",
    "garrettwilkin": "+1\n. ",
    "atlantis3001": "+1\n. ",
    "tpiron": "+1\n. ",
    "msedv": "+1\n. ",
    "jordii": "+1\n. Hi, i'm seeing the same issue with the latest chrome version.\nI have several false positives with these user agents:\nMozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/42.0.2311.90 Safari/537.36 \nMozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/42.0.2311.90 Safari/537.36\nEverything seems to be related with the release of the chrome 42 one week ago.\n. We have a lot of traffic, and we saw the increase in the matches since 18th april.\nWhen i test on my computer or a colleague (Chrome 42 + latest OSX) we can't see any problems. But when i look into the database (where we store the user agents, the fingerprint code and more data), i have several matches from users with different ips (From different countries like BR and MX), we called some of them and they are different people.\nThe only thing in common it's the user_agent, i posted two user_agents because that's the two user agents with most of the matches. (Each one separatedly)\n. @Valve Ok, i just logged the keys value i got in the fp, it's here:\nhttp://pastebin.com/mSjLtDwJ\ni search the user and i have a lot of matches since 18th april (like 1000 all from brazilian ips)\nIf it helps too, I'm calling the same way @drstyv  does.\n. @Valve from the invalid one\n. ",
    "max107": "+1\n. ",
    "maceip": "+1\n. font sniffing is a must, also anything else in here you can implement: http://www.chromium.org/Home/chromium-security/client-identification-mechanisms, https://seclab.cs.ucsb.edu/media/uploads/papers/sp2013_cookieless.pdf\n?\n. one more link that may be relevant (most importantly HTTP header order):\nhttp://engineering.shapesecurity.com/2015/01/detecting-phantomjs-based-visitors.html\n. ",
    "Techmind": "+1\n. ",
    "MichaelSchoebel": "User-Agent string changes with version-upgrades of the browser. Will that change the fingerprint? Version-updates happen pretty often...\n. ",
    "arjunmenon": "I think this should be complemented with cookies and other identifiable system properties.\n. ",
    "darshan047": "@Valve  added screen_orientation as an option as you suggested.\n. ",
    "BobSmithJoe": "This does not work properly at the link provided (try it in two different browsers), but I would love the ability to track users across browsers. Any plan on adding that?\n. ",
    "nadien": "I going to buy a device (ZTK LX50), do you thing this device works with fingerprintjs?, i don't know to much about this.\n. Well, i think the best way is try this myself, i will use this package and see what happen.\nThanks by the way.\n. ",
    "drstyv": "@Valve i am not a developer, i just use this great product on my website(browser fingerprint).\nBut i can tell you my website has over 50.000 unique visitors per day and this has been working great without any issues until a week ago i think.\nIt seems that quite a few Google Chrome users now get same browser fingerprint.\n. @Valve dont know if this helps but i am running these options on the fingerprint:\nvar xxx = new Fingerprint({canvas: true,ie_activex: true}).get();\n. @Valve any way you can do anything to improve the Google Chrome Fingerprint?\n. @Valve Is the fingerprintjs2 good enough now to start using over fingerprintjs1 ?\n. @Valve Do you have an estimate when it will be tested and ready?\n. @Valve ok thanks for the update, i will be looking forward to testing the new Fingerprintjs2 when it is ready!\n. ",
    "lucasas": "@Valve do you have any idea when version 2 will be released? Thanks for the great job.\n. ",
    "yelled3": "\nit will break other people fingerprints\n@Valve that's a good point\n\nthanks\n. ",
    "AungHlaingWin": "Hi Valve, I don't understand how to past which variable to canvas.toDataURL. I meant I don't understand how to save fingerprint on my computer. Please, can you show me a full sample code.\nThank you very much!\n. Hi Valve, \nI know that you cant save finger canvas image to my computer.\nI meant that I want to save finger canvas image to the same path using fingerprintjs2.js.\nBut I don't know how to modify the functions to save finger canvas image as png type.\nCan you support me with full source code?\nAnd do you mean as following : \nvar image = canvas.toDataURL(\"image/png\");\nIs it right??\nAnd whare can I save that canvas png image ?\nThank you!\n. ## I added img element with id = 'mirror' as follow.\n\"  \"\nAnd I modified as you say.Then attach canvas image with img element.\nvar image = canvas.toDataURL(\"image/png\");\nmirror.src = image;\n\nThen I can see canvas image. But that is not a fingerprint image.\nI captured that image. \n. ",
    "lanbin": "Thanks for your suggestion.\n. ",
    "lexoyo": "Ok thx for your reply\nI will contribute if I it turns out it comes from Fingerprint\n. ",
    "pskd73": "I am not sure it happens again. But if it's happening on my browser. Any how I can explain what I have done. I have a page where I were fingerprint and store the browser information. I have another scenario where my customers get JavaScript file from my site. I have written the JavaScript file in such a manner it takes the fingerprint and sends the browser info to my servers. So now it is working fine. It is giving same fingerprint in both above mentioned methods. But on one of my pc it is giving different fingerprints on sand browser. \nIs there any chance that fingerprint will get changed on the basis of host, content of page??\n. ",
    "sundarseswaran": "@Valve - fingerprintjs2 is really awesome started using this for one of our projects.  kudos to the maintainers!!\nHad few inconsistencies with the fingerprint retrieved for the same website. The fingerprint was obtained within the angularjs service was different from the fingerprint calculate when module was loaded with in <script> tags on a plain html. I added the below exclusions to receive a consistent fingerprint.\n{excludeJsFonts: true, excludeFlashFonts: true, excludeAvailableScreenResolution: true}\nI have tried to explain the current issue I'm facing, in the below screenshots. It is very similar to the issue you guys have discussed above.  Same code when executed in production provides a fingerprint that is different from the fingerprint calculated in a lower environment with different domain name.  I was trying to understand the root cause for this issue and stumbled on a weird problem where -- window.devicePixelRatio -- one of the parameter for fingerprint calculation returns an unexpected value even from the browser console. \nI am running a MacBook Pro (Retina, 15-inch, Mid 2014),  the value for devicePixelRation should be \"2\".. whereas only under my production domain name I get a value of \"1.7999999523162842\". I am not sure if the fingerprintjs library can do anything about this. Of course, the problem can be addressed changing the getPixelRatio() function as below. But, I am still struggling to understand the root cause for this issue. Could be a Chrome browser issue, I don't see this issue in other browsers.\ngetPixelRatio: function() {\n      return  Math.round(window.devicePixelRatio) || \"\";\n    },\nPlease take a look at these screenshots.  Let me know if there is any further information that can help you unravel the mystery here.\n\n\n. @Valve -- thanks a lot for your quick response.  this is awesome! I never knew this before.\nAgain, its a great library!!\n. ",
    "julia-r": "Yes, I am using the current version (0.5.4). It also happens on your demo page \n\n. Sorry for answering so late. I took a look at it again today and I figured it out: I was using an older version of fingerprint.js. The error was fixed with this commit https://github.com/Valve/fingerprintjs/commit/04c1f8bad3562d7b3675c8c12a87f9b76b18d0df#diff-d4b3d5a1199f9d57ac7b407efb819c93 \nIt was a bit confusing, because it has the same version number... Anyway, the latest version seems to be working fine now :). ",
    "chrisparnin": "This may be related to antivirus:\n\n. ",
    "varunjoshi12": "@Valve . "
}