{
    "wbotelhos": "Fixed by commit: http://github.com/wbotelhos/raty/commit/e75919630646f6305294971f3853bc6af09c975f\n. Fixed by: http://github.com/wbotelhos/raty/commit/9a88264236848d481999f0b0f8861ccabad77834\nIf it's ok, then close the issue for me please.\nThank you. (:\n. It has been fixed in the new version:\nhttps://github.com/downloads/wbotelhos/raty/jquery.raty-0.9.zip\nIf it's ok, then close the issue for me please.\nThank you. (:\n. The idea of ID I use in jQuery Stepy, so I took and made the selection to class also, as you suggested.\nI had never tried to use the public functions within the callback, and it seems a little unpredictable behavior within the each(), but with the selector option in the new version I hope to solve your needs:\nhttp://github.com/downloads/wbotelhos/raty/jquery.raty-1.0.0.zip\nThe example test it:\nhttp://wbotelhos.com/raty/index.html#target-demo\nIf it's ok, then close the issue for me please.\nThank you. (:\n. Oi Sidney,\nNão tenho planos de trocar o uso de img por CSS.\nO plugin de voto não tem muito o que alterar via CSS. Tirando o ícone qualquer coisa pode ser alterada. O que você gostaria de alterar como aparência?\nUsar CSS também obriga setar o caminho no background: url('..'), além de ser mais difícil controlar o sprite do que trocar um ícone.\n. Hi Redani,\nCould you please write these questions in this post [1]?\n[1] http://www.wbotelhos.com/2010/07/14/jquery-raty-a-star-rating-plugin\nThanks. (:\n. Hi mersadk,\nI was procrastinating this feature until someone actually need.\nClosed by commit of version 1.3.0:\nhttps://github.com/wbotelhos/raty/commit/b29e54e0324938e389208c40aaa07b206ee365e6\n. Hi afeld,\nAll actions are made by ID, even it not exist, because Raty create it.\nFor ignore the ID the only way is keep the element selection, but it is impracticable.\nUnless using Widget technique to keep the states. But change that would create another plugin. So I suggest to use the HTML elements in the right way instead of bypassing the bad practice within the jQuery Raty.\nDo you have any idea how to do this without problems?\nHugs.\n. Hi ecool2011,\nClosed by commit of version 1.3.2:\nhttps://github.com/wbotelhos/raty/commit/62cbe8bea9de76b8dcbaaa020c92738d753a782f\n. Merged, thanks. (:\n. Hi mrchess,\nUsing the selection by id or class you can use children() to get the input value.\nI don't know if is clearer make a public function like: $.fn.raty.getScore('#big'); instead to do: $('#big').children('#big-score').val();\n. If you have some good ideas, please, fork e push it. (:\n. I'm developing some new features including visualization of the vote.\nIt'll be available in version 1.4.\nThanks.\n. Hi mrchess,\nRaty use <img /> and one <input type=\"hidden\" /> to keep the score, and it initialized just if you set the start option.\nCan you give me an example? Because the one on site [1] works fine.\n[1] http://wbotelhos.com/raty/#fixed-demo\n. Hi Yakuplpek,\nCould you try with this version [1] and jQuery 1.5.1 please?\n[1] https://github.com/wbotelhos/raty/blob/b0a9cf74b8b41bc07a51b367b50a255e09db7b4e/js/jquery.raty.min.js\n. Hi denisq,\nThis solves your problem [1]?\nhttps://github.com/wbotelhos/raty/blob/d164a9e94acbeb9e27e8afd5be54fccf523e4217/js/jquery.raty.js\n. Hi piernik,\nCould you use the snapshot [1] to see if it solves your problem?\n[1] https://github.com/wbotelhos/raty/blob/99089098a452f61354422e48e40d479aa7785372/js/jquery.raty.js#L452\n. Hi Jangla,\nUse the version on the repository [1].\nIt was fixed by this [2] commit.\n[1] https://github.com/wbotelhos/raty/blob/master/js/jquery.raty.js\n[2] https://github.com/wbotelhos/raty/commit/f1b8553834f74ae9fb12b078acd9c45ba92d1d64\nCould you test it?\nThanks for the issue.\n. Hi roryhutchings,\nFor all I know, there is no way to check if the stream of the image is available or not just with JS.\nAnd change the image automatically can confuse if the path is correct and pointing to the default icon or Raty that do it.\n. Hi grisevg,\n- There is no way the ID to be null, because there is a rule, #L49, that creates an ID for the element if it does not exist;\n- This was a change I would make, good job;\n- Useful for what? If it is hidden the only use would be to take the value of multiple fields at once, but you can just to use the class of the Raty container;\n- Good job with the trim, I hate it too;\n- I prefer let it available for anyone to download and not bother compress the script. I also do the minified with some settings to avoid syntax errors as we see in the jQuery script.\nDo that changes and we merge it. (:\nAnd please, don't let unusual and commented code.\nThanks.\n. - The ID is declared at #L46;\n- Strange the plugin requires a class and don't bind by ID, but ok. I think it'll help someone;\n- I prefer give the two option, full and minified.\n- And I was thinking about error message. It is better throw it locally and let the function message to log warnings and messages help.\n. Hi grisevg,\nWe have jQuery.error and I think it is a good method.\nIf you want put your feature scoreClass, please, close this pull request, update your repository and make another pull request. This week I'll release the version 2.0.0 using closure and will be a big change. \nThanks.\n. Hi hpgihan,\nGood work!\nThanks!\n. Done!\n. Hi Konrad,\nFirst all, thanks for the path.\nBut why not just decrease the Raty container to make it break the row?\nTo make this break is not required <br/>, the div will to that, and you can use the width option to do it.\n. Hi pcout,\nI did not see problem. To keep the value in the target you need to use: targetKeep: true\n. Hi pcout,\nI could not find your problem.\nI did an example here: http://www.moviecollection.com.br/lab/raty\n. If Raty is read-only then read-only it will be.\nTo change the value you must turn off the read-only first.\n. Hi felix,\nMaybe your r.rating is a float value, because it worked here:\nhtml\n<div data-rating='1' class=\"detail_item star\"></div>\n<div data-rating='2' class=\"detail_item star\"></div>\n<div data-rating='3' class=\"detail_item star\"></div>\n``` javascript\n\n    $(function() {</p>\n<pre><code>    $('.star').each(function(el){\n        $(this).raty({\n            readOnly:   true,\n            start:      $(this).attr('data-rating')\n        });\n    });\n\n});\n</code></pre>\n<p>\n```\nYou can bind Raty direct and get the start value by callback like this:\njavascript\n$('.star').raty({\n    start: function() {\n        return $(this).attr('data-rating');\n    }\n});\nBut I see we have a issue on jQuery.index() where you can't use more than one class, then you should use just the class star. If you want put more style on it, do it by the class .star.\nAnd you have a left parenthesis in your code.\n. Hi deGir,\nIn fact the hintList is just the attribute alt of the img tag, then it can be just one value. Change it sequential values (1, 2, 3, 4 and 5) crashs the plugin, because this values is used to fill up the star on mouseover.\nI have the idea of to build a tip above the star on mouseover, but it will let the plugin larger 8k minified.\n. The version 2.7.0, now supports it.\n. Merged, thanks!\n. Hi croshchupkin,\nshowHalf options is enabled for default and it works for me.\nBut if you wants enable the half selection you must enable it: half: true.\nIf you have an example or wants to send a test to break the code, please, re-open it.\n. Hi mersadk,\nThe action is from Raty to the element, not the inverse.\nIf you want to that, use $('#star').raty('click', 2); when you change de drop down.\n. Hi amandoi,\nWe don't have the 'raty' method at all.\nWe can call $('#star').raty('some-real-method'), but not $('#star').raty('raty').\nIf you have some problem, please, re-open it.\n. Hi,\nIf there is no method .raty then the plugin was not imported right.\nMaybe it was lazy, maybe the link is wrong, maybe the code was called earlier.\n. I can't see any problem on your code.\nTry the minor possible like:\nhtml\n<div id=\"star\"></div>\njs\n<script>\n  $(function() {\n    $('#star').raty();\n  });\n</script>\n. The problem is on your application files, but is hard to me to say what is.\nI think you should put your scripts before your close tag </body>, not outside html.\nIf you're calling Raty into that php/jquery function, then it will raise the error, because the jquery files is loaded after. Move it to the final of your body.\n. Check your page source and click on jquery.raty.js link and check if it will be opened.\nI think your import is wrong.\n. Try to use the demo page, change the extension and put your stuffs each peace at once.\nBut I'm sorry, I don't know how to help your more than this.\n. Good job packowitz,\nApplying it!\nThe next time you can do a pull request. :D\n. Hi maddhacker24,\nRaty can't do that automatically because it is a especific case.\nThe best thing to do is you handle the selected score and change it by your own.\nThe values on Raty must be sequential to it know how star select or not.\nIf you have more doubts, please, post on blog.\n. Merged, thanks! (:\n. Hi jacobwg,\nI was migrating the blog to another server, now it's up.\nThanks! (:\n. Yes Landish,\nWe'll be down for a while.\nI want to pay a server and create an exclusive area for the plugins.\nSorry!\n. No, there isn't. But you can change the icon and set the score inside the callback click.\n. Hi shadowfax,\nThe hints are alt tag, then it is one per star.\nWe can't change the sequence, because Raty use it to calculate a lot of things.\nI want to do a feature to show real hint like a pop up and let alt do it job: 1 2 3 4 5.\nIf you have some ideia of how to take off this dependency of the alt attribute let me know.\n. Good idea shadowfax,\nCould you add some specs for that feature and do a pull request?\nFor minified use http://refresh-sf.com/yui and please, check the option: \"Preserve unnecessary semicolons\"\nAnd remember that you cant change the original score, you must keep the score/title value into other variable, because the hidden field must keep the original value not the ceil.\n. Hi seiyria,\nThis issue still opend because will code it, but I'm kind busy for now with my startup.\nBut it will be out soon.\n. The version 2.7.0, now supports it.\n. Just the pointer is a doubt and it was discussed and changed a long time ago.\nMaybe use pointer on wrapper only when using precision can be a good ideia.\nTry to do a pull request just with the cursor change and we review it again.\nThanks.\n. Hi @charlesjshort,\nThe browser will cache the image on the first fetch and then provide the cached image.\nWhat is the advantages of it?\n. But when we have the same URL the browser gets the cached image, not doing other request.\nRaty use icon to avoid CSS, it is the ideia.\n. Hi,\nTry to do a clean pull request, with specs.\nNow we have font support, then the code changed a bit.\n. Thanks @aprimadi,\nI will merge and add some tests.\n. Hi dannyroa,\nSemantically there is no way to vote as zero.\nThe minimum is half. A no rated star has the default state of an input element: no value.\nBut if you want set zero, change the lines:\nhttps://github.com/wbotelhos/raty/blob/master/js/jquery.raty.js#L64\nhttps://github.com/wbotelhos/raty/blob/master/js/jquery.raty.js#L398\nBut remember, you cant click on star number zero and the cancel button take off the value.\n. You can manually clear the value attribute:\njs\n$('.rating input').removeAttr('value');\nOr call the cancel function:\njs\n$('.rating').raty('cancel');\n. Hi havvg,\nCould you make a test to break the code and pass with this change?\n. Working on version 2.6.0.\n. Hi havvg,\nUse this link: http://refresh-sf.com/yui/\nAnd don't forget to check the option \"Preserve unnecessary semicolons (such as right before a '}').\"\n. Thanks havvg! (:\n. My blog throws 404 during the deploy.\n. Hi muratguzel,\nIn fact, most of the options could be started with callback. I will try to find a way of abstracting this code to prevent the code grow much because of this if.\nGood job with the Gem. @bmc has also created something cool for Raty, take a look: https://github.com/bmc/jquery-raty-rails\nThanks for your commit! (:\n. Hi Joseph,\nGreat feature!\nCould you add a test for it?\n. Hi @joe1chen,\nSorry about that, but passed 5 months and yoy din't write a test for it.\nI was already fixed.\nThanks.\n. By the way, your name will be on Contributors. (;\n. Hi @nickhoffman,\nTe attribute is setted just for the current object $this, it is not global.\n. Hi @nickhoffman,\nThe following commands brings differents values:\njs\n$('#default-demo').raty('get', 'score');\n$('#score-demo').raty('get', 'score');\nThe .data() sets the value only on element binded. Or I'm doing something very wrong.\nWrite some tests for break it and do a pull request, then I'll accept it.\nThe get feature is very cool, if you want do another pull request just with it and write a test for it I'll be glad.\nThanks again!\n. Hi @andreynovikov,\nEach image should have the altattribute and that pop-up is that alt attribute.\n. Hi @BeenaShetty,\nMaybe it is your connection loading the icon. Right?\n. If you execute the .appendTo Raty will works fine. But if you do .html() it is just a raw HTML.\nThe problems is the popover plugin, not Raty.\nhttp://jsfiddle.net/4FujN/14\n. Hi @Gillespie59,\nThis issue will be solved on next version that will be release, maybe tomorrow.\npath will be undefined by default and will be preppend only if you specify it.\nThanks for the feedback. :)\n. Closed by version 2.5.1\n. Hi @DouweM,\nSorry about that, but I did a better fix for it, but I don't push it yet.\nIt will be released on next version maybe tomorrow.\nAnyway I'll remember to put your name on contributors. ;)\n. You can't bind the Raty more than one time on the same .starRating.\nTry to bind one time outside the interval and than to use $('.starRating').raty('score', x);\nI can't test your code now, tonight I will try it.\n. You should bind just one time and use the function to change the score:\n``` js\nvar star = $('#star'),\n    i    = 1;\nstar.raty({ single: true });\nvar time = setInterval(function() {\n  star.raty('score', i++);\nif (i > 5) {\n    i = 1;\n  }\n}, 200);\n```\n. It sucks! :/\nThanks!\n. Hi @dxypher,\nDid you downloaded the laste version? 2.5.2\n. Hi @pmoda,\nThe version of jQuery 1.5.1 has not the on() function. And the similars were deprecated on new versions of jQuery.\nAbout the \"No Method raty\", the most time is problem of import or bind before the script is loaded.\nCheck it and tell me about, because on demo page, I'm using the minified version and works.\n. Hi @lastikas,\nGood code, thanks!\n. Hi @Patatouf,\nMake sure that the div is created before the bind and everything will works.\nCheck the image path too and take care to not bind the .raty elements twice.\nTo do a better test, use the Firebug, append a div on body and bind it.\nIt is the way I do my specs, and it works perfectly.\n. Call your $.ajax() without the Raty bind then open the Firebug and execute the bind. $('.raty').raty();.\nSo you can make sure the div is there and inspect the DOM to check the images.\n. The namespace raty was not found, maybe your import is broken.\n. Since raty already imported, it is ok.\n. Hi @bendanzz,\nUnfortunately not, neither jQuery will keep it.\nWhat is your problem? Maybe I can help you to do a hack to get it works.\n. Hi @sergicontre,\nAnd what is the problem?\n. The wrapper grew to fit your 30px stars, but you still using icons with 16px.\nhttp://jsfiddle.net/p7WCG/1/\n. Hi @ephraimb,\nThanks for your time! (:\n. Why not just get the value inside it?\nWe have a method for it or you can to use your own jQuery selector.\nWhat is the problem?\n. Thanks.\n. Hi,\nYou should call Raty only when data is on DOM.\n. Use the iconRange e choose your colored icons.\n. Hi,\nThanks, but without test and breaking other things I cannot accept.\nBy the way, you can just implements the replace on hints, like: {score} bad.\nI'll open a issue for it.\n. Thanks! (:\n. Hi,\nYou should block the next rating based on user login.\nCookies can be cleared or disabled.\nAnd it is a bouch of kbs that is not responsability of Raty.\nBut you can to use cookies if you want inside the callbacks.\n. Use the click callback.\nYou know that the cancel button was clicked when the score is null:\nhttps://github.com/wbotelhos/raty/blob/master/lib/jquery.raty.js#L123\n. Hi,\nNow you can prevent the default action, of set score, returning false, then you can do your own logic.\n. Thanks man! (:\n. The main focus of Raty is to use the image, not sprite, because sprite needs to use CSS, IE compatibility and so...\nRaty is about to keep the things simple, then we need the trade off.\n. I did not say it was a bad practice. (;\nI just said it is a choice of the plugin.\nAdd more options makes the plugin grows very kbs and make it lose it focus and purpose.\nThe purpose of Raty is work with image.\n. Hi,\njQuery Raty 2.6.0 now supports Fonts.\n. No, but you can set the selected score to any element you want. \n. It is not responsability of the Raty, but you can check via JS if has no score and then prevent the submit.\n. You do not need it, just put a ID on your div and do:\n$('#raty-number-1').find('input').val();\nBut you can use the Raty method:\n```\nvar el = $('#raty-number-1').raty();\nel.raty('score'); // It is the scoreName value.\n```\n. As I said, before you submit the form, just check if score is setted.\nhttp://jsfiddle.net/z67kR/1/\n. Hi,\nTake a look here: http://wbotelhos.com/raty#hints\nUse an empty string.\n. 1. You can to use the function $('.star').raty('readOnly', boolean); or use the readOnly as callback.\n2. Yes, it can be a good feature for all callbacks, try it:\n``` js\n, _bindClick: function() {\n  var self = this,\n      that = $(self);\nself.stars.on('click.raty', function(evt) {\n    var execute = true;\nif (self.opt.click) {\n  execute = self.opt.click.call(self, parseFloat(self.score.val()), evt);\n}\n\nif (execute) {\n  self.score.val((self.opt.half || self.opt.precision) ? that.data('score') : this.alt);\n}\n\n});\n}\n``\n. You need to change thestarOn,startOffandcancelOnandcalcelOff.\nThesize` options just changes the icon wrap to fit it.\n. Hi,\nYou can use Font with version 2.6.0 and control the size via CSS. width and size was removed. The size of star is dynamically discovered. But if you use image, you still must to change the icon, since it does not change on the fly.\n. Check if you jquery.raty.min.js file was imported.\n. Hi,\nI tried it here and works fine. Using version 2.6.0.\n. While readonly, the hint is equal the score setted.\n. The hints, that is just alt attribute, is setted on the starts, not on the div.\nhttp://wbotelhos.com/raty#half\n. Thanks @dentarg! (:\n. Hi,\nI don't know how to support it, but I'll check it out on the next version. (;\n. Hi,\nNow you can use Font with version 2.6.0.\n. Raty just keep the value inside a hidden field called score by default.\nYou must get it and save into your database.\n. Quoted: \"Raty just keep the value inside a hidden field called score by default.\nYou must get it and save into your database.\"\n. Hi,\nLike I said, just create some placeholders for each star and populate it as you wish.\n. Hi,\nYes, it is. Just configure both.\n. Could you create a test simulating it?\n. Hi,\nMaybe it is related with this commit.\nIf it still happen, please reopen this issue.\n. Hi,\nI don't want to use CSS to keep this plugin simple.\nI know fonts and CSS is better then a image, but with image I can keep the thing really simple and compatible.\nMaybe you can try to change the class of a div instead to change a src of a ìmg`.\n. Thanks a lot,\nBut the idea of change the element type (#116) instead an attribute where we need to do if, is better.\nAnd use the prefix fa is bad, because force the user to use it. We do not need to import all Font Awesome just to use 3 icons, better than this is download just the icons you want, and it won't be fa prefix, but what user choose.\nSorry, you did a great job, but I'll accept and customizer the other issue, where you can improve later.\nThanks again.\n. Hi,\nI sorry for it, but I'm without server to keep it for now.\nYou can download the project, inside it has index.html with the same content.\n. Hi,\nYou can use the callback for it:\njs\n$('#star').raty({\n  score: function() {\n    return $(this).attr('data-score');\n  }\n});\nThe same works for the attributes score, readOnly and number.\nAnd you have the attributes target and targetKeep to set and element with your choosed score.\n. data-value:\n- The feature already exists.\nYour way: we must to use your hard coded name like data-value.\nThe actual way: you can get any name you want dinamically.\njs:\nYour way:\n- we do not need to write the properties, because it is already inside (coupling, bad) the script;\n- we will have the same feature duplicated with one hard coded.\nThe actual way:\n- you must to write the callback (decoupling, good);\n- the feature is already done and the devs can use any markup them want.\nset score:\nLike I said, we already have this features.\nSorry SAPessi, I appreciate your time, but it was already done.\nThanks! (:\n. Hi,\njs\n$('#star').raty('score', number);           // Set the score.\n. Hi guys,\nI'm working on it.\nI lost my instance on Amazon and then I began to rewrite my blog.\nNow I'm creating a new labs for all my plugins with a better way to maintain and with comments feature.\nSorry, but it will be avaliable soon. :)\n. By the way,\nJust download the package, inside on it has the demo page (index.html) ;)\n. Closed by https://github.com/wbotelhos/raty/pull/130\n. Hi,\nIf you change the dom, then you must apply the Raty again on the next state.\n. Thanks! (:\n. Hi,\nFirst all, sorry for the late answer.\nYour pull request is kind dirty with merge, a bouch of identation issues and so one.\nI know the things changed a lot until now, so... could you do a new clean pull request?\nI'll let it opened for now just to remember about this feature.\nI could implement it, but I preferer your name on it.\nThanks again! (:\n. Thanks.\n. @ikudriavtsev Thank you for you code.\nCould you add some test for it? There is a lot of code here.. Hi,\nRaty is not responsible for it. It is a rule of your application.\nTry to set a checkbox with \"not applicable\" or something.\n. Thanks! (:\n. Hi,\nUse the version 2.6.0 that supports callback for path option.\n. Your icon must have the same size.\nThe size option calculates the width area necessary to fit all stars.\n. Hi,\nIf you want dynamically size, use Font instead with version 2.6.0.\n. Hi piernik,\nThe World Cup is happening just now, and all this fixes too.\nI'm on 3g hotspot, without internet. (thanks Dilma).\nI'll fix it soon!\n. Hi,\nKeep minified version on repository is kind deprecated.\nWe already have a lot of frameworks to do that, like Grunt or even on internet.\nOther problem is the strategy I choose for minify, maybe is not the same of the developer.\n. Hi,\n1. I could not reproduce this error. Could you send a test to break the feature?\n2. The target demo is just on example, the beautiful is up to you to build.\n. Hi Andrew,\nThank you for the pull request.\nCould you tell me where I can find more about this feature?\nIs it possible to create some specs to ensure that everything works fine with it?\n. For what I saw and happened with me on my Job...\nIf Require JS is present on project it will load the lib even if don't want, right?\nI just afraid to make a auto \"load/dependency\" like the plugins Time Ago and Aloha does.\nI'm rewriting all the code as prototype, lets apply it on next version, ok?\n. Hi @AndrewEastwood ,\nCould you rebase the code for merge?\nIs there any way to add test for this code?. Yes,\nNot yet, you may using the master code not released yet.\nCheck the last release here: https://github.com/wbotelhos/raty/releases\n. Hi,\njQuery Raty 2.6.0 now supports Fonts.\n. number: 1\nBut you can't click again to unselect it. You should use cancel button.\nBut if you want something like a :heart:, then you don't need a plugin.\n. It was fixed on version 2.7.0.\n. Hi,\nCan you detail your problem with code, live code or error output?\n. Thanks man,\nNow it is working.\n. Hi,\nCould you send just the bower package.\nChange the icons name is not right and breaks the build.\n. I saw,\nBut you push this commit together: https://github.com/yadhu/raty/commit/3c517a636a25b323ec9d26abacf2dee9cdc29cef\nIt broke the build and is not right.\nCould you do another clear single push?\n. Thank you! :)\n. Submit, prevents and so is not Raty's responsability.\nTry something like: http://jsfiddle.net/z67kR/1/\n. Maybe you need to adjust you round option.\n. Hi,\nMaybe we should add CSS, images and fonts on main key as array.\nDid you tried it?\n. Hi Alex,\nThank you for the free account.\nI hope it comes back soon.\nI'm migrating my blog to Rails 4 and Ruby 2 and for now I'm doing some crazy experiences.\nFor now you can download the repository and to use the offline documentation. It is the same of online on.\nSorry for now, it will be back soon.\n. Thanks all!\nNow we running over Ruby 2.2.0 and Rails 4.2.0.\nHope it does not waste a lot of memory anymore and the Blogy keeps online.\nAnd thank you Alex for the credentials, I'll enjoy soon. <3\n. Use the code from master.\n. I do not use Netflix, but can you use more than one Raty one below another?\n. Thanks! (:\n. Thank you @redd !. Hi,\nUse the master code with this fix.\nI need to generate a new tag.\nSorry.\n. Ok, but we do not have the namespace raty anymore https://www.npmjs.com/package/raty.\nratyjs, raty-js, js-raty?\n. @llaski I follow the common names found there, check it out: https://www.npmjs.com/package/raty-js\n. Hi @peterjurkovic ,\nCould you simulate it with a test?. Raty does not support % highlight. Just half of full.\n. I did not know that now we have to edit manually a release to be considered.\nThe last tag will not be the official release automatically. We need to edit the release with a changelog. Thanks for the notification. 2.7.0, is the last one.\n. No,\nIt is too much obvious if you read the documentation: http://wbotelhos.com/raty#click\nEven has the evt argument after.\n. Hi,\nIf you to use image, you need to change the image.\nBut you can use font and just change the font-size.\n. Could you create a spec for that?\n. Raty works with data attribute a long time ago, but as a whitelist @arturmamedov: https://github.com/wbotelhos/raty/blob/master/lib/jquery.raty.js#L62\nThis commit just apply all data as option. I don't know if it is a good idea we have all data attributes cached on plugin.\n@troyharvey Why not enable the scoreName callback? What do you thing about whitelist load over load all attributes?\n. The problem with all that is the Fat DOM. By the way, this code has no test.\n. Hi, @arturmamedov , the problem is this code has no test. Me or someone else must to do that. ;). Hi @NelsonScott ,\nCould you add some teste for it?. We need some specs, there are a couple of code here.\n. Hi, could you check if version 2.7.1 solve this issue?\n. The assets are just a example that can be used.\nIf we set lib/jquery.raty.css we need to include the fonts too and we decided that the user will use fonts.\nIf we do not set lib/jquery.raty.css we need to include the images and we decided that the user will use images.\nMake sense include this files on main?. @cplaetzinger Could you add some test for it?. Hi @kkirsche ,\nHere the spec https://github.com/bower/spec/blob/master/json.md#version and it really deprecated.\nCould you solve the conflict to be merged?. js\n$('div').raty('score', number);          // Set the score.\n. I've never seen, maybe someone can help you.\n. I'll close this issue @Henry-Cullen , if someone else have this error, maybe we can try to find a bug on code.. This options is about stars, not cancel button.\nMaybe we can include the cancel space on it.\nWhat do you think?\n. Console is always open for that.\nFacebook prevents Firebug in some way, but I have no ideia about it.\n. You can do it on your CSS.\n. You will need to change it like:\njs\nel.find('img').css({ height: '16px', width: '16px' });\nUse a bigger image and change it size on render is not good practice because you will wast size load.\nTry to create an icon with the size you really need, or do that hack.\n. @SeoNerd \nIs it solves your problem?. Thank you! (:\n. Try iconRange options.\nCheck the demo page to know how it works. \n. Hi @Yhzhtk ,\nI don't know this framework.\nIf you want to make a PR, we can support it.. Hi,\nYou need to return false to prevent it.\n. Hi,\nPlease, check the documentation:\n$('div').raty('score', number);          // Set the score.\n. Did you prevent the score with return false?\n. You return is on else, but your action is on if.\n. Hi,\nI think you should do a separated script tag to import and another one to call the raty, inside $(function() { // here }).. Using Rails, you will need to import you assets from manifest (application.js). You should not set the local path app/assets.... You can check it going on your page source and clicking on link that will be broken. Try to look for: \"Precompiling assets on Rails\". I need to check the need of the method reload. Because this method just destroy and create again. Maybe it adds a extra data that prevents this. I'll check it soon. Thank you.. Hi @minennick \n\n$(...).raty is not a function\n\nraty won't be a function if it is not imported. Check your Page Source and check if the path is right and check the Network section of Chrome to see if assets was loaded.. @minennick \nIf you are using Rails, your path should come from an image_path, since we need to now the name of the asset plus the MD5 value like: /assets/icons/start-on-123md5here.svg.\nYou need some think like:\nstarEmptyOff: '<%= image_path 'vendor/raty/star-empty-off.svg' %>',\nstarHalf:     '<%= image_path 'vendor/raty/star-half.svg' %>',\nstarOff:      '<%= image_path 'vendor/raty/star-off.svg' %>',\nstarOn:       '<%= image_path 'vendor/raty/star-on.svg' %>'\n\nYou assets into app/assets/images / app/assets/javascripts / app/assets/stylesheets.\nEverythig imported with the right path.\n\nFor more doubt I recomend to use the StackOverflow, since we used to use Issues for bugs. (:. Hi,\nYes, you need to turn of the readOnly first, so you'll be able to do that.. Hi @JustinGaravel ,\nFor now, my blog will be offline. You can check the demo folder to see some examples or just see the options on README.md.. Hi @ecabuk ,\nIt is not. Could you open a pull request removing it?. Hi @hoangnkvti , removes the node entry solves the problem?. Thanks! (:. Hi @muri9du ,\nWhat do you think if we set a classe on the wrapper to indicate the stars is readonly?\nWith that, we can use just CSS over JS to change the cursor.. Hi @HiIcy ,\nCould you please write in english.\nI tried to translate, but I did not understood, sorry.. Thank you, @tfantina ! (:. Could you to use triple equal (===) on comparison and the short way !$(this.opt.targetScore).length?\n. You forgot a comma here. ^^\n. You should to remove the last comma of the last line.\nWe have an invalid JSON here.\n. ",
    "gcameo": "yes, its now Ok. Thanks\n. ",
    "shabari585": "when i am using raty-js in angular4 in ngFor loop it is not functioning .please help me:(. ",
    "mrchess": "Yeah I guess I didn't understand how raty worked. I thought after it got initialized it would turn the element to have properties where you can get a value -- I thought it would create a raty object of some sort where it would maintain the state of the rating so I could execute a\n$('#big').getRatyValue()\nInstead of fetching it through children. No worries :)\n. Indeed :). I added some things to raty. You can see here:\nhttps://github.com/mrchess/starify\nI'm not sure if I was supposed to fork it before adding? Sorry I don't know\nthe proper github etiquette for contributing/adding to projects -- still\nkind of new\nOn Sun, May 8, 2011 at 3:57 PM, wbotelhos \nreply@reply.github.comwrote:\n\nIf you have some good ideas, please, fork e pull it. (:\n\nReply to this email directly or view it on GitHub:\nhttps://github.com/wbotelhos/raty/issues/11#comment_1120085\n. Edit: Opened this issue by accident. Did not mean to.\n. \n",
    "YakupIpek": "It works. Thanks\n. ",
    "roryhutchings": "I believe the second option would be more appropriate. However would the starOff option just become a default if images are missing?\n. ",
    "klaussantana": "You should do something like this when applying the <img> tag in your script:\n<img src=\"path/to/custom-star.png\" lowsrc=\"path/to/default-star.png\" (...) />\nThe lowscr property is responsible for loading an image to display while the browser is still downloading the src image.\nNote: If the browser can't find the src image, the lowsrc image will not be replaced. So, if the browser can't find the custom-star image, it will show the default-star always.\nRemember: It is NOT an standardized feature of the HTML language, so maybe not all browsers will work the same way and maybe some of them can even ignore this property. So, if the developer don't put the custom-image on the server or refer to an image hosted in 3rd-party servers and in the future that image is removed or no longer available, it's his(or her) responsibility for that issue, not yours. You are just helping for pure grace with all that you can do.\nThe major browsers (ie, ff, chrome, opera, safari, etc...) support this feature. See http://www.w3schools.com/jsref/dom_obj_image.asp for details.\n. ",
    "grisevg": "\nThere is no way the ID to be null, because there is a rule, #L49, that creates an ID for the element if it does not exist;\n\nOMG! It's a global variable. I didn't noticed it at first. Don't use global variables, they are evil and will corrupt your soul.\n\nUseful for what? If it is hidden the only use would be to take the value of multiple fields at once, but you can just to use the class of the Raty container;\n\nI just had a problem where my score had a required class which is used by a form validator... There are a better ways to implement this, I agree.\n\nI prefer let it available for anyone to download and not bother compress the script. I also do the minified with some settings to avoid syntax errors as we see in the jQuery script.\n\nLets just write a .sh and .bat scripts to use with Yui Compressor, or after every major release put one on your website. It's not very good to have it right in the repository since git track its changes.\nEDIT:\nOooops, did I just accidentally closed pull request? o_0\n. > The ID is declared at #L46;\nSorry, I should read code more closely before making such statements (=\n\nAnd I was thinking about error message. It is better throw it locally and let the function message to log warnings and messages help.\n\nI disagree. Suppose someone didn't specified required option. They should receive a real JS error, not the silent message the will only see if they would open a console.\n. ",
    "elias6": "I forgot to mention that I am using Raty 1.4.3.\n. ",
    "ghost": "I have the same issue. I am dealing with it. If I fix it, I will send the patch.\n. Ok, thanks.\n. I got it Somehow Working\n$('.qtip-titlebar span#rating').raty({\nhalfShow:true,size:5,starHalf:'star-half.png', starOff:'star-off.png', starOn:'star-on.png', path: img_url,start:$('#rating').attr('rel'),readOnly: true});\nIt is Working :+1: \n. $('.qtip-titlebar').html('<span class=\"pull-right\" id=\"rating\" rel=\"'+ data.rating +'\"></span>'); This will add Rating to Titlebar of QTip2\ndata.rating is comes from  ajax request.\n1st i created HTML body of how content will display with QTip2 after ajax call return data.\nWhen Data return i call to function which has html layout of content. \nlike function popupinfo(data) { }\n$('.qtip-content').html(html); this will input my HTML body of content to QTIP2\n$('.qtip-content').html(html); after this\nChange $('.qtip-titlebar span#rating') to $('.qtip-content span#rating') for Content Rating\nfor Title bar Rating\n$('.qtip-titlebar span#rating').raty({halfShow : true,size:5,starHalf:'star-half.png', starOff:'star-off.png', starOn:'star-on.png', path: img_url,start:data.rating,score:data.rating,readOnly: true});\n. The problem exist and without cancel enabled. What I need to change with this line star = this.stars[Math.max( Math.ceil(score) - 1,0)]; ? This was the solution for me: https://github.com/mbrainiac/raty/commit/958b92dcabcbc342a041e4073f6c0e216f36ac45. @arta how can you prevent from duplicating stars when moving back and forth on the browser using $( document ).on 'turbolinks:load', ->?\nIm assuming its something like this, inside my controller.coffee? But im having a hard time fighting out the actions to prevent duplicating starts. \n$(document).on 'ready page:load', ->\n  # Actions to do\nAny thoughts? . ",
    "konradhalas": "OK, I see the problem. I tried \"width\" but my raty div used \"text-align: centre\". It caused the second row to look bad - it was displaced.\nBut maybe this option makes more sense - now you don't have to manually input the width (stars in row * icon width). You can precisely point to where you want to break the widget.\n. ",
    "pcout": "please help me on this problem. Any ideias on this yet ?\n. The problem is not with the target container. It´s with the number of the stars highlighted after after the ajax call.\nLet´s say, for instance, the global rating is 0 (no one has voted yet) and the user submits (on the second instance of raty) 5. The first instance should then present 5, which is the average value based on the total number of votes.\nAs i stated, the target updates well, but the stars maintain their last value (visually as the data is sent correctly to the database). If i refresh the page all appears well.\nThe problem seems to be here: $('#artigo_rate_global').raty('start', data); as the value contained in the variable data (which is correct) is not updating the stars in real time after the ajax call.\n. Now try to set  readOnly:true in    $('#artigo_rate_global').raty({    parameters. You will see my point.\nIt only woks if you don't set it to readonly:true.\nIf you set that to true you will recreate the problem i described.\nI want   $('#artigo_rate_global').raty({    to be readonly all the time.\nCan you see why that is happening and how to fix this ?\nThank you for looking into this.\n. thank you. i didn't realize that read-only would block applying the data, only the non-clickable action.\njust in case anybody has the same problem i set it to readonly:false applied the data then readonly: true.\nthank you for you time.\n. ",
    "felixchan": "Hi,\nThanks for the quick response!\nI'm still getting the same error. Raty shows half-star ratings for solid-points.\nCan you take a look here? \nhttp://184.72.250.181/search/?q=ab\nThanks!\n. ",
    "I-sty": "I have this problem.\nI use this script in the footer section:\n$(function() {\n            $('div#star').raty({\n                half: true,\n                path: 'jquery/rating/img/',\n                score: <?php echo $linie['rating'];?>\n            });\n        });\n. \n. I tried but the same error:\nhtml\n  <div id=\"star\"></div>\n    <script>\n        $(function() {\n            $('div#star').raty();\n            });\n    </script>\nUncaught TypeError: Object #<Object> has no method 'raty' produs.php?produsid=24:244\n(anonymous function) produs.php?produsid=24:244\n(anonymous function) VM269:1\n(anonymous function) VM269:1\nE.extend.each VM269:1\nE.extend.ready\n. I include a file called globalFunc.php before the  tag on my webpage. This is problem?\nhtml\n(here are many php/jquery function)\n};\n</script><!DOCTYPE html5>\n<html>\n    <head>\n        <meta charset=\"utf-8\"/>\n        <meta http-equiv=\"cache-control\" content=\"no-cache\" />\n        <meta http-equiv=\"pragma\" content=\"no-cache\" />\n        <meta http-equiv=\"Content-Language\" content=\"hu\">\n        <link rel=\"shortcut icon\" href=\"imagini/favicon.ico\" type=\"image/x-icon\">\n        <link media=\"screen\" rel=\"stylesheet\" href=\"magazin.css\">\n        <script src=\"http://code.jquery.com/jquery-1.10.2.js\"></script>\n        <script src=\"jquerys/rating/jquery.raty.js\"></script>\n        <script src=\"jquerys/jquery.cookie.js\"></script>\n        <script src=\"jquerys/imgpreview/jquery.js\"></script>\n        <script src=\"jquerys/imgpreview/main.js\"></script>\n. Same error :(\n\n. Unfortunately not. I can open the js file. :(\nI tried another rating system and I got the same error, that the .rating()\nfunction is missing.\nI am not noob.\nI included the latest jquery file from the official link.\nAfter that I included the system's js file.\n2014-01-28 Washington Botelho notifications@github.com\n\nCheck your page source and click on jquery.raty.js link and check if it\nwill be opened.\nI think your import is wrong.\n\nReply to this email directly or view it on GitHubhttps://github.com/wbotelhos/raty/issues/34#issuecomment-33447809\n.\n. Unfortunately not. I can open the js file. :(\nI tried another rating system and I got the same error, that the .rating() function is missing.\nI am not noob.\nI included the latest jquery file from the official link.\nAfter that I included the system's js file\n. \n",
    "jacobwgillespie": "Awesome, thanks!\n. ",
    "Landish": "Unfortunately, it's still down :(\n. ",
    "shadowfax": "Ok...\nLine 259 reads:\nscore   = parseInt(this.score.val(), 10),\nThis rounds the score value the same way as Math.floor... I've changed this to\nscore   = parseInt(Math.ceil(this.score.val()), 10),\n...and now it shows the correct message.\n. That simple patch doesn't seem to mess up the calculations just fixes the tiny issue I talked about. For example, if you have a rating of 0.5 the actual code at GitHub will show \"No ratings yet\" but half a star is shown. This makes the user think there is an error with the rating system. With that small code change it will show \"Terrible\". Same thing happens for other half stars.\nThis doesn't affect the alt tag but the title tag.\nFor the other issue about half stars with hints I guess it could be as simple as creating an array for hints that is the double of the size (if we got 5 stars enter 10 hints)... Then, instead of converting it to an Int just round it up to the nearest half and multiply the value by 2... then substract one as always...\n0.5 * 2 = 1 --> 1 -1 = 0\n1 * 2 = 2 --> 2 - 1 = 1\n1.5 * 2 = 3 --> 3-1 = 2\n...\n5*2 = 10 --> 10-1 = 9\nAnd there you go, hints for half stars \nEdit: Just make sure the length of the hints is equal to the number of stars * 2 and half stars are enabled before aplying this formulas. Rounding to the nearest half:\nnearestHalf = Math.Round(score/0.5) * 0.5;\nMaybe it's not a clean hack but certainlly works :)\nIf you wish to include a js tooltip I would go for an already existing JS library... if the library is there, then show the tooltip, if it's not there then do it as it has been done up until now. The tooltip code could be large and embedding it in raty code would make it useless from other code (ie. Form validation), however using an external library allows the developer to use the tooltips in other places... There could even be a callback for a mouseover event that way the developper may chose what tooltip he wants to use.\nThe callback method could make a cleaner solution for the hints issue.\nIf bandwidth is an issue it would also be nice to get sprites for the stars :)\n. ",
    "maddhacker24": "I am also in the need of displaying ratings for half stars.  I use 5 stars but on a 1-10 scale. I multiply the score behind the scenes. It would be nice to display the number when a user is hovering over 2 1/2 stars. (5) on my scale.\nThanks for a great plugin!\n. I implemented tooltips/hints for half ratings on my site by added the following lines.\nfillStar function:\n$star.attr({src: opt.path + icon, title: score*2});\nshowHalf function: \nthis.children('img').not('.raty-cancel').eq(Math.ceil(score) - 1).attr({src: opt.path + opt.starHalf, title: score*2});\nI simply added the title tag and multiplied the score by 2 to fit my 1-10 scale. Thx!\n. ",
    "seiyria": "I also have a need for half-star ratings.. I guess I'll just grab a hack out of this thread though.\n. ",
    "intracer": "It's good that it supports it, but it is good to be documented how it is used as well.\n. ",
    "ai10": "Because Raty changes the images on hover, even if the browser caches the image with lengthy expire time I found that some will still call the server for the same images over and over again to see if the image has changed when the user hovers; caching eliminates the unnecessary calls. I think its typical to use sprite positioning for these types of hover effects to eliminate redundant calls; but Raty does not use sprites.\n. Though it did use a cached version, I was unable to prevent the Chrome browser from fetching the image file again. \n. ",
    "dannyroa": "My rating selector is in a form. When I reset the form, it should reset the rating too.\nWhat is the best way to do this?\nThanks.\n. I was trying to do 'cancel' earlier but it wasn't working. Turned out I had an old version of the plugin.\nSorry about that.\nThanks for the help!\n. ",
    "DominicMe": "Issue was caused by img css style that cascaded down to raty star images. Initially I did not realise that images added by raty images could be styled with css directly.\n. ",
    "havvg": "Applying this patch works and doesn't break the testsuite.\npatch\ndiff --git a/js/jquery.raty.js b/js/jquery.raty.js\nindex f2b3603..1ee543c 100755\n--- a/js/jquery.raty.js\n+++ b/js/jquery.raty.js\n@@ -366,7 +366,7 @@\n                                        } else {\n                                                score = this.opt.precision\n                                                                ? parseFloat(score).toFixed(1)\n-                                                               : parseInt(score, 10);\n+                                                               : score;\n                                        }\n                                }\n. Yep, will do!\n. Done.\n. ",
    "EmmanuelDemey": "This issue can be close I think. The redirection works for me.\n. Thanks !! I have integrated the new version to my components library. \n. ",
    "apptous-seb": "Yes, now it works for me too.\n. ",
    "muratguzel": "BTW I created a new rails gem with using the raty plugin. \nFind it at http://github.com/muratguzel/letsrate\n. Yeah you are right about if :) however it is very necessary for letsrate gem :) I checked up the gem of @bmc yes it is cool. But my gem is much more different. There is an important option in letsrate gem called dimension. You can add many fields for rating with just one model record. \nThanks ... \n. ",
    "nickhoffman": "The data attribute's stored in the DOM element, which is accessible globally. After initializing a rating, try this in your JS console:\njavascript\n$(\"#rating\").data(\"settings\");\nThis pull request changes the name of the data attribute so that it's specific to raty:\njavascript\n$(\"#rating\").data(\"raty-settings\");\n. ",
    "DouweM": "No worries, as long as there will be a solution to the problem I'm happy.\n. ",
    "gongchengshi": "It turns out I was using a very old version of Raty.  I downloaded it from http://www.htmldrive.net/items/show/153/jQuery-Raty-A-Star-Rating-Plugin today and only now realized that it was last updated 2 years ago.  I wish htmldrive would direct people to the github source instead.\n. ",
    "pmoda": "When I was using jquery 1.5.1 i got No Method 'on' \nI upgraded to 1.9.1 and am getting the No Method raty with v2.5.2\nReally cool project btw! Hope this helps\n. Nice thanks. You were right. I'm using the same jQuery as you are now and it works. Just had to switch around the bind and script so that I include raty after jquery. (i'm pretty new to this)\n. ",
    "Patatouf": "Hi wbotelhos,\nThank you for you answer.\nI am sure that the image path is correct because when I .raty an existing div when the page loads, it works fine. I also think that the div is created before I bind it because if I replay .raty by .remove or .html('some text'), it works well too.\nHow could I use the firebug to better test it ?\nThank you again for your help.\n. I have the following error :\nTypeError: Object [object Object] has no method 'raty'\nWhere could that come from ? I wonder if there is no interference with\nbootstrap.js or something like that ?\nOn Wed, Feb 27, 2013 at 3:46 PM, Washington Botelho \nnotifications@github.com wrote:\n\nCall your $.ajax() without the Raty bind then open the Firebug and\nexecute the bind. $('.raty').raty();.\nSo you can make sure the div is there and inspect the DOM to check the\nimages.\n—\nReply to this email directly or view it on GitHubhttps://github.com/wbotelhos/raty/issues/64#issuecomment-14177080\n.\n.  wbotelhos, I feel sorry, I just changed the order of my imports and it solved the problem. Thank you very much for your help and your work !\n. \n",
    "arnabrahman": "I'm facing same problem. Can you show some code?\nWell i just added the bind in ajax() success function. Is this a good way?\n. ",
    "bendanzz": "Thankyou for your reply,I am chinese, you know, lots of ppl here still use\nIE6.it is ok,maybe i should try to make my own plugin, great job\n在 2013年2月27日星期三，Washington Botelho 写道：\n\nHi @bendanzz https://github.com/bendanzz,\nUnfortunately not, neither jQuery will keep it.\nWhat is your problem? Maybe I can help you to do a hack to get it works.\n—\nReply to this email directly or view it on GitHubhttps://github.com/wbotelhos/raty/issues/65#issuecomment-14176622\n.\n. \n",
    "sergicontre": "the property size not work... \nhttp://jsfiddle.net/p7WCG/\nthanks!\n. ups ... right. forgive me ...thank you very much. \n. ",
    "byhoratiss": "I did it, here is the property i change:\n```\n_createScore: function() {\nif (this.opt.targetScore == undefined || $(this.opt.targetScore).length == 0) {\n  return $('<input />', { type: 'hidden', name: this.opt.scoreName }).appendTo(this);\n}\n\nreturn $(this.opt.targetScore);\n\n}\n```\n. I cant allow that \"score\" hidden field, and the script does not give the\nchance to avoid that creation.\nI made a symfony2 form type extension, that uses your plugin, and it solves\nall my problems!\n2013/3/28 Washington Botelho notifications@github.com\n\nWhy not just get the value inside it?\nWe have a method for it or you can to use your own jQuery selector.\nWhat is the problem?\n—\nReply to this email directly or view it on GitHubhttps://github.com/wbotelhos/raty/issues/68#issuecomment-15611913\n.\n\n\nAtte. Horacio Tissera\n. ",
    "michaelthuren": "Trust me i did :-)\nBut i can only see the possibility to make this\nhttp://foodpilot.dk/beta/#create-review \nI cant use score, or get the starOn to be one value, only differet values for each range\n. ",
    "nztomas": "Please see the pull request for quick hack - cheers.\nhttps://github.com/wbotelhos/raty/pull/75\n. ",
    "njtman": "I figured out the cause of the issue.  The fastclick library I was using with my mobile app was messing with the mouse click events for raty.\n. ",
    "alvik48": "But it can be the option. Using css is not bad practice, it can be developer choise.\n. ",
    "kgrote": "Bummer, looks like I won't be able to use this with my project then. Shame - it looks really well made! Thanks anyway!\n. ",
    "vantax-eu": "Ok but how can I put an id to raty element ?\nWith scoreName i could set an input name... but how set an input id ?\n$(document).ready(function() {\n    $(\"form\").submit(function (e) {\n```\n    var title = $(\"#title\").val();\n            if (!title) {\n                alert(\\'title is required\\');\n                e.preventDefault();\n            }\n        var score = (WTF ?)\n        if (!score) {\n            alert(\\'no rated\\');\n\n            e.preventDefault();\n        }\n\n});\n```\n});\n. I have just changed my copy of jquery.raty.min.js from\ntype:\"hidden\",name:d.opt.scoreName\nto\ntype:\"hidden\",name:d.opt.scoreName,id:d.opt.scoreName\nso i can read the value set from his id. \nthank you to all !\n. ",
    "lfnavess": "Hi i olso have the same problem with html5 required atribute\ni solve it like this\nhttp://jsfiddle.net/z67kR/\ni hope it could be integrated in the next release\n. ",
    "Barralait": "Oh my, I'm so stupid it was written there directly. Sorry for the loss of time, and thanks again for your amazing work.\n. ",
    "mygu": "Thank for your answer.\nI tried it looks good,but there is a little problem,i has been adjusted.\n```\n  , _bindClick: function() {\n        var self = this,\n            that = $(self);\n    self.stars.on('click.raty', function (evt) {\n        var execute = true;\n        var _score = self.score.val();\n\n    self.score.val((self.opt.half || self.opt.precision) ? that.data('score') : this.alt);\n\n    if (self.opt.click) {\n        execute = self.opt.click.call(self, parseFloat(self.score.val()), evt);\n        execute = !!(execute || typeof(execute) === 'undefined');\n    }\n\n    if (!execute) {\n        self.score.val(_score);\n    }\n});\n\n}\n```\n. ",
    "LeXuanTien": "I was imported jquery.raty.min.js so I able to call $('#rating').raty({...}) but the second call $(\"#rating2\"), it inside the first one on the click event, can't execute and throw that exception\n. ",
    "Barno": "@wbotelhos thanks for your reply.\nBut if i comment half:true, i see the comment in my div\ni follow this example http://wbotelhos.com/raty#target\nthanks\n. my mistake sorry! thanks\n. for now i do it:\n\n if(!isNaN(score)) { \n    old_voto = score;\n   }else{\n    score = old_voto;\n }\n\n. ",
    "Arney": "This would be great, \nI was looking for a way to integrate Raty with Font Awesome, \nthis would do the trick without being restricted to just Font Awesome, \nor using 's (or 's in the case of Font Awesome)\n. ",
    "sandino": "I've already realized that, but thank you for reply.\n. ",
    "piavgh": "@wbotelhos : sorry for my dumb question, but how can I save the score to my database?. I use php zend framework and doctrine ORM\n. ",
    "amilligan": "We would like exactly this functionality as well.  Did you ever complete your implementation?\n. ",
    "wallenium": "I think it is really easy to support both: images and font.\nSee here: https://github.com/astronouth7303/raty/commits/master\n. https://github.com/wbotelhos/raty/pull/97\ni wrote a small implementation, its not that clean code, but it should work ;)\n. ",
    "gbonanome": "+1 to support both :smile:\n. ",
    "doron2402": "Nice, I forgot checking it and kinda did something of my own. Thanks everyone. next time I'll defiantly checkout what going on here. \n. ",
    "majamusan": "sweet thanks i should of just looked... should change the git hub to \nreflect that, though you do want a online example to show people how \ngreat is the product\nj\nOn 18/11/2013 04:00, Washington Botelho wrote:\n\nHi,\nI sorry for it, but I'm without server to keep it for now.\nYou can download the project, inside it has index.html with the same \ncontent.\n—\nReply to this email directly or view it on GitHub \nhttps://github.com/wbotelhos/raty/issues/98#issuecomment-28672543.\n. \n",
    "sapessi": "Yeah. It's just because I have lots of rating elements in a page. So to keep the html clean and not write too much js I just create it as $('.rating').raty() and then set the required properties in the html. \nFeel free to close. \n. ",
    "daslicht": "thank you!\n. ",
    "eoinmurray": "Yes, it would be good to have an accessible demo\n. ",
    "Hexodus": "Oh I see. Thanks!\n. ",
    "domarty": "Actually, adding bower support would be awesome.  And...it would take 10 minutes or so.\n. Ha, and lo and behold, the functionality's already there -- I just missed it.\nIn case anyone else misses it as well -- just set the starOn, starOff and starHalf options to the appropriate class names (they don't need to be file names).\n. ",
    "thejwalker": "Problem solved.\nChanging to:\njQuery('#star_12').raty({score:4});\nfixed the problem.\nThanks\n. ",
    "ricardopacheco": "I found the problem: when the arrow a different standard documentation (same folder as the js file) path, he is making requests. When you follow the pattern, he does not repeat this behavior. \nNo way to adjust this? I'm saving the file in vendor/assets/javascripts. It is nonstandard save images in that folder, so created for a specific app/assets/images/jquery-raty\n. My mistake. Problem persist!\n. Only firefox make browser caching icon mouseover and mouseleave. Safari and Google chrome make fetch connection!\n. RESOLVED! moved img folder app/assets for public/\n. ",
    "piernik": "Great change - was looking for it (You have old version on http://wbotelhos.com/raty)\n. ",
    "mal3k": "I fixed that by changing the value of path in jquery.rate.js:\nfor me all icons were in the img folder, so :+1: \npath          : 'img',\nthe slash '/' is added programmatically so it shouldn't be added manually.\n. ",
    "megahbite": "You've put relative paths for the image assets rather than rooted absolute ones (they should be \"/assets/rating[Off|On].png\") and path should be set to null.\nYou may also find that this doesn't work in production if you're compiling assets (as is done by default in production in Rails). You may need to use the asset helper functions as documented here: http://guides.rubyonrails.org/asset_pipeline.html#javascript-coffeescript-and-erb\n. ",
    "AndrewEastwood": "Hi Washington!\nI put couple of lines here: http://jsfiddle.net/mU7M9/5/ just to show how it works, so I didn't start playing with images and used icons (:\nAnd about the feature itself: http://requirejs.org/\n. Hey @wbotelhos! would you like to proceed with this patch?\n. well, actually you control this situation. if you want the library to be included in particular module you just add it into the deps list (:\n. Example:\nthis, definitely, doesn't include jquery.raty here  define(['jquery'], function ($) { /*...*/}); but this one does `define(['jquery', 'jquery.raty'], function ($) { /... here you can use raty.js ... /});``\n. ",
    "neroxing": "read the doc please, that's an option you can use font by set starType:'i'.\n. ",
    "nozpheratu": "Sorry about that, closing.\n. ",
    "ErikPham": "Hi you!\nI want to be when finished, not the rating to rating click for more next time. And another problem is I only want to score an even number eg 2.5, 4.5, 5 rather than (2.76042) then how to do?\n. ",
    "cmitz": "I'm still having this issue. I'm on version 2.7.0, downloaded from this master repository.\nMy code:\njavascript\nuserRatingOptions = { \n    score : 0,\n    cancel : true,\n    half : true,\n    cancelHint: 'Verwijder rating',\n    click: function (score, evt) {\n        ...\n        }\n    }\n};\n. ",
    "yadhu": "Its already made under your name and your original repo. if you are familiar with bower you install raty by using bower install raty.js\n. Sure. I'll do it\n. ",
    "felipefontoura": "Ops, my Gemfile:\nGemfile\ngem 'rails-assets-raty', '~> 2.7.0'\n. ",
    "alexyang21": "Thanks - I'll let students know to use the offline documentation instead. If you're interested in the free account, send me an email at alex@baserails.com and I'll send you credentials you can use.\n. ",
    "zukilover": "@wbotelhos plugin doesn't work on http://wbotelhos.com/raty, it throws some 404 errors.\n. ",
    "itayfry": "+1\nWould really appreciate it if you submit to cdnjs.\n. ",
    "san983": "I think this one can be closed since it is already here -> http://cdnjs.com/libraries/raty\n. ",
    "jimaek": "The new backend is live. It pulls files directly from npm and github https://github.com/jsdelivr/jsdelivr#usage\nExample https://cdn.jsdelivr.net/npm/jquery@3.1.1\nExample directory listing https://cdn.jsdelivr.net/npm/jquery@3.1.1/. ",
    "viniciusbig": "Web site is back! =)\n. ",
    "slonofanya": "...\nclick: function(){\n   setTimeout(function(){\n      console.log($('selector').raty('score'));\n   }, 200);\n}\nThis crutch solves the problem. But option \"click\" has to be fixed.\n. ",
    "ouhman": "I am using the latest code from master and it doesn't fix this issue.\n```\n$('.raty').raty({\n            starType: 'i' ,\n            path: '/web/library/raty/images/',\n            half: true,\n            click: function(event) {\n                var rate = $('.raty').raty('score');\n                $.ajax({\n                    async: false,\n                    type: 'post',\n                    dataType: 'json',\n                    data: {rate: rate},\n                    url: xhrSubmitRating,\n                    success: function(data){\n                }\n            });\n        }\n    });\n\n```\n. ",
    "joeval": "hey dont' be sorry my friend - thank you so much! it is beautiful & saves\nme time. thank you\nOn Thu, Oct 9, 2014 at 12:41 PM, Washington Botelho \nnotifications@github.com wrote:\n\nHi,\nUse the master code with this fix.\nI need to generate a new tag.\nSorry.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/wbotelhos/raty/issues/149#issuecomment-58547723.\n. will do\n\nOn Thu, Oct 9, 2014 at 12:51 PM, joe v mogsmailbox@gmail.com wrote:\n\nhey dont' be sorry my friend - thank you so much! it is beautiful & saves\nme time. thank you\nOn Thu, Oct 9, 2014 at 12:41 PM, Washington Botelho \nnotifications@github.com wrote:\n\nHi,\nUse the master code with this fix.\nI need to generate a new tag.\nSorry.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/wbotelhos/raty/issues/149#issuecomment-58547723.\n. oh, this is public, haha.\n\n\ni understand now --\nso where do i acquire this master code with this fix - just the master\nbranch? i just joined github\nOn Thu, Oct 9, 2014 at 12:52 PM, joe v mogsmailbox@gmail.com wrote:\n\nwill do\nOn Thu, Oct 9, 2014 at 12:51 PM, joe v mogsmailbox@gmail.com wrote:\n\nhey dont' be sorry my friend - thank you so much! it is beautiful & saves\nme time. thank you\nOn Thu, Oct 9, 2014 at 12:41 PM, Washington Botelho \nnotifications@github.com wrote:\n\nHi,\nUse the master code with this fix.\nI need to generate a new tag.\nSorry.\n—\nReply to this email directly or view it on GitHub\nhttps://github.com/wbotelhos/raty/issues/149#issuecomment-58547723.\n. \n\n\n",
    "anrake": "I am still seeing this problem with half:true. The value I get is precision, not half stars. I tried to copy the raty.js from the master branch here as well as installing via bower. For now I'm calculating the half value  in Ruby, before updating the value in the database, but a fix to the JS would be nice. \n. ",
    "johnantoni": "Forget this, by switching it over to use font stars it should be possible to support mobile.\n. ",
    "rizumu": "+1\n. ",
    "polyn0m": "+1\n. ",
    "llaski": "+1\n. ratyjs looks good to me.\n. ",
    "gizzm0": "I would really appriciate %highlighting. Perhpas you can give a shoort description what we should do?\nSurely we have to integrate more images into the font, i guess 1 image for each 0.1 step would be enough. The precision of the selection algorithm has to ba adapted as well as the rendering. Some advice?\n. ",
    "troyharvey": "You'll need to use a class selector. For example, try .raty instead of #rating\n```\n\n\n$(document).ready(function() {\n    $('.raty').raty({\n        half: true,\n        size: 24,\n        starHalf: 'star-half.png',\n        starOff: 'star-off.png',\n        starOn: 'star-on.png',\n        path: img_url,\n        click: function(b, c) {\n            var id = $(this).attr(\"#product_id\");\n            $.post('ajax-rate.php', {\n                'rating': b,\n                'id': id\n            }, function(a) {\n                if (a) alert(\"Thanks for your voting.\");\n                else alert(\"Sorry, something wrong with our server, please try it again later.\")\n            }, \"json\")\n        }\n    });\n});\n```\n. Nice! Thanks @maxicms. :+1: :-1: @wbotelhos?\n. ",
    "abrambailey": "Hmmm.. would really love to know how to fix this.\n. ",
    "adamasantares": "Ok, I found in sourse this:\njs\n        if (that.opt.click) {\n          execute = that.opt.click.call(that, +score, evt);\n        }\nSo, I can get new value from argument, but this behavior is not obvious I think.\nWorked code is:\njs\n        $(\".stars\").raty({\n            score: 3,\n            number: 5,\n            click: function(score){\n                console.log(score);\n            }\n        });\n. ok, thanks\n. ",
    "Darex1991": ":+1:\nWorked for me with:\nbower install juriejan/raty --save\n. ",
    "arturmamedov": "This little change enable the jquery data API for raty .... WOW! Amazing! +1 \n. @wbotelhos oh great, i remember something from doc, but today your website was down :(\nAnd can we extend whitelist, in example i need to change the style of star-on, star-off etc.\nWhat problems might arise if we set (all or more) options from the data attributes?\n. Nothing new on this? I vote up this thing, its very usefull!\n. If i say +1 again :D ?. Here the pull request https://github.com/wbotelhos/raty/pull/168\nIf you want you can costumize youron code like this:\n```\n// #jQuery.plugin - raty for a star rating view\n    if ($().raty) {\n        $('.getraty').each(function () {\n            // startype = i\n            var startype = $(this).data('startype');\n            if (typeof startype == 'undefined' || startype.length == 0)\n                startype = 'i';\n        // readonly = true\n        var readonly = $(this).data('readonly');\n        if (typeof readonly == 'undefined' || readonly.length == 0)\n            readonly = true;\n\n        // score = 5\n        var score = $(this).data('readonly');\n        if (typeof score == 'undefined' || score.length == 0)\n            score = 5;\n\n        $(this).raty({starType: startype, readOnly: readonly, score: score});\n    });\n} // END - #jQuery.raty\n\n```. ",
    "ahmadalfy": "+1 why this isn't merged yet?\n. ",
    "hassan-ahmed": "+1\n. ",
    "akatche": "Hi, im having the same issue. \nIf someone could give a hint that would be great!\nThanks!\n. Hi @rajlaksh \nIf you can could you show me the html that you put inside qtip2. Because i tried what you did but i cannot adapt it to what i made.\nThanks!\n. ",
    "billymoon": "+1\n. ",
    "cnyewei2016": "this issue is still not solved.\n. ",
    "michaelh99": "That's why it's still \"open\"\n. ",
    "johnnncodes": "@wbotelhos Ohhhh, its in the docs >.< I overlooked it yesterday, really sorry! Thank you!\n. ",
    "sbaechler": "I did get it to work. I had to use starType: 'button' and set the z-index of the element to something greater than 0. Any other tag wouldn't trigger the click event.\n. ",
    "mateuspv": "Hi @stack-its do you found a solution for this? I have the same problem...\n. ",
    "stack-its": "Hi @mateuspv\nNo, unfortunately not.  It's a basic function that I wish Washington would fix.\n. ",
    "davidklebanoff": "Yeah either that, or add an option for specifically for the cancel space. However, I don't see why someone would want spaces for one and not the other. So, my personal preference is one option that affects the spacing for both stars and the cancel button.\n. ",
    "mroutis": "Thanks for the Facebook reference, I found this.\nhttps://davidwalsh.name/disable-console\n. ",
    "markvantilburg": "A server side check is the way to go, what if they use http://www.telerik.com/fiddler or another proxy to change the value?\n. ",
    "deadlyDev2020": "Tried it on a simple html page on safari and it seems to work. Just was not working within my JQM based app on iOS\ntemporarily fixed it by setting the below within the click event callback with a timeout 0 to make it work. \n$('#star').raty('score', score);\n. ",
    "SeoNerd": "No, I need it for Specify image dimensions within the img tag\n. ",
    "amaiabaigorri": "You're welcome!\n :wink: \n. ",
    "loudadyassine": "@wbotelhos  This issue comes from this line : \nstar = this.stars[Math.ceil(score) - 1];\nWhen the option 'half' is true and the cursor is before the first star it looks for a negative index in the array. It can be easly fixed with : \nstar = this.stars[Math.max( Math.ceil(score) - 1,0)];\n. It can be reproduced very easly : \nGo to : https://wbotelhos.com/raty\nGo to the example for \"Half\" and try to select 0 star ( put the cursor before any star ) in the console you will see errors adding up.. ",
    "hevyfly": "\nThe problem exist and without cancel enabled. What I need to change with this line star = this.stars[Math.max( Math.ceil(score) - 1,0)]; ? This was the solution for me: https://github.com/mbrainiac/raty/commit/958b92dcabcbc342a041e4073f6c0e216f36ac45\n\nit should also in this section _setTitle:function() change the line  star = this.stars[Math.max( integer - 1,0)]  . ",
    "ramachandranv": "$.fn.raty.defaults.iconRange = [{ range: 1, on: 'images/1-on.png', off: 'images/1-off.png' }]\nHow do I specify the half icon for each range? I tried the below code but it doesn't work.\n$.fn.raty.defaults.iconRange = [{ range: 1, on: 'images/1-on.png', off: 'images/1-off.png', half: 'images/1-half.png' }]\nI need to set half icon for each range.\n. ",
    "saadtambe": "Thanks a ton ! It worked :+1: \n. Thank you for the response.\nI tried using $('div').raty('score', 4) in the click function;\nHowever the selection is set to 5 star on the UI after clicking 5 star. \nThe issue  is UI is not updated with $('div').raty('score', 4) , it remains as 5 star selection.\nPlease help !. Thanks.\n. Sorry, didn't quite get that.\nPlease see below is the code snippet: \n('div').raty({\nclick: function(score, event){\n   if(success on some conditiions){\n      ............\n       if (score == 5) {\n       //setting score to 4 is required as part of our approval process.\n        $('div').raty('score', 4)\n      }\n  } else {\n             ...............\n             return false;\n    }\n}\n})\nHowever  $('div').raty('score', 4) does not reflect on UI after 5 star selection.\n. Ahh, I was missing the return.  Thanks so much !! \n. ",
    "codefeat": "Hi,\nThanks for your response. I added separate script tags to import and call the raty inside the function. Still no luck. I also getting this error. My i'm running rails 5.0.0.1\n\n\n. ",
    "jogaco": "Works fine for me on Rails and I'm doing it as @wbotelhos says, putting raty files under vendor/assets: \nAnd my application.js top lines look like this:\n//= require jquery\n//= require jquery_ujs\n//= require_tree .\n//= require_tree ../../../vendor/assets/javascripts\n. ",
    "arta": "@codefeat, it looks like you are following mackenziechild's video. You also missed the data-score attribute on your .star-rating div (see below).\nIf you put the jquery.raty.js in app/assets/javascripts folder (as mackenzie did) you do not need to edit application.js. The script will load, and precompile with all the other JS automatically because of its location. \nBut, because jquery.raty.js is @wbotelhos script (as opposed to your own), it lives, by convention, in vendor/assets/javascripts folder. If you put it there, then to load and precompile it add this line to your application.js:\n//= require jquery.raty\n\nPut the star-half.png, star-off.png and star-on.png to your app/assets/images folder. \nInstead of adding your jQ Raty customization code to your movies show page (as mackenzie does), add it where it by convention belongs, to your reviews.coffee:\n$( document ).on 'turbolinks:load', ->\n  $( '.star-rating' ).raty\n    path: '/assets',\n    readOnly: true,\n    score: ->\n      $( this ).attr( 'data-score' )\n  return\n\nIndentation matters. \nRails specific $( document ).on 'turbolinks:load', -> replaces jQ \"traditional\" $( document ).ready ->. Swap them (after you get it working) and navigate to movies show pages to see why, or look at: http://stackoverflow.com/questions/18770517/rails-4-how-to-use-document-ready-with-turbo-links. Not doing it this way will also cause the stars to not show.\nThe score: ... key:value pair reads the value of the movie rating from the containing .star-rating div's attribute data-score; because that's where you supply it (via review.rating) by this code in your movies show page:\n<div class='star-rating' data-score=<%= review.rating %>></div>\n\nHope this helps.. @lauroengineer, to display Raty's stars at all, use: $( document ).on 'turbolinks:load', -> instead of: $( document ).ready -> (see http://stackoverflow.com/q/18770517/247626). This allows Raty to display the stars but it may be the reason why extra \"ghost\" stars appear on browser back-tracing. To fix that issue, use Raty's own: $( 'container' ).raty( 'reload' ); per @jakeland's https://github.com/wbotelhos/raty/issues/198#issuecomment-270380245. \nMy review.coffee looks like this:\n# Read and convert numeric rating to Stars (on views/reviews/_review):\n$( document ).on 'turbolinks:load', ->\n  $( '.star-rating' ).raty\n    path: '/assets'\n    readOnly: true\n    score: ->\n      $( this ).attr( 'data-score' )\n  # reload to remove ghost stars on browser back tracing:\n  $( '.star-rating' ).raty( 'reload' )\n\n# Read and convert numeric rating to Stars, set Star rating (on views/reviews/_form):\n$( document ).on 'turbolinks:load', ->\n  $( '#star-rating' ).raty\n    path: '/assets'\n    scoreName: 'review[rating]'\n    score: ->\n      $( this ).attr( 'data-score' )\n  $( '#star-rating' ).raty( 'reload' )\n\n. @jakeland, that did it, thank you! . ",
    "mSafdarAli": "i had the same problem. After looking into it, i found out that you just need to include require_tree and require jquery.raty in application.js file.\nIt worked for me and hopefully will work for you too.. ",
    "minennick": "hey guys,\nim getting an Uncaught TypeError: $(...).raty is not a function which hopefully is the reason for me the stars are not getting showed. But i dont know how to handle it.\nWhat i've done so far:\nAdding the images to app/assets/images\nputting the jquery.raty.js into vendor/assets/javascripts\nputting //= require jquery.raty into my application.js\nand putting \n<script>\n        $('.star-rating').raty({\n          path: '/assets',\n          readOnly: true,\n          score: function() {\n                return $(this).attr('data-score');\n        }\n      });\n</script>\ninto my show.html.erb file\ni also tried mckenziechilds tutorial which didnt work out for me.\nwith the coffee @arta is mentioning i dont get any errors but the stars are still not shown. \ni hope someone can help me out on this, thx. Hi @wbotelhos \nwhat do you mean by \n\nCheck your Page Source and check if the path is right\n\npath: '/assets', in my script should be rigth. but i checked the Network section of Chrome and some assets are loaded but jquery.raty.js is not. So the question is why? \nI tried a few different things:\nputting jquery.raty.js back to app/assets/javascripts\nand tried precompiling in config/initializers/assets.rb\nEDIT\ni was able to fix it by precompiling with  Rails.application.config.assets.precompile += %w( jquery.raty.js)\nand putting <%= javascript_include_tag 'jquery.raty.js', \"data-turbolinks-track\": false %> into my show.html.erb. But i dont really know why i had to precompile it. Still thank you very much @wbotelhos for this amazing work\n. ",
    "jakeland": "Hey, in case you need a quick fix, I've found that by adding : \n$('.star-rating').raty('reload');\nafter the function that renders the stars, you can avoid this problem. \nTo clarify, this is the way my code is set up\n//get and render star rating\n  $('.star-rating').raty({\n    path: '/assets/',\n    readOnly:true,\n    score: function(){\n      return($(this).attr('data-score'));\n    }\n  })\n//reload stars/stop duplication\n$('.star-rating').raty('reload');\nOriginally had it set up with the reload first, but that threw errors in the console. . ",
    "aryehbeitz": "I also ran into this problem. I solved it by re initializing raty with an empty object in the onload block before your actual initialization. ",
    "HemanthkumarHJ": "I also facing the same problem. But in my case this is not working in pagination. It works correctly for first page and when it comes second page the stars get duplicated. How to fix this?. ",
    "fish-palm": "do just like this?\n$(\"#star_one\").raty(\"readOnly\",false).raty(\"score\",allScore).raty(\"readOnly\",true);. ",
    "hoangnkvti": "I'm using node 8.12.0 but can not install\n\n. ",
    "tfantina": "I can't seem to duplicate this issue.. ",
    "n-rodriguez": "Hi there! Any news?. ",
    "vedmant": "The same issue!. ",
    "kkirsche": "Didn't forget. No reason to have one on all entries. \n. Ah I see what you mean, sorry. I'll send an update later \n. ",
    "houndci-bot": "Line is too long.\n. 'Helper' is not defined.. 'Helper' is not defined.. 'require' is not defined.. 'define' is not defined.. 'define' is not defined.. "
}