{
    "youknowone": "Thank you!\n. Fixed!\n. Of course, every components are in the plan. I am feeling hard to choose priority. I will take this as next work. Thanks for suggestion!\n. It works now, except system tab bar items.\n. Thank you! Looks great and license seems compatible too!\n. @KieranLafferty Hi. I wish there were like or +1 button for your comment. Thanks for good switch implementation ;)\n. Actually, I don't know about these issues very well either.\nAs you see, my basic strategy about this problems in UI7Kit is subclassing to retrieve values from xib/storyboard. (Just to enable users can edit values on Interface builder)\nI guess most of values are accessible after initWithCoder: done. And we can do another tricks to hide original UISwitch in awakeFromNib, if needed.\nSorry about unuseful comment. I believe there are each tricks to patch each controls. I will try your switch after basic works.\n. I agree that would be bad idea for KLSwitch :)\nUI7Kit is intending both a dependent toolkit and drop-in replacement of UIKit. If I don't inherit UISwitch, people cannot place UISwitch on interface builder and select new switch class. This must be confusing exception. So I still need to subclass UISwitch.\nDo you know any other clever solution about this?\n. Great. Because I failed similar trick with UIButton, I thought initWithCoder: should return the pointer what it receive. I must did something other wrong before.\nI am trying to override UIButton from UIControl\nHow did you decode your values?\nI have no time to test more at this time, but I confirmed storyboard uses decodeXXXForKey: too. So it must work. I will do this more in the night.\nI tried:\nself = [UIControl methodImplementationForSelector:@selector(initWithCoder:)](self, _cmd, aDecoder);\nAnd got method calls of:\n206989 + UIControl NSObject methodImplementationForSelector:                           \n206990 - UIControl UIControl initWithCoder:                                            \n206991 - UIView UIView initWithCoder:                                                  \n206992 - UIResponder NSObject init \n206993 - UINibDecoder UINibDecoder containsValueForKey:                                \n206994 - UINibStringIDTable UINibStringIDTable lookupKey:identifier:                   \n206995 - __NSCFConstantString __NSCFString hash                                        \n206996 - UINibDecoder UINibDecoder decodeCGRectForKey:                                 \n206997 - UINibDecoder UINibDecoder decodeArrayOfCGFloats:count:forKey:                 \n206998 - UINibDecoder UINibDecoder decodeBytesForKey:returnedLength:                   \n206999 - UINibStringIDTable UINibStringIDTable lookupKey:identifier:                   \n207000 - __NSCFConstantString __NSCFString hash                                        \n207001 - UINibDecoder UINibDecoder decodeCGPointForKey:                                \n207002 - UINibDecoder UINibDecoder decodeArrayOfCGFloats:count:forKey:                 \n207003 - UINibDecoder UINibDecoder decodeBytesForKey:returnedLength:                   \n207004 - UINibStringIDTable UINibStringIDTable lookupKey:identifier:                   \n207005 - __NSCFConstantString __NSCFString hash    \n...\n. I found I get 'reason: 'This coder requires that replaced objects be returned from initWithCoder:'' sometimes. And not sometimes. I am confused.\n. Tried 2 approaches:\n1. I successed to write KLSwitch as subclass of UISwitch, except a problem that size is fixed to iOS6 UISwitch size.\n2. I failed to object_setClass to replace UI7Switch to KLSwitch. It works on iOS7, but not on iOS6\n. What a genius work :D Please send me a pull request. I will be appreciated  very much.\n. @KieranLafferty Long time passed, but I found proper key to decode values from interface builder. They are UISwitchOn, UISwitchOnTintColor and UISwitchThumbTintColor\n. @KorvinSzanto Added (very) rough implementation of grouped style #8 \n. Thanks. Added to to-to list.\n. @massimobio  Looks great. I will try this. Thanks!\n. Accessories done\n. Thanks updated\n. I should review upper one. About Appirator, UI7Kit does not fit for all the alert view environment yet, unfortunately.\nYou can opt-out @\"UI7AlertView\" to avoid this problem temporary.\nhttps://github.com/youknowone/UI7Kit/blob/master/UI7Kit/UI7KitCore.h#L27\n. Could you share code for Activate, Later alert view? It seems new bug after moving cancel button to bottom.\nAbout Appirater, I have no idea. It looks similar like known 'repeated alert view' problem, but I have no idea how to fix it.\n. Not yet, sorry.\n. Thanks for report. I even didn't noticed there were -s properties. :)\n. @iT0ny The Items bug is fixed\n. By technical issue, UIButton tintColor is not reflected well from InterfaceBuilder, under iOS6 SDK.\nUse iOS7 SDK for best result.\n. Thank you for report. Which version of iOS did you tried?\n. Though I could not represent this problem, I found a hole in UI7View and fixed it.\n. @kovpas ab5b667 fixed it like your patch?\n. @hamadeguchi Thank you for report! I fixed it and released new version.\n. Warning also removed. It will be included in next release.\n. @gribeiro-mobirama Sorry. Because I don't have iPod 4th, I couldn't test this control on it. Could you represent it on simulator? Or show me representable code for that?\n. Unfortunately, I tried this code but didn't get that ugly stroke. (Test code is included current HEAD) But I found you are setting subview's tint colors. UI7Kit is implemented with all other codes, but is not touching subviews. How about try to set entier tint color like:\n[segmentedControl setTintColor:[UIColor redColor]]\nIn your method, it will not change entire color theme but will change only partial parts.\nAbout the stroke, I need more information. Try test app of current HEAD and check the #12 row in main table view. Test code is here: https://github.com/youknowone/UI7Kit/blob/master/UI7KitTestApp/UITIssue12ViewController.m#L30\n. setTintColor: should work well in both OS. But it is fixed in recent days. So you may using unfixed UI7Kit yet. I updated UI7Kit just now. Try updating this.\nIf it still does not work after updating, it is UI7Kit bug. Please let me know it.\n. @gribeiro-mobirama I found iOS7 SDK + Interface Builder + 3.5 inch screen can make this problem. Is this right? I didn't noticed this because i tested all the code from iOS6 SDK.\n. It is iOS7 SDK bug. (Without UI7Kit, it still is broken)\nI think watching next beta is better at this time. If this would not fixed until release of iOS7, I will add a workaround.\n. Interesting information. Thank you @tracid \n. @gribeiro-mobirama @tracid I prevented UISegmentedControl's height become less than 1px. I found this helps problems, at least in some case.\n. Depressing... I may should add constraint in the initWithCoder: for iOS6\n. Finally thumb image is finished by 35fc93f67b4e816edfc4862caa37036ab96f3f07 e322441d9072a6d7f40c60487c4d542ddf188990\n. KLSwitch is imported\n. @iT0ny I tried MBSwitch but it does not work well because of dynamic width issue. I reported it to MBSwitch. https://github.com/mattlawer/MBSwitch/issues/3\nIf you want, you can use it after fixing macro in UI7Switch.m\n. Moved to seven switch and looks fine everything.\n. I am wondering how to change 'Global tint color' in interface builder by code.\nAbout button, could you share problem reproducible test project?\n. [[UIKit kit] setTintColor:[UIColor redColor]] will change it to red\n. Thank you. I will remove this calls soon.\n. Reimplement or renamed methods. We need to search a new way.\n. I am trying to upload an app without this methods\n. From recent review, NSAProperty accessors are confirmed as safe for App Store review.\n. Hi! I finally got (maybe the first) real app with UI7Kit: https://itunes.apple.com/app/id444076697\nReviewd by Apple just some hours ago.\n. Yes, we are. I will try to remove them. Thank you for report.\n. @Lithiums Try 0.9.1. It must be clean\n. Those selectors are removed in 0.9.8\n. @Lithiums I am really happy that no apps are rejected by UI7Kit. Thank you very much :D\n. Great idea. I cannot belieave I never thought about including this as monkey patch target.\n. UI7Font and its patch work now.\n. patch for #4 \n. Great, really great work. Thank you!\n. @viking2009 Theoretically it would be more safe, but actually, they are same. That test is intending not only to test it has onImage selector but also to test it is iOS6 SDK or not. By reference of Apple, they works in same way.\n. KLSwitch is integrated recent day. I will release updated version soon\n. I released 0.0.14 with KLSwitch to cocoapods\n. Manually merged\n. Thanks!\n. I have a question. I found you prefer UIScreen to UIWindow to measure screen size. Any reason or benefit of it? I am not good at these issue. I want to know if it is reasonable or preference. Thanks for recent patches!\n. I retouched some lines.\nI think we cannot assign frame in -show methods. It breaks showing animation. If we want to arrange items to center, we should move up and down all the subviews including backgroundView.\nSo I removed the self.frame part. I think we can calculates total height and set each subviews frame one by one.\n. I didn't fix it. Instead of fixing, I gave up to align it to center.\nAny good idea to changing them before starting animation?\n. @LeoNatan Thank you for the advice. I thought UIAlertView should be shown in the middle of the window. Is this right?\n. Thank you very much! Great hint for implementation.\n. I tried to disable UI7TextField. And UISearchBar is still broken.\n. Oh, sorry. I just removed patching at last time. Category implementaion is the problem. Thanks\n. Temporary removed the overriding. And I found I forgot about UISearchBar! \n. related issue #42 \n. Any unresolved issue?\n. This code removes cancel button in iOS5.\n. Manually fix, rebase & merged to db54b571c519e648f194d3e77c469fd8ebb73b29\n. Manually merged as 908ba4c1e736f27597884038cb3ef32b5646a4e0 after reindent & rebase\n. About UIAlertViewStyleLoginAndPasswordInput, I am seeing it works for simple title, message and 2 buttons. Could you share your code?\n. Your alert view looks fine for me.\n\n. I confirmed even buttons are not rendered either. Because this was pull request, I want to close this request. I think we should creates new issue for this.\n. Opened new issue\n. Great work! Thank you!\n. As I know, it is not UIPickerView redraw for iOS6. See the screenshots.\nInstead of it, I once considered AFPickerView, but it was GPL.\nI think I should reimplement this from UIView.\n. I am sorry but picker view has lower priority yet. Because I think it is very hard to implement a picker view looks like iOS7 one, I just want it looks like flatten designed thiing temporary. I hope I can replace this work with existing library, but didn't tried anything yet.\n. Current rough implementation of UI7PickerLikeView kills UIDatePicker when it is patched.\n. current progress:\n\nI have no idea how to do more.\n. Could you paste 3 commands results to understand this more?\n1. Get the cocoapods version\npod --version\n1. Get the installed cocoapods files. In the project directory,\nfind Pods\n1. Get the error messages with compiler options. In the project directory,\nxcodebuild\n. I found I was using old version of cocoapods. It is solved now. Thank you for reporting!\n. If you met problem again reopen please :)\n. Mmm, ok, how about rm -rf Pods Podfile.lock && pod install?\npod install shows you some warning, if you set wrong your project. If you have any warning, you should fix it first.\n(it may includes warnings about header path)\nOr, if your app is not first target of your project, move your target to first of your project and retry again.\nI think this is cocoapods issue, actually. And these are how I solved it usually.\n. This script works great ;)\n. I removed the seperator because iOS7 action sheet doesn't have seperator bar.\n\n. Oh.. indeed. I found other test with less buttons draw the seperator too.\n. About origin.y, it has origin.y += 20 code in the existing titleLabel if statement. Moving it out of the if statement will fix this. \n. I fixed this. Thank you!\n. This is fixed, except dim view. About dimView, even setHidden: doesn't work. I have no idea.\n. Patch is reverted due to terrible bug on iPhone / iOS6\n. @gribeiro-mobirama Not yet.\n. @gribeiro-mobirama I am sorry. I was totally forgot that I patched the input once. Input works well. Try it.\n. EERRRMMM!! I don't understand how this work like this way. It passes all the patching code but only title is changed.\n. No way at this time. But I think I should add that mechanism. I think more cases will be found in the future.\n. The idea 'suppress patching for configured subclasses' would not work. MFMailComposeViewController is a subclass of UINavigationController. But the bar configuration is set up by UINavigationBar.\n. @thomassnielsen OK. I changed approach. Instead of patching MFMailComposeViewController or exclude MFMailComposeViewController from the patch list, I just patched MFMailComposeViewController to strip patched properties from the navigaion bar.\n. 0.6.2 includes this patch\n. Oops.. terrible mistake\n. Thank you for report!\nAnd @thatsmystapler , Thank you for the patch!\n. @antgly Sorry I forgot to release the update. 0.2 includes it.\n. I installed ShareKit through cocoapods, but got no compiler error. Would you share me the error messages?\n. I fixed precompiled header errors for old cocoapods. Retry again with UI7Kit 0.3.1 and please let me know if problem doesn't become resolved.\n. I guess this can be resolved with cocoapods update or 05f8936ac75efa48623a2a5f07f5010a8ae7f047.\nIf problem is still not solved, please reopen this issue again.\nThank you all!\n. Hi. Would you share me the error log?\n. Thank you.\nI am sorry but I am not sure this is problem of UI7Kit. Your xcode doesn't find NSString from Foundation and this is not a possible error from UI7Kit as I know. When I first installed xcode5, I edited SDK header accidentely and got similar problem.\nTo check the problem concreately, try this things and let me know the result.\n1. Remove UI7Kit from your project and try to build without UI7Kit. - If error still exists, something other problem\n2. If problem is cleared but raised again after attaching UI7Kit, please paste here the header including order of your code, including UI7Kit (maybe only main.m if you followed the instruction)\n. I tried to reproduce the same environment, but uikit-appdelegate-ui7kit doesnt make any problem for my project. I hope to have zipball of entire project directory, but i guess it is not easy for you due to license or nda.\nI have a public project with ui7kit qrqr: https://github.com/youknowone/qrqr\nI wonder you can build this project or not. This helps to know your problem is project-specific problem or environment-specific problem. (in fact, i am not sure what to do next afrer this)\nSorry for not very helpful advices.\n. Oh.. I forgot about the submodule. Sorry for lack of instruction.\nI still guess it is a header including order issue, but not sure. I really want to see the archive of the project. I feel blind now.\nCould you make a minimal project archive, removing sensitive files which should not be public?\n. I fixed precompiled header errors for old cocoapods. Retry again with UI7Kit 0.3.1 and please let me know if problem doesn't become resolved.\n. Thank you about letting me know you solved it.\nI checked current version with cocoapods 0.20.2 works finely. So kind of issues may be reproduced again.\n. This problem will be fixed in next release. By the way, if you want, you can use round-rected flat style button with UI7RoundedRectButton for 'Go' button or 'Favorite Book' button.\n. 0.3 is released\n. Seems related to #43, but no problem here.\nCould you copy the error logs?\n. It looks cocoapod doesnt recognize precompiled header option. What version of cocoapod do you use? you can find it ith 'pod --version'\n. I fixed precompiled header errors for old cocoapods. Retry again with UI7Kit 0.3.1 and please let me know if problem doesn't become resolved.\n. Hi. Would you share me which datasource and delegate did you implement? Basic implementation for 'titleForSection' is supported. But it doesn't seem that case.\n. @emichaud I want UI7Kit replace the UITableView gracefully. So I want to test the library too. Is it http://sensiblecocoa.com/ ?\n. @segiddins Do you also use sinsible cocoa or other table view component?\n. About background, I still am not sure what you mean or what's the expected result for you. At the last time, I thought it was background color. But it doesn't seem like that. If you are saying about background pattern, it is not iOS7-like background. If you have xcode5 preview, try to build it with iOS7 SDK and run it on iOS7 simulator. Screenshots of iOS7 simulator and UI7Kit must be great explaination of the difference.\nAbout the switch problem, new issue may be better. I always appreciate new issue for any unrelated issue. Because I usually forgot issues and reminds them from issue list. :)\n. Oh.. you were talking about the spaces between sections. This is strange... I beleaved this issue was resolved. Would you share me which datasource and delegate did you implement?\n. I fixed background color, but I am not sure what's the problem of the section headers. There is 'UI7KitCatalog' app in the UI7Kit.xcworkspace. It also is a static table view, but has no problem with sections.\n. patch 873fae5 is released. It is confusing that the header looks ok only for me...\n. @Urkman Sorry. I misunderstand the behavior. I remade the background color policy of table view and cell now\n. Sensible table view problem is due to stupid implementatino of UITableView delegate. I should rewrite UI7TableView delegate to solve this problem.\nWorkaround: Use 1 to 1 relation with table view and its delegate.\n. Mmm.. by recent review, I found sensible table view model returns 22.0f for height for section. The expected default behavior is -1 for default height. This could not be solved without special handling for sensible table view\n. 0.9.2 is released with this patch\n. Thank you. For quick fix, Try this temporary workaround:\n[[stepper layer] setBorderColor:[UIColor clearColor].CGColor];\n. In iOS5, border follows transforms. In iOS6, not. hmm.....\n. You should build your app with iOS7 SDK. Because UI7Kit only is enabled on iOS5 or 6, your app built with iOS6 SDK doesnt has appearance of iOS7.\n. I never tested it, but you can try [UI7Kit patch] instead of [UI7Kit patchIfNeeded]. It will patch iOS7 too.\n. I am not sure I should fix [UI7Kit patch] for iOS6 SDK. I will try this if this is an easy problem.\n. I forgot to reference this issue. Thanks to @segiddins , This is solved in 96788d48a6570880fb3d4aeca76a5dca9028a56a .\n. 0.4 is released\n. You missed pod setup after installing cocoapods\n. Because you don't seem to have any problem during a week, I close this issue.\nIf you met same or other problem, please feel free to reopen this issue.\n. @m1entus Hey, it looks great. I didn't use it in this project, but I am trying to use it to another app. Thanks :D\n. 0.9.4 is released with basic support of UI7ActivityViewController theme\n. Great fix!\n. I've merged first commit manually. 86d8fde8b1f722d828788a92815258f47f0ec710\n. 0.4 is released with this patch.\n. I didn't noticed this issue. Next release will come in few hours.\n. 0.4 is released\n. Let me know if you have any problem with Apple :)\n. @Urkman Do you mind if I add your app to https://github.com/youknowone/UI7Kit#apps-using-ui7kit ?\n. Thanks. I added it just now :)\n. I will try this in this weekend. \n. Original issue is resolved in 0.7.2. setOn: issue is splited to #66 \n. Looks great. Thanks for good testing tool. \n. What is the expected behavior in iOS7?\n. I wonder something goes wrong with header processing. 'Duplicate interface definition' error raised only when header has duplicated class. I can say nothing without more information. How did you met this error?\nIf you met this error while compiling Pods, let me know the cocoapods verion (pod --version in terminal)\nIf you met this error while compiling your project, shoe me the precompiled header and all the header include parts of this path. You will see the include path if you click triangle of this error in left side bar.\n. mmm... Why is your project trying to search header from .Trash?\nI hope you check the files one of In file included from ... and one of `Previous definition is here. I need content of these file and path. I think cleaning trash make all happy.\n. I am not sure what's the expected result. About segmented control, see discussion from #12. About images, show me expected result, built with iOS7 SDK without UI7Kit.\n. Because no additional information is given during more than a week, I close this issue. Whenever you have any problem or information of this issue, feel easy to reopen or open any issue.\nThanks!\n. @huadee Unfortunately, I don't speak chinese. Please comment in English if you want to join this thread.\n. I wonder how did it compiled with calling setTableView: without update. But solved anyway :D\n. This is weird. Could you show me the callstack?\n\nSelect the sidebar like screenshot and copy & paste it.\nYou tested with iOS6 SDK + iOS6 simulator, right?\nThanks! :D\n. mm.. I prefer textual copy&paste becasue it has more information. You can copy it with Cmd+C.\nthe UI7TableView in stack 40 and 27 and 1 are same or different?\n. Because other 4 apps with UITableView doesn't have crash problem and sensible table view calls are in your callstack, It seems new feature (accessory support) of UI7Kit conflicts with sensible tableview. I think I should review sensible table view issue. To avoid this problem temporary, comment out the patch line: https://github.com/youknowone/UI7Kit/blob/master/UI7Kit/UI7TableView.m#L103\nThis code is used to fill tint color to your table view cell accessory, so not a big deal.\n. 0.7.5 is released with the fix\n. Reopen #67 . Sorry. I only tested setter part. I should patch getter for that code.\n. Not a UI7Kit issue, close\n. Sorry. I forgot to implement it. 0.7.4 is released now.\n. 0.7.6 is released with this fix.\n. Prompt looks fine / Scope bar looks ugly\n. I have no idea how to make it to normal segmented control :|\n. Oops.. I lost writing comment and it is too sleepy. Saying breif\n1. Dynamic patch is one-pass phase. So it doesn't work anyway\n2. respondsToSelector also doesn't work. The basic work of UI7Kit work is wrapping existing implementaiton of the selector. So it copy the selector to the other name and patch the new implementation to that part.\nI have plain to review Sensible table view. I think something patching process is conflict to what sensible table view does. So i will find a way to avoid the conflict.\nif you want to dig it, i think the good point is not the patching part but the calling part of original method, which make bad access. I am really curious that what sensible table view does that make this conflict ;)\n. Oh, it must be great. Could you send me it to the email?\n. Oops, I thought github shares my emil to you. it is \n. #65 is closed. I found your test app is full of the problems. I am seeing #61 here, also. And even switch width is strange.\n. Switch width is fixed in 0.8.10\n. How did you set your text color? By technical issue, Interface builder color of UIKit with iOS7 SDK under iOS6 cannot load text color. If it is not this case, let me know how to reproduce it. I will check it is bug or technical limitation.\nTo set text color always, set the tintColor of the button.\n. I am sorry for late reply. I fixed this problem (textTitleColor is ignored even if it is set) in 0.7.7 and released it just now.\nThank you for reporting and tips ;)\n. Additional fix in 0.7.8. Use 0.7.8 for dynamic setTitleColor:\n. Your code makes no error itself. (test app issue 71) Could you share me a real code or more specific condition to reproduce this crash?\n. Mmm.. I thought iPad was the reason but it is not BAD_ACCESS\n. No, I found crash on iPad. But when I checked the error message, I found it is not BAD_ACCESS. So different reason.\nI feel hard to create new, working project with your codes. Could you share me zipball of the project (if it is allowed) or create minimal, buildable project to reproduce this issue? I even not sure I can reproduce the problem with this code.\n. Close because it is not reproducable at this time - please reopen this if problem still occurs and can report reproducable environment.\nI am sorry that I coudn't help this problem.\n. Fixed in 0.8.10\n. 0.7.9 is released\n. Duplicated of #77 . This issue was created first, but less discussion. So I close this one. I am sorry for confusing.\n. Since UI7Kit doesn't using ARC, ARC would not be a problem.\ncolorWith8bitRed:green:blue:alpha: is a FoundationExtension selector. Check your project has 'FoundationExtension' and this method exists in it. I think I once changed its name colorWith8BitRed:.. -> colorWith8bitRed: . This may be a problem, but it still seems strange because your multiple reinstalling must make them latest.\nCheck FoundationExtension and its method and let me know. I will think about more issues about it.\n. Static library looks not linked well. There is category extension linking bug in old compilers.\nCheck this points.\n1. Do your app link libPods?\n2. Do your app is compiled by -ObjC compiler option?\n3. Do your app is compiled by recent clang compiler? gcc requires additional linker option link -all_load or -force_load\n. If you feel ok to share zipball of entire project, it must be best hint for this problem. My email is public@youknowone.org\n. It sounds this will be easily solved by cropping the thumb image\n. 0.8.9 is released with cropped image - looks ugly now. I need new image with redrawn shadow\n. #12 has related discussion (still not solved)\nAnd.. it is the Parlance! I tried to build it some days ago, but failed because i couldn't find the way to install all the dependencies.\n. @LeoNatan Thank you for great advice! intrinsicContentSize looks magic key of some of UI7Kit problems. \n. @LeoNatan @steakknife I hope you guys don't try to require patch or writing code for an idea each other. You can suggest anything or try to patch everything, but I hope all of them are from your own good will or contributions - not by forcing or forced ;)\nAnd thank you both to help to solve this issue!\n. 0.8.9 is released\n. If you still have problem after updating, please don't hesitate to reopen this issue anytime :)\n. I didnt' check it yet, but interface builder option of tintcolor maybe ignored, beause it didn't exist under iOS6 SDK.\nI released 0.8.5 and you can set tint color directly, now.\n. If this problem is not solved, please reopen this issue anytime. Thank you for report!\n. Thank you! I tried this app but whenever I click 'create new account', app is blocked. Any idea?\n. iOS6.1\n1. Open Slader\n2. Touch 'Create Account'\nApp doesn't respond anymore\nThe 'Create Account' button is pressed in step 2 and never be popped again.\nIf I wait for some minutes, app is terminated. (i guess network timeout + exception, but not sure)\nAfter reopening, same.\n. I fixed the BlocksKit UIAlertView problem.\n. 0.8.8 is released\n. Thank you for suggestion. Any help available? We should package source+resource for each controls to do this.\n. Mm, sorry. I failed to describe 'help'. I have not enough time to do everything. So I am spending my time to implementing features or fixing bugs as the highest priority. If no one helped to do this job, this will be long-term goal.\n. If I do this as long term job, I will do first 'replacing embedded images to images drawn by code'. This will reduce most of icon size.\n. Welcome!!! :D\nKnown dependencies:\nUI7View -> All\nUI7TableView -> UI7PickerView\nUI7BarButtonItem -> UI7TableViewController\n. 0.8.8 is released with this patch, thanks!\n. Thank you for great support :D\n. I should rewrite delegate part of UI7TableView for this issue. It will not be done very soon, sorry.\n. 0.9.2 is released with this patch\n. I use CALayer for gradient and border radius, nothing other. Actually, I don't know much about CALayers.\nWill you try 0.8 instread of 0.8.7? I changed switch implementation recently and I found many layer accesses in there. \n. If it is switch problem, I will report it to switch implemenation. Else, you can find 'CALayer' and '.layer' as keyword to all the CALayer access of this project. (except dependencies)\n. Thank you for test\n. Oh... what a strangeness. One more test request\nWithout UI7Kit installation, do you have CABasicAnimations problem with installation of only FoundationExtension?\n. It sounds like Foundation or UIKit has that named internal method. I will try to rename it.\nCould you share me any CABasicAnimation test code? I have no experience about it.\n. Thanks!\n. 0.8.12 is released with this fix. Thank you! Without your help, I never found this bug.\n. 0.8.8 is released. Update it :)\n. Awesome! I never though podfile can be described in this clarified way.\n. A github tip: if you push your branch to original pull request branch, the pull request is updated. In this case, push --force make it updated to single recent commit.\nI will merge this after this app is updated and people can use it. I will not forget. Don't worry :)\n. I still cannot 'Create Account' yet\n. Oops, you are right. I didn't consider it. I am doing\n. And 'activate / later' alert view seems fine to me :)\n. Mmm, yep. I am sorry that updated version had regressions \n. I checked it and looks great :D \nI have a question: how did you make the upper toolbar of keyboard that color? issue #61 seems it should be not like that.\n. Hi. I am out so i caanot review this issue now but test app includes both storyboard uipickerview and decoder logs. Most of decoder properties are logged to test app console. uiswitch uses similar implementation.\n. project under UI7KitTestApp is xcode4 project and Storyboard.storyboard also 4.6.3 compatible.\nproject under UI7KitCatalog is xcode5 project and i will move this project to autolayout\n. I tried to switch UI7KitCatalog to xcode5 project, but I am not experiencing crash. Could you share me your test project?\n. In my case, it didn't crash but totally unusable - no click, no scoll etc\n. Please don't close unsolved issue.\n. 0.8.16 fixed no control issue but not alignment\n. 0.8.9 is released\n. I have a question.\nWidth is set by this code:\nMAX(self.frame.size.width, 2 * superCS.width + superCS.height)\nWhere this expression comes from? I treid superCS.width instead of it and found no problem for normal/portrait app. So I want to know which bug case is prevented by this expression.\n. I also am testing storyboard segmented control, but no problem with initial-width.\n. I melt your commits to 1 commit and merged it manually: 9b5c34a18fd66f4dd194f2c185969dec335b542a\nAnd revert width-fixing code - because it caused unexpected behavior with pinning. If you pin left or right side of controls, the width expression make segmented control to expand too much.\n. Though you already bombed your comments, I read it from mailbox.\n1. I cannot see the images, but I forgot about setFrame:, thanks.\n2. Thank you for proposed values - because I tested them based on your code, but I already mentioned what was its problem. We may can find better solution to solve both problem - but I cannot allow obvious bug behavior. Pinning one-side is common action. It should not be broken by patch.\n3. I have my main job and I need to sleep. Even more, you and I have quite different timezone - it means if you have free time, I am not then usually. If you expected 24/7 responsive here, I am sorry. I cannot do it.\nThank you for great helps and I am so sorry to miss you. Your patches were great advances. Good luck for you too.\n. Thank you for many patches!\nWhile reviewing your patch, I tried:\n```\n@implementation SevenSwitch (Patch)\n\n(CGSize)intrinsicContentSize {\n    return CGSizeMake(51.0f, 31.0f);\n}\n\n@end\n```\nAnd worked great for all the iOS5/iOS6 without autolayout and iOS6 with autolayout.\nSo I think 'UI7KIT_HAS_CONSTRAINTS' is not nessessary. Am I right?\n. I fixed it slightly more and manually merged it: e3af9a2148fe41acb65f9924babf0fa828f4c1a2\n. Great. I didn't know that. I copied them if i can access there - like buttons, but nothing others.\n. @LeoNatan It is good advice, but I was already using screen capture of iOS7 to retrieve resources of iOS7.\nAnyway, I exported resources from main repository not to mix licenses.\n. Oops, thank you!\n. iPad support code kills iPad.. thanks :)\n. 0.8.19 is released with workaround\n. 0.8.13 is released. If you stil experience problem, reopen this issue please.\n. Sorry. new 0.8.15 with fix now. I didn't tested it but it will not allow nil object now.\n. Did you checked iOS7 screen of that page? UITableViewCellAccessoryDetailButton is introduced for special usage.\n. Thanks. Could you give me environment hints?\n1. OS version\n2. SDK version\n3. Autolayout usage\n. Would anyone share me bug-reproducable test project?\n. Great! Thanks!\n. Thank you for report. From your report, I found UI7Kit has bug for [composeActionSheet showFromRect:CGRectZero inView:tableview animated:YES];\nWorkaround: Use 'showInView:' to avoid this bug.\nTip: You can paste your code pretty with 4-backquote.\n. 0.8.18 is released with this fix. If you still experience this bug, feel free to reopen this issue.\n. I think I forgot to add protocol. Sorry.\n. Great, and thank for suggesting background color value. I melted your commits to 1 commit and merged it manually. Merge is 79b99cbeb5e7e4cfa384de774b42a213bbf0c60c\n. Your commit is: bf6b7f7be280747fefc6bfd46b3a7842674f3f5d\n. This patch is really good. I doubt I never could imagine shadow was just an option of navigaiton bar.\n. Thank you! looks good!\n. Thank you for great patch!\n. Great! It looks perfect. @segiddins and @iT0ny would be happy too.\n. tag #31 \n. I am sorry that reviewing is delayed. I will check this tonight :)\n. Great. is layoutSubviews make this magic ? :D\n. This patch fix #89 \n. I am sorry about taking over this. I tried it and it works really well.\n. Thank you for report. Could you explain more about last comment? do you mean '?' for blank picker view content?\n. Oh, unfortunately, viewForRow: is not implemented in UI7PickerView yet, sorry.\n. No way to do it yet. I should add viewForRow: support for that.\nI think I should try something first. I will ask things while doing this. Thanks!\n. 1. viewForRow: is supported now - but I am not sure this implementation is similar to UIPickerView\n2. about textColor or selectionIndicatorColor, I found this is also not customizable in UIPickerView. So I implemented it in UI7PickerLIkeView but didnt reveal them to UI7PickerView. I wonder how did you do that in iOS7.\n. About grouped table view, did you remove color of table view in iOS7 or did you remove spaces between section by section? And how did you do that?\n. viewForRow: working example:\n\ncode: https://github.com/youknowone/UI7Kit/blob/master/UI7KitCatalog/UICPickerViewController.m#L71\nNOTE: Text is not visible in iOS7\n. Try 0.9.7. I fixed color problems.\n. I am sorry for late. Time is always running.\nSee commit 1a61f65002e3a451e417ff58ef64e1f9885fb09b\nYou can try it from 0.9.8. If you still are seeing gray background, try to change UIWindow background color to black. (I didn't tested this)\nIf it still fails, edit the values from code as workaround. white:0 alpha:255 will make it perfect black.\n. I wrote a test code but I found no problem. Could you try my test and figure out what's the difference? Test is UI7KitCatalog -> picker view\n. How did you set it to multiline? I am seeing single line for long text too.\n\n. Oh, I found this is only for grouped table view\n. Mm.. Did you tried SDK 6.0 + deployment target 7.0?\n. No, it is my fault. I will fix it soon.\n. welcome :)\n. Looks important idea, but I have no idea to do this easily\n. If its behavior is different from iOS7, it is bug :)\n. Thank you. I always wondered why some apps has unpatched back buttons.\n. Do you want black background of navigation bar?\n. Do you have black background below the navigation bar? Its color is following iOS7 alpha value now\n. I found tabbar/navigationbar default background color is black\nself.tabBarController.view.backgroundColor = [UIColor whiteColor];\n    self.navigationController.view.backgroundColor = [UIColor whiteColor];\nI think this is so confusing.. I have no idea how to set default value of bar color. \n. You use iOS6. It means your table view is not under your navigation bar\n. default bar color is reverted to alpha 255. I should think more about this issue. Thank you for report\n. I've replaced assets to iOS original assets. So it will be ok ;)\n. It seems to be not implemented yet. I am sorry that currently I have no time to review any issue. I will notice in comment for any progress in future.\n. OMG... how clever solution is it.\n. It is sad that this patch didn't fixed #39 \n. Thanks for great patch! Check 0.9.11 for your patch :D\n. Fixed dependency. Retry please :)\n. I am sorry for late. 0.9.12 is released today.\n. Thanks :D\n. 0.9.13 is released with your patch. Thanks!\n. 0.9.13 is released with your patch. Thanks!\n. Thank you! 0.9.14 is released.\n. Great point, Thanks. I can't belieave I never run static analyzer for long time.\n. fixed in 0.9.15\n. UI7PickerView is not a behavior patch but a replacement of implementation. So it doesn't auto-adjust to UIDatePicker. I need to implement it independently.\n. Thanks!\n. released with 0.9.16\n. released 0.9.17 with this patch\n. Thanks! released as 0.9.18\n. Hi. These tables are static table view controllers and I can't figure out the problem you described.\nCould you help me some more?\niOS6 + UI7Kit\n\n\niOS7\n\n\n. See the error message. Because FBTokenInformationExpirationDateKey is not a symbol in UI7Kit, I can't fix it form UI7Kit. I am not sure where it is, but you may miss some library from linking.\n. Thanks for great patch. But could you remove .podspec file from the patch? I think I should release new version of UI7Kit, not a b1 :)\n. Thank you! It's great patch.\n. I am sorry to take long time to release 0.9.19.\nIt is now available via cocoapods\n. Thank you!\n. Updating to cocoapods to recent version working for this issue?\n. Hello.\nBecause I was absense for this project for a while, I don't know well about issues now.\nBecause I recently merged a patch related to the header, I am guessing it is related to new cocoapods version.\nThis issue seems related in backward way: https://github.com/CocoaPods/CocoaPods/issues/2536\nSo I guess updating cocoapods version will fix the problem. How do you think?\n. Thank you! lol\n. My fault. 0.9.20 is released. Now just pod 'UI7Kit' also available.\n. Thanks for fixing :)\nI have a question. How about the color? is it really that color with that alpha? I don't know the behavior, but it seems 0.06 and 1 is very different. Changed one is correct for transperant background behaviors?\n. Oh, it makes sense. Thanks :D\n. ",
    "dfmcphee": "Thanks so much, looks great.\n. ",
    "KieranLafferty": "Hey thats hilarious I came here specifically to offer this to be used in your project. Glad to see someone beat me to it!\n. I forked the repo and got my control to display in place of the UISwitch using your FoundationExtender, I was wondering, how can I make my KLSwitch coding compliant with UISwitch such that it receives the 'onTintColor' and 'on' properties that are specific to UISwitch, any thoughts?\nWhat I tried so far was to manually decode the coder passed to initWithCoder using keys looked up in the storyboard file\n```\ndefine kCodingOnKey @\"on\"\ndefine kCodingOnTintColorKey @\"onColor\"\ndefine kCodingOnColorKey @\"onTintColor\"    //Not implemented\ndefine kCodingTintColorKey @\"tintColor\"\ndefine kCodingThumbTintColorKey @\"thumbTintColor\"\ndefine kCodingOnImageKey @\"onImage\"\ndefine kCodingOffImageKey @\"offImage\"\n\n\n(void)encodeWithCoder:(NSCoder *)aCoder {\n    [super encodeWithCoder: aCoder];\n[aCoder encodeBool: _on\n            forKey: kCodingOnKey];\n[aCoder encodeObject: _onTintColor\n              forKey: kCodingOnTintColorKey];\n[aCoder encodeObject: _tintColor\n              forKey: kCodingTintColorKey];\n[aCoder encodeObject: _thumbTintColor\n              forKey: kCodingThumbTintColorKey];\n[aCoder encodeObject: _onImage\n              forKey: kCodingOnImageKey];\n[aCoder encodeObject: _offImage\n              forKey: kCodingOffImageKey];\n}\n\n\n(id)initWithCoder:(NSCoder *)aDecoder {\n    if (self = [super initWithCoder: aDecoder]) {\n_on = [aDecoder decodeBoolForKey:kCodingOnKey];\n_onTintColor = [aDecoder decodeObjectForKey: kCodingOnTintColorKey];\n_tintColor = [aDecoder decodeObjectForKey: kCodingTintColorKey];\n_thumbTintColor = [aDecoder decodeObjectForKey: kCodingThumbTintColorKey];\n_onImage = [aDecoder decodeObjectForKey: kCodingOnImageKey];\n_offImage = [aDecoder decodeObjectForKey: kCodingOffImageKey];\n_onTintColor = [aDecoder decodeObjectForKey: kCodingOnTintColorKey];\n\n[self configureSwitch];\n\n}\nreturn self;\n}\n```\n\n\nI received the decoder keys for UISwitch using https://github.com/nicklockwood/AutoCoding to list all the NSCoder keys for the class. Here is the list\nonColor,\nonTintColor,\ntintColor,\nthumbTintColor,\nonImage,\noffImage,\non,\nenabledAlpha,\nenabled,\nselected,\nhighlighted,\ncontentVerticalAlignment,\ncontentHorizontalAlignment,\nskipsSubviewEnumeration,\nviewTraversalMark,\nviewDelegate,\nmonitorsSubtree,\nbackgroundColorSystemColorName,\ngesturesEnabled,\ndeliversTouchesForGesturesToSuperview,\nuserInteractionEnabled,\ntag,\nlayer,\n\"_boundsWidthVariable\",\n\"_boundsHeightVariable\",\n\"_minXVariable\",\n\"_minYVariable\",\n\"_internalConstraints\",\n\"_dependentConstraints\",\n\"_constraintsExceptingSubviewAutoresizingConstraints\",\n\"_shouldArchiveUIAppearanceTags\",\nrestorationIdentifier\nMy concern is that decoding the NIB may cause apps to get rejected by the App store for doing some shady things. \n. Also, not able to retrieve values from the NSCoder passed from the storyboard\n. Yea the issue is that the switch inherits from UIControl not from UISwitch. As such the two classes are siblings and KLSwitch does not automatically decode the switch.\nThe alternative would be to inherit from UISwitch and make use of the decoding functionality of UISwitch while hiding the UISwitch view layer. However, this is a pretty hacky solution which would use much more memory for very little functional gain.\nThe best solution would still be to decode them from the NSCoder as that has the details of the runtime vars from the UIStoryboard. Just need to find out why the keys arent workign currently :S \n. What I did in the ui7switch was to use the uo7switch to decode the KlSwitch with the UISwitch decoder passed from storyboard. Sounds confusing but basically it's like this\n(On phone so excuse bad formatting)\n-(id) initwithcoder:(nscoder*) adecoder {\nself = [[KLSwitch alloc] initwithcoder: adecoder];\nIf(self){...}\nReturn self;\n}\nSo basically this allows it to receive all of the storyboard coded attributes for uicontrol (shared parent of UISwitch and KlSwitch) but does not receive the attributes specific to UISwitch (on, tintcolor, etc)\nAlso this sort of feels weird doing it this way there must be a better way \n. So I updated my fork of this to work well with KLSwitch\nThings that work:\n1) Grabs decoded values from UISwitch by instantiating a UISwitch with the coder then grabbing properties and setting them on the KLSwitch\n2) Constrains the frame size to the height of the UISwitch and the standard proportion of the iOS 7 Switch\nFiles changes\nUI7Switch.m\npodfile (had to specify 5.0 in order for compatibility with KLSwitch\nTODO: \nGrab values from IB without having to create a dummy switch to grab the IB configured properties unique to the switch\nLet me know if you want me to create a pull request for this\n. https://github.com/kieranlafferty/UI7Kit\n. ",
    "gabrielribeiro": "How do I change the color and text of a back button?\n. You are doing a very great job! Can't wait for next release! =)\n. Yeap, still problems with textinput in UIAlertView, using iOS6\n. I have a problem with this control when using in iPod 4th with iOS6. The segmented control present just a line in the middle of the text, very ugly.\n. Yes, in iPhone Simulator in Xcode DP2:\n\nMy code:\n``` obj-c\nNSDictionary * selectedAttributesDictionary = [NSDictionary dictionaryWithObjectsAndKeys:\n                                                   [UIColor whiteColor],\n                                                   UITextAttributeTextColor,\n                                                   nil];\nNSDictionary * deselectedAttributesDictionary = [NSDictionary dictionaryWithObjectsAndKeys:\n                                                 [UIColor redColor],\n                                                 UITextAttributeTextColor,\n                                                 nil];\n\n[segmentedControl setTitleTextAttributes:deselectedAttributesDictionary forState:UIControlStateNormal];\n[segmentedControl setTitleTextAttributes:selectedAttributesDictionary forState:UIControlStateSelected];\n\nfor (int i = 0; i < [segmentedControl.subviews count]; i++)\n    {\n        [[segmentedControl.subviews objectAtIndex:i] setTintColor:[UIColor redColor]];\n    }\n```\n. Thanks a lot man! I did like you did, initializing the segmentedcontrol in ViewDidLoad with frame size. That worked fine, but in iOS6, just blue, not red. In iOS7, the red tint color worked normally. And clue about this tint color in iOS6? Am I doing shit again?\n. Thanks a lot! That worked fine! Great job!\n. Yes. That ugly stroke just happened with me when under these conditions. If you could fix it, would be nice for others. To me, creating the segmetedcontrol programatically resolved. :+1: \n. Some news about the input in UIAlertView?\n. Actually, I still have some issues related to layout =/\n\n. Thanks. Worked.\n. Uh :(\n. ",
    "segiddins": "Sometimes, the back button uses the old style.\n\nThis happened after selecting a table view cell from a search display controller table view\n. Well done!\n. @youknowone this looks like a visual glitch\n\n. Probably related to the commits referenced by #73 \n. Also, UIAlertView is heavily broken with Appirater\n\n. I'd rather not opt out of UI7AlertView.\nThe problem seems to be related to the row calculation in UI7AlertView's -relayout.\n. @youknowone as soon as we can figure this out I can ship a new version of my app that fixes the bug you noticed\n. objc\nUIAlertView *alertView = [UIAlertView bk_alertViewWithTitle:@\"Activate Your Account\" message:@\"You need to activate your account. Go to slader.com/account/activate/please before it's too late.\"];\n[alertView bk_addButtonWithTitle:@\"Activate\" handler:^{\n     NSURL *activateURL = [NSURL URLWithString:@\"http://slader.com/account/activate/please\"];\n     [[UIApplication sharedApplication] openURL:activateURL];\n}];\n[alertView bk_setCancelButtonWithTitle:@\"Later\" handler:nil];\n[alertView show];\nAlthough I'm using BlocksKit, I don't think that's what's responsible.\n. @youknowone any update?\n. The old background is still showing\n\n\n. I have a fix for this that i will issue a pull request for shortly\n. Thanks!\n. Im also not getting the right background color for table and section headers\n\n. No\n. The issue seems to stem from -[UIBarButtonItem(Patch) _barButtonItemInitWithFont:] UI7BarButtonItem.m:46. \n*** Terminating app due to uncaught exception 'NSInvalidArgumentException', reason: '*** -[__NSPlaceholderDictionary initWithObjects:forKeys:count:]: attempt to insert nil object from objects[1]'. My guess is that self.tintColor is nil.\n. Dont merge this - I'm getting crashes on launch\n. I had an app accepted last night with 0.3 :)\n-Samuel E. Giddins\nhttp://segiddins.me\nOn Jul 29, 2013, at 7:38 AM, Jeong YunWon notifications@github.com wrote:\nLet me know if you have any problem with Apple :)\n—\nReply to this email directly or view it on GitHub.\n. Could you elaborate?\n. Will look into it tonight. Thanks for letting me know\n-Samuel E. Giddins\nOn Aug 19, 2013, at 1:14 PM, Jeong YunWon notifications@github.com wrote:\niOS6.1\n1. Open Slader\n2. Touch 'Create Account'\nApp doesn't respond anymore\nThe 'Create Account' button is pressed in step 2 and never be popped again.\nIf I wait for some minutes, app is terminated. (i guess network timeout + exception, but not sure)\nAfter reopening, same.\n—\nReply to this email directly or view it on GitHub.\n. Fixed it - had an infinite loop in +initialize\n. thanks @youknowone! I'll check it out tonight.\n. I believe style doesn't get applied when you set a UIBarButtonItem's image.\n. well done, @steakknife \n. Oh the app is definitely useable now, you just can't register in-app.\n. Right, but you can create an account on the website.\n. That's because the version currently in the app store is running UI7Kit 0.3.2 or something like that, when I went to do the bugfixes I also updated UI7Kit.\n. @youknowone v2.0.1 was just approved and should be rolling out very soon!\n. Its a UIButton, I believe\n. ",
    "GarPit": "+1 for styling \"Back\" button\n. \"buttons, cancelButton, systemItem, titleColor\" these selectors was shown in Validation window. UI7Kit 0.9.6\n. This error happened when I've updated with \"pod update\" and previous version was 0.7.*\n. Wow, it's awesome - will try it, thanks!\n. ",
    "omergul": "There is a problem with the Back button styling, is there any solution to this?\n. ",
    "ghost": "The search bar button item also looks weird...\n. \n. I'm still having this issue.\n. \n. build\n\n. Doesn't work SDK 7.0?\n. ありがとう（Thanks）\n. work well!!\nThanks!\n. ",
    "lukaszmargielewski": "Sometimes UIBarButtonItem displays with incorrect font.\n\nInteresting: it happens only when UIBarButtonItem is initialised when its view controller is already visible on the screen.\n. Same for me. And sometimes font gets squizzed on UIBarButtonItems also.\n. ",
    "KorvinSzanto": "Does this include UITableViewStyleGrouped?\n. ",
    "iT0ny": "Hi,thanks for ur hard work! Will there ever be support for grouped UITableView style?\n[upd] srry didn't notice that https://github.com/youknowone/UI7Kit/issues/7#issuecomment-20010184\n. UIActionSheet(v0.0.14) crashes with \"[UIActionSheet _setTheme]: unrecognized selector\" :( \n. Please add UIAlertViewStyle(w/ text inputs) to UIAlertView to-do list\n. Todo: change UITabBarItem badge icon \n. There's a bug w/ rightBarButtonItems & leftBarButtonItems. \n. @youknowone thanks! any news on https://github.com/youknowone/UI7Kit/issues/99 ?\n. MBSwitch is much more similar to iOS 7 UISwitch\nhttps://github.com/mattlawer/MBSwitch\n. Mmm,just a preference)\n. hm. \"we can calculates total height and set each subviews frame one by one\" actually it's bad idea for future enhancements. In non-default UIAlertView styles all subviews got CGRectZero as frame property( \n. ah,seem like u have already fixed that lol, thanks\n. mmm try to use - (void)willPresentAlertView:(UIAlertView )alertView \n. strange, i simply commented UI7TextField.m and UISearchBar's working for me now\n. btw, case UIAlertViewStyleLoginAndPasswordInput: {\n            UITextField field = [self textFieldAtIndex:1];\n            baseHeight = field.frame.origin.y + field.frame.size.height;\n        }   break;\ndoesn't work, because of CGRectZero in field.frame\n. ```\nUIAlertView *message = [[UIAlertView alloc] initWithTitle:@\"Test\"\n                                                      message:nil\n                                                     delegate:self\n                                            cancelButtonTitle:@\"Cancel\"\n                                            otherButtonTitles:@\"Sign In\", nil];\n[message setAlertViewStyle:UIAlertViewStyleLoginAndPasswordInput];\n[[message textFieldAtIndex:0]setPlaceholder:@\"E-mail\"];\n[message textFieldAtIndex:0].keyboardType = UIKeyboardTypeEmailAddress;\n\n[message show];\n\n```\n. found the problem! \n```\nUIAlertView *message = [[UIAlertView alloc] initWithTitle:@\"Test\"\n                                                     message:nil\n                                                     delegate:self\n                                            cancelButtonTitle:@\"Cancel\"\n                                            otherButtonTitles:@\"OK\", nil];\n[message show];\n\n```\nand then, in - (void)alertView:(UIAlertView *)alertView clickedButtonAtIndex:(NSInteger)buttonIndex, try to show the alert i posted before\n. have you tried MMPickerView? https://github.com/madjid/MMPickerView\n. Hm. strange(look at my screenshot).  + there's a problem with origin.y \n\n. maybe that depends on uiactionsheet's height...\n. \n. damn,forgot to update >__<\nsorry for the inconvenience\n. 1. iOS 5/6\n2. iOS 7b6\n3. Disabled\n. just noticed: it only appears in iPhone UI\n. white:( and blue bar buttons\n. mmmm, nope \n\n. :( ok then, why uitableview is black too?\n. uitableview is still black:(( and UIBarButtonItem tintcolor doesn't work\n. ",
    "massimobio": "Somebody did a iOS 7 looking sliding table view cell you might be able to incorporate:\nhttps://github.com/yfujiki/YFJLeftSwipeDeleteTableView\n. ",
    "LeoNatan": "Easiest way of implementing the delete button is implementing similarly to how UIKit is implemented - UITableViewCell contains a scrollview subview, which contains the content view, which contains what would normally be what the user adds in code and/or from Interface Builder. When the user slides the cell, he actually slides the scrollview, which also contains the buttons.\nImplementing this hierarchy internally would give best results.\n. A word on UIScreen vs UIWindow.\nIt is possible to to open many UIWindows at different sizes. You should always find size of the screen from UIScreen at which the view is being drawn on (for example, it is possible to present on a secondary screen).\n. UIAlertView (the system implementation) opens a private subclass of UIWindow and displays it in the middle of the screen. If I recall correctly, this is the same behavior in both iPhone and iPad.\nOn the other hand, UIActionSheet on iPhone opens a private subclass of UIWindow while on iPad it is a private popover controller that is pushed into the view hierarchy.\n. I think the solution to this is implementing -[UIView intrinsicContentSize] and returning the correct bar size.\n. I am not sure which thread is about what, but the above issues, caused by autolayout, has a simple solution, I think.\nI think the solution to this is implementing -[UIView intrinsicContentSize] and returning the correct bar size.\n. Quite a flood there.\nThis is an incorrect fix. If someone adds another height constraint, there would be a conflict.\nUse intrinsicContentSize.\n. I will not have time. Please try my suggestion and see if it helps under projects with autolayout.\n. I have no stake in this project. I will not be using it in my software. I just find the idea behind it interesting and from time to time pop in to suggest fixes. You can take it or leave it. Your attitude is uninviting and obnoxious. Good job.\n. Thank you Jeong, that's good to hear. Keep up the good work!\n. This is a gray area. Opening the artwork file and redistributing content is a copyright violation and risks Apple sending cease and desist letter for the entire project. I think this is an unnecessary risk, you can draw most of the stuff yourself.\n. These properties are used primarily for translucent views. Seeing as how UI7Kit does not introduce translucent navigation bars and toolbars, their requirement is moot. Moreover, implementing \"automaticallyAdjustsScrollViewInsets\" alone would be a difficult feat, one that may require private API.\n. ",
    "lokielse": "hi @youknowone , could you please implement an method which can set the Grouped tableView style(in iOS7) to be like iOS 5/6 which has left right margin & round borders.\n. A similiar issue. my back button is still in old style. maybe depends on usage. \nI found UI7Kit source code, the backbutton style attach in an override method named \"pushNavigationItem\"\nbut, in my case:\nnavigationController.viewControllers = [NSArray arrayWithObjects:homeVC, detailVC, nil];\n. ",
    "mruegenberg": "I get a crash with the latest version on Cocoapods (0.0.12) in UI7SegmentedControl, l. 57.\nThe crash happens because the attributes dictionary gets built with self.tintColor, which is nil for some reason.\n. This was on the iOS 6.1 Simulator.\n. ",
    "kovpas": "The problem is that for some reason -[UISegmentedControl tintColor] returns _UISegmentedControlAppearanceStorage instead of UIColor after any of appearance methods is invoked (i.e. -[UISegmentedControl setBackgroundImage:forState:barMetrics:]). Solution is to save UIColor instance first and then use this saved value within _segmentedControlInit method. For me this fixed crash.\n. @youknowone yep, thanks!\n. ",
    "hamadeguchi": "Crashes on real machine(runs successfully on simulator)\nline 73:\nObjective-C\n    [self setDividerImage:self.tintColor.image\n      forLeftSegmentState:UIControlStateNormal\n        rightSegmentState:UIControlStateNormal\n               barMetrics:UIBarMetricsDefault];\nI traced logic, then I found difference between real and simulator.\nLine 59 of UI7View.m\nObjective-C\n[self __tintColor]\nreturns nil on simulator. return non nil on real machine.\nso I commented next if clause.\nwhich is the best way to fix it?\nthe exception is following;\n[_UISegmentedControlAppearanceStorage image]: unrecognized selector sent to instance XXXXX\n. Thank you for your quick response. I confirmed it solved!\nFYI:\nUI7BarButtonItem.m:118:12: Instance method '-_tintColor' not found (return type defaults to 'id')\n. ",
    "jozsi": "\nFirst one is added from Interface Builder & Autolayout. Stroke appears.\nSecond is added programatically.\nWithout Autolayout it's ok.\n\n. Meanwhile I've updated to iOS7 SDK & Xcode 5 DP4. Running on the iOS 6.1 simulator, 0.6.1 still doesn't fix the problem (UISegmentedControl added to an autolayout XIB). But setting a constraint on the height to 29 works the problem around.\n. Tried 0.8.14, resulted in:\n* Terminating app due to uncaught exception 'NSInvalidArgumentException', reason: '* -[__NSPlaceholderDictionary initWithObjects:forKeys:count:]: attempt to insert nil object from objects[1]'\n. ",
    "piejanssens": "What do you mean by Integrated global tint? \nI have an issue currently where one of my views' button colors are blue (default tint) whereas in all other views the tint is working.\n. Wait wait :) How do you set UI7Kit global tint now then? I don't think I did anything like [UI7Kit setGlobalTint:UIRed].\n. OK Nice, I'll have to check, I hope I just haven't done that yet...\nYou should add that method to the readme :+1: \n. I set the color using Interface Builder in the properties of the UIButton.\nDo I have to set the self.myButton.tintColor manually in ViewDidLoad for each button?\n. ",
    "qiaoyan": "2.5\nWe found that your app uses one or more non-public APIs, which is not in compliance with the App Store Review Guidelines. The use of non-public APIs is not permissible because it can lead to a poor user experience should these APIs change. \nWe found the following non-public API/s in your app:\n_dimView\n_setLabelFont:\n_setLabelShadowOffset:\n_setLabelTextColor:selectedTextColor:\n_titleLabel\n_toggleEditing:\nsetDimsBackground:\nsetUnselectedImage:\nIf you have defined methods in your source code with the same names as the above-mentioned APIs, we suggest altering your method names so that they no longer collide with Apple's private APIs to avoid your application being flagged in future submissions.\nAdditionally, one or more of the above-mentioned APIs may reside in a static library included with your application. If you do not have access to the library's source, you may be able to search the compiled binary using \"strings\" or \"otool\" command line tools. The \"strings\" tool can output a list of the methods that the library calls and \"otool -ov\" will output the Objective-C class structures and their defined methods. These techniques can help you narrow down where the problematic code resides.\nWe appreciate that you may have made the precautions in your code for using non-public APIs, however, there is no way to accurately or completely predict how an API may be modified and what effects those modifications may have. For this reason, we do not permit the use of non-public APIs in App Store apps.\nIf there are no alternatives for providing the functionality your app requires, we encourage you to file an enhancement request. Or, try working with the Apple Developer Technical Support team to explore alternative solutions. \nOn occasion, there may be apps on the App Store that don't appear to be in compliance with the App Store Review Guidelines. We work hard to ensure that the apps on the App Store are in compliance and we try to identify any apps currently on the App Store that may not be. It takes time to identify these occurrences but another app being out of compliance is not a reason for your app to be.\nFor discrete code-level questions, you may wish to consult with Apple Developer Technical Support. Please be sure to:\n- include the complete details of your rejection issues\n- prepare any symbolicated crash logs, screenshots, and steps to reproduce the issues for when the DTS engineer follows up. \nFor information on how to symbolicate and read a crash log, please see Tech Note TN2151 Understanding and Analyzing iPhone OS Application Crash Reports.\nIf you have difficulty reproducing this issue, please try testing the workflow as described in https://developer.apple.com/library/ios/qa/qa1764/Technical Q&A QA1764: How to reproduce a crash or bug that only App Review or users are seeing.\n. ",
    "Urkman": "What is the status here? Has somebody released an app with this?\n. what is the status here? Because I would like to include it in my next update...\n. This is great :)\n. I also have some problems with a grouped tableview. It shows no border, so everything is white.\nI'm using static cell here...\n. I still have no background for static grouped tableviews.\nHere are two images to show the problem:\nIn IB:\nhttps://www.dropbox.com/s/r13ihegpw6qgbke/Bildschirmfoto%202013-07-30%20um%2007.20.04.png\nAnd then in my App:\nhttps://www.dropbox.com/s/2k4fip9fpxt0u8p/Bildschirmfoto%202013-07-30%20um%2007.20.54.png\nThis also shows, that the switch in not correctly positioned. It is set to right align as the textfield is...\nShould I open a new Issue for this?\n. Here is a screenshot of the same Grouped TableView take with Xcode 5 and iOS Simulator:\nhttps://www.dropbox.com/s/biwy0xr473gg878/Bildschirmfoto%202013-07-30%20um%2015.31.01.png\nAnd here to compare agin the screen with iOS6:\nhttps://www.dropbox.com/s/2k4fip9fpxt0u8p/Bildschirmfoto%202013-07-30%20um%2007.20.54.png\n. Not only the spaces. The backgroundColor is grey.\nHere a screen of the complete view:\nhttps://www.dropbox.com/s/x44ujt57zp51trb/Bildschirmfoto%202013-07-30%20um%2015.40.04.png\nI use no datasource, it's a static TableView. Designed completely in IB\n. When I define a header test I get this:\nhttps://www.dropbox.com/s/2mc1i4h9agxg2v1/Bildschirmfoto%202013-07-30%20um%2016.53.35.png\n. Test with 0.6:\nStill the same, nothing changes on the Grouded TableView.\nI still get this view:\nhttps://www.dropbox.com/s/2mc1i4h9agxg2v1/Bildschirmfoto%202013-07-30%20um%2016.53.35.png\n. The last fix fixes the background color, fine :)\nBut there is still no space between sections and on top of the tableview\n. Thanks for your answer, but I can build my app using iOS7 SDK, because, I want to send it to apple asap.\nSo I'm currently in the final testing phase of my app and set it up on hockeyapp.net. \nWhen I install the app on an iOS6 device everything looks fine(iOS7 style),\nBut on an iOS7 device it looks like iOS6.\nSo, there is no way to have this fixed?\nThanks,\nUrkman\n. With this, the app crashes on start :(\n. App looks now fine even on an iOS7 device :+1: \n. Great :)\nI pushed my App to Apple. Lets see, what they say.\n. Do you have a link to that app?\nThanks,\nUrkman\n. The App is now available in the app store :)\nHere is a link to it:\nhttps://itunes.apple.com/us/app/touchmusic-control-your-music/id677386346?l=de&ls=1&mt=8\n. Sure, this would be fine :)\n. Did find any time to look into this?\nThanks :)\n. I found an other UISwitch related bug.\n[self.switch setOn:NO];\nis not working correctly. After that, the on value is NO, but the switch is shown as on.\n. ",
    "LiLejia": "I was just ditributing the new iOS7 update of my app using Xcode 5.0 GM. After i archived a package and validate it.  It comes out this:\n\nAre we still using private API?\n. Oh, I am actually not using the latest version. I'll try!\n. We passed app store review with warnings above, I guess we are using those API conflicting with some iOS7 private APIs, but we are actually using these APIs on iOS6 \n. @youknowone Thank you for your great project!\n. Met the same bug.\nEven [self.showingAlertView dismissWithClickedButtonIndex:3 animated:NO]; or removeFromSuperview, alpha=0.0, still don't work.\n. You may could implement this by using SIAlertView https://github.com/Sumi-Interactive/SIAlertView, just like u did in UI7Control\n. I am recently under a new app deadline, I wish I could do some work more a couple of days later.\n. ",
    "viking2009": "if ([self respondsToSelector:@selector(onImage)]) {\n         self.onImage = [UIImage clearImage];\n         self.offImage = [UIImage clearImage];\nshould be\nif ([self respondsToSelector:@selector(setOnImage:)])\n         [self performSelector:@selector(setOnImage:) withObject:[UIImage clearImage]];\n if ([self respondsToSelector:@selector(setOffImage:)])\n         [self performSelector:@selector(setOffImage:) withObject:[UIImage clearImage]];\n. ",
    "leberwurstsaft": ":+1: \n. ",
    "DanTakagaki": "+1 \nAlso the controller goes out of screen.\n. I found a work around for this issue.\nTry to set the title color in the - (void)viewDidAppear:(BOOL)animated method.\nThat should do the trick for now.\nOn Aug 9, 2013, at 3:55 AM, Pieter Janssens notifications@github.com wrote:\n\nI set the color using Interface Builder in the properties of the UIButton.\nDo I have to set the self.myButton.tintColor manually in ViewDidLoad for each button?\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "dreampowder": "hi there, i still getting this error.. i am using cocoapods version 0.23.0 \n. Thanks, i realized that somehow cocoapod couldn't updated my header path's of my main project.. i selected the property and pressed backspace problem fixed.. Thanks for helping\n—\nSent from Mailbox for iPhone\nOn Wed, Aug 21, 2013 at 9:40 PM, Jeong YunWon notifications@github.com\nwrote:\n\nMmm, ok, how about rm -rf Pods Podfile.lock && pod install?\npod install shows you some warning, if you set wrong your project. If you have any warning, you should fix it first.\n(it may includes warnings about header path)\nOr, if your app is not first target of your project, move your target to first of your project and retry again.\nI think this is cocoapods issue, actually. And these are how I solved it usually.\nReply to this email directly or view it on GitHub:\nhttps://github.com/youknowone/UI7Kit/issues/37#issuecomment-23039323\n. \n",
    "steakknife": "I wrote a hacky script to force re-downloading a particular pod (especially for when using :git or :podspec)\nrepod UI7Kit\n``` shell\n!/bin/sh\n~/bin/repod\nset -e\nif [ ! -e Podfile ]; then\n  echo \"Podfile not found\" >&2\n  exit 1\nfi\nif [ -z \"$1\" ]; then\n    echo \"Missing pod to reinstall\" >&2\n    exit 1\nfi\nunpod() {\n    if ! grep -qs \"$1\" Podfile; then\n        echo \"Pod $1 not found in Podfile\" >&2\n        exit 1\n    fi\n    sed -i '' \"s%pod.$1.%#&%g\" Podfile\n}\nununpod() {\n    if ! grep -qs \"$1\" Podfile; then\n        echo \"Pod $1 not found in Podfile\" >&2\n        exit 1\n    fi\n    sed -i '' \"s%^#(pod.$1.*)$%\\1%g\" Podfile\n}\nfor POD in \"$@\"; do\n   unpod \"$POD\"\ndone\npod\nfor POD in \"$@\"; do\n   ununpod \"$POD\"\ndone\npod\n```\n. Yeap, I see that too.   Going to make a uilabel show the value to see if it's just appearance.\n. Unpatched: slider takes the range is 0.000000 to 1.000000 \nPatched (iOSS 6.1): slider takes the range is 0.000000 to 1.000000 \nLooks like it's appearance-related.\n. Cropping the standard images left and right helps, but there's probably a better way to scale the moving of the slider based on the half width of the image.   That way, no matter the size of the slider image, it does the right thing.\n. \n\n. The likely direction seems to be for the future to draw the drop-shadow using CoreGraphics.  Right now, the shadow makes the thumb images taller and wider than just the thumb.\n. ",
    "VincentSit": "Hi there, I have getting this problem again and I tried all of the above solution but still can not solve the problem.\nI am using cocoapod version  0.26.2 and UI7Kit 0.9.9. Here are some infomation you may need.\nPodfile:\n```\nplatform :ios, '5.0'\nignore all warnings from all pods\ninhibit_all_warnings!\nignore warnings from a specific pod\npod 'Facebook-iOS-SDK', :inhibit_warnings => true\npod 'MKNetworkKit', :head\npod 'MagicalRecord', '2.1'\npod 'HMSegmentedControl', '~> 1.2.0'\npod 'JSONKit', '1.4'\npod 'REMarkerClusterer', '~> 2.2'\npod 'SVProgressHUD', '0.9'\npod 'EasyTableView', '~> 1.1.1'\npod 'iCarousel', '~> 1.7.6'\npod 'FXLabel', '~> 1.5.2'\npod 'FXImageView', '~> 1.2.3'\npod 'UMeng', '~> 2.2.0'\npod 'IDMPhotoBrowser', '~> 1.2.1'\npod 'Appirater', '1.0.5'\npod 'iVersion', '~> 1.10.6'\npod 'KKGestureLockView', '~> 1.0.0'\npod 'RNCryptor', '~> 2.1'\npod 'REMenu', '~> 1.5.1'\npod 'UI7Kit'\n```\nInstall log:\n➜  MyProject git:(develop) ✗ pod install\nAnalyzing dependencies\n/Users/myName/.rvm/gems/ruby-2.0.0-p247/gems/cocoapods-0.26.2/lib/cocoapods/sources_manager.rb:170: warning: Insecure world writable dir /Users/myName in PATH, mode 040777\nDownloading dependencies\nUsing AFNetworking (1.3.3)\nUsing Appirater (1.0.5)\nUsing DACircularProgress (2.1.0)\nUsing EasyTableView (1.1.1)\nUsing FXImageView (1.2.3)\nUsing FXLabel (1.5.2)\nInstalling FoundationExtension (0.45)\nInstalling GIKPopoverBackgroundView (0.0.1)\nUsing HMSegmentedControl (1.2.0)\nUsing IDMPhotoBrowser (1.2.5)\nUsing JSONKit (1.4)\nUsing KKGestureLockView (1.0.0)\nUsing MKNetworkKit (HEAD based on 0.87)\nUsing MagicalRecord (2.1)\nUsing REMarkerClusterer (2.3)\nUsing REMenu (1.5.1)\nUsing RNCryptor (2.1)\nUsing Reachability (3.1.1)\nUsing SVProgressHUD (0.9)\nInstalling SevenSwitch (1.3.0)\nInstalling UI7Kit (0.9.9)\nInstalling UIKitResources (7.0)\nInstalling cdebug (0.1.1)\nUsing iCarousel (1.7.6)\nUsing iVersion (1.10.6)\nGenerating Pods project\nIntegrating client project\n➜  MyProject git:(develop) ✗\nI can't using #import <UI7Kit/UI7Kit.h> to patch in the main.m, but I can do this:\n\nWhen I do this and bulid(Command+B) , I getting this error:\n\nBut if I do not import it can find this file (before does not work) :\n```\nimport \"IBLAppDelegate.h\"\n//#import \nint main(int argc, char *argv[])\n....\n```\n\n\nI guess there may be some wrong with pod directory hierarchy, below is UI7Kit and referenced file in the directory hierarchy:\n\n\n. I found a new problem :\n\n. I also have this bug and I found my reason.\nMy controller hierarchy like below:   \n```\n- (BOOL)application:(UIApplication )application didFinishLaunchingWithOptions:(NSDictionary )launchOptions {\n    UIViewController1 viewController1 = [[UIViewController1 alloc] initWithNibName:nil bundle:nil];\n    UIViewController2 viewController2 = [[UIViewController2 alloc] initWithNibName:nil bundle:nil];\n    UIViewController3 viewController3 = [[UIViewController3 alloc] initWithNibName:nil bundle:nil];\n    UIViewController4 viewController4 = [[UIViewController4 alloc] initWithNibName:nil bundle:nil];\n    UIViewController5 *viewController5 = [[UIViewController5 alloc] initWithNibName:nil bundle:nil];\nUINavigationController *navigationController1 = [[UINavigationController alloc] initWithRootViewController:viewController1];\nUINavigationController *navigationController2 = [[UINavigationController alloc] initWithRootViewController:viewController2];\nUINavigationController *navigationController3 = [[UINavigationController alloc] initWithRootViewController:viewController3];\nUINavigationController *navigationController4 = [[UINavigationController alloc] initWithRootViewController:viewController4];\nUINavigationController *navigationController5 = [[UINavigationController alloc] initWithRootViewController:viewController5];\n\nUITabBarController *tabBarController = [[UITabBarController alloc] initWithNibName:nil bundle:nil];\ntabBarController.viewControllers = @[navigationController1, navigationController2,\n                                     navigationController3, navigationController4, navigationController5];\nself.window.rootViewController = self.tabBarController;\n\n}\n```\nUIViewController1 with UIViewController6, UIViewController7,UIViewController8 have  same super class called SuperClass.\nIn SuperClass have a method to change the first tabBar view controller:   \n- (void)foo {\n     UIViewController6 *viewController6 = [[UIViewController6 alloc] initWithNibName:nil bundle:nil];\n     // in here, self.navigationController is the first viewController in  tabBarController.viewControllers.\n     [self.navigationController setViewControllers:@[viewController6] animated:NO];\n}\nif I call foo, the first tabBarItem will disappear from the tabbar. but if I change the foo like this, the first tabBarItem  will not disappear:    \n- (void)foo {\n     UIViewController6 *viewController6 = [[UIViewController6 alloc] initWithNibName:nil bundle:nil];\n     // in here, self.navigationController is the first viewController in  tabBarController.viewControllers.\n//     [self.navigationController setViewControllers:@[viewController6] animated:NO];\n       [self.navigationController pushViewController:viewController6 animated:NO];\n}\n. ",
    "antonc27": "I have basically the same problem at iOS6 when UI7AlertView shown just after system non-patched alert view of in-app purchases.\nSo, I solved this by introducing artificial delay like this:\n[updateAlert performSelector:@selector(show) withObject:nil afterDelay:0.2];\nMaybe this also helps in case of continuous UI7AlertViews...\n. I fixed similar problem by replacing\npod 'UI7Kit'\nwith\npod 'UI7Kit', :git => 'https://github.com/youknowone/UI7Kit.git'\nin Podfile\n. ",
    "thomassnielsen": "I'm suspecting that Apple does some black rendering magic in the mailcomposer. Is there a clean way to make an exception for such controllers without dropping the global patcher and using UI7 components directly instead? (which is what I'm currently doing to avoid this).\n. ",
    "thatsmystapler": "I have discovered that adding the following to UI7SearchBar.m adjusts the textfield away from the magnifying glass icon : \n- (void)_searchBarInit {\n    self.searchTextPositionAdjustment = UIOffsetMake(15.0, 0.0);\n. ",
    "emichaud": "update to latest cocoa pods if you are not there:  sudo gem update cocoapods\n. Due to the errors the project doesn't run and does not create error logs.  Here are screen caps of the compile errors. Hope that helps.\n\n\n. you rock!  nice catch.  I was on cocoa pods 0.20.2.  Updated to 0.22.2:  sudo gem update cocoapods \nand did an update and the project built fine.\nthank you!\n. Hi, I retested this issue today and wanted to let you know the issue does not appear to be caused by UI7Kit. I was using a library I really like called Sensible TableView.  For some reason the issue with grouped tableviews happens when I use their library, but not with standard UITableViewController.\nI retested with \"titleForSection\" in plain and grouped UITableView and that worked nicely.  I'll have to further investigate what Sensible is doing.\nSorry to trouble you on this.  Great work so far!  I'm really excited to leverage this tool set you are creating.\nbest wishes,\nEverett\n. yes. Its really a nice library.\nI'm using their library in the same app I want to use your library. \nI'm happy continue reporting any issues. I felt bad reporting because I could have tested further, but didn't think about it at first.\nIf you have any specific tests, I can create samples to test.  \nThe lead dev is very nice and very smart.  I know they are they are trying to push out a new release, but I'm pretty sure once its out, he would take a look at any issues.\nOn Jul 22, 2013, at 10:51 PM, Jeong YunWon notifications@github.com wrote:\n\n@emichaud I want UI7Kit replace the UITableView gracefully. So I want to test the library too. Is it http://sensiblecocoa.com/ ?\n—\nReply to this email directly or view it on GitHub.\n. congratulations Stefan!  Just bought a copy!\n\nOn Aug 1, 2013, at 1:24 AM, Stefan Sturm notifications@github.com wrote:\n\nThe App is now available in the app store :)\nHere is a link to it:\nhttps://itunes.apple.com/us/app/touchmusic-control-your-music/id677386346?l=de&ls=1&mt=8\n—\nReply to this email directly or view it on GitHub.\n. sure,here is the stack.  working fine with 0.6.2, loaded 0.7.2 via cocoa pods, crash.\n\n. Hi,\n\nyes, that work around corrects the issue.\nI commented out the lines in 0.7.3 and the crash at launch stops.  So far, everything else seems to work fine. \n   // [self exportSelector:@selector(_updateVisibleCellsNow:) toClass:target];\nI like to keep up with the newest builds.  I'll just comment this out for now, though it would be nice find a work around.\nthanks!!\nOn Aug 4, 2013, at 1:36 PM, Jeong YunWon notifications@github.com wrote:\n\nBecause other 4 apps with UITableView doesn't have crash problem and sensible table view calls are in your callstack, It seems new feature (accessory support) of UI7Kit conflicts with sensible tableview. I think I should review sensible table view issue. To avoid this problem temporary, comment out the patch line: https://github.com/youknowone/UI7Kit/blob/master/UI7Kit/UI7TableView.m#L103\nThis code is used to fill tint color to your table view cell accessory, so not a big deal.\n—\nReply to this email directly or view it on GitHub.\n. thank you, nice work!  - However, when I went back to the sample app, I found that the regular UITableView is now having an issues with clearing the accessory mark.  Take a look at the 3rd tab in the test app.  It should turn on the checkmark then turn it off on the next selection, but with 0.7.5 it does not.\n\nOn Aug 7, 2013, at 8:36 AM, Jeong YunWon notifications@github.com wrote:\n\n0.7.5 is released with the fix\n—\nReply to this email directly or view it on GitHub.\n. your a real blessing. thanks for all your ingenious work!\n\nOn Aug 7, 2013, at 1:55 PM, Jeong YunWon notifications@github.com wrote:\n\nReopen #67 . Sorry. I only tested setter part. I should patch getter for that code.\n—\nReply to this email directly or view it on GitHub.\n. There base sdk is has a commercial license but its free.  I can send you a test project with the free sdk loaded ready to test if you would like to take a quick look. At least I can save you a little prep time.  If that would be good just let me know.  \n\nOn Aug 5, 2013, at 3:34 PM, Jeong YunWon notifications@github.com wrote:\n\nOops.. I lost writing comment and it is too sleepy. Saying breif\nDynamic patch is one-pass phase. So it doesn't work anyway\nrespondsToSelector also doesn't work. The basic work of UI7Kit work is wrapping existing implementaiton of the selector. So it copy the selector to the other name and patch the new implementation to that part.\nI have plain to review Sensible table view. I think something patching process is conflict to what sensible table view does. So i will find a way to avoid the conflict.\nif you want to dig it, i think the good point is not the patching part but the calling part of original method, which make bad access. I am really curious that what sensible table view does that make this conflict ;)\n—\nReply to this email directly or view it on GitHub.\n. Hi send me a email that I can reply to and I'll share the project via dropbox for you.\n. \n",
    "jnordh": "Pods Group\nParse Issue Group\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:409:1: Expected identifier or '('\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:411:19: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:412:44: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:414:19: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:415:43: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:417:19: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:417:50: Unknown type name 'Protocol'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:418:19: Unknown type name 'Protocol'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:418:50: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:422:30: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:423:31: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSZone.h:8:1: Expected identifier or '('\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSZone.h:16:52: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSZone.h:17:19: Unknown type name 'NSString'\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObject.h:9:1: Expected identifier or '('\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObject.h:13:1: Expected identifier or '('\nSemantic Issue Group\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:422:53: Format argument not an NSString\n/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator6.1.sdk/System/Library/Frameworks/Foundation.framework/Headers/NSObjCRuntime.h:423:63: Format argument not an NSString\nApple LLVM compiler 4.2 Error Group\nToo many errors emitted, stopping now\n. Hi,\nwhen I remove UI7Kit the error goes away. If added it again (using POD), then the same error occurs again.\nYes, I followed the instruction (I believe). :-)\nHere is the main.m\n```\nimport \nimport \"EKZ2AppDelegate.h\"\n//#import \nint main(int argc, char *argv[]) {\n@autoreleasepool {\n\n//      [UI7Kit patchIfNeeded]; // in main.m, before UIApplicationMain()\n        int retVal = UIApplicationMain(argc, argv, nil, NSStringFromClass([EKZ2AppDelegate class]));\n        return retVal;\n    }\n}\n```\n. Hi,\nany idea what could be wrong?\nregards\n-Jan\n. Hi,\nhow can it be built? I am getting this error:\niOSDevelopments/GitHUB/QRQR/zxing/iphone/Barcodes/beep-beep.aiff: No such file or directory\nEven downloaded zxing... but could not get qrqr to build due to this error.\nAny help would be greatly appreciated!\n. Hi again!\nsorry, I resolved the qrqr build issue. The project qrqr builds just fine now. But, my project does not :-( What could be wrong? What I am doing wrong?? :-)\nBR\n-Jan\n. Hi,\nI not updated UI7Kit to 0.3.2, same problem. It fails in building PODs, not when building the real App. :-) could it be incompatibility to other PODs?\nThanks\n-Jan\n. This fixes the issue:\nUpdated cocoapods to 0.22.2: sudo gem update cocoapods \nand did an update and the project built fine.\nThank you VERY much for the great support and help!\nBest regards\n-Jan\n. ",
    "ZiYouDeLaoGe": "你们哪里还是白天啊我们这里都是晚上了！晚安!good night!!!!!!\n------------------ 原始邮件 ------------------\n发件人: \"segiddins\"; \n发送时间: 2013年7月26日(星期五) 凌晨0:44\n收件人: \"youknowone/UI7Kit\"; \n主题: Re: [UI7Kit] Grouped TableView (#47)\nNo\n—\nReply to this email directly or view it on GitHub.\n. ",
    "m1entus": "https://github.com/m1entus/MZFormSheetController - my lib could help you with it.\n. ",
    "bhallacharanjit": "This error is coming while I am trying to compile my code. I am attached herewith the compiled header include path \n\n. thanks for the help cleaned that up but there is one more issue. I cannot see the images in the UI7 controls. Attached is the screenshot. Could you guide me through this ?\n\n. ",
    "huadee": "你麻痹，怎么弄的啊\n. ",
    "masterkain": "same\n. ",
    "shisoft": "Scope bar still not fixed\n. ",
    "vladkorotnev": "SDStylishTextfield is a UITextField subclass\nSDUserImageView is a UIImageView subclass, see below\nWhen you tap on the IBOutlet SDUserImageView *avalol (recognized by a UITapGestureRecognizer which is created on viewDidLoad), it crashes.\nHeader\n```\n//\n//  SDRegistrationViewController.h\n//\n//  Created by Akasaka Ryuunosuke on 07.08.13.\n//  Copyright (c) 2013 Vladislav Korotnev. All rights reserved.\n//\nimport \nimport \nimport \"SDUserImageView.h\"\nimport \"SDStylishButton.h\"\nimport \"SDUserController.h\"\nimport \"SDConnector.h\"\nimport \"SDStylishTextfield.h\"\nimport \"MBProgressHUD.h\"\nimport \"Global.h\"\n@interface SDRegistrationViewController : UIViewController\n@property (weak, nonatomic) IBOutlet SDStylishTextfield mailField;\n@property (weak, nonatomic) IBOutlet SDStylishTextfield passConfirmField;\n@property (weak, nonatomic) IBOutlet SDStylishTextfield nameField;\n@property (weak, nonatomic) IBOutlet SDStylishTextfield passField;\n@property (weak, nonatomic) IBOutlet SDStylishTextfield qField;\n@property (weak, nonatomic) IBOutlet SDStylishTextfield aField;\n@property (weak, nonatomic) IBOutlet UINavigationBar pseudonav;\n@property (weak, nonatomic) IBOutlet SDUserImageView avalol;\n@property (strong, nonatomic) IBOutlet UIView mainView;\n@property (weak, nonatomic) IBOutlet UIScrollView scroller;\n- (IBAction)signup:(id)sender;\n- (IBAction)cancel:(id)sender;\n- (IBAction)didEndOnEmail:(id)sender;\n@end\n```\nView file\n```\n//\n//  SDRegistrationViewController.m\n//\n//  Created by Akasaka Ryuunosuke on 07.08.13.\n//  Copyright (c) 2013 Vladislav Korotnev. All rights reserved.\n//\nimport \"SDRegistrationViewController.h\"\n@implementation SDRegistrationViewController\nbool oneTimeConfig=false;\nUIImage selectedUserpic;\nCGPoint svos;\n- (id)initWithNibName:(NSString )nibNameOrNil bundle:(NSBundle *)nibBundleOrNil\n{\n    self = [super initWithNibName:nibNameOrNil bundle:nibBundleOrNil];\n    return self;\n}\n\n(void)viewDidLoad\n{\n    [super viewDidLoad];\n    [self.mainView setFrame:CGRectMake(0, 0, self.mainView.frame.size.width, self.mainView.frame.size.height)];\n    [self.scroller addSubview:self.mainView];\n    [self.scroller setContentSize:self.mainView.frame.size];\n    [self.view setBackgroundColor:[UIColor colorWithPatternImage:[UIImage imageNamed:@\"backgraund\"]]];\n    [self.scroller setBackgroundColor:[UIColor clearColor]];\n    [self.mainView setBackgroundColor:[UIColor clearColor]];\n      [self.avalol setImage:[UIImage imageNamed:@\"notfoundphoto\"]];\n\n// This may affect too?\n    UITapGestureRecognizer* avatap = [[UITapGestureRecognizer alloc]initWithTarget:self action:@selector(chooseAva)];\n    [avatap setNumberOfTapsRequired:1];\n    [avatap setNumberOfTouchesRequired:1];\n[self.avalol addGestureRecognizer:avatap];\n[self registerForKeyboardNotifications];\n\nfor (UITextField*t in self.mainView.subviews) {\n    if ([t isKindOfClass:[UITextField class]]) {\n        [t setDelegate:self];\n    }\n}\n\n}\n// This is what makes it crash! -------------------\n- (void) chooseAva {\n    UIImagePickerController imagePickerController = [[UIImagePickerController alloc] init];\n    imagePickerController.modalPresentationStyle = UIModalPresentationFullScreen;\n    imagePickerController.sourceType = UIImagePickerControllerSourceTypePhotoLibrary;\n    imagePickerController.allowsEditing = true;\n    imagePickerController.mediaTypes = @[(NSString)kUTTypeImage];\n    imagePickerController.delegate = self;\n    [self presentModalViewController:imagePickerController animated:true]; // Crashes here\n}\n// -----------------------------------------------------------\n\n(void)imagePickerController:(UIImagePickerController )picker didFinishPickingMediaWithInfo:(NSDictionary )info {\n    selectedUserpic = (UIImage *) [info objectForKey:\n                                   UIImagePickerControllerEditedImage];\n    [self.avalol setImage:selectedUserpic];\n    [self dismissModalViewControllerAnimated:true];\n\n}\n- (void) viewWillAppear:(BOOL)animated {\n    for (UIView*v in self.mainView.subviews) {\n        if ([v isKindOfClass:[UILabel class]]) {\n            UILabel*l = v;\n\n            [l setFont:[UIFont fontWithName:@\"HelveticaNeue-Light\" size:l.font.pointSize]];\n        }\n    }\n    [SDStylishButton styleAllInView:self.mainView];\n    [SDStylishTextfield styleAllInView:self.mainView];\n    if (osver() >= 7.0) {\n        [self.pseudonav setFrame:CGRectMake(0, 0, self.pseudonav.frame.size.width, self.pseudonav.frame.size.height+[UIApplication sharedApplication].statusBarFrame.size.height)];\n        [self.scroller setFrame:CGRectMake(0, self.pseudonav.frame.size.height, self.view.frame.size.width, self.view.frame.size.height-self.pseudonav.frame.size.height)];\n    }\n    [self.pseudonav setTitleTextAttributes:\n     [NSDictionary dictionaryWithObjectsAndKeys:\n      [UIColor whiteColor], UITextAttributeTextColor,\n      [UIFont fontWithName:@\"HelveticaNeue-Light\" size:20], UITextAttributeFont,nil]];\n    [self.pseudonav setTintColor:[UIColor whiteColor]];\n\n    [self.pseudonav setBackgroundImage:[[UIImage imageNamed:@\"navbar-iOS7\"]resizableImageWithCapInsets:UIEdgeInsetsMake(5, 3, 8, 3)] forBarMetrics:UIBarMetricsDefault   ];\n\n}\n// prevent keyboard hiding the fields\n- (void)textFieldDidBeginEditing:(UITextField *)textField {\n    svos = self.scroller.contentOffset;\n    CGPoint pt;\n    CGRect rc = [textField bounds];\n    rc = [textField convertRect:rc toView:self.scroller];\n    pt = rc.origin;\n    pt.x = 0;\n    pt.y -= 60;\n    [self.scroller setContentOffset:pt animated:YES];\n}\n\n\n(void)registerForKeyboardNotifications\n{\n    [[NSNotificationCenter defaultCenter] addObserver:self\n                                             selector:@selector(keyboardWasShown:)\n                                                 name:UIKeyboardDidShowNotification object:nil];\n[[NSNotificationCenter defaultCenter] addObserver:self\n                                         selector:@selector(keyboardWillBeHidden:)\n                                             name:UIKeyboardWillHideNotification object:nil];\n\n\n}\n// Called when the UIKeyboardDidShowNotification is sent.\n- (void)keyboardWasShown:(NSNotification)aNotification\n{\n    [UIView beginAnimations:@\"anim\" context:nil];\n    NSDictionary info = [aNotification userInfo];\n    CGSize kbSize = [[info objectForKey:UIKeyboardFrameBeginUserInfoKey] CGRectValue].size;\n    [self.scroller setFrame:CGRectMake(0, self.scroller.frame.origin.y, self.view.frame.size.width, self.view.frame.size.height-kbSize.height - self.scroller.frame.origin.y)];\n[UIView commitAnimations];\n// If active text field is hidden by keyboard, scroll it so it's visible\n// Your application might not need or want this behavior.\n\n}\n// Called when the UIKeyboardWillHideNotification is sent\n- (void)keyboardWillBeHidden:(NSNotification*)aNotification\n{\n    [UIView beginAnimations:@\"anim\" context:nil];\n      [self.scroller setFrame:CGRectMake(0, self.scroller.frame.origin.y, self.view.frame.size.width, self.view.frame.size.height - self.scroller.frame.origin.y)];\n    [UIView commitAnimations];\n}\n\n\n(IBAction)signup:(id)sender {\nfor (UITextFieldt in self.mainView.subviews) {\n    if ([t isKindOfClass:[SDStylishTextfield class]]) {\n        if ([[t.text stringByReplacingOccurrencesOfString:@\" \" withString:@\"\"] isEqualToString:@\"\"] || t.text == nil) {\n            [self _showError:@\"Необходимо заполнить все поля\"];\n            return;\n        }\n    }\n}\nif (![self.passField.text isEqualToString:self.passConfirmField.text]) {\n    [self _showError:@\"Пароли не совпадают\"];\n    return;\n}\nif ([self.qField.text isEqualToString:self.aField.text]) {\n    [self _showError:@\"Ответ на секретный вопрос не должен совпадать с самим вопросом\"];\n    return;\n}\n[[MBProgressHUD showHUDAddedTo:self.view animated:true]setDimBackground:true];\n[[SDUserController sharedController]performSignupWithEmail:self.mailField.text password:self.passField.text nickname:self.nameField.text question:self.qField.text  answer:self.aField.text delegate:self avatar:selectedUserpic];\n}\n- (void) _showError:(NSString)e {\n[[[UIAlertView alloc]initWithTitle:@\"Ой!\" message:e delegate:self cancelButtonTitle:@\"OK\" otherButtonTitles:nil]show];\n}\n\n\n(IBAction)cancel:(id)sender {\n    [self dismissModalViewControllerAnimated:true];\n}\n\n\n(IBAction)didEndOnEmail:(id)sender {\n    if (sender == self.mailField) {\n        [self.nameField becomeFirstResponder];\n    }\n    if (sender == self.nameField) {\n        [self.passField becomeFirstResponder];\n    }\n    if (sender == self.passField) {\n        [self.passConfirmField becomeFirstResponder];\n    }\n    if (sender == self.passConfirmField) {\n        [self.qField becomeFirstResponder];\n    }\n    if (sender == self.qField) {\n        [self.aField becomeFirstResponder];\n    }\n    if (sender == self.aField) {\n        [self.aField resignFirstResponder];\n        [self signup:self];\n    }\n}\n@end\n```\n\n\nthis is the SDUserImageView:\n.h\n```\nimport \n@interface SDUserImageView : UIView {\n    UIImageView imageView;\n    UIImageView overlayView;\n}\n/\n * Sets the current image displayed inside the user frame\n * @param Image to be displayed\n /\n- (void) setImage:(UIImage)image;\n/*\n * Sets the picture bounds. Height is ignored, it's always square.\n * @param New frame\n /\n\n(void) setFrame:(CGRect)frame;\n@end\n\n```\n.m\n```\n@implementation SDUserImageView\n\n\n(id)initWithFrame:(CGRect)frame\n{\n    self = [super initWithFrame:frame];\n    if (self) {\n        // Initialization code\n    }\n    return self;\n}\n\n\n(void) setImage:(UIImage )image {\n    if (imageView == nil) {\n        imageView = [[UIImageView alloc]initWithFrame:CGRectMake(2, 2, self.frame.size.width-4, self.frame.size.width-4)];\n        CALayer imageLayer = imageView.layer;\n        [imageLayer setCornerRadius:imageView.frame.size.width/2];\n        [imageLayer setBorderWidth:0];\n        [imageLayer setMasksToBounds:YES];\n        [imageView setBackgroundColor:[UIColor clearColor]];\n        [imageView setContentMode:UIViewContentModeScaleAspectFill];\n        [self addSubview:imageView];\n    }\n[imageView setImage:image];\n[self setBackgroundColor:[UIColor clearColor]];\nif (overlayView == Nil) {\n    overlayView = [[UIImageView alloc]initWithImage:[UIImage imageNamed:@\"avatar\"]];\n    [overlayView setFrame:CGRectMake(0, 0, self.frame.size.width, self.frame.size.width)];\n    [overlayView setBackgroundColor:[UIColor clearColor]];\n    [self addSubview:overlayView];\n}\n\n\n}\n- (void)setFrame:(CGRect)frame {\n    [super setFrame:frame];\n    [imageView setFrame:CGRectMake(2, 2, self.frame.size.width-4, self.frame.size.width-4)];\n    CALayer imageLayer = imageView.layer;\n    [imageLayer setCornerRadius:imageView.frame.size.width/2];\n    [imageLayer setBorderWidth:0];\n    [imageLayer setMasksToBounds:YES];\n    [overlayView setFrame:CGRectMake(0, 0, self.frame.size.width, self.frame.size.width)];\n    [overlayView setBackgroundColor:[UIColor clearColor]];\n    [self setBackgroundColor:[UIColor clearColor]];\n}\n/\n// Only override drawRect: if you perform custom drawing.\n// An empty implementation adversely affects performance during animation.\n- (void)drawRect:(CGRect)rect\n{\n    // Drawing code\n}\n*/\n@end\n```\n. You mean on iPad it works?\n~ Vladislav Korotnev\nhttp://vladkorotnev.github.io/\nhttp://vladkorotnev.me\nsysop@dakimaker.com\nvladkorotnev@gmail.com\n2:5020/12000.64\n. Unfortunately the project is private and I am far away from my working Mac with Xcode\n~ Vladislav Korotnev\nhttp://vladkorotnev.github.io/\nhttp://vladkorotnev.me\nsysop@dakimaker.com\nvladkorotnev@gmail.com\n2:5020/12000.64\n. ",
    "vu0tran": "I've tried several things. \n1) I commented out UI7Kit and just imported UIKitExtension and tried to call the direct method. Same error.\n2) I've uninstalled all pods besides UI7Kit. Same error.\n3) I uninstalled UI7Kit Pod and just installed 'UIKitExtension' pod. Same error.\n``` Objective-C\nimport \n//#import \nimport \nint main(int argc, char argv[])\n{\n    UIColor * color = [UIColor colorWith8bitRed:255 green:255 blue:255 alpha:255];\n    NSAutoreleasePool pool = [[NSAutoreleasePool alloc] init];\n//    [UI7Kit patchIfNeeded]; // in main.m, before UIApplicationMain()\n    int retVal = UIApplicationMain(argc, argv, nil, nil);\n    [pool release];\n    return retVal;\n}\n```\n4) I tried commenting out all instances where it calls the: +[UIColor colorWith8bitRed:green:blue:alpha:]: method. Now, it is crashing on the method:\n\"if ([[UIDevice currentDevice] needsUI7Kit]) {\"\non line 82 in \"UI7KitCore.m\"\nI'm not too sure how the UI7Kit is architected, but these static calls are trying to find a class object that does not exists. It is weird because it can read the headers just fine since the methods are auto completing...\n. All my other cocoapod library works without crashing. It's only UI7Kit that has problems\n1. Yes, libPods library is linked in my bundle.\n2. No.\n3. Compiled with Apple LLVM compiler 4.2.\nI double checked all my header search paths to set to the correct cocoapods requirement and also preprocessing macros and they all seem correct. \nThanks for your help so far. I think maybe I'll try to just creating a new bundle from scratch or maybe compile on my phone (I've been using simulator so far) to see if the problem still persists..\nI'm not sure what the issue is, but if you want, I can send you the binary to the project as well. Just let me know.\n. Actually, \"-ObjC\" in \"Other Linker Flags\" did it.\nThanks for your help!!\n. ",
    "JohnKFisher": "lol!\nI would have thought the stuff was all there in the repo for building, but I'm very new to this so it very well may not have been. It's VERY rough, very much My First App, learning to code, but I'm having a lot of fun! :-)\n\nAfter I put the above issue in I found #12, and I have found that pinning the height works as suggested there.\n. ",
    "jpgupta": "(running iOS 6 simulator)\n. That's sorted it thanks very much!\n. ",
    "alexwald": "I get the same behaviour - sublevels are ok.\nI don't set the button image anywhere.\n. anyone got a temporary fix for this?\n. ",
    "hatunike": "My temp fix is bad, but works. I stopped UI7 kit from handling my UINavigationBar, UINavigationController, and UINavigationItem. (remove those class names from UI7KitCore patch method).\nAnd then in my App delegate appDidFinishLaunching method I'm just using [UINavigationBar appearance] methods to mimick the iOS7 look and feel. This is actually easier than you'd think because you can pretty much just use the same implementation that ui7Kit uses. For example, the back button :\nUIImage *backImage = [UIImage imageNamed:@\"UI7NavigationBarBackButton\"];\n    backImage = [backImage imageByFilledWithColor:tintColor];\n    [[UIBarButtonItem appearance] setBackButtonBackgroundImage:backImage forState:UIControlStateNormal barMetrics:UIBarMetricsDefault];\n    backImage = [backImage imageByFilledWithColor:tintColor];\n    [[UIBarButtonItem appearance] setBackButtonBackgroundImage:backImage forState:UIControlStateHighlighted barMetrics:UIBarMetricsDefault];\nI've got my tint color defined above and I also import #import \"UIImage.h\"\nimport \"UI7Color.h\".\nThis is definitely only recommended if you are really having back button issues.\n. My temp fix is bad (and really don't recommend unless you GOTTA have this working right). I stopped UI7 kit from handling my UINavigationBar, UINavigationController, and UINavigationItem. (remove those class names from UI7KitCore patch method).\nAnd then in my App delegate appDidFinishLaunching method I'm just using [UINavigationBar appearance] methods to mimick the iOS7 look and feel. This is actually easier than you'd think because you can pretty much just use the same implementation that ui7Kit uses. For example, the back button :\nUIImage *backImage = [UIImage imageNamed:@\"UI7NavigationBarBackButton\"];\n    backImage = [backImage imageByFilledWithColor:tintColor];\n    [[UIBarButtonItem appearance] setBackButtonBackgroundImage:backImage forState:UIControlStateNormal barMetrics:UIBarMetricsDefault];\n    backImage = [backImage imageByFilledWithColor:tintColor];\n    [[UIBarButtonItem appearance] setBackButtonBackgroundImage:backImage forState:UIControlStateHighlighted barMetrics:UIBarMetricsDefault];\nI've got my tint color defined above and I also import #import \"UIImage.h\"\nimport \"UI7Color.h\".\nThis is definitely only recommended if you are really having back button issues.\n. ",
    "coneybeare": "I am not sure why it is happening, I have not included any of the classes, imported any code, or used UI7Kit at all in the project. Simply adding the cocoapod project makes it happen, so perhaps there is a project config setting messing with it. I will try 0.8\n. Still occurs in 0.8\n. As a data point, I was able to reproduce the problem using every version between 0.8.7 and 0.0.1.\n. I have had to abandon UI7Kit until this is fixed.\n. my guess was that it was actually in the \"FoundationExtension\" pod that this includes, but I could not find anything. I only needed it for a Segmented control, and found it pretty easy to mimic iOS 7's in basic code without this kit.\n. ",
    "akinLiu": "it still occurs in 0.8.11 @youknowone \n. so do I, but now I will try to find the reason.\n. Yes , It's the \"FoundationExtension\" cause this, in the \"NSObject.m\" file line 97\n+ (NSAMethod *)methodForSelector:(SEL)selector {\n    return [NSAMethod methodWithMethod:class_getInstanceMethod(self, selector)];\n}\ndelete this method , CABasicAnimations will work. but I don't why\n. YES , The CABasicAnimations problem occurs even if I just install FoundationExtension delete the methodForSelector : CABasicAnimations work fine. I guess some implicit happen.\n. here is an example https://www.dropbox.com/s/1wglu2lspsjdo6d/TestID.zip\n. ",
    "bdhf24": "Same issue, no scroll, click + UIView methods don't work, the cross bars aren't centred\n. ",
    "afterburner-xx": "Cool thanks :)\n. ",
    "marcdown": "I can consistently recreate this issue on the latest version (0.9.7); it occurs every time I dismiss a modal. I am testing on iOS 6 using the iOS 7 GM SDK with Autolayout disabled.\n. https://dl.dropboxusercontent.com/u/5975955/TabBarTest.zip\nTest Project includes a tab bar controller containing 3 tab bar items each pointing to a view controller with a button that displays a modal. Once you dismiss the modal the selected tab bar image is offset by 2px in iOS 6 - I have not tested iOS 5.\n. @youknowone any update on this?\n. ",
    "bumaociyuan": "@youknowone any update on this?\n. I had the same problem\n. [button setTitleColor:[UIColor redColor] forState:UIControlStateSelected];\n[button setTitleColor:[UIColor redColor] forState:UIControlStateHighlighted];\n@sxsoul\nboth not work\n. I have fixed this bug #163\n. objc\nUIColor *result = self.tableView.backgroundColor;\nNSLog(@\"%@\",result);\n//ios 8 will output \n//UIDeviceRGBColorSpace 0.937255 0.937255 0.956863 1\n//ios 7 is 0.933\n. ",
    "kalyan4": "My task is to change tabbar iem position change according to user criteria my if-condition not perfectly working at this point\nCGPoint touchlocation;\n[pan locationInView:self.view];\nif (tabbarview == nil) {\n    tabbarview =[tbItems objectAtIndex:self.tabBarController.selectedIndex];\n    [self.tabBarController.view addSubview:tabbarview];\n}\nif (fixedPos == 0) {\n    fixedPos=touchlocation.y;\n}[tabbarview removeFromSuperview];\ntabbarview.center = touchlocation;\nif (pan.state == UIGestureRecognizerStateEnded) {\n    // [tabbarview removefromsuperview]\n    [tabbarview removeFromSuperview];\n    tabbarview =nil;\n    fixedPos = 0;\n```\nif(touchlocation.x<4){\nif (touchlocation.x<=109)\n{\n    [tbItems exchangeObjectAtIndex:0 withObjectAtIndex:self.tabBarController.selectedIndex];\n    NSMutableArray *tvcs=[[self.tabBarController viewControllers]mutableCopy];\n    id tempvc=[tvcs objectAtIndex:self.tabBarController.selectedIndex];\n    [tvcs removeObject:tempvc];\n    [tvcs insertObject:tempvc atIndex:1];\n    [self.tabBarController setViewControllers:tvcs animated:YES];\n\n}else\nif (touchlocation.x>109 && touchlocation.x<=215)\n{\n    [tbItems exchangeObjectAtIndex:1 withObjectAtIndex:self.tabBarController.selectedIndex];\n    NSMutableArray *tvcs=[[self.tabBarController viewControllers]mutableCopy];\n    id tempvc=[tvcs objectAtIndex:self.tabBarController.selectedIndex];\n    [tvcs removeObject:tempvc];\n    [tvcs insertObject:tempvc atIndex:2];\n    [self.tabBarController setViewControllers:tvcs animated:YES];\n\n}else if (touchlocation.x>215 )\n{\n    [tbItems exchangeObjectAtIndex:2 withObjectAtIndex:self.tabBarController.selectedIndex];\n    NSMutableArray *tvcs=[[self.tabBarController viewControllers]mutableCopy];\n    id tempvc=[tvcs objectAtIndex:self.tabBarController.selectedIndex];\n    [tvcs removeObject:tempvc];\n    [tvcs insertObject:tempvc atIndex:3];\n    [self.tabBarController setViewControllers:tvcs animated:YES];\n\n}else\n{\n    [tbItems exchangeObjectAtIndex:3 withObjectAtIndex:4];\n    NSMutableArray *tvcs=[[self.tabBarController viewControllers]mutableCopy];\n    id tempvc=[tvcs objectAtIndex:self.tabBarController.selectedIndex];\n    [tvcs removeObject:tempvc];\n    [tvcs insertObject:tempvc atIndex:4];\n    [self.tabBarController setViewControllers:tvcs animated:YES];\n}\n\n}else\n{\n    [tbItems exchangeObjectAtIndex:3 withObjectAtIndex:4];\n    NSMutableArray *tvcs=[[self.tabBarController viewControllers]mutableCopy];\n    id tempvc=[tvcs objectAtIndex:self.tabBarController.selectedIndex];\n    [tvcs removeObject:tempvc];\n    [tvcs insertObject:tempvc atIndex:4];\n    [self.tabBarController setViewControllers:tvcs animated:YES];\n}\n```\n}\n. ",
    "afterburnerltt": "Awesome works perfectly now. Thanks\n. ",
    "jboehler": "Now I have make some change...\nwhat you thinking about this approach?\n. yes is bit magic ;-) maybe there is a better solution...\n. Okye...\nbut maybe there is a better solution:\nset the autoresizesSubviews to YES in the init method\nit should call layoutSubviews when the bounds change.\nfrom the Apple class reference guide:\nlayoutSubviews - Implement this method if you need more precise control over the layout of your subviews than either the constraint or autoresizing behaviors provide.\nbut i have not try it... when i have time i will try this solution today and make a pull request\n. nice to see that me theoretical idea works ;-)\nthis is a much cleaner and understandable solution!\n. ",
    "gilthonweapps": "I have to add that the pickerView is only filled with ??? instead of the numbers.\n. Hi. I use the pickerView to select a time. So, with iOS 7, each part of the pickerView contains numbers from 0 to 9. But with iOS 6, each number is replaced by a '?'.\nHere is the code I am using (I removed some parts of the function that are not useful to describe the problem):\n- (UIView )pickerView:(UIPickerView )pickerView viewForRow:(NSInteger)row forComponent:(NSInteger)component reusingView:(UIView )view\n  {\n  UILabel tView = (UILabel*)view;\n  if (!tView) {\n      tView = [[UILabel alloc] init];\n      tView.textColor = [UIColor redColor];\n      tView.text = [NSString stringWithFormat:@\"%d\", row];\n  }\nreturn tView;\n  }\n. That's sad. I am using it to be able to change the color of the text of each component of the pickerView. Is there another way to do it?\nDo you have any comments on my other issues?\nTell me if you need more information.\n. Ok great. Feel free to ask ;-)\n. I have updated my app with the latest version of your code and the pickerView is now empty.\nIn order to change the color of the text, just have a look at my sample code. As you provide the viewForRow method with a custom view (in my case, a UILabel), you specify the color with the UILabel textColor method.\nConcerning selectionIndicatorColor, it is black by default in iOS7, that's why we don't see it in my example as the background of my view is black.\n. Concerning the grouped table view, here is how I configure it:\n\n. I managed to make the pickerView work. I just needed to set a frame to the UILabel I created in the viewForRow method. Thanks.\nNow, I still would like to have the color of the separator in black (default color).\n. If I use the selectRow:inComponent:animated method of the pickerView (configured with the viewForRow), I have this behaviour:\n\nIn my code, I selected 10:16 and you can see the picker is not properly selected.\n. I have tested 0.9.7. Some issues have been fixed, thank you :-)\nHere are issues with GroupedTableView:\niOS6\n\niOS7\n\nAs you can see, there is a missing separator line under the title of the section. And the space between the title of the section and the first row of the section is too big.\nAnother problem is for UITableViewCell.accessoryType. If you select UITableViewCellAccessoryCheckmark, the checkmark is black. It should be blue by default.\nConcerning the pickerView, I still have the issue mentioned above (the rows not properly selected). I know that this controller is quite difficult to make and I appreciate all the efforts you have already made :-)\nYou don't have any idea on how to set the color of the navigationBar for the whole app?\n. Hi. Thanks for all the modifications.\nDid you have time to look at my issue with grouped tableview explained above and the one with the pickerview not selecting properly values?\nIf you need more info, please tell me.\nAfter that, everything will be perfect! :-)\n. Hi. I made some tests again and think I figured out what was wrong.\nConcerning my issue with the pickerView, I saw that I was selecting the date in the viewDidLoad. If I do it in the viewDidAppear, it works well. So, this problem is solved.\nConcerning the grouped tableview, the extra space (see my screenshot above) is only visible when I use the method - (UIView )tableView:(UITableView )tableView viewForHeaderInSection:(NSInteger)section\nPlease note, that in fact the extra space should be above the title and not under.\nThe top separator of the first cell of a section is not showing.\nFor your information, I am not using Storyboard in my app :-)\nThanks again for your help\n. It doesn't work only when the view is not pushed inside a navigationcontroller.\n. ",
    "tmcnab": ":+1: \n. ",
    "zgnecah": "same problem :(\nI added a date picker and an uitoolbar inside an action sheet, then the sheet only display the date picker...\n. ",
    "Morpheus2002": "I solved the problem with this class: https://github.com/pkh/PKHPickerContainerView\n. ",
    "willing8310": "[buttonSubmit setTitleColor:[UIColor redColor] forState:UIControlStateSelected];\nthis code  also does not work.\n. ",
    "sxsoul": "what's problem?It’s long time, forgot it!!!!                             原始邮件                             发件人: bumaociyuannotifications@github.com收件人: youknowone/UI7KitUI7Kit@noreply.github.com发送时间: 2014年12月5日(周五) 14:42主题: Re: [UI7Kit] [buttonSubmit setTitleColor:[UIColor redColor]forState:UIControlStateHighlighted]; (#117)I had the same problem\n—Reply to this email directly or view it on GitHub.\n. yeah, i used a image and tap event to implement                              原始邮件                             发件人: bumaociyuannotifications@github.com收件人: youknowone/UI7KitUI7Kit@noreply.github.com抄送: sxsoulsxsoul@163.com发送时间: 2014年12月5日(周五) 15:01主题: Re: [UI7Kit] [buttonSubmit setTitleColor:[UIColor redColor]forState:UIControlStateHighlighted]; (#117)[button setTitleColor:[UIColor redColor] forState:UIControlStateSelected];\n[button setTitleColor:[UIColor redColor] forState:UIControlStateHighlighted];\nboth not work\n—Reply to this email directly or view it on GitHub.\n. ",
    "icodesign": "Sorry to bother.It turns out that I didn't update to the latest version.\n. ",
    "postmechanical": "Add a search bar to the modally presented view controller and you get another issue. The search bar doesn't patch properly.\n\n. Another issue. If you do the following:\n[UI7Kit excludeClassNamesFromAutopatch:@[@\"UI7NavigationBar\"]];\n        [UI7Kit patchIfNeeded];\nThen an initial navigation view controller does not have its navigation bar patched, but any subsequently modally presented navigation view controller does have its navigation bar patched.\n. This may be an issue only in a modal view controller presented on an existing modal view controller.\n. This appears to be an issue with custom UINavigationController subclasses only.\n. ",
    "k06a": "My pull request: https://github.com/youknowone/UI7Kit/pull/129\nmakes this code:\nview.backgroundColor = [UIColor colorWithPatternImage:image];\nworks this way:\n\n. ",
    "ZuYuanZhou": "Thanks.\nOn 2013年11月27日, at 23:31, Jeong YunWon notifications@github.com wrote:\n\nFixed dependency. Retry please :)\n—\nReply to this email directly or view it on GitHub.\n. \n",
    "iasandcb": "Thanks for your work.\nCould you release 0.9.12 immediately?\nCheers\n2013/11/29 Jeong YunWon notifications@github.com\n\nClosed #132 https://github.com/youknowone/UI7Kit/issues/132 via 7830a19https://github.com/youknowone/UI7Kit/commit/7830a193db33edab488b49deb4e12ab107802766\n.\n—\nReply to this email directly or view it on GitHubhttps://github.com/youknowone/UI7Kit/issues/132\n.\n. Thanks for your work.\n\n2013/12/4 Jeong YunWon notifications@github.com\n\nI am sorry for late. 0.9.12 is released today.\n—\nReply to this email directly or view it on GitHubhttps://github.com/youknowone/UI7Kit/issues/132#issuecomment-29819069\n.\n. \n",
    "daaaarcy": "Problem solved, you have to set the separator explicitly, even though in iOS7 the separators are presented.\n. ",
    "HistoryZhang": "An other leak in function (There is an underline before the function.I can't show it.)\n    - (void)_navigationBarInit;\nSee it At\n    LINE // TODO:\n    - (void)_navigationBarInit {\n    [self setBarStyle:self.barStyle];\n```\nif ([self respondsToSelector:@selector(setShadowImage:)])\n    // TODO: \n    // Is [self setShadowImage:[[[UIImage alloc] init]] autorelease]; ??\n    [self setShadowImage:[[UIImage alloc] init]];\nUIGraphicsBeginImageContext(CGSizeMake(1.0, 3.0));\nCGContextRef context = UIGraphicsGetCurrentContext();\n[(UIColor )[UIColor colorWith8bitWhite:178 alpha:255] set];\nCGContextFillRect(context, CGRectMake(.0, 2.0, 1.0, 1.0));\nUIImage backgroundImage = UIGraphicsGetImageFromCurrentImageContext();\nUIGraphicsEndImageContext();\n[self setBackgroundImage:backgroundImage forBarMetrics:UIBarMetricsDefault];\n[self setBackgroundImage:backgroundImage forBarMetrics:UIBarMetricsLandscapePhone];\n```\n}\n. ",
    "ecstaticnate": "Hey,\nI am so sorry for the late response.\nAnyway, heres what I mean:\n\nSo what I am doing is having prototype table view cells, which are used to display these 3 cells. The cells have their text set in cellForRowAtIndexPath, yadayayayaya. In the storyboard, the table view is set to the grouped style. \nIt looks perfect from your screenshots, but it doesn't look very promising on my side. What would you like me to do in order to debug this? This component is not exactly vital for my app, but it would be very nice.\n. ",
    "mysticvalley": "Hey I am also having same issue in my UITableView grouped style after UI7Kit patch. Do you find any solution? I am using Xcode 5.0.2. any word would be highly appreciated. \n. I fixed this issue by changed the Background color of UITableView, View section to desired color other than \"Default\" color. After changing default color to any fixed color, both iOS 7 and iOS 6 devices were showing same color.\n. ",
    "thejaff": "Hi , I am facing the same problem , it seems like the issue is similar with using RESTKit , as explain from this post https://www.parse.com/questions/using-the-parse-ios-sdk-without-including-the-facebook-sdk\nParse recommend to use this -force_load   to resolve RESTKIT issue , i wonder can this help to solve the issue with UI7Kit here. If this can , Can help to recommend whats the   path should be which by referring to this link http://stackoverflow.com/questions/11254269/using-the-force-load-linker-flag-with-restkit-ios , it should be something like this (-force_load facebook-ios-sdk/lib/facebook-ios-sdk/libfacebook_ios_sdk.a -force_load $(BUILT_PRODUCTS_DIR)/libRestKit.a) ?\nThanks.\n. ",
    "xmkevinchen": "I've created a new pull request for the pod spec file, and one update for UI7SearchBar\n. ",
    "Whirlwind": "I have a pod :\npod 'NSLogger-CocoaLumberjack-connector', :configurations => ['Debug']\nWhen I build project under release configuration, the __has_include(\"DDNSLoggerLogger.h\") is true!!\n. ",
    "lilin87788": "\n. https://github.com/youknowone/UI7Kit/pull/157\nthis issues explain the error\n. pod 'UI7Kit', :git => 'https://github.com/youknowone/UI7Kit.git'\ndo this can  working for this issue(use recent version)\n. ",
    "deep8292": "Event after adding\n #if __has_include()\nimport \nendif\nI am having the below attached error\n\n. ",
    "artur7": "Hi. I have the same issue (file doesn't exist). Did you solve it?\n. Yes, it helped! Thanks.\n. ",
    "coolXin": "Find the source file\nYou must open the source file from the project\nthen modify \n//#ifdef COCOAPODS\nif __has_include( \"../Pods-environment.h\")\n//#else // no cocoapods, so enable everything\n. ",
    "ReDetection": "If you put these lines in CONTRIBUTING.md file then special notice will be shown in the issue creation dialog https://github.com/blog/1184-contributing-guidelines\n. "
}